{
    "data": [
        {
            "title": "Sonoro Gold Corp announces updated PEA for Cerro Caliche gold project: After-tax NPV of $224 million and IRR of 50%.",
            "id": "dabde74e-f1e1-402e-aa4b-126aa173f618",
            "description": "Sonoro Gold Corp. has released the findings of a recent report on its Cerro Caliche gold project in Sonora State, Mexico. The report outlines an independent updated Mineral Resource Estimate and updated Preliminary Economic Assessment. The assessment suggests the possibility of a ten-year life of mine for an open pit, heap leach mining operation. The operation would begin with a one-year ramp up production rate of 12,000 tonnes per day, eventually reaching 16,000 tpd for the rest of the life of mine. All figures are presented in USD. The company's stock ticker symbols are TSXV: SGO, OTCQB: SMOFF, and FRA: 23SP.",
            "link": "https://www.markets.news/headlines/dabde74e-f1e1-402e-aa4b-126aa173f618",
            "pub_date": "2026-02-28 21:01:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Faruqi & Faruqi, LLP investigates claims for Hub Group investors. Contact James Wilson to discuss losses.",
            "id": "a0edc407-75b1-4eea-b144-a8bbaa74a261",
            "description": "James (Josh) Wilson, Securities Litigation Partner at Faruqi & Faruqi, LLP, is extending an invitation to investors who have experienced substantial losses in Hub Group. If you have been affected by losses in Hub Group stocks or options and wish to explore your legal options, you are encouraged to reach out to him directly.",
            "link": "https://www.markets.news/headlines/a0edc407-75b1-4eea-b144-a8bbaa74a261",
            "pub_date": "2026-02-28 20:53:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investors of Beta Bionics facing significant losses urged to contact Faruqi & Faruqi, LLP for options.",
            "id": "cf842841-cabf-4f2d-a65a-8b624e1d6c5a",
            "description": "Investors who sustained substantial losses in Aquestive Therapeutics are urged by Securities Litigation Partner James (Josh) Wilson of Faruqi & Faruqi, LLP to reach out directly to explore potential options. If you experienced significant losses in Beta Bionics stock or options and wish to discuss further, please contact him at [contact information].",
            "link": "https://www.markets.news/headlines/cf842841-cabf-4f2d-a65a-8b624e1d6c5a",
            "pub_date": "2026-02-28 20:19:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investors in Wealthfront can contact Faruqi & Faruqi, LLP for significant losses in stock or options. Contact James Wilson for more info.",
            "id": "bedffe16-726b-4c47-ab4b-d061486f25ff",
            "description": "James (Josh) Wilson, Securities Litigation Partner at Faruqi & Faruqi, LLP, is urging investors who have experienced substantial losses in Wealthfront to reach out to him for a consultation on potential legal actions. If you have incurred significant losses in Wealthfront's stock or options and seek guidance on exploring available options, Wilson encourages direct contact for assistance.",
            "link": "https://www.markets.news/headlines/bedffe16-726b-4c47-ab4b-d061486f25ff",
            "pub_date": "2026-02-28 20:13:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Faruqi & Faruqi, LLP investigates claims for investors of Rezolute stock. Contact James Wilson for options after significant losses.",
            "id": "6b66efa5-4a2f-4be6-b0aa-8dcf8668ef13",
            "description": "Securities litigation partner James Wilson of Faruqi & Faruqi, LLP is urging investors who have experienced substantial losses in Rezolute to reach out to him directly. If you have been impacted by significant losses in Rezolute stocks or options, Wilson encourages you to contact him to explore potential legal remedies.",
            "link": "https://www.markets.news/headlines/6b66efa5-4a2f-4be6-b0aa-8dcf8668ef13",
            "pub_date": "2026-02-28 20:07:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Micron opens India’s first semiconductor facility in Sanand, Gujarat, expanding global presence and boosting India's tech industry.",
            "id": "8eceaed3-7287-4a9e-adbb-a2e3348fb1b2",
            "description": "Micron has established a cutting-edge facility in Sanand, Gujarat, enhancing its presence worldwide and boosting India's semiconductor industry. This state-of-the-art site signifies a significant expansion for Micron, showcasing their commitment to growth and innovation. Located in Sanand, Gujarat, the facility is set to play a pivotal role in advancing the semiconductor ecosystem in India. This development highlights Micron's dedication to investing in key regions, with a focus on technological advancements and global expansion.",
            "link": "https://www.markets.news/headlines/8eceaed3-7287-4a9e-adbb-a2e3348fb1b2",
            "pub_date": "2026-02-28 20:02:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MetaOptics Ltd reports 891% revenue growth year-on-year, with S$8.8 million cash position. Loss of S$5.4 million.",
            "id": "ebc1e8ff-c754-47d1-8df4-26d14fbb80fa",
            "description": "Singapore, February 28, 2026 - MetaOptics Ltd (Catalist: 9MT) has released its first financial report for the fiscal year ending December 31, 2025. The company, which went public in September 2025, reported an unaudited revenue of S$787,388 for 2025, showing a significant increase from S$79,440 in 2024. The gross profit also rose to S$159,826, up from S$26,569 in the previous year. However, MetaOptics incurred a loss after income tax and total comprehensive loss of S$5,445,573 in 2025, compared to S$1,950,882 in 2024. More details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/ebc1e8ff-c754-47d1-8df4-26d14fbb80fa",
            "pub_date": "2026-02-28 19:24:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "$4.2B in tokens linked to illicit activity frozen by Tether over 3 years. Stablecoin issuers assist in stopping suspicious funds.",
            "id": "21058e2c-b29a-4b63-9cef-ef73fa9da7dc",
            "description": "Stablecoin issuer Tether has frozen billions of USDt linked to fraudulent activities and money laundering, indicating a growing trend of authorities turning to stablecoin providers to stop illicit funds.",
            "link": "https://www.markets.news/headlines/21058e2c-b29a-4b63-9cef-ef73fa9da7dc",
            "pub_date": "2026-02-28 18:34:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Analysts suggest Netflix may benefit from exiting $83 billion deal with Warner Bros. Discovery.",
            "id": "321bed0e-1679-4c5d-926a-30d43fbca98f",
            "description": "Analysts suggest that Netflix may benefit from withdrawing from its $83 billion agreement with Warner Bros. Discovery.",
            "link": "https://www.markets.news/headlines/321bed0e-1679-4c5d-926a-30d43fbca98f",
            "pub_date": "2026-02-28 18:34:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros. employees facing grim news as they switch from Netflix to Paramount, expecting major layoffs.",
            "id": "02d118e5-c728-4a71-a46e-3d00d947643e",
            "description": "Workers at the company had begun to embrace Netflix as its parent company but now they are confronting the possibility of significant layoffs under Paramount.",
            "link": "https://www.markets.news/headlines/02d118e5-c728-4a71-a46e-3d00d947643e",
            "pub_date": "2026-02-28 18:34:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "QAnon believers find validation in Epstein files despite discrepancies with facts. Accuracy does not deter them.",
            "id": "6a777575-a019-4141-b30f-e256c9866ff5",
            "description": "The conspiracy theory, which has been circulating for almost ten years, does not match up with the information found in the documents. However, this discrepancy does not appear to be significant.",
            "link": "https://www.markets.news/headlines/6a777575-a019-4141-b30f-e256c9866ff5",
            "pub_date": "2026-02-28 18:34:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Discover 4 ways to maintain financial stability in retirement while enjoying your savings and avoiding financial troubles.",
            "id": "b65bb11a-d8b4-4817-a546-78485cf055c3",
            "description": "When regular pay stops, transitioning from saving to spending can be daunting. However, there are effective tactics to utilize your savings wisely and ensure its longevity.",
            "link": "https://www.markets.news/headlines/b65bb11a-d8b4-4817-a546-78485cf055c3",
            "pub_date": "2026-02-28 18:34:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "California Gold Nutrition Creatine named top choice for women by Consumer365 in 2026 review for clean formula and performance.",
            "id": "5991f3ac-9674-4887-838d-33b78023ff33",
            "description": "In its 2026 review, Consumer365 has acknowledged California Gold Nutrition Creatine as a top pick for women. The product stands out for its pure ingredients, clear production processes, and compliance with the latest findings on female well-being and performance. This recognition indicates the product is in line with the latest trends and standards in the industry.",
            "link": "https://www.markets.news/headlines/5991f3ac-9674-4887-838d-33b78023ff33",
            "pub_date": "2026-02-28 18:35:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KuCoin ranked top 3 in listing report by Animoca Brands Research, showing high activity in primary-market listings.",
            "id": "83aa5982-8ae5-4383-bbca-a63be32b0e85",
            "description": "In the latest 2025 Listing Report by Animoca Brands Research, KuCoin has secured a position in the top three cryptocurrency exchanges for total token listings. This achievement highlights KuCoin's active participation in primary-market listings. The report showcases the robust performance of KuCoin and its commitment to providing a diverse range of tokens to investors. The recognition underscores KuCoin's significant presence in the cryptocurrency exchange market.",
            "link": "https://www.markets.news/headlines/83aa5982-8ae5-4383-bbca-a63be32b0e85",
            "pub_date": "2026-02-28 18:35:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chongli in China seen through Milan's lens post Milano-Cortina 2026 Winter Olympics closing, marking legacy end.",
            "id": "ad705c29-56b4-469f-92af-b8b11710cf65",
            "description": "In Shijiazhuang, China, on February 28, 2026, a report from Great Wall New Media revealed that the Milano-Cortina 2026 Winter Olympics ended on February 23rd, Beijing time. The extinguishment of the Olympic flame on the Apennine Peninsula signaled the close of the 25th edition of the event.",
            "link": "https://www.markets.news/headlines/ad705c29-56b4-469f-92af-b8b11710cf65",
            "pub_date": "2026-02-28 18:35:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Conflux (CFX) v3.0.3 Testnet launched with CIP-166 and 7 bug fixes. Node operators can upgrade for new CLZ opcode & RPC enhancements.",
            "id": "149ff152-4faf-4236-b5c7-bb0b71e54a26",
            "description": "The Conflux (CFX) Network has released a new testnet upgrade, version 3.0.3, which includes several key features. These enhancements consist of the introduction of the new CLZ opcode, addressing seven bug fixes, and improving RPC functionality. Node operators now have the option to upgrade to this latest version.",
            "link": "https://www.markets.news/headlines/149ff152-4faf-4236-b5c7-bb0b71e54a26",
            "pub_date": "2026-02-28 17:32:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LDO price may see reversal, with support at $0.26 and targets $0.31-$0.33 short-term, $0.26-$0.44 medium-term. Bullish at $0.33.",
            "id": "677a662f-9ba4-4683-bb8e-c7bd582d8e98",
            "description": "Summary of LDO Price Prediction: In the short term (1 week), the price target is between $0.31 and $0.33. Looking ahead to the medium term (1 month), the forecasted range is $0.26 to $0.44. A bullish breakout is expected at $0.33, while the critical support level stands at $0.26.",
            "link": "https://www.markets.news/headlines/677a662f-9ba4-4683-bb8e-c7bd582d8e98",
            "pub_date": "2026-02-28 17:32:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hedera's HBAR may hit $0.11 resistance by March 2026, currently trading at $0.094 with RSI at 44.88. MACD shows bearish signals.",
            "id": "5735fcce-7e61-4bf7-b7de-7217292659a1",
            "description": "The cryptocurrency HBAR is currently trading at $0.094 with a neutral Relative Strength Index (RSI) of 44.88. Technical analysis indicates a possible increase to the $0.11 resistance level. However, bearish signals from the Moving Average Convergence Divergence (MACD) indicator raise caution for investors in Hedera, suggesting a possible downturn.",
            "link": "https://www.markets.news/headlines/5735fcce-7e61-4bf7-b7de-7217292659a1",
            "pub_date": "2026-02-28 17:27:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PEPE price shows bearish signs in March as RSI drops to 35.21 and MACD signals turn negative. Key support levels may be tested by March 2026.",
            "id": "ad7b2903-5098-4567-a8dd-d63eb2534422",
            "description": "PEPE is currently experiencing a downward trend as indicated by its Relative Strength Index (RSI) at 35.21 and negative Moving Average Convergence Divergence (MACD) signals. Analysts predict a potential decrease in value with the possibility of testing key support levels in March 2026.",
            "link": "https://www.markets.news/headlines/ad7b2903-5098-4567-a8dd-d63eb2534422",
            "pub_date": "2026-02-28 17:18:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Peter Schiff warns Bitcoin is overvalued at $65,000, urges investors to sell. Says holders are delusional. Full story at Benzinga.com.",
            "id": "3c933ecb-a3b5-4f0b-970a-015c6c571bb8",
            "description": "Bitcoin (BTC) is currently trading close to the $65,000 mark, as veteran crypto critic Peter Schiff has reiterated his negative stance on the leading cryptocurrency. Schiff advised investors to exit their positions while they still have the chance, as he believes the market is offering ample opportunity to sell above $65,000. Despite acknowledging Bitcoin's significant growth over the past decade, Schiff cautioned that many holders have unrealistic expectations about its future performance. He expressed his skepticism on Bitcoin reaching new highs and predicted that those who remain optimistic will sustain losses. Schiff shared his views on X platform, emphasizing that the current price is a favorable opportunity to cash out, considering Bitcoin's much lower value a decade ago. For further details, the complete article can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/3c933ecb-a3b5-4f0b-970a-015c6c571bb8",
            "pub_date": "2026-02-28 17:20:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}