{
    "data": [
        {
            "title": "21Shares Sui ETF (NASDAQ: TSUI) offers exposure to SUI token, issued by 21Shares, cleared by U.S. SEC, giving access to Sui blockchain. U.S. market expanding with direct access to SUI in brokerage accounts. Sui is a Layer 1 blockchain for payments and financial apps.",
            "id": "b0c16c44-f575-445c-9216-19dfff459d40",
            "description": "This week, the 21Shares Sui ETF (NASDAQ: TSUI) became available for trading, offering direct exposure to the SUI token (CRYPTO: SUI). This is among the initial U.S.-listed products associated with the rapidly expanding Sui blockchain network. Issued by 21Shares, the ETF received regulatory approval from the U.S. SEC. Investors can now access SUI through traditional brokerage accounts, bypassing the need for crypto exchanges. The ETF tracks SUI's market price on a spot basis, directly impacting its performance. The launch of this ETF enables greater U.S. participation in Sui, a Layer 1 blockchain known for its role in payment and financial applications. While Europe has seen a proliferation of crypto-linked ETFs, the U.S. market has been more selective, especially for spot products linked to alternative tokens beyond SUI. This development expands investment opportunities in the crypto sector.",
            "link": "https://www.markets.news/headlines/b0c16c44-f575-445c-9216-19dfff459d40",
            "pub_date": "2026-02-28 05:03:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin is near $65,000, could rally to low $70k range. Crypto analyst predicts March target of $74,000.",
            "id": "53d05607-1d64-430f-a36d-9c607e4fd186",
            "description": "Bitcoin is currently trading around $65,000, with historical trends from previous midterm years indicating a potential rally towards the low $70,000 range. Crypto analyst Benjamin Cowen highlighted that Bitcoin is mirroring behavioural patterns observed in midterm years like 2014, 2018, and 2022. These patterns typically show a local low in February, followed by a rally into early March before another downturn. For instance, in 2014 Bitcoin hit a bottom on Feb. 25, surged until March 3, then declined into April. Similarly, in 2018, it bottomed on Feb. 6, peaked on March 5, and fell into April. This pattern suggests a potential upcoming rise in Bitcoin’s price, as seen in previous midterm years. For more details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/53d05607-1d64-430f-a36d-9c607e4fd186",
            "pub_date": "2026-02-28 05:03:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RBC Bearings (NYSE: RBC) to attend investor conferences at Orlando & London; dates: March 4, 2026.",
            "id": "7871d429-cb7b-4ee2-bafb-6a51e47c8a26",
            "description": "In Oxford, Conn., RBC Bearings Incorporated (NYSE: RBC), a prominent global manufacturer of precision bearings, components, and systems for industrial, defense, and aerospace sectors, revealed its upcoming presence at key investor events. The company will take part in the Raymond James Institutional Investors Conference at JW Marriott Orlando Grande Lakes in Orlando, FL on March 4, 2026. Additionally, they will participate in the Bank of America Global Industrials Conference at the Landmark Hotel in London on the same day. This move showcases their commitment to engaging with investors and industry players.",
            "link": "https://www.markets.news/headlines/7871d429-cb7b-4ee2-bafb-6a51e47c8a26",
            "pub_date": "2026-02-28 05:04:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NurExone to present at NANO.IL.2026 and Advanced Therapies Congress in March 2026, developing regenerative exosome therapies. (Numbers: NRX stock, OTCQB: NRXBF, FSE: J90)",
            "id": "fdb6cabf-ce6a-4566-a531-6679225fd7ca",
            "description": "Toronto-based biopharmaceutical company NurExone Biologic Inc. (TSXV: NRX) (OTCQB: NRXBF) (FSE: J90) revealed on February 27, 2026, its involvement in two upcoming international conferences scheduled for March 2026. NurExone is focused on developing regenerative therapies based on exosomes.",
            "link": "https://www.markets.news/headlines/fdb6cabf-ce6a-4566-a531-6679225fd7ca",
            "pub_date": "2026-02-28 05:04:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e500428f-f3e9-4038-b968-b4c4c2d47c0f",
            "description": "PARAMOUNT SKYDANCE SHARES CLOSE UP 21%, MOST SINCE AUGUST",
            "link": "https://www.markets.news/headlines/e500428f-f3e9-4038-b968-b4c4c2d47c0f",
            "pub_date": "2026-02-28 05:04:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "095a3fa3-8728-4916-b27c-cb6fbd24afb7",
            "description": "NETFLIX CLOSES UP 14% FOR BEST DAY SINCE OCTOBER 2023",
            "link": "https://www.markets.news/headlines/095a3fa3-8728-4916-b27c-cb6fbd24afb7",
            "pub_date": "2026-02-28 05:04:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f12025cc-92f8-428b-a65b-2b13c751a418",
            "description": "DELL TECHNOLOGIES JUMPS 22% IN BEST DAY SINCE MARCH 2024",
            "link": "https://www.markets.news/headlines/f12025cc-92f8-428b-a65b-2b13c751a418",
            "pub_date": "2026-02-28 05:04:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3d77cefc-ac76-4985-827c-e4f5fee6f2ae",
            "description": "KBW BANK INDEX CLOSES DOWN 4.9% IN BIGGEST DROP SINCE APRIL",
            "link": "https://www.markets.news/headlines/3d77cefc-ac76-4985-827c-e4f5fee6f2ae",
            "pub_date": "2026-02-28 05:04:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1e0c59a2-f5b9-44af-8a17-0ba9e363e945",
            "description": "US President Trump On SCOTUS Tariff Ruling: Is a Rehearing or Readjudication of this case possible??? – TSL truthsocial.com/@realDonaldT...",
            "link": "https://www.markets.news/headlines/1e0c59a2-f5b9-44af-8a17-0ba9e363e945",
            "pub_date": "2026-02-28 05:06:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d9aa4fd6-9e6c-4eb8-8c97-7c42b4705886",
            "description": "MOC Imbalance S&P 500: +2720 mln Nasdaq 100: +364 mln Dow 30: +1054 mln Mag 7: -545 mln",
            "link": "https://www.markets.news/headlines/d9aa4fd6-9e6c-4eb8-8c97-7c42b4705886",
            "pub_date": "2026-02-28 04:52:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FDA approves Novo Nordisk's Sogroya®, a weekly growth hormone, for 3 new pediatric conditions, for kids 2.5+ years.",
            "id": "64804ecd-5341-4a66-85b3-d6ad497dea24",
            "description": "New treatment options have expanded for children aged 2.5 years and older with Idiopathic Short Stature (ISS), Small for Gestational Age (SGA) conditions, or Noonan Syndrome (NS). Sogroya® (somapacitan-beco) is a once-weekly treatment choice for these conditions. This provides an alternative for appropriate children in need of care, with benefits for approximately 1-3% of children experiencing these conditions.",
            "link": "https://www.markets.news/headlines/64804ecd-5341-4a66-85b3-d6ad497dea24",
            "pub_date": "2026-02-28 04:55:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NUNM receives $1.5M gift from alumnus to expand campus and support integrative medicine.",
            "id": "433d160d-d111-44c3-8e81-4ca0996cff8e",
            "description": "In Portland, Oregon, on February 27, 2026, the National University of Natural Medicine (NUNM) announced a generous donation of $1.5 million from Dr. Noel Peterson, an alumnus from the class of '78, and his wife Teresa Shelley. The donation is aimed at facilitating the expansion of the campus and advancing the field of integrative medical education and clinical practices.",
            "link": "https://www.markets.news/headlines/433d160d-d111-44c3-8e81-4ca0996cff8e",
            "pub_date": "2026-02-28 04:56:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enrollment is open for K12-powered virtual public schools in Missouri, serving students state-wide with full-time programs and state-certified teachers.",
            "id": "4501cb8c-f2d3-4efa-b67d-5077cb0e8993",
            "description": "Families in Missouri have the opportunity to enroll in full-time virtual public school programs that are powered by K12 and led by state-certified teachers. This initiative allows families in Missouri to access high-quality education from the comfort of their own homes. The program ensures that students receive instruction from qualified teachers while following the state curriculum. By enrolling in these virtual public school programs, families can have the flexibility to customize their education while maintaining the same standards as traditional schools. This provides families in Missouri with an innovative and accessible option for their children's education.",
            "link": "https://www.markets.news/headlines/4501cb8c-f2d3-4efa-b67d-5077cb0e8993",
            "pub_date": "2026-02-28 04:56:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enrollment now open for K12-powered virtual public schools in Ohio. State-certified teachers leading programs.",
            "id": "01362be9-893f-4957-b25d-318bc22fd346",
            "description": "Families in Ohio now have the opportunity to enroll in full-time virtual public school programs facilitated by state-certified teachers. This initiative allows families to access education remotely through K12-powered programs. The virtual school option ensures that students receive guidance and instruction from qualified educators while learning from home. This program offers a flexible and personalized approach to education, catering to the individual needs of students. Families can enroll their children in full-time virtual schooling to provide a structured learning environment that meets state standards.",
            "link": "https://www.markets.news/headlines/01362be9-893f-4957-b25d-318bc22fd346",
            "pub_date": "2026-02-28 04:57:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nike announces it will release Q3 fiscal 2026 earnings on March 31, 2026, at 1:15 p.m. PT, with a conference call at 2:00 p.m. PT.",
            "id": "65636ed6-036f-4405-837f-b07bd6cad52e",
            "description": "In order to adjust for upcoming holidays, NIKE, Inc. (NYSE: NKE) has rescheduled the release of its third quarter fiscal 2026 financial results to Tuesday, March 31, 2026, at around 1:15 p.m. PT, after the regular stock market trading hours. Following the announcement, NIKE, Inc. management will conduct a conference call starting at 2:00 p.m. PT to discuss the results. The conference call will be streamed live online and is accessible at the given web address.",
            "link": "https://www.markets.news/headlines/65636ed6-036f-4405-837f-b07bd6cad52e",
            "pub_date": "2026-02-28 05:00:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "27c98cdc-1db9-4e35-bfa6-e04466877a63",
            "description": "ZELENSKIY: BRIEFED RUTTE ON MEETINGS WITH AMERICAN SIDE",
            "link": "https://www.markets.news/headlines/27c98cdc-1db9-4e35-bfa6-e04466877a63",
            "pub_date": "2026-02-28 04:46:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ac6bfa99-072d-458c-a3af-ae31637670ab",
            "description": "ZELENSKIY: SPOKE WITH NATO'S RUTTE",
            "link": "https://www.markets.news/headlines/ac6bfa99-072d-458c-a3af-ae31637670ab",
            "pub_date": "2026-02-28 04:46:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Generational Group advises JMPE Electrical Engineering's sale to Agathos AEC, a Hunter Forest Capital portfolio company.",
            "id": "77baa23d-4e63-4fa2-bfb5-bf039efad0e4",
            "description": "A mergers and acquisitions advisory firm, Generational Group, recently facilitated the sale of JMPE Electrical Engineering to Agathos AEC, a company under Hunter Forest Capital, for an undisclosed amount. The deal was finalized on February 2, 2026. JMPE Electrical Engineering, headquartered in Santa Barbara, California, is known for its comprehensive electrical engineering and lighting design services catering to various clients in the commercial, industrial, government, and residential sectors.",
            "link": "https://www.markets.news/headlines/77baa23d-4e63-4fa2-bfb5-bf039efad0e4",
            "pub_date": "2026-02-28 04:47:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c21093fe-a1f3-43d4-9842-bfaea8f7baf2",
            "description": "TRUMP: I AM DIRECTING EVERY FEDERAL AGENCY IN UNITED STATES GOVERNMENT TO IMMEDIATELY CEASE ALL USE OF ANTHROPIC'S TECHNOLOGY",
            "link": "https://www.markets.news/headlines/c21093fe-a1f3-43d4-9842-bfaea8f7baf2",
            "pub_date": "2026-02-28 04:49:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "243ed45e-07da-43ae-adca-9d770f95141d",
            "description": "TRUMP: THERE WILL BE A SIX MONTH PHASE OUT PERIOD FOR AGENCIES LIKE DEPARTMENT OF WAR WHO ARE USING ANTHROPIC'S PRODUCTS",
            "link": "https://www.markets.news/headlines/243ed45e-07da-43ae-adca-9d770f95141d",
            "pub_date": "2026-02-28 04:49:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}