{
    "data": [
        {
            "title": "Tevogen considers acquiring a Contract Research Organization to boost clinical development capabilities and revenue growth.",
            "id": "d14577d4-e2bc-44ab-bd2b-7acfb0a8f088",
            "description": "In Warren, New Jersey on February 27, 2026, Tevogen Bio Holdings Inc. (Nasdaq: TVGN) disclosed its agreement to assess a potential transaction with a renowned global Contract Research Organization (CRO) through a signed non-exclusive, non-binding Letter of Intent (LoI). This move has the potential to broaden Tevogen's clinical development capacities, potentially transitioning the Company into a revenue-generating healthcare entity.",
            "link": "https://www.markets.news/headlines/d14577d4-e2bc-44ab-bd2b-7acfb0a8f088",
            "pub_date": "2026-02-28 03:21:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0ddb43c4-e505-47c3-a873-38e1333fb4df",
            "description": "PARAMOUNT LOOKS FORWARD TO CONSTRUCTIVE ENGAGEMENT WITH U.S. STATE ATTORNEYS GENERAL AND OTHER REGULATORS, SPOKESPERSON SAYS",
            "link": "https://www.markets.news/headlines/0ddb43c4-e505-47c3-a873-38e1333fb4df",
            "pub_date": "2026-02-28 03:23:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "cc314050-6f19-412d-9d3a-adb44b173a28",
            "description": "GPA IN TALKS FOR BRL900M DEBT ROLLOVER WITH HOLDERS: VALOR",
            "link": "https://www.markets.news/headlines/cc314050-6f19-412d-9d3a-adb44b173a28",
            "pub_date": "2026-02-28 03:23:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d129d7ba-4624-4161-82a0-0bdd8b874671",
            "description": "GOP LAWMAKERS TELL TRUMP ADMIN. TO REJECT UK'S CHAGOS DEAL: WSJ",
            "link": "https://www.markets.news/headlines/d129d7ba-4624-4161-82a0-0bdd8b874671",
            "pub_date": "2026-02-28 03:25:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sportstech denies responsibility for TRNR reverse split, operations stable, unaffected. ",
            "id": "08a89db8-8143-4e0a-b26c-7dd8215df5ab",
            "description": "Sportstech has stated that it is not accountable for TRNR's reverse split and assures that its operations continue to be steady and unharmed.",
            "link": "https://www.markets.news/headlines/08a89db8-8143-4e0a-b26c-7dd8215df5ab",
            "pub_date": "2026-02-28 03:16:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tech and Bitcoin surge as markets rally ahead of Nvidia earnings. Nasdaq up 1.2% to 25,280, S&P 500 rises 0.7%, Dow up 0.6%. Software stocks top performer with Salesforce set to report. CAVA Group up 25.05%, Everus Construction up 31.58%. Technology and Financials lead gains. Energy and Consumer Staples lag. (Total characters: 300)",
            "id": "24340819-70dd-449e-bf6b-48333a519adf",
            "description": "Investor confidence rebounded on Wednesday as they flocked to stocks and cryptocurrencies ahead of Nvidia Corp.'s highly awaited earnings report after market close. The Nasdaq 100 surged by 1.2% to 25,280 points, driven by gains in large-cap tech and AI-related companies. The S&P 500 also saw a 0.7% increase, reaching 6,941.26, trading slightly below its all-time highs. The Dow Jones Industrial Average experienced a 0.6% rise, while small-cap stocks, represented by the Russell 2000, saw a more modest 0.2% gain. Software companies continued their recovery for a second consecutive day, emerging as the top-performing sector. Salesforce Inc., which has faced around a 25% decline year-to-date, was also scheduled to report its earnings post-market. As of 12:45 p.m. in New York, the market momentum predominantly favored growth stocks, with Technology and Financials leading the gains, while Energy and Consumer Staples lagged. Notable earnings performers included CAVA Group, Inc. leaping by 25.05%, and Everus Construction Group, Inc. advancing by 31.58%. Conversely, GoDaddy Inc. experienced a decline. For more details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/24340819-70dd-449e-bf6b-48333a519adf",
            "pub_date": "2026-02-28 03:16:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oligo Security integrates AI Security with AWS Security Hub Extended Plan for real-time AI protection on AWS.",
            "id": "8879aaa8-6605-4a53-88f0-4559fdda8845",
            "description": "Based in Tel Aviv, Israel, Oligo Security, a company specializing in runtime security solutions, recently revealed the integration of Oligo Runtime AI Security with the Extended plan in AWS Security Hub by Amazon Web Services. This partnership offers clients immediate visibility and active defense mechanisms for AI implementations on AWS. It presents a seamless experience under one vendor, simplifying processes with a unified contract, billing, support, and adaptable pricing through AWS. The integration aims to enhance security measures for AI deployments across AWS with real-time monitoring and protection.",
            "link": "https://www.markets.news/headlines/8879aaa8-6605-4a53-88f0-4559fdda8845",
            "pub_date": "2026-02-28 03:16:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Precision Drilling Corporation now dual-listed on NYSE Texas, expanding reach for common shares, effective February 27.",
            "id": "0d92a774-4d2e-45e7-b83f-86e265e08bc0",
            "description": "Precision Drilling Corporation, based in Calgary, Alberta, disclosed on February 27, 2026, that its common shares (TSX: PD; NYSE: PDS) have received authorization for dual listing on NYSE Texas. NYSE Texas is a digital equities exchange located in Dallas, Texas, established in March 2025.",
            "link": "https://www.markets.news/headlines/0d92a774-4d2e-45e7-b83f-86e265e08bc0",
            "pub_date": "2026-02-28 03:16:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "95e22d73-f29a-4ce7-8030-79b11fc7bbad",
            "description": "TRUMP: CUBA IS IN BIG TROUBLE",
            "link": "https://www.markets.news/headlines/95e22d73-f29a-4ce7-8030-79b11fc7bbad",
            "pub_date": "2026-02-28 03:17:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Paley Museum partners with NYC Department of Social Services to offer free access to 1.4M New Yorkers.",
            "id": "c723246d-1ae0-4f34-be7d-34b5f950a011",
            "description": "The Paley Museum in partnership with the New York City Department of Social Services has launched a significant initiative offering free access to 1.4 million residents of New York City. This collaboration aims to provide the opportunity for individuals to explore the iconic museum which showcases a blend of media, sports, gaming, and entertainment. The announcement was made in New York on Feb. 27, 2026.",
            "link": "https://www.markets.news/headlines/c723246d-1ae0-4f34-be7d-34b5f950a011",
            "pub_date": "2026-02-28 03:17:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e3429d2e-bfaa-4f0c-9cb0-279f08ca3858",
            "description": "US 2-YEAR YIELD FALLS BELOW 3.38% TO LOWEST SINCE OCT. 17",
            "link": "https://www.markets.news/headlines/e3429d2e-bfaa-4f0c-9cb0-279f08ca3858",
            "pub_date": "2026-02-28 03:18:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "32f78135-7067-4608-b294-67914784ecd3",
            "description": "2025's second half and full-year report show promising growth with revenue up by 15% to $500 million.",
            "link": "https://www.markets.news/headlines/32f78135-7067-4608-b294-67914784ecd3",
            "pub_date": "2026-02-28 03:15:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. economy grew modestly at end of 2025, with GDP expanding at 1.4% annual rate in Q4 due to government shutdown.",
            "id": "c2341eba-df00-482b-8582-41541bb53eef",
            "description": "The national economy experienced a 1.4% growth rate in the final quarter of the year, primarily influenced by the ramifications of the government shutdown.",
            "link": "https://www.markets.news/headlines/c2341eba-df00-482b-8582-41541bb53eef",
            "pub_date": "2026-02-28 03:15:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "In 2025, goods trade deficit hit all-time high, despite overall trade deficit narrowing due to increased services surplus.",
            "id": "5f1f265c-981e-47cd-8f0e-c807bf3e0463",
            "description": "On Thursday, the Census Bureau revealed that the total trade deficit with the world decreased due to a growing trade surplus in services. However, the trade deficit in goods reached a record high. The data indicates a significant shift in trade dynamics, with the goods deficit standing out as particularly noteworthy.",
            "link": "https://www.markets.news/headlines/5f1f265c-981e-47cd-8f0e-c807bf3e0463",
            "pub_date": "2026-02-28 03:15:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "W&T Offshore (NYSE: WTI) to release Q4 and full year 2025 earnings, with conference call on Feb 27, 2026 in Houston.",
            "id": "0dbb047a-8c04-4e31-9bdf-5b2f64bb0198",
            "description": "Houston-based company W&T Offshore, Inc. (NYSE: WTI) has disclosed the schedule for its earnings release and conference call for the fourth quarter and full year of 2025. The announcement was made today, on February 27, 2026. This update provides investors and stakeholders with important financial information about the company's performance during that period. Shareholders and interested parties are encouraged to participate in the conference call to gain insights into the earnings report.",
            "link": "https://www.markets.news/headlines/0dbb047a-8c04-4e31-9bdf-5b2f64bb0198",
            "pub_date": "2026-02-28 03:15:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump considers forming a trade pact with Mexico, excluding Canada. It may bring significant changes. (Character count: 95)",
            "id": "7f18b9b0-9ad4-4781-a9a4-8e5757776fc1",
            "description": "American authorities are considering significant alterations to a trade deal involving Mexico and Canada that could revolutionize business practices and potentially isolate Canada from the agreement.",
            "link": "https://www.markets.news/headlines/7f18b9b0-9ad4-4781-a9a4-8e5757776fc1",
            "pub_date": "2026-02-28 03:15:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Federal Reserve may continue to hold rates steady amid strong labor market and inflation. No rush to restart rate cuts.",
            "id": "89c678e9-6f20-40fd-992f-0df7aebff875",
            "description": "Unless there is a sharp decline in the labor market or a notable decrease in inflation, it seems likely that the Federal Reserve will maintain its current position for an extended period.",
            "link": "https://www.markets.news/headlines/89c678e9-6f20-40fd-992f-0df7aebff875",
            "pub_date": "2026-02-28 03:15:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Presurance Holdings closed its rights offering as detailed in Form 8-K on Jan 28, 2026. ",
            "id": "fb7a0275-6e48-4054-98bf-752731b7250c",
            "description": "TROY, Michigan - On February 27, 2026, Presurance Holdings, Inc. (Nasdaq: PRHI) concluded its rights offering as mentioned in the Current Report on Form 8-K filed on January 28, 2026. The offering saw significant participation from investors, showcasing a strong interest in the company's future prospects.",
            "link": "https://www.markets.news/headlines/fb7a0275-6e48-4054-98bf-752731b7250c",
            "pub_date": "2026-02-28 03:15:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jamieson Greer, a discreet lawyer, is reshaping global economy at president's request.",
            "id": "54efc1e5-fbf9-4e00-baa6-39e3798adb96",
            "description": "Jamieson Greer, a humble lawyer from a modest upbringing, has been tasked by the president to reshape the dynamics of the worldwide economy.",
            "link": "https://www.markets.news/headlines/54efc1e5-fbf9-4e00-baa6-39e3798adb96",
            "pub_date": "2026-02-28 03:15:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "00de6701-0ac6-4807-ae49-84af7d5f4954",
            "description": "Company buyback: Purchased 10,000 shares for $100,000.",
            "link": "https://www.markets.news/headlines/00de6701-0ac6-4807-ae49-84af7d5f4954",
            "pub_date": "2026-02-28 03:15:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}