{
    "data": [
        {
            "title": "Sportstech denies responsibility for TRNR reverse split, operations stable, unaffected. ",
            "id": "08a89db8-8143-4e0a-b26c-7dd8215df5ab",
            "description": "Sportstech has stated that it is not accountable for TRNR's reverse split and assures that its operations continue to be steady and unharmed.",
            "link": "https://www.markets.news/headlines/08a89db8-8143-4e0a-b26c-7dd8215df5ab",
            "pub_date": "2026-02-28 03:16:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tech and Bitcoin surge as markets rally ahead of Nvidia earnings. Nasdaq up 1.2% to 25,280, S&P 500 rises 0.7%, Dow up 0.6%. Software stocks top performer with Salesforce set to report. CAVA Group up 25.05%, Everus Construction up 31.58%. Technology and Financials lead gains. Energy and Consumer Staples lag. (Total characters: 300)",
            "id": "24340819-70dd-449e-bf6b-48333a519adf",
            "description": "Investor confidence rebounded on Wednesday as they flocked to stocks and cryptocurrencies ahead of Nvidia Corp.'s highly awaited earnings report after market close. The Nasdaq 100 surged by 1.2% to 25,280 points, driven by gains in large-cap tech and AI-related companies. The S&P 500 also saw a 0.7% increase, reaching 6,941.26, trading slightly below its all-time highs. The Dow Jones Industrial Average experienced a 0.6% rise, while small-cap stocks, represented by the Russell 2000, saw a more modest 0.2% gain. Software companies continued their recovery for a second consecutive day, emerging as the top-performing sector. Salesforce Inc., which has faced around a 25% decline year-to-date, was also scheduled to report its earnings post-market. As of 12:45 p.m. in New York, the market momentum predominantly favored growth stocks, with Technology and Financials leading the gains, while Energy and Consumer Staples lagged. Notable earnings performers included CAVA Group, Inc. leaping by 25.05%, and Everus Construction Group, Inc. advancing by 31.58%. Conversely, GoDaddy Inc. experienced a decline. For more details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/24340819-70dd-449e-bf6b-48333a519adf",
            "pub_date": "2026-02-28 03:16:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oligo Security integrates AI Security with AWS Security Hub Extended Plan for real-time AI protection on AWS.",
            "id": "8879aaa8-6605-4a53-88f0-4559fdda8845",
            "description": "Based in Tel Aviv, Israel, Oligo Security, a company specializing in runtime security solutions, recently revealed the integration of Oligo Runtime AI Security with the Extended plan in AWS Security Hub by Amazon Web Services. This partnership offers clients immediate visibility and active defense mechanisms for AI implementations on AWS. It presents a seamless experience under one vendor, simplifying processes with a unified contract, billing, support, and adaptable pricing through AWS. The integration aims to enhance security measures for AI deployments across AWS with real-time monitoring and protection.",
            "link": "https://www.markets.news/headlines/8879aaa8-6605-4a53-88f0-4559fdda8845",
            "pub_date": "2026-02-28 03:16:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Precision Drilling Corporation now dual-listed on NYSE Texas, expanding reach for common shares, effective February 27.",
            "id": "0d92a774-4d2e-45e7-b83f-86e265e08bc0",
            "description": "Precision Drilling Corporation, based in Calgary, Alberta, disclosed on February 27, 2026, that its common shares (TSX: PD; NYSE: PDS) have received authorization for dual listing on NYSE Texas. NYSE Texas is a digital equities exchange located in Dallas, Texas, established in March 2025.",
            "link": "https://www.markets.news/headlines/0d92a774-4d2e-45e7-b83f-86e265e08bc0",
            "pub_date": "2026-02-28 03:16:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "95e22d73-f29a-4ce7-8030-79b11fc7bbad",
            "description": "TRUMP: CUBA IS IN BIG TROUBLE",
            "link": "https://www.markets.news/headlines/95e22d73-f29a-4ce7-8030-79b11fc7bbad",
            "pub_date": "2026-02-28 03:17:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Paley Museum partners with NYC Department of Social Services to offer free access to 1.4M New Yorkers.",
            "id": "c723246d-1ae0-4f34-be7d-34b5f950a011",
            "description": "The Paley Museum in partnership with the New York City Department of Social Services has launched a significant initiative offering free access to 1.4 million residents of New York City. This collaboration aims to provide the opportunity for individuals to explore the iconic museum which showcases a blend of media, sports, gaming, and entertainment. The announcement was made in New York on Feb. 27, 2026.",
            "link": "https://www.markets.news/headlines/c723246d-1ae0-4f34-be7d-34b5f950a011",
            "pub_date": "2026-02-28 03:17:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e3429d2e-bfaa-4f0c-9cb0-279f08ca3858",
            "description": "US 2-YEAR YIELD FALLS BELOW 3.38% TO LOWEST SINCE OCT. 17",
            "link": "https://www.markets.news/headlines/e3429d2e-bfaa-4f0c-9cb0-279f08ca3858",
            "pub_date": "2026-02-28 03:18:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "32f78135-7067-4608-b294-67914784ecd3",
            "description": "2025's second half and full-year report show promising growth with revenue up by 15% to $500 million.",
            "link": "https://www.markets.news/headlines/32f78135-7067-4608-b294-67914784ecd3",
            "pub_date": "2026-02-28 03:15:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. economy grew modestly at end of 2025, with GDP expanding at 1.4% annual rate in Q4 due to government shutdown.",
            "id": "c2341eba-df00-482b-8582-41541bb53eef",
            "description": "The national economy experienced a 1.4% growth rate in the final quarter of the year, primarily influenced by the ramifications of the government shutdown.",
            "link": "https://www.markets.news/headlines/c2341eba-df00-482b-8582-41541bb53eef",
            "pub_date": "2026-02-28 03:15:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "In 2025, goods trade deficit hit all-time high, despite overall trade deficit narrowing due to increased services surplus.",
            "id": "5f1f265c-981e-47cd-8f0e-c807bf3e0463",
            "description": "On Thursday, the Census Bureau revealed that the total trade deficit with the world decreased due to a growing trade surplus in services. However, the trade deficit in goods reached a record high. The data indicates a significant shift in trade dynamics, with the goods deficit standing out as particularly noteworthy.",
            "link": "https://www.markets.news/headlines/5f1f265c-981e-47cd-8f0e-c807bf3e0463",
            "pub_date": "2026-02-28 03:15:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "W&T Offshore (NYSE: WTI) to release Q4 and full year 2025 earnings, with conference call on Feb 27, 2026 in Houston.",
            "id": "0dbb047a-8c04-4e31-9bdf-5b2f64bb0198",
            "description": "Houston-based company W&T Offshore, Inc. (NYSE: WTI) has disclosed the schedule for its earnings release and conference call for the fourth quarter and full year of 2025. The announcement was made today, on February 27, 2026. This update provides investors and stakeholders with important financial information about the company's performance during that period. Shareholders and interested parties are encouraged to participate in the conference call to gain insights into the earnings report.",
            "link": "https://www.markets.news/headlines/0dbb047a-8c04-4e31-9bdf-5b2f64bb0198",
            "pub_date": "2026-02-28 03:15:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump considers forming a trade pact with Mexico, excluding Canada. It may bring significant changes. (Character count: 95)",
            "id": "7f18b9b0-9ad4-4781-a9a4-8e5757776fc1",
            "description": "American authorities are considering significant alterations to a trade deal involving Mexico and Canada that could revolutionize business practices and potentially isolate Canada from the agreement.",
            "link": "https://www.markets.news/headlines/7f18b9b0-9ad4-4781-a9a4-8e5757776fc1",
            "pub_date": "2026-02-28 03:15:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Federal Reserve may continue to hold rates steady amid strong labor market and inflation. No rush to restart rate cuts.",
            "id": "89c678e9-6f20-40fd-992f-0df7aebff875",
            "description": "Unless there is a sharp decline in the labor market or a notable decrease in inflation, it seems likely that the Federal Reserve will maintain its current position for an extended period.",
            "link": "https://www.markets.news/headlines/89c678e9-6f20-40fd-992f-0df7aebff875",
            "pub_date": "2026-02-28 03:15:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Presurance Holdings closed its rights offering as detailed in Form 8-K on Jan 28, 2026. ",
            "id": "fb7a0275-6e48-4054-98bf-752731b7250c",
            "description": "TROY, Michigan - On February 27, 2026, Presurance Holdings, Inc. (Nasdaq: PRHI) concluded its rights offering as mentioned in the Current Report on Form 8-K filed on January 28, 2026. The offering saw significant participation from investors, showcasing a strong interest in the company's future prospects.",
            "link": "https://www.markets.news/headlines/fb7a0275-6e48-4054-98bf-752731b7250c",
            "pub_date": "2026-02-28 03:15:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jamieson Greer, a discreet lawyer, is reshaping global economy at president's request.",
            "id": "54efc1e5-fbf9-4e00-baa6-39e3798adb96",
            "description": "Jamieson Greer, a humble lawyer from a modest upbringing, has been tasked by the president to reshape the dynamics of the worldwide economy.",
            "link": "https://www.markets.news/headlines/54efc1e5-fbf9-4e00-baa6-39e3798adb96",
            "pub_date": "2026-02-28 03:15:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "00de6701-0ac6-4807-ae49-84af7d5f4954",
            "description": "Company buyback: Purchased 10,000 shares for $100,000.",
            "link": "https://www.markets.news/headlines/00de6701-0ac6-4807-ae49-84af7d5f4954",
            "pub_date": "2026-02-28 03:15:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8e0589b0-95c7-4325-894d-1b279c84f59a",
            "description": "TRUMP ON IRAN: NOT HAPPY WITH THE WAY THEY'VE BEEN",
            "link": "https://www.markets.news/headlines/8e0589b0-95c7-4325-894d-1b279c84f59a",
            "pub_date": "2026-02-28 03:15:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mobile Infrastructure (AMEX: BEEP) to report quarterly earnings with estimated EPS of $-0.11 on 2026-03-02. Negative trend in stock performance with shares at $3.02, down 15.95% in 52 weeks. Guidance key for stock movement, not just beating estimates.",
            "id": "d5913198-9d3a-4c0a-b5d1-1ffa00622ee3",
            "description": "Mobile Infrastructure (AMEX: BEEP) is set to report its quarterly earnings on March 2, 2026. Analysts predict an EPS of $-0.11, with hopes for positive guidance for future growth. In the previous quarter, the company missed EPS by $0.06, resulting in a 0.31% share price drop. As of February 26, shares were at $3.02, down 15.95% over the last 52 weeks. Shareholders are mostly bearish leading up to the earnings release. Mobile Infrastructure focuses on acquiring and owning mobile infrastructure assets. For more details, the full story is available on Benzinga.com",
            "link": "https://www.markets.news/headlines/d5913198-9d3a-4c0a-b5d1-1ffa00622ee3",
            "pub_date": "2026-02-28 03:05:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Compugen's earnings report on 3/2 expected EPS $0.10. Strong historical performance saw 2.99% stock increase last quarter. Trading at $1.79, shares up 1.38% over last 52 weeks. Investors eagerly await report.",
            "id": "fcef53dd-32cc-4022-b8d8-100f10738ff6",
            "description": "Biotech company Compugen (NASDAQ: CGEN) is scheduled to release its quarterly earnings results on Monday, March 2, 2026. Analysts are anticipating an earnings per share (EPS) of $0.10. Investors are eagerly awaiting the announcement, hoping for results that exceed expectations and positive guidance for the upcoming quarter. It is important to highlight that guidance provided can heavily impact stock price movements, especially for new investors. Compugen outperformed expectations by $0.02 in the last quarter, resulting in a 2.99% increase in share price the following day. Here's a breakdown of Compugen's recent earnings performances and the subsequent stock price changes: Q3 2025: Estimated EPS -0.09, Actual EPS -0.07, Price Change 2.99%; Q2 2025: Estimated EPS -0.08, Actual EPS -0.08, Price Change -1.37%; Q1 2025: Estimated EPS -0.05, Actual EPS -0.08, Price Change 1.44%; Q4 2024: Estimated EPS 0.07, Actual EPS -0.07, Price Change 7.74%. As of February 26, Compugen shares were trading at $1.79, marking a 1.38% increase over the past 52 weeks. Investors can access the full story on Benzinga.com for more insights.",
            "link": "https://www.markets.news/headlines/fcef53dd-32cc-4022-b8d8-100f10738ff6",
            "pub_date": "2026-02-28 03:05:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gaia to report quarterly earnings on 2026-03-02. Analysts estimate EPS of $-0.01. Past missed EPS led to share price drop. Stock at $3.36.",
            "id": "2edb3d18-74b3-42fe-8235-3362df78b9b1",
            "description": "Gaia (NASDAQ: GAIA) is scheduled to release its latest quarterly earnings report on Monday, March 2, 2026. Analysts are expecting the company to report an earnings per share (EPS) of -$0.01. Investors are eagerly awaiting the announcement, hoping for results that exceed expectations and positive guidance for the following quarter. It's important to highlight that guidance can significantly impact stock price movement, especially for new investors. Looking back at Gaia's previous performance, in the last quarter, the company missed its EPS estimate by $0.00, resulting in an 8.71% decrease in the share price the following day. In the third quarter of 2025, the EPS estimate was -$0.05, and the actual figure reported was also -$0.05, leading to an 8.71% price decrease. In the second quarter of 2025, the EPS estimate was -$0.08, with the actual reported EPS at -$0.07, causing a 16.21% price increase. In the first quarter of 2025, the EPS estimate was -$0.03, and the company reported an EPS of -$0.04, resulting in a 10.32% decrease in price. In the fourth quarter of 2024, both the estimate and actual EPS were -$0.03, resulting in no price change. As of February 26, Gaia shares were trading at $3.36. Over the past 52 weeks, the shares have experienced a decline. Investors can find more details on this news at Benzinga.com.",
            "link": "https://www.markets.news/headlines/2edb3d18-74b3-42fe-8235-3362df78b9b1",
            "pub_date": "2026-02-28 03:05:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}