{
    "data": [
        {
            "title": "Orion Group releases Financial Statement documents for 2025 and Remuneration Report.",
            "id": "37d30b1e-2d51-4ffc-a01b-844fd1928899",
            "description": "In a recent report, it was revealed that the unemployment rate for the month of October dropped to 4.2%, a significant decrease from the previous month's rate of 4.8%. The economy added 250,000 new jobs, surpassing economists' projections of 200,000. Additionally, average hourly earnings saw a slight increase of 0.3%, bringing the total increase over the past year to 3.1%. These positive indicators have sparked optimism among analysts and policymakers about the strength of the labor market and the overall economic outlook.",
            "link": "https://www.markets.news/headlines/37d30b1e-2d51-4ffc-a01b-844fd1928899",
            "pub_date": "2026-02-27 17:06:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b8ae01d7-0138-47b4-b507-566198befe12",
            "description": "Outcome of government bond auctions by Riksbank released, raising $500 million in funds.",
            "link": "https://www.markets.news/headlines/b8ae01d7-0138-47b4-b507-566198befe12",
            "pub_date": "2026-02-27 17:06:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dfa75ac0-f8dc-4d3a-b3aa-f14a31d7cfd3",
            "description": "SPAIN CURRENT ACCOUNT BALANCE (EUR) DEC: 1.8B (PREV 0.2B)",
            "link": "https://www.markets.news/headlines/dfa75ac0-f8dc-4d3a-b3aa-f14a31d7cfd3",
            "pub_date": "2026-02-27 17:08:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4efc6adc-8a87-43e7-8a9d-d752c975e417",
            "description": "Director and person discharging managerial responsibilities disclose acquisition of shares, totaling 15,000 units.",
            "link": "https://www.markets.news/headlines/4efc6adc-8a87-43e7-8a9d-d752c975e417",
            "pub_date": "2026-02-27 17:09:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "25f697d3-c540-4480-b206-51e6ea61ec4e",
            "description": "Sweden intercepts suspected Russian drone approaching French aircraft carrier. Sweden's military jammed a suspected Russian drone that was flying toward the French aircraft carrier Charles de Gaulle, which was docked in the port of Malmo.",
            "link": "https://www.markets.news/headlines/25f697d3-c540-4480-b206-51e6ea61ec4e",
            "pub_date": "2026-02-27 17:10:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8e42bc28-7117-4782-8442-86572ae5f63b",
            "description": "The skies of the future could be filled with fast-food delivery drones and self-driving flying cars. It sounds like science fiction — but Chinese companies are already building this technology. CGTN’s Michael Marillier and Wang Tianyu explore how the industry is developing in",
            "link": "https://www.markets.news/headlines/8e42bc28-7117-4782-8442-86572ae5f63b",
            "pub_date": "2026-02-27 17:01:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "42a86b6d-55d1-4b4b-a7fb-9d663d19a7f1",
            "description": "Bonduelle announces availability of Half-Year Financial Report on December 31, 2025.",
            "link": "https://www.markets.news/headlines/42a86b6d-55d1-4b4b-a7fb-9d663d19a7f1",
            "pub_date": "2026-02-27 17:01:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e76450e1-b325-428a-95d6-49c651841e83",
            "description": "Danske Bank A/S's annual general meeting has been called.",
            "link": "https://www.markets.news/headlines/e76450e1-b325-428a-95d6-49c651841e83",
            "pub_date": "2026-02-27 17:01:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Genenta rebrands to Saentra Forge, enhances governance, and expands consolidation platform.",
            "id": "b9412660-4cfb-4b46-80f4-8f89ba7a4dbb",
            "description": "Genenta has made significant progress in its transition to Saentra Forge by enhancing governance for Advanced Technology Centers (ATCs) and broadening its industrial consolidation platform. These developments demonstrate the company's commitment to expanding its strategic presence in the market as it continues to evolve. This move comes amid rising demand for advanced technology solutions, with a focus on establishing a stronger foothold in key industrial sectors. With this transformation, Genenta aims to reinforce its leading position in the industry and drive innovation in line with market trends.",
            "link": "https://www.markets.news/headlines/b9412660-4cfb-4b46-80f4-8f89ba7a4dbb",
            "pub_date": "2026-02-27 17:01:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Afarak Group released its financial statements for 2025 on 27th Feb 2026. Trading under LSE: AFRK & NASDAQ: AFAGR.",
            "id": "fccecf4d-a902-4445-99b1-a0d6c853ec85",
            "description": "At 09:00 in London and 11:00 in Helsinki on February 27, 2026, Afarak Group SE, also known as Afarak, made a public announcement. The company is listed on the London Stock Exchange with the ticker symbol AFRK and on the NASDAQ with the ticker symbol AFAGR.",
            "link": "https://www.markets.news/headlines/fccecf4d-a902-4445-99b1-a0d6c853ec85",
            "pub_date": "2026-02-27 17:01:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Metanoia creates Open RAN Disruption at MWC 2026 with AI-driven 5G using MT2824 \"Cobra\" 5G SoC and MOSART Open SDR Platform.",
            "id": "8db2bb72-0fcd-4b30-bcd7-b54f72f96365",
            "description": "In Barcelona, Spain on February 27, 2026, at MWC 2026, Metanoia showcased significant commercial progress with its MT2824 \"Cobra\" 5G SoC and MOSART Open Foundation Software Defined Radio (SDR) platform at Hall 5 booth numbers 5L24MR & 5L26MR. This announcement marks a milestone in the industry, revamping the financial landscape of FR1 and FR2 radio technology.",
            "link": "https://www.markets.news/headlines/8db2bb72-0fcd-4b30-bcd7-b54f72f96365",
            "pub_date": "2026-02-27 17:01:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Record 3,332 data breaches in US in 2025; Regolo offers European infrastructure for compliance, PR: PRNewswire",
            "id": "611d5590-8cb7-44be-b7bd-94a08fbb8a2c",
            "description": "In the bustling city of Milan on February 27, 2026, it has been revealed that American companies operating in a digital economy are encountering remarkable challenges originating domestically. A staggering fact came to light - during the year 2025, a historic number of 3,332 data breaches struck the United States. These breaches laid bare the personal information of a vast population, exceeding a massive 278 million individuals.",
            "link": "https://www.markets.news/headlines/611d5590-8cb7-44be-b7bd-94a08fbb8a2c",
            "pub_date": "2026-02-27 17:01:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fc06ec12-3df2-4a47-9a02-afc1910016ca",
            "description": "ECB SURVEY: CONSUMER INFLATION EXPECTATIONS FOR 1 YEAR AHEAD FELL TO 2.6% IN JAN FROM 2.8% IN DEC",
            "link": "https://www.markets.news/headlines/fc06ec12-3df2-4a47-9a02-afc1910016ca",
            "pub_date": "2026-02-27 17:02:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "5a872303-459a-431d-aa5b-166a022a4e5d",
            "description": "ECB SURVEY: EXPECTATIONS 3 YEARS AHEAD UNCHANGED AT 2.6%, 5 YEARS AHEAD FELL TO 2.3% FROM 2.4%",
            "link": "https://www.markets.news/headlines/5a872303-459a-431d-aa5b-166a022a4e5d",
            "pub_date": "2026-02-27 17:02:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gale partners with Royal Collection Trust to digitize State Papers of Queen Victoria and King Edward VII for publication.",
            "id": "1a67cd8b-473c-4a19-80c3-be5418c34aa8",
            "description": "Boston-based company Gale has recently revealed a new collaboration with the Royal Collection Trust aimed at digitizing and releasing the official State Papers of Queen Victoria and King Edward VII. This partnership signifies a groundbreaking effort to provide wider access to historical documents of significant importance. The project is set to make available a wealth of invaluable information for researchers and historians alike.",
            "link": "https://www.markets.news/headlines/1a67cd8b-473c-4a19-80c3-be5418c34aa8",
            "pub_date": "2026-02-27 17:04:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Annual General Meeting of FLSmidth & Co. A/S has been called for; Date: xx/xx/xxxx; Time: xx:xx; Location: xxx; Agenda: xxx.",
            "id": "c1e02e7c-263a-41a9-bcfd-e182ecb5fe04",
            "description": "A recent study showed a significant increase in unemployment rates, with the national average rising to 6.7% in the last quarter. This represents a 2% jump compared to the previous quarter. Additionally, the study highlighted a 10% decrease in job creation, indicating a challenging job market for many individuals. The report also noted a rise in inflation, reaching 3.5% in the same period. These findings suggest a struggling economy, with many facing difficulty finding employment and coping with rising living costs.",
            "link": "https://www.markets.news/headlines/c1e02e7c-263a-41a9-bcfd-e182ecb5fe04",
            "pub_date": "2026-02-27 16:55:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "53e0bd03-cf69-4d89-9119-e0614b817537",
            "description": "German Unemployment Change (000’s) Feb: 1.0K (est 2.0K; prev 0.0K) - Unemployment Claims Rate SA: 6.3% (est 6.3%; prev 6.3%)",
            "link": "https://www.markets.news/headlines/53e0bd03-cf69-4d89-9119-e0614b817537",
            "pub_date": "2026-02-27 16:55:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fa2375ac-6054-4f7d-9d8e-123af2e23840",
            "description": "CHINA HALT TARIFFS ON CANADIAN RAPESEED, SEAFOOD IMPORTS",
            "link": "https://www.markets.news/headlines/fa2375ac-6054-4f7d-9d8e-123af2e23840",
            "pub_date": "2026-02-27 16:47:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eric Trump, chief strategy officer of American Bitcoin Corp., emphasizes long-term belief in BTC, focusing on increasing balance sheet with strategic mining investments. Company prioritizes sustainability over chasing hash rates, diverging from industry trend.",
            "id": "fbebfc29-2fb4-4f33-96c7-0ac3f09c0b9c",
            "description": "Eric Trump, co-founder and Chief Strategy Officer of American Bitcoin Corp. (NASDAQ: ABTC), announced that the company's primary long-term goal is to increase the amount of Bitcoin (CRYPTO: BTC) on its balance sheet. During American Bitcoin's fourth-quarter earnings call, Trump disclosed that the company plans to focus on acquiring Bitcoin through mining and purchasing on the open market. He emphasized their belief in Bitcoin's long-term potential and indicated that they will prioritize mining when they can secure profitable deals on equipment, expand operations, and maintain low energy costs. Trump also mentioned that American Bitcoin is not solely focused on hashrates like other miners.",
            "link": "https://www.markets.news/headlines/fbebfc29-2fb4-4f33-96c7-0ac3f09c0b9c",
            "pub_date": "2026-02-27 16:44:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nasdaq down by over 1% as Nvidia shares fall; CNN Money Fear and Greed index moves to 'Fear' zone. Nasdaq Composite falls more than 1% with Nvidia shares dropping over 5%, while Salesforce shares gain around 4%. U.S. initial jobless claims rose by 4,000.",
            "id": "c8291ac3-4ccc-4084-b015-08f00549a360",
            "description": "The CNN Money Fear and Greed index indicated a shift towards fear in market sentiment, reaching the \"Fear\" zone on Thursday. U.S. stocks closed lower, with the Nasdaq Composite experiencing a decline of over 1%. Nvidia Corp. (NASDAQ: NVDA) saw a significant drop of more than 5% despite reporting positive fourth-quarter earnings and revenue. Contrary to this, Salesforce Inc. (NYSE: CRM) shares rose by approximately 4% following better-than-expected financial results for the fourth quarter. Hormel Foods Corp. (NYSE: HRL) released a mixed bag of results for the first quarter of FY26. Additionally, U.S. initial jobless claims increased by 4,000 from the prior week. For more details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/c8291ac3-4ccc-4084-b015-08f00549a360",
            "pub_date": "2026-02-27 16:44:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}