{
    "data": [
        {
            "title": "Berkshire Hathaway's earnings down 25%, net income drops to $66.9B from $88.9B in 2024. Greg Abel takes over as CEO.",
            "id": "97c01ea5-3710-4ee7-bc76-7cc4ceacc18b",
            "description": "Berkshire Hathaway Inc. reported 2025 net earnings of $66,968 million, down from $88,995 million in 2024, with fourth-quarter net earnings at $19,199 million, slightly below the previous year. Operating earnings decreased to $10,200 million in Q4 from $14,527 million in 2024, and to $44,486 million for the full year against $47,437 million. Revenue was expected to be $92.91 billion for the quarter, a drop from the previous year, but Berkshire has consistently surpassed revenue expectations. Greg Abel is now the CEO, succeeding Warren Buffett, leading to speculation on potential changes to Berkshire's investment strategies and cash deployment of over $300 billion. Berkshire is also reportedly selling its position in Kraft Heinz and reducing its stake in Apple Inc. The full story is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/97c01ea5-3710-4ee7-bc76-7cc4ceacc18b",
            "pub_date": "2026-02-28 22:11:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Richardson Paris Baguette Café to open Feb. 27, 2026 at 7615 Campbell Rd., Suite 106, TX. Brand has over 4,000 worldwide units.",
            "id": "60871165-3535-498e-804b-7554c2e3a1bd",
            "description": "Four individuals, specifically Sweta Goyal, Puneet Mittal, Mamta Singhal, and Rajneesh Singhal, are preparing to launch a Paris Baguette café at the address 7615 Campbell Rd., Suite 106, Richardson, TX 75248 in Dallas. The announcement was made on Feb. 28, 2026, through PRNewswire. Paris Baguette, known for its bakery café offerings, currently operates more than 4,000 locations globally and is rapidly expanding.",
            "link": "https://www.markets.news/headlines/60871165-3535-498e-804b-7554c2e3a1bd",
            "pub_date": "2026-02-28 22:13:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2b5dcda6-e093-4a99-b498-80dcb9836be5",
            "description": "TRUMP: IRAN DOES NOT WANT TO GO QUITE FAR ENOUGH AND IT'S TOO BAD .",
            "link": "https://www.markets.news/headlines/2b5dcda6-e093-4a99-b498-80dcb9836be5",
            "pub_date": "2026-02-28 22:01:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's economy gears up for 15th Five-Year Plan period (2026-2030) with strong domestic growth drivers.",
            "id": "b75c16e5-dc66-43b3-8fbd-d361d4973964",
            "description": "In Beijing, on February 28, 2026, a report on the Chinese economy indicates that the year 2026 signifies the commencement of China's 15th Five-Year Plan spanning from 2026 to 2030. In order to ensure a robust and steady initiation, China is depending on robust internal growth factors, along with other strategies to bolster its economy.",
            "link": "https://www.markets.news/headlines/b75c16e5-dc66-43b3-8fbd-d361d4973964",
            "pub_date": "2026-02-28 22:02:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hold Bitcoin for 3+ years to avoid losses; those who bought 3-5 years ago are up 90% on average despite recent dips.",
            "id": "1aaa0aa3-d2e0-4095-bb94-4e89c56e95f1",
            "description": "On average, traders who purchased Bitcoin between three to five years ago are currently experiencing a profit of approximately 90%, despite the recent market correction.",
            "link": "https://www.markets.news/headlines/1aaa0aa3-d2e0-4095-bb94-4e89c56e95f1",
            "pub_date": "2026-02-28 22:06:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "11 senators push for federal investigation into Binance amid concerns over sanctions compliance and Iran transactions.",
            "id": "54bc07f5-a64c-42fa-8c4a-66147490a49c",
            "description": "Members of Congress are calling on regulatory authorities in the US to conduct a thorough assessment of Binance's anti-money laundering (AML) and sanctions protocols. This comes in response to reports indicating transactions associated with Iran and potential risks of evading sanctions. Lawmakers are emphasizing the need for a stringent review of Binance’s compliance measures to ensure they are effectively preventing illicit activities.",
            "link": "https://www.markets.news/headlines/54bc07f5-a64c-42fa-8c4a-66147490a49c",
            "pub_date": "2026-02-28 21:39:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Washington has a stake in the AI IPO boom on Wall Street; concerns arise if they fail.",
            "id": "c8555792-718a-4bfe-966c-189083e79bb6",
            "description": "Wall Street is set to experience a surge in artificial intelligence technology, and the government has a significant interest in the results.",
            "link": "https://www.markets.news/headlines/c8555792-718a-4bfe-966c-189083e79bb6",
            "pub_date": "2026-02-28 21:34:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "El-Erian warns of a rational bubble in AI and corporate debt. Stock prices seem frothy, with a potential loss of $20 trillion in shareholder wealth. Leaders include Nvidia and Microsoft.",
            "id": "8a9692b4-d054-461f-86e1-2871d02216e9",
            "description": "Economist Mohamed El-Erian warns of a \"rational bubble\" in AI and a surge in corporate debt that could lead to a broader sell-off. He notes that despite the substantial value of AI, the market is experiencing overinvestment with companies using \"AI labels\" to attract capital. Moody's Analytics also expresses concern about overvaluation in AI companies, with a potential $20 trillion loss in shareholder wealth in a \"AI Falls Flat\" scenario. Leading AI companies like Nvidia Corp. and Microsoft Corp. are at risk in this speculative environment. More details on Benzinga.com.",
            "link": "https://www.markets.news/headlines/8a9692b4-d054-461f-86e1-2871d02216e9",
            "pub_date": "2026-02-28 21:34:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones futures rise, S&P 500 above 50-day line; Nvidia gains in buy zone post strong earnings.",
            "id": "1c98e23f-bbc3-429f-a057-9ed6a5d2a432",
            "description": "Stock index futures showed uncertainty as the technology company Nvidia maintained its position in the buy zone following impressive earnings report and guidance. The S&P 500 index surpassed its 50-day line, indicating a positive trend in the market. Dow Jones futures also saw an increase.",
            "link": "https://www.markets.news/headlines/1c98e23f-bbc3-429f-a057-9ed6a5d2a432",
            "pub_date": "2026-02-28 21:34:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nasdaq jumps ahead of Nvidia earnings; Goldman leads bank bounce. Dow Jones rises, First Solar stock sinks.",
            "id": "48032043-617a-46dd-8136-286f24b7cda5",
            "description": "Today, the Dow Jones index saw an increase on Wednesday as investors anticipated Nvidia's earnings report. On the other hand, First Solar stock plummeted due to lower-than-expected revenue guidance. Meanwhile, the Nasdaq experienced a notable jump, particularly in anticipation of Nvidia's earnings, with Goldman Sachs leading the rebound in the banking sector.",
            "link": "https://www.markets.news/headlines/48032043-617a-46dd-8136-286f24b7cda5",
            "pub_date": "2026-02-28 21:34:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IMF warns Trump tariffs could hinder growth, criticizes cuts to federal workforce. Tarrifs create negative impact.",
            "id": "6a33d042-ad01-42d2-8f97-f07b025f01bc",
            "description": "The International Monetary Fund has issued a strong caution to the Donald Trump administration, stating that its trade and labor policies could hinder national growth and disrupt essential regulatory frameworks. After conducting an Article IV consultation on the U.S. economy, the IMF advised the White House to adopt alternative policies to prevent self-imposed economic harm. While recognizing the administration's worries about the trade deficit, IMF Managing Director Kristalina Georgieva criticized the current heavy reliance on tariffs as a substantial error. According to Georgieva, these tariffs lead to a negative supply effect, ultimately impeding stronger growth prospects. Despite facing legal challenges over emergency powers used to implement tariffs, President Trump remains steadfast in his trade approach. The IMF plans to offer more insights into the potential impact of the latest tariffs in the near future.",
            "link": "https://www.markets.news/headlines/6a33d042-ad01-42d2-8f97-f07b025f01bc",
            "pub_date": "2026-02-28 21:34:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Entera Bio CEO to speak at Leerink Partners Global Healthcare Conf 2026; Miranda Toledano to participate in fireside chat.",
            "id": "b8aacb6e-f969-4de3-950f-0d71ae2ecf53",
            "description": "On February 26, 2026, in Tel Aviv, Entera Bio Ltd. disclosed that its Chief Executive Officer, Miranda Toledano, is set to engage in a fireside chat at the Leerink Partners Global Healthcare Conference 2026. Entera, a frontrunner in oral peptide and protein replacement therapies, traded under the ticker ENTX on NASDAQ. This event marks a significant moment for the company as it strives to advance its innovative solutions in the medical field. CEO Miranda Toledano's participation underscores Entera's commitment to engaging with key stakeholders and industry peers.",
            "link": "https://www.markets.news/headlines/b8aacb6e-f969-4de3-950f-0d71ae2ecf53",
            "pub_date": "2026-02-28 21:35:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US and Israel launch 'massive' attacks on Iran as Trump urges Iranians to rise up. Dow Jones futures and oil prices may be impacted.",
            "id": "0c18171a-89e0-4107-aa4a-20a3b843a2b6",
            "description": "In response to President Trump's encouragement for Iranians to rebel, the United States and Israel have initiated significant military offensives against Iran. These actions have raised concerns about potential impacts on the financial markets: specifically, analysts are closely monitoring the reaction of Dow Jones futures and oil prices. The scale and consequences of these attacks are key focal points for investors seeking to assess potential market shifts.",
            "link": "https://www.markets.news/headlines/0c18171a-89e0-4107-aa4a-20a3b843a2b6",
            "pub_date": "2026-02-28 21:26:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Seniors losing billions yearly to scams. Banks training staff to prevent financial exploitation of older Americans.",
            "id": "e17f4082-5a84-4b6f-8515-6d53242d41b8",
            "description": "Each year, older Americans are being financially exploited, resulting in a loss of billions of dollars. To combat this issue, banks and investment firms are taking proactive steps by providing training to their employees. This training focuses on identifying red flags that may indicate potential exploitation and empowering staff to intervene and prevent these harmful transactions.",
            "link": "https://www.markets.news/headlines/e17f4082-5a84-4b6f-8515-6d53242d41b8",
            "pub_date": "2026-02-28 21:28:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investors of Aquestive Therapeutics facing losses urged by Faruqi & Faruqi, LLP to contact James Wilson for options.",
            "id": "22902034-353b-47d5-94ca-595ec116e24d",
            "description": "Legal expert James (Josh) Wilson from Faruqi & Faruqi, LLP is urging investors who have experienced notable losses in Aquestive Therapeutics to reach out to him for a discussion on their available courses of action. If you have been affected by substantial losses in Aquestive Therapeutics stock or options, contact him directly to explore potential options.",
            "link": "https://www.markets.news/headlines/22902034-353b-47d5-94ca-595ec116e24d",
            "pub_date": "2026-02-28 21:15:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Despite faster blockchains, institutions still favor Ethereum due to its liquidity. Kevin Lepsoe from ETHGas explains why.",
            "id": "b4317c01-1422-4e2e-b902-601261f13d49",
            "description": "Engineers are thrilled about recent TPS advancements, while Traditional Finance executives are turning to Ethereum due to its high liquidity, according to Kevin Lepsoe from ETHGas.",
            "link": "https://www.markets.news/headlines/b4317c01-1422-4e2e-b902-601261f13d49",
            "pub_date": "2026-02-28 21:02:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway Inc. releases 2024 and 2025 operating results, advises reading full report on website for informed decisions.",
            "id": "af457577-ec2e-4d4b-8ce4-b57ff55c4613",
            "description": "OMAHA, Nebraska - Berkshire Hathaway's operating results for the fourth quarter and full year of 2025 and 2024 are available for review. Investors and reporters are encouraged to access the 2025 Annual Report on the company's official website for a comprehensive analysis. It is essential to note that the brief overview provided here is insufficient for making investment decisions. Earnings for Berkshire Hathaway Inc. and its consolidated subsidiaries during the specified period are significant and warrant further examination.",
            "link": "https://www.markets.news/headlines/af457577-ec2e-4d4b-8ce4-b57ff55c4613",
            "pub_date": "2026-02-28 21:03:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PL-Universe and Stanford University concluded a successful event on Feb. 26, 2026, focused on Physical AI & Robotics.",
            "id": "8c15c3cf-a366-4581-83cd-539c11eb2fc6",
            "description": "In Stanford, California on February 26, 2026, PL-Universe Robotics hosted a significant event at Stanford University focused on Physical AI and Robotics. Titled \"Robots Master the Production Line? PL-Universe: VLA for Autonomy, Robotics & Investment\", the flagship event attracted a large audience and took place at a prestigious venue.",
            "link": "https://www.markets.news/headlines/8c15c3cf-a366-4581-83cd-539c11eb2fc6",
            "pub_date": "2026-02-28 21:05:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sonoro Gold Corp announces updated PEA for Cerro Caliche gold project: After-tax NPV of $224 million and IRR of 50%.",
            "id": "dabde74e-f1e1-402e-aa4b-126aa173f618",
            "description": "Sonoro Gold Corp. has released the findings of a recent report on its Cerro Caliche gold project in Sonora State, Mexico. The report outlines an independent updated Mineral Resource Estimate and updated Preliminary Economic Assessment. The assessment suggests the possibility of a ten-year life of mine for an open pit, heap leach mining operation. The operation would begin with a one-year ramp up production rate of 12,000 tonnes per day, eventually reaching 16,000 tpd for the rest of the life of mine. All figures are presented in USD. The company's stock ticker symbols are TSXV: SGO, OTCQB: SMOFF, and FRA: 23SP.",
            "link": "https://www.markets.news/headlines/dabde74e-f1e1-402e-aa4b-126aa173f618",
            "pub_date": "2026-02-28 21:01:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Faruqi & Faruqi, LLP investigates claims for Hub Group investors. Contact James Wilson to discuss losses.",
            "id": "a0edc407-75b1-4eea-b144-a8bbaa74a261",
            "description": "James (Josh) Wilson, Securities Litigation Partner at Faruqi & Faruqi, LLP, is extending an invitation to investors who have experienced substantial losses in Hub Group. If you have been affected by losses in Hub Group stocks or options and wish to explore your legal options, you are encouraged to reach out to him directly.",
            "link": "https://www.markets.news/headlines/a0edc407-75b1-4eea-b144-a8bbaa74a261",
            "pub_date": "2026-02-28 20:53:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}