{
    "data": [
        {
            "title": "",
            "id": "1ec15176-1a79-4d4d-8d51-350683545ac1",
            "description": "GERMAN ECONOMY MINISTER SAYS WE MUST INCREASE OUR COMPETITIVENESS",
            "link": "https://www.markets.news/headlines/1ec15176-1a79-4d4d-8d51-350683545ac1",
            "pub_date": "2026-02-27 19:52:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NY judge denies Binance request to move pre-2019 US crypto claims to arbitration, keeps case in court.",
            "id": "2ef7cbc6-602b-4cac-9a27-8bd131999961",
            "description": "The recent ruling has determined that investor claims made before 2019 will remain in open court. Moreover, Binance’s attempt to move the dispute to private arbitration in Singapore has been denied.",
            "link": "https://www.markets.news/headlines/2ef7cbc6-602b-4cac-9a27-8bd131999961",
            "pub_date": "2026-02-27 19:52:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ba14a381-a816-4664-9a33-eb71f860abca",
            "description": "AUSTRIAN ECONOMY MINISTER SAYS AT TIMES OF GEOPOLITICAL TURMOIL, IT'S IMPORTANT FOR EUROPE TO STICK TOGETHER",
            "link": "https://www.markets.news/headlines/ba14a381-a816-4664-9a33-eb71f860abca",
            "pub_date": "2026-02-27 19:54:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Natural Resource Partners L.P. reported $136,367 net income for 2025, generated $169 million free cash flow, and announced a special distribution of $0.12 per common unit.",
            "id": "5d0a9c91-d020-4282-9d7b-d368933150cb",
            "description": "Natural Resource Partners L.P. reported its 2025 results, including net income of $30,998 for the fourth quarter and $136,367 for the year, operating cash flow of $44,765 for the fourth quarter and $165,863 for the full year, and free cash flow of $45,508 for the fourth quarter and $168,748 for the full year. The company generated $169 million of free cash flow, retired $109 million of debt, and paid total distributions of $4.21 per common unit in 2025. NRP's liquidity was $211.2 million at the end of the year. The board declared a special cash distribution of $0.12 per common unit to cover unitholder tax liabilities. The mineral rights segment saw decreased income due to lower coal sales prices and volumes, while the soda ash segment also experienced declines. NRP announced a capital investment in Sisecam Wyoming. Corporate and financing costs improved in 2025. NRP declared a Q4 2025 cash distribution of $0.75 per common unit and a special distribution of $0.12 per common unit. The company's consolidated leverage ratio was 0.2x at year-end. Revenue, income statements, cash flows, assets, liabilities, and capital were detailed in the financial tables. NRP is a master limited partnership based in Houston, TX, focusing on natural resources in the U.S., including coal and industrial minerals. The company continues to face challenges due to low coal and soda ash prices. Natural Resource Partners is taking steps to strengthen its position amidst the challenging market conditions.",
            "link": "https://www.markets.news/headlines/5d0a9c91-d020-4282-9d7b-d368933150cb",
            "pub_date": "2026-02-27 19:56:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zoomcar Holdings, Inc. offers exchange of outstanding warrants for common stock in India, as per recent SEC filings.",
            "id": "473f21c5-8195-45fe-be35-a96979de7459",
            "description": "On February 27, 2026, in Bengaluru, India, Zoomcar Holdings, Inc. (OTCQB: ZCAR) announced a voluntary offer to exchange outstanding common stock purchase warrants from its recent private placement for shares of common stock. This initiative follows a private placement completed on February 25, 2026. The company is a prominent peer-to-peer self-drive car-sharing marketplace in India. The warrants were outstanding as of February 26, 2026. The offer is detailed in the Company's Tender Offer Statement on Schedule TO, filed with the SEC on February 27, 2026. The warrants will be exchanged for shares of the Company's common stock, which has a par value of $0.0001 per share, subject to the conditions outlined in the Schedule TO.",
            "link": "https://www.markets.news/headlines/473f21c5-8195-45fe-be35-a96979de7459",
            "pub_date": "2026-02-27 19:59:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Off-highway Plastics Market projected to reach $13.08 billion by 2030 as per MarketsandMarkets report.",
            "id": "92845c0c-0777-44bf-aac3-527ba2cb8cb6",
            "description": "In Delray Beach, Florida on February 27, 2026, a report by MarketsandMarkets revealed key insights on the Off-highway Plastics Market. The report focused on various material types including Polypropylene, Polyvinyl Chloride, Polyethylene, Polyamide, Acrylonitrile Butadiene Styrene, Polycarbonate, Polyoxymethylene, Thermoplastic Elastomer, and Bio-based materials. The market analysis provided crucial data and trends for this sector, highlighting growth opportunities and challenges. This information aims to guide industry stakeholders in making informed decisions.",
            "link": "https://www.markets.news/headlines/92845c0c-0777-44bf-aac3-527ba2cb8cb6",
            "pub_date": "2026-02-27 20:00:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2a284e50-2098-40a6-a5cd-ba4be5373a9e",
            "description": "Zelenskyy: 'Just now, the President is talking with the Prime Minister of Slovakia, Robert Fico. The President invites him to Ukraine to discuss all the existing issues'",
            "link": "https://www.markets.news/headlines/2a284e50-2098-40a6-a5cd-ba4be5373a9e",
            "pub_date": "2026-02-27 19:46:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b79c3f42-e765-48ed-8e20-6f120591c246",
            "description": "S&P 500, NASDAQ 100 FUTURES FALL TO SESSION LOW OF 0.6%",
            "link": "https://www.markets.news/headlines/b79c3f42-e765-48ed-8e20-6f120591c246",
            "pub_date": "2026-02-27 19:46:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "815582a2-aa32-40b2-b5e2-4cd81440b550",
            "description": "BLACKSTONE AND BROOKFIELD SAID AMONG BIDDERS FOR €8B VW UNIT",
            "link": "https://www.markets.news/headlines/815582a2-aa32-40b2-b5e2-4cd81440b550",
            "pub_date": "2026-02-27 19:47:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9481df28-267d-4770-b7f9-421c88f16f10",
            "description": "SWISS ECONOMY MINISTER SAYS IMPORTANT TO STRENGTHEN ECONOMIC COOPERATION AT TIMES OF GLOBAL TENSIONS, SPEAKING AT MEETING OF ECONOMY MINISTERS FROM GERMAN-SPEAKING COUNTRIES",
            "link": "https://www.markets.news/headlines/9481df28-267d-4770-b7f9-421c88f16f10",
            "pub_date": "2026-02-27 19:47:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GFL Environmental Inc. renews share repurchase program on TSX, with a 12-month NCIB. Feb. 27, 2026.",
            "id": "419b3729-0082-4a9f-85e5-9e8a150bc1c7",
            "description": "In Miami Beach, Florida on February 27, 2026, GFL Environmental Inc. (NYSE: GFL) (TSX: GFL) disclosed its plans to renew a normal course issuer bid (NCIB) for the next 12 months. The Toronto Stock Exchange (TSX) has approved the Company's intention.",
            "link": "https://www.markets.news/headlines/419b3729-0082-4a9f-85e5-9e8a150bc1c7",
            "pub_date": "2026-02-27 19:48:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3fb1cc0a-de02-40dc-ab23-8eeb9e49e884",
            "description": "GERMAN ECONOMY MINISTER SAYS WE ARE IN DIFFICULT TIMES",
            "link": "https://www.markets.news/headlines/3fb1cc0a-de02-40dc-ab23-8eeb9e49e884",
            "pub_date": "2026-02-27 19:49:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Endeavour Silver Corp announces Q4 2025 results: produced 6,486,661 oz of silver, $467.5 million revenue. Operating & mine earnings rose significantly. Commercial production at Terronera started. Company closed a $350 million convertible notes offering. 2025 marked by growth, record revenue, strategic milestones. Operations disrupted in Mexico due to security concerns. Resume normal operations. Conference call at 10AM PST today. For more details, visit the company's website.",
            "id": "b3c8a0b1-e8d3-4b0f-8dd9-54e7b34f7b84",
            "description": "Endeavour Silver Corp. reported its financial and operating results for the year ended December 31, 2025, highlighting significant growth in production and revenue. The company recorded 6,486,661 ounces of silver and 37,164 ounces of gold production in 2025, with total silver equivalent production reaching 11.2 million ounces, a 48% increase over the previous year. Revenue totaled $467.5 million, driven by the sale of 6,562,106 ounces of silver and 43,430 ounces of gold at higher average realized prices compared to 2024. The company reported a strong cash position of $215.4 million as of December 31, 2025. Key milestones included the commissioning of the Terronera mine, the acquisition of Kolpa, and the sale of the Bolañitos mine. The company also completed a $350 million convertible notes offering to advance its strategic objectives. The financial overview for the year showed an increase in revenue, operating earnings, and cash flow compared to 2024. However, the company reported a net loss for the year of $119.1 million. Additionally, an update on the impact of security concerns in Mexico on operations was addressed, with operations at Terronera being temporarily paused and later resumed. The company provided a detailed breakdown of its financial performance, measures, and ratios, highlighting key figures such as EBITDA, adjusted net earnings, mine operating cash flow, and direct operating costs per tonne. The detailed financial information including direct costs, EBITDA, and adjusted EBITDA were provided for the fourth quarter and the full year of 2025. Investors were invited to a conference call to discuss the Q4 2025 financial results further. Further updates and disclosures can be found on the company's website.",
            "link": "https://www.markets.news/headlines/b3c8a0b1-e8d3-4b0f-8dd9-54e7b34f7b84",
            "pub_date": "2026-02-27 19:50:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ANI Pharmaceuticals reported record Q4 and full year 2025 financial results with net revenues of $247.1 million and $883.4 million, up 29.6% and 43.8% y-o-y. Rare Disease net revenue was $131.3 million and $422.6 million, Generics net revenue was $100.8 million and $384.1 million. Quarterly GAAP net income was $27.5 million, full year was $77.2 million. Adjusted non-GAAP EBITDA was $65.4 million quarterly and $229.8 million full year, with EPS at $1.18 and $2.33 quarterly, $3.32 and $7.89 full year. ANI projected over $1 billion revenue in 2026. They had $285.6 million in cash as of Dec 31, 2025. For 2026, they forecast net revenue between $1.055B - $1.115B, Cortrophin Gel net revenue of $540M - $575M, ILUVIEN net revenue of $78M - $83M, adjusted non-GAAP EBITDA of $275M - $290M, and adjusted non-GAAP EPS of $8.83 - $9.34. The Company's focus areas include Rare Disease, Generics, and Brands businesses.",
            "id": "2e270a1c-c0fe-48d2-9880-3e1d9e41b57d",
            "description": "ANI Pharmaceuticals, Inc. announced its financial results for the fourth quarter and full year ending December 31, 2025, with record net revenues of $247.1 million and $883.4 million, up 29.6% and 43.8% year-over-year, respectively. Rare Disease quarterly and full-year net revenues were $131.3 million and $422.6 million, up 50.8% and 84.1% year-over-year. Purified Cortrophin Gel net revenues were $111.4 million and $347.8 million, up 87.6% and 75.6%. ILUVIEN and YUTIQ net revenues were $19.8 million and $74.9 million. GAAP net income for the quarter was $27.5 million and $77.2 million for the full year. Adjusted non-GAAP EBITDA was $65.4 million for the quarter and $229.8 million for the full year. Quarterly diluted GAAP income per share was $1.18 and adjusted non-GAAP diluted earnings per share was $2.33. The company expects over $1 billion in revenue in 2026, with Rare Disease representing about 60% of total revenue. ANI's total net revenues for the fourth quarter were $247.1 million, up 29.6% over the prior year period. The company's liquidity included $285.6 million in cash and cash equivalents. ANI reaffirmed its full-year 2026 financial guidance, with expected growth in various segments including Cortrophin Gel, ILUVIEN, adjusted non-GAAP EBITDA, and adjusted non-GAAP diluted EPS. Further details were provided on various non-GAAP financial measures used by the company, and its strategy moving forward to drive growth.",
            "link": "https://www.markets.news/headlines/2e270a1c-c0fe-48d2-9880-3e1d9e41b57d",
            "pub_date": "2026-02-27 19:51:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6561e3bc-9d4b-432e-9981-d9ad8d614b3e",
            "description": "Kremlin: 'The President held an operational meeting with the permanent members of the Security Council via video link Issues related to strengthening the foundations of the constitutional system were discussed. A report was presented by the Minister of Justice, Konstantin",
            "link": "https://www.markets.news/headlines/6561e3bc-9d4b-432e-9981-d9ad8d614b3e",
            "pub_date": "2026-02-27 19:51:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "71cda6ee-b095-4944-877c-b74ce108839f",
            "description": "PAKISTAN MILITARY SPOKESPERSON: HIT MILITARY TARGETS IN 22 LOCATIONS IN AIR STRIKES IN AFGHANISTAN",
            "link": "https://www.markets.news/headlines/71cda6ee-b095-4944-877c-b74ce108839f",
            "pub_date": "2026-02-27 19:41:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0a446b75-729e-460b-a7ec-bb74be39e2e2",
            "description": "PAKISTAN MILITARY SPOKESPERSON: AT LEAST 12 PAKISTANI SOLDIERS KILLED",
            "link": "https://www.markets.news/headlines/0a446b75-729e-460b-a7ec-bb74be39e2e2",
            "pub_date": "2026-02-27 19:42:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "White Oil Market to reach $2.77 billion by 2030, per MarketsandMarkets™ - Delray Beach, Fla., Feb. 27, 2026 /PRNewswire.",
            "id": "68ef5e7a-bbf1-4486-9462-ff73d4ed9509",
            "description": "In Delray Beach, Florida, recent data from MarketsandMarkets revealed findings on the global white oil market. The report, titled \"White Oil Market by Grade (Pharmaceutical, Food, Technical), Application (Polymers, Personal Care, Textiles, Pharmaceuticals, Adhesives & Sealants, Food), and Region,\" forecasts trends up to 2030. This comprehensive analysis covers various sectors like pharmaceuticals, food, and technical grades, with key applications including polymers, personal care products, textiles, pharmaceuticals, adhesives, sealants, and food. The report provides crucial insights into market dynamics and anticipates significant growth in the industry in the coming years.",
            "link": "https://www.markets.news/headlines/68ef5e7a-bbf1-4486-9462-ff73d4ed9509",
            "pub_date": "2026-02-27 19:42:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Judge denies Binance's request for arbitration in crypto loss dispute. Customers can pursue claims. US District Judge Andrew Carter rules in Southern District of NY. Binance failed to inform customers about changes to terms.",
            "id": "b9955f44-e311-4ebb-a387-8fba497749e4",
            "description": "A federal judge in the Southern District of New York rejected a request for arbitration from cryptocurrency exchange Binance (CRYPTO: BNB) in a case related to customer claims on losses from unregistered tokens. Judge Andrew Carter stated that Binance did not sufficiently notify its customers about changes to its terms of usage, which included an arbitration mandate and a class-action waiver. Customers are now permitted to pursue their claims against Binance. This ruling follows a dispute over the alleged class-action waiver within Binance’s terms. The full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/b9955f44-e311-4ebb-a387-8fba497749e4",
            "pub_date": "2026-02-27 19:43:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7e87a438-8dd1-4c50-bc17-5e70eac4ff5a",
            "description": "The UK's Green Party has shocked the country with its first ever Westminster by-election win. Prime Minister Keir Starmer's Labour Party suffered defeat in Gorton and Denton, an area of Greater Manchester, that it had dominated for almost a century, a loss that underscores the",
            "link": "https://www.markets.news/headlines/7e87a438-8dd1-4c50-bc17-5e70eac4ff5a",
            "pub_date": "2026-02-27 19:45:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}