{
    "data": [
        {
            "title": "MaxLinear to showcase Sierra radio SoC at MWC Barcelona 2026 for FDD Massive MIMO with PIM cancellation, offering compact, cost-effective O-RUs.",
            "id": "0dabe4e9-491e-47e4-9375-2b2e086b00b7",
            "description": "At the upcoming Mobile World Congress in Barcelona, MaxLinear is set to showcase its Sierra single-chip radio System on a Chip (SoC) integrated with PIM cancellation technology. This innovative solution aims to facilitate the creation of compact and affordable Frequency Division Duplex (FDD) Massive Multiple Input Multiple Output (MIMO) Remote Units (O-RUs) supporting 5G networks. This development signifies a significant step towards enhanced efficiency and performance in the telecommunications industry.",
            "link": "https://www.markets.news/headlines/0dabe4e9-491e-47e4-9375-2b2e086b00b7",
            "pub_date": "2026-02-26 21:40:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Texas A&M Engineering Experiment Station partners with ZettaJoule to explore building a research reactor in College Station, TX, aiming to catalyze up to $1 billion in collaborations, partnerships, and federal funding.",
            "id": "49090e8e-97b0-4215-8a9a-c6853854b204",
            "description": "In College Station, Texas, the Texas A&M Engineering Experiment Station (TEES) has partnered with ZettaJoule, a small modular reactor company, to consider constructing a cutting-edge research reactor in the area. This collaboration could spark around $1 billion in research partnerships, industrial collaborations, and governmental funding opportunities over the next ten years. This initiative aims to establish Texas A&M Engineering as a leader in the field.",
            "link": "https://www.markets.news/headlines/49090e8e-97b0-4215-8a9a-c6853854b204",
            "pub_date": "2026-02-26 21:40:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Perfect Corp. partners with True Beauty Lashes to launch LashLovr™, a personalized lash recommendation experience using Virtual Try-On APIs.",
            "id": "f6e816b1-2e29-4d6c-aa2e-b02f81fb2fff",
            "description": "In New York, Perfect Corp., a top player in AI and AR beauty and fashion tech, has teamed up with True Beauty Lashes for a new venture. This collaboration gave birth to LashLovr, a unique platform offering a tailored false lash matching and virtual try-on experience. Utilizing Perfect Corp.'s innovative Virtual Try-On and Face Analyzer APIs, LashLovr enables users to instantly see how recommended lashes look on them in real time. This move is set to revolutionize how customers explore and purchase false lashes.",
            "link": "https://www.markets.news/headlines/f6e816b1-2e29-4d6c-aa2e-b02f81fb2fff",
            "pub_date": "2026-02-26 21:40:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US stock futures fluctuated on Thursday; jobless claims rose to 212,000. Dow Jones +0.23%, S&P 500 +0.05%, Nasdaq -0.05%. Nvidia up 1.28% due to strong financials; Salesforce drops 3.94%. Fed likely to keep interest rates unchanged in March.",
            "id": "24a82aae-ff4b-4db3-8da0-b06ea7fad2bc",
            "description": "U.S. stock futures fluctuated on Thursday following a previous day's rise, with major benchmark indices showing mixed performance. Weekly jobless claims increased by 4,000 to 212,000 for the week ending Feb. 21. The four-week moving average rose slightly to 220,250, indicating a stable labor market despite cooling economic signals. The 10-year Treasury bond yielded 4.05%, with the two-year bond at 3.47%. The CME Group's FedWatch tool projected a 98% chance of the Federal Reserve keeping interest rates steady in March. Key index performances were Dow Jones +0.23%, S&P 500 +0.05%, Nasdaq 100 -0.05%, and Russell 2000 +0.26%. Pre-market, the SPDR S&P 500 ETF Trust (SPY) rose 0.081% to $693.71, while the Invesco QQQ Trust ETF (QQQ) increased 0.036% to $616.64. Nvidia (NVDA) surged 1.28% after posting strong Q4 results, with Salesforce (CRM) declining 3.94%.",
            "link": "https://www.markets.news/headlines/24a82aae-ff4b-4db3-8da0-b06ea7fad2bc",
            "pub_date": "2026-02-26 21:40:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "45831858-9edf-41b1-b6e4-045ecf256a39",
            "description": "SENIOR IRANIAN OFFICIAL: TALKS RAISED NEW IDEAS THAT REQUIRE CONSULTATION WITH TEHRAN, SOME GAPS REMAIN.",
            "link": "https://www.markets.news/headlines/45831858-9edf-41b1-b6e4-045ecf256a39",
            "pub_date": "2026-02-26 21:40:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c15310bd-a43c-4179-ab5d-bbba23a8937c",
            "description": "Senior Iranian official to sources: Reaching a deal framework possible if the US is 'seriously separates nuclear and non-nuclear issues’",
            "link": "https://www.markets.news/headlines/c15310bd-a43c-4179-ab5d-bbba23a8937c",
            "pub_date": "2026-02-26 21:40:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "376e2230-b713-4cfe-80eb-8e286c3f8799",
            "description": "SENIOR IRANIAN OFFICIAL : TALKS WITH U.S. IN GENEVA HAVE BEEN INTENSE AND SERIOUS.",
            "link": "https://www.markets.news/headlines/376e2230-b713-4cfe-80eb-8e286c3f8799",
            "pub_date": "2026-02-26 21:41:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OneMedNet and ViuHealth collaborate to boost autoimmune dataset scale to drive recurring revenue from life sciences and AI clients.",
            "id": "2693f659-b506-49cf-9259-d22f43fafc3d",
            "description": "OneMedNet has collaborated with ViuHealth to boost the scale of their autoimmune dataset, which will facilitate faster growth in recurring revenue from life sciences and AI clients. This partnership aims to leverage ViuHealth's expertise to enhance the dataset's capabilities, ultimately benefiting from increased revenue streams. The alliance is expected to significantly increase the dataset's capacity, attracting more customers from the life sciences and AI sectors.",
            "link": "https://www.markets.news/headlines/2693f659-b506-49cf-9259-d22f43fafc3d",
            "pub_date": "2026-02-26 21:41:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Standard Motor Products (SMP) beats Q4 estimated earnings by 19.15%, reports EPS of $0.56. Revenue up $41.74M from last year.",
            "id": "6416cd5e-4ae2-4061-94d9-67d1842008a5",
            "description": "On Thursday, February 26, 2026 at 08:30 AM, Standard Motor Products (NYSE: SMP) released its Q4 earnings report. The company exceeded estimated earnings by 19.15%, recording an EPS of $0.56 compared to the expected $0.47. Revenue saw a significant increase of $41.74 million compared to the previous year. In the latest quarter, Standard Motor Products outperformed again. For further details, the complete news article can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/6416cd5e-4ae2-4061-94d9-67d1842008a5",
            "pub_date": "2026-02-26 21:41:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere Energy Partners released Q4 earnings: EPS beat estimate by 120.37% at $2.38, revenue up $450 million.",
            "id": "c0c123db-7023-472d-999e-91713628ca7e",
            "description": "Cheniere Energy Partners (NYSE: CQP) announced its Q4 earnings on February 26, 2026, at 07:30 AM. The key updates from the earnings report indicate surpassing estimated earnings significantly by 120.37%, with an EPS of $2.38 compared to the predicted $1.08. Additionally, revenue saw an increase of $450.00 million year-over-year. In previous quarters, the company had fallen short on EPS. For a detailed account of this news, please refer to the complete article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/c0c123db-7023-472d-999e-91713628ca7e",
            "pub_date": "2026-02-26 21:41:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Starfighters Space expands operations in Midland, Texas, relocating aircraft and hardware to increase mission cadence.",
            "id": "907d5260-9ea4-4d48-b34c-bb72e15d6c34",
            "description": "Starfighters Space, a leading aerospace company listed on NYSE American under the symbol FJET, is expanding its operations at the Midland International Air & Space Port. The company, known for its fleet of high-speed Mach 2+ capable aircraft, is relocating aircraft, engines, and support equipment to accommodate a rise in mission frequency. This move comes as part of their efforts to enhance their operational presence at the port and align with an expected surge in mission activity. This development signifies a significant step for Starfighters as they gear up for increased operations at the Midland International Air & Space Port.",
            "link": "https://www.markets.news/headlines/907d5260-9ea4-4d48-b34c-bb72e15d6c34",
            "pub_date": "2026-02-26 21:34:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Priority Technology Holdings, Inc. (NASDAQ: PRTH) to report Q4 and full-year 2025 financial results on March 10, 2026.",
            "id": "9a039cfe-1643-420c-a5f6-35fc6cb8137a",
            "description": "Alpharetta, Georgia-based Priority Technology Holdings, Inc. (NASDAQ: PRTH), a provider of payments and banking solutions aimed at simplifying the process of collecting, storing, lending, and transferring money to enhance revenue potential, disclosed plans to unveil its financial outcomes for the fourth quarter and full-year of 2025 on Tuesday, March 10, 2026, before the trading day commences. The Company is scheduled to conduct a conference call and webcast at 10:00 AM to analyze its financial performance and operational highlights.",
            "link": "https://www.markets.news/headlines/9a039cfe-1643-420c-a5f6-35fc6cb8137a",
            "pub_date": "2026-02-26 21:34:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Musaffa launches Global Halal Investment Platform for 600,000+ Muslim investors across 200+ countries to access US markets.",
            "id": "acb3fadb-ac30-46df-b420-3316a7034609",
            "description": "A prominent fintech platform called Musaffa unveiled its Global Halal Investment Platform in New York. This innovative platform caters to over 600,000 Muslim investors from more than 200 countries. It offers these investors enhanced access to US capital markets through a regulated and scalable trading and investment infrastructure, all while ensuring Shariah compliance is integrated directly into the investment process. This launch signifies a significant advancement in expanding opportunities for Muslim investors worldwide.",
            "link": "https://www.markets.news/headlines/acb3fadb-ac30-46df-b420-3316a7034609",
            "pub_date": "2026-02-26 21:34:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Manhattan Associates CFO Dennis Story to retire on March 31, 2026; Linda Pinne to succeed him. Story to advise CEO till 2026.",
            "id": "9f540486-8d33-46f7-86a4-6010c5578852",
            "description": "Today, Manhattan Associates Inc. revealed that Dennis Story, the current Executive Vice President & Chief Financial Officer (NASDAQ: MANH), will retire from his role by March 31, 2026. Following his departure, Linda Pinne will take over his responsibilities as the Senior Vice President and new Chief Financial Officer, Chief Accounting Officer, and Treasurer. Mr. Story will stay on as an advisor to the CEO until the close of 2026, easing into his retirement.",
            "link": "https://www.markets.news/headlines/9f540486-8d33-46f7-86a4-6010c5578852",
            "pub_date": "2026-02-26 21:34:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LG Display and Universal Display Corporation extend OLED partnership with long-term agreements for materials supply and licensing.",
            "id": "b758aae9-5541-4fd7-98df-36b746402746",
            "description": "A company based in Ewing, New Jersey, UDC, has recently disclosed that they have extended their OLED material supply and license agreements with LG Display, a renowned tech company. This development highlights UDC's commitment to a long-term partnership with LG Display. The specifics of the extension, including the duration and financial details, were not provided in the announcement. This agreement signifies a mutually beneficial relationship between the two companies in the OLED industry.",
            "link": "https://www.markets.news/headlines/b758aae9-5541-4fd7-98df-36b746402746",
            "pub_date": "2026-02-26 21:34:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zurn Elkay releases 2025 Sustainability Report, preventing 20 billion plastic bottles and delivering 2.4 billion gallons of filtered water.",
            "id": "b33464cf-f938-49d7-8c76-5650deeea501",
            "description": "Milwaukee-based Zurn Elkay Water Solutions (NYSE: ZWS) unveiled its 2025 Sustainability Report, showcasing advancements in environmental stewardship and expanded offerings to aid customers in achieving sustainability targets. Key accomplishments in 2025 comprise preventing 20 billion plastic bottles from polluting water sources and dumps, as well as delivering 2.4 billion gallons of purified drinking water. The company's dedication to sustainability is evident through these impactful figures and initiatives.",
            "link": "https://www.markets.news/headlines/b33464cf-f938-49d7-8c76-5650deeea501",
            "pub_date": "2026-02-26 21:35:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Family launches BrickPack, a portable play bag with 60-inch play mat on Amazon - solves brick clutter issue - helps kids play anywhere.",
            "id": "6ad0b237-a1bb-4c66-a8ef-483aae2302f2",
            "description": "A new family-designed bag, with a patent pending, featuring a 60-inch play mat has been released on Amazon. This innovative product aims to assist kids in transporting bricks conveniently, while also aiding parents in quicker clean-up and reducing clutter. Originating from Orange County, Calif., the launch of this product occurred on Feb. 26, 2026. Fed up with stepping on bricks, this family now offers a solution to this common issue.",
            "link": "https://www.markets.news/headlines/6ad0b237-a1bb-4c66-a8ef-483aae2302f2",
            "pub_date": "2026-02-26 21:35:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Loar Holdings beat Q4 earnings estimate by 36.84%, reporting EPS of $0.26. Revenue increased by $21.31 million.",
            "id": "20f4b57a-183c-477c-9024-782ae4f7f10f",
            "description": "Loar Holdings (NYSE: LOAR) unveiled its Q4 earnings on Thursday, February 26, 2026 at 08:30 AM. Key highlights include surpassing estimated earnings by 36.84%, posting an EPS of $0.26 compared to the projected $0.19. Revenue also saw growth, increasing by $21.31 million from the corresponding period in the prior year. In the previous quarter, the company outperformed... More details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/20f4b57a-183c-477c-9024-782ae4f7f10f",
            "pub_date": "2026-02-26 21:35:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Airbnb surges in rankings with growth score jumping from 61.98 to 94.75; records $12.2 billion annual revenue. Analysts bullish on stock potential, Deutsche Bank raises price target to $154.",
            "id": "0ee89826-5e33-4f2a-8750-5c231489afbe",
            "description": "Airbnb Inc. (NASDAQ: ABNB) has soared to the top 10% of growth stocks, with its growth score skyrocketing from 61.98 to 94.75 in the latest rankings by Benzinga Edge. The impressive leap in percentile follows a strong fourth-quarter performance where Airbnb reported revenue of $2.78 billion, surpassing the estimated $2.72 billion. Despite falling short of earnings-per-share expectations, the company achieved a record-breaking fiscal year with total revenue hitting $12.2 billion, indicating strong demand in the travel industry. Analysts are increasingly optimistic about Airbnb's long-term growth prospects, with Wall Street cheering its success in the \"narrative battle.\" Deutsche Bank upgraded the stock from Hold to Buy, setting a new price target of $154. Key initiatives like the \"Reserve Now Pay Later\" (RNPL) option and a simplified host fee have been lauded for driving Airbnb's growth. For the full article, please visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/0ee89826-5e33-4f2a-8750-5c231489afbe",
            "pub_date": "2026-02-26 21:35:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "infinitii ai inc. experiences 100% customer retention, grows Q2 revenue to $640,827 with a 2.2% increase from Q1; attracts 2 new firms.",
            "id": "04156e24-85ba-49c2-8897-0f8b386b556f",
            "description": "infinitii ai inc., a leader in AI-driven predictive analytics software for Smart City water and Smart Industry infrastructure applications, has reported its annual financial and operational highlights for the second quarter of fiscal year 2026. The Company closed an oversubscribed $610,000 convertible debenture financing, improving its balance sheet and reducing accounts payable by 33%. Revenue for Q2 FY2026 was $640,827, a 2.2% increase from Q1 FY2026, with 100% customer retention. The operating loss was $266,595, including non-cash charges, but showed improvement from the previous quarter. The Company attracted two large engineering services firms to accelerate revenue growth in FY2026. CEO Jean Charles Phaneuf expressed confidence in the Company's direction and financial stability. Further details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/04156e24-85ba-49c2-8897-0f8b386b556f",
            "pub_date": "2026-02-26 21:35:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}