{
    "data": [
        {
            "title": "",
            "id": "c34a1c49-5d84-4a99-aa9e-885fbf19bd3e",
            "description": "MELONI: ITALY WON'T EXERCISE INFLUENCE OVER PASCHI GOVERNANCE",
            "link": "https://www.markets.news/headlines/c34a1c49-5d84-4a99-aa9e-885fbf19bd3e",
            "pub_date": "2026-02-27 21:21:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c0b85041-d543-46dc-8daa-53fd93d64fbd",
            "description": "SPOT SILVER RISES OVER 3% TO $91.26/OZ",
            "link": "https://www.markets.news/headlines/c0b85041-d543-46dc-8daa-53fd93d64fbd",
            "pub_date": "2026-02-27 21:22:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d294b355-83a6-4ee3-bcd7-003e3bc46d01",
            "description": "Pentagon's Michael on Anthropic: Let's see how today goes, want to continue dialogue",
            "link": "https://www.markets.news/headlines/d294b355-83a6-4ee3-bcd7-003e3bc46d01",
            "pub_date": "2026-02-27 21:22:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Digital Realty Trust Inc Q4 earnings tested credit ratings, with S&P BBB+, Fitch BBB, Moody's Baa2. Revenue grew 13.9%, FFO/share up 7.5%, fee income doubled to $137.2M. Net debt-to-Adj. EBITDA 4.9x, issued $1.6B Eurobonds in Nov. fell to $0.24 in Q4 from $0.51 last year.",
            "id": "25d6cce4-5b78-4970-9407-705d5c495504",
            "description": "Digital Realty Trust Inc (NYSE: DLR) reported fourth-quarter results that highlight a discrepancy in credit ratings by different agencies. S&P rates the company at BBB+, while Fitch and Moody’s rate one notch lower at BBB and Baa2 respectively. Q4 results for Digital Realty showed positive growth with Core FFO per share reaching $1.86, a 7.5% increase over Q4 2024, bringing the full-year figure to $7.39, a 10.1% increase. Revenue grew by 13.9% to approximately $1.63 billion, driven by demand in hyperscale and enterprise segments. Fee income also doubled from $64.9 million in 2024 to $137.2 million in 2025, following an oversubscribed closed-end fund that attracted $3.225 billion in commitments. The company's balance sheet maintained health with a net debt-to-Adjusted EBITDA at 4.9x. In November, Digital Realty issued €1.4 billion of green Eurobonds and repaid €1.075 billion of senior notes in December. However, GAAP net income per share fell to $0.24 in Q4, with a $78.5 million impairment provision and elevated operating costs. Transaction and integration expenses totaled $36.1 million in the quarter. While S&P credits the company's capital diversification, increasing fee income, and leverage discipline, Fitch and Moody's take a more cautious stance due to the drop in net income and high AFFO payout ratio.",
            "link": "https://www.markets.news/headlines/25d6cce4-5b78-4970-9407-705d5c495504",
            "pub_date": "2026-02-27 21:22:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7baf5805-bb07-45f4-9fc5-5c3989ab1a32",
            "description": "The European Union will provisionally apply a contentious free trade agreement with South American bloc Mercosur to ensure the bloc secures first-mover advantage, European Commission President Ursula von der Leyen has said. The European Commission concluded its largest ever",
            "link": "https://www.markets.news/headlines/7baf5805-bb07-45f4-9fc5-5c3989ab1a32",
            "pub_date": "2026-02-27 21:22:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gogo (NASDAQ: GOGO) beats Q4 earnings estimates by 100%, reports EPS of $0.02, revenue increases by $92.76 million.",
            "id": "7facbf9e-f32b-44f6-afa6-6b0bc41431d2",
            "description": "On Friday, February 27, 2026, at 07:00 AM, Gogo (NASDAQ: GOGO) published its Q4 earnings report. The latest announcement revealed that Gogo surpassed expected earnings by 100.0%, with an EPS of $0.02 compared to the estimated $0.01. Additionally, their revenue saw an increase of $92.76 million compared to the previous year. In the last quarter, Gogo's performance in earnings demonstrated a significant positive trend. For a detailed analysis, the complete article is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/7facbf9e-f32b-44f6-afa6-6b0bc41431d2",
            "pub_date": "2026-02-27 21:22:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Globalstar's Q4 earnings report is out. It missed estimated earnings by -1200%, with EPS at $-0.11 vs $0.01. Revenue rose by $10.78 million.",
            "id": "6e612d59-125a-4188-8f78-17944c7197cb",
            "description": "Globalstar (NASDAQ: GSAT) recently released its Q4 earnings report on February 27, 2026, at 08:00 AM. Investors should take note that Globalstar's earnings fell short of expectations by -1200.0%, with an EPS of $-0.11 compared to the estimated $0.01. Despite missing on earnings, the company saw a revenue increase of $10.78 million from the previous year's figures. For more details on Globalstar's performance and how it compared to the previous earnings, the full story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/6e612d59-125a-4188-8f78-17944c7197cb",
            "pub_date": "2026-02-27 21:22:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a88f3667-35a5-44cd-8f0a-074f8bc14b7e",
            "description": "Pentagon's Michael, on Anthropic, reiterates today's deadline",
            "link": "https://www.markets.news/headlines/a88f3667-35a5-44cd-8f0a-074f8bc14b7e",
            "pub_date": "2026-02-27 21:23:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Google and OpenAI employees demand 'red lines' in Pentagon AI contracts, over 100 Google staff members signed a letter expressing concerns.",
            "id": "8ca695f0-8590-4472-872a-b1128e9b3d29",
            "description": "Employees at Alphabet's Google, listed as GOOGL and GOOG on NASDAQ, are voicing their concerns about the company's collaboration with the Pentagon on artificial intelligence technology. More than 100 Google employees wrote a letter to management outlining their worries and suggesting the implementation of clear boundaries or \"red lines\" for government contracts similar to those followed by Anthropic. The New York Times reported on Thursday that the employees are troubled by the potential use of Google's Gemini A.I. product by the U.S. military for surveilling American citizens and operating autonomous weapons without human oversight. The letter was directed to Jeff Dean, the chief scientist at Google's A.I. division, Google DeepMind. Dean has expressed support for Anthropic, a stance that conflicts with the employees' concerns. The complete story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/8ca695f0-8590-4472-872a-b1128e9b3d29",
            "pub_date": "2026-02-27 21:23:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e114fed5-548f-4df9-b2ad-37cae3259e7a",
            "description": "BITCOIN SLIDES AS TECH FEARS HIT MARKETS Bitcoin reversed earlier gains as U.S. stock futures dropped, pressured by concerns over AI’s impact on businesses and tech investment returns. With tech stocks leading expected monthly losses, crypto followed the risk-off mood. Bitcoin",
            "link": "https://www.markets.news/headlines/e114fed5-548f-4df9-b2ad-37cae3259e7a",
            "pub_date": "2026-02-27 21:24:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "efde86da-b6ca-4506-be18-1ee53014047c",
            "description": "COCOA MARKET SHOULD SEE CONTINUED VOLATILITY IN 2026 -HEDGEPOINT GLOBAL MARKETS",
            "link": "https://www.markets.news/headlines/efde86da-b6ca-4506-be18-1ee53014047c",
            "pub_date": "2026-02-27 21:16:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Faruqi & Faruqi, LLP investigating claims on behalf of investors of Driven Brands Holdings for significant losses. Contact for options.",
            "id": "bd2fce9f-1fd6-43ff-8490-b9211e75819d",
            "description": "Securities Litigation Partner James Wilson from Faruqi & Faruqi, LLP is urging investors who have experienced substantial losses in Driven Brands to reach out to him directly. If you have suffered significant losses in Driven Brands stocks or options and wish to explore your options, Wilson encourages you to contact him.",
            "link": "https://www.markets.news/headlines/bd2fce9f-1fd6-43ff-8490-b9211e75819d",
            "pub_date": "2026-02-27 21:17:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aukce luxusních položek Gwyneth Paltrow: 24.-25. března 2026 v Beverly Hills. Online přihazování od 25. února 2026.",
            "id": "20b566f1-8277-480a-abd3-cc1e7b3dbf2d",
            "description": "Live auction: March 24th and 25th, 2026 - The Peninsula Beverly Hills hotel Online bidding starts: February 25th, 2026 BEVERLY HILLS, California, February 27th, 2026 -- Julien's Auctions proudly presents Bold Luxury: Stylish lexicon of Gwyneth Paltrow & archival selection...",
            "link": "https://www.markets.news/headlines/20b566f1-8277-480a-abd3-cc1e7b3dbf2d",
            "pub_date": "2026-02-27 21:17:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d9ccc531-6993-4fa2-9fc3-4e795c6108c0",
            "description": "BOE'S PILL SAYS DISINFLATION NOT COMPLETE, UNDERLYING PRESSURES KEY",
            "link": "https://www.markets.news/headlines/d9ccc531-6993-4fa2-9fc3-4e795c6108c0",
            "pub_date": "2026-02-27 21:17:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK gambling regulator considers allowing crypto for online betting after strict checks; FCA authorization needed for usage - chief Tim Miller.",
            "id": "2b3763ff-bf57-496b-a633-93e953610b4f",
            "description": "Tim Miller, the chief of the Gambling Commission, stated that any potential launch would necessitate adhering to rigorous affordability and suitability assessments. He emphasized that cryptocurrency transactions would have to be authorized by the FCA.",
            "link": "https://www.markets.news/headlines/2b3763ff-bf57-496b-a633-93e953610b4f",
            "pub_date": "2026-02-27 21:18:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mexico is top spring break destination for U.S. residents. Travel to Mexico reopens amid pandemic with key guidance.",
            "id": "36f3f728-3827-4a51-801b-1f2cdb459d5f",
            "description": "As per sales data from Squaremouth, Mexico has maintained its position as the preferred international spring break destination for U.S. residents for over five years running. After the recent lift of the shelter-in-place restrictions, this trend is likely to continue. St. Petersburg, Florida, was the location where this data was reported on February 27, 2026, through PRNewswire. This information showcases the enduring popularity of Mexico for American travelers during the spring break season.",
            "link": "https://www.markets.news/headlines/36f3f728-3827-4a51-801b-1f2cdb459d5f",
            "pub_date": "2026-02-27 21:19:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c3420b0a-fa4b-47e8-9e1d-df0bc2baaf76",
            "description": "Pentagon's Michael on Anthropic: The US offered concessions",
            "link": "https://www.markets.news/headlines/c3420b0a-fa4b-47e8-9e1d-df0bc2baaf76",
            "pub_date": "2026-02-27 21:20:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitwise's Matt Hougan refutes Bitcoin conspiracy theories, attributing BTC's decline to people selling due to various reasons.",
            "id": "fa904d15-61db-43f3-81c4-0bbb8c7cabfb",
            "description": "Bitwise's Chief Investment Officer, Matt Hougan, refuted conspiracy theories linking Jane Street and others to Bitcoin's recent decline, stating that individuals who were heavily invested in Bitcoin opted to sell their holdings as Bitcoin hovered within key Fibonacci levels. Hougan dismissed the ongoing trend of conspiracy theories targeting different firms weekly and highlighted the real reasons behind the sell-off: investors liquidating their Bitcoin via spot transactions, closing leveraged positions, and writing calls against their assets. This sell-off was primarily driven by factors such as four-year cycle patterns, concerns regarding quantum computing, interests in AI startups, among others. Hougan indicated that the majority of sellers have completed their transactions, suggesting that the situation may stabilize. For further details, the full story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/fa904d15-61db-43f3-81c4-0bbb8c7cabfb",
            "pub_date": "2026-02-27 21:21:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Antier introduces enterprise white-label crypto wallet in Latin America in just 60 days for improved efficiency.",
            "id": "dd55e9d6-0483-4c29-b0ff-5c864e4d7ca9",
            "description": "In New Delhi on February 27, 2026, Antier introduced a high-speed white-label cryptocurrency wallet tailored for LATAM businesses. This platform is designed for performance rather than hype, surpassing traditional bank projects in speed and surpassing generic wallets in security. The wallet is optimized for handling payroll, remittances, and other transactions efficiently.",
            "link": "https://www.markets.news/headlines/dd55e9d6-0483-4c29-b0ff-5c864e4d7ca9",
            "pub_date": "2026-02-27 21:21:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "nLIGHT, Inc. (Nasdaq: LASR) to attend investor events in Q1 2026, including Raymond James Conference on March 3.",
            "id": "7508a6e4-5fc7-4f6b-945c-148d5f2dca66",
            "description": "CAMAS, Wash.--nLIGHT, Inc., a top supplier of high-power lasers for critical directed energy, optical sensing, and advanced manufacturing uses, shared their involvement in various investor events in Q1 2026. The key events include Raymond James 47th Annual Institutional Investors Conference on March 3, 2026, held at JW Marriott Grande Lakes in Orlando, FL, and the Stifel 2026 NYC Technology One-on-One Conference later in the month. nLIGHT, listed on Nasdaq as LASR, continues to drive innovation with their leading laser technology.",
            "link": "https://www.markets.news/headlines/7508a6e4-5fc7-4f6b-945c-148d5f2dca66",
            "pub_date": "2026-02-27 21:12:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}