{
    "data": [
        {
            "title": "",
            "id": "78292dc4-819d-4512-acff-56b9bc437ba8",
            "description": "DENMARK PRIME MINISTER: NO ONE FROM OUTSIDE DENMARK SHOULD DECIDE OVER A DEMOCRATIC ELECTION IN DENMARK",
            "link": "https://www.markets.news/headlines/78292dc4-819d-4512-acff-56b9bc437ba8",
            "pub_date": "2026-02-26 19:52:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Krispy Kreme's Q4 2025: Revenue $392.4M with Organic Rev down 3.9% & Net Loss $29.1M; Adjusted EBITDA $55.6M; Operating Cash $45.0M.",
            "id": "f520ff6e-7713-4a14-af78-bf0343cc732b",
            "description": "Krispy Kreme, Inc. (NASDAQ: DNUT) disclosed its financial outcomes for the last quarter and full year concluded on December 28, 2025. In comparison to Q4 2024, the company achieved a net revenue of $392.4 million, although there was a fall of 3.9% in organic revenue due to the deliberate shutdown of unproductive outlets. Krispy Kreme also reported a GAAP net loss of $29.1 million, with an adjusted EBITDA of $55.6 million. Additionally, the company generated $45.0 million from operating activities in cash, contributing to free cash flow.",
            "link": "https://www.markets.news/headlines/f520ff6e-7713-4a14-af78-bf0343cc732b",
            "pub_date": "2026-02-26 19:53:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nordic American Tankers missed Q4 estimated earnings by -50% with EPS of $0.06 (vs. $0.12) and revenue up $12.37M.",
            "id": "5c448676-0b74-48f2-b087-df4dc4d88b6b",
            "description": "Nordic American Tankers (NAT) reported its Q4 earnings on February 26, 2026, at 06:40 AM. The company fell short of estimated earnings by -50.0%, with an EPS of $0.06 compared to the expected $0.12. Revenue increased by $12.37 million from the previous year. In previous earnings reports, NAT had also missed EPS expectations. For more information, the full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/5c448676-0b74-48f2-b087-df4dc4d88b6b",
            "pub_date": "2026-02-26 19:53:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "International Seaways (INSW) Q4 earnings beat estimates by 26.29%, with EPS of $2.45 vs $1.94. Revenue rose $73.27 million.",
            "id": "4909f986-628a-4173-abbe-9ad65ad0e601",
            "description": "The Q4 earnings report for International Seaways (NYSE: INSW) was made public on Thursday, February 26, 2026, at 06:45 AM. The report revealed significant financial achievements. International Seaways exceeded predicted earnings by an impressive 26.29%, posting an EPS of $2.45 compared to the estimated $1.94. Revenue also saw a substantial increase, rising by $73.27 million compared to the corresponding period from the previous year. For a comprehensive analysis, detailed information is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/4909f986-628a-4173-abbe-9ad65ad0e601",
            "pub_date": "2026-02-26 19:53:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gildan Activewear (NYSE: GIL) beat Q4 estimated earnings by 2.13%, with EPS of $0.96 vs $0.94. Revenue up $257.5M from last year.",
            "id": "921874e8-eb2f-4e4b-9566-3ab54b049206",
            "description": "Gildan Activewear (NYSE: GIL) released its Q4 earnings report on Thursday, February 26, 2026, at 06:45 AM. The company surpassed expected earnings by 2.13%, with an EPS of $0.96 compared to the estimated $0.94. Revenue increased by $257.50 million from the previous year. In the previous quarter, Gildan Activewear exceeded EPS expectations by $0.02, resulting in a 2.32% decrease. For more details, the complete story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/921874e8-eb2f-4e4b-9566-3ab54b049206",
            "pub_date": "2026-02-26 19:53:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "74ee6868-fc82-4642-ba16-2a7ccecafd84",
            "description": "BOFA GLOBAL RESEARCH RAISES NVIDIA CORP PRICE OBJECTIVE TO $300.00 FROM $275.00 $NVDA (",
            "link": "https://www.markets.news/headlines/74ee6868-fc82-4642-ba16-2a7ccecafd84",
            "pub_date": "2026-02-26 19:54:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Quarter 4 earnings report for Krispy Kreme (NASDAQ: DNUT) beat estimates by 200% with EPS of $0.09. Revenue down $11.66M from last year.",
            "id": "9cd935ff-a21c-4147-9d9a-5d68d2a48ddc",
            "description": "Krispy Kreme (NASDAQ: DNUT) released its Q4 earnings report on February 26, 2026, at 06:45 AM. The report revealed that Krispy Kreme surpassed estimated earnings by a significant margin of 200.0%, with an EPS of $0.09 compared to the estimated $0.03. However, the revenue for the quarter was down by $11.66 million compared to the corresponding period the previous year. For more details on Krispy Kreme's historical earnings summary and the latest announcement, interested parties can visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/9cd935ff-a21c-4147-9d9a-5d68d2a48ddc",
            "pub_date": "2026-02-26 19:55:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nomad Foods Q4 earnings miss estimate by 0.0%, EPS $0.5. Revenue up $53.22 million. Previous quarter beat EPS by $0.02.",
            "id": "98a74b4f-96e2-481f-8594-c394ad7f10ae",
            "description": "The latest earnings report for Nomad Foods (NYSE: NOMD) was released on February 26, 2026, at 06:45 AM. Nomad Foods fell short of estimated earnings by 0.0%, reporting an EPS of $0.5 compared to the estimated $0.5. Revenue increased by $53.22 million from the previous year. In the prior quarter, Nomad Foods exceeded EPS expectations by $0.02, leading to a 0.67% decrease. More details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/98a74b4f-96e2-481f-8594-c394ad7f10ae",
            "pub_date": "2026-02-26 19:55:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warby Parker reports 13.0% revenue growth in 2025, with $324 per customer and 7.0% Active Customer growth.",
            "id": "6b114264-c6f3-44aa-9d69-ac1b02ff6d97",
            "description": "Warby Parker Inc., a leading direct-to-consumer lifestyle brand specializing in vision products, revealed its financial performance for the fourth quarter and full year ending on December 31, 2025. Throughout the year, the company saw a revenue increase of 13.0%, with the fourth quarter specifically experiencing an 11.2% growth. The number of Active Customers grew by 7.0%, and the Average Revenue per Customer reached $324, marking a 5.7% increase compared to the previous year. Additionally, Warby Parker achieved its first year of positive net income.",
            "link": "https://www.markets.news/headlines/6b114264-c6f3-44aa-9d69-ac1b02ff6d97",
            "pub_date": "2026-02-26 19:55:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss spin-off Clee Medical, developing imaging tech for brain surgery, secures seed funding led by HTGF.",
            "id": "1697a309-963e-4696-9039-8fa2d3de0010",
            "description": "In Geneva, the Wyss Center for Bio and Neuroengineering revealed the completion of the Seed funding round for Clee Medical SA, a Swiss neurotech spin-off pioneering high-resolution real-time intraoperative imaging for brain surgeries. The financing, led by High-Tech Gründerfonds (HTGF), saw involvement from Zürcher Kantonalbank (ZKB), Kickfund, FONGIT, and Venture Kick alongside existing investor Wyss Center Geneva. Clee Medical, a spin-off from Wyss Center, achieved this milestone in their development.",
            "link": "https://www.markets.news/headlines/1697a309-963e-4696-9039-8fa2d3de0010",
            "pub_date": "2026-02-26 19:55:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "62580c5a-c06e-438e-9599-9bf00f2baeda",
            "description": "SWEDEN'S FRA SIGNAL INTELLIGENCE AGENCY: NO SPECIFIC THREAT BEHIND RAISED VIGILANCE",
            "link": "https://www.markets.news/headlines/62580c5a-c06e-438e-9599-9bf00f2baeda",
            "pub_date": "2026-02-26 19:45:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TopBuild sees 13.2% sales increase in Q4 to $1.49 billion, mainly from acquisitions, completes SPI Acquisition.",
            "id": "76ce5703-0fb2-4ed2-bc77-3e8f85814e70",
            "description": "In the last quarter, sales saw a significant increase, totaling $1.49 billion, which reflects a notable 13.2% growth primarily fueled by recent acquisitions. During this period, the company successfully concluded the acquisition of SPI.",
            "link": "https://www.markets.news/headlines/76ce5703-0fb2-4ed2-bc77-3e8f85814e70",
            "pub_date": "2026-02-26 19:46:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "740706e0-903f-4eea-a552-95c3ac24c219",
            "description": "DENMARK'S PRIME MINISTER: DENMARK WILL ‘SOON' HOLD ELECTIONS",
            "link": "https://www.markets.news/headlines/740706e0-903f-4eea-a552-95c3ac24c219",
            "pub_date": "2026-02-26 19:46:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f217e150-81fa-4117-92c8-1173c31778eb",
            "description": "Bird watching in China is becoming increasingly popular and it’s helping boost local economies. Between 2018 and 2023 the number of enthusiasts grew around 143% to 340,000 fans of feathered friends. The China birdwatching tourism market generated $3.6B in 2024 and that’s",
            "link": "https://www.markets.news/headlines/f217e150-81fa-4117-92c8-1173c31778eb",
            "pub_date": "2026-02-26 19:47:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nomad Foods reports 2.4% Adjusted EPS growth in Q4 2025, with moderated organic revenue declines and accelerated retail sell-out.",
            "id": "e812b95d-4bf0-4dad-98ca-052ae878bc11",
            "description": "The latest financial results, announced on February 26, 2026 in Woking, England, diverged from the guidance provided in August 2025. The fourth quarter saw a 2.4% increase in Adjusted EPS. Organic revenue decline was mitigated while retail sell-out saw a notable acceleration during the same period. This performance led to the initiation of foundational changes aimed at unlocking the potential for value creation within the company.",
            "link": "https://www.markets.news/headlines/e812b95d-4bf0-4dad-98ca-052ae878bc11",
            "pub_date": "2026-02-26 19:48:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canada Nickel discovers high-grade awaruite at Midlothian Property, 79% nickel, DTR grades of 0.15%, 0.14%, 0.12%, comparable to others.",
            "id": "176d0019-b962-447f-b08b-1e985c000ef8",
            "description": "Approximately 79% of the total nickel at Midlothian is stored in awaruite, a premium nickel-iron alloy. Mineralogical and Davis Tube Recoverable (\"DTR\") examinations show notable presence of awaruite, with DTR grades measuring at 0.15%, 0.14%, and 0.12% nickel on composite samples. These figures are similar to those seen in other analyses.",
            "link": "https://www.markets.news/headlines/176d0019-b962-447f-b08b-1e985c000ef8",
            "pub_date": "2026-02-26 19:48:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warby Parker (WRBY) Q4 earnings report: missed estimated earnings by -225%, EPS $-0.05 vs $0.04 estimate, revenue up $21.32M.",
            "id": "4a0160c3-c18f-48c9-b7f9-348cfbacd901",
            "description": "Warby Parker (NYSE: WRBY) released its Q4 earnings on Thursday, February 26, 2026, at 06:45 AM. The earnings report revealed that the company fell short of expected earnings by -225.0%, with an EPS of $-0.05 compared to the estimated $0.04. Revenue saw a notable increase, rising by $21.32 million compared to the previous year. This marks a significant deviation in the company's past earnings performance. For further details, the complete story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/4a0160c3-c18f-48c9-b7f9-348cfbacd901",
            "pub_date": "2026-02-26 19:49:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "International Seaways reports $128 million net income in Q4 2025 and $309 million for the full year.",
            "id": "644c6ffd-3c91-4971-b7b7-3b2868c66022",
            "description": "International Seaways, Inc. (NYSE: INSW) has released its financial results for the fourth quarter and full year of 2025. The company, a major global tanker operator specializing in energy transportation, reported a net income of $128 million, equivalent to $2.56 per diluted share, for the fourth quarter. For the entire year, their net income stood at $309 million. These figures indicate a successful period for the Company in terms of financial performance.",
            "link": "https://www.markets.news/headlines/644c6ffd-3c91-4971-b7b7-3b2868c66022",
            "pub_date": "2026-02-26 19:49:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kolibri Global Energy Inc. has released its first Sustainability Report detailing ESG initiatives and key performance indicators. Visit website for more info.",
            "id": "3a7843af-f238-45c2-a19f-de299e8c7007",
            "description": "Kolibri Global Energy Inc. has recently launched its inaugural Sustainability Report, accessible on its website at www.kolibrienergy.com in the \"Investor\" area. This report details the company's Environmental, Social, and Governance (\"ESG\") efforts, practices, and significant key performance indicators. Interested parties can learn more about Kolibri's sustainability initiatives and impact by reviewing the report online. Moreover, the company is listed on both the Toronto Stock Exchange (TSX: KEI) and the NASDAQ (NASDAQ: KGEI).",
            "link": "https://www.markets.news/headlines/3a7843af-f238-45c2-a19f-de299e8c7007",
            "pub_date": "2026-02-26 19:49:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ddc49a20-5af2-4195-8111-64a23f4f8737",
            "description": "DANISH PRIME MINISTER: SEES DK6B TAX ON WEALTH ON THE RICHEST",
            "link": "https://www.markets.news/headlines/ddc49a20-5af2-4195-8111-64a23f4f8737",
            "pub_date": "2026-02-26 19:50:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}