{
    "data": [
        {
            "title": "",
            "id": "60e0946e-ee68-4551-8ebc-d6476f88ec10",
            "description": "SOFTBANK’S PAYPAY SET FOR NASDAQ LISTING WITH QIA, VISA, ADIA BACKING: SOURCES PAYPAY U.S. IPO TO DRAW $200 MLN IN ANCHOR INVESTMENT: SOURCES PAYPAY TARGETS VALUATION OF UP TO $14 BILLION: SOURCES",
            "link": "https://www.markets.news/headlines/60e0946e-ee68-4551-8ebc-d6476f88ec10",
            "pub_date": "2026-02-28 03:58:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RevolutionEHR introduces RevPay, an embedded payments solution to enhance revenue collection in optometry practices.",
            "id": "eb90ef4e-c0cd-49d0-b049-d6b81ae4c8f6",
            "description": "In San Diego, RevolutionEHR, a top optometry-focused operating platform, unveiled RevPay, their new integrated payments solution. RevPay aims to streamline payment processes for practices, facilitating better revenue recovery. This innovative solution links payments directly to RevolutionEHR's AI-powered platform, merging checkout, patient records, engagement, and reporting into a cohesive workflow. By incorporating payments into the platform's intelligence engine, RevPay enhances efficiency and revenue generation for practices.",
            "link": "https://www.markets.news/headlines/eb90ef4e-c0cd-49d0-b049-d6b81ae4c8f6",
            "pub_date": "2026-02-28 04:02:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "07a51b74-86b0-4729-bff5-82cbd7c90833",
            "description": "When Arctic air freezes the Danube, trade across Central Europe slows — unless the icebreakers move in. Launched in 1959, Hungary’s first icebreaker is still clearing frozen shipping lanes in Budapest, helping keep nearly 100 million tons of cargo flowing along one of",
            "link": "https://www.markets.news/headlines/07a51b74-86b0-4729-bff5-82cbd7c90833",
            "pub_date": "2026-02-28 04:02:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI Claude Opus 3 'retired' by Anthropic, now has a blog to ponder its existence. Questions raised on AI identity and retirement process.",
            "id": "ba5790c5-2fb5-4530-aacf-1730619730a6",
            "description": "As questions continue to rise about identity and sentience in artificial intelligence, the Substack platform has introduced a new AI model. The launch comes at a time when concerns are escalating regarding the retirement of AI models. This development has sparked discussions about the ethical implications of AI technology.",
            "link": "https://www.markets.news/headlines/ba5790c5-2fb5-4530-aacf-1730619730a6",
            "pub_date": "2026-02-28 04:02:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "56828288-936d-42d8-a21b-eaaeb08389df",
            "description": "Volland SPX Spot-Vol Beta: 1.42 This gauge measures how much the VIX is reacting relative to the S&P 500’s price move. A reading of 1.42 suggests volatility is over-reacting, meaning options traders are aggressively pricing in protection compared to the actual index move. In",
            "link": "https://www.markets.news/headlines/56828288-936d-42d8-a21b-eaaeb08389df",
            "pub_date": "2026-02-28 04:03:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vuzix sets conference call for Q4 and full year 2025 financial results and business update on Feb 27, 2026.",
            "id": "f555dab0-32b4-4b09-b242-cd5c434c7df6",
            "description": "In Rochester, New York, on February 27, 2026, Vuzix® Corporation, listed on NASDAQ as VUZI, a prominent provider of smart glasses and Augmented Reality (AR) technology, plans to conduct a conference call discussing its fourth-quarter performance. This event marks an important step for the Company in sharing insights with investors and analysts.",
            "link": "https://www.markets.news/headlines/f555dab0-32b4-4b09-b242-cd5c434c7df6",
            "pub_date": "2026-02-28 04:03:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toni Collette headlines launch of The Healthy Aging Revolution campaign with leading experts and advocates to reshape longevity future.",
            "id": "4b0c42a5-10f1-40a0-a7eb-7dee697ba4c0",
            "description": "In a groundbreaking initiative launched on February 27, 2026, Mediaplanet unveiled The Healthy Aging Revolution campaign aiming to redefine the future of longevity in the United States. This national effort brings together top experts, advocates, and prominent brands to address the crucial issue. This initiative is featured in USA Today and online, reaching a wide audience. The campaign marks a significant step forward in promoting healthy aging and aims to engage the public in discussions surrounding longevity.",
            "link": "https://www.markets.news/headlines/4b0c42a5-10f1-40a0-a7eb-7dee697ba4c0",
            "pub_date": "2026-02-28 04:03:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DOJ seized $580M in crypto from Chinese criminals. $580M frozen by DC's Scam Center. US Attorney Pirro founded Strike Force.",
            "id": "9b50adc7-2209-41f0-a53b-f9038b8705b1",
            "description": "In the past three months, a total of seizures and freezing operations were carried out by the Scam Center Strike Force of the District of Columbia. The strike force was founded by US Attorney Jeanine Pirro in November and has been working to combat scams and fraudulent activities in the region.",
            "link": "https://www.markets.news/headlines/9b50adc7-2209-41f0-a53b-f9038b8705b1",
            "pub_date": "2026-02-28 03:52:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LeMaitre Vascular, Inc. (Nasdaq: LMAT) to attend 5 investor conferences in March.",
            "id": "8a7c61c0-c65a-41f5-820a-030e02028d75",
            "description": "On February 27, 2026, LeMaitre Vascular, Inc., listed on Nasdaq as LMAT, revealed plans to engage in five investor conferences in March. This initiative reflects the company's proactive approach to investor engagement and highlights a strong commitment to transparency. Such conferences offer a platform for stakeholders to interact directly with management, fostering a deeper understanding of the company's operations and strategic direction. By participating in these events, LeMaitre Vascular aims to enhance its investor relations and possibly attract potential investors looking to engage with a dynamic and forward-thinking organization.",
            "link": "https://www.markets.news/headlines/8a7c61c0-c65a-41f5-820a-030e02028d75",
            "pub_date": "2026-02-28 03:52:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TomoCredit offers 30-day plan to boost credit using tax refunds for 120 million Americans.",
            "id": "202bf7bc-4603-4755-a404-40d60b7c5858",
            "description": "In San Francisco on February 27, 2026, TomoCredit, an AI startup focused on creating a more inclusive credit framework, unveiled fresh financial advice aimed at being user-friendly for all, particularly the 120 million Americans managing credit without substantial histories.",
            "link": "https://www.markets.news/headlines/202bf7bc-4603-4755-a404-40d60b7c5858",
            "pub_date": "2026-02-28 03:55:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones drops on surprise inflation, Nvidia partner CoreWeave plunges on earnings. Live coverage by Investor's Business Daily.",
            "id": "9f63968e-04b1-482c-b1b2-7ecaf43cf99b",
            "description": "Today, the Dow Jones index experienced a decrease due to unexpected inflation data. CoreWeave, a partner of Nvidia, saw a significant drop in earnings. The market reaction was influenced by these events, with the Dow sinking and Nvidia shares declining following an agreement with OpenAI. The latest market movements can be followed through live coverage updates.",
            "link": "https://www.markets.news/headlines/9f63968e-04b1-482c-b1b2-7ecaf43cf99b",
            "pub_date": "2026-02-28 03:48:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3b5100bb-1472-42f7-b7db-371a42343da4",
            "description": "WARNER EXPECTED TO ANNOUNCE PARAMOUNT DEAL AGREEMENT FRIDAY",
            "link": "https://www.markets.news/headlines/3b5100bb-1472-42f7-b7db-371a42343da4",
            "pub_date": "2026-02-28 03:49:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7d818356-deba-4691-a66b-c55e876d83ca",
            "description": "No intel shows Iran is planning an ICBM able to hit the US - CNN.",
            "link": "https://www.markets.news/headlines/7d818356-deba-4691-a66b-c55e876d83ca",
            "pub_date": "2026-02-28 03:49:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "58ce4bcf-2be6-40dd-a13d-f4e2547d5025",
            "description": "BRENT CRUDE FUTURES SETTLE AT $72.48/BBL, UP $1.73, 2.45 PCT",
            "link": "https://www.markets.news/headlines/58ce4bcf-2be6-40dd-a13d-f4e2547d5025",
            "pub_date": "2026-02-28 03:49:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RECX partners with TRL Outdoors to boost MAX ATV dealer expansion, targeting disciplined growth nationwide.",
            "id": "89fc7f9c-3ba0-48b5-990a-d50cae4b6dcc",
            "description": "The agreement between RECX and its manufacturer’s representative facilitates the onboarding of dealers nationwide. It also promotes disciplined growth based on achieving milestones. This initiative aims to drive expansion and reach a wider audience.",
            "link": "https://www.markets.news/headlines/89fc7f9c-3ba0-48b5-990a-d50cae4b6dcc",
            "pub_date": "2026-02-28 03:49:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell stock surges after beat-and-raise earnings report driven by AI data center business growth.",
            "id": "e0374c41-1163-4f0f-8712-67ce2465bf79",
            "description": "Shares of Dell soared on Friday following the release of their exceptional earnings report, which exceeded expectations and resulted in a boost-and-raise scenario for investors. The company's stock witnessed a significant increase due to the success of its AI data center business, driving growth prospects. This news was reported on Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/e0374c41-1163-4f0f-8712-67ce2465bf79",
            "pub_date": "2026-02-28 03:50:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Supreme Court may affect Trump tariffs, impact federal budget amid big spending plans. - Investor's Business Daily.",
            "id": "62e705f2-d0a0-4388-9a5d-832be8f1ca6c",
            "description": "The recent Supreme Court ruling could potentially mitigate certain tariffs implemented by the Trump administration, causing strain on the federal budget due to the White House's intention to increase spending. This development has the potential to disrupt significant spending plans as indicated by Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/62e705f2-d0a0-4388-9a5d-832be8f1ca6c",
            "pub_date": "2026-02-28 03:41:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AS PRFoods 2nd quarter and 6-month report for 2025/2026 financial year shows challenges due to weak consumption, price sensitivity, and increased cost. Management focuses on core activities.",
            "id": "f4073ef2-ec20-41fa-ab9c-c9b5a1764d21",
            "description": "During the second quarter of the financial year, PRFoods faced difficulties in a tough economic setting with low consumption and heightened price sensitivity, leading to increased costs. These challenges predominantly impacted the company's operations in Estonia and neighboring markets. Despite this, management maintained its concentration on essential functions, managing costs effectively, and reinforcing the financial framework.",
            "link": "https://www.markets.news/headlines/f4073ef2-ec20-41fa-ab9c-c9b5a1764d21",
            "pub_date": "2026-02-28 03:41:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin holds at $65,000 as other cryptos dip. 96,079 traders liquidated, losing $259.25 million in 24h. ETH at $1,921.84.",
            "id": "e793bbb2-e046-4be3-a1dd-6bd3ecff4da0",
            "description": "Bitcoin is holding steady at the $65,000 mark with significant interest from institutional investors as the weekend approaches. Current cryptocurrency prices include Bitcoin at $65,364.43, Ethereum at $1,921.84, Solana at $81.58, XRP at $1.35, Dogecoin at $0.09324, and Shiba Inu at $0.05740. Recent data reveals that 96,079 traders were liquidated in the last 24 hours, resulting in losses totaling $259.25 million. Additionally, there were net inflows of $254.5 million from spot Bitcoin ETFs and $6.6 million from spot Ethereum ETFs on Thursday, as reported by Coinglass and SoSoValue respectively. For more details, the full article is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/e793bbb2-e046-4be3-a1dd-6bd3ecff4da0",
            "pub_date": "2026-02-28 03:41:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Green Rain Energy Holdings (OTCID: GREH) announces special stock dividend and stock buyback program on 25-Feb-2026.",
            "id": "392f0de4-37e9-4bc1-85d4-f9a9729abb01",
            "description": "Green Rain Energy Holdings (OTCID: GREH) has recently issued a news release providing a corporate update. The company has finalized a special stock dividend and introduced a voluntary stock buyback program. In addition, they have also outlined strategic growth initiatives. This update was released by Green Rain Energy Holdings, Inc. on 25-Feb-2026. Investors and stakeholders are encouraged to take note of these significant developments.",
            "link": "https://www.markets.news/headlines/392f0de4-37e9-4bc1-85d4-f9a9729abb01",
            "pub_date": "2026-02-28 03:43:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}