{
    "data": [
        {
            "title": "AW Properties Global's auction division AuctionWorks to conduct UCC sale of property assets of Pastorelli Food Products, Inc. in Northbrook, Illinois declared by Pomodoro Lender LLC on Feb. 26, 2026.",
            "id": "f4b11c1e-f1b4-4245-bbc1-b69cac4b4ac7",
            "description": "A UCC Article 9 foreclosure sale is scheduled by Pomodoro Lender LLC to be conducted by AW Properties Global's auction division, AuctionWorks. The sale will involve the transfer of all rights, titles, and interests in specific collateral owned by Pastorelli Food Products, Inc. The announcement was made in Northbrook, Illinois on February 26, 2026.",
            "link": "https://www.markets.news/headlines/f4b11c1e-f1b4-4245-bbc1-b69cac4b4ac7",
            "pub_date": "2026-02-26 23:32:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Abitibiwinni First Nation seeks input in purchase of Hecla Quebec & Casa Berardi Mine by Orezone Gold Corp in Feb 26, 2026.",
            "id": "ec716942-0921-4653-a03b-590de3a07ca9",
            "description": "In Pikogan, QC, on February 26, 2026, the Abitibiwinni First Nation is urging Hecla Mining Company (NYSE: HL) and Orezone Gold Corporation (TSX: ORE) (ASX: ORE) (OTCQX: ORZCF) to oversee a seamless and just transition that honors its wishes.",
            "link": "https://www.markets.news/headlines/ec716942-0921-4653-a03b-590de3a07ca9",
            "pub_date": "2026-02-26 23:32:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Suominen's CPCO, Minna Rouru, leaves to pursue new opportunities outside the company.",
            "id": "7caaf663-888a-4170-9d5c-374d8b846d3d",
            "description": "Minna Rouru, the Chief People and Communications Officer (CPCO) at Suominen, has revealed her intention to depart from the company to pursue an opportunity with another firm.",
            "link": "https://www.markets.news/headlines/7caaf663-888a-4170-9d5c-374d8b846d3d",
            "pub_date": "2026-02-26 23:32:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3a34660f-c003-4042-bdc2-a4d0f3160af5",
            "description": "US Govt to encourage Swiss to boost money laundering supervision.",
            "link": "https://www.markets.news/headlines/3a34660f-c003-4042-bdc2-a4d0f3160af5",
            "pub_date": "2026-02-26 23:32:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ee90b60e-7c73-488d-8ebf-7b08d8d7ad53",
            "description": "Fear and Greed Index: 43/100 = Fear",
            "link": "https://www.markets.news/headlines/ee90b60e-7c73-488d-8ebf-7b08d8d7ad53",
            "pub_date": "2026-02-26 23:32:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TJX stock rises after Q4 beat, analysts praise 'MarMaxx strength'. Total sales: $17.7B, up 8.5% YoY. Comps grew 5%.",
            "id": "24af7f06-222d-42a9-ada1-6540fa6d10f4",
            "description": "The stock prices for TJX Companies Inc (NYSE: TJX) surged in early trading following the release of strong fourth-quarter results. Analyst Robert Drbul from BTIG reaffirmed a Buy rating and raised the price target from $165 to $185, while Dana Telsey of Telsey Advisory Group reiterated an Outperform rating and increased the price target from $170 to $175. According to Drbul, TJX reported total sales of $17.7 billion, marking an 8.5% increase compared to the previous year, surpassing the 4.2% estimated growth. The company's total comparable sales rose by 5%, exceeding the 3% expectation, driven by growth in both traffic and ticket sales. For more analyst insights, refer to BTIG. This information and more can be found in the complete article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/24af7f06-222d-42a9-ada1-6540fa6d10f4",
            "pub_date": "2026-02-26 23:33:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CPSC announces product recalls, view at www.cpsc.gov for details.",
            "id": "657963b2-4bf3-426e-a597-0bea27690201",
            "description": "On February 26, 2026, in Washington, the Consumer Product Safety Commission (CPSC) released information about several recalls in collaboration with specific companies. These recalls can be accessed online at www.cpsc.gov.",
            "link": "https://www.markets.news/headlines/657963b2-4bf3-426e-a597-0bea27690201",
            "pub_date": "2026-02-26 23:34:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Delos Insurance Solutions and ROAR Partners collaborate to enhance disaster risk exposure strategy in the US.",
            "id": "a59f73d0-6b2e-490a-9d9d-7ec50b7bcbd6",
            "description": "Delos Insurance Solutions is partnering to enhance the 'Future Proofing America Framework', focusing on advanced wildfire risk mitigation, alternative investments, and innovative insurance strategies nationwide. The collaboration, announced in San Francisco and Houston on Feb. 26, 2026, aims to deploy these strategies across the U.S. to improve resilience.",
            "link": "https://www.markets.news/headlines/a59f73d0-6b2e-490a-9d9d-7ec50b7bcbd6",
            "pub_date": "2026-02-26 23:34:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "04b28913-1cbc-44bf-9f48-95a400c1953e",
            "description": "THUNE: IF US TAKES ACTION ON IRAN, GOAL SHOULD BE REGIME CHANGE",
            "link": "https://www.markets.news/headlines/04b28913-1cbc-44bf-9f48-95a400c1953e",
            "pub_date": "2026-02-26 23:35:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Knightscope secures over $2 million in new contracts, showing demand for its innovative security solutions.",
            "id": "74c9f64f-841b-4f3a-bfc0-97c1fa19ade4",
            "description": "Sunnyvale, California-based Knightscope, Inc. (NASDAQ: KSCP) revealed that it has achieved a new milestone by securing over $2 million in fresh sales and client renewals. This recent success adds to the company's previous accomplishments and highlights the increasing nationwide interest in Knightscope's advanced security offerings. The company specializes in technology-driven solutions that aim to bolster security systems and bring modernization to both public and private sectors.",
            "link": "https://www.markets.news/headlines/74c9f64f-841b-4f3a-bfc0-97c1fa19ade4",
            "pub_date": "2026-02-26 23:35:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ceace694-d3bd-4d6f-9b84-094d2d251984",
            "description": "FIRE BREAKS OUT AT AN INDUSTRIAL COMPLEX IN IRAN'S SOUTHERN CITY OF ABADAN - REPORTS",
            "link": "https://www.markets.news/headlines/ceace694-d3bd-4d6f-9b84-094d2d251984",
            "pub_date": "2026-02-26 23:26:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "582c778c-2f8d-41d6-9599-f8b45c63711c",
            "description": "It looks like a stunt. But every punch is training. Meet the humanoid robots learning balance, control, and recovery — the basics for working around humans. Full episode coming across CGTN Europe social platforms on March 4.",
            "link": "https://www.markets.news/headlines/582c778c-2f8d-41d6-9599-f8b45c63711c",
            "pub_date": "2026-02-26 23:26:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b02b25bc-45a3-4668-a260-a68d1fb84754",
            "description": "AMAZON’S $50B OPENAI DEAL TIED TO AGI, IPO MILESTONES: INFORMATION Amazon’s $50B investment in OpenAI comes with conditions—most of the funding depends on achieving AGI or going public. SoftBank and NVIDIA are each planning $30B investments in phases, while Microsoft has yet to",
            "link": "https://www.markets.news/headlines/b02b25bc-45a3-4668-a260-a68d1fb84754",
            "pub_date": "2026-02-26 23:26:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "First Quantum Minerals completes $1.5 billion senior notes offering.",
            "id": "2d94a211-55c6-4c9d-ac16-5225e7c65516",
            "description": "The information provided is denominated in US dollars unless otherwise specified.",
            "link": "https://www.markets.news/headlines/2d94a211-55c6-4c9d-ac16-5225e7c65516",
            "pub_date": "2026-02-26 23:27:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3257a167-fd67-47e7-b19e-c21befe5166a",
            "description": "Correction made: Additional details now available for Annual Report '24 and Interim Report H1 '25. #financialreporting",
            "link": "https://www.markets.news/headlines/3257a167-fd67-47e7-b19e-c21befe5166a",
            "pub_date": "2026-02-26 23:27:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1b54c468-aea3-45fe-aa08-2c7f902fb9e3",
            "description": "RUSSIA'S DMITRIEV ARRIVED IN GENEVA WHERE HE MAY HOLD TALKS WITH U.S. OFFICIALS - RIA",
            "link": "https://www.markets.news/headlines/1b54c468-aea3-45fe-aa08-2c7f902fb9e3",
            "pub_date": "2026-02-26 23:27:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI-RAN Alliance hits key milestone with 132 members & new board members Qualcomm, SK Telecom, Vodafone to accelerate AI-native RAN innovation.",
            "id": "9d8d5b72-3e64-470a-a0d5-d82cb8041506",
            "description": "A significant advancement was revealed today by the AI-RAN Alliance, headquartered in Wakefield, Mass., as the organization declared a substantial increase in membership, now standing at 132 members worldwide. Noteworthy additions to the Board include technology giants Qualcomm, SK Telecom, and Vodafone. The primary focus remains on fast-tracking the implementation of AI-native Radio Access Network (RAN) solutions on a global level. As part of these efforts, the Alliance is gearing up to showcase 33 cutting-edge AI-powered innovations at MWC 2026. Additionally, four fresh industry blueprints are set to be unveiled at the event, demonstrating the seamless integration of AI within RAN technology to elevate wireless networks.",
            "link": "https://www.markets.news/headlines/9d8d5b72-3e64-470a-a0d5-d82cb8041506",
            "pub_date": "2026-02-26 23:28:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin price rejected at $68K trend line, failing to reclaim support zone as traders anticipate bear market continuation.",
            "id": "83b3cc83-99b5-4ca2-ae89-46c62d08d1eb",
            "description": "The strength of Bitcoin's price was not sufficient to regain a crucial support area, as traders anticipate the bear market to align with patterns seen in past cycles.",
            "link": "https://www.markets.news/headlines/83b3cc83-99b5-4ca2-ae89-46c62d08d1eb",
            "pub_date": "2026-02-26 23:30:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gabriels Technology launches website for Anne Erwin Sotheby's Realty, powered by new tools. Prestigious firm in New England.",
            "id": "8c2b9d72-ba66-4b89-ad0a-af5060cdf334",
            "description": "On February 26, 2026, in New York, Gabriels Technology Solutions revealed the revamped digital platform for Anne Erwin Sotheby's International Realty. The real estate firm, renowned in coastal New England for its luxury properties, has undergone a significant digital transformation. This redesign aims to enhance user experience on their website and improve accessibility to their prestigious listings. This update signifies a milestone in bridging technology and real estate, catering to the growing digital demands of the industry.",
            "link": "https://www.markets.news/headlines/8c2b9d72-ba66-4b89-ad0a-af5060cdf334",
            "pub_date": "2026-02-26 23:21:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "56dfa03f-fa0a-4240-aefa-4806b3331b05",
            "description": "U.S. OIL ERASES LOSSES TO TRADE ABOVE $65 A BARREL",
            "link": "https://www.markets.news/headlines/56dfa03f-fa0a-4240-aefa-4806b3331b05",
            "pub_date": "2026-02-26 23:21:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}