{
    "data": [
        {
            "title": "Gabriels Technology launches website for Anne Erwin Sotheby's Realty, powered by new tools. Prestigious firm in New England.",
            "id": "8c2b9d72-ba66-4b89-ad0a-af5060cdf334",
            "description": "On February 26, 2026, in New York, Gabriels Technology Solutions revealed the revamped digital platform for Anne Erwin Sotheby's International Realty. The real estate firm, renowned in coastal New England for its luxury properties, has undergone a significant digital transformation. This redesign aims to enhance user experience on their website and improve accessibility to their prestigious listings. This update signifies a milestone in bridging technology and real estate, catering to the growing digital demands of the industry.",
            "link": "https://www.markets.news/headlines/8c2b9d72-ba66-4b89-ad0a-af5060cdf334",
            "pub_date": "2026-02-26 23:21:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "56dfa03f-fa0a-4240-aefa-4806b3331b05",
            "description": "U.S. OIL ERASES LOSSES TO TRADE ABOVE $65 A BARREL",
            "link": "https://www.markets.news/headlines/56dfa03f-fa0a-4240-aefa-4806b3331b05",
            "pub_date": "2026-02-26 23:21:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "770416b5-5199-4c9b-9ecd-32a5f9668ad4",
            "description": "TREASURY 10-YEAR YIELD FALLS TO 4.01%, LOWEST SINCE NOV. 28",
            "link": "https://www.markets.news/headlines/770416b5-5199-4c9b-9ecd-32a5f9668ad4",
            "pub_date": "2026-02-26 23:22:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c5bf94c3-f6e8-4e24-97b5-d0ed15bca12f",
            "description": "TRUMP-XI SUMMIT PREPARATIONS FALTER AS PLANNING GAPS UNSETTLE BEIJING: SCMP Preparations for a potential meeting between Donald Trump and Xi Jinping are falling short, with limited coordination and weak planning raising concerns in Beijing. Analysts cite clashing styles—Trump’s",
            "link": "https://www.markets.news/headlines/c5bf94c3-f6e8-4e24-97b5-d0ed15bca12f",
            "pub_date": "2026-02-26 23:22:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "95% of US health insurers have negative trust scores, with potential $796.5M churn per insurer due to service failures.",
            "id": "0da5bce1-3620-4597-a2e3-10ab4a9e04b4",
            "description": "A recent study has revealed that insurance premiums have seen a significant increase, doubling in cost. The study, conducted by predictive insights platform Adoreboard, has identified three key service failures that have led to a potential churn of approximately $796.5 million per insurer. These service failures are also responsible for 89% of low-trust issues mentioned in consumer reviews. The findings shed light on the challenges faced by insurers in maintaining customer loyalty and trust. This research was conducted by Adoreboard in BELFAST, Northern...",
            "link": "https://www.markets.news/headlines/0da5bce1-3620-4597-a2e3-10ab4a9e04b4",
            "pub_date": "2026-02-26 23:23:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI platform Old Well Labs (OWL) secures new investment from Capital Allocators, Teamworthy Ventures, Hammoud Ventures, and led by Nellore Capital in oversubscribed round.",
            "id": "f1084136-fe50-4449-8a01-7386668da830",
            "description": "Charlotte, North Carolina-based Old Well Labs (OWL) revealed a fresh strategic investment from Capital Allocators, Teamworthy Ventures, and Hammoud Ventures. The oversubscribed funding round, spearheaded by current investor Nellore Capital, also saw contributions from TFJ Capital and numerous industry-savvy investors. OWL, an AI-fueled platform facilitating interaction between allocators and investment managers, consolidates data from several sources to aid in their connection and monitoring.",
            "link": "https://www.markets.news/headlines/f1084136-fe50-4449-8a01-7386668da830",
            "pub_date": "2026-02-26 23:23:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Elizabeth (Liz) Pulver of State Farm named NETS Board Vice Chairperson for 2026-2027.",
            "id": "2e5077ce-e238-4755-87ad-ad7e6b6784f1",
            "description": "Elizabeth (Liz) Pulver from State Farm has been appointed as the Board Vice Chairperson of NETS for the term spanning 2026 to 2027.",
            "link": "https://www.markets.news/headlines/2e5077ce-e238-4755-87ad-ad7e6b6784f1",
            "pub_date": "2026-02-26 23:24:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3b7bd0ea-b092-49df-891a-8fd223484ae1",
            "description": "MICHAEL BURRY SEES NVIDIA’S ‘PURCHASE COMMITMENT’ PARALLEL TO CISCO AT DOT-COM BUBBLE TOP – CNBC",
            "link": "https://www.markets.news/headlines/3b7bd0ea-b092-49df-891a-8fd223484ae1",
            "pub_date": "2026-02-26 23:25:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pulse PEMF sponsors U.S. Figure Skating for 3 years, supporting athletes at major events during 2026 season.",
            "id": "87b66112-a952-49f6-a9c0-c103f24e9002",
            "description": "A company focused on wellness technology, Pulse PEMF, will be assisting athletes at significant national events during the 2026 season. Headquartered in Cartersville, Georgia, the company specializes in pulsed electromagnetic field (PEMF) devices that aid in recovery. This initiative is set to benefit a large number of athletes throughout the season, showcasing the growing importance of integrating advanced technologies into sports and fitness. Scheduled events will feature the company's innovative PEMF devices, designed to enhance the athletes' performance and overall well-being.",
            "link": "https://www.markets.news/headlines/87b66112-a952-49f6-a9c0-c103f24e9002",
            "pub_date": "2026-02-26 23:25:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp client creates Hoverboard Assist Chair (SGM-609) in Iowa to improve balance while learning to use a hoverboard.",
            "id": "234547f0-8656-486c-bf8c-760f7fe0b27b",
            "description": "In Pittsburgh on February 26, 2026, an inventor from Lohrville, Iowa, shared his innovative product - the HOVERBOARD ASSIST CHAIR. The inventor aimed to provide support and enhance balance for individuals learning to use a hoverboard. This invention is designed to potentially minimize falls during the learning process.",
            "link": "https://www.markets.news/headlines/234547f0-8656-486c-bf8c-760f7fe0b27b",
            "pub_date": "2026-02-26 23:17:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global pharmaceutical manufacturing equipment market to reach $30.39 billion by 2032, with a CAGR of 6.2%.",
            "id": "0d63b55a-60b7-41a9-9978-f2f66df224be",
            "description": "In Delray Beach, Florida, on February 26, 2026, it was reported that the global pharmaceutical manufacturing equipment market is anticipated to hit USD 21.24 billion by 2026 and is expected to rise to USD 30.39 billion by 2032. The market is forecasted to grow at a Compound Annual Growth Rate (CAGR) of 6.2% over the said period. For more information, interested parties can explore 165...",
            "link": "https://www.markets.news/headlines/0d63b55a-60b7-41a9-9978-f2f66df224be",
            "pub_date": "2026-02-26 23:17:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NBDF's \"Educate to Elevate\" campaign with celebrity advocates aims to raise awareness for bleeding disorders.",
            "id": "211c42d6-419c-47be-af54-5bf406430c86",
            "description": "A group of well-known figures has united with NBDF to raise awareness about misdiagnosis and enhance treatment for the numerous individuals managing bleeding disorders. As of February 26, 2026, the National Bleeding Disorders Foundation (NBDF) has introduced Educate to Elevate, a long-term program aimed at addressing this issue. The initiative includes participation from multiple celebrities and is a concerted effort to improve care for the millions affected by bleeding disorders.",
            "link": "https://www.markets.news/headlines/211c42d6-419c-47be-af54-5bf406430c86",
            "pub_date": "2026-02-26 23:17:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Teamsters at Metal Container Corporation, a subsidiary of Anheuser-Busch InBev, ratified a new agreement securing significant wage improvements; more than 245 members of Local 6 involved.",
            "id": "3a4737d4-aaa1-4266-8e1f-a7335a896743",
            "description": "Over 245 Teamsters belonging to Local 6 at Metal Container Corporation, a subsidiary of Anheuser-Busch InBev, have approved a substantial wage enhancement in the latest agreement. The members, involved in can manufacturing for diverse purposes, have secured significant improvements in their pay.",
            "link": "https://www.markets.news/headlines/3a4737d4-aaa1-4266-8e1f-a7335a896743",
            "pub_date": "2026-02-26 23:17:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Synopsys stock fell after Q1 results, cut fiscal 2026 EPS, issued Q2 sales guidance below estimates. Quarterly revenue: $2.41B.",
            "id": "51d9803d-eb9f-459e-ad41-bd7cec085308",
            "description": "Synopsys, Inc. (SNPS) stock declined after reporting Q1 results where they posted an adjusted EPS of $3.77 (beat estimate of $3.56) and revenue of $2.41 billion (surpassed estimate of $2.39 billion). The company reduced its fiscal 2026 GAAP EPS guidance below expectations and issued Q2 sales guidance lower than estimates. Synopsys' CEO mentioned the company's growth in AI capabilities driving system-level and semiconductor R&D. The board also approved a $2.0 billion stock repurchase program. The company revised its fiscal 2026 adjusted EPS guidance to $14.38-$14.46. More details are available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/51d9803d-eb9f-459e-ad41-bd7cec085308",
            "pub_date": "2026-02-26 23:17:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9e4ffd8e-20c0-4fa6-bbac-0be1a05e6439",
            "description": "KENYA FINANCE MINISTRY:ANNOUNCES TENDER OFFER RESULTS",
            "link": "https://www.markets.news/headlines/9e4ffd8e-20c0-4fa6-bbac-0be1a05e6439",
            "pub_date": "2026-02-26 23:17:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "5c5e55d7-dbb2-441c-b518-cdbc67af11d1",
            "description": "IDF: In response to Hezbollah’s repeated violations of the ceasefire understandings, the IDF is striking infrastructure belonging to Hezbollah’s ‘Radwan Force’ in the Baalbek area in Lebanon.",
            "link": "https://www.markets.news/headlines/5c5e55d7-dbb2-441c-b518-cdbc67af11d1",
            "pub_date": "2026-02-26 23:17:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global Environmental Solutions acquires Environmental Controls Company, expanding water infrastructure platform. Acquisition completed January 25, 2026.",
            "id": "04f6cf56-17d4-4ddc-bf91-fd6fb0b91ca8",
            "description": "On February 26, 2026, in Manchester, New Hampshire, Global Environmental Solutions, LLC (GES), a prominent company in environmental control technologies, disclosed the finalization of an asset acquisition deal with Environmental Controls Company, LLC (ECC) on January 25, 2026. The acquisition marks a significant move in the industry.",
            "link": "https://www.markets.news/headlines/04f6cf56-17d4-4ddc-bf91-fd6fb0b91ca8",
            "pub_date": "2026-02-26 23:19:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Probiotic supplements market to reach USD 37.5 billion by 2036, with digestive health as anchor segment and Lactobacillus leading.",
            "id": "149be0af-866a-4ca5-8ecd-017f48bcb7d8",
            "description": "The main segment in the market continues to be digestive health, with Lactobacillus being the most sought-after strain. The demand for probiotic supplements is rising, particularly in capsules, powders, and liquids. Future Market Insights (FMI) forecasts that the global probiotic supplements market is expected to witness significant growth. The adoption of probiotics in everyday products is driven by varying colony-forming unit (CFU) ranges.",
            "link": "https://www.markets.news/headlines/149be0af-866a-4ca5-8ecd-017f48bcb7d8",
            "pub_date": "2026-02-26 23:19:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Yerucham Zvi Winer, aka Mr. Black, running for Florida Governor on platform of faith, family, and freedom.",
            "id": "24075ce7-2db3-4c2f-8b35-920f0804eb9d",
            "description": "A prominent figure in the business and bitcoin sectors, Yerucham Zvi Winer, or Mr. Black, is shifting his focus to Florida politics by entering the gubernatorial race. With an established presence in the industry, Winer aims to emphasize strong leadership and family values in his campaign. This move comes as a new direction for Winer who has previously been recognized for his achievements in both business and bitcoin spheres. The announcement of his bid for governor signals a significant shift in his career trajectory towards public service.",
            "link": "https://www.markets.news/headlines/24075ce7-2db3-4c2f-8b35-920f0804eb9d",
            "pub_date": "2026-02-26 23:19:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "YachtWorld and Sunshine Cruising Yachts partner to empower boutique firms with data and tech for enterprise scale.",
            "id": "a9b543a7-348e-4875-bed2-9516e9b150ff",
            "description": "Announced on February 26, 2026, in Miami, the partnership between YachtWorld, a division of Boats Group, and Sunshine Cruising has been strengthened, highlighting the capability of Boats Group's data, technology, and worldwide influence in enabling boutique firms to function at a large enterprise level. This enhanced partnership underscores how smaller firms can benefit from the resources provided by Boats Group, showcasing the potential for growth and development.",
            "link": "https://www.markets.news/headlines/a9b543a7-348e-4875-bed2-9516e9b150ff",
            "pub_date": "2026-02-26 23:06:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}