{
    "data": [
        {
            "title": "",
            "id": "49fdb928-24ed-485b-9b43-371beb18ff5c",
            "description": "Trump Administration Delivers Latest DHS Funding Offer – POLITICO",
            "link": "https://www.markets.news/headlines/49fdb928-24ed-485b-9b43-371beb18ff5c",
            "pub_date": "2026-02-28 01:17:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "47ea94b9-ea78-49ee-aa84-1ffccc513f50",
            "description": "EU's Costa: 'It was an immense pleasure to receive at the European Council the Portuguese President, Marcelo Rebelo de Sousa, at the moment he bids farewell at the end of his term. The choice of the European institutions as the destination for his last official visit abroad is",
            "link": "https://www.markets.news/headlines/47ea94b9-ea78-49ee-aa84-1ffccc513f50",
            "pub_date": "2026-02-28 01:17:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ORS Haircare partners with HBCU Culture Shop to celebrate excellence and community, honoring HBCUs. Chicago, Feb. 27, 2026.",
            "id": "9d2c9e2a-034a-4ddf-9d5d-a58500faf164",
            "description": "A special collaboration has been launched to celebrate Historically Black Colleges and Universities (HBCUs), emphasizing their legacy, excellence, and future. ORS Haircare has affirmed its dedication to HBCU students and graduates through this limited-edition partnership. This initiative was announced in Chicago on February 27, 2026, with the aim of honoring the significance of HBCUs. This collaboration reflects ORS' ongoing support for HBCU community.",
            "link": "https://www.markets.news/headlines/9d2c9e2a-034a-4ddf-9d5d-a58500faf164",
            "pub_date": "2026-02-28 01:19:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Galaxy Dispensary in Richton Park, Illinois rebrands as Stash Dispensaries. Grand opening on March 7 at new location, 22214 Governors Hwy.",
            "id": "4b503c5f-3f6d-462c-8a2d-2d9924281835",
            "description": "A dispensary in Richton Park, Illinois, formerly known as Galaxy Dispensary, has undergone a rebranding and is now operating under the name Stash Dispensaries. This change signifies a new beginning for the retailer catering to the adult-use market in the area located at 22214 Governors Hwy. To commemorate this shift, Stash Dispensaries is hosting events...",
            "link": "https://www.markets.news/headlines/4b503c5f-3f6d-462c-8a2d-2d9924281835",
            "pub_date": "2026-02-28 01:19:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MN considering ban on crypto kiosks due to scams. Rep Erin Koegel proposes ban to build on 2024 law restricting operators.",
            "id": "592fd912-18c0-4834-9d46-8bbfde2aed42",
            "description": "A proposal put forth by Representative Erin Koegel suggests implementing a complete prohibition on cryptocurrency ATMs in Minnesota. This motion is in continuation of a state law enacted in 2024, which placed limitations on operators of kiosks. The ban is intended to curb the proliferation of such ATMs in the state and regulate the use of cryptocurrencies.",
            "link": "https://www.markets.news/headlines/592fd912-18c0-4834-9d46-8bbfde2aed42",
            "pub_date": "2026-02-28 01:20:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "56ce1975-95f9-4ed1-b63b-8b56711ff0cd",
            "description": "U.S. SEC SAYS IT ADOPTS FINAL RULES FOR THE HOLDING FOREIGN INSIDERS ACCOUNTABLE ACT",
            "link": "https://www.markets.news/headlines/56ce1975-95f9-4ed1-b63b-8b56711ff0cd",
            "pub_date": "2026-02-28 01:21:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK officials at a roundtable propose integrating compliance solutions into crypto privacy tools to enhance regulations.",
            "id": "56205112-00ca-4f4b-a856-530adb63fb0c",
            "description": "Officials from the UK recently participated in a roundtable discussion hosted by the Royal United Services Institute where they expressed interest in incorporating compliance measures into cryptocurrency privacy tools. The officials discussed strategies for integrating these solutions to enhance security and regulation in the crypto industry. This move aims to ensure transparency and accountability in transactions involving digital assets.",
            "link": "https://www.markets.news/headlines/56205112-00ca-4f4b-a856-530adb63fb0c",
            "pub_date": "2026-02-28 01:22:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Noma AI Security now part of AWS Security Hub Extended plan, enhancing security for customers.",
            "id": "30293f3c-cb9c-4772-82cd-c29668788523",
            "description": "On February 27, 2026, Noma Security, an AI Security company, revealed that their advanced AI Security platform can now be accessed through the Extended plan on AWS Security Hub, the unified security solution by Amazon Web Services. This union allows customers to benefit from the platform's comprehensive features and services.",
            "link": "https://www.markets.news/headlines/30293f3c-cb9c-4772-82cd-c29668788523",
            "pub_date": "2026-02-28 01:23:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "$160K awarded to 6 projects in Avalanche Foundation's Retro9000 cohort, part of $40M grant program. C-Chain round also introduced.",
            "id": "dbe0face-0b8e-4d95-8c59-7b4d0f97b614",
            "description": "The Avalanche platform has implemented a retroactive grant program amounting to $40 million, with initial distributions of over $160,000 allocated to Level 1 builders. Additionally, they have introduced a new round on the C-Chain that rewards projects based on AVAX burned.",
            "link": "https://www.markets.news/headlines/dbe0face-0b8e-4d95-8c59-7b4d0f97b614",
            "pub_date": "2026-02-28 01:24:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ffa0a422-dd76-489e-806f-9773413aa22e",
            "description": "ATLAS SP SAYS IT IS A SENIOR CREDITOR TO MFS AND HAS APPROXIMATELY 400 MILLION POUNDS OF EXPOSURE, OR ABOUT 1% OF ITS BALANCE SHEET, ALONGSIDE SEVERAL INTERNATIONAL BANKS",
            "link": "https://www.markets.news/headlines/ffa0a422-dd76-489e-806f-9773413aa22e",
            "pub_date": "2026-02-28 01:11:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "79501069-9027-4992-b32b-e24287c109ee",
            "description": "US Centcom: 'USS Frank E. Petersen Jr. (DDG 121) is equipped with various weapons, including the Mk.41 VLS, Mk.45 5-inch gun, and Mk.38 25mm chain gun. Frank E. Petersen Jr. recently conducted a Mk.38 live-fire exercise in the Arabian Sea, demonstrating defense capabilities and",
            "link": "https://www.markets.news/headlines/79501069-9027-4992-b32b-e24287c109ee",
            "pub_date": "2026-02-28 01:12:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Globalstar (NASDAQ: GSAT) stock rose as company reported Q4 2025 revenue of $71.96M, surpassing estimates. Service revenue up 17% Y/Y to $67.39M, subscriber equipment sales up 31% Y/Y to $4.57M. Net loss improved to $11.6M from $50.2M Y/Y. EPS loss wider than expected at 11 cents. Adjusted EBITDA rose to $32.4M from $30.4M Y/Y. Company had $447.5M in cash and generated $175.89M in operating cash flow.",
            "id": "8f80b1f9-dcf7-4345-b100-502e94d0d63e",
            "description": "Globalstar, Inc. (NASDAQ: GSAT) saw a stock increase following the release of its fiscal fourth-quarter 2025 results, which were a mix of positive and negative figures. The company reported quarterly revenue of $71.96 million, surpassing analyst expectations of $71.22 million. Service revenue rose by 17% year-over-year to $67.39 million, driven mainly by higher wholesale capacity services revenue. Revenue from subscriber equipment sales also saw an increase of 31% year-over-year to $4.57 million. The net loss for the quarter improved to $11.6 million, a significant decrease from the $50.2 million loss in the previous year. The reported EPS loss was 11 cents, wider than the analyst prediction of a 1-cent loss. Adjusted EBITDA for the quarter rose to $32.4 million from $30.4 million year-over-year. As of December 31, 2025, the company had $447.5 million in cash and equivalents. Operating cash flow during the quarter stood at $175.89 million, showing a decrease from previous figures.",
            "link": "https://www.markets.news/headlines/8f80b1f9-dcf7-4345-b100-502e94d0d63e",
            "pub_date": "2026-02-28 01:12:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ThredUp (TDUP) set to report EPS of $-0.04 on March 2. Historical data shows EPS beat by $0.02 led to 7.53% share drop. Stock up 124.89% in the last year. Investors await guidance for market reaction. ",
            "id": "150ee812-fb42-4d28-8954-40d5dd34f486",
            "description": "ThredUp (NASDAQ: TDUP) is scheduled to release its latest quarterly earnings on March 2, 2026. Analysts predict an EPS of $-0.04 for the apparel resale company. Investors are eager for the report, hoping for earnings that exceed expectations and positive guidance for the upcoming quarter. It is important to note that while earnings are crucial, market reactions are often influenced by future guidance. In the previous quarter, ThredUp surpassed expectations by $0.02, resulting in a 7.53% decrease in share price the following day. Looking at past performance: in Q3 2025, the EPS estimate was -0.05, but ThredUp posted -0.03, leading to a 7.53% drop in share price. ThredUp's shares were valued at $5.07 on February 26, showing a 124.89% increase over the past 52 weeks.",
            "link": "https://www.markets.news/headlines/150ee812-fb42-4d28-8954-40d5dd34f486",
            "pub_date": "2026-02-28 01:07:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BigBear.ai Hldgs (NYSE: BBAI) to announce quarterly earnings with estimated EPS of $-0.06. Historical performance suggests market reactions influence stock price. Shares currently trading at $4.15 with 52-week decrease of 17.96%. Investors eager for positive guidance.",
            "id": "b6e58723-5c7f-4c27-84ae-4bafae6556f1",
            "description": "BigBear.ai Hldgs (NYSE: BBAI) is set to announce its quarterly earnings on Monday, March 2, with analysts predicting an earnings per share (EPS) of $-0.06. Investors are eagerly awaiting the results, hoping for a beat on estimates and positive guidance for the next quarter. In the previous quarter, the company exceeded EPS expectations by $0.04, resulting in a 6.13% increase in share price the following day. However, over the last 52 weeks, BigBear.ai Hldgs' shares have declined by 17.96%, signaling disappointment among long-term shareholders. As of February 26, shares were trading at $4.15. The market response to earnings announcements is typically influenced not only by past performance but also by future guidance. Investors should consider both factors before reacting to the upcoming report. [Word count: 121]",
            "link": "https://www.markets.news/headlines/b6e58723-5c7f-4c27-84ae-4bafae6556f1",
            "pub_date": "2026-02-28 01:07:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cerus to announce quarterly earnings with estimated EPS of -$0.01; shares trading at $2.6, up 67.65% in past year.",
            "id": "e06082c6-eda7-43ba-9598-7371b910c8e0",
            "description": "Cerus (NASDAQ: CERS) is expected to release its latest quarterly earnings report on March 2, 2026. Analysts predict an earnings per share (EPS) of $-0.01 for the company. Investors are eager for Cerus to potentially exceed estimates and provide upbeat guidance for the next quarter, as this could impact stock prices significantly. In the previous quarter, Cerus topped EPS estimates by $0.02, leading to a 21.28% increase in share price the following day. Looking at past performance, Cerus has shown varying results compared to EPS estimates, with corresponding price changes. As of February 26, Cerus shares were trading at $2.6, with a 67.65% increase over the last 52-week period. Positive returns suggest potential optimism for long-term shareholders. ",
            "link": "https://www.markets.news/headlines/e06082c6-eda7-43ba-9598-7371b910c8e0",
            "pub_date": "2026-02-28 01:07:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sturm Ruger & Co (NYSE: RGR) to report EPS of $0.32, upcoming earnings outlook crucial, past share performance - key for investors.",
            "id": "3f6fb892-b922-4e64-8a07-5fd5ab436f97",
            "description": "Sturm Ruger & Co (NYSE: RGR) is set to announce its quarterly earnings on Monday, March 2, 2026. Analysts predict an EPS of $0.32. Investors are eager for positive guidance in addition to surpassing estimates, as market reactions are largely driven by this. In the last quarter, Sturm Ruger missed EPS by $0.24, resulting in a 19.81% drop in share price the next day. Previous EPS estimates and actuals for quarters in 2025 and 2024 are provided, along with price change percentages. As of February 26, Sturm Ruger shares were trading at $37.44, reflecting a 5.8% decrease over the past year. For more details, the full article is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/3f6fb892-b922-4e64-8a07-5fd5ab436f97",
            "pub_date": "2026-02-28 01:07:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Asana (NYSE: ASAN) to release quarterly earnings on 2026-03-02 with anticipated EPS of $-0.02. Past EPS beats led to 7.77% price increase. Stock down 62.04%.",
            "id": "dc634a23-83d6-4e05-aa9c-ab18dfe8ac33",
            "description": "Asana (NYSE: ASAN) is set to reveal its quarterly earnings on March 2, 2026, with analysts expecting an earnings per share (EPS) of $-0.02. Past performance shows that Asana beat EPS estimates in the last quarter by $0.22, resulting in a 7.77% increase in share price the following day. In the previous quarters, Asana's performance varied, with some instances of beating estimates and others falling short. As of February 26, shares of Asana were trading at $7.35, marking a 62.04% decline over the last 52 weeks. Investors are eager for positive guidance in the upcoming announcement, recognizing the impact it can have on the market reaction, alongside earnings results. The full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/dc634a23-83d6-4e05-aa9c-ab18dfe8ac33",
            "pub_date": "2026-02-28 01:07:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UAB “Atsinaujinančios energetikos investicijos” releases interim financial statements for the 12-month period of 2025.",
            "id": "afd45a77-ce5a-4179-a628-2023224832a5",
            "description": "UAB “Atsinaujinančios energetikos investicijos” (the Company) has released its unreviewed interim condensed consolidated and separate financial statements for the 12-month period ending in 2025.",
            "link": "https://www.markets.news/headlines/afd45a77-ce5a-4179-a628-2023224832a5",
            "pub_date": "2026-02-28 01:07:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e8437b07-7441-49e6-a201-7cf2150dcdfb",
            "description": "Volland SPX Dealer Premium: $203.83B This widget shows the total option premium dealers have collected from open positions. Net dealer premium stands at roughly $203.83B, indicating dealers are holding a substantial amount of premium exposure across SPX options. 0DTE premium is",
            "link": "https://www.markets.news/headlines/e8437b07-7441-49e6-a201-7cf2150dcdfb",
            "pub_date": "2026-02-28 01:08:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enterprise Products Partners L.P. filed Form 10-K for 2025 with SEC. Free copies available on website.",
            "id": "877e3704-e5b4-44ef-8658-921d2e83940e",
            "description": "Houston-based Enterprise Products Partners L.P. (NYSE: EPD) has submitted the company's Annual Report on Form 10-K for the fiscal year ending on December 31, 2025 to the Securities and Exchange Commission. This report can be accessed on the Enterprise website, www.enterpriseproducts.com. Physical copies can also be obtained at no cost by requesting at https://ir.enterpriseproducts.com/notifications-requests. EPD is among the leading publicly traded partnerships.",
            "link": "https://www.markets.news/headlines/877e3704-e5b4-44ef-8658-921d2e83940e",
            "pub_date": "2026-02-28 01:08:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}