{
    "data": [
        {
            "title": "",
            "id": "ec2dad10-1e75-4e3d-a9ac-a09844619375",
            "description": "Anthropic and the Pentagon are still negotiating, a deal is possible - Axios.",
            "link": "https://www.markets.news/headlines/ec2dad10-1e75-4e3d-a9ac-a09844619375",
            "pub_date": "2026-02-28 05:38:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Blue Shield Promise和L.A. Care与加州黑人女性集体赋权研究所合作提供SheWorks项目，支持经济和专业成长。",
            "id": "7b5f19e8-56ce-4e8a-b941-4ce9a3010e4d",
            "description": "Blue Shield of California Promise Health Plan and L.A. Care Health Plan have announced a new partnership with the California Black Women's Collective Empowerment Institute to support economic mobility and professional development through the SheWorks program. This initiative will aim to empower black women by providing opportunities for career growth and financial stability. The collaboration will take place in Long Beach, California, and is set to commence on February 27, 2026. This joint effort signifies a commitment to enhancing the professional prospects and economic well-being of individuals, with a primary focus on supporting the advancement of black women in the workforce.",
            "link": "https://www.markets.news/headlines/7b5f19e8-56ce-4e8a-b941-4ce9a3010e4d",
            "pub_date": "2026-02-28 05:39:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "XRP struggles below $2, advocates see potential in the token and XRP Ledger for global finance. Tokenization comparison made between Canton Network and XRP Ledger. Ripple advocates still optimistic.",
            "id": "c5b698bd-eb98-4ab7-82a2-7db28bb55229",
            "description": "XRP is currently trading below $2, but industry discussions indicate its potential significance in a digitalized global financial system. In a recent podcast, experts compared the capabilities of the Canton Network and the XRP Ledger. The Depository Trust & Clearing Corporation's use of Canton for tokenization was debated, with the conclusion that it doesn't directly impact XRP's functionality. Canton focuses on real-world asset tokenization and privacy within subnets, while the XRP Ledger stands out for its instant cross-border and cross-asset settlement features. The Ledger is considered a bridge asset system, suggesting its crucial role in the future financial landscape. Check out the full article on Benzinga.com for more insights.",
            "link": "https://www.markets.news/headlines/c5b698bd-eb98-4ab7-82a2-7db28bb55229",
            "pub_date": "2026-02-28 05:39:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Principal Real Estate Income Fund (NYSE: PGZ) paid $0.105 per share on Feb 27, 2026 to shareholders, as part of managed distribution plan.",
            "id": "eedc3188-3b9b-477d-9f2c-3f333d5a5c76",
            "description": "In Denver, the Principal Real Estate Income Fund (NYSE: PGZ) disclosed the origin of a distribution on February 27, 2026, amounting to $0.1050 per share. This distribution was allocated to shareholders on record as of the end of business on February 12, 2026, following the Fund's managed distribution plan. The U.S. Securities and Exchange Commission mandated this press release under an exemptive order granted to the Fund. Shareholders were also notified of the distribution source through a notice as required.",
            "link": "https://www.markets.news/headlines/eedc3188-3b9b-477d-9f2c-3f333d5a5c76",
            "pub_date": "2026-02-28 05:40:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UDR to participate in 2026 Citi Global Property CEO Conference with their CEO, Thomas Toomey, on March 3, 2026 at 11:40 am ET. Webcast available at given link.",
            "id": "cd1037e4-f254-42d3-b5ae-c92fc4a7fe45",
            "description": "UDR, Inc., a top multifamily real estate investment trust traded on NYSE as UDR, will have its Chairman, President, and CEO, Thomas W. Toomey, along with the executive team, hosting a roundtable at the 2026 Citi Global Property CEO Conference on March 3, 2026, at 11:40 a.m. Eastern Time. This event will be live-streamed as a webcast accessible at https://kvgo.com/citi/udr-march-2.",
            "link": "https://www.markets.news/headlines/cd1037e4-f254-42d3-b5ae-c92fc4a7fe45",
            "pub_date": "2026-02-28 05:40:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AMTD Digital Inc.'s full-year results show significant growth: Revenue up 565.7% to $136.1M, Net Income up 132.7% to $97.0M.",
            "id": "8283f5cb-bb4f-47ef-bbe4-51906c245931",
            "description": "On February 27, 2026, AMTD Digital Inc., a subsidiary of AMTD IDEA and AMTD Group Inc., disclosed the submission of its annual report on Form 20-F to the U.S. Securities and Exchange Commission for the fiscal year concluding on October 31, 2025. Significant findings detailed in the report include a remarkable 565.7% surge in Total Revenue, escalating from US$20.4 million to US$136.1 million. Additionally, Total Net Income displayed a notable increase of 132.7%, climbing from US$41.7 million to US$97.0 million during the same period. Further information is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/8283f5cb-bb4f-47ef-bbe4-51906c245931",
            "pub_date": "2026-02-28 05:40:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "90af52f5-04b1-44c0-97e2-d9efc06adb34",
            "description": "Article on disclosure notices about a company's stake ownership reaching the 5% threshold.",
            "link": "https://www.markets.news/headlines/90af52f5-04b1-44c0-97e2-d9efc06adb34",
            "pub_date": "2026-02-28 05:32:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Frontline plc announces Ørjan Svanevik's resignation as Director. Board thanks him for his contribution.",
            "id": "bf9cad68-e5b7-4d56-adf6-793687bd7ea0",
            "description": "Frontline plc has announced the resignation of Mr. Ørjan Svanevik as Director of the Company. The Board expresses gratitude for his significant contributions during his tenure.",
            "link": "https://www.markets.news/headlines/bf9cad68-e5b7-4d56-adf6-793687bd7ea0",
            "pub_date": "2026-02-28 05:32:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "XTL Biopharmaceuticals Ltd. received Nasdaq delist determination as a \"public shell\"; plans to request hearing.",
            "id": "e09f91e6-9b3f-44e9-af4a-5b26d70a30f0",
            "description": "In Ramat Gan, Israel, on February 27, 2026, XTL Biopharmaceuticals Ltd. (Nasdaq: XTLB) (TASE: XTLB.TA) disclosed receiving a letter on February 25, 2026, from The Nasdaq Stock Market LLC's Listing Qualifications Department. The communication stated that the Company is deemed a \"public shell\" as per Nasdaq Listing Rule 5101, casting doubts on the continued validity of the listing for XTL's American Depositary Shares (ADSs). To challenge this assessment, XTL plans to request a hearing with a Nasdaq Hearings Panel. During this appeal process, the suspension and delisting of the ADSs will be put on hold pending the Panel’s decision.",
            "link": "https://www.markets.news/headlines/e09f91e6-9b3f-44e9-af4a-5b26d70a30f0",
            "pub_date": "2026-02-28 05:32:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chart Industries (NYSE: GTLS) disclosed Q4 & full year 2025 financial results as of Dec 31st. ",
            "id": "b62a7fd4-3129-4f2d-ac2b-d8c00713b5b1",
            "description": "On February 27, 2026, in Houston, Chart Industries, Inc. (NYSE: GTLS) announced its financial results for the fourth quarter and the entire year ending on December 31, 2025.",
            "link": "https://www.markets.news/headlines/b62a7fd4-3129-4f2d-ac2b-d8c00713b5b1",
            "pub_date": "2026-02-28 05:32:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8e3cc756-322e-4d24-bd10-831c4c7fb5bb",
            "description": "TRUMP ON IRAN STRIKE IMPACT ON OIL PRICES: NOT CONCERNED",
            "link": "https://www.markets.news/headlines/8e3cc756-322e-4d24-bd10-831c4c7fb5bb",
            "pub_date": "2026-02-28 05:32:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MTL Cannabis Corp. releases Q3 results, files financial statements for periods ending Dec 31, 2025 and 2024. ",
            "id": "f9d74d64-7651-4069-aafa-8b2f7f7559a7",
            "description": "In Pickering, Ontario, on February 27, 2026, MTL Cannabis Corp. (CSE: MTLC) (OTCQX: MTLNF) announced that it has submitted its financial statements for the three-month and nine-month periods concluding on December 31 of 2025 and 2024. These documents are available for review on the Company's SEDAR+ profile at www.sedarplus.ca. For more information, the complete news story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/f9d74d64-7651-4069-aafa-8b2f7f7559a7",
            "pub_date": "2026-02-28 05:33:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sable Offshore (NYSE: SOC) Q4 earnings beat estimates by 33.9% with EPS of $-0.39. Revenue remained unchanged.",
            "id": "671c97a2-9552-4045-89de-5517f2ced641",
            "description": "Sable Offshore (NYSE: SOC) unveiled its Q4 financial results on February 27, 2026, at 01:00 AM. The earnings report highlighted significant details. Sable Offshore surpassed earnings expectations by 33.9%, posting an EPS of $-0.39 compared to the estimated $-0.59. Revenue remained unchanged from the previous year. In the prior quarter, the company fell short on earnings. For further details, the complete article is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/671c97a2-9552-4045-89de-5517f2ced641",
            "pub_date": "2026-02-28 05:33:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AMTD Digital reports significant financial growth: 565.7% increase in revenue, 132.7% increase in net income, and 280.2% increase in net assets.",
            "id": "7913b984-40b7-4259-8144-0f33ee1a696f",
            "description": "On February 27, 2026, AMTD Digital Inc. (NYSE: HKD), a subsidiary of AMTD Group Inc., disclosed the submission of its annual report for the fiscal year ended October 31, 2025, to the Securities and Exchange Commission. The report encompasses the financial outcomes of The Generation Essentials Group (TGE) listed on NYSE and LSE. Key points include a significant surge in Total Revenue by 565.7% from US$20.4 million to US$136.1 million, and a 132.7% rise in Total Net Income. For more detailed information, the full story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/7913b984-40b7-4259-8144-0f33ee1a696f",
            "pub_date": "2026-02-28 05:33:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is SOL undervalued despite being 72% below its ATH? Resilient data suggests a compelling investment opportunity. #Solana",
            "id": "49a60f3c-791a-4bfa-92a9-a22859a2966d",
            "description": "The price of SOL has decreased by 72% from its peak value, raising questions about its investment potential. However, various data points suggest an attractive opportunity may be emerging. Is SOL currently being traded at a significant markdown?",
            "link": "https://www.markets.news/headlines/49a60f3c-791a-4bfa-92a9-a22859a2966d",
            "pub_date": "2026-02-28 05:33:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Federated Hermes, Inc. files Form 10-K for FY 2025 with SEC, a global leader in active investing (NYSE: FHI).",
            "id": "2d9dea7d-374a-4042-8074-1869ccc43a67",
            "description": "In Pittsburgh on February 27, 2026, Federated Hermes, Inc., a prominent figure in active investing worldwide, submitted its yearly report on Form 10-K to the U.S. Securities and Exchange Commission for the fiscal period concluding on December 31, 2025. Federated Hermes provided comprehensive details on its financial performance and operations during this time.",
            "link": "https://www.markets.news/headlines/2d9dea7d-374a-4042-8074-1869ccc43a67",
            "pub_date": "2026-02-28 05:35:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Neuberger Next Generation Connectivity Fund (NYSE: NBXG) declares $0.12/share distribution, payable on Mar 31, 2026.",
            "id": "dde7b805-6a09-42ef-870c-e3d1ced994e2",
            "description": "On February 27, 2026, Neuberger Next Generation Connectivity Fund Inc. (NYSE: NBXG) disclosed a distribution declaration of $0.12 per common stock share. This distribution will be paid on March 31, 2026, with a record date of March 16.",
            "link": "https://www.markets.news/headlines/dde7b805-6a09-42ef-870c-e3d1ced994e2",
            "pub_date": "2026-02-28 05:31:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Women entrepreneurs celebrated 3rd Anniversary of NYTS HERstory Unveiled in Times Square on International Women's Day.",
            "id": "becfbd8c-8a86-407e-8548-11ab4d36ceae",
            "description": "Entrepreneur Sharon Ringier commemorates the 3rd Anniversary of the NYTS HERstory Unveiled Billboard Experience in Times Square on International Women's Day. The event highlights women entrepreneurs and their leadership, providing a platform for visibility.",
            "link": "https://www.markets.news/headlines/becfbd8c-8a86-407e-8548-11ab4d36ceae",
            "pub_date": "2026-02-28 05:31:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Neuberger High Yield Strategies Fund (NYSE: NHS) declares $0.0905 per share distribution, payable on March 31, 2026.",
            "id": "f6015060-18d1-4506-a9a3-2b4e4182c790",
            "description": "On February 27, 2026, Neuberger High Yield Strategies Fund Inc. disclosed a distribution declaration of $0.0905 per common stock share (NYSE American: NHS). The payment is set for March 31, 2026, with a record date of March 16...",
            "link": "https://www.markets.news/headlines/f6015060-18d1-4506-a9a3-2b4e4182c790",
            "pub_date": "2026-02-28 05:31:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "In 2026, FDA waives fees for Innocan Pharma Corp for the third time. Company focused on pharmaceuticals.",
            "id": "ad189168-29c0-4ce3-b838-e6a9cc2dd054",
            "description": "Innocan Pharma Corporation, a leading company in the pharmaceutical and biotechnology sectors, recently disclosed exciting news. On February 27, 2026, they revealed that the FDA's Center for Veterinary has granted them a special authorization. Based in Herzliya, Israel, and Calgary, AB, Innocan operates under the ticker symbols CSE: INNO, FSE: IP40, and OTCQB: INNPD. This recognition marks a significant milestone for the innovative company, demonstrating its commitment to excellence and advancement in the field.",
            "link": "https://www.markets.news/headlines/ad189168-29c0-4ce3-b838-e6a9cc2dd054",
            "pub_date": "2026-02-28 05:31:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}