{
    "data": [
        {
            "title": "CoreWeave stock drops post-Q4 earnings with wider loss; revenue beats estimates, order backlog up 20%.",
            "id": "0a9bc6be-119f-4cf1-a3f3-4fe2c4d60300",
            "description": "After CoreWeave, a cloud computing services provider, reported a loss larger than anticipated, its stock experienced a decline. However, the revenue exceeded expectations by a slight margin. The company's order backlog has increased by 20% in the fourth quarter. This news resulted in a decrease in CoreWeave's stock value.",
            "link": "https://www.markets.news/headlines/0a9bc6be-119f-4cf1-a3f3-4fe2c4d60300",
            "pub_date": "2026-02-27 06:17:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rocket Lab reports successful Q4 earnings, launches, acquisitions. Space stocks rise. Space Force investigates Vulcan issue.",
            "id": "79d7be24-b70d-483f-8849-c0ac47347fd7",
            "description": "Rocket Lab topped the charts for space stocks following their report on Thursday. AST SpaceMobile, a rival of SpaceX, will report on Monday. The Space Force is conducting an investigation into an anomaly with Vulcan. Rocket Lab announced impressive results, including new launch contracts, advancements in solar arrays, and an acquisition in Q4. This news was originally featured in Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/79d7be24-b70d-483f-8849-c0ac47347fd7",
            "pub_date": "2026-02-27 06:17:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies beats Q4 estimates, stock jumps. Positive outlook boosts investor confidence.",
            "id": "0528881d-0b3c-4bb9-9dc9-e82ea4b3a52d",
            "description": "Dell Technologies, a leading computer manufacturer, significantly surpassed expectations for its fiscal fourth quarter and provided a positive forecast. Following this news, Dell's stock saw a substantial increase in value.",
            "link": "https://www.markets.news/headlines/0528881d-0b3c-4bb9-9dc9-e82ea4b3a52d",
            "pub_date": "2026-02-27 06:17:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin ETFs had highest daily inflows in 3 weeks. MARA's surge on AI partnership. Trump-linked miner MARA reports results.",
            "id": "34f02994-8f3c-46ae-a91a-38dbc76d2b5c",
            "description": "Bitcoin exchange-traded funds (ETFs) experience a significant increase in daily inflows, reaching their highest levels in the past three weeks. Several companies, including American Bitcoin, MARA, TeraWulf, and Figure, have released their financial results. Among these, MARA experiences a surge in value due to its partnership in artificial intelligence (AI). Additionally, a mining company associated with former President Trump announces its results.",
            "link": "https://www.markets.news/headlines/34f02994-8f3c-46ae-a91a-38dbc76d2b5c",
            "pub_date": "2026-02-27 06:17:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "66907c0e-8e2c-4db9-aa9d-a36bac808bfe",
            "description": "PARAMOUNT COMMENTS ON WARNER BROS DISCOVERY BOARD’S DETERMINATION THAT ITS PROPOSAL IS SUPERIOR",
            "link": "https://www.markets.news/headlines/66907c0e-8e2c-4db9-aa9d-a36bac808bfe",
            "pub_date": "2026-02-27 06:18:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a1a85965-bade-41c2-8afb-772ef1ef0fa8",
            "description": "OPENAI SHARES LETTER OUTLINING MEASURES IT SAYS THE COMPANY IS TAKING IN RESPONSE TO CANADA SHOOTING INCIDENT",
            "link": "https://www.markets.news/headlines/a1a85965-bade-41c2-8afb-772ef1ef0fa8",
            "pub_date": "2026-02-27 06:22:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Denarius Metals reveals plan for interest payments to be made by February 28, 2026 on its convertible unsecured debentures.",
            "id": "3ec67f91-956a-4999-b06d-56e633fe1602",
            "description": "Denarius Metals Corp. (Cboe CA: DMET) (OTCQX: DNRSF) revealed plans for the upcoming monthly interest payments, scheduled for February 28, 2026, related to its convertible unsecured debentures maturing on October 19, 2029. The company announced this information today, setting the stage for investors and stakeholders.",
            "link": "https://www.markets.news/headlines/3ec67f91-956a-4999-b06d-56e633fe1602",
            "pub_date": "2026-02-27 06:23:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "54ffaaf0-bc99-40fd-b88e-8802388c963e",
            "description": "OPENAI SAYS IT WILL ESTABLISH DIRECT POINTS OF CONTACT WITH CANADIAN LAW ENFORCEMENT AUTHORITIES",
            "link": "https://www.markets.news/headlines/54ffaaf0-bc99-40fd-b88e-8802388c963e",
            "pub_date": "2026-02-27 06:23:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "25bbf909-9996-44d3-82b2-db84f057be49",
            "description": "OPENAI SAYS DESPITE ITS DETECTION SYSTEM, AFTER THE NAME OF THE ALLEGED TUMBLER RIDGE PERPETRATOR WAS RELEASED PUBLICLY, CO DISCOVERED THAT PERPETRATOR HAD USED A SECOND CHATGPT ACCOUNT",
            "link": "https://www.markets.news/headlines/25bbf909-9996-44d3-82b2-db84f057be49",
            "pub_date": "2026-02-27 06:24:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "cafff2bf-1589-4b40-ba33-b20bd074205e",
            "description": "IMF: EXECUTIVE BOARD APPROVES US$8.1 BILLION UNDER AN EXTENDED FUND FACILITY (EFF) ARRANGEMENT FOR UKRAINE",
            "link": "https://www.markets.news/headlines/cafff2bf-1589-4b40-ba33-b20bd074205e",
            "pub_date": "2026-02-27 06:25:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ContextLogic acquired US Salt for $907.5M, transforming into a business ownership platform with $2.9B NOLs.",
            "id": "51e1b564-d89c-49ed-a21b-3c55987a3654",
            "description": "The merger has resulted in the formation of a prominent public ownership platform with robust cash flow and holding approximately $2.9 billion in net operating losses (NOLs).",
            "link": "https://www.markets.news/headlines/51e1b564-d89c-49ed-a21b-3c55987a3654",
            "pub_date": "2026-02-27 06:13:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Surge Copper completes $20M private placement's first tranche.",
            "id": "d4fd866c-0231-4e45-be3e-bc25f8cad78d",
            "description": "Over 800 people have been reported missing in the aftermath of the recent natural disaster, with approximately 500 individuals still unaccounted for. The devastating event has led to over 200 casualties, with more than 300 injured. The search and rescue operations are ongoing to locate those missing and provide assistance to those affected. The authorities are urging the public to remain cautious and follow safety guidelines during this challenging time.",
            "link": "https://www.markets.news/headlines/d4fd866c-0231-4e45-be3e-bc25f8cad78d",
            "pub_date": "2026-02-27 06:13:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Columbus Circle Capital Corp II allows separate trading of Class A shares and warrants from Feb 27, 2026. Symbols CMII and CMIIW on Nasdaq.",
            "id": "c32ef086-d70c-4e49-aa1c-e8d20886372e",
            "description": "Columbus Circle Capital Corp II (Nasdaq: CMIIU) revealed on Feb. 26, 2026, that starting from Feb. 27, 2026, holders of units from the Company’s initial public offering can opt to independently trade the Company’s Class A ordinary shares and warrants included in the units. Upon separation of the units, only whole warrants will be traded as no fractional warrants will be issued. The separated Class A ordinary shares and warrants will be listed on the Nasdaq Global Market with the symbols “CMII” and “CMIIW,” respectively. Units that remain unseparated will continue trading on the Nasdaq Global Market with the symbol “CMIIU.”",
            "link": "https://www.markets.news/headlines/c32ef086-d70c-4e49-aa1c-e8d20886372e",
            "pub_date": "2026-02-27 06:13:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sysco (NYSE:SYY) declares $0.54 per share dividend, payable on April 24, 2026 to stockholders of record on April 2.",
            "id": "71588f3f-7a04-4f73-a148-7fd3ef72aae7",
            "description": "Sysco Corporation (NYSE:SYY) based in Houston disclosed on February 26, 2026 that its Board of Directors has approved a quarterly cash dividend of $0.54 per share. This dividend is set to be distributed on April 24, 2026, to common stockholders holding shares as of April 2, 2026.",
            "link": "https://www.markets.news/headlines/71588f3f-7a04-4f73-a148-7fd3ef72aae7",
            "pub_date": "2026-02-27 06:13:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Red River Bancshares, Inc. increased its quarterly cash dividend to $0.25 per share, up 67% from $0.15, payable on March 19, 2026. CEO emphasizes commitment to capital return.",
            "id": "ee47bd47-fd29-4777-bff0-5c4fee6b74eb",
            "description": "In Alexandria, Louisiana on February 26, 2026, Red River Bancshares, Inc. (Nasdaq: RRBI) shared news of a substantial financial move. The company's board of directors declared a quarterly cash dividend of $0.25 per common stock share, marking a significant rise of $0.10 or about 67% compared to the previous quarter's $0.15 per share. This cash dividend will be disbursed on March 19, 2026, to shareholders noted in records by the end of business on March 9, 2026. R. Blake Chatelain, the President and Chief Executive Officer, expressed satisfaction saying, \"We are thrilled to reveal this new increase in our quarterly dividend. Our augmented dividend mirrors our ongoing commitment to provide returns to our shareholders, all the while upholding solid capital ratios.\"",
            "link": "https://www.markets.news/headlines/ee47bd47-fd29-4777-bff0-5c4fee6b74eb",
            "pub_date": "2026-02-27 06:13:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stocks rebound after AMD-Meta deal worth $100 billion; AMD shares surge 9%, S&P 500 up 0.7%, Nasdaq 100 up 1.2%.",
            "id": "32257c7a-32f5-407c-91e0-e5e04f750416",
            "description": "In the US, stocks bounced back on Tuesday after a significant drop on Monday prompted by economic concerns related to a cautionary report from Citrini Research about AI's impact on jobs. Investor confidence improved as Advanced Micro Devices Inc. (NASDAQ: AMD) secured a monumental $100 billion infrastructure deal with Meta Platforms Inc. (NASDAQ: META). Meta inked a 5-year agreement to buy AMD chips for its data centers, starting with one gigawatt this year and scaling up to six gigawatts. AMD's stock surged by 9%, stimulating a widespread rally in tech stocks. By midday in New York, the S&P 500 increased by 0.7%, the Dow Jones Industrial Average was up by 0.8%, and the Nasdaq 100 led with a 1.2% rise. Small-cap stocks also gained ground. Following a 4.7% dip on Monday, the iShares Tech-Expanded Software Sector ETF (NYSE: IGV) rebounded by 1.5%. Devalued software companies like Salesforce Inc. (NYSE: CRM) and Adobe Inc. (NASDAQ: ADBE) both saw approximately a 4% increase in share prices.",
            "link": "https://www.markets.news/headlines/32257c7a-32f5-407c-91e0-e5e04f750416",
            "pub_date": "2026-02-27 06:14:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Verdad Resources sells entire oil and gas business to Peoria Resources, LLC, a subsidiary of JAPEX (U.S.) Corp.",
            "id": "02899eda-17d6-4212-ab23-4249fc96e616",
            "description": "In Denver on February 26, 2026, Verdad Resources Holdings LLC revealed the successful sale of its entire operated oil and gas business. Peoria Resources, LLC, a subsidiary of JAPEX (U.S.) Corp., acquired the business in the transaction.",
            "link": "https://www.markets.news/headlines/02899eda-17d6-4212-ab23-4249fc96e616",
            "pub_date": "2026-02-27 06:15:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Teachers Federal Credit Union and Corridor Platforms partner to launch Precision CUSO, enhancing AI-driven credit decisioning.",
            "id": "1cb4687f-fb80-4522-a26e-6a0f9968ae28",
            "description": "Hauppauge, NY and Haworth, NJ - On February 26, 2026, Precision CUSO introduced an AI-driven decisioning platform that facilitates approval automation, scalability, and sustainable competitiveness within the financial sector. This innovation has been adopted by Teachers Federal Credit Union, a leading credit union in the U.S. boasting a substantial member base exceeding a significant number.",
            "link": "https://www.markets.news/headlines/1cb4687f-fb80-4522-a26e-6a0f9968ae28",
            "pub_date": "2026-02-27 06:15:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flashfood data shows increased demand for affordable meat and eggs. Protein makes up over 30% of sales, with a 28% increase in ground beef purchases from Jan 2025 to Jan 2026.",
            "id": "6e1c8a12-9b13-4425-a34c-0a3ee46164ff",
            "description": "In New York, recent data from budget-friendly grocery app Flashfood shows a significant surge in the demand for inexpensive, fresh essentials like beef and eggs amidst growing financial pressure and soaring grocery costs in the United States. The statistics highlight a concerning affordability issue that is unfolding across the country. Currently, protein accounts for over 30% of all transactions on Flashfood's platform. A comparison of Flashfood's figures between January 2025 and January 2026 reveals a 28% rise in purchases of ground beef.",
            "link": "https://www.markets.news/headlines/6e1c8a12-9b13-4425-a34c-0a3ee46164ff",
            "pub_date": "2026-02-27 06:16:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Weave to present at Raymond James conference on March 2, 2026; aims to discuss AI-powered solutions for healthcare practices.",
            "id": "039ec5ed-a499-4e01-a0d6-b81414f942a1",
            "description": "Lehi, Utah-based company Weave, known for its AI-driven patient engagement and payment solutions for small to medium healthcare practices, shared plans to attend the 47th Raymond James Institutional Investors Conference at JW Marriott Grande Lakes in Orlando, Florida on March 2, 2026. The CEO Brett White and CFO Jason Christiansen will lead a fireside chat at the event. Weave, listed as WEAV on NYSE, is a prominent vertical SaaS platform in the healthcare sector.",
            "link": "https://www.markets.news/headlines/039ec5ed-a499-4e01-a0d6-b81414f942a1",
            "pub_date": "2026-02-27 06:08:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}