{
    "data": [
        {
            "title": "",
            "id": "16bfbfdb-658a-46b4-97f9-cb9f6e63cf2e",
            "description": "On Feb 24, four eVTOL “flying cars” debuted in . About the size of a family sedan, they carry 4 people , fly over 20 minutes, and could begin sightseeing operations by 2027.",
            "link": "https://www.markets.news/headlines/16bfbfdb-658a-46b4-97f9-cb9f6e63cf2e",
            "pub_date": "2026-02-26 18:36:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CerraCap Impact VC invests in Bandelier Technologies for quantum sensing, national security innovation. Feb. 26, 2026.",
            "id": "7672b91e-ef6a-4341-9baa-efe03cdcdb35",
            "description": "CerraCap Impact Venture Capital (CIVC) has recently made a significant investment in frontier defense technologies and advanced quantum systems designed for practical use. This investment demonstrates CIVC's dedication to supporting the development and deployment of cutting-edge technologies. The investment was disclosed on February 26, 2026, highlighting CIVC's focus on fostering innovation in industries crucial to national security. This strategic move aligns with CIVC's mission to drive advancements in frontier defense and quantum systems, underscoring the importance of investing in these sectors. The investment showcases CIVC's commitment to forward-thinking technologies, emphasizing their role in shaping the future landscape of defense and quantum computing.",
            "link": "https://www.markets.news/headlines/7672b91e-ef6a-4341-9baa-efe03cdcdb35",
            "pub_date": "2026-02-26 18:40:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Johns Hopkins study shows 85% of first graders maintain reading proficiency through second grade with Ignite Reading program. \"First Grade Promise\" launched to ensure all kids achieve literacy in first grade.",
            "id": "50a7b5a6-4a16-49c0-a400-2b1546f8d94b",
            "description": "Ignite Reading has announced the launch of the \"First Grade Promise\" initiative in Oakland, California on February 26, 2026. The program aims to ensure that every child achieves reading proficiency in first grade. According to recent data, 85% of proficient first graders were able to maintain their success through second grade without needing additional support. The initiative by Ignite Reading seeks to bridge the gap and support the remaining 15% of students to ensure they also reach reading proficiency by the end of first grade.",
            "link": "https://www.markets.news/headlines/50a7b5a6-4a16-49c0-a400-2b1546f8d94b",
            "pub_date": "2026-02-26 18:40:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Over 1,000 cocktail lovers gather in Brooklyn for The Bloody Mary Festival's spicy comeback, featuring NYC's inventive drinks.",
            "id": "ef20798f-ecae-40b1-9439-750569cfb27d",
            "description": "Over 1,000 enthusiasts of cocktails will convene in Brooklyn to participate in a tasting event showcasing the most creative Bloody Marys in New York City. The event will take place on February 26, 2026, and is set to highlight the Bloody Mary, known for its hearty composition with many referring to it as a drinkable meal. Attendees can anticipate escalating spice levels at the event as they sample various renditions of this classic cocktail.",
            "link": "https://www.markets.news/headlines/ef20798f-ecae-40b1-9439-750569cfb27d",
            "pub_date": "2026-02-26 18:40:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CD&R Foundation donates £1.3 million to 3 UK non-profits for economic opportunity and employment.",
            "id": "90d96182-df28-4276-b7e5-bfe7ad65e617",
            "description": "On February 26, 2026, CD&R unveiled that the CD&R Foundation has allocated grants amounting to £1.3 million for three UK non-profit groups. The funds will be distributed within the upcoming three years.",
            "link": "https://www.markets.news/headlines/90d96182-df28-4276-b7e5-bfe7ad65e617",
            "pub_date": "2026-02-26 18:40:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SHINE secures $240M funding led by Dr. Patrick Soon-Shiong, with participation from major companies. Soon-Shiong joins board.",
            "id": "fc4cd04a-4c3e-4cc7-bcd4-64470d11b857",
            "description": "Several major companies, including Fidelity Management & Research Company, Sumitomo Corporation of Americas, Pelican Energy Partners, Deerfield Management, and Oaktree Capital Management, took part in a recent financing round in Janesville, Wisconsin. The funding round occurred on February 26, 2026, and involved SHINE Technologies, a nuclear fusion company. The specific amount of funding raised was not provided in the information.",
            "link": "https://www.markets.news/headlines/fc4cd04a-4c3e-4cc7-bcd4-64470d11b857",
            "pub_date": "2026-02-26 18:40:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Consumer365 report recognizes Sage as best accounting software for UK self-employed, offering affordable tools in 2026.",
            "id": "fc6fb05e-f042-42b6-947c-b3288ad07f28",
            "description": "In a recent report by Consumer365, the changing requirements of self-employed individuals in the UK were analyzed. The focus was on accounting software tailored to aid in financial management and adherence to regulations. Sage, a well-known provider, was recognized in the report as being particularly beneficial for self-employed professionals. The study delves into the increasing demand for efficient financial solutions among this demographic, showcasing a growing need for specialized tools.",
            "link": "https://www.markets.news/headlines/fc6fb05e-f042-42b6-947c-b3288ad07f28",
            "pub_date": "2026-02-26 18:40:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global amusement parks market to reach $138.7 billion by 2034 at 6.8% CAGR, offering diverse entertainment experiences.",
            "id": "c810dec3-b9f8-40c2-8c9f-b685347ff205",
            "description": "WILMINGTON, Del. - On February 26, 2026, the worldwide market size for amusement parks reached a significant value. These parks are popular entertainment spots offering rides, games, attractions, and food options for visitors of various age groups. They provide a full day of enjoyment for those who visit, contributing to their continued success and growth in the industry.",
            "link": "https://www.markets.news/headlines/c810dec3-b9f8-40c2-8c9f-b685347ff205",
            "pub_date": "2026-02-26 18:40:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Polystar launches four AI-driven features at MWC 2026 to aid telecom operators in managing network complexity and service quality.",
            "id": "dce77792-bebc-469b-9c8d-c4b8aa4150e9",
            "description": "At the upcoming Mobile World Congress 2026 in Stockholm, Polystar, a division of Elisa Industriq, is set to unveil four innovative AI-powered features. These new capabilities aim to enhance the ability of telecom operators to effectively handle network intricacies and ensure service excellence. Among the advancements is the introduction of agentic AI, along with automated functions. This move signifies a significant step towards enabling smoother operations and higher service standards in the industry.",
            "link": "https://www.markets.news/headlines/dce77792-bebc-469b-9c8d-c4b8aa4150e9",
            "pub_date": "2026-02-26 18:40:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d420002c-a954-4087-a765-0abbfc7fd63b",
            "description": "HUNGARY'S ORBAN ASKS EU FOR FACT-FINDING MISSION TO VERIFY STATUS OF DRUZHBA PIPELINE, LETTER SHOWS",
            "link": "https://www.markets.news/headlines/d420002c-a954-4087-a765-0abbfc7fd63b",
            "pub_date": "2026-02-26 18:26:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "565fe7ea-45d9-4514-813e-19541abae8db",
            "description": "ASSESSMENT OF DRUZHBA DAMAGE AIMS TO FACILITATE TIMELY RESOLUTION OF THIS ISSUE, ORBAN SAYS IN LETTER",
            "link": "https://www.markets.news/headlines/565fe7ea-45d9-4514-813e-19541abae8db",
            "pub_date": "2026-02-26 18:27:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3fd31579-a1d7-4469-96be-f60b07ae4618",
            "description": "SUCH A MISSION SHOULD INCLUDE EXPERTS DELEGATED BY HUNGARY AND SLOVAKIA, ORBAN SAYS IN LETTER TO EUROPEAN COUNCIL PRESIDENT",
            "link": "https://www.markets.news/headlines/3fd31579-a1d7-4469-96be-f60b07ae4618",
            "pub_date": "2026-02-26 18:27:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4af732ae-32c8-45cd-aaf3-53fa36c68171",
            "description": "I AM AWARE OF THE POLITICAL DIFFICULTIES CAUSED BY DELAY TO EU'S FINANCIAL SUPPORT FOR UKRAINE, ORBAN SAYS IN LETTER",
            "link": "https://www.markets.news/headlines/4af732ae-32c8-45cd-aaf3-53fa36c68171",
            "pub_date": "2026-02-26 18:27:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fbaae647-a3f9-4a71-9b45-ad8b51fd5a58",
            "description": "HUNGARY WILL ACCEPT THE FINDINGS OF SUCH A MISSION, ORBAN SAYS IN LETTER",
            "link": "https://www.markets.news/headlines/fbaae647-a3f9-4a71-9b45-ad8b51fd5a58",
            "pub_date": "2026-02-26 18:27:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "440a7f4b-56da-46f7-81e1-205f43d3ca3e",
            "description": "CIBC 1Q BASEL III CET 1 RATIO 13.4%, EST. 13.3%  1Q ADJ ROE 17.4%, EST. 15.3%",
            "link": "https://www.markets.news/headlines/440a7f4b-56da-46f7-81e1-205f43d3ca3e",
            "pub_date": "2026-02-26 18:28:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4cde2e95-1a65-4282-8331-cc445fb2ffe3",
            "description": "CIBC 1Q PROVISION FOR CREDIT LOSSES C$568M, EST. C$563.4M",
            "link": "https://www.markets.news/headlines/4cde2e95-1a65-4282-8331-cc445fb2ffe3",
            "pub_date": "2026-02-26 18:28:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "78267bc7-e475-4d2a-b8ec-10df640cfc5e",
            "description": "CIBC 1Q ADJ EPS C$2.76, EST. C$2.38  CIBC 1Q ADJ. REV. C$8.40B, EST. C$7.68B",
            "link": "https://www.markets.news/headlines/78267bc7-e475-4d2a-b8ec-10df640cfc5e",
            "pub_date": "2026-02-26 18:28:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4c21d8bb-6efb-456a-89e7-880879427c00",
            "description": "US BRINGS TOUGH DEMANDS TO IRAN NUCLEAR TALKS - WSJ",
            "link": "https://www.markets.news/headlines/4c21d8bb-6efb-456a-89e7-880879427c00",
            "pub_date": "2026-02-26 18:30:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gate expands EU presence with Malta payments license for fiat and stablecoin operations, enabling payment transactions in EU under PSD2 rules.",
            "id": "1925242c-a325-4845-a0fd-23dc743f2f41",
            "description": "Gate has been granted a license to process payment transactions within the EU in accordance with PSD2 regulations. This license enables Gate to conduct direct debits and credit transfers in the EU.",
            "link": "https://www.markets.news/headlines/1925242c-a325-4845-a0fd-23dc743f2f41",
            "pub_date": "2026-02-26 18:22:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novonesis reports trading by management under ISIN DK0060336014. Compliant with Market Abuse Regulation.",
            "id": "aa2c2397-92a4-4644-8dda-8f9d4160762c",
            "description": "Novonesis has disclosed transactions under ISIN DK0060336014, Novonesis B shares (Novozymes) with the symbol NSIS B, as mandated by article 19 of Regulation (EU) No 596/2014 on market abuse and commission delegated regulation (EU) 1052/2016.",
            "link": "https://www.markets.news/headlines/aa2c2397-92a4-4644-8dda-8f9d4160762c",
            "pub_date": "2026-02-26 18:24:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}