{
    "data": [
        {
            "title": "Domo to release Q4 and FY 2026 earnings on March 10, 2026 after market close. Conference call at 3pm (MT) / 5pm (ET).",
            "id": "02130749-a5e1-4d68-9273-0c181a95d063",
            "description": "Domo (Nasdaq: DOMO) based in Silicon Slopes, Utah, announced that it will release its fourth-quarter and full-year fiscal 2026 results on Tuesday, March 10, 2026. The fiscal year ended on January 31, 2026. Following the market close, the company will host a conference call at 3:00 p.m. (MT) / 5:00 p.m. (ET) to discuss its financial performance with investors. Those interested can join the call live by dialing (877) 484-6065 or (201) 689-8846. Additionally, a live webcast of the event will be accessible on Domo Inves.",
            "link": "https://www.markets.news/headlines/02130749-a5e1-4d68-9273-0c181a95d063",
            "pub_date": "2026-02-27 22:04:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tradeweb (Nasdaq: TW) to partake in Raymond James Conference on March 3, 2026, with CEO Billy Hult speaking at 8:05 AM EST.",
            "id": "22b673a1-96b9-4475-b8db-36ddcba1fa58",
            "description": "In New York, Tradeweb Markets Inc. (Nasdaq: TW) will be attending the Raymond James 47th Annual Institutional Investors Conference on Tuesday, March 3, 2026. CEO Billy Hult will engage in a fireside chat at 8:05 AM EST during the event. Those interested can access the live webcast of the session at https://investors.tradeweb.com/events-",
            "link": "https://www.markets.news/headlines/22b673a1-96b9-4475-b8db-36ddcba1fa58",
            "pub_date": "2026-02-27 22:04:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cloudpermit acquires CityReporter for enhanced local government software suite, expanding maintenance and inspections software capabilities.",
            "id": "9cf0c6f1-fdf8-411c-a235-aacc0cc20803",
            "description": "On February 27, 2026, in Reston, Virginia, Cloudpermit, a prominent community development platform for local governments, announced the acquisition of CityReporter's cloud-based maintenance management and inspections software. This strategic move aims to enhance Cloudpermit's services by integrating CityReporter's expertise in maintenance and asset management. The acquisition underscores Cloudpermit's commitment to providing comprehensive solutions for local governments and is poised to greatly benefit their clients.",
            "link": "https://www.markets.news/headlines/9cf0c6f1-fdf8-411c-a235-aacc0cc20803",
            "pub_date": "2026-02-27 22:04:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AGCO to present at Raymond James conference on March 2, 2026. Damon Audia to participate in fireside chat.",
            "id": "4c9073f1-3f75-484c-bcd2-1ae91cd87fa5",
            "description": "In Duluth, Georgia, on February 27, 2026, AGCO disclosed its participation in the Raymond James 47th Annual Institutional Investors Conference set for March 2, 2026. This will feature a fireside chat with Damon Audia, the Senior Vice President and Chief Officer. AGCO is listed on NYSE as AGCO.",
            "link": "https://www.markets.news/headlines/4c9073f1-3f75-484c-bcd2-1ae91cd87fa5",
            "pub_date": "2026-02-27 22:04:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New Era and adidas team up to supply on-field caps to more baseball programs in 2026, expanding NCAA partnership.",
            "id": "c6d0196b-570b-44ae-8909-8f72f31050a6",
            "description": "Buffalo, NY - A collaboration between New Era and adidas has resulted in the creation of the 2026 NCAA College Baseball Collection. The collection includes a variety of items featuring the iconic logos of popular college baseball teams. The partnership aims to combine the style and innovation of both brands to offer fans high-quality merchandise. The collection can be viewed through images and videos linked above. This collaboration marks a significant step for both companies in the sports and lifestyle market.",
            "link": "https://www.markets.news/headlines/c6d0196b-570b-44ae-8909-8f72f31050a6",
            "pub_date": "2026-02-27 22:04:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IRS no longer has Direct File; opt for Free File program with commercial tax software or free tools for certain filers.",
            "id": "9fa0d490-363a-4eed-80bf-f14d49cf5384",
            "description": "The agency provides a Free File program in collaboration with commercial tax software firms, allowing taxpayers to file their taxes for free. Additionally, some companies offer free tools tailored for specific groups of filers.",
            "link": "https://www.markets.news/headlines/9fa0d490-363a-4eed-80bf-f14d49cf5384",
            "pub_date": "2026-02-27 22:05:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f12fc9bd-ff3b-4a79-ba70-686a41b43c0d",
            "description": "OPENAI’S SAM ALTMAN CALLS FOR DE-ESCALATION IN ANTHROPIC SHOWDOWN WITH HEGSETH - WSJ",
            "link": "https://www.markets.news/headlines/f12fc9bd-ff3b-4a79-ba70-686a41b43c0d",
            "pub_date": "2026-02-27 22:05:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ec677b13-ad9b-4ff6-b0cb-eebf46ff0b52",
            "description": "ISRAELI MILITARY SPOKESPERSON: WE ARE CLOSELY FOLLOWING DEVELOPMENTS ON THE IRANIAN FRONT AND ARE PREPARED TO DEFEND ISRAELI CITIZENS",
            "link": "https://www.markets.news/headlines/ec677b13-ad9b-4ff6-b0cb-eebf46ff0b52",
            "pub_date": "2026-02-27 22:05:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "42e289ba-95cc-416a-9c9d-acc92a05fc1d",
            "description": "NO DEAL HAS BEEN SIGNED BETWEEN OPENAI, DOD: WSJ",
            "link": "https://www.markets.news/headlines/42e289ba-95cc-416a-9c9d-acc92a05fc1d",
            "pub_date": "2026-02-27 22:05:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "209beb7e-9828-485f-a3ea-1b2899309b45",
            "description": "ALTMAN WORKING WITH DOD TO SEE IF MODELS CAN BE USED: WSJ",
            "link": "https://www.markets.news/headlines/209beb7e-9828-485f-a3ea-1b2899309b45",
            "pub_date": "2026-02-27 22:05:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Caris Life Sciences beats Q4 earnings expectations, reports 125% sales growth at $292.89 million, expects growth in 2026.",
            "id": "1094a898-99b5-46fe-85f4-d9e3c47aec44",
            "description": "Caris Life Sciences Inc. (NASDAQ: CAI) exceeded expectations with its fourth-quarter earnings report. The company reported earnings of 28 cents per share, surpassing the projected loss of 3 cents per share. Quarterly sales saw a significant increase, rising by 125% year over year to $292.89 million, well above the expected $208.63 million. The growth in demand for Caris Life Sciences' platform has been robust, driving increased volume and revenue. The company is looking to maintain this positive momentum by advancing its pipeline, with plans to launch the Caris Detect solution in the first half of 2026. David Dean Halbert, the Founder, Chairman, and CEO of Caris Life Sciences, expressed optimism about the future and identified the upcoming launch as a key growth opportunity for the company.",
            "link": "https://www.markets.news/headlines/1094a898-99b5-46fe-85f4-d9e3c47aec44",
            "pub_date": "2026-02-27 21:57:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Notice to convene ordinary general meeting for 2026 at Nasdaq Copenhagen's Nikolaj Plads 6 office.",
            "id": "f5633492-8a62-448d-8ded-2c30f513e6a8",
            "description": "The address for Nasdaq Copenhagen is Nikolaj Plads 6, Copenhagen, Denmark 1067.",
            "link": "https://www.markets.news/headlines/f5633492-8a62-448d-8ded-2c30f513e6a8",
            "pub_date": "2026-02-27 21:57:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "44d56042-0875-46c1-a497-0cf3d13a4ab5",
            "description": "IDF Spokesperson Brig. Gen. Effi Deferin: \"Also this week, we are aware of the sense of uncertainty and tension prevailing among the public in light of regional developments. The IDF is closely monitoring the situation in Iran and is alert and ready to defend you. We are",
            "link": "https://www.markets.news/headlines/44d56042-0875-46c1-a497-0cf3d13a4ab5",
            "pub_date": "2026-02-27 21:57:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Grindr reports 28% full-year revenue growth in Q4 earnings per NYSE update. NYSE issues pre-market advisory every day.",
            "id": "98dfb7de-085e-4539-bb0f-b77c2bb8b9f6",
            "description": "On February 27, 2026, the New York Stock Exchange (NYSE) released a daily pre-market advisory straight from the trading floor. Investors can obtain valuable market insights by accessing this update before the market opens. This initiative aims to provide timely information to traders, offering a competitive edge in the dynamic trading landscape. Stay ahead of the game by reviewing the NYSE Pre-market update daily to make informed investment decisions.",
            "link": "https://www.markets.news/headlines/98dfb7de-085e-4539-bb0f-b77c2bb8b9f6",
            "pub_date": "2026-02-27 21:58:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a5ccba73-bab1-435f-9863-6ad35af9b2d7",
            "description": "OPENAI FOUNDATION'S STAKE IN OPENAI GROUP RISES TO OVER $180B OPENAI EXPANDING AWS PACT BY $100B OVER 8 YEARS OPENAI TO RAISE $110B IN NEW INVESTMENT AT $730B VALUATION (",
            "link": "https://www.markets.news/headlines/a5ccba73-bab1-435f-9863-6ad35af9b2d7",
            "pub_date": "2026-02-27 22:00:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4b8b4652-78b6-4f4b-9cee-68da3cfd7a71",
            "description": "Ukraine president office: 'The President of Ukraine, Volodymyr Zelensky, had a telephone conversation with the President of the Cambodian Senate, Hun Sen.'",
            "link": "https://www.markets.news/headlines/4b8b4652-78b6-4f4b-9cee-68da3cfd7a71",
            "pub_date": "2026-02-27 22:00:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PayPal, MoonPay, and M0 introduce PYUSDx for apps to make their stablecoins, backed by PayPal USD. Fast launch, cross-chain capable, with custom tokens.",
            "id": "79c66534-4d2d-491a-8eee-87ac15db1248",
            "description": "PYUSDx is a platform that allows developers to create stablecoins specific to their apps, backed by PayPal USD. The platform offers a quick launch process, support for cross-chain transactions, and options for branded tokens.",
            "link": "https://www.markets.news/headlines/79c66534-4d2d-491a-8eee-87ac15db1248",
            "pub_date": "2026-02-27 22:00:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "5585eb39-d58d-41bd-adf5-91ab3a8981d8",
            "description": "JASSY SAYS ON BLOCK LAYOFFS: HAVEN'T DIGESTED THAT NEWS",
            "link": "https://www.markets.news/headlines/5585eb39-d58d-41bd-adf5-91ab3a8981d8",
            "pub_date": "2026-02-27 22:00:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "60440d5a-7ae1-4c2c-8f52-7ee8a83bcf17",
            "description": "OPENAI CEO SAYS STILL HAVE A LONG, STATELESS API EXCLUSIVITY WITH MICROSOFT- CNBC INTERVIEW",
            "link": "https://www.markets.news/headlines/60440d5a-7ae1-4c2c-8f52-7ee8a83bcf17",
            "pub_date": "2026-02-27 22:00:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bath & Body Works collaborates with PEEPS for a limited-time collection bringing the iconic treat to life.",
            "id": "3bf993b2-f6b2-4647-9965-ceb6a28e262d",
            "description": "For a limited time, a special collection is available featuring the beloved Marshmallow treat transformed into a delightful fragrance perfect for festive gifting. This unique collection captures the essence of the iconic treat and offers a memorable sensory experience. Don't miss this opportunity to indulge in the sweetness of marshmallows with this exclusive collection.",
            "link": "https://www.markets.news/headlines/3bf993b2-f6b2-4647-9965-ceb6a28e262d",
            "pub_date": "2026-02-27 22:00:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}