{
    "data": [
        {
            "title": "Empire State Realty Trust (NYSE: ESRT) to present at Citi’s CEO Conference on March 2, 2026, at 8:10 AM EST.",
            "id": "c3efa7cc-0a70-42d4-ac82-83299826a174",
            "description": "Empire State Realty Trust, Inc., listed under NYSE as ESRT, shared that Anthony E. Malkin, Chairman and CEO, and Christina Chiu, President, are slated to speak at Citi’s 31st Annual Global Property CEO Conference on March 2, 2026, at 8:10 AM Eastern time. Those interested can tune into a live audio-webcast in listen-only mode on the Company’s Investor Relations website during the roundtable discussion.",
            "link": "https://www.markets.news/headlines/c3efa7cc-0a70-42d4-ac82-83299826a174",
            "pub_date": "2026-02-27 06:03:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "032d8754-9e37-4778-ad5b-ca68a7718064",
            "description": "NVIDIA PRICE TARGET RAISED TO $265.00/SHARE FROM $250.00 BY JP MORGAN",
            "link": "https://www.markets.news/headlines/032d8754-9e37-4778-ad5b-ca68a7718064",
            "pub_date": "2026-02-27 06:04:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arevon Energy appoints Justin Johnson as Interim CEO on Feb 20, 2026. Johnson was the company's COO.",
            "id": "727dc768-38b0-4578-9c29-51a03135cc6f",
            "description": "In Scottsdale, Arizona on February 26, 2026, Arevon Energy, Inc. revealed that Justin Johnson, their Chief Operating Officer, has taken on the role of Interim Chief Executive Officer starting from February 20. Arevon Energy, a prominent energy developer, owner, and operator based in the United States, made this decision known recently.",
            "link": "https://www.markets.news/headlines/727dc768-38b0-4578-9c29-51a03135cc6f",
            "pub_date": "2026-02-27 06:05:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "VTEX filed annual report on Form 20-F for 2025 on Feb 26, 2026. Available on SEC website and company's page.",
            "id": "e79c563c-9fd4-4c8a-aeb7-8b86455287fc",
            "description": "In New York, VTEX (NYSE: VTEX) has disclosed its annual report for the year ending December 31, 2025, which was submitted to the U.S. Securities and Exchange Commission (SEC) on February 26, 2026. The report is accessible through the SEC's website (www.sec.gov/edgar/) and can also be found on VTEX's official website (/www.investors.vtex.com/) as well as on the SEC's database under the Company's page (www.sec.gov/edgar/browse/?CIK=1793663&amp;owner=exclude). Shareholders of Class A common stock are eligible to receive the report.",
            "link": "https://www.markets.news/headlines/e79c563c-9fd4-4c8a-aeb7-8b86455287fc",
            "pub_date": "2026-02-27 06:05:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cinemark (NYSE: CNK) to participate in institutional investor conferences on March 3 & 10, with CEO and SVP presenting.",
            "id": "757fb0a7-ac62-4ec9-8098-71d4e974d77b",
            "description": "Plano, Texas-based Cinemark Holdings, Inc. (NYSE: CNK), a major global movie theater chain, disclosed its involvement in upcoming institutional investor conferences. On Tuesday, March 3, the company will be partaking in the Morgan Stanley TMT Conference in San Francisco, CA. The attendees will include Sean Gamble, the President & CEO, and Chanda Brashears, the Senior Vice President of Investor Relations. They are scheduled for 1:1 investor meetings and a Fireside chat at 2:35 pm PT, which can be accessed at the provided link. Furthermore, the company is set to participate in the Deutsche Bank conference on Tuesday, March 10.",
            "link": "https://www.markets.news/headlines/757fb0a7-ac62-4ec9-8098-71d4e974d77b",
            "pub_date": "2026-02-27 06:05:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NIKE, Inc. plans to release Q3 fiscal 2026 results on April 2, 2026, followed by a 2:00 p.m. PT conference call.",
            "id": "ca5ba805-3f27-4496-94e1-36d3896f9900",
            "description": "Sportswear giant NIKE, Inc. (NYSE: NKE) is set to announce its financial performance for the third quarter of fiscal 2026 on April 2, 2026, at around 1:15 p.m. PT, post the closure of standard stock market hours. Subsequently, the company's management will conduct a conference call from 2:00 p.m. PT onwards to discuss the results. The call will be live-streamed on the web at https://investors.nike.com/. Investors and interested individuals who cannot participate live can access a recording later.",
            "link": "https://www.markets.news/headlines/ca5ba805-3f27-4496-94e1-36d3896f9900",
            "pub_date": "2026-02-27 06:05:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "1089 Inc. partners with Price Forbes and Lloyd's Syndicate 1922 to launch carbon asset insurance framework for transportation and energy sectors, advancing market participation.",
            "id": "d68f696a-1779-4055-9b59-e26356dd5c84",
            "description": "In Boulder, Colorado and London, 1089 has introduced the initial insurance-supported carbon assets for the transportation and energy sectors, expanding institutional market involvement by providing Lloyd’s coverage.",
            "link": "https://www.markets.news/headlines/d68f696a-1779-4055-9b59-e26356dd5c84",
            "pub_date": "2026-02-27 06:05:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pembina Pipeline Corp reports strong financial results for 2025 with earnings of $1,694M and EBITDA of $4,289M.",
            "id": "fbdc81e7-c6ee-406e-bc96-5ea0c56cdea3",
            "description": "Pembina Pipeline Corporation unveiled its financial outcomes for the final quarter and entire year of 2025 in Calgary, Alberta. The company, listed under TSX as PPL and NYSE as PBA, disclosed robust financial figures. For the 2025 full year, earnings totaled $1,694 million, with adjusted EBITDA reaching $4,289 million, and adjusted cash flow from operating activities at $2,854 million ($4.91 per share). The fourth quarter alone recorded earnings of $489 million and an adjusted EBITDA of $1,075 million.",
            "link": "https://www.markets.news/headlines/fbdc81e7-c6ee-406e-bc96-5ea0c56cdea3",
            "pub_date": "2026-02-27 06:05:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sun Nuclear's QA & Dosimetry Symposium in Rome gathers 230+ professionals from 40 countries for advancing radiation therapy QA.",
            "id": "36d2306e-8c95-46bf-ac0c-f11e677a769a",
            "description": "Sun Nuclear, a Mirion Medical subsidiary, inaugurated the QA & Dosimetry Symposium (QADS) in Rome, Italy, which will span two days. The 15th edition of the event has attracted over 230 clinical physicists and radiation medicine experts from almost 40 nations. Attendees from various healthcare settings will accrue continuing education credits as they exchange practical knowledge, innovative strategies, and firsthand perspectives that are influencing the future of the field.",
            "link": "https://www.markets.news/headlines/36d2306e-8c95-46bf-ac0c-f11e677a769a",
            "pub_date": "2026-02-27 06:05:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SoundHound AI (NASDAQ: SOUN) Q4 earnings show flat stock movement, quarterly revenue of $55.06M beats estimates of $53.99M.",
            "id": "9ad759e2-ed4c-46be-8593-6c73f8a707b5",
            "description": "SoundHound AI Inc. (SOUN) saw its shares remain stable in after-hours trading following the release of its Q4 earnings report. The company reported a loss of two cents per share for the quarter, in line with expectations. Revenue for the quarter was $55.06 million, surpassing the estimated $53.99 million and marking an increase from $34.54 million year-over-year. In the full year, SoundHound revealed significant growth, though further details can be found on financial news platforms. Keep an eye on SOUN stock for developments.",
            "link": "https://www.markets.news/headlines/9ad759e2-ed4c-46be-8593-6c73f8a707b5",
            "pub_date": "2026-02-27 05:56:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MP Materials Corp (NYSE: MP) Q4 revenue at $52.69M misses estimates of $67.38M, stock slips. Earnings at 9 cents/share.",
            "id": "54582db3-3d12-413b-9dae-b77f9548552e",
            "description": "MP Materials Corp (NYSE: MP) released its fourth-quarter financial results, with revenue totaling $52.69 million, lower than the projected $67.38 million as per Benzinga Pro. However, the company surpassed analyst expectations with adjusted earnings reaching nine cents per share, exceeding the predicted breakeven earnings. The total revenue saw a 14% decline compared to the previous year due to certain operational changes. Despite the mixed quarterly results, MP Materials stock is currently trending upwards. The driving factors behind the rise in MP shares are outlined in the full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/54582db3-3d12-413b-9dae-b77f9548552e",
            "pub_date": "2026-02-27 05:56:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AAPA states student loan exceeds statutory authority, redefines \"Professional Degree\" in response to U.S. Education Dept, Feb. 26, 2026.",
            "id": "54ed894e-3c04-413a-a938-9eea922c7a2a",
            "description": "In Arlington, Virginia, on February 26, 2026, the American Academy of Physician Associates (AAPA) submitted public comments to the U.S. Department of Education regarding their opposition to a proposed plan. The AAPA, which speaks for around 190,000 physician associates/physician assistants (PAs) nationwide, made their stance clear through this submission.",
            "link": "https://www.markets.news/headlines/54ed894e-3c04-413a-a938-9eea922c7a2a",
            "pub_date": "2026-02-27 05:57:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ademi LLP investigates securities fraud claims against PROCEPT BioRobotics (NASDAQ: PRCT) due to inaccurate statements.",
            "id": "13df8f45-43db-4ec6-a366-751026701fdf",
            "description": "An investigation is being conducted by Ademi LLP into potential securities fraud allegations against PROCEPT BioRobotics (NASDAQ: PRCT) following suspicions of misleading statements made by the company about its financial statements and business operations. The inquiry, stemming from concerns over the accuracy of information provided, aims to determine the extent of any fraudulent activities. This raises doubts about the integrity of the company's disclosures and financial performance, impacting shareholders and investors.",
            "link": "https://www.markets.news/headlines/13df8f45-43db-4ec6-a366-751026701fdf",
            "pub_date": "2026-02-27 05:59:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Momcozy launches Working Motherhood Toolkit for International Women's Day, offering guidance on maternity leave, pumping at work, and career decisions. Los Angeles, Feb. 26, 2026.",
            "id": "0eb834d7-fa3a-4acb-98d5-bd3a46ad9600",
            "description": "The Working Motherhood Toolkit has been launched by Momcozy, aiming to provide practical advice on maternity leave, pumping at work, and making career decisions for women. Released on February 26, 2026, in Los Angeles, this resource is structured to guide women through each trimester. It serves as a valuable tool in honoring International Women's Day. This initiative is geared towards empowering women by offering support and information.",
            "link": "https://www.markets.news/headlines/0eb834d7-fa3a-4acb-98d5-bd3a46ad9600",
            "pub_date": "2026-02-27 05:59:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "K1 Speed's mascot Jolie raises $235,236.67 for 10 SPCAs in the US - largest indoor go-kart operator.",
            "id": "797d741f-5d26-4ad3-afa5-9cb24d7a5742",
            "description": "In Irvine, California, on February 26, 2026, K1 Speed, a major indoor go-kart racing operator globally, along with their official mascot, Jolie, disclosed a generous donation. They contributed a total of $235,236.67 to support ten independent SPCA organizations situated throughout the United States. This act of charity underscores their commitment to animal welfare and their \"Legacy of Loyalty\" campaign.",
            "link": "https://www.markets.news/headlines/797d741f-5d26-4ad3-afa5-9cb24d7a5742",
            "pub_date": "2026-02-27 05:59:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Recent DeFi bill introduced in Congress to safeguard software developers in the crypto market. Implications on market structure?",
            "id": "045cc5ef-5f2b-406f-8a18-3190168c4608",
            "description": "On Thursday, legislators unveiled a bill aimed at shielding cryptocurrency software developers from facing criminal charges. The introduction of this bill raises questions about the status of the crypto market structure bill; however, its specifics have not been clarified yet. The proposed legislation comes as a relief to developers who have been facing uncertainty regarding potential legal repercussions. It remains to be seen how this new bill will impact the broader crypto industry and whether it will gain sufficient support to pass.",
            "link": "https://www.markets.news/headlines/045cc5ef-5f2b-406f-8a18-3190168c4608",
            "pub_date": "2026-02-27 06:00:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3fda2007-5a92-4a5e-8a72-f0a974ad7777",
            "description": "This train carries no passengers. There’s no ticket to buy. But it protects every high-speed rail journey in China. Meet China’s “Rail Doctor”. Discover how it works in the full episode, coming March 1.",
            "link": "https://www.markets.news/headlines/3fda2007-5a92-4a5e-8a72-f0a974ad7777",
            "pub_date": "2026-02-27 06:01:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RLJ Lodging Trust reports Q4 2025 results: RevPAR $136.79 (-1.5%), Hotel Revenue $325.1M (+0.2%), Net Income $0.5M, EBITDA $80.4M. Sold 2 hotels for $49.5M.",
            "id": "b33c4e8d-4658-44c2-83bd-781de81703bb",
            "description": "RLJ Lodging Trust (NYSE: RLJ) based in Bethesda, Md. announced its financial results for the fourth quarter and full year ending December 31, 2025. The highlights for the fourth quarter include a Comparable RevPAR of $136.79, showing a 1.5% decrease from the previous year, and Comparable Hotel Revenue of $325.1 million, marking a 0.2% increase from the prior year. The company reported a Net Income of $0.5 million and an Adjusted EBITDA of $80.4 million. Additionally, it achieved an Adjusted FFO per diluted common share and unit of $0.32. RLJ Lodging Trust also successfully sold two hotels for a total of $49.5 million during this period.",
            "link": "https://www.markets.news/headlines/b33c4e8d-4658-44c2-83bd-781de81703bb",
            "pub_date": "2026-02-27 05:53:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wesco International (NYSE: WCC) declares $0.50 per share quarterly dividend on common stock on Feb. 26, 2026.",
            "id": "17291649-f768-4e2f-9024-f08aba9292a4",
            "description": "On February 26, 2026, Wesco International's Board of Directors announced a quarterly cash dividend for its shareholders. The declared dividend on all outstanding common stock is $0.50 per share. Shareholders can expect to receive this dividend on March 31, 2026.",
            "link": "https://www.markets.news/headlines/17291649-f768-4e2f-9024-f08aba9292a4",
            "pub_date": "2026-02-27 05:46:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "XTKG to consolidate shares, board approved decision. Global tech provider across industries.",
            "id": "48d6b6bb-18d6-400a-903a-522c060acbb0",
            "description": "In Singapore on February 26, 2026, X3 Holdings Co., Ltd. (Nasdaq: XTKG) revealed plans for a consolidation of its Class A ordinary shares. As a leading global provider of digital solutions and technology services across various industries, XTKG's board of directors gave the green light for this strategic move. This decision underscores the company's commitment to refining its corporate structure.",
            "link": "https://www.markets.news/headlines/48d6b6bb-18d6-400a-903a-522c060acbb0",
            "pub_date": "2026-02-27 05:46:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}