{
    "data": [
        {
            "title": "Lifeway Foods marks 40 years with new kefir products at Expo West 2026; showcasing Muscle Mates™ and Probiotic Kefir Butter™.",
            "id": "847c617a-0138-4f21-837e-96854c66a730",
            "description": "In Morton Grove, Illinois, on February 27th, 2026, Lifeway Foods, Inc. a prominent American provider of kefir and probiotic products, plans to reveal their newest cultured dairy creations, Muscle Mates™ and Probiotic Kefir Butter™. The company, listed on Nasdaq as LWAY, is known for its innovative offerings in the industry.",
            "link": "https://www.markets.news/headlines/847c617a-0138-4f21-837e-96854c66a730",
            "pub_date": "2026-02-28 02:33:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Inventor unveils 3-in-1 recycling machine in Pittsburgh, aims to simplify recycling process for plastic, metal, and glass bottles all in one location.",
            "id": "da9e9253-4d7f-4107-9603-46cd67b632b5",
            "description": "In Pittsburgh on February 27, 2026, an inventor from Endicott, New York, discussed creating a 3 IN 1 RECYCLING MACHINE to conveniently recycle plastic, metal, and glass bottles at a single location. This design aims to streamline the process and save time, providing a solution to manage all three types of bottles efficiently. This innovation addresses the concerns of having to use three separate methods for recycling various materials.",
            "link": "https://www.markets.news/headlines/da9e9253-4d7f-4107-9603-46cd67b632b5",
            "pub_date": "2026-02-28 02:33:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3003b007-f287-43e8-9066-a9dcae54cd16",
            "description": "AG BONDI: DOJ UNSEALED INDICTMENT CHARGING 30 MORE PEOPLE WHO TOOK PART IN THE \"ATTACK ON CITIES CHURCH IN MINNESOTA\"",
            "link": "https://www.markets.news/headlines/3003b007-f287-43e8-9066-a9dcae54cd16",
            "pub_date": "2026-02-28 02:33:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "74f2e3c8-6236-4b7b-8e7f-c06851234576",
            "description": "US PRESIDENT TRUMP: TARIFFS HAVE INFLUENCED NOVARTIS, AND ITS GREAT LEADER, VASANT (VAS) NARASIMHAN, M.D., TO BUILD 7+ MANUFACTURING AND R&D FACILITIES, CREATING THOUSANDS OF JOBS - TSL",
            "link": "https://www.markets.news/headlines/74f2e3c8-6236-4b7b-8e7f-c06851234576",
            "pub_date": "2026-02-28 02:33:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Company affiliated with former US President considers launching Truth Social platform due to recent cryptocurrency investments.",
            "id": "fc0e1bb1-54ca-41bf-947d-eff57e819a5e",
            "description": "In recent data, it has been disclosed that there has been a sharp increase of 25% in the number of reported cases of cyberbullying among teenagers aged 13 to 18 in the last year. This rise in cyberbullying incidents brings the total number of reported cases to more than 15,000, marking a concerning trend. Experts have attributed this surge to the widespread use of social media platforms and online communication among the youth. Additionally, the data revealed that girls are more likely to experience cyberbullying compared to boys, with a ratio of 3:1. Authorities urge parents and educators to be vigilant and proactive in addressing cyberbullying issues to ensure the safety and well-being of teenagers in the digital age.",
            "link": "https://www.markets.news/headlines/fc0e1bb1-54ca-41bf-947d-eff57e819a5e",
            "pub_date": "2026-02-28 02:34:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Biglari Capital demands resignation of Jack in the Box chairman David Goebel, rejected by stockholders; ISS, BlackRock, Vanguard, and State Street defended.",
            "id": "05d26355-a525-456e-9b47-b9e9222f7e24",
            "description": "The company must not use the treatment of abstain votes as a shield - Chairman Goebel did not secure a majority of votes cast. Jack in the Box shareholders cannot bear another year under David Goebel. ISS, BlackRock, Vanguard, and State Street oddly supported the long-serving David.",
            "link": "https://www.markets.news/headlines/05d26355-a525-456e-9b47-b9e9222f7e24",
            "pub_date": "2026-02-28 02:35:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LTK introduces chatbot LTK AI in consumer app for personalized recommendations, powered by creator content.",
            "id": "378d1f77-fdc1-4a29-a4bc-cddb0ae1692e",
            "description": "Based in Dallas, LTK introduced LTK AI, a chatbot integrated into the LTK consumer app for tailored discovery. This innovative tool utilizes genuine creator content and reliable suggestions to assist users in deciding what to wear, style, pack, gift, or experiment with. By incorporating a conversational element, LTK AI enhances the user experience by providing authentic and personalized recommendations. This launch marks a significant development in turning influence into a global economy, showcasing LTK's commitment to leveraging technology for enhanced user engagement.",
            "link": "https://www.markets.news/headlines/378d1f77-fdc1-4a29-a4bc-cddb0ae1692e",
            "pub_date": "2026-02-28 02:35:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pembina Pipeline Corp files 2025 year-end documents with key financial reports and regulatory bodies in Canada and the US.",
            "id": "78a57e22-f7db-4392-af85-b7e3141daffc",
            "description": "Pembina Pipeline Corporation, a company listed on TSX and NYSE under ticker symbols PPL and PBA respectively, has recently submitted its audited consolidated financial statements and annual reports for the year ending on December 31, 2025 to Canadian securities regulators. Additionally, the company has filed its Form 40-F for the same period with the U.S. Securities and Exchange Commission. These filings provide detailed insights into Pembina's financial performance and management discussions for interested stakeholders.",
            "link": "https://www.markets.news/headlines/78a57e22-f7db-4392-af85-b7e3141daffc",
            "pub_date": "2026-02-28 02:35:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "84da195c-e0be-4246-8901-34214e57dd51",
            "description": "THREE FLIGHTS ON FRIDAY FROM ISTANBUL TO IRAN'S TEHRAN CANCELLED, ISTANBUL AIRPORT DATA SHOWS",
            "link": "https://www.markets.news/headlines/84da195c-e0be-4246-8901-34214e57dd51",
            "pub_date": "2026-02-28 02:27:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6b616ebd-cd6d-4407-8586-b19a4cb5b35a",
            "description": "IAEA: TEMPORARY CEASEFIRE ENABLES RESTORATION OF OFF-SITE BACK-UP POWER SUPPLY TO UKRAINE’S ZAPORIZHZHYA NUCLEAR POWER PLANT (ZNPP)",
            "link": "https://www.markets.news/headlines/6b616ebd-cd6d-4407-8586-b19a4cb5b35a",
            "pub_date": "2026-02-28 02:27:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JBM lists luxury 55+ community Soléa Wellen Park in Venice, FL, a brand new 4-story asset in Wellen Park.",
            "id": "b552c218-ca65-4e41-b21a-88ced35ee60b",
            "description": "Naples, Florida, on February 27, 2026 - JBM® Institutional Multifamily Advisors has recently put up for exclusive listing Soléa Wellen Park, a newly built, class A, 55+ active adult mid-rise property in Wellen Park, Venice. This four-story asset is part of a sought-after master-planned community in the area.",
            "link": "https://www.markets.news/headlines/b552c218-ca65-4e41-b21a-88ced35ee60b",
            "pub_date": "2026-02-28 02:29:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "USDCx stablecoin debuts on Cardano via xReserve integration with backing from Liqwid, Minswap, and SundaeSwap. Joining hands for seamless USDC liquidity exchange.",
            "id": "ccf9944c-a853-46d4-a250-6cdc573778ff",
            "description": "USDCx has been introduced on the Cardano network with the backing of Liqwid, Minswap, and SundaeSwap. This launch enables seamless cross-chain liquidity for USDC without the need for third-party bridges. The collaboration aims to enhance accessibility and efficiency in the ecosystem.",
            "link": "https://www.markets.news/headlines/ccf9944c-a853-46d4-a250-6cdc573778ff",
            "pub_date": "2026-02-28 02:29:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway to release Q4 financial results with revenue estimated at $92.91 billion. Greg Abel's first shareholder letter.",
            "id": "99ad1719-9624-4d9a-9860-6422835a59f3",
            "description": "Berkshire Hathaway Inc is set to announce fourth-quarter financial results, the first without Warren Buffett as CEO. Analysts estimate revenue of $92.91 billion, slightly down from the previous year. The company has a track record of beating revenue estimates. In the previous quarter, operating earnings were up 34% year-over-year, attributed to insurance profit gains. The market awaits to see if the insurance segment will again lead with strong profits. The financial results and shareholders' letter by new CEO Greg Abel will be released on Feb. 28. Investors anticipate Abel's plans for the company's over $300 billion in idle funds. Buffett's shareholder letter usually included insights on the market and investing.",
            "link": "https://www.markets.news/headlines/99ad1719-9624-4d9a-9860-6422835a59f3",
            "pub_date": "2026-02-28 02:24:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI raises $110B from Amazon, Nvidia, SoftBank, with Amazon investing $50B, resulting in Amazon stock growth.",
            "id": "2710dcfe-b501-4b0b-93d6-966bd89d4427",
            "description": "Following the announcement of an investment of $50 billion by Amazon into OpenAI, the stock of Amazon saw an increase. OpenAI raised a total of $110 billion from various sources, including Amazon, Nvidia, and SoftBank. This investment has led to an expansion of the partnership between OpenAI and AWS.",
            "link": "https://www.markets.news/headlines/2710dcfe-b501-4b0b-93d6-966bd89d4427",
            "pub_date": "2026-02-28 02:24:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novos Power and WearableDose win FedTech's 2026 Crucible competition at Warfighting Innovation Summit.",
            "id": "6aa61679-5c90-4c21-908a-cf88f88fe68c",
            "description": "In La Quinta, California on February 27, 2026, FedTech, a prominent company specializing in deep tech commercialization and defense innovation, has revealed the champions of its 2026 Crucible Ignitor and Accelerator pitch contests during the first-ever Warfighting Innovation Summit conducted this month.",
            "link": "https://www.markets.news/headlines/6aa61679-5c90-4c21-908a-cf88f88fe68c",
            "pub_date": "2026-02-28 02:24:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e25b182b-e273-4315-b367-66223b9cbd89",
            "description": "IAEA: FIFTH LOCAL CEASEFIRE NEGOTIATED BY IAEA BETWEEN UKRAINE AND RUSSIAN FEDERATION COMMENCED ON FRIDAY",
            "link": "https://www.markets.news/headlines/e25b182b-e273-4315-b367-66223b9cbd89",
            "pub_date": "2026-02-28 02:26:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1c9d83c0-601c-4eb7-8f82-ef83a83aa594",
            "description": "SENATORS ASK PENTAGON, ANTHROPIC TO RESOLVE DISPUTE: AXIOS",
            "link": "https://www.markets.news/headlines/1c9d83c0-601c-4eb7-8f82-ef83a83aa594",
            "pub_date": "2026-02-28 02:12:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "47421e0e-c7e2-4741-9fd1-fbc5c0517f7f",
            "description": "UK TREASURY ON COURSE FOR £40 BLN WINDFALL FROM STUDENT LOAN INTEREST – TELEGRAPH",
            "link": "https://www.markets.news/headlines/47421e0e-c7e2-4741-9fd1-fbc5c0517f7f",
            "pub_date": "2026-02-28 02:16:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d92a09eb-a31e-406b-9bbf-dfd347c8b686",
            "description": "TOP SENATE DEFENSE LEADERS INTERVENE IN PENTAGON-ANTHROPIC AI DISPUTE - AXIOS",
            "link": "https://www.markets.news/headlines/d92a09eb-a31e-406b-9bbf-dfd347c8b686",
            "pub_date": "2026-02-28 02:16:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "424cdef9-daad-466a-83df-fa7bf17649a1",
            "description": "10 counterparties take $16.318b at the Fed reverse repo operation.",
            "link": "https://www.markets.news/headlines/424cdef9-daad-466a-83df-fa7bf17649a1",
            "pub_date": "2026-02-28 02:16:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}