{
    "data": [
        {
            "title": "MacroGenics, a biopharmaceutical company (Nasdaq: MGNX) will participate in investor conferences in March.",
            "id": "d8299f57-2b17-4b19-92fe-dc5effd4e5df",
            "description": "MacroGenics, Inc., a biopharmaceutical company concentrating on creating cutting-edge antibody-based therapeutics for cancer treatment, revealed today that its management team will be involved in upcoming investor conferences in March. The company, listed as Nasdaq: MGNX, is based in Rockville, MD, and made the announcement on Feb. 26, 2026.",
            "link": "https://www.markets.news/headlines/d8299f57-2b17-4b19-92fe-dc5effd4e5df",
            "pub_date": "2026-02-27 06:31:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Algoma Steel Group Inc. will reveal its 2025 Q4 and full year financial results on March 11, 2026; webcast follows on March 12 at 11 am ET.",
            "id": "29b88c08-7936-4ec2-8f26-e3af43eb87eb",
            "description": "Algoma Steel Group Inc., a major Canadian steel producer, will unveil its financial performance for the fourth quarter and full year of 2025 on March 11, 2026, post-market closure. The company's stocks ASTL on NASDAQ and TSX will likely be impacted. The results will be reviewed in a webcast and conference call on March 12, 2026, at 11:00 a.m. Eastern Time, where recent developments will be discussed, and a Q&A session will be conducted.",
            "link": "https://www.markets.news/headlines/29b88c08-7936-4ec2-8f26-e3af43eb87eb",
            "pub_date": "2026-02-27 06:31:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Intuit Inc beats Q2 revenue estimates with $4.65 billion, adjusted earnings of $4.15 per share, leading to stock slide.",
            "id": "bb59c2ac-a2fd-4f90-8198-f009a8997340",
            "description": "Intuit Inc (NASDAQ: INTU) released its financial results for the second quarter of fiscal 2026 after the market closed on Thursday. The company reported second-quarter revenue of $4.65 billion, surpassing analyst expectations of $4.53 billion. Additionally, Intuit's adjusted earnings for the quarter were $4.15 per share, higher than the estimated $3.66 per share. This performance led to a 17% increase in total revenue. However, despite these positive results, Intuit stock is currently experiencing a decline. Visit Benzinga.com for the complete story.",
            "link": "https://www.markets.news/headlines/bb59c2ac-a2fd-4f90-8198-f009a8997340",
            "pub_date": "2026-02-27 06:32:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chondrosarcoma market projected to grow (2026-2036) due to better treatments, diagnosis, emerging therapies.",
            "id": "43e63e6c-d965-4856-91a8-ed7712efd963",
            "description": "The market for chondrosarcoma is projected to experience growth between 2026 and 2036 due to factors such as enhanced diagnostic methods, advancements in treatment options, heightened awareness, and the introduction of new therapies like Ozekibart (INBRX-109) by Inhibrx Biosciences and TIBSOVO (ivosidenib) by Servier. These developments are expected to drive the market forward, leading to increased opportunities and potential for advancements in the treatment of chondrosarcoma.",
            "link": "https://www.markets.news/headlines/43e63e6c-d965-4856-91a8-ed7712efd963",
            "pub_date": "2026-02-27 06:33:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2aa92a64-8dee-4386-8dd1-2da5287ec728",
            "description": "ANTHROPIC REJECTS PENTAGON'S \"FINAL OFFER\" IN AI SAFEGUARDS FIGHT - AXIOS",
            "link": "https://www.markets.news/headlines/2aa92a64-8dee-4386-8dd1-2da5287ec728",
            "pub_date": "2026-02-27 06:33:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "42f09e80-4119-40c7-8a24-c02109e7661b",
            "description": "NICOLAS MADURO INTENDS TO FILE MOTION TO DISMISS US CRIMINAL CASE, CITING DUE PROCESS VIOLATIONS - FILING",
            "link": "https://www.markets.news/headlines/42f09e80-4119-40c7-8a24-c02109e7661b",
            "pub_date": "2026-02-27 06:35:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "bf8da125-e1f2-46f0-9db7-3f7afad0073b",
            "description": "ANTHROPIC CEO DARIO AMODEI ON THURSDAY SAID THERE HAS BEEN \"VIRTUALLY NO PROGRESS\" ON NEGOTIATIONS WITH THE PENTAGON - AXIOS",
            "link": "https://www.markets.news/headlines/bf8da125-e1f2-46f0-9db7-3f7afad0073b",
            "pub_date": "2026-02-27 06:35:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "73b25ff6-3d1e-46c8-9401-87c72d93ec13",
            "description": "U.S. HOUSE OVERSIGHT PANEL CHAIRMAN COMER: HILLARY CLINTON ANSWERED OUR QUESTIONS; WILL TRY TO GET VIDEO AND TRANSCRIPT OUT QUICKLY",
            "link": "https://www.markets.news/headlines/73b25ff6-3d1e-46c8-9401-87c72d93ec13",
            "pub_date": "2026-02-27 06:35:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Plumbing expert Erin Goettsche shares signs of home repiping in Grand Island, NE. Age of pipes and water issues discussed.",
            "id": "e3c01c02-2392-49f9-ada3-c7a4ae8707f2",
            "description": "In a recent article from HelloNation featuring insights from Erin Goettsche of Herman Plumbing Co. Inc., common indicators that a Grand Island, NE home may require repiping were discussed. Factors such as aging pipes and low water pressure were highlighted as key signals. This information was shared on Feb. 26, 2026 in Grand Island, Nebraska.",
            "link": "https://www.markets.news/headlines/e3c01c02-2392-49f9-ada3-c7a4ae8707f2",
            "pub_date": "2026-02-27 06:35:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aris Mining to release Q4 and FY 2025 earnings on March 11, 2026; conference call on March 12, 2026 at multiple times.",
            "id": "ea13bed1-c240-4051-ace0-936b2650baeb",
            "description": "Aris Mining Corporation, listed on both TSX (ARIS) and NYSE (ARIS), will be releasing its Q4 and full year financial report for 2025 on March 11, 2026, after markets close. The following day, March 12, 2026, at 6:00 am PT / 9:00 am ET / 2:00 pm GMT, a conference call will be held to discuss these results. For swift access to the call, attendees can register at Diamond Pass Registration.",
            "link": "https://www.markets.news/headlines/ea13bed1-c240-4051-ace0-936b2650baeb",
            "pub_date": "2026-02-27 06:35:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2d60aea4-c7f2-4609-8c71-661dc39be046",
            "description": "IMF ON UKRAINE: EXECUTIVE BOARD’ DECISION ALLOWS IMMEDIATE DISBURSEMENT OF ABOUT US$ 1.5 BILLION",
            "link": "https://www.markets.news/headlines/2d60aea4-c7f2-4609-8c71-661dc39be046",
            "pub_date": "2026-02-27 06:27:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Commerce Department finds significant dumping margins by hardwood and decorative plywood producers from China, Indonesia, and Vietnam. ",
            "id": "847034f3-a3ee-49cb-abd1-a187f267382c",
            "description": "In Washington on February 26, 2026, the U.S. Department of Commerce issued initial affirmative antidumping duty results regarding hardwood and decorative plywood. This action followed the February 25, 2026 release and revealed substantial dumping margins associated with producers of these materials. The findings highlighted the presence of noteworthy dumping margins resulting from the practices of hardwood and decorative plywood manufacturers.",
            "link": "https://www.markets.news/headlines/847034f3-a3ee-49cb-abd1-a187f267382c",
            "pub_date": "2026-02-27 06:27:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block Stock surges after Jack Dorsey's Bitcoin firm announces layoff of 4,000 employees in a $500 million overhaul by mid-2026.",
            "id": "0255ae87-408c-43aa-b813-6f850fbf5ef6",
            "description": "The CEO announced that the reorganization will come with a price tag of around $500 million and is expected to be mostly finished by mid-2026. Shareholders have shown support for this decision.",
            "link": "https://www.markets.news/headlines/0255ae87-408c-43aa-b813-6f850fbf5ef6",
            "pub_date": "2026-02-27 06:30:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Alcoa Corporation (NYSE: AA; ASX: AAI) declares $0.10 per share quarterly cash dividend; payable on March 26, 2026.",
            "id": "b7e86cb1-c9ea-4d94-856d-6ff796e8b89b",
            "description": "Alcoa Corporation, a leading global company specializing in bauxite, alumina, and aluminum products, declared a quarterly cash dividend of $0.10 per common stock share (NYSE: AA; ASX: AAI). This dividend is scheduled to be paid on March 26, 2026, to stockholders of record as of March 10, 2026. Alcoa aims to establish a lasting legacy of excellence for upcoming generations through its values-driven operations.",
            "link": "https://www.markets.news/headlines/b7e86cb1-c9ea-4d94-856d-6ff796e8b89b",
            "pub_date": "2026-02-27 06:30:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave stock drops post-Q4 earnings with wider loss; revenue beats estimates, order backlog up 20%.",
            "id": "0a9bc6be-119f-4cf1-a3f3-4fe2c4d60300",
            "description": "After CoreWeave, a cloud computing services provider, reported a loss larger than anticipated, its stock experienced a decline. However, the revenue exceeded expectations by a slight margin. The company's order backlog has increased by 20% in the fourth quarter. This news resulted in a decrease in CoreWeave's stock value.",
            "link": "https://www.markets.news/headlines/0a9bc6be-119f-4cf1-a3f3-4fe2c4d60300",
            "pub_date": "2026-02-27 06:17:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rocket Lab reports successful Q4 earnings, launches, acquisitions. Space stocks rise. Space Force investigates Vulcan issue.",
            "id": "79d7be24-b70d-483f-8849-c0ac47347fd7",
            "description": "Rocket Lab topped the charts for space stocks following their report on Thursday. AST SpaceMobile, a rival of SpaceX, will report on Monday. The Space Force is conducting an investigation into an anomaly with Vulcan. Rocket Lab announced impressive results, including new launch contracts, advancements in solar arrays, and an acquisition in Q4. This news was originally featured in Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/79d7be24-b70d-483f-8849-c0ac47347fd7",
            "pub_date": "2026-02-27 06:17:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies beats Q4 estimates, stock jumps. Positive outlook boosts investor confidence.",
            "id": "0528881d-0b3c-4bb9-9dc9-e82ea4b3a52d",
            "description": "Dell Technologies, a leading computer manufacturer, significantly surpassed expectations for its fiscal fourth quarter and provided a positive forecast. Following this news, Dell's stock saw a substantial increase in value.",
            "link": "https://www.markets.news/headlines/0528881d-0b3c-4bb9-9dc9-e82ea4b3a52d",
            "pub_date": "2026-02-27 06:17:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin ETFs had highest daily inflows in 3 weeks. MARA's surge on AI partnership. Trump-linked miner MARA reports results.",
            "id": "34f02994-8f3c-46ae-a91a-38dbc76d2b5c",
            "description": "Bitcoin exchange-traded funds (ETFs) experience a significant increase in daily inflows, reaching their highest levels in the past three weeks. Several companies, including American Bitcoin, MARA, TeraWulf, and Figure, have released their financial results. Among these, MARA experiences a surge in value due to its partnership in artificial intelligence (AI). Additionally, a mining company associated with former President Trump announces its results.",
            "link": "https://www.markets.news/headlines/34f02994-8f3c-46ae-a91a-38dbc76d2b5c",
            "pub_date": "2026-02-27 06:17:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "66907c0e-8e2c-4db9-aa9d-a36bac808bfe",
            "description": "PARAMOUNT COMMENTS ON WARNER BROS DISCOVERY BOARD’S DETERMINATION THAT ITS PROPOSAL IS SUPERIOR",
            "link": "https://www.markets.news/headlines/66907c0e-8e2c-4db9-aa9d-a36bac808bfe",
            "pub_date": "2026-02-27 06:18:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a1a85965-bade-41c2-8afb-772ef1ef0fa8",
            "description": "OPENAI SHARES LETTER OUTLINING MEASURES IT SAYS THE COMPANY IS TAKING IN RESPONSE TO CANADA SHOOTING INCIDENT",
            "link": "https://www.markets.news/headlines/a1a85965-bade-41c2-8afb-772ef1ef0fa8",
            "pub_date": "2026-02-27 06:22:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}