{
    "data": [
        {
            "title": "Sunstone Hotel Investors reports profits in Q4 & 2025, returned $170M to shareholders, revPAR up by 9.6%, net income reduced.",
            "id": "0a507887-e110-41fa-82d1-d4a6e82fc7dc",
            "description": "Sunstone Hotel Investors, Inc. announced its financial results for the fourth quarter and full year ended December 31, 2025. In the fourth quarter, net income was $7.2 million compared to $0.8 million in the previous year, with Total Portfolio RevPAR increasing by 9.6% to $220.12. Adjusted EBITDA re increased by 17.6% to $56.6 million, and Adjusted FFO per diluted share increased by 25.0% to $0.20. For the full year 2025, net income was $24.6 million excluding a loss on the sale of a property, with Total Portfolio RevPAR up 3.8% to $225.12. Adjusted EBITDA re increased by 3.0% to $236.6 million, and Adjusted FFO per diluted share rose by 7.5% to $0.86. The company returned over $170 million to common stockholders through dividends and share repurchases. Sunstone also repurchased $103.6 million of its common and preferred stock in 2025 and repurchased an additional $7.5 million in early 2026. The company reauthorized a $500 million repurchase program in February 2026. Sunstone had $185.7 million in cash and cash equivalents at the end of 2025, with total assets of $3.0 billion, total debt of $930.0 million, and stockholders' equity of $1.9 billion. The company invested $103.0 million into its portfolio in 2025 and expects to invest approximately $95-$115 million in 2026. Sunstone forecasted a net income of $21-$46 million and a RevPAR growth of 4.0%-7.0% for the full year 2026. The company declared a cash dividend of $0.09 per common share and authorized dividends for its preferred stockholders. Sunstone's goal is to create long-term value through the acquisition, ownership, and disposition of hotel real estate.",
            "link": "https://www.markets.news/headlines/0a507887-e110-41fa-82d1-d4a6e82fc7dc",
            "pub_date": "2026-02-27 20:32:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Alpha Metallurgical Resources reported a net loss of $17.3 million for Q4 2025 with Adjusted EBITDA at $28.5 million. Visit alphametresources.com for more info.",
            "id": "7f534c76-7819-499d-95aa-89ae942a68ce",
            "description": "Alpha Metallurgical Resources, a supplier of metallurgical products for the steel industry, reported a net loss of $17.3 million for the fourth quarter of 2025. Adjusted EBITDA for the quarter was $28.5 million. They posted operating cash flow of $19.0 million and $29.0 million in capital expenditures. Tons of coal sold were 3.8 million. The company had total liquidity of $524.3 million as of December 31, 2025. Their share repurchase program authorized a spend of up to $1.5 billion, with approximately 6.9 million shares repurchased at a cost of $1.1 billion. The company had committed and priced around 37% of its metallurgical coal for 2026 at an average price of $134.02 per ton. Alpha's board of directors scheduled the annual meeting of stockholders for May 6, 2026. The company plans to hold a conference call regarding its financial results on February 27, 2026. Non-GAAP financial measures were utilized, including Adjusted EBITDA, non-GAAP coal revenues, non-GAAP cost of coal sales, and non-GAAP coal margin, to present financial results.",
            "link": "https://www.markets.news/headlines/7f534c76-7819-499d-95aa-89ae942a68ce",
            "pub_date": "2026-02-27 20:32:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia's earnings beat expectations with a revenue of $68.13 billion, driven by data center segment. Stock drops 5% as investors question sustainability of growth amidst fears of a tech sector bubble.",
            "id": "429f076f-5bf9-4b78-8d6a-17e05d2fbeaf",
            "description": "Nvidia's latest earnings report showed robust growth, surpassing expectations with a revenue of $68.13 billion in the fourth quarter, driven primarily by its data center segment. This division, responsible for 90% of the company's revenue, has witnessed notable expansion due to heightened demand for AI chips, software, and networking hardware. Despite the positive earnings, Nvidia's stock dropped over 5% on the day of the report as investors remain wary about the sustainability of this growth, potentially due to concerns of a technology sector bubble. Analysts are evaluating if the company's AI investments can maintain this momentum in the future.",
            "link": "https://www.markets.news/headlines/429f076f-5bf9-4b78-8d6a-17e05d2fbeaf",
            "pub_date": "2026-02-27 20:32:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pantera & Franklin Templeton partner with Sentient Arena to trial AI agents on tasks in the enterprise on new platform.",
            "id": "112ce963-e47f-4b17-90ec-bd915193aa7c",
            "description": "The technology company Sentient has recently released Arena, a platform designed for testing AI agents on enterprise tasks. The platform has attracted significant interest, with investment firms Pantera and Franklin Templeton being among the initial cohort of participants. This initiative has garnered attention due to its innovative approach in utilizing AI technology for practical business applications.",
            "link": "https://www.markets.news/headlines/112ce963-e47f-4b17-90ec-bd915193aa7c",
            "pub_date": "2026-02-27 20:32:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Childhelp co-founder Sara O'Meara to receive Lifetime Achievement Award from Place of Hope at their 25th anniversary celebration.",
            "id": "7b51670e-9176-4019-9880-dbd854888918",
            "description": "A notable event will take place in Palm Beach, Florida on February 27, 2026. Sara O'Meara, one of the founders of Childhelp, is set to receive a prestigious Lifetime Achievement Award from Place of Hope. This award will be presented during \"A Moment in Time,\" a special event commemorating Place of Hope's 25 years of dedicated service in safeguarding vulnerable individuals. This celebration highlights the remarkable contributions of Sara O'Meara and recognizes the significant milestone reached by Place of Hope after a quarter-century of impactful work.",
            "link": "https://www.markets.news/headlines/7b51670e-9176-4019-9880-dbd854888918",
            "pub_date": "2026-02-27 20:33:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DeFi Technologies appoints Philippe Lucet as General Counsel and Corporate Secretary on Feb 27, 2026. Nasdaq: DEFT.",
            "id": "0629d11a-586a-439f-b8d8-fe30db32765d",
            "description": "On February 27, 2026, DeFi Technologies Inc. (Nasdaq: DEFT, CBOE CA: DEFI, GR: R9B) disclosed its latest advancements as a financial technology company merging traditional capital markets with decentralized finance. The company aimed to bridge the gap between the two sectors to enhance financial services.",
            "link": "https://www.markets.news/headlines/0629d11a-586a-439f-b8d8-fe30db32765d",
            "pub_date": "2026-02-27 20:33:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bakkt prices registered direct offering at $48.125 million for 3,024,799 shares at $8.75/share, expected to close by March 2.",
            "id": "3a51cacf-e5c2-49c6-9d0c-bc53cfdaedb9",
            "description": "Bakkt, Inc. (NYSE: BKKT) has disclosed the pricing details of a registered direct offering. The offering consists of 3,024,799 shares of Class A common stock and pre-funded warrants for the purchase of up to 2,475,201 shares of Class A common stock. Each share is priced at $8.75, while each pre-funded warrant is priced at $8.7499. The offering, targeted at a single institutional investor, is anticipated to finalize around March 2, 2026. The gross proceeds of the offering are projected to reach $48.125 million, prior to deductions for placement agent fees and other estimated offering expenses. Bakkt plans to utilize the net proceeds for various purposes including working capital, general corporate uses, and strategic endeavors.",
            "link": "https://www.markets.news/headlines/3a51cacf-e5c2-49c6-9d0c-bc53cfdaedb9",
            "pub_date": "2026-02-27 20:34:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TuHURA Biosciences (NASDAQ: HURA) regains compliance with Nasdaq minimum bid price requirement on Feb. 26, 2026.",
            "id": "b9a4dde5-6a85-4164-8d62-5b04f3c404d2",
            "description": "Yesterday, TuHURA Biosciences, Inc. (NASDAQ: HURA), a biopharmaceutical company based in Tampa, Florida, revealed that they have received written communication on February 26, 2026. The company is currently in Phase 3 of developing innovative treatments to combat resistance to cancer immunotherapy. The communication did not disclose specific details but is considered significant for the future of the company and its endeavors in the field of immuno-oncology.",
            "link": "https://www.markets.news/headlines/b9a4dde5-6a85-4164-8d62-5b04f3c404d2",
            "pub_date": "2026-02-27 20:34:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Treace Medical Concepts reported $62.5M revenue in Q4 2025, $212.7M for 2025. Increased revenue by 2% YOY. Adjusted EBITDA $6.2M in Q4, $(3.9)M for 2025. Cash usage reduced by 46% to $27.3M in 2025. 3,337 active surgeons, 6% increase YOY. Broadened patent portfolio with 135 granted patents. Initiating full-year 2026 revenue guidance of $200M to $212M, Adjusted EBITDA loss expected $4M to $6M. Cash usage reduction by 50% anticipated. Webcast to discuss financial results hosted on Feb. 27, 2026, at 8:00 a.m. ET. Management emphasizes non-GAAP financial measures.",
            "id": "d1fa309a-efc1-45a5-9d74-03ebc3eee71e",
            "description": "Treace Medical Concepts, Inc. reported financial results for Q4 and full-year 2025, with revenue of $62.5 million in Q4 and $212.7 million for the full-year, a 2% increase from the prior year. Net loss for Q4 was $(9.4) million, adjusted EBITDA was $6.2 million. Full-year net loss was $(59.0) million, adjusted EBITDA loss reduced by 64% to $(3.9) million. Cash usage decreased by 46% to $27.3 million in 2025. They ended the year with 3,337 active surgeons, representing a 6% increase from the prior year. Treace projects revenue of $200 million to $212 million for 2026, a decrease of 6% to 0% from 2025. Adjusted EBITDA loss for 2026 is anticipated to be $4.0 million to $6.0 million. Cash usage reduction of approximately 50% is expected for 2026. Treace offers surgical solutions for bunions and related deformities, with innovative products driving growth and market share gains. The full story can be accessed on a financial website.",
            "link": "https://www.markets.news/headlines/d1fa309a-efc1-45a5-9d74-03ebc3eee71e",
            "pub_date": "2026-02-27 20:34:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India emerges as a top economy, growing swiftly despite slow industrialization to match Japan's economy.",
            "id": "f3ba1f38-9d2d-4dee-b1da-842c22683427",
            "description": "India has shown significant growth despite its gradual industrialization process. The country's economy has now reached a size almost equal to that of Japan.",
            "link": "https://www.markets.news/headlines/f3ba1f38-9d2d-4dee-b1da-842c22683427",
            "pub_date": "2026-02-27 20:34:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin price at $66,000, ETF inflows strong. Sentiment at 16, liquidations at $258.85M in 24 hours. Bitcoin ETFs see $254.5M inflows, Ethereum ETFs $6.57M. Cryptos dip, meme coin sector drops 3% to $34.3B in 24 hours. Trader notes Bitcoin regaining 50 EMA support. [Source: Benzinga.com]",
            "id": "f726e995-f65c-471b-9a3a-6e88454c6e7f",
            "description": "Bitcoin's price dropped towards $66,000 despite significant inflows from ETFs. Market sentiment remains in extreme fear at a level of 16, with liquidations totaling $258.85 million in the last 24 hours. Bitcoin ETFs experienced net inflows of $254.5 million, while Ethereum ETFs saw $6.57 million in net inflows. The current cryptocurrency prices are Bitcoin at $66,601.07, Ethereum at $1,976.58, Solana at $84.60, XRP at $1.39, Dogecoin at $0.09608, and Shiba Inu at $0.055912. The meme coin sector as a whole decreased by 3% to $34.3 billion over the past day. Trader Jelle noted that Bitcoin is using its 4-hour 50 EMA as a support level. For more details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/f726e995-f65c-471b-9a3a-6e88454c6e7f",
            "pub_date": "2026-02-27 20:29:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f87f96f9-2025-4d16-ab17-1cd497151998",
            "description": "U.S. ENVOY BARRACK MEETS FORMER IRAQI PRIME MINISTER AND SHI’ITE ALLIANCE PM CANDIDATE NOURI AL-MALIKI - REPORTS",
            "link": "https://www.markets.news/headlines/f87f96f9-2025-4d16-ab17-1cd497151998",
            "pub_date": "2026-02-27 20:30:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Credicorp Ltd. reveals board nominees for 2026 AGM in Peru to be held virtually on March 31, 2026 at 3:00 pm (Peru time).",
            "id": "fd22836a-3773-425e-bea3-85af0422a5ba",
            "description": "On February 27, 2026, Credicorp Ltd. in Lima, Peru, revealed that its Board of Directors has greenlighted the selection of candidates for the upcoming 2026 Annual General Meeting of Shareholders. The AGM is scheduled for March 31, 2026 at 3:00 p.m. (Peru time) and will be conducted entirely online.",
            "link": "https://www.markets.news/headlines/fd22836a-3773-425e-bea3-85af0422a5ba",
            "pub_date": "2026-02-27 20:30:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Caliber sells Holiday Inn Ocotillo for $13M, paving the way for expansion in 2026-2027. Successful capital recycling.",
            "id": "6bf18abd-1678-414c-a4b8-1162ab559376",
            "description": "A recent disposition of assets has led to a successful capital recycling for a hospitality platform, signaling the beginning of its next growth phase. The move has allowed the platform to reallocate resources effectively, positioning it for further expansion. This strategic decision comes after achieving significant milestones, with the platform now poised to capitalize on new opportunities. This marks a key transition for the company, as it gears up for enhanced growth and development.",
            "link": "https://www.markets.news/headlines/6bf18abd-1678-414c-a4b8-1162ab559376",
            "pub_date": "2026-02-27 20:30:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Boralex reports $33M in net earnings for fiscal 2025 following large-scale projects in Canada and UK.",
            "id": "771e6040-fbb2-46a8-9cb4-8b45265fcdc7",
            "description": "Boralex Inc. has announced its financial results for the fourth quarter and full fiscal year of 2025. The corporation, listed as TSX: BLX, shared this information from Montreal on February 27, 2026.",
            "link": "https://www.markets.news/headlines/771e6040-fbb2-46a8-9cb4-8b45265fcdc7",
            "pub_date": "2026-02-27 20:30:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zoomlion starts 2026 strong with $1.2 billion in global equipment shipments; 15,000 units to 40+ markets.",
            "id": "81d85d94-20c6-410c-bd9e-15142a55bce2",
            "description": "Zoomlion Heavy Industry Science & Technology Co., Ltd., a company listed as 1157.HK, has announced a successful start to 2026 by delivering over 15,000 units to customers across 40 international markets. This news was reported from Changsha, China on February 27, 2026. The company is optimistic about their performance and emphasizes the significant reach of their large-scale equipment to various parts of the world.",
            "link": "https://www.markets.news/headlines/81d85d94-20c6-410c-bd9e-15142a55bce2",
            "pub_date": "2026-02-27 20:17:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Healthcare Triangle's QuantumNexis Inc. launches Dubai operations to advance digital health in GCC countries. Strengthening mission to accelerate TeleHealth and Digital Therapeutics. #HCTI #Dubai #DigitalHealth #GCC",
            "id": "174ecae9-e7d6-44ac-a557-428728fa4801",
            "description": "Healthcare Triangle's recent Dubai Operation aims to advance TeleHealth, Digital Therapeutics, and population-scale care in the GCC region, reinforcing their mission. The operation, based in Dubai, signifies a strategic move by Healthcare Triangle, Inc. (Nasdaq: HCTI) to accelerate healthcare services. This development, announced on February 27, 2026, will play a vital role in expanding telehealth and digital therapeutics in the region and enhancing care delivery at a broader scale. The move aligns with Healthcare Triangle's commitment to innovation and growth in the healthcare sector.",
            "link": "https://www.markets.news/headlines/174ecae9-e7d6-44ac-a557-428728fa4801",
            "pub_date": "2026-02-27 20:19:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ef3b1a34-3231-429d-ba93-21e69d756bc6",
            "description": "Zelenskyy: 'We discussed with Pavlo Klimkin the foreign policy situation around Ukraine and some decisions that are needed to strengthen Ukrainian positions in Europe and in other parts of the world. I am grateful to Pavlo for his work for Ukraine and proposed several areas of",
            "link": "https://www.markets.news/headlines/ef3b1a34-3231-429d-ba93-21e69d756bc6",
            "pub_date": "2026-02-27 20:21:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Treace Medical Concepts Q4 earnings show missed estimated EPS by 7.14%, revenue down $6.19 million from last year.",
            "id": "9bd985e1-4c4e-4929-af47-b3fe3c691337",
            "description": "Treace Medical Concepts (NASDAQ: TMCI) published its Q4 financial results on Friday, February 27, 2026, at 07:05 AM. The key points from the earnings report indicate that the company fell short of anticipated earnings by -7.14%, revealing an EPS of $-0.15 compared to the estimated $-0.14. There was a decline in revenue by $6.19 million from the corresponding period in the previous year. Moreover, in the last quarter, Treace had exceeded... Further details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/9bd985e1-4c4e-4929-af47-b3fe3c691337",
            "pub_date": "2026-02-27 20:12:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0a3d5606-a450-4404-9663-e52e96af86a3",
            "description": "MODERNA: CHMP RECOMMENDS FLU PLUS COVID COMBINATION VACCINE",
            "link": "https://www.markets.news/headlines/0a3d5606-a450-4404-9663-e52e96af86a3",
            "pub_date": "2026-02-27 20:12:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}