{
    "data": [
        {
            "title": "US-China battle over rare earth magnets crucial for military equipment production. Geopolitical power shift.",
            "id": "7c4f1a55-44ef-4314-a097-886cb4696ea9",
            "description": "Market analysts at OilPrice.com reported on Feb. 27, 2026, that geopolitical competition is intensifying over rare earth magnets, a crucial resource for building military equipment. The availability of these magnets will impact the United States' ability to mass-produce weapons. This development underscores the growing importance of rare earth magnets in global power struggles.",
            "link": "https://www.markets.news/headlines/7c4f1a55-44ef-4314-a097-886cb4696ea9",
            "pub_date": "2026-02-27 22:52:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Quanta Services (NYSE: PWR) to attend Jefferies & Daiwa investment conferences in March 2026.",
            "id": "bf5180d1-177f-42bf-bec6-fcd8a95de8bb",
            "description": "Quanta Services, Inc. disclosed their participation in two upcoming investor conferences in March - the Jefferies Power, Energy, Clean Energy, and Utilities Conference 2026 and the Daiwa Investment Conference Tokyo 2026. The events will take place in Houston and feature insights from company management. Quanta Services, Inc. (NYSE: PWR) made this announcement on February 27, 2026.",
            "link": "https://www.markets.news/headlines/bf5180d1-177f-42bf-bec6-fcd8a95de8bb",
            "pub_date": "2026-02-27 22:52:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Summit Explore Corporation launches $8 million seed financing round to develop Western Lithium Brine Projects.",
            "id": "50767ed4-8d80-4eff-95db-15152a7592b6",
            "description": "Today, in Calgary, Alberta, Summit Explore Corporation unveiled its plans for a US$8 million seed financing round. The company, supported by Summit Nanotech, aims to expedite the acquisition and development of lithium brine resources.",
            "link": "https://www.markets.news/headlines/50767ed4-8d80-4eff-95db-15152a7592b6",
            "pub_date": "2026-02-27 22:54:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Advanced Serial Plasma Exchange launches in Beverly Hills, offering personalized toxin reduction and biomarker-driven care.",
            "id": "eb1d020f-4b2a-4a0f-bcdf-11706351fd0e",
            "description": "Cenegenics Beverly Hills has introduced new Advanced Therapeutic Plasma Exchange (TPE) protocols led by physicians. These protocols aim to provide personalized toxin reduction and care based on biomarkers in Southern California. The initiative was launched on February 27, 2026. This development is set to increase access to advanced healthcare services in the region.",
            "link": "https://www.markets.news/headlines/eb1d020f-4b2a-4a0f-bcdf-11706351fd0e",
            "pub_date": "2026-02-27 22:48:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ripple CEO bullish for 2026, aims for $5B in XRP staked on Flare. Progress comes from many small steps, not one event.",
            "id": "7080d05d-fea3-4fe9-9f53-63b57bff2d8d",
            "description": "Brad Garlinghouse, CEO of Ripple, expressed confidence in the outlook for 2026, while Flare CEO Hugo Philion has set a target of $5 billion in XRP staked on Flare by mid-2026 through direct integration with the XRP Ledger. During a conference in Sydney, Garlinghouse addressed the XRP community's \"flip the switch\" narrative by emphasizing that progress is not triggered by a single event but rather by numerous smaller developments. He compared the process to having hundreds or even thousands of switches that need to be activated gradually, each contributing to exponential growth. Garlinghouse highlighted the significance of these incremental steps, noting the substantial progress made so far. This positive sentiment was echoed by Philion, reflecting optimism for the future of XRP.",
            "link": "https://www.markets.news/headlines/7080d05d-fea3-4fe9-9f53-63b57bff2d8d",
            "pub_date": "2026-02-27 22:48:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ANI Pharmaceuticals reports Q4 adjusted earnings of $2.33/share, total revenue $247.1M up 29.6%, Rare Disease sales spike 50.8%.",
            "id": "cf836064-eb63-439e-bf61-1df30af39c62",
            "description": "ANI Pharmaceuticals Inc. (NASDAQ: ANIP) saw a dip in shares at the start of Friday trading following the impressive fourth-quarter financial results. The company reported adjusted earnings of $2.33 per share, a rise from $1.63 in the previous year, surpassing the anticipated $2.00. Total net revenues for the quarter hit $247.1 million, showing a substantial 29.6% surge from the same period in the prior year, beating the estimated $231.53 million. The Rare Disease segment, featuring products like Cortrophin Gel, experienced a notable 50.8% growth, contributing $131.3 million to the overall revenue. Furthermore, ANI disclosed a net income of $27.5 million for the quarter, equating to $1.18 per diluted share, marking a significant shift from a net loss of $10.7 million reported in the corresponding period last year. Adjusted EBITDA for the fourth quarter of 2025 stood at $65.4 million, up by 30.6% from the same period in 2024. The company anticipates exceeding $1 billion in sales for 2026.",
            "link": "https://www.markets.news/headlines/cf836064-eb63-439e-bf61-1df30af39c62",
            "pub_date": "2026-02-27 22:49:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rackspace Technology stock is down due to below-consensus fiscal 2026 guidance. Adjusted EPS: -1 cent (vs. -3 cent estimate). Sales: $683M (beat $672.373M estimate). Predicted fiscal 2026 EPS: -20 to -15 cents (vs. 1 cent estimate). Predicted revenue: $2.6 to $2.7B (vs. $2.719B estimate).",
            "id": "390a4590-a91c-4e39-bff0-05546573c44d",
            "description": "Shares of Rackspace Technology, Inc. (NASDAQ: RXT) are down in premarket trading after the company reported below-consensus guidance for fiscal 2026 and fourth-quarter results. The company reported an adjusted EPS loss of one cent per share, beating analyst estimates of a three-cent loss. Sales were $683 million, exceeding analyst expectations of $672.373 million. Revenue saw a 0.4% decline on a reported basis and 1% decline on a constant currency basis, with the Private Cloud segment experiencing a 10% decrease. Rackspace forecasts a fiscal 2026 adjusted EPS loss of 20 to 15 cents, compared to analyst estimates of a one-cent profit, and revenue of $2.6 billion to $2.7 billion, below the Street's view of $2.719 billion. Despite the decline, Rackspace's stock remains relatively strong, trading 144% above the 20-day simple moving average. Over the past year, the stock has declined by 5.39%. ",
            "link": "https://www.markets.news/headlines/390a4590-a91c-4e39-bff0-05546573c44d",
            "pub_date": "2026-02-27 22:49:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI's valuation reaches $730B after receiving $110B investment from Amazon and Nvidia, with new collaborations.",
            "id": "a65b0a1f-ba6e-4280-a990-ddcc91bf9f0b",
            "description": "OpenAI recently received a significant influx of $110 billion in new investment and revealed expanded partnerships with two key supporters.",
            "link": "https://www.markets.news/headlines/a65b0a1f-ba6e-4280-a990-ddcc91bf9f0b",
            "pub_date": "2026-02-27 22:49:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e15d88c5-d943-4ae4-ac9a-bca1bc1c16ff",
            "description": "Nigeria's Q4 oil production at 1.58 mln bpd - Stats Office.",
            "link": "https://www.markets.news/headlines/e15d88c5-d943-4ae4-ac9a-bca1bc1c16ff",
            "pub_date": "2026-02-27 22:50:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "11996866-aad9-43ba-8245-9845f8e8484e",
            "description": "UBS DOWNGRADES THE US STOCK MARKET. HERE’S WHAT HAS THE INVESTMENT BANK WORRIED – CNBC",
            "link": "https://www.markets.news/headlines/11996866-aad9-43ba-8245-9845f8e8484e",
            "pub_date": "2026-02-27 22:50:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "13980ea5-4aef-4005-9ea2-aad75e3de337",
            "description": "S&P 500 BANKS INDEX FALLS 3.6%",
            "link": "https://www.markets.news/headlines/13980ea5-4aef-4005-9ea2-aad75e3de337",
            "pub_date": "2026-02-27 22:50:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c73a5e16-0d6d-425b-8aac-ef15698f2986",
            "description": "MFS creditors allege £930 million shortfall from double pledges.",
            "link": "https://www.markets.news/headlines/c73a5e16-0d6d-425b-8aac-ef15698f2986",
            "pub_date": "2026-02-27 22:50:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rapidus secures 267.6 billion yen from Japan gov and private sector for mass production of 2nm logic semiconductors by 2027.",
            "id": "5fa8d24d-e678-4cda-88f8-a84ce1bdbe3d",
            "description": "Rapidus Corporation has unveiled a strategic funding initiative that sets the stage for their transition from the current research and development phase to the mass production of 2nm logic semiconductors by 2027. As of February 27, 2026, the company confirmed the successful conclusion of a funding round amounting to a significant 267.6 billion yen.",
            "link": "https://www.markets.news/headlines/5fa8d24d-e678-4cda-88f8-a84ce1bdbe3d",
            "pub_date": "2026-02-27 22:50:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Correction sent regarding Iceland Seafood International hf's financial statements submission on 26.02.2026.",
            "id": "83263592-c47e-4d0f-89b4-784505134d34",
            "description": "On February 26, 2026, a company announced that it had submitted its financial statements. The announcement was made after the company finalized its financial reports for the fiscal year. The financial statements include important figures such as revenue, expenses, profits, and other relevant financial data. The submission of these statements is a standard practice for companies to provide transparency and accountability to stakeholders, investors, and regulatory bodies. This process ensures that the company's financial performance is accurately documented and reported. The detailed financial information within the statements allows for analysis of the company's financial health and performance over the specified period.",
            "link": "https://www.markets.news/headlines/83263592-c47e-4d0f-89b4-784505134d34",
            "pub_date": "2026-02-27 22:37:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "af8a1def-b326-467b-b923-c724d4c82c6f",
            "description": "UNITED STATES SEEKS FORFEITURE OF OIL TANKER AND 1.8M BARRELS OF CRUDE OIL -THAT SUPPORTED IRAN AND VENEZUELA -JUSTICE DEPARTMENT",
            "link": "https://www.markets.news/headlines/af8a1def-b326-467b-b923-c724d4c82c6f",
            "pub_date": "2026-02-27 22:38:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "da180cf4-8ff1-4e81-96d1-3544c4fa9ea4",
            "description": "IMF'S DEPUTY UKRAINE MISSION CHIEF: MONITORING SITUATION REGARDING UKRAINE'S BONDHOLDERS CLOSELY",
            "link": "https://www.markets.news/headlines/da180cf4-8ff1-4e81-96d1-3544c4fa9ea4",
            "pub_date": "2026-02-27 22:38:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hunt Military Communities invest $3.65M in upgrades at Robins AFB, emphasizing housing quality and readiness.",
            "id": "72ed29f6-6bec-4c8e-b89c-9d0947027588",
            "description": "Warner Robins, Georgia - Hunt Military Communities (HMC) has revealed a $3.65 million capital improvement initiative at Robins Air Force Base. The project emphasizes HMC's dedication to enhancing housing quality and long-term readiness through strategic reinvestment. This investment will concentrate on essential infrastructure enhancements in the Turner Park and Crestview neighborhoods. It highlights the commitment of both the Air Force and HMC to proactive capital planning and responsiveness.",
            "link": "https://www.markets.news/headlines/72ed29f6-6bec-4c8e-b89c-9d0947027588",
            "pub_date": "2026-02-27 22:39:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6d40619f-6a51-439d-897e-7fee2836b4e8",
            "description": "Maersk has seen unforeseen constraints in the Red Sea.",
            "link": "https://www.markets.news/headlines/6d40619f-6a51-439d-897e-7fee2836b4e8",
            "pub_date": "2026-02-27 22:39:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "National Police Association supports ICE Protection Act amidst rising incidents of protestors using vehicles as weapons against officers.",
            "id": "5e4fcb8d-4890-4be6-ace7-9877939017c6",
            "description": "In Indianapolis as of February 27, 2026, the Department of Homeland Security has revealed that demonstrators opposing Immigration and Customs Enforcement (ICE) have increasingly resorted to using their vehicles as dangerous weapons to target officers. The alarming trend includes incidents of officers being deliberately rammed, dragged, and trapped. The DHS has documented a significant rise in the number of these incidents, highlighting a concerning pattern of aggression towards law enforcement.",
            "link": "https://www.markets.news/headlines/5e4fcb8d-4890-4be6-ace7-9877939017c6",
            "pub_date": "2026-02-27 22:40:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8dc1a878-f9d9-4bee-b492-13851f459b75",
            "description": "UK FINANCE MINISTER REEVES WILL APPROVE DEAL TO BUY 23 HELICOPTERS FROM ITALY'S LEONARDO - REPORTS",
            "link": "https://www.markets.news/headlines/8dc1a878-f9d9-4bee-b492-13851f459b75",
            "pub_date": "2026-02-27 22:41:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}