{
    "data": [
        {
            "title": "Toberman Becker Wealth in St. Louis welcomes Mike Holtz, CFP® to their team, a new addition to the advisory staff.",
            "id": "f597e03a-a89e-4119-b981-c61ffc8e51f0",
            "description": "In St. Louis, on February 26, 2026, Toberman Becker Wealth, a financial advisory firm catering to individuals and families in the area, welcomed Mike Holtz, CFP®, to its advisory team. Holtz has joined the firm as a CERTIFIED FINANCIAL PLANNER®, bringing his expertise to enhance the services provided to clients. This addition highlights the firm's commitment to offering top-notch financial advice.",
            "link": "https://www.markets.news/headlines/f597e03a-a89e-4119-b981-c61ffc8e51f0",
            "pub_date": "2026-02-26 20:05:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Doritos introduces new Doritos Protein with 10g protein per serving, single-serve bag with 17g expected.",
            "id": "97a8c34d-2d54-43ce-b0e8-e38e0d0a2c57",
            "description": "Soon to be launched by PepsiCo Foods are new Doritos® flavors boasting 10 grams of protein per serving. These products are set to be available on shelves next month. Additionally, a single-serve bag providing 17 grams of protein is anticipated to be released later this year. The introduction of these protein-packed snacks marks a significant development in the snack industry, catering to consumers seeking both flavor and nutrition. The unveiling of these bold flavors in Doritos® is expected to invigorate the market, offering a satisfying option for those looking to satisfy their snack cravings while prioritizing protein intake.",
            "link": "https://www.markets.news/headlines/97a8c34d-2d54-43ce-b0e8-e38e0d0a2c57",
            "pub_date": "2026-02-26 20:06:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "eae009f5-ac20-4592-8453-a98978609b35",
            "description": "WARNER BROS DISCOVERY 4Q STREAMING REV $2.79B, EST. $2.76B  4Q FREE CASH FLOW $1.38B, -43% Y/Y  4Q REV. $9.46B, EST. $9.42B",
            "link": "https://www.markets.news/headlines/eae009f5-ac20-4592-8453-a98978609b35",
            "pub_date": "2026-02-26 20:06:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "799c0bfc-5958-4c7c-b923-823b8d0f0125",
            "description": "WARNER BROS DISCOVERY 4Q SUBSCRIBER NET ADDS 3.5M, EST. 3.09M  4Q LOSS/SHR 10C, EST. LOSS/SHR 3.8C  4Q TOTAL SUBSCRIBERS 131.6M, EST. 131.38M  4Q STREAMING ADJ. EBITDA $393M, -3.9% Y/Y",
            "link": "https://www.markets.news/headlines/799c0bfc-5958-4c7c-b923-823b8d0f0125",
            "pub_date": "2026-02-26 20:06:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Munchkin Inc. introduces infant formula with patented blend mimicking breastmilk. Expansion into this category for the innovative brand.",
            "id": "31f928b2-d499-4eeb-8d7a-8f82b338cb72",
            "description": "In Los Angeles, Munchkin Inc., a popular baby lifestyle brand under the ownership of WHY Brands Inc., known for innovative infant and toddler products, has revealed its venture into the infant formula sector. The company introduced Munchkin Infant Formula, which boasts a unique mix of proteins, fats, and carbohydrates formulated to mimic breastmilk closely. This new product aims to provide families with a thoughtful feeding option.",
            "link": "https://www.markets.news/headlines/31f928b2-d499-4eeb-8d7a-8f82b338cb72",
            "pub_date": "2026-02-26 20:06:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Joint Corp. will report 2025 Q4 and full year results on March 12, 2026, with a 5:00 p.m. ET conference call/webcast.",
            "id": "89a0d7d4-6878-485e-a39d-ddcc1562234c",
            "description": "A leading franchisor in chiropractic care, The Joint Corp. (NASDAQ: JYNT) based in Scottsdale, Arizona, will release its financial results for the fourth quarter and full year of 2025 on March 12, 2026, after the market closes. This announcement will be accompanied by a conference call and webcast at 5:00 p.m. ET on the same day. The call, to be led by President and CEO Sanjiv Razdan and CFO Scott Bowman, will include a discussion of the financial performance and a business outlook, followed by a Q&A session.",
            "link": "https://www.markets.news/headlines/89a0d7d4-6878-485e-a39d-ddcc1562234c",
            "pub_date": "2026-02-26 20:06:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SilverChef USA accelerates nationwide expansion under President Jon Jacobs to offer flexible financing to more operators.",
            "id": "3cd0c9f0-922e-4edc-9c21-4f25cc59ee78",
            "description": "SilverChef USA, a division of the Australian-based hospitality equipment financier SilverChef Group, is moving into a new stage of expansion following a successful year led by President of U.S. Operations Jon Jacobs. With plans to increase its workforce and extend its presence across the country, the company aims to enhance hospitality operators’ opportunities for flexible equipment financing through its Rent-Try-Buy program. Jacobs, who took on the role in January 2025, boasts over 25 years of experience in the foodservice equipment sector.",
            "link": "https://www.markets.news/headlines/3cd0c9f0-922e-4edc-9c21-4f25cc59ee78",
            "pub_date": "2026-02-26 20:06:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Conavi Medical's Q1 2026 results:$12M public offering closed, U.S. launch supported; Hybrid IVUS-OCT Imaging advantages shown.",
            "id": "1d747214-433d-43a6-a8eb-1b13f0524053",
            "description": "The company has completed a successful public offering, raising $12 million to fortify its financial position and prepare for the forthcoming debut in the U.S. market. Furthermore, a recent publication in a peer-reviewed journal highlighted the benefits of Hybrid IVUS-OCT Imaging, reinforcing the company's innovative capabilities in the field.",
            "link": "https://www.markets.news/headlines/1d747214-433d-43a6-a8eb-1b13f0524053",
            "pub_date": "2026-02-26 20:06:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Anika met 2025 revenue, exceeding revised EBITDA; 2026 revenue reaffirmed, sets EBITDA goal.",
            "id": "107f4f6b-6f96-40d9-b0a4-7f6f8338b504",
            "description": "In the year 2025, the company generated revenue that met expectations and surpassed the revised adjusted EBITDA target. The company has decided to maintain its revenue outlook for the year 2026 and has set a new target for adjusted EBITDA.",
            "link": "https://www.markets.news/headlines/107f4f6b-6f96-40d9-b0a4-7f6f8338b504",
            "pub_date": "2026-02-26 20:06:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gilat showcases 5G NTN connectivity over GEO Satellite. Validates 3GPP-Compliant tech for operators.",
            "id": "742cd3ef-90cd-4f7c-a825-d7c9a8338d27",
            "description": "A significant achievement has been reached with the confirmation of the compatibility of VSAT and Hub standardized 3GPP-Compliant 5G NTN technologies for use by both satellite and mobile network operators. This milestone signifies the validation of cutting-edge technologies for communication, with potential to greatly benefit the industry. The implementation of these standardized technologies could lead to improved efficiency, reliability, and performance levels for operators. This development marks a crucial step forward in the integration of advanced 5G NTN solutions, with implications for the entire telecommunications sector.",
            "link": "https://www.markets.news/headlines/742cd3ef-90cd-4f7c-a825-d7c9a8338d27",
            "pub_date": "2026-02-26 20:06:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hagerty reports strong 2025 results: Revenue up 17% to $1.46B, Net Income jumps 91%. 371K new members added.",
            "id": "970f9785-8bf2-469e-bdd3-d96dff6458df",
            "description": "In 2025, the total revenue saw a significant rise of 17% to reach $1,456 million, while the written premium increased by 14% to $1,194 million. A record number of 371,000 new members were added during the year. Marketplace revenue also experienced a substantial increase of 119% to $119 million. Income before taxes showed a notable growth of 49% amounting to $139 million. Net income saw the most substantial increase, rising by 91% compared to the previous year.",
            "link": "https://www.markets.news/headlines/970f9785-8bf2-469e-bdd3-d96dff6458df",
            "pub_date": "2026-02-26 19:58:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Viatris Inc (Nasdaq: VTRS) maintains dividend policy for 2026 with 48 cents/share, declares quarterly dividend of 12 cents/share.",
            "id": "cc62e039-b4d0-4b00-9f2c-086595033ce9",
            "description": "In Pittsburgh on February 26, 2026, Viatris Inc. (Nasdaq: VTRS) disclosed a new dividend policy. The company's Board of Directors sanctioned a 2026 dividend rate of $0.48 per share and confirmed a quarterly dividend of $0.12 for every issued and outstanding share.",
            "link": "https://www.markets.news/headlines/cc62e039-b4d0-4b00-9f2c-086595033ce9",
            "pub_date": "2026-02-26 19:58:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7d34ac30-2267-4598-96e1-025aecb78c11",
            "description": "Senators query Lutnick on conflict of interest concerns - CNBC",
            "link": "https://www.markets.news/headlines/7d34ac30-2267-4598-96e1-025aecb78c11",
            "pub_date": "2026-02-26 19:59:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aclaris Therapeutics releases Q4 and FY 2025 financial results, along with a corporate update.",
            "id": "b150b427-fcf7-4156-bfcb-ca43757533dd",
            "description": "Aclaris Therapeutics has released its financial results for the fourth quarter and full year of 2025, along with a corporate update. In the fourth quarter, the company reported revenue of $X million, experiencing a X% increase compared to the same period last year. For the full year 2025, total revenue reached $X million, marking a X% growth from the previous year. Aclaris also disclosed advancements in its pipeline and strategic initiatives during the period.",
            "link": "https://www.markets.news/headlines/b150b427-fcf7-4156-bfcb-ca43757533dd",
            "pub_date": "2026-02-26 19:59:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e0c2425d-cd6b-41af-93c5-6a2363e8a737",
            "description": "SENATORS CONCERNS ABOUT CANTOR TIES TO USA RARE EARTH: CNBC",
            "link": "https://www.markets.news/headlines/e0c2425d-cd6b-41af-93c5-6a2363e8a737",
            "pub_date": "2026-02-26 20:00:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d8c15e2b-4cfd-43e5-bb12-8b079b82a756",
            "description": "G. Staley Cates joins AMG's board as new member.",
            "link": "https://www.markets.news/headlines/d8c15e2b-4cfd-43e5-bb12-8b079b82a756",
            "pub_date": "2026-02-26 20:00:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d887f861-d198-4f09-b179-12eceda4d93c",
            "description": "Canadian Business Barometer Actual 64.8 (Forecast -, Previous 59.47, Revised 59.3)",
            "link": "https://www.markets.news/headlines/d887f861-d198-4f09-b179-12eceda4d93c",
            "pub_date": "2026-02-26 20:00:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Isocyanate market expected to reach $39.68 billion by 2030 - MarketsandMarkets report.",
            "id": "935219d4-ff24-4982-aa1a-5cab45c9b0e2",
            "description": "In Delray Beach, Florida on February 26, 2026, a report from MarketsandMarkets revealed significant insights on the Isocyanate Market. The market is segmented by type, including MDI, TDI, and Aliphatic, with applications in foams, adhesives & sealants, and coatings. Various industries such as automotive, building & construction, furniture & bedding, consumer goods, and industrial sectors utilize isocyanates. This information highlights the diverse applications and widespread use of isocyanates across industries, showcasing its importance in the market.",
            "link": "https://www.markets.news/headlines/935219d4-ff24-4982-aa1a-5cab45c9b0e2",
            "pub_date": "2026-02-26 20:00:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CobbleStone Software named Most Valuable Pioneer by QKS Group for AI in Contract Lifecycle Management.",
            "id": "f032a0ee-a40c-4a49-b4c5-b5d7b2ef9f2d",
            "description": "CobbleStone Software has been recognized by QKS Group as the Most Valuable Pioneer (MVP) for their innovative AI-based strategy in clause intelligence and workflow orchestration within Contract Lifecycle Management. This announcement was made in Pune, India on February 26, 2026. The accolade comes from QKS Group, a prominent global research and advisory company.",
            "link": "https://www.markets.news/headlines/f032a0ee-a40c-4a49-b4c5-b5d7b2ef9f2d",
            "pub_date": "2026-02-26 20:00:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Viatris meets or exceeds financial guidance with Q4 revenues of $3.7B and full-year revenues of $14.3B. Returns over $1B to shareholders in 2025. Balanced capital allocation planned for 2026.",
            "id": "646c6926-645e-4a06-a3f4-880c8042c874",
            "description": "In the fourth quarter of the fiscal year, total revenues reached $3.7 billion and accumulated to $14.3 billion for the full year of 2025, meeting or surpassing financial targets. Shareholders were returned over $1 billion during the year. A balanced capital allocation strategy is anticipated for 2026. Detailed financial information for 2026 has been disclosed to stakeholders.",
            "link": "https://www.markets.news/headlines/646c6926-645e-4a06-a3f4-880c8042c874",
            "pub_date": "2026-02-26 20:00:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}