{
    "data": [
        {
            "title": "ThredUp (TDUP) set to report EPS of $-0.04 on March 2. Historical data shows EPS beat by $0.02 led to 7.53% share drop. Stock up 124.89% in the last year. Investors await guidance for market reaction. ",
            "id": "150ee812-fb42-4d28-8954-40d5dd34f486",
            "description": "ThredUp (NASDAQ: TDUP) is scheduled to release its latest quarterly earnings on March 2, 2026. Analysts predict an EPS of $-0.04 for the apparel resale company. Investors are eager for the report, hoping for earnings that exceed expectations and positive guidance for the upcoming quarter. It is important to note that while earnings are crucial, market reactions are often influenced by future guidance. In the previous quarter, ThredUp surpassed expectations by $0.02, resulting in a 7.53% decrease in share price the following day. Looking at past performance: in Q3 2025, the EPS estimate was -0.05, but ThredUp posted -0.03, leading to a 7.53% drop in share price. ThredUp's shares were valued at $5.07 on February 26, showing a 124.89% increase over the past 52 weeks.",
            "link": "https://www.markets.news/headlines/150ee812-fb42-4d28-8954-40d5dd34f486",
            "pub_date": "2026-02-28 01:07:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BigBear.ai Hldgs (NYSE: BBAI) to announce quarterly earnings with estimated EPS of $-0.06. Historical performance suggests market reactions influence stock price. Shares currently trading at $4.15 with 52-week decrease of 17.96%. Investors eager for positive guidance.",
            "id": "b6e58723-5c7f-4c27-84ae-4bafae6556f1",
            "description": "BigBear.ai Hldgs (NYSE: BBAI) is set to announce its quarterly earnings on Monday, March 2, with analysts predicting an earnings per share (EPS) of $-0.06. Investors are eagerly awaiting the results, hoping for a beat on estimates and positive guidance for the next quarter. In the previous quarter, the company exceeded EPS expectations by $0.04, resulting in a 6.13% increase in share price the following day. However, over the last 52 weeks, BigBear.ai Hldgs' shares have declined by 17.96%, signaling disappointment among long-term shareholders. As of February 26, shares were trading at $4.15. The market response to earnings announcements is typically influenced not only by past performance but also by future guidance. Investors should consider both factors before reacting to the upcoming report. [Word count: 121]",
            "link": "https://www.markets.news/headlines/b6e58723-5c7f-4c27-84ae-4bafae6556f1",
            "pub_date": "2026-02-28 01:07:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cerus to announce quarterly earnings with estimated EPS of -$0.01; shares trading at $2.6, up 67.65% in past year.",
            "id": "e06082c6-eda7-43ba-9598-7371b910c8e0",
            "description": "Cerus (NASDAQ: CERS) is expected to release its latest quarterly earnings report on March 2, 2026. Analysts predict an earnings per share (EPS) of $-0.01 for the company. Investors are eager for Cerus to potentially exceed estimates and provide upbeat guidance for the next quarter, as this could impact stock prices significantly. In the previous quarter, Cerus topped EPS estimates by $0.02, leading to a 21.28% increase in share price the following day. Looking at past performance, Cerus has shown varying results compared to EPS estimates, with corresponding price changes. As of February 26, Cerus shares were trading at $2.6, with a 67.65% increase over the last 52-week period. Positive returns suggest potential optimism for long-term shareholders. ",
            "link": "https://www.markets.news/headlines/e06082c6-eda7-43ba-9598-7371b910c8e0",
            "pub_date": "2026-02-28 01:07:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sturm Ruger & Co (NYSE: RGR) to report EPS of $0.32, upcoming earnings outlook crucial, past share performance - key for investors.",
            "id": "3f6fb892-b922-4e64-8a07-5fd5ab436f97",
            "description": "Sturm Ruger & Co (NYSE: RGR) is set to announce its quarterly earnings on Monday, March 2, 2026. Analysts predict an EPS of $0.32. Investors are eager for positive guidance in addition to surpassing estimates, as market reactions are largely driven by this. In the last quarter, Sturm Ruger missed EPS by $0.24, resulting in a 19.81% drop in share price the next day. Previous EPS estimates and actuals for quarters in 2025 and 2024 are provided, along with price change percentages. As of February 26, Sturm Ruger shares were trading at $37.44, reflecting a 5.8% decrease over the past year. For more details, the full article is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/3f6fb892-b922-4e64-8a07-5fd5ab436f97",
            "pub_date": "2026-02-28 01:07:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Asana (NYSE: ASAN) to release quarterly earnings on 2026-03-02 with anticipated EPS of $-0.02. Past EPS beats led to 7.77% price increase. Stock down 62.04%.",
            "id": "dc634a23-83d6-4e05-aa9c-ab18dfe8ac33",
            "description": "Asana (NYSE: ASAN) is set to reveal its quarterly earnings on March 2, 2026, with analysts expecting an earnings per share (EPS) of $-0.02. Past performance shows that Asana beat EPS estimates in the last quarter by $0.22, resulting in a 7.77% increase in share price the following day. In the previous quarters, Asana's performance varied, with some instances of beating estimates and others falling short. As of February 26, shares of Asana were trading at $7.35, marking a 62.04% decline over the last 52 weeks. Investors are eager for positive guidance in the upcoming announcement, recognizing the impact it can have on the market reaction, alongside earnings results. The full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/dc634a23-83d6-4e05-aa9c-ab18dfe8ac33",
            "pub_date": "2026-02-28 01:07:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UAB “Atsinaujinančios energetikos investicijos” releases interim financial statements for the 12-month period of 2025.",
            "id": "afd45a77-ce5a-4179-a628-2023224832a5",
            "description": "UAB “Atsinaujinančios energetikos investicijos” (the Company) has released its unreviewed interim condensed consolidated and separate financial statements for the 12-month period ending in 2025.",
            "link": "https://www.markets.news/headlines/afd45a77-ce5a-4179-a628-2023224832a5",
            "pub_date": "2026-02-28 01:07:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e8437b07-7441-49e6-a201-7cf2150dcdfb",
            "description": "Volland SPX Dealer Premium: $203.83B This widget shows the total option premium dealers have collected from open positions. Net dealer premium stands at roughly $203.83B, indicating dealers are holding a substantial amount of premium exposure across SPX options. 0DTE premium is",
            "link": "https://www.markets.news/headlines/e8437b07-7441-49e6-a201-7cf2150dcdfb",
            "pub_date": "2026-02-28 01:08:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enterprise Products Partners L.P. filed Form 10-K for 2025 with SEC. Free copies available on website.",
            "id": "877e3704-e5b4-44ef-8658-921d2e83940e",
            "description": "Houston-based Enterprise Products Partners L.P. (NYSE: EPD) has submitted the company's Annual Report on Form 10-K for the fiscal year ending on December 31, 2025 to the Securities and Exchange Commission. This report can be accessed on the Enterprise website, www.enterpriseproducts.com. Physical copies can also be obtained at no cost by requesting at https://ir.enterpriseproducts.com/notifications-requests. EPD is among the leading publicly traded partnerships.",
            "link": "https://www.markets.news/headlines/877e3704-e5b4-44ef-8658-921d2e83940e",
            "pub_date": "2026-02-28 01:08:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3b079453-7c6c-4a77-a5ac-e7d879b7644a",
            "description": "ATLAS SP SAYS IT PROACTIVELY PUT TWO WAREHOUSES INTO DEFAULT LAST WEEK \"AND IS PURSUING ALL LEGAL AVENUES TO MAXIMIZE RECOVERIES\" FOLLOWING A BREACH OF CONTRACTUAL TERMS BY MARKET FINANCIAL SOLUTIONS",
            "link": "https://www.markets.news/headlines/3b079453-7c6c-4a77-a5ac-e7d879b7644a",
            "pub_date": "2026-02-28 01:10:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Insiders at BCO, NATL, KORE may benefit financially, limiting competing offers. Shareholders advised to seek legal counsel.",
            "id": "f8e847b0-8c88-4e67-aabf-4b9e6c5312b4",
            "description": "Internal individuals have the potential to gain significant financial advantages that regular shareholders cannot access. The upcoming deals might include conditions that restrict better competing bids. Shareholders are advised to reach out to the company to explore their entitlements and choices without any charges involved.",
            "link": "https://www.markets.news/headlines/f8e847b0-8c88-4e67-aabf-4b9e6c5312b4",
            "pub_date": "2026-02-28 01:11:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zscaler beats Q4 expectations, stock drops despite positive report. Red Canary contributes $114 million ARR. Revenue guidance $834-836 million.",
            "id": "4146dde4-cfd5-4132-8bc8-9faebedd6021",
            "description": "Zscaler Inc's (NASDAQ: ZS) shares experienced a significant decline during early trading on Friday, despite the positive fiscal second-quarter report. Analyst insights showcased varying sentiments, with JMP Securities' analyst, Trevor Walsh, maintaining a Market Outperform rating but adjusting the price target from $355 to $290. Similarly, Rosenblatt Securities' analyst, Catharine Trebnick, kept a Buy rating but reduced the price target from $280 to $250. Concerns among investors persist regarding the company's \"inorganic contribution,\" as highlighted by Walsh. Excluding Red Canary's ARR of $114 million, Zscaler's net-new ARR saw a 7% year-on-year increase to $139 million. The management provided guidance for revenue in the range of $834 million to $836 million. For more insights, refer to other analyst stock ratings.",
            "link": "https://www.markets.news/headlines/4146dde4-cfd5-4132-8bc8-9faebedd6021",
            "pub_date": "2026-02-28 01:02:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SINBON and Swobbee collaborate to expand battery swapping in NYC to reduce fire risks and enhance last-mile mobility.",
            "id": "825c6c04-6efd-476d-86ee-9ef78b2583b6",
            "description": "In New York City, SINBON and Swobbee are working together to enhance the implementation of a citywide battery swapping network. The primary goal is to decrease the fire hazards linked to charging e-bikes while promoting cleaner and dependable last-mile transportation. This initiative is crucial in a bustling city like New York, where safety and sustainability are paramount. The companies are focusing on expanding this network to improve the infrastructure for e-bike users.",
            "link": "https://www.markets.news/headlines/825c6c04-6efd-476d-86ee-9ef78b2583b6",
            "pub_date": "2026-02-28 01:03:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Steven Spina promoted to Chief Underwriting Officer at TDC Specialty Underwriters, a leading E&S lines specialist.",
            "id": "f761fe20-59c6-408f-b520-e73571cc1181",
            "description": "In Unionville, Connecticut on February 27, 2026, TDC Specialty Underwriters, a prominent Excess & Surplus (E&S) lines expert under TDC Group, revealed the advancement of Steven Spina to Chief Underwriting Officer. Formerly the Executive Vice President, he now takes over the new role, showcasing the company's strategic shift.",
            "link": "https://www.markets.news/headlines/f761fe20-59c6-408f-b520-e73571cc1181",
            "pub_date": "2026-02-28 01:03:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "5a1cd655-e6ef-48b1-bda2-86a360422ba6",
            "description": "CRYPTO-BACKED BANK TRUST CHARTER RULE GETS FINAL US NOD - BLAW",
            "link": "https://www.markets.news/headlines/5a1cd655-e6ef-48b1-bda2-86a360422ba6",
            "pub_date": "2026-02-28 01:03:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AviaGames to discuss real-money mobile gaming at GDC Festival, celebrating 10th anniversary in 2026 with improved player payments and tech partnerships. Attendees to learn about Avia's competitive casual games.",
            "id": "adb7f035-7f62-4d6b-8159-680aa5ae934d",
            "description": "In San Francisco, AviaGames, a prominent player in casual, skill-based games, is set to present at the 2026 GDC Festival of Gaming. They will delve into their 10th anniversary achievements, plans for 2026, enhanced player payment systems, and future collaborations with tech giants. Attendees can expect insights into Avia's competitive casual game lineup and platform that emphasizes player trust. Avia will host two panel discussions, one featuring PayPal, to discuss advancements. This event offers a glimpse into Avia's growth and strategies for the future.",
            "link": "https://www.markets.news/headlines/adb7f035-7f62-4d6b-8159-680aa5ae934d",
            "pub_date": "2026-02-28 01:03:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ebd1d3fe-ca17-4428-aeea-b409124ef66c",
            "description": "DEMOCRATS SAY THEY HAVE THE VOTES TO SUBPOENA LUTNICK IN EPSTEIN PROBE - POLITICO Democrats say they have enough votes to subpoena Commerce Secretary Howard Lutnick over his ties to Jeffrey Epstein, escalating the House Oversight investigation. The move follows disclosures",
            "link": "https://www.markets.news/headlines/ebd1d3fe-ca17-4428-aeea-b409124ef66c",
            "pub_date": "2026-02-28 01:04:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AOC Pharma S.à r.l. discloses transparency notification, revealing key details.",
            "id": "774c8179-e2c0-4402-950c-59fcab8c1839",
            "description": "Authorities have reported a new record of daily COVID-19 cases in the country, with 10,362 new infections confirmed in the past 24 hours. The total number of active cases has reached 87,419, with 532 patients in critical condition. Unfortunately, 76 new deaths have been recorded, bringing the total death toll to 1,258. The government has reminded citizens to follow health guidelines strictly to help curb the spread of the virus.",
            "link": "https://www.markets.news/headlines/774c8179-e2c0-4402-950c-59fcab8c1839",
            "pub_date": "2026-02-28 01:04:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vallarta Supermarkets to offer Western Union money services at all stores from Feb 28, 2026, expanding access for customers.",
            "id": "6168a116-540d-4674-8207-5116cd39f851",
            "description": "Starting February 28th, a well-known supermarket chain will provide access to affordable and trustworthy money transfer services in Santa Clarita, California. Customers of Vallarta Supermarkets will have the opportunity to utilize Western Union's money transfer services at all locations. This initiative aims to offer convenient financial solutions to customers, enhancing their shopping experience. This service expansion signifies the company's commitment to meeting the financial needs of its patrons.",
            "link": "https://www.markets.news/headlines/6168a116-540d-4674-8207-5116cd39f851",
            "pub_date": "2026-02-28 01:05:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ceaec874-7b48-44f8-afe9-6f43be99a297",
            "description": "Slovakia's Fico: 'AFTER A PHONE CALL WITH UKRAINIAN PRESIDENT V. ZELENSKY In connection with the state of the oil emergency in Slovakia, I spoke today by phone with the Ukrainian President Volodymyr Zelensky. I asked him for information on when, and whether at all, the transit",
            "link": "https://www.markets.news/headlines/ceaec874-7b48-44f8-afe9-6f43be99a297",
            "pub_date": "2026-02-28 01:05:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Utz Brands to showcase new snacks at Natural Products Expo West, including Boulder Canyon products, Hall A, Booth 1117",
            "id": "b6082e6d-1a63-41d4-8322-0d25ebd8d5de",
            "description": "Utz Brands, Inc., a prominent U.S. producer of branded salty snack foods, is set to unveil fresh innovative items from both Boulder Canyon® and Utz® at Booth 1117 in Hall A during the 2026 Natural Products Expo West happening at the Anaheim Convention Center in Anaheim, CA from March 4-6. Boulder Canyon, recognized as America's fastest-growing salty snack brand with a leading position as the top salty brand in the natural channel, will present its complete range of products, featuring classic kettle style snacks.",
            "link": "https://www.markets.news/headlines/b6082e6d-1a63-41d4-8322-0d25ebd8d5de",
            "pub_date": "2026-02-28 01:05:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}