{
    "data": [
        {
            "title": "Levrx aims to improve specialty medication journey in Feb 26 release, addressing confusion and fragmentation in experience.",
            "id": "327173a3-8efc-4b5a-aa13-d0bfbd7c8b51",
            "description": "In Troy, New York, as of February 26, 2026, the process of managing specialty medications can be overwhelming and disjointed for many individuals. Patients often struggle to track the progress of their prescriptions and understand the status of their orders, leading to a lack of transparency in the system. This confusion is a result of the intricate routing of specialty medications through specific channels, creating a barrier to a seamless experience. The need for clarity and accessibility in this process is evident, with the aim to streamline the distribution of specialty medications and enhance the overall patient experience.",
            "link": "https://www.markets.news/headlines/327173a3-8efc-4b5a-aa13-d0bfbd7c8b51",
            "pub_date": "2026-02-27 04:27:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Healthcare Triangle raises $3.959M through stock financing on Nasdaq. Leader in digital healthcare solutions.",
            "id": "c7d0be8d-8985-450a-8f34-98c98b765fbf",
            "description": "Pleasanton, California - On February 26, 2026, Healthcare Triangle, Inc. (Nasdaq: HCTI), a prominent provider of digital transformation solutions for healthcare and life sciences, revealed that it has finalized agreements for acquiring a new entity. The Company is recognized for its innovative approach in the industry and continues to expand its portfolio through strategic acquisitions.",
            "link": "https://www.markets.news/headlines/c7d0be8d-8985-450a-8f34-98c98b765fbf",
            "pub_date": "2026-02-27 04:29:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Breakthrough T1D (formerly JDRF) launches 2026 Walks in the US to raise funds for T1D research and celebrate community.",
            "id": "89369650-cd8e-47fb-9df7-84ea5a23e8a6",
            "description": "Unveiled on February 26, 2026, Breakthrough T1D, formerly known as JDRF, a key organization dedicated to type 1 diabetes (T1D) research and advocacy worldwide, has initiated the 2026 Breakthrough T1D Walks across the United States. These events aim to unite the community, boost awareness, and gather funds for essential initiatives.",
            "link": "https://www.markets.news/headlines/89369650-cd8e-47fb-9df7-84ea5a23e8a6",
            "pub_date": "2026-02-27 04:29:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2690b65e-bf9d-4e65-8d28-223efbc16b5c",
            "description": "MEXICO'S FINANCE MINISTRY: HAS SIGNED MOU WITH CRIMINAL INVESTIGATION UNIT OF U.S. INTERNAL REVENUE SERVICE FOR INTELLIGENCE SHARING",
            "link": "https://www.markets.news/headlines/2690b65e-bf9d-4e65-8d28-223efbc16b5c",
            "pub_date": "2026-02-27 04:30:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KBRA assigns ratings to 44 classes of PMT Loan Trust 2026-CNF2 notes, totaling $301.5 million backed by 547 mortgage loans.",
            "id": "88c4aeb0-09c7-4c2a-9c5a-8136caac0ba7",
            "description": "In New York, credit rating agency KBRA has assigned preliminary ratings to 44 classes of mortgage-backed notes from PMT Loan Trust 2026-CNF2, sponsored by PennyMac Corp. The prime RMBS transaction includes 547 agency-eligible, conforming mortgage loans totaling about $301.5 million as of March 1, 2026. PennyMac is an indirect, wholly-owned subsidiary of PennyMac Mortgage Investment Trust.",
            "link": "https://www.markets.news/headlines/88c4aeb0-09c7-4c2a-9c5a-8136caac0ba7",
            "pub_date": "2026-02-27 04:23:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investigation underway for CatalystRCM's data breach exposing 139,000 records linked to diagnostic lab testing in Texas.",
            "id": "cab631a2-60fb-4057-b1c3-4dcf6f8b06e4",
            "description": "An investigation is currently being conducted by Schubert Jonckheer & Kolbe LLP into a data breach that occurred on Feb. 26, 2026, resulting in unauthorized access to the sensitive data of individuals who underwent diagnostic laboratory testing services associated with CatalystRCM, a revenue company based in Texas. The breach has affected a significant number of individuals, with their personal information compromised. The breach poses a serious threat to the privacy and security of those impacted, prompting immediate action to address the situation and prevent further unauthorized access to sensitive data.",
            "link": "https://www.markets.news/headlines/cab631a2-60fb-4057-b1c3-4dcf6f8b06e4",
            "pub_date": "2026-02-27 04:23:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Copper Development Association offers free training on lead service line replacement for utilities and engineers.",
            "id": "ad69b222-b745-41ca-a9a4-2f4ae1595db7",
            "description": "A training program called Do It Proper with Copper is being offered by the Copper Development Association in McLean, Virginia as of February 26, 2026. This program is designed for utilities, municipalities, contractors, and engineers to help them install copper service lines accurately and confidently. The program aims to educate participants on best practices for installing copper service lines.",
            "link": "https://www.markets.news/headlines/ad69b222-b745-41ca-a9a4-2f4ae1595db7",
            "pub_date": "2026-02-27 04:23:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "73777d15-e62c-4627-a77a-beec16166a5d",
            "description": "US: Trump is open to dialogue with North Korea's Kim: - Yonhap.",
            "link": "https://www.markets.news/headlines/73777d15-e62c-4627-a77a-beec16166a5d",
            "pub_date": "2026-02-27 04:23:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HVAC expert Dan Barrios of Oro Valley, Arizona stresses the necessity of year-round maintenance in mild weather.",
            "id": "2b3acba3-642e-407a-94d4-b2153ef02c6a",
            "description": "In Oro Valley, Arizona on February 26, 2026, a recent article highlights the significance of consistent HVAC maintenance in Tucson, AZ, even during periods of mild weather. The article emphasizes the importance of not delaying HVAC service, despite the seemingly functional state of systems. Maintenance is crucial year-round as it helps to prevent potential issues and ensures efficient operation of HVAC systems.",
            "link": "https://www.markets.news/headlines/2b3acba3-642e-407a-94d4-b2153ef02c6a",
            "pub_date": "2026-02-27 04:25:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Graphic Packaging (NYSE: GPK) declared a $0.11 per share quarterly dividend for its stockholders on Feb. 26, 2026.",
            "id": "7ab3cb05-6452-42f5-b157-c7c9b8cd05cd",
            "description": "In an announcement made on February 26, 2026, Graphic Packaging Holding Company, a prominent player in sustainable consumer packaging worldwide, revealed that a quarterly dividend of $0.11 per share of common stock has been declared by the Board of Directors. This dividend is set to be distributed to stockholders who are recorded at the close of business.",
            "link": "https://www.markets.news/headlines/7ab3cb05-6452-42f5-b157-c7c9b8cd05cd",
            "pub_date": "2026-02-27 04:25:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "7AI integrates with AWS Security Hub Extended for unified procurement, providing AI security operations.",
            "id": "37df00eb-240d-4cc1-887e-cb0db30a62fc",
            "description": "In Boston, a recent integration between 7AI and AWS Security Hub extends agentic AI security operations to customers, offering a unified procurement experience. This collaboration aims to enhance security measures by incorporating AI technology into the AWS Security Hub, providing customers with advanced protection capabilities. The integration is set to streamline the procurement process for users and enable them to access cutting-edge security solutions. This development signifies a step forward in leveraging artificial intelligence for enhancing cybersecurity.",
            "link": "https://www.markets.news/headlines/37df00eb-240d-4cc1-887e-cb0db30a62fc",
            "pub_date": "2026-02-27 04:25:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Blue Shield Promise and L.A. Care introduce SheWorks program for Black women's career advancement in Long Beach.",
            "id": "0a1dfd54-a33c-4f0f-8466-15c32273f2eb",
            "description": "In Long Beach, California, on Feb. 26, 2026, Blue Shield of California Promise Health Plan and L.A. Care Health Plan revealed their collaboration on the innovative SheWorks program. This initiative aims to bolster economic mobility and enhance professional advancement opportunities. Through this partnership, they strive to offer essential support, with a significant emphasis on empowering individuals in their career growth.",
            "link": "https://www.markets.news/headlines/0a1dfd54-a33c-4f0f-8466-15c32273f2eb",
            "pub_date": "2026-02-27 04:07:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "5eca1a75-9d2f-4fca-a68b-bb97649877ba",
            "description": "Taliban spox: ‘203rd Mansouri Corps, 4th Frontier Brigade, 1st Kandak: Mujahideen have entered and are clearing a Pakistani military base in Barmal district of Paktika province.’",
            "link": "https://www.markets.news/headlines/5eca1a75-9d2f-4fca-a68b-bb97649877ba",
            "pub_date": "2026-02-27 04:07:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FirstEnergy appoints Hannah Turner as VP, Transmission Finance. She'll lead financial ops for FirstEnergy Transmission. (Characters: 118)",
            "id": "9826f1cc-4d7f-4302-ab62-c623b57072e9",
            "description": "FirstEnergy Corp., a prominent player in the industry, based in Akron, Ohio, announced the appointment of Hannah Turner as Vice President of Transmission Finance on February 26, 2026. Turner, an experienced finance professional, will be responsible for managing financial operations and providing regulatory support for the company's transmission division. This move comes as part of FirstEnergy's strategic efforts to enhance its financial strategy. The company, traded on the New York Stock Exchange under the symbol FE, is seeking to leverage Turner's expertise to drive efficiency and compliance in this key sector.",
            "link": "https://www.markets.news/headlines/9826f1cc-4d7f-4302-ab62-c623b57072e9",
            "pub_date": "2026-02-27 04:09:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toshiba's ELERA Security Suite boosts Grupo El Rosado stores with quicker checkouts.",
            "id": "288172bf-fad9-452e-a30e-a59c46b02cf5",
            "description": "A company based in Research Triangle Park, North Carolina, has announced that Toshiba’s ELERA® Security Suite is enhancing Grupo El Rosado's operations by enabling faster checkouts and more intelligent stores. This technology implementation is aimed at improving the efficiency and customer experience at Grupo El Rosado.",
            "link": "https://www.markets.news/headlines/288172bf-fad9-452e-a30e-a59c46b02cf5",
            "pub_date": "2026-02-27 04:09:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "David Waal of Irvine Advisors helps investors analyze cap rates for deeper real estate understanding. (Characters: 88)",
            "id": "9f89ffc2-dfeb-4a98-b5b7-9907e51aad30",
            "description": "David Waal from Irvine Advisors is providing investors with the tools to effectively analyze capitalization rates, leading to a better comprehension of real estate market valuation, risk evaluation, and potential investment profits. This initiative is particularly notable in San Francisco as of Feb. 26, 2026. Through this program, individuals can enhance their understanding of how capitalization rates impact investment decisions and maximize returns in the real estate market.",
            "link": "https://www.markets.news/headlines/9f89ffc2-dfeb-4a98-b5b7-9907e51aad30",
            "pub_date": "2026-02-27 04:09:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "361f9720-042c-4704-88eb-2581fde1eca3",
            "description": "Mamdani: ‘I had a productive meeting with President Trump this afternoon. I’m looking forward to building more housing in New York City.’",
            "link": "https://www.markets.news/headlines/361f9720-042c-4704-88eb-2581fde1eca3",
            "pub_date": "2026-02-27 04:10:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ELISA Project gains NVIDIA as Premier member, enhancing Linux safety applications. Expansion brings increased expertise and resources to project.",
            "id": "28c5b6d9-d360-4536-b749-18c109fb8957",
            "description": "On February 26, 2026, in San Francisco, the ELISA Project revealed that NVIDIA has become a Premier member, enhancing efforts to promote the utilization of Linux in safety-critical and regulated systems. This move aims to advance the integration of Linux in such systems to ensure reliability and compliance with regulations. The project is hosted by the Linux Foundation, underscoring its commitment to fostering collaboration and innovation in this area.",
            "link": "https://www.markets.news/headlines/28c5b6d9-d360-4536-b749-18c109fb8957",
            "pub_date": "2026-02-27 04:13:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Greenfield Savings Bank introduces new personal and business accounts to enhance customer money management.",
            "id": "9b975c9b-93e7-4d9f-9ad8-6c40a42b0b94",
            "description": "Greenfield Savings Bank (GSB) has introduced a modern set of personal and business accounts tailored to provide customers with enhanced control over their finances. The bank, based in GREENFIELD, Mass., revealed this exciting update on Feb. 26, 2026, through a press release. The innovation offers GSB's clients more intelligent and versatile options for money management, marking a significant advancement in the institution’s services.",
            "link": "https://www.markets.news/headlines/9b975c9b-93e7-4d9f-9ad8-6c40a42b0b94",
            "pub_date": "2026-02-27 04:13:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "02abc950-d060-4725-87d6-bcae1d4ee94e",
            "description": "Zelenskyy: ‘I spoke with President Trump’s envoys Steve Witkoff and following the outcomes of their meetings with Rustem Umerov and David Arakhamia today. We are grateful to for his personal efforts to end this war. There is already",
            "link": "https://www.markets.news/headlines/02abc950-d060-4725-87d6-bcae1d4ee94e",
            "pub_date": "2026-02-27 04:00:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}