{
    "data": [
        {
            "title": "Clarus to discuss Q4 and full year 2025 results in conference call on March 5 at 5:00 pm ET. Press release to follow.",
            "id": "604f3ca0-d2c4-400f-b504-e4c8b04bbcf4",
            "description": "On February 26, 2026, Clarus Corporation (NASDAQ: CLAR) announced that they will be conducting a conference call on March 5, 2026, at 5:00 pm Eastern Time to review their financial performance for the fourth quarter and full year ending December 31, 2025. The company, known for its global focus on outdoor enthusiast markets, will release its financial results in a press release after the stock market closes on the day of the conference call. This event will be an opportunity for stakeholders to gain insights into the company's performance in the specified period.",
            "link": "https://www.markets.news/headlines/604f3ca0-d2c4-400f-b504-e4c8b04bbcf4",
            "pub_date": "2026-02-27 07:17:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dcc85703-8b50-4276-a026-f9b003c80b01",
            "description": "Aura unveils Q4 '25 & FY '25 financial and operational results; strong growth with revenue up by 15% to $100M.",
            "link": "https://www.markets.news/headlines/dcc85703-8b50-4276-a026-f9b003c80b01",
            "pub_date": "2026-02-27 07:17:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9f642a7e-7e59-4124-8283-55cd0738d046",
            "description": "US ENERGY SECRETARY WRIGHT SAYS VENEZUELAN CRUDE BEING SOLD AT ABOUT $50 PER BARREL, 40 MLN BARRELS EXPECTED TO HAVE BEEN SOLD BY END OF FEB",
            "link": "https://www.markets.news/headlines/9f642a7e-7e59-4124-8283-55cd0738d046",
            "pub_date": "2026-02-27 07:17:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ASU's GAME School partners with Gen.G, starting with youth summer program in June in Downtown LA.",
            "id": "2adafaf6-c624-4532-86a1-55706c48215f",
            "description": "In Los Angeles on February 26, 2026, Arizona State University (ASU) and esports organization Gen.G revealed a collaboration. This partnership will commence with a youth summer program in June and aims to establish a talent pathway. The initiative seeks to foster growth in the gaming industry and nurture upcoming talent.",
            "link": "https://www.markets.news/headlines/2adafaf6-c624-4532-86a1-55706c48215f",
            "pub_date": "2026-02-27 07:06:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rising trend: More parents refusing newborns' vitamin K injections, putting babies at risk due to vitamin K deficiency.",
            "id": "bcdff14f-f672-4931-a128-10b2e4d1a95d",
            "description": "Recent research has revealed a concerning trend showing an increase in the number of parents choosing to decline vitamin K injections for their newborns. Vitamin K, an important vitamin naturally lacking in newborns, is crucial for blood clotting at birth. Despite being a vital supplement and not a vaccine, more parents are opting out of this simple and essential preventive measure for their babies.",
            "link": "https://www.markets.news/headlines/bcdff14f-f672-4931-a128-10b2e4d1a95d",
            "pub_date": "2026-02-27 07:06:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RF-SMART hits milestone with 2,800 NetSuite WMS customers in 40+ countries, offering scalable solutions.",
            "id": "b2fca115-2b9c-42c9-9438-aaa0115e8bf7",
            "description": "A top-ranked WMS SuiteApp by G2 and with highest reviews has achieved a significant milestone, introducing a native, adaptable architecture suitable for companies of any scale. Based in Jacksonville, Florida, RF-SMART, a key NetSuite warehouse management system (WMS) vendor, disclosed hitting the 2,800 mark on Feb. 26, 2026.",
            "link": "https://www.markets.news/headlines/b2fca115-2b9c-42c9-9438-aaa0115e8bf7",
            "pub_date": "2026-02-27 07:06:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "14885ec8-1d2d-4a61-9bae-68b6d7ec0537",
            "description": "US ENERGY SECRETARY WRIGHT SAYS HE EXPECTS VENEZUELAN OIL SALES TO INCREASE AS EXPORTS GO TO BUYERS IN INDIA, ASIA AND EUROPE",
            "link": "https://www.markets.news/headlines/14885ec8-1d2d-4a61-9bae-68b6d7ec0537",
            "pub_date": "2026-02-27 07:07:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kratos Defense (NASDAQ: KTOS) falls in after-hours trading following proposed offering of $1.15 billion in common stock.",
            "id": "3527808f-63e7-4d9d-a846-d2cd5f370bbf",
            "description": "Kratos Defense & Security Solutions Inc (NASDAQ: KTOS) witnessed a decline in after-hours trading following the announcement of a proposed offering. The company revealed its plan to offer $1 billion in shares of common stock through underwritten offerings, with an option for underwriters to purchase an additional $150 million within 30 days. All shares in the offering will be sold by Kratos, with the objective of utilizing the net proceeds for financing purposes. This development contributed to the downward trend in Kratos Defense & Security shares.",
            "link": "https://www.markets.news/headlines/3527808f-63e7-4d9d-a846-d2cd5f370bbf",
            "pub_date": "2026-02-27 07:08:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Payments company cuts workforce by 40%, leading to 4,000 job losses due to increased use of AI tools, says top executive.",
            "id": "3bd017be-d7e2-40f3-9c4f-d6301ee03b7e",
            "description": "The CEO of a payments company announced that approximately 4,000 employees will be laid off due to the implementation of new artificial intelligence technologies in their operations.",
            "link": "https://www.markets.news/headlines/3bd017be-d7e2-40f3-9c4f-d6301ee03b7e",
            "pub_date": "2026-02-27 07:09:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MCIC and PFI collaborate to address disinvestment in rural Maryland through New Market Tax Credits.",
            "id": "f7c977c0-f065-4dc0-83cd-4326c6ac3326",
            "description": "In Boston on February 26, 2026, the Maryland Community Investment Corporation (MCIC) and the Public Finance Initiative (PFI) collaborated to host a Rural Convening event. This event aimed to shed light on New Market Tax Credits and explore comprehensive strategies for securing capital. The event spanned multiple days and provided valuable insights, with attendees including industry experts, stakeholders, and key decision-makers. This gathering facilitated discussions on rural development opportunities and ways to leverage New Market Tax Credits effectively. The participation numbers exceeded expectations, with over 200 individuals present to engage in meaningful dialogue and knowledge exchange. The event successfully demystified the complexities of New Market Tax Credits, fostering a deeper understanding among attendees regarding capital integration approaches for rural development initiatives.",
            "link": "https://www.markets.news/headlines/f7c977c0-f065-4dc0-83cd-4326c6ac3326",
            "pub_date": "2026-02-27 07:01:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EPCOR reported strong financial results for 2025, with net income of $533 million, $1.2 billion invested in capital projects, and increased dividend to $206 million for 2026.",
            "id": "d48a969a-93a0-46be-b946-96d8871b5161",
            "description": "EPCOR Utilities Inc. reported its annual and fourth quarter results for 2025, citing strong safety, operational, and financial performance. Investments in utility infrastructure totaled nearly $1.2 billion in 2025, exceeding $1 billion for the second straight year. Net income for the year ended December 31, 2025, was $533 million compared to $427 million in 2024. Adjusted EBITDA was $1,219 million for 2025, up from $1,147 million in 2024. The company increased its dividend to the City of Edmonton from $201 million in 2025 to $206 million in 2026. Management emphasized their commitment to reliability, customer satisfaction, and controlling operating costs. More details are available on EPCOR's website.",
            "link": "https://www.markets.news/headlines/d48a969a-93a0-46be-b946-96d8871b5161",
            "pub_date": "2026-02-27 07:02:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New private Bitcoin asset launching on Starknet with Zcash-like features to enhance privacy on Ethereum layer-2 network.",
            "id": "5ee3d596-ccac-4140-8d3b-e84bf8dc6fc0",
            "description": "Starknet has introduced a new asset on Ethereum's layer-2 scaling network, utilizing Bitcoin technology to enhance privacy for users. This initiative aims to empower individuals to safeguard their privacy while transacting on the network.",
            "link": "https://www.markets.news/headlines/5ee3d596-ccac-4140-8d3b-e84bf8dc6fc0",
            "pub_date": "2026-02-27 07:02:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "H2O America appoints Nick O. Rowe to board of directors, effective Mar. 1, 2026. NASDAQ: HTO.",
            "id": "1fb697ef-7895-4d9a-9fe4-298bfbfde8b9",
            "description": "The board of directors of H2O America (NASDAQ: HTO) has appointed Nick O. Rowe to join their team starting from March 1st. The announcement was made on February 26, 2026, in San Jose, California.",
            "link": "https://www.markets.news/headlines/1fb697ef-7895-4d9a-9fe4-298bfbfde8b9",
            "pub_date": "2026-02-27 07:03:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Caris Life Sciences achieves superior sensitivity & specificity with Whole Genome Sequencing in Achieve 1 study.",
            "id": "d71774b1-8afd-41c7-af5b-a85f782edfc4",
            "description": "New research findings have shown the exceptional sensitivity and specificity of Caris Life Sciences速' Caris Detect, indicating the superiority of Whole Genome Sequencing over methylation-based methods. This breakthrough was reported in Irving, Texas on February 26, 2026. Caris Life Sciences速, listed on NASDAQ as CAI, is a prominent player in providing patient-centered services.",
            "link": "https://www.markets.news/headlines/d71774b1-8afd-41c7-af5b-a85f782edfc4",
            "pub_date": "2026-02-27 07:03:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BIGGBY速 COFFEE introduces festive Irish Cream & Brown Sugar creations for spring, along with seasonal perks until May 20.",
            "id": "ad4f2cff-ab0a-4dbb-8597-83199d249145",
            "description": "From February 26 to May 20, BIGGBY速 COFFEE, a high-energy coffee franchise with over 460 units, is launching its seasonal lineup in East Lansing, Michigan. The lineup includes Irish Cream beverages, Brown Sugar drinks, spring treats, and limited-time promotions to celebrate the season. The campaign marks the beginning of spring for customers to enjoy the festive offerings at the various locations.",
            "link": "https://www.markets.news/headlines/ad4f2cff-ab0a-4dbb-8597-83199d249145",
            "pub_date": "2026-02-27 07:03:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nektar Therapeutics (NKTR) will report Q4 & annual 2025 results on March 12, 2026, post U.S. market close. ",
            "id": "e13c4e38-ce03-4090-9926-f0c35fe22754",
            "description": "On February 26, 2026, Nektar Therapeutics (Nasdaq: NKTR) revealed plans to disclose its financial performance for Q4 and the year concluding December 31, 2025, on March 12, 2026, following the closure of U.S. financial markets. Howard Robin, the President and Chief Executive Officer, will likely provide insights during this announcement.",
            "link": "https://www.markets.news/headlines/e13c4e38-ce03-4090-9926-f0c35fe22754",
            "pub_date": "2026-02-27 07:03:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ontario Airport reports 3.7% rise in January passengers, with total volume up by 70% since 2016.",
            "id": "8fdd288c-7c40-4a51-852a-2ece66e942f3",
            "description": "The passenger volume at Ontario International Airport (ONT) has seen a significant increase of almost 70% since the airport was returned to local control in 2016. Officials at ONT have revealed a 3.7% rise in passenger volume in January, attributed to a record number of international travelers. This surge in passenger traffic is indicative of the growing popularity and importance of ONT as a key travel hub.",
            "link": "https://www.markets.news/headlines/8fdd288c-7c40-4a51-852a-2ece66e942f3",
            "pub_date": "2026-02-27 07:04:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aura Minerals Inc. signed a cooperation agreement with DNIT to relocate a road at Borborema Mine, unlocking 670 Koz of gold in reserves, totaling 1.5 Moz.",
            "id": "280940da-621c-43fc-8986-b482dfed7a5e",
            "description": "Aura Minerals Inc. is pleased to announce that it has signed a cooperation agreement with DNIT to relocate the federal road crossing a portion of the Borborema mine in Rio Grande do Norte, Brazil. The road is being moved to accommodate the mining operations smoothly. Additionally, the Company has released an updated Technical Report of Borborema, now accessible on www.sec.gov and SEDAR+. Aura's stock tickers are Nasdaq: AUGO and B3: AURA33.",
            "link": "https://www.markets.news/headlines/280940da-621c-43fc-8986-b482dfed7a5e",
            "pub_date": "2026-02-27 07:04:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hydnum Steel secures 500 MW electrical power in Spain, key for clean steel plant construction.",
            "id": "1a6f186b-5fb3-4de7-9f98-fc25b59562e3",
            "description": "In Puertollano, Spain, Hydnum Steel has made significant progress in establishing Spain's inaugural clean steel plant by securing access to the electricity grid at the Brazatortas node in Ciudad Real province. The company has been allotted an electricity capacity of 500 MW, as reported in the Official State Gazette. This allocation is crucial to ensure a stable power source for its electric arc furnace. This accomplishment signifies a major advancement for the innovative endeavor in the Iberian region.",
            "link": "https://www.markets.news/headlines/1a6f186b-5fb3-4de7-9f98-fc25b59562e3",
            "pub_date": "2026-02-27 07:05:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "96eb3863-bce6-417f-86c6-44cf13f40e08",
            "description": "HILLARY CLINTON: I KNEW GHISLAINE MAXWELL CASUALLY AS AN ACQUAINTANCE",
            "link": "https://www.markets.news/headlines/96eb3863-bce6-417f-86c6-44cf13f40e08",
            "pub_date": "2026-02-27 06:53:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}