{
    "data": [
        {
            "title": "Berkshire Hathaway to release Q4 financial results with revenue estimated at $92.91 billion. Greg Abel's first shareholder letter.",
            "id": "99ad1719-9624-4d9a-9860-6422835a59f3",
            "description": "Berkshire Hathaway Inc is set to announce fourth-quarter financial results, the first without Warren Buffett as CEO. Analysts estimate revenue of $92.91 billion, slightly down from the previous year. The company has a track record of beating revenue estimates. In the previous quarter, operating earnings were up 34% year-over-year, attributed to insurance profit gains. The market awaits to see if the insurance segment will again lead with strong profits. The financial results and shareholders' letter by new CEO Greg Abel will be released on Feb. 28. Investors anticipate Abel's plans for the company's over $300 billion in idle funds. Buffett's shareholder letter usually included insights on the market and investing.",
            "link": "https://www.markets.news/headlines/99ad1719-9624-4d9a-9860-6422835a59f3",
            "pub_date": "2026-02-28 02:24:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI raises $110B from Amazon, Nvidia, SoftBank, with Amazon investing $50B, resulting in Amazon stock growth.",
            "id": "2710dcfe-b501-4b0b-93d6-966bd89d4427",
            "description": "Following the announcement of an investment of $50 billion by Amazon into OpenAI, the stock of Amazon saw an increase. OpenAI raised a total of $110 billion from various sources, including Amazon, Nvidia, and SoftBank. This investment has led to an expansion of the partnership between OpenAI and AWS.",
            "link": "https://www.markets.news/headlines/2710dcfe-b501-4b0b-93d6-966bd89d4427",
            "pub_date": "2026-02-28 02:24:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novos Power and WearableDose win FedTech's 2026 Crucible competition at Warfighting Innovation Summit.",
            "id": "6aa61679-5c90-4c21-908a-cf88f88fe68c",
            "description": "In La Quinta, California on February 27, 2026, FedTech, a prominent company specializing in deep tech commercialization and defense innovation, has revealed the champions of its 2026 Crucible Ignitor and Accelerator pitch contests during the first-ever Warfighting Innovation Summit conducted this month.",
            "link": "https://www.markets.news/headlines/6aa61679-5c90-4c21-908a-cf88f88fe68c",
            "pub_date": "2026-02-28 02:24:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e25b182b-e273-4315-b367-66223b9cbd89",
            "description": "IAEA: FIFTH LOCAL CEASEFIRE NEGOTIATED BY IAEA BETWEEN UKRAINE AND RUSSIAN FEDERATION COMMENCED ON FRIDAY",
            "link": "https://www.markets.news/headlines/e25b182b-e273-4315-b367-66223b9cbd89",
            "pub_date": "2026-02-28 02:26:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1c9d83c0-601c-4eb7-8f82-ef83a83aa594",
            "description": "SENATORS ASK PENTAGON, ANTHROPIC TO RESOLVE DISPUTE: AXIOS",
            "link": "https://www.markets.news/headlines/1c9d83c0-601c-4eb7-8f82-ef83a83aa594",
            "pub_date": "2026-02-28 02:12:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "47421e0e-c7e2-4741-9fd1-fbc5c0517f7f",
            "description": "UK TREASURY ON COURSE FOR £40 BLN WINDFALL FROM STUDENT LOAN INTEREST – TELEGRAPH",
            "link": "https://www.markets.news/headlines/47421e0e-c7e2-4741-9fd1-fbc5c0517f7f",
            "pub_date": "2026-02-28 02:16:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d92a09eb-a31e-406b-9bbf-dfd347c8b686",
            "description": "TOP SENATE DEFENSE LEADERS INTERVENE IN PENTAGON-ANTHROPIC AI DISPUTE - AXIOS",
            "link": "https://www.markets.news/headlines/d92a09eb-a31e-406b-9bbf-dfd347c8b686",
            "pub_date": "2026-02-28 02:16:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "424cdef9-daad-466a-83df-fa7bf17649a1",
            "description": "10 counterparties take $16.318b at the Fed reverse repo operation.",
            "link": "https://www.markets.news/headlines/424cdef9-daad-466a-83df-fa7bf17649a1",
            "pub_date": "2026-02-28 02:16:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nutrien files 2025 annual disclosures with updates on strategy; available on SEC and SEDAR websites.",
            "id": "e69d1bd9-5ab9-4118-99ef-134d1f182191",
            "description": "In the city of Saskatoon, Saskatchewan, Nutrien Ltd. (TSX and NYSE: NTR) released its 2025 Annual Report, comprising Management's Discussion and Analysis and Audited Consolidated Financial Statements, in addition to its Annual Information Form. These documents can be accessed on the US Securities and Exchange Commission's website at www.sec.gov and the Canadian Securities Administrators' website at www.sedarplus.ca. The 2025 Annual Report details Nutrien’s strategy and financial status for the year.",
            "link": "https://www.markets.news/headlines/e69d1bd9-5ab9-4118-99ef-134d1f182191",
            "pub_date": "2026-02-28 02:17:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp client creates Christmas decor accessory - Christmas Ornament Swathe/Wrap, simplifies decorating trees.",
            "id": "bb5c1604-ae22-4a6d-97a7-70afdc6ea91f",
            "description": "An inventor from Atlanta, Georgia, shared their inspiration behind creating a new product in Pittsburgh on February 27, 2026. The inventor introduced THE CHRISTMAS ORNAMENT SWATHE/WRAP as a convenient solution for decorating Christmas trees. This innovative design aimed to simplify the process of hanging ornaments, reducing the time and effort involved in the task. The inventor expressed the desire to offer a practical and easy solution for adorning trees during the holiday season, highlighting the benefits of their creation.",
            "link": "https://www.markets.news/headlines/bb5c1604-ae22-4a6d-97a7-70afdc6ea91f",
            "pub_date": "2026-02-28 02:18:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Anthropic faces 5 p.m. DOD deadline, Pentagon open to talks regarding military use of AI models.",
            "id": "e15b498a-0de0-40c2-9fcd-b717c6844225",
            "description": "Anthropic and the Department of Defense are currently in a dispute over the specific guidelines dictating the military's utilization of its AI models. Anthropic has a deadline set at 5 p.m. to address the concerns raised by the Pentagon. The Pentagon has expressed willingness to engage in discussions to resolve the issue and reach a mutual agreement on the matter.",
            "link": "https://www.markets.news/headlines/e15b498a-0de0-40c2-9fcd-b717c6844225",
            "pub_date": "2026-02-28 02:20:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netflix stock rises after abandoning bid for Warner Bros. Discovery, analysts praise move.",
            "id": "d3424809-e479-4f69-96b9-6ffdf45fcb55",
            "description": "On Friday, Netflix's stock saw a significant increase following the company's decision to withdraw its expensive offer to acquire the studio and streaming divisions of Warner Bros. Discovery. Analysts believe that Netflix made a wise move by backing out of the deal. The news was covered by Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/d3424809-e479-4f69-96b9-6ffdf45fcb55",
            "pub_date": "2026-02-28 02:20:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump Media's social media spinoff failed to boost stock, reported by Investor's Business Daily on Friday.",
            "id": "6ff40ce9-5434-45b9-9085-861dbe6e8463",
            "description": "News on Friday failed to boost Trump Media's stock. The company continues to evolve with the launch of a new social media platform. The stock price remains unchanged following the announcement.",
            "link": "https://www.markets.news/headlines/6ff40ce9-5434-45b9-9085-861dbe6e8463",
            "pub_date": "2026-02-28 02:20:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fears of AI bubble likened to dot-com crash, caution advised. Watch for signs like inflated valuations. (Please note that exact character count may vary slightly depending on spacing and formatting)",
            "id": "b815b20a-f814-431f-9982-d0d5df52e24d",
            "description": "There are concerns that an artificial intelligence (AI) bubble may be forming, reminiscent of the dot-com era that caused a stock market crash. Investors are being advised on what signals to observe indicating a potential burst. The comparison draws attention to the risks associated with fast-growing tech trends. The lessons learned from the dot-com bubble are cited as a cautionary tale to prevent a similar market downturn. It is essential to monitor key indicators to anticipate and manage any potential fallout from the AI sector in the financial markets.",
            "link": "https://www.markets.news/headlines/b815b20a-f814-431f-9982-d0d5df52e24d",
            "pub_date": "2026-02-28 02:20:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lear Investment Management wins Zephyr/PSN \"Manager of the Decade\" award, showcasing exceptional performance.",
            "id": "63f28e11-f863-43cc-944f-d7c19c0472df",
            "description": "In Dallas on February 27, 2026, Lear Investment Management, known for its strategic approach and flexibility, has been honored with the prestigious title of Zephyr/PSN Manager of the Decade. This award acknowledges the firm's exceptional performance in the financial market, particularly in its Global Vigilance Conservative strategy.",
            "link": "https://www.markets.news/headlines/63f28e11-f863-43cc-944f-d7c19c0472df",
            "pub_date": "2026-02-28 02:06:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "54d38bd6-4e7b-4817-bc9f-942087842d61",
            "description": "TRUMP: WE'RE HAVING TREMENDOUS LUCK WITH OIL",
            "link": "https://www.markets.news/headlines/54d38bd6-4e7b-4817-bc9f-942087842d61",
            "pub_date": "2026-02-28 02:08:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "McLean & Company announces Shawn Kanungo as keynote for Signature 2026 HR Conference in Las Vegas on October 4-6, 2026.",
            "id": "eac1da3f-349b-4eb3-a90a-a2f33c33dd8a",
            "description": "Renowned innovation strategist and bestselling author Shawn Kanungo has been selected as the keynote speaker for Signature 2026, the premier HR conference organized by McLean & Company. The event is scheduled to be held from October 4 to 6, 2026, at the Virgin Hotels Las Vegas. Kanungo, a globally recognized figure, is known for his dynamic presentations and expertise in the field of innovation. This significant announcement highlights the prestigious lineup of speakers and events planned for the conference, which is expected to draw a large audience of professionals and industry experts.",
            "link": "https://www.markets.news/headlines/eac1da3f-349b-4eb3-a90a-a2f33c33dd8a",
            "pub_date": "2026-02-28 02:08:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2c14aa1b-f59f-4143-b249-0a5d70edf052",
            "description": "TRUMP: WE'LL SEE WHAT HAPPENS WITH IRAN, WILL ALL WORK OUT WELL",
            "link": "https://www.markets.news/headlines/2c14aa1b-f59f-4143-b249-0a5d70edf052",
            "pub_date": "2026-02-28 02:09:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4a9215df-810a-418f-be4e-28d37d6663dc",
            "description": "TRUMP: PRICES OF GASOLINE ARE COMING WAY DOWN",
            "link": "https://www.markets.news/headlines/4a9215df-810a-418f-be4e-28d37d6663dc",
            "pub_date": "2026-02-28 02:09:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Surgery Partners set to release EPS of $0.29 on 2026-03-02, stock trading at $15.37, down 34.79% in past year.",
            "id": "620c5e3c-e21c-4363-bfa3-fc57943a7c42",
            "description": "Surgery Partners (NASDAQ: SGRY) is set to release its quarterly earnings, with analysts predicting an EPS of $0.29. Investors are hoping for positive news that exceeds estimates and provides guidance for the next quarter. Past earnings show a miss of $0.01 in the previous quarter, resulting in a 1.81% drop in share price. Shares were trading at $15.37 on February 26, with a 52-week decrease of 34.79%. The company's performance and stock prices can be significantly impacted by future projections rather than just historical data. For more details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/620c5e3c-e21c-4363-bfa3-fc57943a7c42",
            "pub_date": "2026-02-28 02:04:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}