{
    "data": [
        {
            "title": "",
            "id": "5d01a28b-1714-4a4f-8e98-6893140b08e5",
            "description": "Hillary Clinton: ‘I’m not gonna do it again, they had a chance to do it in public and I wish they did it in public,’",
            "link": "https://www.markets.news/headlines/5d01a28b-1714-4a4f-8e98-6893140b08e5",
            "pub_date": "2026-02-27 08:29:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dab4288a-109e-4304-80a9-9f2877760b4b",
            "description": "ALLIED NATIONS INCLUDING THE UNITED KINGDOM, CANADA, AND JAPAN BOUGHT A RECORD $463.9 BILLION IN US TREASURIES IN 2025 WHILE LESS-ALIGNED COUNTRIES SUCH AS CHINA, INDIA, AND BRAZIL CUT HOLDINGS BY $125.24 BILLION, SIGNALING A GEOPOLITICAL SHIFT IN DEMAND FOR US DEBT THAT COULD",
            "link": "https://www.markets.news/headlines/dab4288a-109e-4304-80a9-9f2877760b4b",
            "pub_date": "2026-02-27 08:29:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enrollment open for K12-powered virtual public schools in Indiana with state-certified teachers.",
            "id": "fd0c8896-9997-4844-bf21-f0c4371ee2c9",
            "description": "Families in Indiana have the opportunity to enroll in full-time virtual public schools that are powered by K12 and led by state-certified teachers. This option allows families to choose a virtual learning environment for their children, ensuring they receive instruction from qualified educators. The virtual public schools offer a comprehensive curriculum and support services to students, providing a quality educational experience. Families interested in enrolling can get more information and begin the process by contacting the school directly. This initiative provides families with the flexibility to access education in a virtual setting, offering an alternative to traditional brick-and-mortar schools.",
            "link": "https://www.markets.news/headlines/fd0c8896-9997-4844-bf21-f0c4371ee2c9",
            "pub_date": "2026-02-27 08:30:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "184af617-07bf-4871-979c-46769ad56545",
            "description": "US ENERGY SECRETARY WRIGHT SAYS VENEZUELAN OIL TO FLOW TO ASIA, EUROPE AND US GULF; ADDS INDIA EXPECTED TO EMERGE AS NEW BUYER",
            "link": "https://www.markets.news/headlines/184af617-07bf-4871-979c-46769ad56545",
            "pub_date": "2026-02-27 08:17:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI from Meta inundates child abuse investigators with excessive tips, delaying cases, as officials argue.",
            "id": "81e6d460-fc09-47ff-b784-152a60db0578",
            "description": "According to ICAC officials, the use of AI-generated reports is causing a slowdown in investigations as they are inundating investigators. Meta, however, has contested these assertions. This challenge is hindering the processing of cases as the sheer volume of AI-generated reports is overwhelming. The disagreement between ICAC officers and Meta highlights a significant issue in the investigative process. The exact number of cases affected and the extent of the slowdown caused by AI-generated reports has not been disclosed.",
            "link": "https://www.markets.news/headlines/81e6d460-fc09-47ff-b784-152a60db0578",
            "pub_date": "2026-02-27 08:18:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "20d0508f-5b94-434b-97c3-f71f1d2e3a39",
            "description": "VENEZUELA SUSPENDS 19 PRODUCTION-SHARING CONTRACTS SIGNED UNDER MADURO PENDING REVISION; U.S. AND VENEZUELAN GOVERNMENTS TO REVIEW DEALS AND MAY REVOKE SOME, BUT OIL OUTPUT REMAINS UNAFFECTED — INDUSTRY SOURCES SAY.",
            "link": "https://www.markets.news/headlines/20d0508f-5b94-434b-97c3-f71f1d2e3a39",
            "pub_date": "2026-02-27 08:19:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dfc8369f-2835-4d3c-88c8-82f68780e6f1",
            "description": "ASIAN STOCKS ARE SET TO DIP AFTER NVIDIA CORP.’S SHARP DECLINE WEIGHED ON WALL STREET, THOUGH THE REGION REMAINS ON TRACK TO OUTPERFORM US MARKETS AMID STRONG EMERGING-MARKET FLOWS AND AI SUPPLY-CHAIN DEMAND.",
            "link": "https://www.markets.news/headlines/dfc8369f-2835-4d3c-88c8-82f68780e6f1",
            "pub_date": "2026-02-27 08:19:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "80e03caf-1957-4be7-9248-0576ed2392b7",
            "description": "GOLD HOLDS NEAR $5,185 AN OUNCE AS THE US AND IRAN EXTEND NUCLEAR TALKS, KEEPING GEOPOLITICAL RISKS ELEVATED WHILE TEMPERING IMMEDIATE CONFLICT FEARS.",
            "link": "https://www.markets.news/headlines/80e03caf-1957-4be7-9248-0576ed2392b7",
            "pub_date": "2026-02-27 08:11:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stellus Capital Investment Corp to report Q4 and 2025 financial results on March 11, 2026 after market close. NYSE: SCM.",
            "id": "fbae9275-0416-48c0-bd9d-e2a43b9cd233",
            "description": "Stellus Capital Investment Corporation (NYSE: SCM) is set to announce its financial results for the fourth quarter and full year, ending on December 31, 2025. The report is scheduled for release on Wednesday, March 11, 2026, following the closing of the stock market. Investors and stakeholders can anticipate gaining insights into the company's performance during this period.",
            "link": "https://www.markets.news/headlines/fbae9275-0416-48c0-bd9d-e2a43b9cd233",
            "pub_date": "2026-02-27 08:11:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dcf51289-d3e6-4281-9b37-7bc4536fb8c1",
            "description": "OIL STEADIES WITH WTI NEAR $65 AND BRENT BELOW $71 AS MARKETS WEIGH FRESH US-IRAN NUCLEAR TALKS AMID A LARGE US MILITARY BUILD-UP IN THE MIDDLE EAST THAT CONTINUES TO SUPPORT A GEOPOLITICAL RISK PREMIUM.",
            "link": "https://www.markets.news/headlines/dcf51289-d3e6-4281-9b37-7bc4536fb8c1",
            "pub_date": "2026-02-27 08:13:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block, parent company of Square, is cutting 40% of staff due to AI. CEO predicts other companies will do the same.",
            "id": "9858a3ea-ab1c-4c01-ac07-06ec5843a441",
            "description": "The parent company of Square, known as Block, is planning to reduce its workforce by 40%. CEO Jack Dorsey attributed this decision to the implementation of AI tools and forecasts that a majority of companies will also undergo similar downsizing within the next year. This move by Block has been described as part of a larger trend in which automation and technology are leading to significant job cuts across various industries.",
            "link": "https://www.markets.news/headlines/9858a3ea-ab1c-4c01-ac07-06ec5843a441",
            "pub_date": "2026-02-27 08:13:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros. chooses Paramount's offer over Netflix, causing Netflix stock to surge.",
            "id": "9ab85233-d446-42ce-944e-f113601028da",
            "description": "Netflix has decided to withdraw its bid for Warner Bros. Discovery after learning that the company favored a modified offer from Paramount. Following this news, Netflix's stock experienced a significant surge overnight, indicating investor optimism. This shift in preference resulted in a positive reaction from the market, boosting Netflix's stock value.",
            "link": "https://www.markets.news/headlines/9ab85233-d446-42ce-944e-f113601028da",
            "pub_date": "2026-02-27 08:13:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ACM Research stock falls on Q4 earnings miss, missing expectations; stock tumbles after earnings report.",
            "id": "add3d9cc-e509-45b9-9233-7b59b51a4ee4",
            "description": "ACM Research reported significantly lower earnings than expected in the fourth quarter, causing a substantial drop in ACMR stock price. The company's poor financial performance led to a decline in investor confidence, resulting in a notable decrease in stock value. The post titled \"ACM Research Stock Tumbles On Q4 Earnings Miss\" highlighted the impact of this underperformance on Investor's Business Daily platform.",
            "link": "https://www.markets.news/headlines/add3d9cc-e509-45b9-9233-7b59b51a4ee4",
            "pub_date": "2026-02-27 08:13:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0184c273-3512-4d59-9d2c-33f7d5f6798a",
            "description": "OPENAI INC. TOLD CANADIAN LAWMAKERS IT WOULD NOW REFER A BANNED CHATGPT USER TO POLICE UNDER UPDATED PROTOCOLS AFTER FAILING TO DETECT A SECOND ACCOUNT LINKED TO A SUSPECT IN THE TUMBLER RIDGE MASS SHOOTING, AND SAID IT WILL STRENGTHEN DETECTION SYSTEMS AND DIRECT LAW ENFORCEMENT",
            "link": "https://www.markets.news/headlines/0184c273-3512-4d59-9d2c-33f7d5f6798a",
            "pub_date": "2026-02-27 08:14:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8b587b76-10ad-462e-9450-bc942806d91f",
            "description": "NETFLIX DECLINES TO RAISE OFFER FOR WARNER BROS DISCOVERY, SAYS DEAL NO LONGER FINANCIALLY ATTRACTIVE AND WILL NOT MATCH PARAMOUNT SKYDANCE BID; PLANS $20B CONTENT SPEND THIS YEAR AND TO RESUME SHARE BUYBACK PROGRAMME",
            "link": "https://www.markets.news/headlines/8b587b76-10ad-462e-9450-bc942806d91f",
            "pub_date": "2026-02-27 08:16:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Venture Global partners with Hanwha of Korea for 1.5 MTPA LNG, boosting long-term business prospects.",
            "id": "f8e1d023-238f-4db4-bfe0-895616916f9d",
            "description": "Venture Global has revealed a new long-term liquefied natural gas (LNG) agreement with South Korea's Hanwha, securing 1.5 million tons per annum (MTPA) of LNG. This partnership signifies a significant step forward in the global LNG market and signals a promising future for both companies involved.",
            "link": "https://www.markets.news/headlines/f8e1d023-238f-4db4-bfe0-895616916f9d",
            "pub_date": "2026-02-27 08:06:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "926e66ec-8de8-4bc0-ac83-c5b601112e19",
            "description": "FEDERAL RESERVE MOUNTS CLOSED-DOOR FIGHT AGAINST DOJ SUBPOENAS; US ATTORNEY JEANINE PIRRO INVESTIGATING POWELL’S TESTIMONY LAST SUMMER ON BUILDING RENOVATIONS – WSJ",
            "link": "https://www.markets.news/headlines/926e66ec-8de8-4bc0-ac83-c5b601112e19",
            "pub_date": "2026-02-27 08:06:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "cbc0455d-b3d8-438e-877a-267de59af201",
            "description": "COREWEAVE INC. SHARES SLID AS MUCH AS 13% AFTER REPORTING A WIDER-THAN-EXPECTED LOSS AND PROJECTING $30–$35 BILLION IN 2026 CAPITAL SPENDING, RAISING INVESTOR CONCERNS ABOUT HEAVY DEBT-FUELED AI INFRASTRUCTURE EXPANSION DESPITE STRONG REVENUE GUIDANCE AND BACKING FROM NVIDIA",
            "link": "https://www.markets.news/headlines/cbc0455d-b3d8-438e-877a-267de59af201",
            "pub_date": "2026-02-27 08:07:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e7d6c7e6-c0fe-4766-bf6e-c6e8fc615714",
            "description": "UK LLOYDS BUSINESS BAROMETER FEB 44 (EST 46; PREV 44); LLOYDS OWN PRICE EXPECTATIONS 65 (PREV 62)",
            "link": "https://www.markets.news/headlines/e7d6c7e6-c0fe-4766-bf6e-c6e8fc615714",
            "pub_date": "2026-02-27 08:10:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Intuit Inc's Q2 revenue beats analyst estimates at $4.65 billion; stock slides despite adjusted earnings of $4.15/share.",
            "id": "60516360-662b-4caa-b551-05c2206286c4",
            "description": "Intuit Inc (NASDAQ: INTU) revealed its second-quarter fiscal 2026 financial results after the market closed on Thursday. The company reported revenue of $4.65 billion, surpassing analyst estimates of $4.53 billion. Intuit, which owns QuickBooks, Credit Karma, and TurboTax, also posted adjusted earnings of $4.15 per share for the second quarter, exceeding analyst expectations of $3.66 per share. Total revenue saw a 17% increase. Despite the positive results, INTU stock is currently experiencing a decline in value. Further details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/60516360-662b-4caa-b551-05c2206286c4",
            "pub_date": "2026-02-27 08:10:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}