{
    "data": [
        {
            "title": "Honest Health secures $140M from NewSpring for advancing value-based care, reflecting increased demand for their services.",
            "id": "edbc2b41-e4e5-4503-a39d-7860743ebfbe",
            "description": "In Nashville, Tennessee on February 26, 2026, Honest Health revealed a recent capital raise of $140 million. The fundraising was spearheaded by NewSpring Healthcare, a specialized branch of NewSpring that collaborates with forward-thinking healthcare enterprises. This significant investment signifies the increasing need for Honest Health's services in the healthcare industry.",
            "link": "https://www.markets.news/headlines/edbc2b41-e4e5-4503-a39d-7860743ebfbe",
            "pub_date": "2026-02-26 21:46:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Great American Media announces third installment of A Prince In Paradise film series, 'A Prince In Paradise: A Royal Wedding', starring Rhiannon Fish and Mitchell Bourke, set for 2026 premiere, produced by Nicely Entertainment with returning team and director Adrian Powers.",
            "id": "a2df7fa4-8070-432d-8770-79d574d086f2",
            "description": "Production has commenced for the third installment of \"A Prince In Paradise: A Royal Wedding,\" set for a premiere in 2026. The storyline revolves around a royal wedding facing obstacles from an ancient law and political resistance. The project is being produced by Nicely Entertainment, with the same creative team and director Adrian Powers returning. The news was announced in New York on February 26, 2026.",
            "link": "https://www.markets.news/headlines/a2df7fa4-8070-432d-8770-79d574d086f2",
            "pub_date": "2026-02-26 21:46:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4e2c5b3b-e377-4399-88dd-c23204bd6cd9",
            "description": "IRAN: TALKS WERE INTENSE, 'VERY' SERIOUS WITH US IN GENEVA",
            "link": "https://www.markets.news/headlines/4e2c5b3b-e377-4399-88dd-c23204bd6cd9",
            "pub_date": "2026-02-26 21:47:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3941572c-60ae-4ee7-b5c6-2b04566308e7",
            "description": "Air defense forces shot down two drones flying toward Moscow- reports",
            "link": "https://www.markets.news/headlines/3941572c-60ae-4ee7-b5c6-2b04566308e7",
            "pub_date": "2026-02-26 21:47:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hilton Grand Vacations Q4 earnings missed estimates by -20.72%, with EPS of $0.88 (vs $1.11). Revenue rose by $110 million.",
            "id": "a1a431ed-839b-4b6e-8d05-76073fbd72ec",
            "description": "On Thursday, February 26, 2026, Hilton Grand Vacations (NYSE: HGV) released its Q4 earnings report at 07:30 AM. The results showed that the company missed estimated earnings by -20.72% with an EPS of $0.88, falling short of the expected $1.11. Additionally, revenue increased by $110.00 million compared to the previous year. For more in-depth information on this announcement, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/a1a431ed-839b-4b6e-8d05-76073fbd72ec",
            "pub_date": "2026-02-26 21:47:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TORM Q4 earnings disappointed, EPS $0.88 (est. $0.94), revenue up $47.20M year-over-year. More on Benzinga.",
            "id": "4e341cc6-ce4a-4624-b03b-cd2945a9eef4",
            "description": "TORM (NASDAQ: TRMD) unveiled its Q4 earnings report on February 26, 2026, at 08:00 AM. The report revealed a miss on estimated earnings by -6.38%, with an EPS of $0.88 compared to the expected $0.94. The revenue showed a significant increase of $47.20 million from the previous year. For more details on the historical earnings summary and other related information, the full story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/4e341cc6-ce4a-4624-b03b-cd2945a9eef4",
            "pub_date": "2026-02-26 21:47:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b85e1cd0-9d22-47ab-bc03-04e756ddf121",
            "description": "RUSSIAN FOREIGN MINISTRY: EU'S AMBITION TO TAKE PART IN UKRAINE NEGOTIATIONS DO NOT HAVE ANY GROUNDS",
            "link": "https://www.markets.news/headlines/b85e1cd0-9d22-47ab-bc03-04e756ddf121",
            "pub_date": "2026-02-26 21:47:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ELLA™ AI in clinical research receives IRB exemption, sets new ethical standard. Ethical support for trial participants.",
            "id": "ba1f1b24-a3f2-405d-9849-edde95d4750e",
            "description": "In New York, SOGLIA™, a Patient Experience Organization, has introduced ELLA™, an emotionally intelligent AI health advocate operating on the E1™ platform. This AI has obtained an Institutional Review Board (IRB) exemption, indicating compliance with federal guidelines for supporting clinical research ethically. ELLA™ can assist in trial recruitment by providing information and prescreening participants, enhancing how individuals engage with clinical trials.",
            "link": "https://www.markets.news/headlines/ba1f1b24-a3f2-405d-9849-edde95d4750e",
            "pub_date": "2026-02-26 21:48:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8a560eb9-cf21-4b62-b879-5643002ea13b",
            "description": "RUSSIAN FOREIGN MINISTRY SAYS WE CONSIDER THIS MEASURE AS DISCRIMINATORY",
            "link": "https://www.markets.news/headlines/8a560eb9-cf21-4b62-b879-5643002ea13b",
            "pub_date": "2026-02-26 21:49:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "814a8295-3750-4ebe-be42-18b8345ad5ee",
            "description": "Iran fm spokesperson: ‘Negotiations will continue at 5:30 local time The negotiations were intensive and serious since morning. Both delegations have left the venue about an hour ago. The negotiations will resume around 5:30 local time. Very important and practical proposals",
            "link": "https://www.markets.news/headlines/814a8295-3750-4ebe-be42-18b8345ad5ee",
            "pub_date": "2026-02-26 21:49:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MaxLinear to showcase Sierra radio SoC at MWC Barcelona 2026 for FDD Massive MIMO with PIM cancellation, offering compact, cost-effective O-RUs.",
            "id": "0dabe4e9-491e-47e4-9375-2b2e086b00b7",
            "description": "At the upcoming Mobile World Congress in Barcelona, MaxLinear is set to showcase its Sierra single-chip radio System on a Chip (SoC) integrated with PIM cancellation technology. This innovative solution aims to facilitate the creation of compact and affordable Frequency Division Duplex (FDD) Massive Multiple Input Multiple Output (MIMO) Remote Units (O-RUs) supporting 5G networks. This development signifies a significant step towards enhanced efficiency and performance in the telecommunications industry.",
            "link": "https://www.markets.news/headlines/0dabe4e9-491e-47e4-9375-2b2e086b00b7",
            "pub_date": "2026-02-26 21:40:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Texas A&M Engineering Experiment Station partners with ZettaJoule to explore building a research reactor in College Station, TX, aiming to catalyze up to $1 billion in collaborations, partnerships, and federal funding.",
            "id": "49090e8e-97b0-4215-8a9a-c6853854b204",
            "description": "In College Station, Texas, the Texas A&M Engineering Experiment Station (TEES) has partnered with ZettaJoule, a small modular reactor company, to consider constructing a cutting-edge research reactor in the area. This collaboration could spark around $1 billion in research partnerships, industrial collaborations, and governmental funding opportunities over the next ten years. This initiative aims to establish Texas A&M Engineering as a leader in the field.",
            "link": "https://www.markets.news/headlines/49090e8e-97b0-4215-8a9a-c6853854b204",
            "pub_date": "2026-02-26 21:40:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Perfect Corp. partners with True Beauty Lashes to launch LashLovr™, a personalized lash recommendation experience using Virtual Try-On APIs.",
            "id": "f6e816b1-2e29-4d6c-aa2e-b02f81fb2fff",
            "description": "In New York, Perfect Corp., a top player in AI and AR beauty and fashion tech, has teamed up with True Beauty Lashes for a new venture. This collaboration gave birth to LashLovr, a unique platform offering a tailored false lash matching and virtual try-on experience. Utilizing Perfect Corp.'s innovative Virtual Try-On and Face Analyzer APIs, LashLovr enables users to instantly see how recommended lashes look on them in real time. This move is set to revolutionize how customers explore and purchase false lashes.",
            "link": "https://www.markets.news/headlines/f6e816b1-2e29-4d6c-aa2e-b02f81fb2fff",
            "pub_date": "2026-02-26 21:40:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US stock futures fluctuated on Thursday; jobless claims rose to 212,000. Dow Jones +0.23%, S&P 500 +0.05%, Nasdaq -0.05%. Nvidia up 1.28% due to strong financials; Salesforce drops 3.94%. Fed likely to keep interest rates unchanged in March.",
            "id": "24a82aae-ff4b-4db3-8da0-b06ea7fad2bc",
            "description": "U.S. stock futures fluctuated on Thursday following a previous day's rise, with major benchmark indices showing mixed performance. Weekly jobless claims increased by 4,000 to 212,000 for the week ending Feb. 21. The four-week moving average rose slightly to 220,250, indicating a stable labor market despite cooling economic signals. The 10-year Treasury bond yielded 4.05%, with the two-year bond at 3.47%. The CME Group's FedWatch tool projected a 98% chance of the Federal Reserve keeping interest rates steady in March. Key index performances were Dow Jones +0.23%, S&P 500 +0.05%, Nasdaq 100 -0.05%, and Russell 2000 +0.26%. Pre-market, the SPDR S&P 500 ETF Trust (SPY) rose 0.081% to $693.71, while the Invesco QQQ Trust ETF (QQQ) increased 0.036% to $616.64. Nvidia (NVDA) surged 1.28% after posting strong Q4 results, with Salesforce (CRM) declining 3.94%.",
            "link": "https://www.markets.news/headlines/24a82aae-ff4b-4db3-8da0-b06ea7fad2bc",
            "pub_date": "2026-02-26 21:40:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "45831858-9edf-41b1-b6e4-045ecf256a39",
            "description": "SENIOR IRANIAN OFFICIAL: TALKS RAISED NEW IDEAS THAT REQUIRE CONSULTATION WITH TEHRAN, SOME GAPS REMAIN.",
            "link": "https://www.markets.news/headlines/45831858-9edf-41b1-b6e4-045ecf256a39",
            "pub_date": "2026-02-26 21:40:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c15310bd-a43c-4179-ab5d-bbba23a8937c",
            "description": "Senior Iranian official to sources: Reaching a deal framework possible if the US is 'seriously separates nuclear and non-nuclear issues’",
            "link": "https://www.markets.news/headlines/c15310bd-a43c-4179-ab5d-bbba23a8937c",
            "pub_date": "2026-02-26 21:40:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "376e2230-b713-4cfe-80eb-8e286c3f8799",
            "description": "SENIOR IRANIAN OFFICIAL : TALKS WITH U.S. IN GENEVA HAVE BEEN INTENSE AND SERIOUS.",
            "link": "https://www.markets.news/headlines/376e2230-b713-4cfe-80eb-8e286c3f8799",
            "pub_date": "2026-02-26 21:41:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OneMedNet and ViuHealth collaborate to boost autoimmune dataset scale to drive recurring revenue from life sciences and AI clients.",
            "id": "2693f659-b506-49cf-9259-d22f43fafc3d",
            "description": "OneMedNet has collaborated with ViuHealth to boost the scale of their autoimmune dataset, which will facilitate faster growth in recurring revenue from life sciences and AI clients. This partnership aims to leverage ViuHealth's expertise to enhance the dataset's capabilities, ultimately benefiting from increased revenue streams. The alliance is expected to significantly increase the dataset's capacity, attracting more customers from the life sciences and AI sectors.",
            "link": "https://www.markets.news/headlines/2693f659-b506-49cf-9259-d22f43fafc3d",
            "pub_date": "2026-02-26 21:41:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Standard Motor Products (SMP) beats Q4 estimated earnings by 19.15%, reports EPS of $0.56. Revenue up $41.74M from last year.",
            "id": "6416cd5e-4ae2-4061-94d9-67d1842008a5",
            "description": "On Thursday, February 26, 2026 at 08:30 AM, Standard Motor Products (NYSE: SMP) released its Q4 earnings report. The company exceeded estimated earnings by 19.15%, recording an EPS of $0.56 compared to the expected $0.47. Revenue saw a significant increase of $41.74 million compared to the previous year. In the latest quarter, Standard Motor Products outperformed again. For further details, the complete news article can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/6416cd5e-4ae2-4061-94d9-67d1842008a5",
            "pub_date": "2026-02-26 21:41:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere Energy Partners released Q4 earnings: EPS beat estimate by 120.37% at $2.38, revenue up $450 million.",
            "id": "c0c123db-7023-472d-999e-91713628ca7e",
            "description": "Cheniere Energy Partners (NYSE: CQP) announced its Q4 earnings on February 26, 2026, at 07:30 AM. The key updates from the earnings report indicate surpassing estimated earnings significantly by 120.37%, with an EPS of $2.38 compared to the predicted $1.08. Additionally, revenue saw an increase of $450.00 million year-over-year. In previous quarters, the company had fallen short on EPS. For a detailed account of this news, please refer to the complete article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/c0c123db-7023-472d-999e-91713628ca7e",
            "pub_date": "2026-02-26 21:41:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}