{
    "data": [
        {
            "title": "1stdibs.com (NASDAQ: DIBS) upcoming earnings report with EPS estimate of $-0.04. Shares priced at $5.5. Performance history included.",
            "id": "794dbc89-e379-42f7-961a-bbd6032a3a54",
            "description": "1stdibs.com (NASDAQ: DIBS) is set to release its quarterly earnings report on February 27, 2026. Analysts predict an earnings per share (EPS) of $-0.04. In the previous quarter, the company exceeded EPS expectations by $0.03, resulting in a 0.0% drop in share price the following day. Over the past year, shares have risen, with the current trading price at $5.5. Investors are hoping for positive guidance and forecasted growth in the upcoming announcement, as this can significantly impact stock prices. Performance data from past quarters shows fluctuations in EPS estimates and actual numbers, as well as corresponding price changes. For more details, refer to the full article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/794dbc89-e379-42f7-961a-bbd6032a3a54",
            "pub_date": "2026-02-27 00:04:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hydro-Québec's net income reached $2.9 billion (up 9%), investments in Québec were $7.8 billion, contributing $26.1 billion to GDP.",
            "id": "1fdca639-e3d5-4575-8d2a-732950100add",
            "description": "In Montreal, on February 26, 2026, Hydro-Québec unveiled its Annual Report for 2025 showcasing strong financial results. The net income surged to $2.9 billion, marking a notable increase of 9% compared to the previous year, with investments within Quebec amounting to $7.8 billion. The company played a significant role in the economy by contributing $26.1 billion to Quebec's GDP. Despite facing challenges due to consistently low runoff levels since 2023, Hydro-Québec successfully implemented a robust sales strategy in external markets and efficiently managed its energy reserves, including its 28 major reservoirs often referred to as natural batteries. These measures allowed the company to sustain its operations...Find the complete article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/1fdca639-e3d5-4575-8d2a-732950100add",
            "pub_date": "2026-02-27 00:04:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "5d1b1a66-d336-4875-b5f2-1d0e3bc65ee5",
            "description": "GOOGLE: INTRODUCING NANO BANANA TWO WHICH BRINGS HIGH-FIDELITY IMAGE GENERATION AND FASTER, ADVANCED EDITING TO NEW FLASH MODEL - BLOG",
            "link": "https://www.markets.news/headlines/5d1b1a66-d336-4875-b5f2-1d0e3bc65ee5",
            "pub_date": "2026-02-27 00:04:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ESI and Acrisure launch Campio™ offering new insurance solutions for credit unions. Feb. 26, 2026.",
            "id": "1f840fc9-6803-4890-adab-f8fdf6706bff",
            "description": "A new fidelity bond offering and additional insurance solutions for credit unions were introduced by Campio™, a collaboration between Excess Share Insurance Corporation (ESI) based in Ohio and Acrisure, a prominent global fintech leader. The announcement was made on Feb. 26, 2026, in Dublin, Ohio, and Grand Rapids, Michigan.",
            "link": "https://www.markets.news/headlines/1f840fc9-6803-4890-adab-f8fdf6706bff",
            "pub_date": "2026-02-27 00:05:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Essential Income 5 DST fully subscribed as investor demand for REIT fast-track strategies soars.",
            "id": "58f18de6-1d23-4cc4-a3da-d01b8976b04e",
            "description": "ExchangeRight, based in Pasadena, California, has reported that Essential Income 5 DST has been fully subscribed due to high investor interest in REIT fast-track investment options.",
            "link": "https://www.markets.news/headlines/58f18de6-1d23-4cc4-a3da-d01b8976b04e",
            "pub_date": "2026-02-27 00:05:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RatedPower releases 2026 Global Renewable Energy Trends Report with insights from 100+ professionals and data from 64,000 projects.",
            "id": "922c7dbc-ee4f-4b4a-ad74-a623f91c1839",
            "description": "In its recent announcement on February 26, 2026, in Madrid, RatedPower, a subsidiary of Enverus, the prominent energy data analytics platform, unveiled its newest edition. This edition incorporates input from over 100 energy experts and data sourced from a staggering 64,000+ solar and storage design undertakings spanning five years.",
            "link": "https://www.markets.news/headlines/922c7dbc-ee4f-4b4a-ad74-a623f91c1839",
            "pub_date": "2026-02-27 00:05:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Coast Plaza appoints Tenley Zinke as Executive Director of Marketing, replacing Debra Gunn Downing after her 27-year tenure. Zinke joins after roles at Kering, LVMH, Tiffany & Co., Net-a-Porter, and Ralph Lauren.",
            "id": "7ddfe0ed-c6ee-411c-978e-7aad357a0507",
            "description": "Costa Mesa, California - South Coast Plaza has named Tenley Zinke as the new Executive Director of Marketing, taking over from Debra Gunn Downing who will be retiring after an impressive 27 years at the firm. Zinke brings a wealth of experience in marketing and communications from her previous roles at major luxury fashion and retail companies like Kering, LVMH, Tiffany & Co., Net-a-Porter, and Ralph Lauren. With a strong emphasis on brand management, Zinke is set to lead the marketing initiatives at South Coast Plaza.",
            "link": "https://www.markets.news/headlines/7ddfe0ed-c6ee-411c-978e-7aad357a0507",
            "pub_date": "2026-02-27 00:05:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Buy Now Pay Later market to hit US$212.2 billion by 2033, driven by digital commerce and consumer preference shifts.",
            "id": "1b9788f6-bc83-4cff-8797-0b7981e787b4",
            "description": "In a recent report by Persistence Market Research, a prominent management consulting firm, an update on the buy now pay later (BNPL) market was provided. BNPL options are gaining popularity as they allow consumers to buy products or services immediately and pay off the expenses later. This payment method is becoming increasingly prevalent in the retail sector, with the market expected to reach significant numbers. The growth of the BNPL market underscores the shifting preferences of consumers towards more flexible and convenient payment solutions for making purchases.",
            "link": "https://www.markets.news/headlines/1b9788f6-bc83-4cff-8797-0b7981e787b4",
            "pub_date": "2026-02-27 00:05:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Join the Global AI Judging Panel at Globee Awards to evaluate real-world AI achievements across industries globally.",
            "id": "020cc4b1-de98-48c3-b6c9-9d2d16c2e391",
            "description": "Professionals in the field of Artificial Intelligence, along with business leaders and technology experts, have been invited to assess real-world AI advancements in various industries and operational settings on a global scale. This invitation comes from the Globee® Awards, known for recognizing excellence in different sectors. The event is set to take place in San Francisco on February 26, 2026. Organizers aim to showcase accomplishments and innovations in AI, demonstrating their impact and relevance across diverse industries.",
            "link": "https://www.markets.news/headlines/020cc4b1-de98-48c3-b6c9-9d2d16c2e391",
            "pub_date": "2026-02-27 00:05:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ec2b4e0e-1117-47f2-8d19-174e5f98e5e7",
            "description": "Kansas City Fed February 2026 Report",
            "link": "https://www.markets.news/headlines/ec2b4e0e-1117-47f2-8d19-174e5f98e5e7",
            "pub_date": "2026-02-27 00:05:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6c469084-cc64-4c14-9b87-ce83d8507540",
            "description": "TESLA, GERMAN LABOR UNION REACH OUT-OF-COURT AGREEMENT",
            "link": "https://www.markets.news/headlines/6c469084-cc64-4c14-9b87-ce83d8507540",
            "pub_date": "2026-02-26 23:57:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hut 8 Corp beats Q4 revenue with $89 million, analysts raise price target to $66. River Bend data center on track for early delivery.",
            "id": "3e982dd1-4ca7-46c0-bc64-bdc05a17b5b2",
            "description": "Hut 8 Corp (NASDAQ: HUT) recently released robust fourth-quarter results and expressed its commitment to reducing Bitcoin exposure. Needham analyst John Todaro showed confidence in Hut 8 by reiterating a Buy rating and increasing the price target from $60 to $66. The company surpassed revenue expectations by reaching $89 million, well above the estimated $64 million. The flagship AI data center campus, River Bend, is on track for completion with additional space and possible early completion. Explore more analyst ratings online.",
            "link": "https://www.markets.news/headlines/3e982dd1-4ca7-46c0-bc64-bdc05a17b5b2",
            "pub_date": "2026-02-26 23:57:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HateAid founders, a German group aiding online abuse victims, barred from U.S. accused of involvement in \"global censorship-industrial complex.\"",
            "id": "45a824e9-5095-4f58-a3a6-6321a69482be",
            "description": "The creators of HateAid, a German organization assisting individuals targeted by online abuse, have faced allegations from the Trump administration of being associated with a \"global censorship-industrial complex.\"",
            "link": "https://www.markets.news/headlines/45a824e9-5095-4f58-a3a6-6321a69482be",
            "pub_date": "2026-02-26 23:58:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8d75f2fd-556b-4b12-b89d-3039b0d6959c",
            "description": "Explosions heard in Dnipro- reports",
            "link": "https://www.markets.news/headlines/8d75f2fd-556b-4b12-b89d-3039b0d6959c",
            "pub_date": "2026-02-26 23:58:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NatGold Digital Ltd. closes Pre-Market Token Reservation Program as global demand reaches over US$469M.",
            "id": "4e53aa66-71a5-44ce-9ba5-9d4179e6de2f",
            "description": "On February 26, 2026, NatGold Digital Ltd. disclosed the completion of its Pre-Market Token Reservation Program after experiencing significant worldwide engagement before the Company's first tokenization event and market debut. This attracted a substantial number of participants globally.",
            "link": "https://www.markets.news/headlines/4e53aa66-71a5-44ce-9ba5-9d4179e6de2f",
            "pub_date": "2026-02-26 23:58:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Watercrest Senior Living partners with Inspiren to introduce AI-powered care for seniors, enhancing precision in care.",
            "id": "ba7ed80c-bb94-483b-8e0c-124f408a63ab",
            "description": "In Vero Beach, Florida, on February 26, 2026, Watercrest Senior Living Group announced their exciting collaboration with Inspiren, marking senior living's pioneering integration of AI technology. This partnership aims to enhance precision in senior living services by leveraging Inspiren's AI-powered ecosystem. This alliance signifies a significant advance in the industry, as it introduces cutting-edge technology to deliver top-notch care and support to seniors.",
            "link": "https://www.markets.news/headlines/ba7ed80c-bb94-483b-8e0c-124f408a63ab",
            "pub_date": "2026-02-26 23:58:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SDI Presence appoints George J. Sperekas II as Account Executive for Illinois SLED market. (Character count: 91)",
            "id": "4fd6432c-496f-49b2-8aae-8d0a756645a7",
            "description": "Experienced sales executive George J. Sperekas II has recently joined SDI Presence LLC as part of their team in Chicago on February 26, 2026. SDI is a prominent IT consultancy and managed services provider. In his new role, Sperekas will focus on enhancing growth within state, local government, and education sectors.",
            "link": "https://www.markets.news/headlines/4fd6432c-496f-49b2-8aae-8d0a756645a7",
            "pub_date": "2026-02-26 23:58:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Volvo Group releases 2025 Annual Report detailing product renewal and efficiency improvements across all business areas.",
            "id": "8036220d-0ad3-4a1a-8fc6-2f0832638e3e",
            "description": "The recently released 2025 Annual Report of Volvo Group is now available on their official website. The report highlights the company's sustained product renewal efforts throughout the year across all business sectors, focusing on developing more efficient products and solutions. Based in Gothenburg, Sweden, Volvo Group has emphasized creating value through their offerings. The report signifies the company's commitment to progress and innovation in its operations.",
            "link": "https://www.markets.news/headlines/8036220d-0ad3-4a1a-8fc6-2f0832638e3e",
            "pub_date": "2026-02-27 00:00:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vinita Gupta of Lupin named to 2026 CNBC Changemakers list for making medicines affordable for Americans.",
            "id": "1de7a5ec-1761-49d3-920a-6abf2fe7478e",
            "description": "Naples, Florida and Mumbai, India - On February 26, 2026, Lupin Limited, a global pharmaceutical giant, disclosed that their CEO Vinita Gupta had been acknowledged on CNBC's Changemakers list of Women Transforming. The company's stock is traded under BSE: 500257 and NSE: LUPIN, while also listed as REUTERS: LUPIN.BO and BLOOMBERG: LPCIN.",
            "link": "https://www.markets.news/headlines/1de7a5ec-1761-49d3-920a-6abf2fe7478e",
            "pub_date": "2026-02-27 00:00:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ETH price rebounds, surpasses $2K amid increased volatility. Onchain data suggests it may have reached a bottom.",
            "id": "c70281a0-5702-443b-9553-f72a657fbaf4",
            "description": "The price of Ethereum has shown positive momentum, as indicated by onchain data suggesting that the ETH price may have reached a significant low point in the overall trend, with a crucial support level remaining intact. This data suggests a potential turnaround in the price trend of Ethereum.",
            "link": "https://www.markets.news/headlines/c70281a0-5702-443b-9553-f72a657fbaf4",
            "pub_date": "2026-02-26 23:51:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}