{
    "data": [
        {
            "title": "Lansinoh® appoints Julie Talbot as new Global CEO as Kevin Vyse-Peacock steps down after 25 years of leadership.",
            "id": "11d73ef1-555e-48ef-8165-8e727890107d",
            "description": "After 25 years of influential global leadership, Kevin Vyse-Peacock has revealed plans for a transition. Julie Talbot is set to step into the role of Global CEO to spearhead the next phase of brand modernization and parental support at Lansinoh®. This announcement was made in Alexandria, Va., on Feb. 27, 2026. Lansinoh® is recognized as a key player in maternal care on a worldwide scale.",
            "link": "https://www.markets.news/headlines/11d73ef1-555e-48ef-8165-8e727890107d",
            "pub_date": "2026-02-27 18:02:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "46440f7f-a599-46e7-9ffe-7b1cba8da3af",
            "description": "BARCLAYS 5-YEAR CDS JUMP 1.5 BPS TO ONE-MONTH HIGH OF 55.48 BPS - LSEG DATA SHOWS",
            "link": "https://www.markets.news/headlines/46440f7f-a599-46e7-9ffe-7b1cba8da3af",
            "pub_date": "2026-02-27 18:02:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A $1B 3-D printing start-up, Desktop Metal, faced bankruptcy. The industry shifts gears as it downsizes and adjusts goals.",
            "id": "47792e95-89ac-4d9c-8de5-82842c5b8aee",
            "description": "A start-up valued at over a billion dollars, Desktop Metal, had ambitious plans to transform the manufacturing industry. However, the company has now declared bankruptcy and is shifting its focus to more modest goals as the 3-D printing sector experiences a more cautious outlook.",
            "link": "https://www.markets.news/headlines/47792e95-89ac-4d9c-8de5-82842c5b8aee",
            "pub_date": "2026-02-27 18:03:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Elon Musk linked to 90 Texas companies for various purposes, including supporting Trump's re-election.",
            "id": "5f2f96a2-0f4f-41ac-8eaa-949996cf4a75",
            "description": "An extremely wealthy individual is associated with around 90 companies in the state for various purposes such as compensating nannies, acquiring real estate, and backing Donald Trump's campaign for re-election.",
            "link": "https://www.markets.news/headlines/5f2f96a2-0f4f-41ac-8eaa-949996cf4a75",
            "pub_date": "2026-02-27 18:03:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Visit Honolulu for affordable Hawaii experience. Save on accommodation and food, explore local culture. Budget wisely for a few indulgences.",
            "id": "42c7cde3-db1e-405d-883e-36c9fdf78b01",
            "description": "Living in Hawaii can be costly, but choosing to stay in the capital city can help you save money on accommodations and dining. This way, you can allocate more funds for indulgences while still being close to the local culture and natural attractions.",
            "link": "https://www.markets.news/headlines/42c7cde3-db1e-405d-883e-36c9fdf78b01",
            "pub_date": "2026-02-27 18:03:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d6ba2104-1ed6-4466-92f0-e0d1b424b7bd",
            "description": "US EMBASSY: CITIZENS MAY WISH TO CONSIDER LEAVING ISRAEL WHILE FLIGHTS AVAILABLE",
            "link": "https://www.markets.news/headlines/d6ba2104-1ed6-4466-92f0-e0d1b424b7bd",
            "pub_date": "2026-02-27 18:05:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EMA accepted marketing authorization app for Cevira by Asieris; collaboration with Photocure. ",
            "id": "34fae675-cda4-458d-9826-dd720ab9897d",
            "description": "Norwegian company Photocure ASA, specializing in bladder cancer solutions, revealed that its collaborator Asieris Pharmaceuticals (SSE: 688176) has reported the submission of a marketing authorization application (MAA) for Cevira® (APL-1702) aimed at treating high-grade conditions. The announcement was made on Feb. 27, 2026. The development signifies a significant move in the field of bladder cancer treatment.",
            "link": "https://www.markets.news/headlines/34fae675-cda4-458d-9826-dd720ab9897d",
            "pub_date": "2026-02-27 18:06:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sufficient self-capital and internal capital adequacy for Danish Ship Finance A/S without disclosing detailed numbers.",
            "id": "44d16c86-d56c-4cc6-a326-88eafa3cf91c",
            "description": "In the recent report, it was revealed that there has been a significant increase in the number of COVID-19 cases in the country. The latest data shows a total of 10,000 new cases confirmed in the past week alone, bringing the total number of active cases to 50,000. Additionally, the death toll has risen to 500, with 50 new fatalities reported today. The government is urging the public to adhere to safety guidelines and protocols to help curb the spread of the virus.",
            "link": "https://www.markets.news/headlines/44d16c86-d56c-4cc6-a326-88eafa3cf91c",
            "pub_date": "2026-02-27 17:56:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TotalEnergies secures 2 million tons/year Alaska LNG deal for 20 years, targeting Asia market, making strategic move.",
            "id": "2d378525-5b23-4f8b-9ac1-2f96bf90f71a",
            "description": "TotalEnergies SE (NYSE: TTE) recently finalized a preliminary agreement with Glenfarne to secure a significant long-term supply of liquefied natural gas (LNG) from the Alaska LNG project, marking a strategic move for the company. The deal involves acquiring 2 million tons of LNG annually for a period of 20 years, pending the final investment decision of the project. Despite this development, TTE shares are currently underperforming in the market. The Alaska LNG project holds a strategic location on the U.S. Pacific coast, serving as the sole federally authorized LNG export terminal in the area. It is planned to have a capacity of 20 million tons per year, with a primary focus on catering to the Asian LNG market, the largest globally, thereby enhancing energy security and transpacific connections. This agreement underscores TotalEnergies' goal to bolster its position as a prominent U.S. LNG buyer while diversifying its sources of supply. As of 2025, the company emerged as the top U.S. LNG exporter, shipping 19 million tons. For the full article, refer to Benzinga.com.",
            "link": "https://www.markets.news/headlines/2d378525-5b23-4f8b-9ac1-2f96bf90f71a",
            "pub_date": "2026-02-27 17:57:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "76869ada-d51c-4a7f-b175-ba6b2cab9a1b",
            "description": "IRAN: SUCCESS OF NEGOTIATIONS TIED TO THE SERIOUSNESS AND REALISM OF THE OTHER PARTY",
            "link": "https://www.markets.news/headlines/76869ada-d51c-4a7f-b175-ba6b2cab9a1b",
            "pub_date": "2026-02-27 17:58:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AAVE price aims $128 breakout with 5.33% daily gains. Potential rally to $135-140 range by mid-March 2026.",
            "id": "bbd6fa28-7401-4017-a235-c93be56e318a",
            "description": "AAVE is currently experiencing a strong upward trend, showcasing a daily increase of 5.33%. The cryptocurrency is aiming to surpass the $128 resistance level. Based on technical analysis, it is anticipated to potentially rally further towards the $135-140 range by mid-March 2026.",
            "link": "https://www.markets.news/headlines/bbd6fa28-7401-4017-a235-c93be56e318a",
            "pub_date": "2026-02-27 17:41:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LDO price testing $0.34 resistance. Currently at $0.32 with RSI at 37.79. Potential rally targets $0.44-$0.50.",
            "id": "dac4e5d0-2f52-481c-b7d9-a917fc84a54e",
            "description": "The stock for LDO is currently trading at a price of $0.32, while the Relative Strength Index (RSI) stands at a neutral level of 37.79. Technical analysis indicates that there is an immediate resistance level at $0.34. If momentum changes, bullish targets are set at $0.44-$0.50.",
            "link": "https://www.markets.news/headlines/dac4e5d0-2f52-481c-b7d9-a917fc84a54e",
            "pub_date": "2026-02-27 17:41:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "02e370a6-8aa5-4d6f-a1c3-e0bc20bff88b",
            "description": "PRIVATE CREDIT DEFAULT RATES COULD SURGE TO 15%, UBS WARNS — HIGHER THAN DURING THE GLOBAL FINANCIAL CRISIS.",
            "link": "https://www.markets.news/headlines/02e370a6-8aa5-4d6f-a1c3-e0bc20bff88b",
            "pub_date": "2026-02-27 17:41:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HBAR at $0.10; RSI 57.13, resistance at $0.11. Analysts predict $0.16 by March with mixed momentum signals.",
            "id": "0f05354b-29fd-4c00-b95b-8ad4d33c106a",
            "description": "Hedera (HBAR) is currently trading at $0.10 with a neutral Relative Strength Index (RSI) at 57.13 and facing resistance at $0.11. Analysts are forecasting a target price of $0.16 by March, despite receiving mixed signals on momentum.",
            "link": "https://www.markets.news/headlines/0f05354b-29fd-4c00-b95b-8ad4d33c106a",
            "pub_date": "2026-02-27 17:41:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "WIF price at $0.21 aims for $0.25 test by March 2026. Neutral RSI at 41.85 with caution on bearish MACD signals.",
            "id": "2d232567-b110-4599-b43d-82f24f62dfe1",
            "description": "The cryptocurrency Dogwifhat (WIF) is currently priced at $0.21 with a neutral Relative Strength Index (RSI) at 41.85. Technical analysis indicates a possible challenge of the $0.25 resistance level, but the bearish Moving Average Convergence Divergence (MACD) signals advise caution regarding March price targets.",
            "link": "https://www.markets.news/headlines/2d232567-b110-4599-b43d-82f24f62dfe1",
            "pub_date": "2026-02-27 17:41:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Neutral RSI signals potential recovery for PEPE to $0.000008 by March 2026 with current support crucial.",
            "id": "6f01a96b-02cf-49b7-ab11-fd4515931a51",
            "description": "PEPE is currently indicating a neutral RSI of 42.47 alongside a bearish MACD momentum. Based on technical analysis, there is a possibility of a recovery to the $0.000008 resistance level if the current support remains stable through March.",
            "link": "https://www.markets.news/headlines/6f01a96b-02cf-49b7-ab11-fd4515931a51",
            "pub_date": "2026-02-27 17:41:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin ETFs attract $1B in three days as investors capitalize on the market downturn. BlackRock’s IBIT sees highest inflows.",
            "id": "9ddd1b3d-b679-48f2-b45f-fad6f3cb1108",
            "description": "According to data from SoSoValue, there has been a notable shift in the market trend, as there has been a three-day reversal following several weeks of withdrawals. Among the funds experiencing inflows, BlackRock’s IBIT stands out as it leads the way with significant investment.",
            "link": "https://www.markets.news/headlines/9ddd1b3d-b679-48f2-b45f-fad6f3cb1108",
            "pub_date": "2026-02-27 17:42:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "df38e1b1-2cb6-4f94-923d-0f9cc30d90aa",
            "description": "Equity increase and overall voting rights updated, keeping stakeholders informed on corporate changes.",
            "link": "https://www.markets.news/headlines/df38e1b1-2cb6-4f94-923d-0f9cc30d90aa",
            "pub_date": "2026-02-27 17:46:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "COLABS and AAHF partner to promote arts and culture in Saudi Arabia, aiming to scale initiatives across the country.",
            "id": "f7040b81-2365-40cd-8c2a-4eaf8a617fe0",
            "description": "In a recent announcement made on February 27, 2026, in Riyadh, Saudi Arabia, COLABS and the Abdulmonem Al-Rashed Humanitarian Foundation (AAHF) revealed a collaboration aimed at enhancing arts, culture, crafts, and heritage programs throughout Saudi Arabia. This partnership will focus on developing and expanding initiatives in these sectors, setting up a well-defined framework for their operations.",
            "link": "https://www.markets.news/headlines/f7040b81-2365-40cd-8c2a-4eaf8a617fe0",
            "pub_date": "2026-02-27 17:37:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Elisa and Elisa Industriq to showcase innovations at MWC Barcelona 2026. Event on March 2-5. Finnish telecom leader.",
            "id": "77bfd103-c812-416b-b6ff-4d198a6cbd5b",
            "description": "Elisa, a prominent telecommunications and digital services company based in Finland, along with its international software division Elisa Industriq, is set to showcase a strong presence at the upcoming Mobile World Congress (MWC) in Barcelona from March 2 to March 5, 2026. This event is significant for Elisa as it presents an opportunity for them to highlight their innovations and advancements in the industry to a global audience. The MWC is expected to attract thousands of participants and industry professionals, providing Elisa with a valuable platform to network and demonstrate their cutting-edge technologies.",
            "link": "https://www.markets.news/headlines/77bfd103-c812-416b-b6ff-4d198a6cbd5b",
            "pub_date": "2026-02-27 17:37:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}