{
    "data": [
        {
            "title": "Crown Holdings, Inc. (NYSE: CCK) raises dividend by 35% to $0.35 per share, payable on March 31, 2026.",
            "id": "666e7654-eba1-4d44-90bf-87d199db1f14",
            "description": "In Tampa, Florida on February 27, 2026, Crown Holdings, Inc. (NYSE: CCK) shared news of the declaration of a cash dividend of $0.35 per share by the company's Board of Directors. The dividend is set to be paid on March 31, 2026, to shareholders listed on March 17, 2026. This quarterly dividend marks an increase from previous payouts.",
            "link": "https://www.markets.news/headlines/666e7654-eba1-4d44-90bf-87d199db1f14",
            "pub_date": "2026-02-28 05:08:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mainstay Maritime selling Canadian companies/fleet to Algoma Central Corp. to focus on US Jones Act ops due to demand.",
            "id": "7ef32570-168d-4310-bec1-3c5b7cd538a2",
            "description": "Mainstay Maritime Inc. based in Williamsville, New York, announces its strategic move to strengthen its focus on core U.S. Jones Act operations. The company aims to capitalize on the increasing demand for reliable U.S. Jones Act marine services, particularly in Great Lakes shipping. This decision positions Mainstay to enhance its investment in this sector. The announcement was made on February 27, 2026.",
            "link": "https://www.markets.news/headlines/7ef32570-168d-4310-bec1-3c5b7cd538a2",
            "pub_date": "2026-02-28 05:08:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Blue Moon Metals Inc. acquires Apex Germanium and Gallium Mine from Teck Resources to advance US critical mineral projects.",
            "id": "c6907cf5-47f1-4b7a-8839-8ac515050883",
            "description": "Blue Moon Metals Inc. has recently disclosed that Teck American Incorporated, a subsidiary of Teck Resources Limited, has agreed to sell 100% ownership of the past-producing Apex germanium (Ge) mine. This transaction involves Blue Moon and Teck, wherein Teck will vend the Apex mine to Blue Moon. This milestone is significant for Blue Moon, listed on the Toronto Stock Venture Exchange (TSXV: MOON) and the NASDAQ exchange (NASDAQ: BMM), as it secures full control over the Apex mine's operations.",
            "link": "https://www.markets.news/headlines/c6907cf5-47f1-4b7a-8839-8ac515050883",
            "pub_date": "2026-02-28 05:08:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global Partners LP files 2025 Annual Report on Form 10-K with SEC on Feb 27, 2026. Report available online.",
            "id": "fd56b785-276c-4893-a530-7884987e4e41",
            "description": "Global Partners LP, headquartered in Waltham, Massachusetts, disclosed that its Annual Report on Form 10-K for the period ending on December 31, 2025, has been officially submitted to the U.S. Securities and Exchange Commission (SEC) on February 27, 2026. This comprehensive report is accessible for viewing or downloading on the Partnership's investor relations website, as well as on the SEC's website at www.sec.gov. Furthermore, interested parties can request a physical copy of the report.",
            "link": "https://www.markets.news/headlines/fd56b785-276c-4893-a530-7884987e4e41",
            "pub_date": "2026-02-28 05:09:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6a7c71b7-7f73-4c43-8f57-f920186b1207",
            "description": "S&P: Portugal Outlook Revised To Positive On Resilient Economy And Declining Debt; 'A+' Ratings Affirmed www.spglobal.com/ratings/en/r...",
            "link": "https://www.markets.news/headlines/6a7c71b7-7f73-4c43-8f57-f920186b1207",
            "pub_date": "2026-02-28 05:09:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1235acd3-bf01-4fc1-9015-649e38039214",
            "description": "Morningstar DBRS Confirms Netherlands At AAA, Stable Trend dbrs.morningstar.com/research/475...",
            "link": "https://www.markets.news/headlines/1235acd3-bf01-4fc1-9015-649e38039214",
            "pub_date": "2026-02-28 05:09:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HEI reports full year 2025 net income of $123M, $0.71 per share, a significant improvement from 2024's loss of $1.426B.",
            "id": "3c4d79ac-e5ee-4ef0-802c-db2f6b5fba25",
            "description": "Hawaiian Electric Industries, Inc. disclosed its financial results, with a reported net income of $123 million for the entire year of 2025, translating to $0.71 per share. This marks a significant improvement from the previous year's net loss of $1,426 million, or $11.23 per share in 2024. Adjusting for Maui wildfire-related expenses and costs associated with reviewing strategic options for Pacific Current, the core income from continuing operations stood at $149 million, equivalent to $0.86 per share. This indicates an increase compared to the $124 million, or $0.98 per share achieved in 2024.",
            "link": "https://www.markets.news/headlines/3c4d79ac-e5ee-4ef0-802c-db2f6b5fba25",
            "pub_date": "2026-02-28 05:09:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4f55bef2-6014-4767-91af-35b14c1bf328",
            "description": "Scope Affirms Switzerland’s AAA Rating With Stable Outlook www.scoperatings.com/announcement...",
            "link": "https://www.markets.news/headlines/4f55bef2-6014-4767-91af-35b14c1bf328",
            "pub_date": "2026-02-28 05:09:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PrimeEnergy Resources Corp. (NASDAQ: PNRG) confirms borrowing base and price reduction under credit facility with Citibank, N.A.",
            "id": "045f40ab-0b68-4f18-8085-f2915828e024",
            "description": "On February 27, 2026, PrimeEnergy Resources Corporation (NASDAQ: PNRG) revealed its recent agreement by joining a Fifth Amendment to the Fourth Amended and Restated Credit Agreement with its bank consortium. Citibank, N.A. takes the lead as the administrative agent for this revised agreement.",
            "link": "https://www.markets.news/headlines/045f40ab-0b68-4f18-8085-f2915828e024",
            "pub_date": "2026-02-28 05:11:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Draganfly closes US$50M Offering with 7.15M shares at US$7 each, before expenses.",
            "id": "fb9263bf-59c1-4f89-ba36-bee7b3c9102a",
            "description": "Saskatoon, Saskatchewan - Draganfly Inc., a renowned developer of drone solutions, software, and robotics, has closed its registered direct offering of either 7,150,000 common shares or pre-funded warrants, at a rate of US$7.00 per share. The total gross proceeds from this offering amount to approximately US$50.0 million, excluding any deduction for placement agent discounts and offering expenses. This event marks a significant milestone for the company as it continues to make waves in its industry.",
            "link": "https://www.markets.news/headlines/fb9263bf-59c1-4f89-ba36-bee7b3c9102a",
            "pub_date": "2026-02-28 05:11:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "21Shares Sui ETF (NASDAQ: TSUI) offers exposure to SUI token, issued by 21Shares, cleared by U.S. SEC, giving access to Sui blockchain. U.S. market expanding with direct access to SUI in brokerage accounts. Sui is a Layer 1 blockchain for payments and financial apps.",
            "id": "b0c16c44-f575-445c-9216-19dfff459d40",
            "description": "This week, the 21Shares Sui ETF (NASDAQ: TSUI) became available for trading, offering direct exposure to the SUI token (CRYPTO: SUI). This is among the initial U.S.-listed products associated with the rapidly expanding Sui blockchain network. Issued by 21Shares, the ETF received regulatory approval from the U.S. SEC. Investors can now access SUI through traditional brokerage accounts, bypassing the need for crypto exchanges. The ETF tracks SUI's market price on a spot basis, directly impacting its performance. The launch of this ETF enables greater U.S. participation in Sui, a Layer 1 blockchain known for its role in payment and financial applications. While Europe has seen a proliferation of crypto-linked ETFs, the U.S. market has been more selective, especially for spot products linked to alternative tokens beyond SUI. This development expands investment opportunities in the crypto sector.",
            "link": "https://www.markets.news/headlines/b0c16c44-f575-445c-9216-19dfff459d40",
            "pub_date": "2026-02-28 05:03:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin is near $65,000, could rally to low $70k range. Crypto analyst predicts March target of $74,000.",
            "id": "53d05607-1d64-430f-a36d-9c607e4fd186",
            "description": "Bitcoin is currently trading around $65,000, with historical trends from previous midterm years indicating a potential rally towards the low $70,000 range. Crypto analyst Benjamin Cowen highlighted that Bitcoin is mirroring behavioural patterns observed in midterm years like 2014, 2018, and 2022. These patterns typically show a local low in February, followed by a rally into early March before another downturn. For instance, in 2014 Bitcoin hit a bottom on Feb. 25, surged until March 3, then declined into April. Similarly, in 2018, it bottomed on Feb. 6, peaked on March 5, and fell into April. This pattern suggests a potential upcoming rise in Bitcoin’s price, as seen in previous midterm years. For more details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/53d05607-1d64-430f-a36d-9c607e4fd186",
            "pub_date": "2026-02-28 05:03:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RBC Bearings (NYSE: RBC) to attend investor conferences at Orlando & London; dates: March 4, 2026.",
            "id": "7871d429-cb7b-4ee2-bafb-6a51e47c8a26",
            "description": "In Oxford, Conn., RBC Bearings Incorporated (NYSE: RBC), a prominent global manufacturer of precision bearings, components, and systems for industrial, defense, and aerospace sectors, revealed its upcoming presence at key investor events. The company will take part in the Raymond James Institutional Investors Conference at JW Marriott Orlando Grande Lakes in Orlando, FL on March 4, 2026. Additionally, they will participate in the Bank of America Global Industrials Conference at the Landmark Hotel in London on the same day. This move showcases their commitment to engaging with investors and industry players.",
            "link": "https://www.markets.news/headlines/7871d429-cb7b-4ee2-bafb-6a51e47c8a26",
            "pub_date": "2026-02-28 05:04:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NurExone to present at NANO.IL.2026 and Advanced Therapies Congress in March 2026, developing regenerative exosome therapies. (Numbers: NRX stock, OTCQB: NRXBF, FSE: J90)",
            "id": "fdb6cabf-ce6a-4566-a531-6679225fd7ca",
            "description": "Toronto-based biopharmaceutical company NurExone Biologic Inc. (TSXV: NRX) (OTCQB: NRXBF) (FSE: J90) revealed on February 27, 2026, its involvement in two upcoming international conferences scheduled for March 2026. NurExone is focused on developing regenerative therapies based on exosomes.",
            "link": "https://www.markets.news/headlines/fdb6cabf-ce6a-4566-a531-6679225fd7ca",
            "pub_date": "2026-02-28 05:04:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e500428f-f3e9-4038-b968-b4c4c2d47c0f",
            "description": "PARAMOUNT SKYDANCE SHARES CLOSE UP 21%, MOST SINCE AUGUST",
            "link": "https://www.markets.news/headlines/e500428f-f3e9-4038-b968-b4c4c2d47c0f",
            "pub_date": "2026-02-28 05:04:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "095a3fa3-8728-4916-b27c-cb6fbd24afb7",
            "description": "NETFLIX CLOSES UP 14% FOR BEST DAY SINCE OCTOBER 2023",
            "link": "https://www.markets.news/headlines/095a3fa3-8728-4916-b27c-cb6fbd24afb7",
            "pub_date": "2026-02-28 05:04:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f12025cc-92f8-428b-a65b-2b13c751a418",
            "description": "DELL TECHNOLOGIES JUMPS 22% IN BEST DAY SINCE MARCH 2024",
            "link": "https://www.markets.news/headlines/f12025cc-92f8-428b-a65b-2b13c751a418",
            "pub_date": "2026-02-28 05:04:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3d77cefc-ac76-4985-827c-e4f5fee6f2ae",
            "description": "KBW BANK INDEX CLOSES DOWN 4.9% IN BIGGEST DROP SINCE APRIL",
            "link": "https://www.markets.news/headlines/3d77cefc-ac76-4985-827c-e4f5fee6f2ae",
            "pub_date": "2026-02-28 05:04:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1e0c59a2-f5b9-44af-8a17-0ba9e363e945",
            "description": "US President Trump On SCOTUS Tariff Ruling: Is a Rehearing or Readjudication of this case possible??? – TSL truthsocial.com/@realDonaldT...",
            "link": "https://www.markets.news/headlines/1e0c59a2-f5b9-44af-8a17-0ba9e363e945",
            "pub_date": "2026-02-28 05:06:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d9aa4fd6-9e6c-4eb8-8c97-7c42b4705886",
            "description": "MOC Imbalance S&P 500: +2720 mln Nasdaq 100: +364 mln Dow 30: +1054 mln Mag 7: -545 mln",
            "link": "https://www.markets.news/headlines/d9aa4fd6-9e6c-4eb8-8c97-7c42b4705886",
            "pub_date": "2026-02-28 04:52:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}