{
    "data": [
        {
            "title": "",
            "id": "2c8bfa70-27e2-489b-af18-66283c63e684",
            "description": "Taliban spox: ‘Here for this moment: - Two Pakistani military posts in the Nawo area of Nangarhar's Dor Baba district.\n- 3 posts in the Anargi area of Gushte.\n- And 2 posts in the Doklam area of Konar Naray district were captured in total.’",
            "link": "https://www.markets.news/headlines/2c8bfa70-27e2-489b-af18-66283c63e684",
            "pub_date": "2026-02-27 00:46:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp client develops unique walking cane for added support and style. Includes better quality design.",
            "id": "515c8a2c-f031-4ef3-b3b6-36235e891502",
            "description": "An inventor from Rome, N.Y., recently unveiled a new walking cane design in Pittsburgh on February 26, 2026. The creator shared that the inspiration behind the invention was to offer not only sturdy support but also a sleek and visually appealing accessory. This UNIQUELY DESIGNED AND BETTER QUALITY CANE aims to provide users with both functionality and style. The cane's innovative design not only serves as a mobility aid but also doubles as a symbolic centerpiece.",
            "link": "https://www.markets.news/headlines/515c8a2c-f031-4ef3-b3b6-36235e891502",
            "pub_date": "2026-02-27 00:46:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mark Farrah Associates analyzed 2024 Medical Loss Ratio (MLR) and Rebates data from HHS report. Details at markfarrah.com.",
            "id": "7d575c72-b551-43ab-b848-806c19ff781f",
            "description": "On February 26, 2026, in Pittsburgh, the latest Healthcare Business Strategy report highlighted key insights from the 2024 MLR report published by the Department of Health and Human Services (HHS). The report, by Mark Farrah Associates available at www.markfarrah.com, delved into the Affordable Care Act's (ACA) MLR.",
            "link": "https://www.markets.news/headlines/7d575c72-b551-43ab-b848-806c19ff781f",
            "pub_date": "2026-02-27 00:47:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a9cff5f4-b2b5-4e62-badd-552ae6058646",
            "description": "Viridien reports 2025 yearly outcomes with a revenue increase of 15% compared to last year.",
            "link": "https://www.markets.news/headlines/a9cff5f4-b2b5-4e62-badd-552ae6058646",
            "pub_date": "2026-02-27 00:47:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Technip Energies plans to appoint John O’Higgins to succeed Joseph Rinaldi as Chair of Board of Directors in 2026.",
            "id": "cd2e5fe8-ceca-4731-8dbf-84a6efc88514",
            "description": "Technip Energies has revealed that Mr. Joseph Rinaldi, the current Chair of the Board of Directors, will retire at the end of his current term after the 2026 Annual General Meeting and will not be seeking reappointment. The Board plans to propose Mr. John O’Higgins as a new member of the Board at the 2026 AGM and have selected him to take over as Chair after assuming the position of Non-Executive Director as approved by shareholders at the same meeting.",
            "link": "https://www.markets.news/headlines/cd2e5fe8-ceca-4731-8dbf-84a6efc88514",
            "pub_date": "2026-02-27 00:47:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6f24e22a-3b52-4b08-9151-a59ee5f40414",
            "description": "Michelin announces 2025 segment restatement due to new Polymer Composite Solutions segment creation.",
            "link": "https://www.markets.news/headlines/6f24e22a-3b52-4b08-9151-a59ee5f40414",
            "pub_date": "2026-02-27 00:47:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9796e8f2-f898-486c-8813-b6bbb77d69ce",
            "description": "Marimekko Corp bought back shares on 26 Feb 2026.",
            "link": "https://www.markets.news/headlines/9796e8f2-f898-486c-8813-b6bbb77d69ce",
            "pub_date": "2026-02-27 00:47:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "eClinical Solutions announces 2025 achievements, adding 20+ new customers, now serves 18 of top 50 pharma companies. Future innovations to accelerate clinical trials.",
            "id": "aa92c196-9868-47c8-8a5f-b465dee9d74c",
            "description": "In Boston, eClinical Solutions LLC has revealed its milestones for 2025 and upcoming innovations for 2026. The company, known for its digital clinical software and services, aims to enhance the clinical research lifecycle to accelerate the delivery of innovative therapies to patients. In the past year, eClinical Solutions added more than 20 new customers to its client base, consisting of biopharma and CRO firms. Notably, they now serve 18 of the top 50 global pharmaceutical companies. This expansion highlights the company's commitment to supporting leaders in clinical trials.",
            "link": "https://www.markets.news/headlines/aa92c196-9868-47c8-8a5f-b465dee9d74c",
            "pub_date": "2026-02-27 00:48:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Study finds lack of brand differentiation in auto parts retailers, focusing on customer experience and trust as key drivers of loyalty and future spending.",
            "id": "8da50b8c-88ef-40da-99e5-3c84aa3391df",
            "description": "A recent study revealed that there is minimal distinction between automotive parts retailers, highlighting customer experience and trust as the main factors influencing loyalty and potential future spending. The study was conducted in Peachtree Corners, Georgia on February 26, 2026. Market Force Information®, a prominent company specializing in customer insights, conducted the research. The data indicates that customer loyalty and future expenditure are heavily reliant on positive interactions and trust within the automotive parts retail sector.",
            "link": "https://www.markets.news/headlines/8da50b8c-88ef-40da-99e5-3c84aa3391df",
            "pub_date": "2026-02-27 00:49:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Capgemini chosen by TELUS for network automation initiative, marking a shift towards autonomous telecom networks.",
            "id": "a1c66343-ebc5-42fc-a399-36040a079cdc",
            "description": "In a recent announcement, Capgemini revealed that it has secured a partnership with TELUS, a prominent communications technology company. The collaboration aims to revolutionize TELUS' network operations through an automation project. This strategic alliance solidifies Capgemini's position as a pioneer in Canada's autonomous network transformation sector, showcasing groundbreaking advancements in telecom technology. Transitioning from manual, rules-driven processes to intent-driven and self-regulating systems, autonomous networks represent a shift towards more intelligent infrastructure capable of identifying irregularities.",
            "link": "https://www.markets.news/headlines/a1c66343-ebc5-42fc-a399-36040a079cdc",
            "pub_date": "2026-02-27 00:50:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ffb5a884-899b-4257-919e-6ed1c9369d78",
            "description": "BAYER’S XOFIGO PLUS ENZALUTAMIDE SHOWS SIGNIFICANT OVERALL SURVIVAL BENEFIT IN PEACE-3 TRIAL – STREET INSIDER",
            "link": "https://www.markets.news/headlines/ffb5a884-899b-4257-919e-6ed1c9369d78",
            "pub_date": "2026-02-27 00:36:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin consolidates near $68K, awaiting catalyst as ETF inflows moderate. $68,000 level crucial for market sentiment. Trading balanced, with focus on institutional activity for short-term momentum. ",
            "id": "de35269d-28fb-4ead-86ce-8cf9820458c5",
            "description": "Bitcoin is trading near $68,000 after a strong rally earlier this year fueled by the launch of spot Bitcoin exchange traded funds and renewed institutional interest. The $68,000 level is both technically and psychologically significant, historically leading to profit taking intensifying. Institutional activity has been a key driver of Bitcoin's rally, with spot Bitcoin ETFs attracting strong inflows supporting the market in early 2026. However, recent data indicates that these inflows have moderated, signaling a potential pause in short-term momentum. Traders are assessing whether Bitcoin can sustain above $68,000 or if a pullback will occur. The full story is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/de35269d-28fb-4ead-86ce-8cf9820458c5",
            "pub_date": "2026-02-27 00:36:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US court sets deadline for addressing Sam Bankman-Fried's motion for new trial as former FTX CEO seeks legal remedies.",
            "id": "d3b703d8-d644-4354-b9f9-eb3118ae0ea9",
            "description": "In light of recent reports indicating that the White House is not willing to entertain a presidential pardon, the former CEO of FTX who has been convicted of [insert specific charges] persists in his legal pursuits.",
            "link": "https://www.markets.news/headlines/d3b703d8-d644-4354-b9f9-eb3118ae0ea9",
            "pub_date": "2026-02-27 00:38:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jacobi introduces AI coding resources to speed up investment tech development. Global leader in investment technology aims to streamline processes.",
            "id": "256027c7-759f-49c0-840c-9c8bc8343b2b",
            "description": "On February 26, 2026, a renowned investment technology company called Jacobi Strategies unveiled its latest innovation, the AI-Assisted Coding Resources. This new suite of tools aims to aid investment teams in efficiently creating, standardizing, and expanding customized strategies. Jacobi's cutting-edge solution is expected to revolutionize the industry by providing access to advanced technologies and increasing operational speed.",
            "link": "https://www.markets.news/headlines/256027c7-759f-49c0-840c-9c8bc8343b2b",
            "pub_date": "2026-02-27 00:38:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LoanBud launches AI platform to verify SBA eligibility early, reducing deal risk and delays. NY, Feb. 26, 2026.",
            "id": "24958b07-6fe7-4fa0-a5a8-f50bcd735cac",
            "description": "A new financial technology company named LoanBud has introduced an innovative approach to Small Business Administration (SBA) financing in New York. By utilizing AI-powered intake and human review processes, the company aims to identify eligibility issues early on, ultimately minimizing deal risk and preventing delays. This initiative is set to streamline access to SBA financing and enhance the efficiency of loan processing. LoanBud's system is designed to accelerate the identification of eligibility problems, potentially improving the overall process for small business owners.",
            "link": "https://www.markets.news/headlines/24958b07-6fe7-4fa0-a5a8-f50bcd735cac",
            "pub_date": "2026-02-27 00:38:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Loop Global had a successful 2025 with >50% YoY revenue growth, shipped ~4,200 chargers, and now has 8,500 EV charging ports worldwide.",
            "id": "a9ceef99-44e8-4d82-8ff2-79ee640be006",
            "description": "In 2025, Loop Global, based in El Segundo, California, successfully shipped approximately 4,200 chargers, expanding its global presence to feature 8,500 EV charging ports worldwide. The company, recognized for its comprehensive EV charging solutions, revealed a prosperous year marked by significant growth in operations and network enhancement.",
            "link": "https://www.markets.news/headlines/a9ceef99-44e8-4d82-8ff2-79ee640be006",
            "pub_date": "2026-02-27 00:38:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SPX FLOW released Gerstenberg Schröder® Kombinator® 250 redesign reducing costs, adding CO₂ refrigerant option.",
            "id": "20cc9764-f58a-441f-90a4-a7460a04a4c6",
            "description": "Recently released in Charlotte, North Carolina on February 26, 2026, SPX FLOW introduced an enhanced model of the Gerstenberg Schröder® Kombinator® 250 scraped surface heat exchanger. This upgraded design provides increased options, leading to reduced downtime and a decrease in the total cost of ownership for margarine and shortening processing applications.",
            "link": "https://www.markets.news/headlines/20cc9764-f58a-441f-90a4-a7460a04a4c6",
            "pub_date": "2026-02-27 00:40:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e3bd8809-61c7-4281-ab6b-2577b4738815",
            "description": "Delegations arrive back at US iran talks negotiations site",
            "link": "https://www.markets.news/headlines/e3bd8809-61c7-4281-ab6b-2577b4738815",
            "pub_date": "2026-02-27 00:31:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ee36d614-057b-4d10-97f8-5c790ae97cf5",
            "description": "Sanoma Corporation purchased its own shares on 26 Feb 2026.",
            "link": "https://www.markets.news/headlines/ee36d614-057b-4d10-97f8-5c790ae97cf5",
            "pub_date": "2026-02-27 00:31:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp client from Alameda creates AI financial system TKI-1266 to address systemic gaps in equity, trust, data sovereignty.",
            "id": "04abd9e8-d3ef-47fb-8ec0-def480a73123",
            "description": "In Pittsburgh on February 26, 2026, an inventor from Alameda, California, discussed their development of a system aimed at addressing the persistent issue of financial equity, trust automation, and data sovereignty. The inventor expressed a desire to implement a self-sustaining AI-driven trust framework to tackle these challenges.",
            "link": "https://www.markets.news/headlines/04abd9e8-d3ef-47fb-8ec0-def480a73123",
            "pub_date": "2026-02-27 00:32:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}