{
    "data": [
        {
            "title": "InventHelp client unveils new MTK-103 system for overspray containment, developed by a construction worker from Alabama.",
            "id": "bb92752b-d201-4dae-9653-b2cb8e338d0c",
            "description": "In Pittsburgh on February 27, 2026, an inventor from Prattville, Alabama, shared his inspiration for creating a new folding device. This device aims to provide a better solution for controlling overspray from airless paint sprayers commonly used in interior painting projects. The inventor expressed his motivation to innovate in the construction industry and introduced the device under the name CHAMPION'S.",
            "link": "https://www.markets.news/headlines/bb92752b-d201-4dae-9653-b2cb8e338d0c",
            "pub_date": "2026-02-28 00:48:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "20fd5977-35d3-4d93-aa2d-2399ccfdfb1f",
            "description": "UK GOVERNMENT: WE HAVE TAKEN THE PRECAUTIONARY MEASURE TO TEMPORARILY MOVE SOME OF OUR STAFF AND THEIR DEPENDENTS FROM TEL AVIV TO ANOTHER LOCATION WITHIN ISRAEL",
            "link": "https://www.markets.news/headlines/20fd5977-35d3-4d93-aa2d-2399ccfdfb1f",
            "pub_date": "2026-02-28 00:49:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ginkgo Bioworks shifts focus to AI and robotics post challenging quarter. Plans divestment of biosecurity business. Loss of $1.41 per share, sales down 24% to $33.32 million in Q4 2025.",
            "id": "09c5c403-6bbc-4e28-9bac-7306f9e3cc0f",
            "description": "Ginkgo Bioworks reported a loss of $1.41 per share for the fourth quarter of 2025, below the expected $1.36 per share loss. The company's sales were $33.32 million, a decrease of 24% compared to the previous year. Ginkgo Bioworks is shifting its focus towards investing in autonomous labs, leading to plans to divest its biosecurity business to a group of investors for a minority stake. CEO Jason Kelly highlighted the company's collaboration with the Department of Energy and OpenAI. The biosecurity business will operate independently to attract new investors and enhance growth opportunities. This strategic move aims to take advantage of the growing interest in defense technology and private capital markets.",
            "link": "https://www.markets.news/headlines/09c5c403-6bbc-4e28-9bac-7306f9e3cc0f",
            "pub_date": "2026-02-28 00:52:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Levels launches new brand experience, The Founding Udders, introducing Sir Bovine Cowley. Jupiter, Fla., Feb. 27, 2026.",
            "id": "c40e3980-89dd-4426-ba62-af777d2438d3",
            "description": "A well-known brand named The New Brand World has revealed The Founding Udders and Sir Bovine Cowley in Jupiter, Florida on February 27, 2026. Recognized for its natural, simple ingredient whey protein products, Levels has introduced The Founding Udders as a fresh creative concept to stand out in the market.",
            "link": "https://www.markets.news/headlines/c40e3980-89dd-4426-ba62-af777d2438d3",
            "pub_date": "2026-02-28 00:52:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Legislators in Minnesota are mulling a ban on Bitcoin and crypto ATMs due to rise in scams, legislation proposed.",
            "id": "ce289e3f-7714-4a2e-acdb-52c644a20438",
            "description": "Legislators in Minnesota are currently reviewing a proposal to prohibit Bitcoin and cryptocurrency ATMs due to an uptick in fraudulent activities. The proposed legislation is a response to an increasing number of scams involving these machines. The ban aims to curb such incidents and protect consumers from financial losses.",
            "link": "https://www.markets.news/headlines/ce289e3f-7714-4a2e-acdb-52c644a20438",
            "pub_date": "2026-02-28 00:53:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c145e6b4-3edc-4440-a707-f6c29022b097",
            "description": "INDIA, EU AGREE ON DIGITAL TRADE RULES TO CURB UNJUSTIFIED BARRIERS, ENSURE OPEN, SECURE ONLINE ENVIRONMENT UNDER PROPOSED FTA- DRAFT TEXT",
            "link": "https://www.markets.news/headlines/c145e6b4-3edc-4440-a707-f6c29022b097",
            "pub_date": "2026-02-28 00:53:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ray Data teams up with Docling to address Enterprise AI's main challenge, processing over 10k complex files for RAG applications in hours, not days.",
            "id": "fdc936d4-9180-4623-911f-49a612ed625f",
            "description": "A recent collaboration has merged Ray Data's distributed processing technology with Docling's document parsing software to efficiently handle over 10,000 intricate files for RAG applications within a matter of hours, significantly reducing processing time from days to mere hours. This integration marks a major advancement in data processing capabilities, streamlining the workflow and increasing efficiency for large-scale document analysis tasks.",
            "link": "https://www.markets.news/headlines/fdc936d4-9180-4623-911f-49a612ed625f",
            "pub_date": "2026-02-28 00:54:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bryan Regele promoted to Chief Loan Officer at Webster First Federal Credit Union in Worcester, MA succeeding Talat Mufti.",
            "id": "c4285686-fe86-4ac9-8456-0aa6a8975623",
            "description": "In Worcester, Massachusetts on February 27, 2026, Webster First Federal Credit Union announced the promotion of Bryan T. Regele to Senior Vice President and Chief Loan Officer. Regele will be taking over from former CLO Talat Mufti. This promotion highlights Regele's outstanding performance and dedication to the company.",
            "link": "https://www.markets.news/headlines/c4285686-fe86-4ac9-8456-0aa6a8975623",
            "pub_date": "2026-02-28 00:54:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "eb4c6b27-a7e2-46c5-af1a-5f7d54ca2651",
            "description": "GERMANY'S KBA: BMW LAUNCHES NEW RECALL FOR 337,374 VEHICLES WORLDWIDE - DPA NEWS  RECALL AFFECTS I7, I5, 5, 7, M5 SERIES MANUFACTURED BETWEEN 2022 AND 2025  RECALL POTENTIALLY AFFECTS 337,374 VEHICLES WORLDWIDE, 29,441 IN GERMANY",
            "link": "https://www.markets.news/headlines/eb4c6b27-a7e2-46c5-af1a-5f7d54ca2651",
            "pub_date": "2026-02-28 00:55:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2f83997a-71e7-4910-b8f7-02454bd07558",
            "description": "INDIA, EU RECOGNISE PRIVACY AS FUNDAMENTAL RIGHT, RETAIN FULL AUTHORITY OVER PERSONAL DATA PROTECTION, CROSS-BORDER TRANSFER RULES UNDER FTA-DRAFT TEXT",
            "link": "https://www.markets.news/headlines/2f83997a-71e7-4910-b8f7-02454bd07558",
            "pub_date": "2026-02-28 00:55:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "lululemon responds to Chip Wilson's director nominations at 2026 Annual Meeting, emphasizing ongoing engagement.",
            "id": "92380ac6-93d0-4987-828f-5e947c3499a1",
            "description": "lululemon athletica inc. made a statement regarding Chip Wilson's press release about nominating three board director candidates for the company's 2026 Annual Meeting of Shareholders. The company has been engaging with Mr. Wilson in good faith, holding numerous meetings over the past few months to foster productive dialogue. Despite efforts, there seems to be a disagreement on certain matters. The company, listed as (NASDAQ:LULU), is headquartered in Vancouver, British Columbia.",
            "link": "https://www.markets.news/headlines/92380ac6-93d0-4987-828f-5e947c3499a1",
            "pub_date": "2026-02-28 00:45:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9b9ed239-1f90-4fca-a0c6-e2c5c3f98143",
            "description": "EU TO MOBILISE FINANCE AND INVESTMENT TO BACK INDIA’S EMISSIONS CUTS UNDER PROPOSED FTA- REPORTS",
            "link": "https://www.markets.news/headlines/9b9ed239-1f90-4fca-a0c6-e2c5c3f98143",
            "pub_date": "2026-02-28 00:45:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a1a4dd3e-b473-4a2c-bc93-d5a47f0bc4a0",
            "description": "Release of the 2025 Annual Report with key figures.",
            "link": "https://www.markets.news/headlines/a1a4dd3e-b473-4a2c-bc93-d5a47f0bc4a0",
            "pub_date": "2026-02-28 00:46:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d69d884e-a9a2-4e7d-9304-c88e9c96637e",
            "description": "Overall number of voting rights and capital available.",
            "link": "https://www.markets.news/headlines/d69d884e-a9a2-4e7d-9304-c88e9c96637e",
            "pub_date": "2026-02-28 00:46:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "35f58eea-a17b-4b44-b83f-7b9e79d9fc06",
            "description": "Marimekko Corp bought back shares on 27/02/2026.",
            "link": "https://www.markets.news/headlines/35f58eea-a17b-4b44-b83f-7b9e79d9fc06",
            "pub_date": "2026-02-28 00:46:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Milliman MedInsight appoints Iyibo Jack as Chief Product Officer to lead AI innovation, replacing former CPO, Rich Moyer.",
            "id": "1a2d3863-f20f-43f8-9b2c-3c2c59e10d27",
            "description": "In Seattle on February 27, 2026, Milliman MedInsight® announced the appointment of Iyibo Jack as the new Chief Product Officer. This move comes after Rich Moyer, the former Chief Product Officer, stepped down from his position. Milliman MedInsight® is a prominent healthcare data and analytics software provider and a division of Milliman.",
            "link": "https://www.markets.news/headlines/1a2d3863-f20f-43f8-9b2c-3c2c59e10d27",
            "pub_date": "2026-02-28 00:46:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OnPoint AI to showcase AR and machine learning surgical platform at 2026 Canaccord Genuity Musculoskeletal Conference in Boston.",
            "id": "f912144d-3bae-4e6e-b12f-9f5734e831e9",
            "description": "Today, in Boston on February 27, 2026, a privately owned collection of augmented reality (AR) and artificial intelligence (AI) technology firms known as OnPoint AI revealed their involvement in the 2026 Canaccord Genuity Musculoskeletal event. The company specializes in software-driven surgical guidance.",
            "link": "https://www.markets.news/headlines/f912144d-3bae-4e6e-b12f-9f5734e831e9",
            "pub_date": "2026-02-28 00:46:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Psychedelic biotechs are moving towards Phase 3 with five companies advancing CNS treatments for depression and anxiety.",
            "id": "093f022a-5677-4f4f-a5b3-39442e02979f",
            "description": "Helus Pharma, in Vancouver, BC, issued a statement on February 27, 2026, reporting that psychedelic compounds are making progress towards regulatory approval. Pivotal trials in treating depression and anxiety that have not responded to traditional treatments are moving forward in late-stage development. These achievements are significant for the mental health industry, showcasing potential breakthroughs in alternative therapies. The innovations in treatment come as a response to the ineffectiveness of current treatments on individuals with depression and anxiety. The progress offers hope for those who have not found relief through conventional methods. Such advancements in psychedelic compounds highlight the changing landscape of mental health care and may lead to new, effective options for patients.",
            "link": "https://www.markets.news/headlines/093f022a-5677-4f4f-a5b3-39442e02979f",
            "pub_date": "2026-02-28 00:46:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "449cbef9-34ab-47a2-bb6d-4144bbb138e0",
            "description": "BILL CLINTON: I WOULD NOT HAVE FLOWN ON JEFFREY EPSTEIN'S PLANE IF I HAD ANY INKLING OF WHAT HE WAS DOING",
            "link": "https://www.markets.news/headlines/449cbef9-34ab-47a2-bb6d-4144bbb138e0",
            "pub_date": "2026-02-28 00:46:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b8cb0b8c-f248-40b6-b364-bd440aa39f24",
            "description": "INDIA, EU TO ENSURE NON-DISCRIMINATORY AND ACCESSIBLE APPEAL PROCEDURES FOR CUSTOMS DECISIONS AFFECTING IMPORTS, EXPORTS OR TRANSIT GOODS- DRAFT TEXT",
            "link": "https://www.markets.news/headlines/b8cb0b8c-f248-40b6-b364-bd440aa39f24",
            "pub_date": "2026-02-28 00:46:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}