{
    "data": [
        {
            "title": "Southern Black Girls and Women's Consortium launches $10,000-$20,000 grant fund for environmental and climate justice.",
            "id": "c0691b96-e97e-416e-8c3d-64d56adde291",
            "description": "A recently introduced grant program has been established to provide financial support ranging from $10,000 to $20,000 specifically aimed at organizations dedicated to promoting environmental and climate justice for Black girls, women, and femme-identifying youth. The Southern Black Girls and Women's Consortium, based in SELMA, Ala., announced the launch of this initiative on February 26, 2026.",
            "link": "https://www.markets.news/headlines/c0691b96-e97e-416e-8c3d-64d56adde291",
            "pub_date": "2026-02-27 00:51:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investors eye rare earth stocks as shortages hit aerospace, seeking companies to fill supply gaps.",
            "id": "cd5cca04-a4a5-4acc-bcd5-d1ed976eba76",
            "description": "Investors are closely watching companies that are responding to the supply shortage. Five rare earth stocks are being highlighted as shortages impact the aerospace sector.",
            "link": "https://www.markets.news/headlines/cd5cca04-a4a5-4acc-bcd5-d1ed976eba76",
            "pub_date": "2026-02-27 00:52:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a3952562-4d3d-419a-b52c-080c256b6a00",
            "description": "Up to DKK 400m share buy-back program launched.",
            "link": "https://www.markets.news/headlines/a3952562-4d3d-419a-b52c-080c256b6a00",
            "pub_date": "2026-02-27 00:53:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pacific Coast Alternatives secures $4.25M lending facility from a private credit firm in Los Angeles.",
            "id": "2956ba7a-bd59-48fb-95d2-d70e9f77a809",
            "description": "Private credit firm from Southern California recently delivered customized capital to an independent private equity sponsor. The capital is backed by a range of private company interests. The firm, Pacific Coast Alternatives (\"PCA\"), specializes in private credit. The transaction took place in Los Angeles on Feb. 26, 2026.",
            "link": "https://www.markets.news/headlines/2956ba7a-bd59-48fb-95d2-d70e9f77a809",
            "pub_date": "2026-02-27 00:53:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "International Merchant Bank Limited celebrates 5 years of operations, strengthening global presence.",
            "id": "01434166-0eb8-4b2f-acf8-4083f592d7db",
            "description": "In Nevis, the International Merchant Bank Limited (IMBL) informed about the successful conclusion of its fifth year of operations on February 26, 2026. This achievement symbolizes a significant milestone for the bank as it solidifies its reputation as a customer-centric financial institution. The London-based bank has successfully navigated five years of consistent business activities, emphasizing its dedication to building strong client relationships and providing tailored services.",
            "link": "https://www.markets.news/headlines/01434166-0eb8-4b2f-acf8-4083f592d7db",
            "pub_date": "2026-02-27 00:53:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Deltec Homes introduces Backyard Cottages, a new line of ADUs in Asheville, N.C. Efficient and innovative design.",
            "id": "98cd0bcf-ee65-4ffb-85b3-2ede6a96aef9",
            "description": "A round home design innovator based in Asheville, N.C., Deltec Homes unveiled its latest offering on Feb. 26, 2026. Known as Backyard Cottages, this new line stands out as a distinctive and cost-effective option in the current market. Deltec Homes, renowned for their thoughtful engineering and efficient design, leads the way as the top global provider in the round home sector.",
            "link": "https://www.markets.news/headlines/98cd0bcf-ee65-4ffb-85b3-2ede6a96aef9",
            "pub_date": "2026-02-27 00:53:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cost of basic American life surpasses $121,000 for family of four in 2024, outpacing wages and inflation.",
            "id": "b71bd7d3-ced0-4bcc-a971-3f4594fc0405",
            "description": "The rising costs of housing and childcare have caused a significant spike, with the cost of maintaining a minimal quality of life for a family of four surpassing $121,000. This marks a 4.4% increase from 2024, putting added pressure on household budgets. Wages have not kept up with this surge, exacerbating financial strains for families.",
            "link": "https://www.markets.news/headlines/b71bd7d3-ced0-4bcc-a971-3f4594fc0405",
            "pub_date": "2026-02-27 00:53:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earning passive income with stablecoins requires active involvement; yield can range from 3% to 15% annually through DeFi lending or innovative strategies. Some stablecoins automatically accrue yield, with sDAI offering 5% to 8%, while sUSDe provides 8% to 15% returns through unique delta-neutral strategy. Risks involved should be considered.",
            "id": "6540efc3-9725-4717-b162-77a2c90bf1fe",
            "description": "The article discusses the concept of earning passive income with stablecoins in the crypto space. It clarifies that stablecoins themselves do not generate yield; rather, it is the action of engaging these tokens in systems that generate returns. Decentralized lending platforms like Aave or Compound offer returns from lending stablecoins to borrowers, typically yielding 3% to 9% annually. Other stablecoins like sDAI and sUSDe are designed to automatically accrue yield through various strategies, offering annual returns ranging from 5% to 15%. The article emphasizes that while these platforms are considered lower-risk options in the DeFi world, they are not without risks. It highlights the importance of understanding where the yield comes from and the potential risks involved in these investments.",
            "link": "https://www.markets.news/headlines/6540efc3-9725-4717-b162-77a2c90bf1fe",
            "pub_date": "2026-02-27 00:53:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "J.M. Smucker beats expectations with Q3 results; Adjusted EPS $2.38 and net sales $2.339 billion, up 7%. Operating loss improved 8%.",
            "id": "332f4344-f54d-4903-a9fe-e4b8572f0eac",
            "description": "The J.M. Smucker Co. reported third-quarter fiscal 2026 results, with shares trading higher due to solid operational performance despite cost pressures. Adjusted earnings per share were $2.38, beating the $2.27 estimate, while net sales increased 7% to $2.339 billion, surpassing the $2.322 billion estimate. Net sales excluding divestitures and currency exchange rose 8%. Operating loss improved by 8% to $548.4 million. Adjusted operating income decreased by 7% to $431.6 million, with adjusted operating margin falling to 18.4%. Gross margin declined to 35.4% from 40.2%, attributed to higher costs including commodity costs and tariffs.",
            "link": "https://www.markets.news/headlines/332f4344-f54d-4903-a9fe-e4b8572f0eac",
            "pub_date": "2026-02-27 00:54:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "University of Phoenix offers support for working parents and caregivers through flexible learning and services. Feb. 26, 2026.",
            "id": "ae847ada-12c3-4192-a0d4-e5a0a41ff0c9",
            "description": "University of Phoenix is emphasizing its support system for working parents and caregivers in a press release dated February 26, 2026. The institution acknowledges the challenges faced by working parents and caregivers and aims to provide assistance through flexible learning options and useful services. This initiative is aimed at helping individuals balance their responsibilities effectively. The program offers resources to support families with childcare and other caregiving needs. Interested individuals can access these services by reaching out to University of Phoenix.",
            "link": "https://www.markets.news/headlines/ae847ada-12c3-4192-a0d4-e5a0a41ff0c9",
            "pub_date": "2026-02-27 00:55:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2c8bfa70-27e2-489b-af18-66283c63e684",
            "description": "Taliban spox: ‘Here for this moment: - Two Pakistani military posts in the Nawo area of Nangarhar's Dor Baba district.\n- 3 posts in the Anargi area of Gushte.\n- And 2 posts in the Doklam area of Konar Naray district were captured in total.’",
            "link": "https://www.markets.news/headlines/2c8bfa70-27e2-489b-af18-66283c63e684",
            "pub_date": "2026-02-27 00:46:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp client develops unique walking cane for added support and style. Includes better quality design.",
            "id": "515c8a2c-f031-4ef3-b3b6-36235e891502",
            "description": "An inventor from Rome, N.Y., recently unveiled a new walking cane design in Pittsburgh on February 26, 2026. The creator shared that the inspiration behind the invention was to offer not only sturdy support but also a sleek and visually appealing accessory. This UNIQUELY DESIGNED AND BETTER QUALITY CANE aims to provide users with both functionality and style. The cane's innovative design not only serves as a mobility aid but also doubles as a symbolic centerpiece.",
            "link": "https://www.markets.news/headlines/515c8a2c-f031-4ef3-b3b6-36235e891502",
            "pub_date": "2026-02-27 00:46:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mark Farrah Associates analyzed 2024 Medical Loss Ratio (MLR) and Rebates data from HHS report. Details at markfarrah.com.",
            "id": "7d575c72-b551-43ab-b848-806c19ff781f",
            "description": "On February 26, 2026, in Pittsburgh, the latest Healthcare Business Strategy report highlighted key insights from the 2024 MLR report published by the Department of Health and Human Services (HHS). The report, by Mark Farrah Associates available at www.markfarrah.com, delved into the Affordable Care Act's (ACA) MLR.",
            "link": "https://www.markets.news/headlines/7d575c72-b551-43ab-b848-806c19ff781f",
            "pub_date": "2026-02-27 00:47:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a9cff5f4-b2b5-4e62-badd-552ae6058646",
            "description": "Viridien reports 2025 yearly outcomes with a revenue increase of 15% compared to last year.",
            "link": "https://www.markets.news/headlines/a9cff5f4-b2b5-4e62-badd-552ae6058646",
            "pub_date": "2026-02-27 00:47:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Technip Energies plans to appoint John O’Higgins to succeed Joseph Rinaldi as Chair of Board of Directors in 2026.",
            "id": "cd2e5fe8-ceca-4731-8dbf-84a6efc88514",
            "description": "Technip Energies has revealed that Mr. Joseph Rinaldi, the current Chair of the Board of Directors, will retire at the end of his current term after the 2026 Annual General Meeting and will not be seeking reappointment. The Board plans to propose Mr. John O’Higgins as a new member of the Board at the 2026 AGM and have selected him to take over as Chair after assuming the position of Non-Executive Director as approved by shareholders at the same meeting.",
            "link": "https://www.markets.news/headlines/cd2e5fe8-ceca-4731-8dbf-84a6efc88514",
            "pub_date": "2026-02-27 00:47:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6f24e22a-3b52-4b08-9151-a59ee5f40414",
            "description": "Michelin announces 2025 segment restatement due to new Polymer Composite Solutions segment creation.",
            "link": "https://www.markets.news/headlines/6f24e22a-3b52-4b08-9151-a59ee5f40414",
            "pub_date": "2026-02-27 00:47:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9796e8f2-f898-486c-8813-b6bbb77d69ce",
            "description": "Marimekko Corp bought back shares on 26 Feb 2026.",
            "link": "https://www.markets.news/headlines/9796e8f2-f898-486c-8813-b6bbb77d69ce",
            "pub_date": "2026-02-27 00:47:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "eClinical Solutions announces 2025 achievements, adding 20+ new customers, now serves 18 of top 50 pharma companies. Future innovations to accelerate clinical trials.",
            "id": "aa92c196-9868-47c8-8a5f-b465dee9d74c",
            "description": "In Boston, eClinical Solutions LLC has revealed its milestones for 2025 and upcoming innovations for 2026. The company, known for its digital clinical software and services, aims to enhance the clinical research lifecycle to accelerate the delivery of innovative therapies to patients. In the past year, eClinical Solutions added more than 20 new customers to its client base, consisting of biopharma and CRO firms. Notably, they now serve 18 of the top 50 global pharmaceutical companies. This expansion highlights the company's commitment to supporting leaders in clinical trials.",
            "link": "https://www.markets.news/headlines/aa92c196-9868-47c8-8a5f-b465dee9d74c",
            "pub_date": "2026-02-27 00:48:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Study finds lack of brand differentiation in auto parts retailers, focusing on customer experience and trust as key drivers of loyalty and future spending.",
            "id": "8da50b8c-88ef-40da-99e5-3c84aa3391df",
            "description": "A recent study revealed that there is minimal distinction between automotive parts retailers, highlighting customer experience and trust as the main factors influencing loyalty and potential future spending. The study was conducted in Peachtree Corners, Georgia on February 26, 2026. Market Force Information®, a prominent company specializing in customer insights, conducted the research. The data indicates that customer loyalty and future expenditure are heavily reliant on positive interactions and trust within the automotive parts retail sector.",
            "link": "https://www.markets.news/headlines/8da50b8c-88ef-40da-99e5-3c84aa3391df",
            "pub_date": "2026-02-27 00:49:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Capgemini chosen by TELUS for network automation initiative, marking a shift towards autonomous telecom networks.",
            "id": "a1c66343-ebc5-42fc-a399-36040a079cdc",
            "description": "In a recent announcement, Capgemini revealed that it has secured a partnership with TELUS, a prominent communications technology company. The collaboration aims to revolutionize TELUS' network operations through an automation project. This strategic alliance solidifies Capgemini's position as a pioneer in Canada's autonomous network transformation sector, showcasing groundbreaking advancements in telecom technology. Transitioning from manual, rules-driven processes to intent-driven and self-regulating systems, autonomous networks represent a shift towards more intelligent infrastructure capable of identifying irregularities.",
            "link": "https://www.markets.news/headlines/a1c66343-ebc5-42fc-a399-36040a079cdc",
            "pub_date": "2026-02-27 00:50:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}