{
    "data": [
        {
            "title": "",
            "id": "3ce8992d-7f6b-4c55-81dd-bb4bca8839c4",
            "description": "Lebanon military: 'Within the framework of combating drug trafficking in various Lebanese regions, and following precise surveillance and monitoring operations, a patrol from the Directorate of Intelligence managed to seize a mobile laboratory inside a van equipped for",
            "link": "https://www.markets.news/headlines/3ce8992d-7f6b-4c55-81dd-bb4bca8839c4",
            "pub_date": "2026-02-27 22:26:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JBT Marel completed a major renovation of its Customer Innovation Center in Lakeland, Florida, becoming the premier destination for sustainable food tech.",
            "id": "055cff36-d492-402d-9f02-03e1407871dc",
            "description": "In Lakeland, Florida, JBT Marel, a leading provider of advanced automation solutions for the food and beverage sector, has revealed its updated Customer Innovation Center. The revamped facility serves as the company's main customer hub for sustainable food technology, covering the entire production process from fresh produce to ready-to-eat meals, beverages, and dairy products. With numerous CIC locations globally, JBT Marel's facilities offer customers the opportunity to collaborate closely with specialists.",
            "link": "https://www.markets.news/headlines/055cff36-d492-402d-9f02-03e1407871dc",
            "pub_date": "2026-02-27 22:29:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ethereum Foundation introduces Project Odin for sustainable funding, embedding advisors with key teams like Vyper. Initial cohort already underway.",
            "id": "2e1caa39-e18e-49b8-b031-38b73276be45",
            "description": "A 12-month program by EF involves embedding advisors within critical infrastructure teams such as Vyper to establish sustainable funding methods beyond grants. The inaugural cohort of this program is currently in progress.",
            "link": "https://www.markets.news/headlines/2e1caa39-e18e-49b8-b031-38b73276be45",
            "pub_date": "2026-02-27 22:30:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. leads with world's first live 6G trial in Texas by Ericsson, showcasing AI robotics & video streaming.",
            "id": "d82b87f6-d7e3-4a61-b963-6d43395c3195",
            "description": "A significant development promotes United States' forefront position in AI-driven 6G technology. The showcase features AI-powered robotics and video streaming through cloud-based processing using cutting-edge 6G centimeter wave spectrum. This demonstration utilizes cloud-native infrastructure and an Ericsson test bed device. The event took place in the U.S., highlighting the country's advancement in the field.",
            "link": "https://www.markets.news/headlines/d82b87f6-d7e3-4a61-b963-6d43395c3195",
            "pub_date": "2026-02-27 22:30:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b4ac6652-845e-44f8-9d61-ab595b276249",
            "description": "Keating has reported recent stock transactions.",
            "link": "https://www.markets.news/headlines/b4ac6652-845e-44f8-9d61-ab595b276249",
            "pub_date": "2026-02-27 22:30:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ideal Power (Nasdaq: IPWR) to host Q4 & full year 2025 results conference call on March 10, 2026, at 10 AM Eastern Time.",
            "id": "027a9f7d-729a-44e7-8b43-9be75224db9a",
            "description": "In Austin, Texas on February 27, 2026, Ideal Power Inc. (Nasdaq: IPWR) unveiled their groundbreaking B-TRAN® bidirectional semiconductor power switch. This innovative technology has received extensive patents and marks a significant advancement in the industry. The company's management is set to conduct a session...",
            "link": "https://www.markets.news/headlines/027a9f7d-729a-44e7-8b43-9be75224db9a",
            "pub_date": "2026-02-27 22:22:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CW BANCORP announces $0.23 quarterly dividend, payable on April 1, 2026.",
            "id": "2da2e7dd-9421-4930-8491-36c7ae001dd6",
            "description": "In Irvine, California on February 27, 2026, CW BANCORP (OTCQX: CWBK), the parent company of CommerceWest Bank, disclosed that its Board of Directors has sanctioned a quarterly cash dividend. The dividend, set at $0.23 per common share, is scheduled for disbursement on April 1, 2026.",
            "link": "https://www.markets.news/headlines/2da2e7dd-9421-4930-8491-36c7ae001dd6",
            "pub_date": "2026-02-27 22:22:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Atrium Therapeutics raised $270M to develop RNA medicines for rare genetic cardiomyopathies, targeting PRKAG2 and PLN syndromes.",
            "id": "44b53b1a-4a50-48a5-b056-763aaf8cfc39",
            "description": "A new branch resulting from Novartis AG's purchase of Avidity Biosciences is making progress in specialized cardiology initiatives through a focused RNA delivery system. Key candidates ATR 1072 and ATR 1086 are slated to start clinical trials for PRKAG2 syndrome and PLN cardiomyopathy. The development is centered in San Diego and was announced on February 27th.",
            "link": "https://www.markets.news/headlines/44b53b1a-4a50-48a5-b056-763aaf8cfc39",
            "pub_date": "2026-02-27 22:22:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Philip N. Diehl of U.S. Money Reserve attends Paul Hollis' induction as 41st U.S. Mint Director.",
            "id": "60230d98-12da-457b-a662-13a03ef4312c",
            "description": "In Austin, Texas on February 27, 2026, U.S. Money Reserve, a leading private distributor of physical precious metals in the U.S., revealed that their president, Philip N. Diehl, who also served as the 35th Director of the U.S. Mint, was present at the official induction ceremony for Paul Hollis.",
            "link": "https://www.markets.news/headlines/60230d98-12da-457b-a662-13a03ef4312c",
            "pub_date": "2026-02-27 22:22:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "288f5de2-1c5b-4dae-aad9-dfe812cc0f29",
            "description": "BMW TO PUT HUMANOID ROBOTS ON PRODUCTION LINE AT GERMAN PLANT - FT",
            "link": "https://www.markets.news/headlines/288f5de2-1c5b-4dae-aad9-dfe812cc0f29",
            "pub_date": "2026-02-27 22:22:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "375f0d2f-38ac-4484-8fc1-98626922769b",
            "description": "IMF'S MISSION CHIEF FOR UKRAINE GAVIN GRAY SAYS THE SOONER THAT AGREED VAT CHANGES COME INTO EFFECT THE BETTER",
            "link": "https://www.markets.news/headlines/375f0d2f-38ac-4484-8fc1-98626922769b",
            "pub_date": "2026-02-27 22:25:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AB Kauno Energija released non-audited financial statements for 2025 following EU standards.",
            "id": "d036cb21-2aef-49cd-b1a0-8df2cb87fcce",
            "description": "The Company known as AB Kauno Energija, with the stock code 235014830, has had their non-audited condensed Set of Consolidated and Company’s Financial Statements for the year 2025 approved by their board. These financials were prepared in accordance with International Financial Reporting Standards as adopted by the European Union.",
            "link": "https://www.markets.news/headlines/d036cb21-2aef-49cd-b1a0-8df2cb87fcce",
            "pub_date": "2026-02-27 22:26:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MongoDB (MDB) set to report EPS of $0.92 on 2026-03-02. Previous quarter saw EPS beat of $1.06, leading to 22.23% share price increase. Shares currently at $336.61, up 29.96% over 52 weeks. Investors hopeful for positive guidance.",
            "id": "a7acef95-ac99-42ca-ade3-4cf141ac4b4b",
            "description": "MongoDB (NASDAQ: MDB) is scheduled to release its quarterly earnings report on Monday, March 2, 2026. Analysts are projecting an earnings per share (EPS) of $0.92 for MongoDB. Investors are eager for the announcement, anticipating the company to exceed expectations and offer positive guidance for the upcoming quarter. It's crucial for new investors to recognize that guidance can heavily influence stock prices. In the previous quarter, MongoDB surpassed expectations by $1.06, resulting in a 22.23% rise in share price the following day. Looking at the historical performance, in Q3 2026, Q2 2026, Q1 2026, and Q4 2025, the EPS estimates and actual figures were as follows: 0.26/1.32, 0.14/1.00, 0.66/1.00, and 0.67/1.28 respectively, with price changes of 22.23%, 37.96%, 12.84%, and -26.94%. As of February 26, MongoDB shares were trading at $336.61, reflecting a 29.96% increase over the past year. For more details, the full story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/a7acef95-ac99-42ca-ade3-4cf141ac4b4b",
            "pub_date": "2026-02-27 22:19:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Credo Technology Group to report EPS of $0.84 on March 2, 2026. Past earnings beat by $0.25 led to 10.12% stock increase. Trading at $114.48.",
            "id": "23d9f58a-66ac-4714-9a83-e0a536736407",
            "description": "Credo Technology Group (NASDAQ: CRDO) is set to release its quarterly earnings report on March 2, 2026, with analysts expecting an EPS of $0.84. In the previous quarter, the company exceeded expectations by $0.25, resulting in a 10.12% increase in share price the following day. The stock was trading at $114.48 as of February 26. Investors are eagerly awaiting the announcement, hoping for positive guidance for the next quarter, as future projections heavily impact stock prices. It's important for new investors to consider these projections rather than just past performance.",
            "link": "https://www.markets.news/headlines/23d9f58a-66ac-4714-9a83-e0a536736407",
            "pub_date": "2026-02-27 22:19:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AST SpaceMobile (NASDAQ: ASTS) to report $-0.19 EPS on 2026-03-02, investors watch for guidance. Shares at $85.76 on 26 Feb.",
            "id": "58e72d89-7295-4c57-ab5c-ee03dbfaa656",
            "description": "AST SpaceMobile (NASDAQ: ASTS) is scheduled to release its latest quarterly earnings report on March 2, 2026. Analysts predict an EPS of $-0.19 for the company. Investors are eager to see if AST SpaceMobile will surpass this estimate and offer positive guidance for the upcoming quarter. The company's previous earnings report showed an EPS miss of $0.22, resulting in a 1.18% share price drop. In the last four quarters, AST SpaceMobile has frequently missed EPS estimates, impacting its stock price. Despite this, the company's shares were trading at $85.76 on February 26. The upcoming earnings report will be crucial for investors and could influence the stock's performance moving forward.",
            "link": "https://www.markets.news/headlines/58e72d89-7295-4c57-ab5c-ee03dbfaa656",
            "pub_date": "2026-02-27 22:19:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kaspi.kz (NASDAQ: KSPI) to report earnings of $3.10 per share on 2026-03-02. Past misses led to price increases. Stock down 30.85% in 52 weeks.",
            "id": "274fd6a0-a504-42d4-bd84-af53758bf3a3",
            "description": "Kaspi.kz is set to release its quarterly earnings on March 2, 2026, with analysts expecting an EPS of $3.10. The company aims to surpass this estimate and provide positive guidance for future growth. In the previous quarter, Kaspi.kz missed its EPS estimate by $1.58, resulting in a 1.83% increase in share price the next day. The stock was trading at $71.29 on February 26, marking a 30.85% decrease over the past 52 weeks. Investors should focus not only on earnings beat/miss but also on forecasted guidance, as it can significantly impact stock prices. Full details are available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/274fd6a0-a504-42d4-bd84-af53758bf3a3",
            "pub_date": "2026-02-27 22:19:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "98b3cdc8-5417-4c8f-9435-07ed9ef37121",
            "description": "OPENAI’S ALTMAN TELLS STAFF GOING TO SEE IF THERE IS A DEAL WITH THE DOW THAT ALLOWS OUR MODELS TO BE DEPLOYED IN CLASSIFIED ENVIRONMENTS - REPORTS",
            "link": "https://www.markets.news/headlines/98b3cdc8-5417-4c8f-9435-07ed9ef37121",
            "pub_date": "2026-02-27 22:19:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0a4e4bb3-547f-485b-a4d7-3bc64450337a",
            "description": "COLOMBIA COMMERCE MINISTER SAYS WILL PROPOSE RECIPROCAL TARIFF OF 50% ON SOME ECUADOREAN GOODS",
            "link": "https://www.markets.news/headlines/0a4e4bb3-547f-485b-a4d7-3bc64450337a",
            "pub_date": "2026-02-27 22:19:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "598083a4-95d1-45f5-9411-21df83be1d23",
            "description": "OPENAI’S ALTMAN TELLS STAFF CO WORKING ON A DEAL THAT MIGHT HELP SOLVE THE IMPASSE BETWEEN ANTHROPIC AND PENTAGON - WSJ",
            "link": "https://www.markets.news/headlines/598083a4-95d1-45f5-9411-21df83be1d23",
            "pub_date": "2026-02-27 22:19:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones futures up after Trump speech. Nvidia earnings awaited. President's State of the Union address noted.",
            "id": "a90fb1c9-41d7-4b8e-b9a1-e2b469fc1217",
            "description": "Following President Donald Trump's State of the Union speech, futures saw an increase, particularly with a focus on Nvidia's earnings. On Tuesday, Dow Jones Futures experienced a rise, indicating positive market sentiment. Investors are closely monitoring these developments, eager to see the impact of Trump's speech and Nvidia's performance.",
            "link": "https://www.markets.news/headlines/a90fb1c9-41d7-4b8e-b9a1-e2b469fc1217",
            "pub_date": "2026-02-27 22:19:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}