{
    "data": [
        {
            "title": "Playtika Holding (PLTK) beats estimated earnings by 26.32% in Q4 with EPS of $0.24, revenue up $28.50 million from last year.",
            "id": "e16c0ae7-8f3b-4d92-97c6-bb3fa3b2c160",
            "description": "Playtika Holding (NASDAQ: PLTK) released its Q4 earnings report on February 26, 2026, at 06:35 AM. The report revealed that Playtika exceeded estimated earnings by 26.32%, showcasing an EPS of $0.24 compared to the expected $0.19. Additionally, the revenue showed an increase of $28.50 million from the corresponding period in the previous year. Investors should take note of these impressive figures from Playtika Holding's recent announcement. For more detailed information, the full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/e16c0ae7-8f3b-4d92-97c6-bb3fa3b2c160",
            "pub_date": "2026-02-26 19:43:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4917114c-2f39-4c4d-9ced-9c8088c0202b",
            "description": "SWEDEN'S FRA SIGNAL INTELLIGENCE AGENCY: WE HAVE RECENTLY CALLED ON ACTORS IN THE SWEDISH ENERGY SECTOR TO BE MORE VIGILANT",
            "link": "https://www.markets.news/headlines/4917114c-2f39-4c4d-9ced-9c8088c0202b",
            "pub_date": "2026-02-26 19:44:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TCL marks the conclusion of the 2026 Olympic Winter Games, showcasing technology for athletes and audiences.",
            "id": "aedeac22-391d-4105-a011-5acfb8b587a3",
            "description": "TCL, a prominent global technology company and official partner of the Olympic and Paralympic Games, highlighted their vision of \"It's Your Greatness\" during the recent conclusion of the Olympic Winter Games. The event, considered as one of the world's most significant sporting events, concluded on February 26, 2026, in Milan. This marks a monumental occasion for TCL as they continue to be involved in global sports partnerships.",
            "link": "https://www.markets.news/headlines/aedeac22-391d-4105-a011-5acfb8b587a3",
            "pub_date": "2026-02-26 19:44:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9fdbc8d2-c6b6-41a5-be35-a8c5205aed4f",
            "description": "SWEDEN'S FRA SIGNAL INTELLIGENCE AGENCY: THE BACKGROUND IS THAT THE POLISH ENERGY SECTOR WAS ATTACKED AT THE END OF DECEMBER",
            "link": "https://www.markets.news/headlines/9fdbc8d2-c6b6-41a5-be35-a8c5205aed4f",
            "pub_date": "2026-02-26 19:44:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "United Parks & Resorts (NYSE: PRKS) Q4 earnings missed estimates by -32.76%, with EPS of $0.39 vs $0.58. Revenue down $10.84M.",
            "id": "f37c8ef7-f8eb-46c9-a389-298d9a56eb4a",
            "description": "United Parks & Resorts (NYSE: PRKS) recently revealed its Q4 earnings on Thursday, February 26, 2026 at 06:30 AM. The earnings report shows that the company missed estimated earnings by -32.76%, with an EPS of $0.39 compared to the expected $0.58. Revenue saw a decline of $10.84 million from the previous year. Overall, the company fell short of expectations for the quarter, leading to a decrease in revenue compared to the same period last year. For a more detailed analysis, the full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/f37c8ef7-f8eb-46c9-a389-298d9a56eb4a",
            "pub_date": "2026-02-26 19:45:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Traders predict $80,000 target for Bitcoin as ETF inflows boost price recovery, aiming for $75,000-$80,000 rebound.",
            "id": "a9e0938c-f975-44e2-9263-a46bf87eaf38",
            "description": "The resurgence of investments in a spot Bitcoin ETF could potentially drive a Bitcoin price upswing, with indications pointing towards a possible climb to between $75,000 and $80,000.",
            "link": "https://www.markets.news/headlines/a9e0938c-f975-44e2-9263-a46bf87eaf38",
            "pub_date": "2026-02-26 19:45:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f006cda9-bf8b-4253-9737-229907407eb3",
            "description": "ELI LILLY: ORFORGLIPRON SHOWED CLINICALLY MEANINGFUL IMPROVEMENTS FROM BASELINE ACROSS KEY CARDIOVASCULAR RISK FACTORS",
            "link": "https://www.markets.news/headlines/f006cda9-bf8b-4253-9737-229907407eb3",
            "pub_date": "2026-02-26 19:36:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3b47b897-28d7-4f19-8a93-885df450f52a",
            "description": "ELI LILLY: SUBMITTED ORFORGLIPRON TO REGULATORS IN OVER 40 COUNTRIES, WITH POTENTIAL US ACTION FOR OBESITY IN Q2 2026",
            "link": "https://www.markets.news/headlines/3b47b897-28d7-4f19-8a93-885df450f52a",
            "pub_date": "2026-02-26 19:36:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "69b9fdf9-7bf3-4c6b-ad3d-214a06666648",
            "description": "ELI LILLY: TREATMENT DISCONTINUATION RATES DUE TO ADVERSE EVENTS WERE 9.7% (36 MG) FOR ORFORGLIPRON VS. 4.9% (14 MG) FOR ORAL SEMAGLUTIDE",
            "link": "https://www.markets.news/headlines/69b9fdf9-7bf3-4c6b-ad3d-214a06666648",
            "pub_date": "2026-02-26 19:36:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NCR Voyix (NYSE: VYX) Q4 earnings report shows $0.31 EPS, beating estimate by 14.81%. Revenue increased by $38M.",
            "id": "7a2cce35-7020-484a-8185-88ad28928db4",
            "description": "NCR Voyix (NYSE: VYX) recently released its Q4 earnings on February 26, 2026, at 06:30 AM. The earnings report revealed that the company surpassed estimated earnings by 14.81%, with an EPS of $0.31 compared to an estimated $0.27. Revenue saw an increase of $38.00 million from the previous year. In terms of past earnings, NCR Voyix has consistently outperformed on EPS. For a more detailed analysis, the full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/7a2cce35-7020-484a-8185-88ad28928db4",
            "pub_date": "2026-02-26 19:38:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Perrigo Q4 earnings missed estimate by 2.53%, EPS $0.77 vs. $0.79; Revenue unchanged YoY. Full details on Benzinga.com.",
            "id": "e0e1effc-aabc-43b3-bd5e-366241cce1de",
            "description": "On Thursday, February 26, 2026, Perrigo (NYSE: PRGO) released its Q4 earnings report at 06:31 AM. Despite an estimated EPS of $0.79, the actual EPS stood at $0.77, marking a -2.53% miss. Revenue for the quarter remained unchanged from the previous year. In the last quarter, Perrigo exceeded EPS expectations. For more details, the complete story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/e0e1effc-aabc-43b3-bd5e-366241cce1de",
            "pub_date": "2026-02-26 19:38:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Teleflex (NYSE: TFX) Q4 earnings missed estimates by -48.4%, reporting EPS of $1.93 vs. $3.74 estimate. Revenue down $226.42 million.",
            "id": "c0b42d04-16d9-48e6-a58d-b94cfbc47a70",
            "description": "Teleflex (NYSE: TFX) disclosed its quarterly earnings on February 26, 2026, at 06:30 AM. The earnings report revealed a significant miss on estimated earnings, with an EPS of $1.93 compared to the projected $3.74, marking a -48.4% difference. Additionally, revenue experienced a decline of $226.42 million compared to the corresponding period in the prior year. For further details on Teleflex's previous earnings performance, refer to the complete article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/c0b42d04-16d9-48e6-a58d-b94cfbc47a70",
            "pub_date": "2026-02-26 19:38:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "United Parks & Resorts Inc. reported Q4 2025: 4.8M guests, $373.5M revenue, $15.1M net income, Adjusted EBITDA $115.2M. Fiscal 2025: 21.2M guests, $1.7B revenue, $168.4M net income, Adjusted EBITDA $605.1M. Share repurchases and animal rescue efforts highlighted. Investment in new rides and attractions expected to boost attendance and revenue in 2026. Declines in attendance and revenue per capita reported. CEO optimistic for financial performance in 2026. Conference call held to discuss results. Non-GAAP financial measures used in reporting. Numerous accolades received in 2025. Future uncertainties highlighted in forward-looking statements. Contact info provided. [Char. count: 392]",
            "id": "3ac366d0-c2a5-4f4c-9dab-e9985a8a8b0b",
            "description": "United Parks & Resorts Inc. reported its financial results for Q4 2025 and fiscal year 2025. In Q4 2025, attendance was 4.8 million guests, revenue was $373.5 million, net income was $15.1 million, and adjusted EBITDA was $115.2 million. For fiscal year 2025, attendance was 21.2 million guests, revenue was $1.7 billion, net income was $168.4 million, and adjusted EBITDA was $605.1 million. This marks a decrease in revenue and attendance from the previous year. The company also engaged in share repurchases and animal rescue efforts during the period. Key performance metrics saw a decrease in revenue per capita and admission per capita, with an increase in in-park per capita spending. The company outlined plans for 2026, focusing on new attractions and cost management to enhance financial performance. The company's CEO expressed confidence in the initiatives. The company also received accolades in 2025, and highlighted new rides and attractions planned for 2026. Additional information, including non-GAAP financial measures, statements regarding forward-looking information, and contact information, was provided in the news article.",
            "link": "https://www.markets.news/headlines/3ac366d0-c2a5-4f4c-9dab-e9985a8a8b0b",
            "pub_date": "2026-02-26 19:38:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gate obtains Maltese payment license to grow EU fiat and stablecoin services, can now process payments in EU under PSD2 rules.",
            "id": "5444ad70-6dc8-40a7-b5d8-c52505376c7d",
            "description": "Gate has been granted a license to conduct payment transactions within the European Union. This license permits them to carry out direct debits and credit transfers in accordance with the PSD2 regulations.",
            "link": "https://www.markets.news/headlines/5444ad70-6dc8-40a7-b5d8-c52505376c7d",
            "pub_date": "2026-02-26 19:39:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wolverine World Wide (NYSE: WWW) beats Q4 earnings with EPS of $0.45 (2.27% above estimated $0.44). Revenue up $22.8 million.",
            "id": "a8ea9335-140b-4cfd-8344-78024072adf2",
            "description": "Wolverine World Wide (NYSE: WWW) shared its Q4 earnings on February 26, 2026, at 06:30 AM. The key takeaways from the report include surpassing estimated earnings by 2.27%, with an EPS of $0.45 compared to the expected $0.44. Revenue also saw an increase of $22.80 million compared to the previous year. In previous earnings, the company outperformed on EPS. Check out the complete story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/a8ea9335-140b-4cfd-8344-78024072adf2",
            "pub_date": "2026-02-26 19:40:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Weber is recalling more than 3.2 million metal wire bristle grill brushes due to an ingestion hazard.",
            "id": "bddb95b8-73ef-47c2-b768-545abd522ccf",
            "description": "Product Name: Metal Wire Bristle Grill Brushes are being recalled due to a hazard where small metal wire bristles can come loose from the brushes and adhere to the grill or food. This poses a risk of ingestion and serious internal injuries, potentially leading to the need for surgery. Consumers are advised to discontinue use of these brushes and should opt for a replacement immediately to ensure safety.",
            "link": "https://www.markets.news/headlines/bddb95b8-73ef-47c2-b768-545abd522ccf",
            "pub_date": "2026-02-26 19:40:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "670cc92c-6a49-477a-be14-ff608980c4c0",
            "description": "RUSSIA'S STATE NUCLEAR CORPORATION ROSATOM SAYS IT WILL CONTINUE FULFILLING ITS OBLIGATIONS UNDER ITS FOREIGN NUCLEAR POWER PLANT PROJECTS - RIA",
            "link": "https://www.markets.news/headlines/670cc92c-6a49-477a-be14-ff608980c4c0",
            "pub_date": "2026-02-26 19:25:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Robo.ai Inc (NASDAQ: AIIO) finishes initial data deliveries in Middle East, affirming and commercializing its business model.",
            "id": "411b38ad-6fd8-4b5c-88a7-09b2dc6a8b60",
            "description": "In Dubai, UAE on February 26, 2026, it was reported that Robo.ai Inc. (NASDAQ: AIIO), a tech firm working on an artificial intelligence machine economy platform, revealed a new partnership. This collaboration follows the signing of a data collection services agreement with DaBoss.AI Inc. No further specific details were disclosed.",
            "link": "https://www.markets.news/headlines/411b38ad-6fd8-4b5c-88a7-09b2dc6a8b60",
            "pub_date": "2026-02-26 19:28:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Neinor Homes reports €122mn net income in FY25 after biggest M&A in Spanish residential sector last decade.",
            "id": "435bde5d-7898-41eb-a096-bdab68f76323",
            "description": "In Madrid, as of February 26, 2026, Neinor Homes closed the fiscal year 2025 with impressive operational and financial achievements. Excluding the impact of acquiring a 79.2% stake in AEDAS, Neinor notarized a total of 2,901 housing units during the year. Of these, 1,891 were part of the fully owned portfolio, while 1,010 belonged to the Asset Management business. The total revenues for 2025 amounted to €697 million. Borja García-Egotxeaga, the CEO of Neinor Homes, described the year as transformational for the company. For more details, the full story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/435bde5d-7898-41eb-a096-bdab68f76323",
            "pub_date": "2026-02-26 19:28:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NexPoint Real Estate Q4 earnings beat estimates with EPS of $0.48 (est. $0.47), revenue down $10.59 million YoY.",
            "id": "7d72b0af-52c1-4b02-b89a-7befd0643c8e",
            "description": "NexPoint Real Estate (NYSE: NREF) disclosed its Q4 earnings on Thursday, February 26, 2026 at 08:00 AM. A noteworthy detail from the report was that the company exceeded anticipated earnings by 2.13%, revealing an EPS of $0.48 compared to the projected $0.47. Revenue experienced a decline of $10.59 million compared to the corresponding period in the prior year. In the previous quarter, NexPoint Real Estate surpassed EPS expectations by $0.09, followed by a subsequent 2.9% decline in the share price. For further details, the complete article is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/7d72b0af-52c1-4b02-b89a-7befd0643c8e",
            "pub_date": "2026-02-26 19:28:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}