{
    "data": [
        {
            "title": "Eric Trump, chief strategy officer of American Bitcoin Corp., emphasizes long-term belief in BTC, focusing on increasing balance sheet with strategic mining investments. Company prioritizes sustainability over chasing hash rates, diverging from industry trend.",
            "id": "fbebfc29-2fb4-4f33-96c7-0ac3f09c0b9c",
            "description": "Eric Trump, co-founder and Chief Strategy Officer of American Bitcoin Corp. (NASDAQ: ABTC), announced that the company's primary long-term goal is to increase the amount of Bitcoin (CRYPTO: BTC) on its balance sheet. During American Bitcoin's fourth-quarter earnings call, Trump disclosed that the company plans to focus on acquiring Bitcoin through mining and purchasing on the open market. He emphasized their belief in Bitcoin's long-term potential and indicated that they will prioritize mining when they can secure profitable deals on equipment, expand operations, and maintain low energy costs. Trump also mentioned that American Bitcoin is not solely focused on hashrates like other miners.",
            "link": "https://www.markets.news/headlines/fbebfc29-2fb4-4f33-96c7-0ac3f09c0b9c",
            "pub_date": "2026-02-27 16:44:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nasdaq down by over 1% as Nvidia shares fall; CNN Money Fear and Greed index moves to 'Fear' zone. Nasdaq Composite falls more than 1% with Nvidia shares dropping over 5%, while Salesforce shares gain around 4%. U.S. initial jobless claims rose by 4,000.",
            "id": "c8291ac3-4ccc-4084-b015-08f00549a360",
            "description": "The CNN Money Fear and Greed index indicated a shift towards fear in market sentiment, reaching the \"Fear\" zone on Thursday. U.S. stocks closed lower, with the Nasdaq Composite experiencing a decline of over 1%. Nvidia Corp. (NASDAQ: NVDA) saw a significant drop of more than 5% despite reporting positive fourth-quarter earnings and revenue. Contrary to this, Salesforce Inc. (NYSE: CRM) shares rose by approximately 4% following better-than-expected financial results for the fourth quarter. Hormel Foods Corp. (NYSE: HRL) released a mixed bag of results for the first quarter of FY26. Additionally, U.S. initial jobless claims increased by 4,000 from the prior week. For more details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/c8291ac3-4ccc-4084-b015-08f00549a360",
            "pub_date": "2026-02-27 16:44:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "db938dba-4da9-4a7d-be6a-9b60494a0e62",
            "description": "CHINA'S COMMERCE MINISTRY: WILL ANNOUNCE TARIFF ADJUSTMENT SEPARATELY",
            "link": "https://www.markets.news/headlines/db938dba-4da9-4a7d-be6a-9b60494a0e62",
            "pub_date": "2026-02-27 16:44:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "096f0b2a-4ce8-4b70-a8b0-3ea10f6d7dc7",
            "description": "CHINA'S COMMERCE MINISTRY: WILL NOT IMPOSE RELEVANT TARIFFS ON SOME IMPORTS FROM CANADA",
            "link": "https://www.markets.news/headlines/096f0b2a-4ce8-4b70-a8b0-3ea10f6d7dc7",
            "pub_date": "2026-02-27 16:45:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6aa11096-a65f-4de0-9788-a78cbb5a57ac",
            "description": "CHINA'S COMMERCE MINISTRY: EFFECTIVE FROM MARCH 1 TO END-2026",
            "link": "https://www.markets.news/headlines/6aa11096-a65f-4de0-9788-a78cbb5a57ac",
            "pub_date": "2026-02-27 16:45:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fd47db1f-db64-48fb-bebb-552caab7732a",
            "description": "CHINA'S COMMERCE MINISTRY: ANNOUNCES ADJUSTMENT TO ANTI-DISCRIMINATION MEASURES AGAINST CANADA",
            "link": "https://www.markets.news/headlines/fd47db1f-db64-48fb-bebb-552caab7732a",
            "pub_date": "2026-02-27 16:45:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walmart to pay $100 million for deceptive delivery driver pay practices, misleading on compensation and tip policies.",
            "id": "ce413a9f-6942-4787-9e45-9f3929e47e99",
            "description": "Walmart has agreed to pay a $100 million settlement in response to accusations of misleading its delivery drivers regarding their compensation, ultimately resulting in significant income loss for the workers. The lawsuit filed by the Federal Trade Commission (FTC) and 11 states alleged that Walmart had deceived its employees about their base pay, incentive pay, and potential tips. The allegations specifically focus on Walmart's Spark Delivery network, which has been operational since 2021. The Spark Program, launched in 2018, enables gig workers to carry out deliveries for Walmart as well as other companies like Home Depot Inc. and 1-800-Flowers.com Inc. The FTC also claimed that Walmart had provided false information to customers by stating that 100% of tips would directly benefit the drivers. Despite being aware of these issues, Walmart allegedly neglected to address them, leading to violations that were highlighted in the complaint.",
            "link": "https://www.markets.news/headlines/ce413a9f-6942-4787-9e45-9f3929e47e99",
            "pub_date": "2026-02-27 16:45:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "35d03726-9852-4f27-9ec7-e25649f0e9e3",
            "description": "NEW WORLD 1H NET LOSS HK$3.73B VS. LOSS HK$6.6B",
            "link": "https://www.markets.news/headlines/35d03726-9852-4f27-9ec7-e25649f0e9e3",
            "pub_date": "2026-02-27 16:34:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ALGO price projected to hit $0.10 by March 2026. Short-term target: $0.089-$0.091, medium-term: $0.085-$0.10.",
            "id": "8afed0da-f340-40ae-9395-2d3381672673",
            "description": "ALGO's price forecast indicates a short-term target of $0.089 to $0.091 within one week, with a medium-term projection ranging from $0.085 to $0.10 over one month. A bullish breakout is expected at the $0.10 mark, indicated as the Upper Bollinger Band. This suggests a critical support level to watch for potential upward momentum.",
            "link": "https://www.markets.news/headlines/8afed0da-f340-40ae-9395-2d3381672673",
            "pub_date": "2026-02-27 16:34:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MARA records $1.7B loss due to Bitcoin drop, plans big move into AI & high‑performance computing.",
            "id": "fe7e198e-35b6-4b8c-9d64-8f7db70153ea",
            "description": "In the latest financial report, MARA disclosed a significant quarterly loss amounting to $1.71 billion. This decrease in earnings was primarily attributed to fair-value markdowns linked to Bitcoin. Despite these setbacks, the company announced plans for a substantial investment in artificial intelligence (AI) and high-performance computing.",
            "link": "https://www.markets.news/headlines/fe7e198e-35b6-4b8c-9d64-8f7db70153ea",
            "pub_date": "2026-02-27 16:39:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CPP Investments and Equinix to acquire atNorth for growth in Nordics; agree on $4.2B financing. Strong AI, hyperscale demand.",
            "id": "40d91fc0-2896-4334-9194-7a869e864356",
            "description": "CPP Investments and Equinix have tentatively agreed on a financing deal worth US$4.2 billion to support atNorth, the top Nordic high-density colocation and built-to-suit company located in REYKJAVÍK, Iceland. This investment is crucial in order to meet the increasing demand for AI, hyperscale, and enterprise services.",
            "link": "https://www.markets.news/headlines/40d91fc0-2896-4334-9194-7a869e864356",
            "pub_date": "2026-02-27 16:27:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c94e3ad2-9d4b-45fa-94d0-77298a2e817f",
            "description": "IRON ORE PORT STOCKPILES IN CHINA HIT RECORD AS MINES ADD SUPPLY",
            "link": "https://www.markets.news/headlines/c94e3ad2-9d4b-45fa-94d0-77298a2e817f",
            "pub_date": "2026-02-27 16:28:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "788846b3-d68a-455b-850d-61667cfb2893",
            "description": "US AIRCRAFT CARRIER GERALD R. FORD ARRIVES IN ISRAEL",
            "link": "https://www.markets.news/headlines/788846b3-d68a-455b-850d-61667cfb2893",
            "pub_date": "2026-02-27 16:31:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea allows Google Maps full operation after approving export of detailed map data, ending long restrictions.",
            "id": "036d9675-5ff9-4b54-81fd-d1f2986703a0",
            "description": "South Korea recently agreed to allow Google to export detailed map data, marking a significant policy shift. This decision reverses a longstanding restriction that had hindered the tool's functionality in the region. The approval opens up new opportunities for Google to enhance its mapping service in South Korea, benefiting both users and the tech company. The move reflects a shift towards greater collaboration between the South Korean government and international tech firms.",
            "link": "https://www.markets.news/headlines/036d9675-5ff9-4b54-81fd-d1f2986703a0",
            "pub_date": "2026-02-27 16:22:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Duni Group buys Solserv Solutions & Services Europe AB, operating in composting solutions, for 100% shares. Acquisition under Duniform brand.",
            "id": "c45a2c51-8c56-4783-a9b7-607936cfc3dd",
            "description": "In Malmo, Sweden, on February 27, 2026, Duni AB has successfully purchased all the shares of Solserv Solutions & Services Europe AB (Solserv). Solserv specializes in composting solutions, industrial machinery, and aftermarket services. This acquisition, done through the Duniform brand, means Duni AB now owns 100% of Solserv.",
            "link": "https://www.markets.news/headlines/c45a2c51-8c56-4783-a9b7-607936cfc3dd",
            "pub_date": "2026-02-27 16:23:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kioxia appoints Yoshihiko Kawamura as CFO, effective April 1, 2026. Kawamura brings extensive international experience.",
            "id": "9a0e9eb1-7f76-46bb-a597-ff5334804390",
            "description": "Kioxia Holdings Corporation in Tokyo has introduced Yoshihiko Kawamura as their new CFO, starting on April 1, 2026. Kawamura has a strong background with experience at Mitsubishi Corporation’s U.S. headquarters, as the General Manager in Chicago, and a prior role at the World Bank. Additionally, he held senior positions at Hitachi, Ltd. The company's stock in Tokyo is listed as 285A.",
            "link": "https://www.markets.news/headlines/9a0e9eb1-7f76-46bb-a597-ff5334804390",
            "pub_date": "2026-02-27 16:23:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hurricane Electric adds PoP at OADC DUR1 in Durban, South Africa for enhanced connectivity. Located at 3 Oppenheimer Road with access to global providers and Internet exchanges.",
            "id": "a75edb3e-b3dd-4d9c-8c4d-ec61ae531694",
            "description": "In Durban, South Africa, Hurricane Electric, the largest IPv6-native Internet backbone, has set up a new Point of Presence (PoP) at Open Access Data Centres DUR1, found at 3 Oppenheimer Road, Durban 4000. This PoP provides access to regional and global telecommunications providers and Internet exchanges, offering a secure, carrier-neutral colocation environment. Durban is Africa's busiest port city and a significant commercial hub.",
            "link": "https://www.markets.news/headlines/a75edb3e-b3dd-4d9c-8c4d-ec61ae531694",
            "pub_date": "2026-02-27 16:23:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b3b36b39-54a1-4783-932d-7462ed423275",
            "description": "IAEA: IAEA-BROKERED LOCAL CEASEFIRE NOW IN EFFECT TO ENABLE RESTORATION OF THE 330 KV BACKUP POWER SUPPLY TO THE ZAPORIZHZHYA NUCLEAR POWER PLANT",
            "link": "https://www.markets.news/headlines/b3b36b39-54a1-4783-932d-7462ed423275",
            "pub_date": "2026-02-27 16:23:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Injective (INJ) aims for $3.60 rebound by mid-March 2026, currently trading at $3.27. Analysts foresee potential recovery to $6.50 as it nears key resistance levels.",
            "id": "b409fff2-88f7-485c-bdb9-f83802b2f9b8",
            "description": "The cryptocurrency Injective (INJ) is currently trading at $3.27, showing a neutral Relative Strength Index (RSI) and technical consolidation. Analysts are forecasting a recovery potential ranging from $3.60 to $6.50 as INJ nears crucial resistance breakout points.",
            "link": "https://www.markets.news/headlines/b409fff2-88f7-485c-bdb9-f83802b2f9b8",
            "pub_date": "2026-02-27 16:25:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "05af6f97-bb01-4d01-be87-40931ad0656a",
            "description": "China Containerized Freight Index dropped by 4% w/w to 1,044.57. $CCFI",
            "link": "https://www.markets.news/headlines/05af6f97-bb01-4d01-be87-40931ad0656a",
            "pub_date": "2026-02-27 16:12:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}