{
    "data": [
        {
            "title": "",
            "id": "efde86da-b6ca-4506-be18-1ee53014047c",
            "description": "COCOA MARKET SHOULD SEE CONTINUED VOLATILITY IN 2026 -HEDGEPOINT GLOBAL MARKETS",
            "link": "https://www.markets.news/headlines/efde86da-b6ca-4506-be18-1ee53014047c",
            "pub_date": "2026-02-27 21:16:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Faruqi & Faruqi, LLP investigating claims on behalf of investors of Driven Brands Holdings for significant losses. Contact for options.",
            "id": "bd2fce9f-1fd6-43ff-8490-b9211e75819d",
            "description": "Securities Litigation Partner James Wilson from Faruqi & Faruqi, LLP is urging investors who have experienced substantial losses in Driven Brands to reach out to him directly. If you have suffered significant losses in Driven Brands stocks or options and wish to explore your options, Wilson encourages you to contact him.",
            "link": "https://www.markets.news/headlines/bd2fce9f-1fd6-43ff-8490-b9211e75819d",
            "pub_date": "2026-02-27 21:17:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aukce luxusních položek Gwyneth Paltrow: 24.-25. března 2026 v Beverly Hills. Online přihazování od 25. února 2026.",
            "id": "20b566f1-8277-480a-abd3-cc1e7b3dbf2d",
            "description": "Live auction: March 24th and 25th, 2026 - The Peninsula Beverly Hills hotel Online bidding starts: February 25th, 2026 BEVERLY HILLS, California, February 27th, 2026 -- Julien's Auctions proudly presents Bold Luxury: Stylish lexicon of Gwyneth Paltrow & archival selection...",
            "link": "https://www.markets.news/headlines/20b566f1-8277-480a-abd3-cc1e7b3dbf2d",
            "pub_date": "2026-02-27 21:17:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d9ccc531-6993-4fa2-9fc3-4e795c6108c0",
            "description": "BOE'S PILL SAYS DISINFLATION NOT COMPLETE, UNDERLYING PRESSURES KEY",
            "link": "https://www.markets.news/headlines/d9ccc531-6993-4fa2-9fc3-4e795c6108c0",
            "pub_date": "2026-02-27 21:17:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK gambling regulator considers allowing crypto for online betting after strict checks; FCA authorization needed for usage - chief Tim Miller.",
            "id": "2b3763ff-bf57-496b-a633-93e953610b4f",
            "description": "Tim Miller, the chief of the Gambling Commission, stated that any potential launch would necessitate adhering to rigorous affordability and suitability assessments. He emphasized that cryptocurrency transactions would have to be authorized by the FCA.",
            "link": "https://www.markets.news/headlines/2b3763ff-bf57-496b-a633-93e953610b4f",
            "pub_date": "2026-02-27 21:18:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mexico is top spring break destination for U.S. residents. Travel to Mexico reopens amid pandemic with key guidance.",
            "id": "36f3f728-3827-4a51-801b-1f2cdb459d5f",
            "description": "As per sales data from Squaremouth, Mexico has maintained its position as the preferred international spring break destination for U.S. residents for over five years running. After the recent lift of the shelter-in-place restrictions, this trend is likely to continue. St. Petersburg, Florida, was the location where this data was reported on February 27, 2026, through PRNewswire. This information showcases the enduring popularity of Mexico for American travelers during the spring break season.",
            "link": "https://www.markets.news/headlines/36f3f728-3827-4a51-801b-1f2cdb459d5f",
            "pub_date": "2026-02-27 21:19:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c3420b0a-fa4b-47e8-9e1d-df0bc2baaf76",
            "description": "Pentagon's Michael on Anthropic: The US offered concessions",
            "link": "https://www.markets.news/headlines/c3420b0a-fa4b-47e8-9e1d-df0bc2baaf76",
            "pub_date": "2026-02-27 21:20:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitwise's Matt Hougan refutes Bitcoin conspiracy theories, attributing BTC's decline to people selling due to various reasons.",
            "id": "fa904d15-61db-43f3-81c4-0bbb8c7cabfb",
            "description": "Bitwise's Chief Investment Officer, Matt Hougan, refuted conspiracy theories linking Jane Street and others to Bitcoin's recent decline, stating that individuals who were heavily invested in Bitcoin opted to sell their holdings as Bitcoin hovered within key Fibonacci levels. Hougan dismissed the ongoing trend of conspiracy theories targeting different firms weekly and highlighted the real reasons behind the sell-off: investors liquidating their Bitcoin via spot transactions, closing leveraged positions, and writing calls against their assets. This sell-off was primarily driven by factors such as four-year cycle patterns, concerns regarding quantum computing, interests in AI startups, among others. Hougan indicated that the majority of sellers have completed their transactions, suggesting that the situation may stabilize. For further details, the full story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/fa904d15-61db-43f3-81c4-0bbb8c7cabfb",
            "pub_date": "2026-02-27 21:21:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Antier introduces enterprise white-label crypto wallet in Latin America in just 60 days for improved efficiency.",
            "id": "dd55e9d6-0483-4c29-b0ff-5c864e4d7ca9",
            "description": "In New Delhi on February 27, 2026, Antier introduced a high-speed white-label cryptocurrency wallet tailored for LATAM businesses. This platform is designed for performance rather than hype, surpassing traditional bank projects in speed and surpassing generic wallets in security. The wallet is optimized for handling payroll, remittances, and other transactions efficiently.",
            "link": "https://www.markets.news/headlines/dd55e9d6-0483-4c29-b0ff-5c864e4d7ca9",
            "pub_date": "2026-02-27 21:21:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "nLIGHT, Inc. (Nasdaq: LASR) to attend investor events in Q1 2026, including Raymond James Conference on March 3.",
            "id": "7508a6e4-5fc7-4f6b-945c-148d5f2dca66",
            "description": "CAMAS, Wash.--nLIGHT, Inc., a top supplier of high-power lasers for critical directed energy, optical sensing, and advanced manufacturing uses, shared their involvement in various investor events in Q1 2026. The key events include Raymond James 47th Annual Institutional Investors Conference on March 3, 2026, held at JW Marriott Grande Lakes in Orlando, FL, and the Stifel 2026 NYC Technology One-on-One Conference later in the month. nLIGHT, listed on Nasdaq as LASR, continues to drive innovation with their leading laser technology.",
            "link": "https://www.markets.news/headlines/7508a6e4-5fc7-4f6b-945c-148d5f2dca66",
            "pub_date": "2026-02-27 21:12:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BlackRock TCP Cap Q4 earnings (02/27/26) miss estimates by -3.85%, EPS of $0.25 vs $0.26, revenue dips $17.35M yearly.",
            "id": "ff4fc44f-3927-4de9-adb6-f9de53095740",
            "description": "On February 27, 2026, BlackRock TCP Cap (NASDAQ: TCPC) disclosed its Q4 earnings at 08:05 AM, revealing a significant dip in performance. The company fell short of expected earnings by -3.85%, recording an EPS of $0.25 instead of the anticipated $0.26. Additionally, their revenue plummeted by $17.35 million compared to the previous year. This decline in financial figures signals a challenging quarter for BlackRock TCP Cap. For a comprehensive analysis, the complete report can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/ff4fc44f-3927-4de9-adb6-f9de53095740",
            "pub_date": "2026-02-27 21:12:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PhotonIC Technologies introduces ROCS platform with 10G – 1.6T products, to showcase at OFC 2026 in Los Angeles.",
            "id": "8ea1eec7-0c2d-4c9c-b9ae-6dc76bdf3020",
            "description": "PhotonIC Technologies, a worldwide fabless optoelectronic semiconductor company, is utilizing CMOS and SiGe processes in multiple fabs around the globe through the ROCS platform. The company will be exhibiting their range of products, from 10 gigabits to 1.6 terabits, at OFC 2026 in Los Angeles, California. The announcement was made on February 27, 2026.",
            "link": "https://www.markets.news/headlines/8ea1eec7-0c2d-4c9c-b9ae-6dc76bdf3020",
            "pub_date": "2026-02-27 21:12:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f0beaecb-7274-4ced-88fd-3566e8b9bd9b",
            "description": ".Afghan Interior Minister: 'The issue of the Taliban in Pakistan is considered a pretext, and we are committed to maintaining Afghanistan's independence. Formation of reform committees to prevent Afghans from traveling to Pakistan to engage in combat outside the country.'",
            "link": "https://www.markets.news/headlines/f0beaecb-7274-4ced-88fd-3566e8b9bd9b",
            "pub_date": "2026-02-27 21:13:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ellisons-led Paramount beats Netflix for Warner Bros. Discovery. Challenge now: merging the media giants effectively.",
            "id": "97c5d5ef-ea7d-45fb-8b1c-39679b33f70f",
            "description": "A media corporation owned by the Ellisons has successfully outbid Netflix to gain control of Warner Bros. Discovery. The focus now shifts to integrating the two entities to create a combined media powerhouse.",
            "link": "https://www.markets.news/headlines/97c5d5ef-ea7d-45fb-8b1c-39679b33f70f",
            "pub_date": "2026-02-27 21:14:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "abfb9d60-5008-4b19-bcb4-34b8a26d43dd",
            "description": "The Afghan Interior Minister: 'The doors of dialogue and negotiation are still open, appreciating the efforts made by Qatar, Turkey, and Saudi Arabia'",
            "link": "https://www.markets.news/headlines/abfb9d60-5008-4b19-bcb4-34b8a26d43dd",
            "pub_date": "2026-02-27 21:14:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "College seniors Madhav Aggarwal and Tanvi Gadamsetti pitch their patented \"Shoelaces That Never Quit™\" on Shark Tank for their tech startup BRCĒ.",
            "id": "00f53514-f534-44dc-831f-62d3c5f92c5c",
            "description": "Entrepreneurs Madhav Aggarwal and Tanvi Gadamsetti are set to present their innovative product, \"Shoelaces That Never Quit™,\" as a proof-of-concept for their company, EAST LANSING-based BRCĒ. Established by the duo, BRCĒ focuses on advanced material technology in Michigan. The pitch is scheduled for February 27, 2026, marking an important milestone for the startup. The product aims to revolutionize traditional shoelaces by introducing a durable and long-lasting alternative. The event will showcase the capabilities of the material and the potential impact of the startup in the industry. This undertaking represents a significant step in the journey of BRCĒ, highlighting their commitment to innovation and product development.",
            "link": "https://www.markets.news/headlines/00f53514-f534-44dc-831f-62d3c5f92c5c",
            "pub_date": "2026-02-27 21:14:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CHMP recommends approval of expanded use of Lilly's Olumiant for adolescents with severe alopecia. 42% reached 80% scalp hair coverage at 36 weeks.",
            "id": "b229b4f1-12a8-4a8f-a7e4-8e47b33752d3",
            "description": "According to data from the Phase 3 BRAVE-AA-PEDS study, a significant 42% of individuals with severe alopecia areata (AA) achieved 80% or higher coverage of scalp hair after 36 weeks. This research is the initial and most extensive study focusing on investigating this condition in children and is an indicator of a positive outcome.",
            "link": "https://www.markets.news/headlines/b229b4f1-12a8-4a8f-a7e4-8e47b33752d3",
            "pub_date": "2026-02-27 21:14:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Marc Zieger becomes EVP of Investment Solutions at QuantumStreet AI, which aims for institutional expansion after growing to $60B assets.",
            "id": "d0c20898-d364-4bf4-8575-0ab184b8f90b",
            "description": "A co-founder of Scientific Beta, instrumental in growing the index platform to $60 billion in assets, has been selected to spearhead QuantumStreet's institutional expansion. QuantumStreet AI, a renowned fintech firm known for constructing AI-driven indexes and predictive analysis, announced this development in New York and San Francisco on Feb. 27, 2026.",
            "link": "https://www.markets.news/headlines/d0c20898-d364-4bf4-8575-0ab184b8f90b",
            "pub_date": "2026-02-27 21:15:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1ebe901c-6769-404f-895f-0dba35a9347c",
            "description": "BOE'S PILL SAYS DISINFLATION PROCESS 'ADVANCED AND INTACT'",
            "link": "https://www.markets.news/headlines/1ebe901c-6769-404f-895f-0dba35a9347c",
            "pub_date": "2026-02-27 21:15:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ELLC rescheduled meeting to Mar 19, 2026. Provides supplemental disclosure on acquisition by ELL Ventures Ltd.",
            "id": "d6d0074e-a042-4d9a-a7fe-3972b0e3820d",
            "description": "Toronto-based language learning company, Everybody Loves Languages Corp. (ELLC), has rescheduled its annual general and special meeting to March 19, 2026. The Company trades on the TSX-V under the symbol ELL, OTC as LMDCF, and FSE as LIMA. ELLC specializes in edtech language learning edutainment and content development. The Meeting will include enhanced disclosure to complement information in the Circular. For more details, visit www.everybodyloveslanguages.com.",
            "link": "https://www.markets.news/headlines/d6d0074e-a042-4d9a-a7fe-3972b0e3820d",
            "pub_date": "2026-02-27 21:08:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}