{
    "data": [
        {
            "title": "",
            "id": "543f2cb6-d1a6-41d4-a8d6-a1896b296c21",
            "description": "ProVen Growth & Income VCT plc report transaction with own shares, details undisclosed.",
            "link": "https://www.markets.news/headlines/543f2cb6-d1a6-41d4-a8d6-a1896b296c21",
            "pub_date": "2026-02-27 00:07:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Faye wins Logo Partner of the Year and top growth performance at SugarCRM 2026 Sales Kickoff. Leader in CRM with new clients and customer success.",
            "id": "1cb75cde-dcae-468b-b81d-be99b50f3261",
            "description": "Faye has solidified its status as a prominent player in the global CRM industry by winning prestigious awards for their exceptional performance in acquiring new clients and maintaining high levels of customer satisfaction within the SugarCRM network. The company based in CALABASAS, Calif. achieved this recognition on Feb. 26, 2026. Faye, known for its expertise in software solutions, has demonstrated strong capabilities in securing new clients and ensuring ongoing success for their customers, positioning themselves as a top performer within the industry.",
            "link": "https://www.markets.news/headlines/1cb75cde-dcae-468b-b81d-be99b50f3261",
            "pub_date": "2026-02-27 00:07:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Leggett & Platt declares $.05 quarterly dividend for Q1 2026, payable on April 15 to shareholders of record on March 13.",
            "id": "a918e8cf-a1f5-4487-8610-23d2ed90dd54",
            "description": "On February 26, 2026, in Carthage, Missouri, Leggett & Platt's Board of Directors announced a dividend of $0.05 per share for the first quarter of 2026. Shareholders of record on March 13, 2026, will receive the dividend on April 15, 2026. For further details, individuals can access Leggett's website.",
            "link": "https://www.markets.news/headlines/a918e8cf-a1f5-4487-8610-23d2ed90dd54",
            "pub_date": "2026-02-27 00:07:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "69fc7c68-f8d4-4d44-be23-5250dd4b33dc",
            "description": "ProVen VCT plc reports buyback of 50,000 ordinary shares at 77.00 pence per share. Total shares in issue now 46,389,930.",
            "link": "https://www.markets.news/headlines/69fc7c68-f8d4-4d44-be23-5250dd4b33dc",
            "pub_date": "2026-02-27 00:08:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3cf84a2a-31de-4f4b-baa7-62bea735acb5",
            "description": "GOOGLE: INTRODUCES NANO BANANA 2 HIGH-FIDELITY IMAGE GENERATION",
            "link": "https://www.markets.news/headlines/3cf84a2a-31de-4f4b-baa7-62bea735acb5",
            "pub_date": "2026-02-27 00:08:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Organ donations post heart stoppage increase, making transplants more common. Public education is crucial. NYC, 2/26/26.",
            "id": "94b29719-dfce-4add-a818-5bb6193f5f1e",
            "description": "With an increasing number of donors contributing to the pool, making more life-saving transplants viable, the significance of public awareness and education has never been more crucial. In New York on Feb. 26, 2026, it was reported that organ donation following the cessation of cardiac activity, known as donation after circulatory death, has transitioned from an infrequent occurrence to a standard practice. This shift highlights the progress in the field, emphasizing the importance of educating communities about the benefits of organ donation.",
            "link": "https://www.markets.news/headlines/94b29719-dfce-4add-a818-5bb6193f5f1e",
            "pub_date": "2026-02-27 00:09:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PointsBet Canada will contest proposed 5-day suspension by AGCO in Ontario, with a hearing request before Licence Appeal Tribunal.",
            "id": "62991336-fce2-429a-a622-ad2a6a0b5423",
            "description": "PointsBet Canada has officially announced its intention to appeal the Notice of Proposed Order issued by the Alcohol and Gaming Commission of Ontario (AGCO) on February 12, 2026. The AGCO proposed a five-day suspension amid regulatory concerns. PointsBet will seek a hearing before the independent Licence Appeal Tribunal in response to this development.",
            "link": "https://www.markets.news/headlines/62991336-fce2-429a-a622-ad2a6a0b5423",
            "pub_date": "2026-02-27 00:09:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Atlanta Technical College partners with Uwill to enhance mental health support for students.  expanding services statewide for numerous students.",
            "id": "89f853aa-e15a-4ec6-bfdf-67387a87d765",
            "description": "Atlanta Technical College has recently teamed up with Uwill, a prominent mental health and wellness provider for colleges and students. This partnership was disclosed today and marks the collaboration of ATC with a growing number of Georgia institutions engaging with Uwill. The endeavor aims to offer support to students in need. The announcement was made in Natick, Massachusetts on February 26, 2026.",
            "link": "https://www.markets.news/headlines/89f853aa-e15a-4ec6-bfdf-67387a87d765",
            "pub_date": "2026-02-27 00:09:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Demand on Flashfood for affordable meat and eggs surges amid rising grocery prices. Protein now accounts for over 30% of sales, with purchases of ground beef up by 28% from January 2025 to 2026.",
            "id": "9f9328ff-45e4-4764-aeef-6584a58108a5",
            "description": "In New York, a recent study by the affordable grocery app Flashfood highlights a concerning trend among Americans facing higher grocery costs and financial difficulties. The data shows a significant surge in the demand for budget-friendly fresh essentials such as beef and eggs, reflecting the widespread affordability challenges across the country. Currently, protein products account for over 30% of all transactions on the Flashfood app. A comparison between January 2025 and January 2026 reveals a notable 28% rise in purchases of ground beef through the platform. This data underscores the escalating affordability crisis affecting many households.",
            "link": "https://www.markets.news/headlines/9f9328ff-45e4-4764-aeef-6584a58108a5",
            "pub_date": "2026-02-27 00:10:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "354ae385-ca9b-4631-be09-a905dae3ac9f",
            "description": "EU’S ANTI-FRAUD AGENCY TO INVESTIGATE PETER MANDELSON - FT",
            "link": "https://www.markets.news/headlines/354ae385-ca9b-4631-be09-a905dae3ac9f",
            "pub_date": "2026-02-27 00:10:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "1stdibs.com (NASDAQ: DIBS) upcoming earnings report with EPS estimate of $-0.04. Shares priced at $5.5. Performance history included.",
            "id": "794dbc89-e379-42f7-961a-bbd6032a3a54",
            "description": "1stdibs.com (NASDAQ: DIBS) is set to release its quarterly earnings report on February 27, 2026. Analysts predict an earnings per share (EPS) of $-0.04. In the previous quarter, the company exceeded EPS expectations by $0.03, resulting in a 0.0% drop in share price the following day. Over the past year, shares have risen, with the current trading price at $5.5. Investors are hoping for positive guidance and forecasted growth in the upcoming announcement, as this can significantly impact stock prices. Performance data from past quarters shows fluctuations in EPS estimates and actual numbers, as well as corresponding price changes. For more details, refer to the full article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/794dbc89-e379-42f7-961a-bbd6032a3a54",
            "pub_date": "2026-02-27 00:04:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hydro-Québec's net income reached $2.9 billion (up 9%), investments in Québec were $7.8 billion, contributing $26.1 billion to GDP.",
            "id": "1fdca639-e3d5-4575-8d2a-732950100add",
            "description": "In Montreal, on February 26, 2026, Hydro-Québec unveiled its Annual Report for 2025 showcasing strong financial results. The net income surged to $2.9 billion, marking a notable increase of 9% compared to the previous year, with investments within Quebec amounting to $7.8 billion. The company played a significant role in the economy by contributing $26.1 billion to Quebec's GDP. Despite facing challenges due to consistently low runoff levels since 2023, Hydro-Québec successfully implemented a robust sales strategy in external markets and efficiently managed its energy reserves, including its 28 major reservoirs often referred to as natural batteries. These measures allowed the company to sustain its operations...Find the complete article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/1fdca639-e3d5-4575-8d2a-732950100add",
            "pub_date": "2026-02-27 00:04:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "5d1b1a66-d336-4875-b5f2-1d0e3bc65ee5",
            "description": "GOOGLE: INTRODUCING NANO BANANA TWO WHICH BRINGS HIGH-FIDELITY IMAGE GENERATION AND FASTER, ADVANCED EDITING TO NEW FLASH MODEL - BLOG",
            "link": "https://www.markets.news/headlines/5d1b1a66-d336-4875-b5f2-1d0e3bc65ee5",
            "pub_date": "2026-02-27 00:04:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ESI and Acrisure launch Campio™ offering new insurance solutions for credit unions. Feb. 26, 2026.",
            "id": "1f840fc9-6803-4890-adab-f8fdf6706bff",
            "description": "A new fidelity bond offering and additional insurance solutions for credit unions were introduced by Campio™, a collaboration between Excess Share Insurance Corporation (ESI) based in Ohio and Acrisure, a prominent global fintech leader. The announcement was made on Feb. 26, 2026, in Dublin, Ohio, and Grand Rapids, Michigan.",
            "link": "https://www.markets.news/headlines/1f840fc9-6803-4890-adab-f8fdf6706bff",
            "pub_date": "2026-02-27 00:05:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Essential Income 5 DST fully subscribed as investor demand for REIT fast-track strategies soars.",
            "id": "58f18de6-1d23-4cc4-a3da-d01b8976b04e",
            "description": "ExchangeRight, based in Pasadena, California, has reported that Essential Income 5 DST has been fully subscribed due to high investor interest in REIT fast-track investment options.",
            "link": "https://www.markets.news/headlines/58f18de6-1d23-4cc4-a3da-d01b8976b04e",
            "pub_date": "2026-02-27 00:05:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RatedPower releases 2026 Global Renewable Energy Trends Report with insights from 100+ professionals and data from 64,000 projects.",
            "id": "922c7dbc-ee4f-4b4a-ad74-a623f91c1839",
            "description": "In its recent announcement on February 26, 2026, in Madrid, RatedPower, a subsidiary of Enverus, the prominent energy data analytics platform, unveiled its newest edition. This edition incorporates input from over 100 energy experts and data sourced from a staggering 64,000+ solar and storage design undertakings spanning five years.",
            "link": "https://www.markets.news/headlines/922c7dbc-ee4f-4b4a-ad74-a623f91c1839",
            "pub_date": "2026-02-27 00:05:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Coast Plaza appoints Tenley Zinke as Executive Director of Marketing, replacing Debra Gunn Downing after her 27-year tenure. Zinke joins after roles at Kering, LVMH, Tiffany & Co., Net-a-Porter, and Ralph Lauren.",
            "id": "7ddfe0ed-c6ee-411c-978e-7aad357a0507",
            "description": "Costa Mesa, California - South Coast Plaza has named Tenley Zinke as the new Executive Director of Marketing, taking over from Debra Gunn Downing who will be retiring after an impressive 27 years at the firm. Zinke brings a wealth of experience in marketing and communications from her previous roles at major luxury fashion and retail companies like Kering, LVMH, Tiffany & Co., Net-a-Porter, and Ralph Lauren. With a strong emphasis on brand management, Zinke is set to lead the marketing initiatives at South Coast Plaza.",
            "link": "https://www.markets.news/headlines/7ddfe0ed-c6ee-411c-978e-7aad357a0507",
            "pub_date": "2026-02-27 00:05:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Buy Now Pay Later market to hit US$212.2 billion by 2033, driven by digital commerce and consumer preference shifts.",
            "id": "1b9788f6-bc83-4cff-8797-0b7981e787b4",
            "description": "In a recent report by Persistence Market Research, a prominent management consulting firm, an update on the buy now pay later (BNPL) market was provided. BNPL options are gaining popularity as they allow consumers to buy products or services immediately and pay off the expenses later. This payment method is becoming increasingly prevalent in the retail sector, with the market expected to reach significant numbers. The growth of the BNPL market underscores the shifting preferences of consumers towards more flexible and convenient payment solutions for making purchases.",
            "link": "https://www.markets.news/headlines/1b9788f6-bc83-4cff-8797-0b7981e787b4",
            "pub_date": "2026-02-27 00:05:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Join the Global AI Judging Panel at Globee Awards to evaluate real-world AI achievements across industries globally.",
            "id": "020cc4b1-de98-48c3-b6c9-9d2d16c2e391",
            "description": "Professionals in the field of Artificial Intelligence, along with business leaders and technology experts, have been invited to assess real-world AI advancements in various industries and operational settings on a global scale. This invitation comes from the Globee® Awards, known for recognizing excellence in different sectors. The event is set to take place in San Francisco on February 26, 2026. Organizers aim to showcase accomplishments and innovations in AI, demonstrating their impact and relevance across diverse industries.",
            "link": "https://www.markets.news/headlines/020cc4b1-de98-48c3-b6c9-9d2d16c2e391",
            "pub_date": "2026-02-27 00:05:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ec2b4e0e-1117-47f2-8d19-174e5f98e5e7",
            "description": "Kansas City Fed February 2026 Report",
            "link": "https://www.markets.news/headlines/ec2b4e0e-1117-47f2-8d19-174e5f98e5e7",
            "pub_date": "2026-02-27 00:05:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}