{
    "data": [
        {
            "title": "",
            "id": "d79200ea-8017-44dd-bb1b-4a50fd6147af",
            "description": "Temporary restrictions have been imposed at Moscow Vnukovo and Sheremetyevo airports - Rosaviatsia",
            "link": "https://www.markets.news/headlines/d79200ea-8017-44dd-bb1b-4a50fd6147af",
            "pub_date": "2026-02-26 22:20:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Analysts reduced Snowflake forecasts following Q4 results; Revenue at $1.28B, earnings at 34 cents/share, expects $1.26-1.27B revenue in Q1.",
            "id": "1ea4ac08-2ece-4583-a570-2a0f59d32cf3",
            "description": "Snowflake Inc (NYSE: SNOW) exceeded expectations with its fourth-quarter fiscal 2026 financial results. The company reported revenue of $1.28 billion, surpassing analyst estimates of $1.26 billion. Additionally, Snowflake achieved adjusted earnings of 34 cents per share, exceeding predictions of 27 cents per share. CEO Sridhar Ramaswamy expressed how the past year has been transformative for all businesses, with Snowflake playing a pivotal role in the enterprise AI revolution. Looking ahead, Snowflake projects first-quarter product revenue between $1.26 billion and $1.27 billion, indicating a 27% increase compared to the previous year. More details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/1ea4ac08-2ece-4583-a570-2a0f59d32cf3",
            "pub_date": "2026-02-26 22:20:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tevogen considers acquiring Sciometrix for Clinicus platform to boost revenue goals by 2026.",
            "id": "db71c26c-1fa4-4fc0-a5fa-bcf4646daa0c",
            "description": "Tevogen is currently considering acquiring Sciometrix, a move aimed at developing a comprehensive clinical infrastructure to support its revenue targets for 2026. This potential acquisition highlights Tevogen's strategic plans to enhance its operations and achieve its financial objectives within the next five years.",
            "link": "https://www.markets.news/headlines/db71c26c-1fa4-4fc0-a5fa-bcf4646daa0c",
            "pub_date": "2026-02-26 22:21:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JFrog in Sunnyvale, CA sets $300 million share repurchase program approved by Board of Directors.",
            "id": "d0cff752-4550-423b-adda-53d048f0215c",
            "description": "In Sunnyvale, California, the Board of Directors at JFrog has approved a share buyback program totaling $300 million for the company's ordinary shares.",
            "link": "https://www.markets.news/headlines/d0cff752-4550-423b-adda-53d048f0215c",
            "pub_date": "2026-02-26 22:21:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "192beb3d-2cbc-4562-9e87-7b998678d642",
            "description": "BOEING: AFRICA NOW EXPECTS TO SELL 1,700 PLANES OVER THE NEXT TWO DECADES VS LAST YEAR’S FORECAST OF 1,200 AND 1,000 THREE YEARS AGO",
            "link": "https://www.markets.news/headlines/192beb3d-2cbc-4562-9e87-7b998678d642",
            "pub_date": "2026-02-26 22:22:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "41995f48-1437-4cea-a256-939b1770e4be",
            "description": "It looks like a fight, but every punch is a lesson. Watch as our reporter goes head-to-head with Unitree’s humanoid robots to test their balance, control, and recovery. Full episode coming across CGTN Europe social platforms on March 4.",
            "link": "https://www.markets.news/headlines/41995f48-1437-4cea-a256-939b1770e4be",
            "pub_date": "2026-02-26 22:24:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Altrata study shows how tenure, deal experience & sector expertise impact leadership teams in PE-owned businesses. NY, Feb 26, 2026 /PRNewswire.",
            "id": "7ac15eea-1563-41dd-89dd-3732af20c563",
            "description": "A recent extensive study by Altrata explores the impact of factors such as hiring practices, length of employment, previous deal involvement, and industry knowledge on the makeup of leadership teams in companies owned by private equity firms. This study, the largest of its kind, provides insights into the dynamics of leadership teams. The research was conducted by Altrata, a reputable company known for its expertise in executive and wealth management. The findings were unveiled in New York on February 26, 2026. This study offers valuable information for businesses navigating the private equity landscape.",
            "link": "https://www.markets.news/headlines/7ac15eea-1563-41dd-89dd-3732af20c563",
            "pub_date": "2026-02-26 22:25:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2af00df7-9f02-430f-8b6e-50f343fb4707",
            "description": "Investors pledge ~A$8.2m in placement.",
            "link": "https://www.markets.news/headlines/2af00df7-9f02-430f-8b6e-50f343fb4707",
            "pub_date": "2026-02-26 22:25:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "iQuanti receives 2026 Great Place To Work Certification, driving growth for better client outcomes.",
            "id": "422f681d-2358-41dc-860a-a9882116da2c",
            "description": "In Jersey City, New Jersey, iQuanti is dedicated to fostering continuous improvement among its employees. They not only encourage growth but also provide the necessary tools, freedom, and opportunities for their staff. Recently, on February 26, 2026, iQuanti celebrated being re-certified by Great Place To Work® for the second time. This recognition highlights their commitment to creating a supportive and conducive work environment.",
            "link": "https://www.markets.news/headlines/422f681d-2358-41dc-860a-a9882116da2c",
            "pub_date": "2026-02-26 22:25:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A live auction featuring Gwyneth Paltrow's style collection will be held on March 24 and 25, 2026, with online bidding starting on February 25, 2026 at The Peninsula Beverly Hills. (Characters: 123)",
            "id": "3830a73d-f2a0-4d0c-b425-d0e922700a9e",
            "description": "A live auction event is scheduled for March 24th and 25th, 2026 at The Peninsula Beverly Hills in Beverly Hills, California. Online bidding will commence on February 25th, 2026. Julien's Auctions has announced the auction showcasing the bold and luxurious collections of Gwyneth Paltrow, including the \"Lexicon of Style\" and \"The Archival.\"",
            "link": "https://www.markets.news/headlines/3830a73d-f2a0-4d0c-b425-d0e922700a9e",
            "pub_date": "2026-02-26 22:17:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UCLA Health receives $100 million donation from Stewart and Lynda Resnick to advance mental health care in Los Angeles.",
            "id": "02e5e0f8-321a-42be-b980-6daa3f2c14c7",
            "description": "A recent announcement from UCLA Health in Los Angeles revealed a significant development in addressing the city's escalating mental health crisis. The donation, amounting to a record-breaking $100 million, comes from philanthropists based in LA and marks the largest contribution dedicated to enhancing mental health care at UCLA Health. This generous contribution is lauded for its potential to make a substantial impact on the mental health services provided in Los Angeles.",
            "link": "https://www.markets.news/headlines/02e5e0f8-321a-42be-b980-6daa3f2c14c7",
            "pub_date": "2026-02-26 22:17:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fate Therapeutics Q4 earnings: Missed estimated EPS by 0%, -$0.27 vs. -$0.27. Revenue down $491,000 from last year.",
            "id": "7eb65033-17cc-41ea-8a0e-ec9cf9c96cb2",
            "description": "Fate Therapeutics, traded on NASDAQ as FATE, disclosed its fourth-quarter financial results on Thursday, February 26, 2026, at 09:00 AM. The key takeaways from the report indicate that the company fell in line with estimated earnings, posting an EPS of $-0.27, matching the projected $-0.27. However, their revenue witnessed a decline of $491 thousand compared to the corresponding period in the previous year. In terms of historical earnings performance, Fate Therapeutics exceeded expectations on EPS... Comprehensive details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/7eb65033-17cc-41ea-8a0e-ec9cf9c96cb2",
            "pub_date": "2026-02-26 22:17:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kilroy Realty Corp. appoints new leadership with Gary Stevenson as Chair of the Board and 2 new Directors.",
            "id": "1f5736ea-58a4-4f9d-bb69-fd5977a3c958",
            "description": "In Los Angeles, Kilroy Realty Corporation (NYSE: KRC) revealed notable leadership changes within its Board of Directors. Gary Stevenson was appointed as the new Chair of the Board, Edward Brennan, PhD, will serve as the Chair of the Audit Committee, and Jolie Hunt will lead the Executive Compensation Committee. Furthermore, the company welcomed two new Directors, Cia Buckley Marakovits and David.",
            "link": "https://www.markets.news/headlines/1f5736ea-58a4-4f9d-bb69-fd5977a3c958",
            "pub_date": "2026-02-26 22:19:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Florida Cancer Specialists presented novel clinical trial findings in prostate and urothelial cancers at ASCO 2026.",
            "id": "46aec8a6-6b86-461b-a245-1ef6654ae6f4",
            "description": "FCS doctors unveiled groundbreaking clinical trial results in prostate and urothelial cancers during the ASCO 2026 Genitourinary Cancers Symposium in Fort Myers, Florida on February 26, 2026. Florida Cancer Specialists & Research Institute, LLC (FCS) highlighted cutting-edge developments in genitourinary cancer therapy.",
            "link": "https://www.markets.news/headlines/46aec8a6-6b86-461b-a245-1ef6654ae6f4",
            "pub_date": "2026-02-26 22:19:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Java House Grand Prix debuts in Arlington, Texas on March 13-15, bringing INDYCAR series with a three-day event.",
            "id": "172e02f5-5350-46af-9e8c-9a53b517ec03",
            "description": "Experience the first-ever Java House Grand Prix of Arlington on March 13-15, offering visitors a chance to uncover the city's culinary delights, arts scene, and attractions beyond the racetrack. The INDYCAR series will make its debut in Arlington, Texas during this three-day event, presenting an exciting opportunity for racing enthusiasts and tourists alike to explore the city.",
            "link": "https://www.markets.news/headlines/172e02f5-5350-46af-9e8c-9a53b517ec03",
            "pub_date": "2026-02-26 22:19:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Real Estate Expert from Northport, MI, provides tips on buying horse property in Leelanau County.",
            "id": "c1c25ee6-008a-43a0-ab18-dc1404c60ee1",
            "description": "In Northport, Michigan on February 26, 2026, a recent article from HelloNation provides important insights for potential buyers of equine real estate in Leelanau County. The piece highlights key considerations when acquiring horse properties, presenting valuable guidance from a knowledgeable specialist who comprehends the intricacies of the market.",
            "link": "https://www.markets.news/headlines/c1c25ee6-008a-43a0-ab18-dc1404c60ee1",
            "pub_date": "2026-02-26 22:19:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Securus Technologies partners with In Our Backyard to combat human trafficking in Santa Clara during large events.",
            "id": "f9e9ba50-a50b-4954-b070-c4f74fd8c9cb",
            "description": "Utilizing technology and outreach efforts to promote safety during major events is a key priority for communities in Plano, Texas. Human trafficking, a crime that is often overlooked, is notably prevalent during times of increased travel and temporary employment opportunities. By leveraging innovative approaches and communication strategies, civic leaders aim to prevent and combat this issue effectively. The initiative involves raising awareness and collaborating with stakeholders to protect vulnerable populations.Overall, the goal is to reduce instances of human trafficking and ensure the safety of individuals during events, with a focus on utilizing technology and community outreach to achieve this objective.",
            "link": "https://www.markets.news/headlines/f9e9ba50-a50b-4954-b070-c4f74fd8c9cb",
            "pub_date": "2026-02-26 22:19:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c2b925e9-98a3-418f-a47d-4587def4a690",
            "description": "Iraq Prime Minister, Mohammed Shia al-Sudani, received the head of the Kurdistan National Union Party, Pavel Talabani, and they emphasized the need to maintain coordination and cooperation among all political forces in the face of various challenges - reports",
            "link": "https://www.markets.news/headlines/c2b925e9-98a3-418f-a47d-4587def4a690",
            "pub_date": "2026-02-26 22:19:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CEO of Goliath Ventures arrested for $328M crypto ‘Ponzi Scheme’. Charges include wire fraud and money laundering. Maximum sentence: 30 years.",
            "id": "007f3b3e-5b2a-4a25-b31c-356d943930af",
            "description": "Christopher Alexander Delgado faces charges of wire fraud and money laundering, with each count carrying a maximum penalty of 30 years behind bars.",
            "link": "https://www.markets.news/headlines/007f3b3e-5b2a-4a25-b31c-356d943930af",
            "pub_date": "2026-02-26 22:20:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hudson Pacific Properties (NYSE: HPP) beats Q4 earnings estimates by 205%, reports EPS of $0.21. Revenue up $46.36M from last year. Last quarter beat EPS by $1.12.",
            "id": "c3151bc1-82c0-4463-8f2b-9e1e0af42fd3",
            "description": "Hudson Pacific Properties (NYSE: HPP) disclosed its Q4 financial results on February 26, 2026, at 08:00 AM, outperforming expected earnings by 205.0%. The reported EPS was $0.21, surpassing the estimated $-0.2. Revenue experienced a $46.36 million increase from the previous year. In the prior quarter, the company exceeded EPS estimates by $1.12, leading to a subsequent 7.88% decrease. For further details, the complete article can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/c3151bc1-82c0-4463-8f2b-9e1e0af42fd3",
            "pub_date": "2026-02-26 22:12:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}