{
    "data": [
        {
            "title": "License Assistant joins NAPIA as affiliate member - service for insurance advocates; PHOENIX, Feb. 27, 2026.",
            "id": "8b9eb2d3-bcc1-4afe-ad3a-22637e1c1941",
            "description": "License Assistant is a service designed to streamline the licensure process for insurance advocates, ensuring simplicity, reliability, and timeliness. Recently, Seen & Heard LLC, operating as License Assistant, became a member of the National Association of Public Insurance Adjusters (NAPIA) on February 27, 2026.",
            "link": "https://www.markets.news/headlines/8b9eb2d3-bcc1-4afe-ad3a-22637e1c1941",
            "pub_date": "2026-02-27 23:11:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Quantum eMotion acquires Jet Lab Technologies' assets to enhance quantum-resilient security solutions. 100% of SKV shares acquired.",
            "id": "2268844d-5a1c-47a4-baed-9e317e441ac5",
            "description": "Montreal-based Quantum eMotion Corp. (NYSE: QNC; TSXV: QNC; FSE: 34Q0), renowned for its quantum-based cybersecurity solutions, recently disclosed its plans to purchase significant technology assets by acquiring all shares of California's SKV Technology Inc., a prominent cybersecurity firm. This transaction will involve securing the SecureKey™ platform, initially created and marketed by Jet Lab Technologies Inc., and currently owned by SKV.",
            "link": "https://www.markets.news/headlines/2268844d-5a1c-47a4-baed-9e317e441ac5",
            "pub_date": "2026-02-27 23:11:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Workato saw record-breaking results for FY26 - 35% YoY ARR growth and 50% Net New ARR growth, driven by enterprise demand for AI-native platforms.",
            "id": "8edcd7de-7c23-4130-a4cb-870e64867ea4",
            "description": "Palo Alto, California - Workato®, a prominent player in Enterprise Model Context Protocol (MCP), revealed exceptional performance for its fiscal year closing on January 31. The success was primarily propelled by the escalating need among enterprises for AI-centric platforms that empower agents to operate effectively within the business framework. Workato concluded FY26 on a high note, displaying notable financial achievements such as a remarkable 35% year-over-year growth in Annual Recurring Revenue (ARR), marking a significant upsurge from the previous fiscal year (FY25). Moreover, the company experienced a substantial 50% increase in Net New ARR, underlining the rapidly growing demand for their services.",
            "link": "https://www.markets.news/headlines/8edcd7de-7c23-4130-a4cb-870e64867ea4",
            "pub_date": "2026-02-27 23:13:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "INVL Baltic Farmland group's 2025 net profit was EUR 816k with revenue at EUR 891k, a decrease from 2024.",
            "id": "953bb0fd-7e51-4234-8d3b-57b1ddd58d33",
            "description": "During the fiscal year 2025, INVL Baltic Farmland, AB reported an audited consolidated net profit of EUR 816,000, with a revenue of EUR 891,000. This marks a decrease from the previous year, where the consolidated net profit stood at EUR 1,836,000 and revenue at EUR 835,000.",
            "link": "https://www.markets.news/headlines/953bb0fd-7e51-4234-8d3b-57b1ddd58d33",
            "pub_date": "2026-02-27 23:13:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Crypto tax laws evolve; BTC fails to break $70K this month as global inflation falls and countries review crypto tax rules.",
            "id": "e3236079-5cef-4fe1-a527-af31d2ac3333",
            "description": "This month, Bitcoin faced challenges trying to surpass the $70,000 mark. During this period, inflation rates saw a decline in Japan. Additionally, some nations were revisiting their cryptocurrency tax regulations.",
            "link": "https://www.markets.news/headlines/e3236079-5cef-4fe1-a527-af31d2ac3333",
            "pub_date": "2026-02-27 23:14:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f14611f0-cd25-4f5e-b2f7-e560fab2584b",
            "description": "IVORY COAST: LACKS FUNDS TO BUY ENTIRE COCOA PRODUCTION",
            "link": "https://www.markets.news/headlines/f14611f0-cd25-4f5e-b2f7-e560fab2584b",
            "pub_date": "2026-02-27 23:14:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "McLean & Company finds most pay-for-performance programs fail, highlighting disconnect between recognition and execution.",
            "id": "d5312f89-5d3c-4d17-97f2-9f25bba7c14b",
            "description": "A recent study conducted by McLean & Company discovered that although most organizations understand the significance of linking performance with compensation, only a small percentage feel they are successful in implementing this practice. The research conducted by the global HR research and advisory firm highlights the challenges faced by organizations in effectively designing a purposeful pay-for-performance program.",
            "link": "https://www.markets.news/headlines/d5312f89-5d3c-4d17-97f2-9f25bba7c14b",
            "pub_date": "2026-02-27 23:15:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Helios Technologies (HLIO) will report EPS of $0.72 on 2026-03-02. Investors look for surpassing estimates. For full story: Benzinga.com.",
            "id": "16052725-f8bf-41b3-b97d-12e359c9fde3",
            "description": "Helios Technologies (NYSE: HLIO) is scheduled to release its quarterly earnings on Monday, March 2, 2026. Analysts predict the company will report an earnings per share (EPS) of $0.72. Investors are eagerly anticipating the announcement, hoping for Helios Technologies to exceed expectations and offer positive guidance for the upcoming quarter. It is crucial for new investors to recognize the impact that guidance can have on stock prices. In previous quarters, the company has outperformed analyst estimates by $0.07 per share. For more details, read the complete article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/16052725-f8bf-41b3-b97d-12e359c9fde3",
            "pub_date": "2026-02-27 23:05:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "California Resources (NYSE: CRC) to announce earnings on 2026-03-02, EPS estimate $0.50. Past performance saw shares up 45.68% in 52 weeks.",
            "id": "9ee50fd6-9f30-4988-a423-4073556674a9",
            "description": "California Resources (NYSE: CRC) is set to announce its quarterly earnings with analysts estimating an EPS of $0.50. Investors are keen on the company beating this estimate and providing positive guidance for the next quarter, as this can significantly impact the stock price. In the previous quarter, California Resources surpassed EPS estimates by $0.17, resulting in a 0.81% drop in the share price the next day. A look at the company's historical performance showed varying price changes in response to earnings surprises. As of February 26, shares were trading at $57.33, marking a 45.68% increase over the past 52 weeks. Full details are available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/9ee50fd6-9f30-4988-a423-4073556674a9",
            "pub_date": "2026-02-27 23:05:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7e93a7fb-27d8-4076-96a6-d52dabfc8adb",
            "description": "OFFICIALS AT MULTIPLE FEDERAL AGENCIES HAVE RAISED CONCERNS ABOUT THE SAFETY AND RELIABILITY OF ELON MUSK'S XAI ARTIFICIAL-INTELLIGENCE TOOLS IN RECENT MONTHS, HIGHLIGHTING CONTINUING DISAGREEMENTS WITHIN THE U.S. GOVERNMENT ABOUT WHICH AI MODELS TO DEPLOY, ACCORDING TO PEOPLE",
            "link": "https://www.markets.news/headlines/7e93a7fb-27d8-4076-96a6-d52dabfc8adb",
            "pub_date": "2026-02-27 23:06:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "24e6843f-1cc3-4b4f-aaf9-247365ad7f58",
            "description": "The Russian Foreign Ministry summoned the Finnish ambassador and lodged a protest against the burning of the Russian flag in front of the embassy building, the diplomatic department reported",
            "link": "https://www.markets.news/headlines/24e6843f-1cc3-4b4f-aaf9-247365ad7f58",
            "pub_date": "2026-02-27 23:06:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Houston law firm John K. Zaid & Associates uses AI tool EvenUp to increase personal injury settlements by 300%.",
            "id": "ca6c3c33-cb25-422b-b21b-beae349fed9c",
            "description": "In Houston, a personal injury law firm, John K. Zaid & Associates, made a strategic move by implementing EvenUp's AI technology. The outcomes of this decision have been remarkable for the firm and its clients.",
            "link": "https://www.markets.news/headlines/ca6c3c33-cb25-422b-b21b-beae349fed9c",
            "pub_date": "2026-02-27 23:07:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d7688d9d-9e45-43b3-be42-6bcecc3e134e",
            "description": "NASA CANCELS PLAN TO UPGRADE SPACE LAUNCH SYSTEM ROCKET TO INSTEAD FOCUS ON INCREASING FLIGHT RATE, IMPACTING BOEING'S $2 BILLION EXPLORATION UPPER STAGE CONTRACT",
            "link": "https://www.markets.news/headlines/d7688d9d-9e45-43b3-be42-6bcecc3e134e",
            "pub_date": "2026-02-27 23:07:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "88806719-61a7-42db-9d0d-68496c210112",
            "description": "NASA MAKES MULTIPLE CHANGES TO ARTEMIS MOON PROGRAM, ADDS NEW SPACECRAFT DOCKING TEST MISSION BEFORE ITS ASTRONAUT MOON LANDING",
            "link": "https://www.markets.news/headlines/88806719-61a7-42db-9d0d-68496c210112",
            "pub_date": "2026-02-27 23:07:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DeepSig showcases AI-native tech at MWC26, partnering with NVIDIA and SRS, reflecting ecosystem growth. #AI #MWC26",
            "id": "ca789de3-6c54-4d4a-926e-22c5127481cd",
            "description": "DeepSig, a leader in AI-driven wireless communications, is set to exhibit partner collaborations at Mobile World Congress 2026 in Barcelona. The company will demonstrate the integration of AI-native technologies in Open RAN Infrastructure and portable spectrum intelligence platforms. At the event, DeepSig will showcase various demonstrations showcasing the increasing adoption of its AI-native software platforms by the ecosystem. By partnering with NVIDIA, SRS, and the AI-RAN Alliance, DeepSig aims to highlight the advancements in this field.",
            "link": "https://www.markets.news/headlines/ca789de3-6c54-4d4a-926e-22c5127481cd",
            "pub_date": "2026-02-27 23:08:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "148 financial institutions surveyed by Wolters Kluwer show regulatory alignment crucial for AI success. 31.8% have deployed AI/ML, but only 12.2% have a well-defined strategy.",
            "id": "f09c4208-b8cb-4d5b-b2a5-883cdf6121d3",
            "description": "A recent survey conducted by Wolters Kluwer Financial & Corporate Compliance in Minneapolis emphasized the importance of regulatory clarity and talent development for successful adoption of AI in the banking industry. The survey included 148 financial institutions, revealing that 31.8% have already implemented AI/ML technologies in their operations. However, only 12.2% of these institutions consider their AI/ML strategies to be well-defined. The Q1 2026: Banking Compliance AI Trend Report highlights the need for institutions to focus on these critical enablers to enhance their AI adoption processes.",
            "link": "https://www.markets.news/headlines/f09c4208-b8cb-4d5b-b2a5-883cdf6121d3",
            "pub_date": "2026-02-27 23:08:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4137bea6-bdbf-4b1e-a4f5-02b58cf1269e",
            "description": "The information resources of Russia's Roskomnadzor and the Ministry of Defense were subjected to a DDoS attack - reports",
            "link": "https://www.markets.news/headlines/4137bea6-bdbf-4b1e-a4f5-02b58cf1269e",
            "pub_date": "2026-02-27 22:58:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canadian parliamentary hearings revealed Cuban unity against the weakened communist regime due to mismanagement, with emphasis on international roles.",
            "id": "0f3beccb-b35b-4ede-9290-5a514daa162f",
            "description": "Cuban civil society members convened in Ottawa for government hearings, emphasizing that Cuba's current state stems from the regime's mismanagement and penchant for repression and luxury resorts. They pointed out Canada, Spain, and various democratic nations' contributions to the situation. John Suarez, from the Center for a Free Cuba and the Assembly of the Cuban Res, shared this sentiment unanimously. The group voiced concerns to parliamentarians about this issue.",
            "link": "https://www.markets.news/headlines/0f3beccb-b35b-4ede-9290-5a514daa162f",
            "pub_date": "2026-02-27 22:59:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flex LNG Ltd filed its 2025 annual report on Form 20-F with the SEC in Bermuda on Feb 27, 2026.",
            "id": "dfb2612d-5f55-4325-86ee-0194b5dcb93f",
            "description": "In Hamilton, Bermuda, on February 27, 2026, Flex LNG Ltd disclosed the submission of its 20-F annual report for the fiscal year concluding on December 31, 2025, to the U.S. Securities and Exchange Commission. The report contains crucial financial data and information about the Company's performance during the specified year. This filing ensures transparency and regulatory compliance for stakeholders and investors.",
            "link": "https://www.markets.news/headlines/dfb2612d-5f55-4325-86ee-0194b5dcb93f",
            "pub_date": "2026-02-27 23:00:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Webster First FCU launches First Rate Checking with 5% APY on first $1,000, offering competitive account in MA.",
            "id": "c6e6c991-4065-41e0-97f9-2168ce505b34",
            "description": "In Worcester, Massachusetts, on February 27, 2026, Webster First Federal Credit Union introduced First Rate Checking, a leading checking account choice in the state. The account currently offers an impressive 5.00% annual percentage yield (APY)* on the initial $1,000 deposited. This account option stands out as one of the most competitive choices available in Massachusetts.",
            "link": "https://www.markets.news/headlines/c6e6c991-4065-41e0-97f9-2168ce505b34",
            "pub_date": "2026-02-27 23:00:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}