{
    "data": [
        {
            "title": "SoundHound AI (NASDAQ: SOUN) Q4 earnings show flat stock movement, quarterly revenue of $55.06M beats estimates of $53.99M.",
            "id": "9ad759e2-ed4c-46be-8593-6c73f8a707b5",
            "description": "SoundHound AI Inc. (SOUN) saw its shares remain stable in after-hours trading following the release of its Q4 earnings report. The company reported a loss of two cents per share for the quarter, in line with expectations. Revenue for the quarter was $55.06 million, surpassing the estimated $53.99 million and marking an increase from $34.54 million year-over-year. In the full year, SoundHound revealed significant growth, though further details can be found on financial news platforms. Keep an eye on SOUN stock for developments.",
            "link": "https://www.markets.news/headlines/9ad759e2-ed4c-46be-8593-6c73f8a707b5",
            "pub_date": "2026-02-27 05:56:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MP Materials Corp (NYSE: MP) Q4 revenue at $52.69M misses estimates of $67.38M, stock slips. Earnings at 9 cents/share.",
            "id": "54582db3-3d12-413b-9dae-b77f9548552e",
            "description": "MP Materials Corp (NYSE: MP) released its fourth-quarter financial results, with revenue totaling $52.69 million, lower than the projected $67.38 million as per Benzinga Pro. However, the company surpassed analyst expectations with adjusted earnings reaching nine cents per share, exceeding the predicted breakeven earnings. The total revenue saw a 14% decline compared to the previous year due to certain operational changes. Despite the mixed quarterly results, MP Materials stock is currently trending upwards. The driving factors behind the rise in MP shares are outlined in the full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/54582db3-3d12-413b-9dae-b77f9548552e",
            "pub_date": "2026-02-27 05:56:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AAPA states student loan exceeds statutory authority, redefines \"Professional Degree\" in response to U.S. Education Dept, Feb. 26, 2026.",
            "id": "54ed894e-3c04-413a-a938-9eea922c7a2a",
            "description": "In Arlington, Virginia, on February 26, 2026, the American Academy of Physician Associates (AAPA) submitted public comments to the U.S. Department of Education regarding their opposition to a proposed plan. The AAPA, which speaks for around 190,000 physician associates/physician assistants (PAs) nationwide, made their stance clear through this submission.",
            "link": "https://www.markets.news/headlines/54ed894e-3c04-413a-a938-9eea922c7a2a",
            "pub_date": "2026-02-27 05:57:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ademi LLP investigates securities fraud claims against PROCEPT BioRobotics (NASDAQ: PRCT) due to inaccurate statements.",
            "id": "13df8f45-43db-4ec6-a366-751026701fdf",
            "description": "An investigation is being conducted by Ademi LLP into potential securities fraud allegations against PROCEPT BioRobotics (NASDAQ: PRCT) following suspicions of misleading statements made by the company about its financial statements and business operations. The inquiry, stemming from concerns over the accuracy of information provided, aims to determine the extent of any fraudulent activities. This raises doubts about the integrity of the company's disclosures and financial performance, impacting shareholders and investors.",
            "link": "https://www.markets.news/headlines/13df8f45-43db-4ec6-a366-751026701fdf",
            "pub_date": "2026-02-27 05:59:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Momcozy launches Working Motherhood Toolkit for International Women's Day, offering guidance on maternity leave, pumping at work, and career decisions. Los Angeles, Feb. 26, 2026.",
            "id": "0eb834d7-fa3a-4acb-98d5-bd3a46ad9600",
            "description": "The Working Motherhood Toolkit has been launched by Momcozy, aiming to provide practical advice on maternity leave, pumping at work, and making career decisions for women. Released on February 26, 2026, in Los Angeles, this resource is structured to guide women through each trimester. It serves as a valuable tool in honoring International Women's Day. This initiative is geared towards empowering women by offering support and information.",
            "link": "https://www.markets.news/headlines/0eb834d7-fa3a-4acb-98d5-bd3a46ad9600",
            "pub_date": "2026-02-27 05:59:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "K1 Speed's mascot Jolie raises $235,236.67 for 10 SPCAs in the US - largest indoor go-kart operator.",
            "id": "797d741f-5d26-4ad3-afa5-9cb24d7a5742",
            "description": "In Irvine, California, on February 26, 2026, K1 Speed, a major indoor go-kart racing operator globally, along with their official mascot, Jolie, disclosed a generous donation. They contributed a total of $235,236.67 to support ten independent SPCA organizations situated throughout the United States. This act of charity underscores their commitment to animal welfare and their \"Legacy of Loyalty\" campaign.",
            "link": "https://www.markets.news/headlines/797d741f-5d26-4ad3-afa5-9cb24d7a5742",
            "pub_date": "2026-02-27 05:59:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Recent DeFi bill introduced in Congress to safeguard software developers in the crypto market. Implications on market structure?",
            "id": "045cc5ef-5f2b-406f-8a18-3190168c4608",
            "description": "On Thursday, legislators unveiled a bill aimed at shielding cryptocurrency software developers from facing criminal charges. The introduction of this bill raises questions about the status of the crypto market structure bill; however, its specifics have not been clarified yet. The proposed legislation comes as a relief to developers who have been facing uncertainty regarding potential legal repercussions. It remains to be seen how this new bill will impact the broader crypto industry and whether it will gain sufficient support to pass.",
            "link": "https://www.markets.news/headlines/045cc5ef-5f2b-406f-8a18-3190168c4608",
            "pub_date": "2026-02-27 06:00:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3fda2007-5a92-4a5e-8a72-f0a974ad7777",
            "description": "This train carries no passengers. There’s no ticket to buy. But it protects every high-speed rail journey in China. Meet China’s “Rail Doctor”. Discover how it works in the full episode, coming March 1.",
            "link": "https://www.markets.news/headlines/3fda2007-5a92-4a5e-8a72-f0a974ad7777",
            "pub_date": "2026-02-27 06:01:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RLJ Lodging Trust reports Q4 2025 results: RevPAR $136.79 (-1.5%), Hotel Revenue $325.1M (+0.2%), Net Income $0.5M, EBITDA $80.4M. Sold 2 hotels for $49.5M.",
            "id": "b33c4e8d-4658-44c2-83bd-781de81703bb",
            "description": "RLJ Lodging Trust (NYSE: RLJ) based in Bethesda, Md. announced its financial results for the fourth quarter and full year ending December 31, 2025. The highlights for the fourth quarter include a Comparable RevPAR of $136.79, showing a 1.5% decrease from the previous year, and Comparable Hotel Revenue of $325.1 million, marking a 0.2% increase from the prior year. The company reported a Net Income of $0.5 million and an Adjusted EBITDA of $80.4 million. Additionally, it achieved an Adjusted FFO per diluted common share and unit of $0.32. RLJ Lodging Trust also successfully sold two hotels for a total of $49.5 million during this period.",
            "link": "https://www.markets.news/headlines/b33c4e8d-4658-44c2-83bd-781de81703bb",
            "pub_date": "2026-02-27 05:53:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wesco International (NYSE: WCC) declares $0.50 per share quarterly dividend on common stock on Feb. 26, 2026.",
            "id": "17291649-f768-4e2f-9024-f08aba9292a4",
            "description": "On February 26, 2026, Wesco International's Board of Directors announced a quarterly cash dividend for its shareholders. The declared dividend on all outstanding common stock is $0.50 per share. Shareholders can expect to receive this dividend on March 31, 2026.",
            "link": "https://www.markets.news/headlines/17291649-f768-4e2f-9024-f08aba9292a4",
            "pub_date": "2026-02-27 05:46:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "XTKG to consolidate shares, board approved decision. Global tech provider across industries.",
            "id": "48d6b6bb-18d6-400a-903a-522c060acbb0",
            "description": "In Singapore on February 26, 2026, X3 Holdings Co., Ltd. (Nasdaq: XTKG) revealed plans for a consolidation of its Class A ordinary shares. As a leading global provider of digital solutions and technology services across various industries, XTKG's board of directors gave the green light for this strategic move. This decision underscores the company's commitment to refining its corporate structure.",
            "link": "https://www.markets.news/headlines/48d6b6bb-18d6-400a-903a-522c060acbb0",
            "pub_date": "2026-02-27 05:46:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ready Capital Corp reports Q4 2025 GAAP loss per share of $(1.46) and distributable loss per share before realized losses of $(0.09). LMM commercial real estate originations at $235M. Total originations for year at $1.8B. Distributable loss before realized losses on investments $(0.09) per common share. Total assets at $7.77B and total liabilities at $6.12B. Full story on Benzinga.com.",
            "id": "3ec4e822-002d-42ae-914e-4aea74599beb",
            "description": "Ready Capital Corporation reported a GAAP loss per common share of $(1.46) and a distributable loss per common share of $(0.43) for Q4 2025. LMM commercial real estate originations totaled $235 million, with Small Business Lending loans at $140 million. Book value per common stock was $8.79 as of Dec 31, 2025. Full-year total originations were $1.8 billion, including the acquisition of UDF IV and the sale of GMFS. The company retired the remaining 5.75% Senior Unsecured Note due Feb 2026. Net loss for Q4 was $232.6 million and $221.1 million for the full year. The company's website has additional information. Total assets stood at $7.77 billion, with liabilities at $6.12 billion. Preferred stock Series C was at $8.36 million, and Series E at $111.37 million, with common stock at $17. Additional paid-in capital was $2.26 billion. For more details, visit the Benzinga website.",
            "link": "https://www.markets.news/headlines/3ec4e822-002d-42ae-914e-4aea74599beb",
            "pub_date": "2026-02-27 05:46:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave Inc (CRWV) reports mixed Q4 earnings: revenue $1.57B, over $66.8B backlog, doubling YOY. Stock down despite hypergrowth signal.",
            "id": "f164a841-e8b9-4490-ac63-2b662f269aea",
            "description": "CoreWeave Inc (NASDAQ: CRWV) released its Q4 financial results, surpassing analyst estimates with $1.57 billion in revenue, a significant increase from the previous year. The company, offering Nvidia GPUs to tech and AI firms, reported a revenue backlog of $66.8 billion at the end of the quarter. Despite this, it also reported a Q4 adjusted loss. The news has caused CRWV shares to trend, prompting questions about their future trajectory. This information, along with additional details, can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/f164a841-e8b9-4490-ac63-2b662f269aea",
            "pub_date": "2026-02-27 05:46:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Monkee's Franchising, LLC opens new boutique - Monkee's of Kiawah, owned by Debbie Creasy. Elevates style and service in Kiawah Island community.",
            "id": "6161f1ee-6e50-4095-a00b-012eb0aacf3a",
            "description": "Monkee's Franchising, LLC has recently unveiled its latest store, Monkee's of Kiawah, situated in Kiawah Island, S.C. Owned by Debbie Creasy, this boutique offers a meticulously curated shopping experience for the local community. The opening took place on February 26, 2026, marking an exciting addition to the area. This new location is set to provide residents and visitors with a unique and diverse shopping destination on Kiawah Island.",
            "link": "https://www.markets.news/headlines/6161f1ee-6e50-4095-a00b-012eb0aacf3a",
            "pub_date": "2026-02-27 05:48:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Globe Life Inc. (NYSE: GL) raises quarterly dividend to $0.33 per share and appoints two new board members.",
            "id": "fb8fcfb7-1e7f-45c4-bb6e-0fa69cfc9c8d",
            "description": "In McKinney, Texas, on February 26, 2026, Globe Life Inc. (NYSE: GL) disclosed that their Board of Directors approved an increase in the quarterly dividend to $0.3300 per share. This dividend applies to all outstanding common stock held by shareholders as of the company's transfer record deadline.",
            "link": "https://www.markets.news/headlines/fb8fcfb7-1e7f-45c4-bb6e-0fa69cfc9c8d",
            "pub_date": "2026-02-27 05:48:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Steel City Hoops is Pittsburgh's digital media organization covering high school basketball, providing latest matchups and scores.",
            "id": "43b19cda-0eea-449d-ac7c-3f6edbbf7bae",
            "description": "In Pittsburgh on February 26, 2026, a new venture has emerged for high school basketball enthusiasts. Steel City Hoops is paving the way as the city's premier digital media outlet focused on high school basketball. This innovative platform is dedicated to bringing the most up-to-date coverage of the sport, including detailed insights on matchups, live scores, and highlights from top games. This initiative marks a significant step forward in amplifying the local high school basketball scene, catering to the growing fan base with exclusive content.",
            "link": "https://www.markets.news/headlines/43b19cda-0eea-449d-ac7c-3f6edbbf7bae",
            "pub_date": "2026-02-27 05:48:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fidium's 100% fiber-to-the-home network earns over 250 top performance rankings in Ookla® Speedtest® Research across 10 states.",
            "id": "4dfd7fa3-a7db-49d7-9ef2-c774dc5162a7",
            "description": "Fidium, a company based in The Woodlands, Texas, revealed that their fiber-to-the-home network received over 250 top performance rankings in Ookla's analysis of Q3-Q4 2025 Speedtest Intelligence® data. These rankings were based on consumer-initiated tests conducted across 10 states. The data emphasized Fidium's superior performance in key metrics such as download speed, upload speed, and latency. Compared to cable and fixed-wireless providers, Fidium demonstrated exceptional performance in regions including New England, Texas, Illinois, Minnesota, and California.",
            "link": "https://www.markets.news/headlines/4dfd7fa3-a7db-49d7-9ef2-c774dc5162a7",
            "pub_date": "2026-02-27 05:49:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c4e411f7-a8af-4cea-a0b3-2e07d85906fc",
            "description": "Afghanistan spox: ‘Press Release from the Ministry of National Defense of the Islamic Emirate of Afghanistan regarding the outcomes of tonight's retaliatory operations: As a few days ago, the Pakistani military establishment brazenly violated the sovereignty of Afghanistan,",
            "link": "https://www.markets.news/headlines/c4e411f7-a8af-4cea-a0b3-2e07d85906fc",
            "pub_date": "2026-02-27 05:50:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ritchie Bros. sells $265+ million at Orlando auction, with 14,500 items sold and 19,500 participants.",
            "id": "19ce6f1e-eeea-47e8-9312-e13248602d24",
            "description": "RB Global, Inc. revealed that Ritchie Bros. Auctioneers achieved a gross transaction value of over $265 million at its recent premier global auction in Orlando, FL. The auction, which took place from Feb. 16-20, saw the sale of over 14,500 equipment items, trucks, and vehicles. With over 19,500 participants in attendance, the five-day event was a major success for the company.",
            "link": "https://www.markets.news/headlines/19ce6f1e-eeea-47e8-9312-e13248602d24",
            "pub_date": "2026-02-27 05:50:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a1873a3f-8ef8-438c-87d5-1aea286394b6",
            "description": "PARAMOUNT SKYDANCE CORP: BANK OF AMERICA MERRILL LYNCH, CITI AND APOLLO PROVIDING $57.5B DEBT COMMITMENT FOR DEAL",
            "link": "https://www.markets.news/headlines/a1873a3f-8ef8-438c-87d5-1aea286394b6",
            "pub_date": "2026-02-27 05:38:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}