{
    "data": [
        {
            "title": "PSEG raises common stock dividend by 6% to $2.68 per share, marking 15th consecutive increase and 119th year of paying shareholders.",
            "id": "d7fc840e-b728-4031-8595-63be8db140ae",
            "description": "Public Service Enterprise Group (NYSE: PEG) based in Newark, New Jersey, announced the 15th consecutive dividend increase, bringing the annual dividend rate up by approximately 6% to $2.68 per share. This marks the 119th year that the company has been paying dividends to shareholders. The Board of Directors declared a quarterly dividend of $0.67.",
            "link": "https://www.markets.news/headlines/d7fc840e-b728-4031-8595-63be8db140ae",
            "pub_date": "2026-02-26 20:18:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ACM Research missed Q4 earnings by -26.47%, reporting EPS of $0.25 vs estimate of $0.34. Revenue up $20.96M from last year.",
            "id": "76ac48ae-8f24-4184-a266-7f3eadb6e20d",
            "description": "ACM Research (NASDAQ: ACMR) released its Q4 earnings data on Thursday, February 26, 2026, at 07:00 AM. The company fell short of estimated earnings by -26.47%, recording an EPS of $0.25 compared to the expected $0.34. Revenue saw a $20.96 million increase from the previous year. In the previous quarter, ACM Research had... Check Benzinga.com for the full story.",
            "link": "https://www.markets.news/headlines/76ac48ae-8f24-4184-a266-7f3eadb6e20d",
            "pub_date": "2026-02-26 20:19:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nuveen Churchill Direct Q4 earnings beat estimates with EPS of $0.44 (vs. $0.43). Revenue down $7.04M YoY.",
            "id": "112021ef-9af1-42f7-8266-6aa9921365d5",
            "description": "Yesterday, Nuveen Churchill Direct (NYSE: NCDL) released its Q4 earnings, surpassing estimated earnings by 2.33% with an EPS of $0.44 compared to the expected $0.43. The revenue decreased by $7.04 million from the previous year. In the prior quarter, the company fell short in earnings. For further details, the complete article can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/112021ef-9af1-42f7-8266-6aa9921365d5",
            "pub_date": "2026-02-26 20:19:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aclaris Therapeutics (NASDAQ: ACRS) reported Q4 earnings with missed estimated earnings by -14.29% ($0.16 EPS vs $0.14) & revenue down $7.92M from last year.",
            "id": "1878ce7c-bda1-4248-bef6-59503e1eefb2",
            "description": "Aclaris Therapeutics (NASDAQ: ACRS) released its Q4 earnings report on February 26, 2026, at 06:58 AM. The company fell short of expected earnings by -14.29%, posting an EPS of $-0.16 compared to the estimated $-0.14. Revenue witnessed a decline of $7.92 million from the previous year. For more in-depth analysis of prior earnings, refer to the complete report on Benzinga.com.",
            "link": "https://www.markets.news/headlines/1878ce7c-bda1-4248-bef6-59503e1eefb2",
            "pub_date": "2026-02-26 20:19:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fa70afef-7eb7-491e-ade5-73ae148113e6",
            "description": "Lukashenko: Belarus and Russia are taking a \"realistic\" approach to union building",
            "link": "https://www.markets.news/headlines/fa70afef-7eb7-491e-ade5-73ae148113e6",
            "pub_date": "2026-02-26 20:19:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Blackline Safety (TSX: BLN) to report Q1 2026 financial results on March 12, 2026, with a conference call at 11:00 a.m. ET.",
            "id": "4e5b96fe-9224-40ea-b1c4-dee758d72536",
            "description": "Blackline Safety Corp, a top player in connected safety technology, will unveil its fiscal Q1 2026 financial results on Thursday, March 12, 2026, pre-market opening. A conference call and webcast to review the results will be hosted at 11:00 a.m. ET on the same day. For the Blackline Safety Corp Fiscal Q1 2026 Financial Results Conference Call, mark your calendar for Thursday, March 12, 2026, at 11:00 a.m. ET.",
            "link": "https://www.markets.news/headlines/4e5b96fe-9224-40ea-b1c4-dee758d72536",
            "pub_date": "2026-02-26 20:20:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere agrees to long-term LNG deal with CPC, worth (insert numbers).",
            "id": "ec5e57c2-f168-4498-86b9-e1a22bbd8e57",
            "description": "In a recent report, it was revealed that the unemployment rate in the country has reached 4.3%, which is a 0.2% increase from the previous quarter. This means that there are now a total of 1.8 million people without jobs. Additionally, the inflation rate has also risen by 1.5% compared to last year, causing concerns about the cost of living for citizens. On a positive note, the GDP growth for the year is projected to be at 3.8%, showing signs of economic recovery. The government is implementing measures to address these challenges and stimulate job creation and economic stability.",
            "link": "https://www.markets.news/headlines/ec5e57c2-f168-4498-86b9-e1a22bbd8e57",
            "pub_date": "2026-02-26 20:20:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d43c0e73-4fe7-480e-a43e-ffb4854641db",
            "description": "Russian Ministry of Defense: Between 12:00 and 14:00 Moscow time, air defense systems on duty intercepted and destroyed 35 Ukrainian unmanned aerial vehicles (UAVs) flying over the Bryansk region",
            "link": "https://www.markets.news/headlines/d43c0e73-4fe7-480e-a43e-ffb4854641db",
            "pub_date": "2026-02-26 20:20:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BlackSky Technology (NYSE: BKSY) beats Q4 earnings estimate by 92.59%, reports EPS of $-0.02. Revenue up $4.84 million.",
            "id": "b21408f5-fc14-4f4c-b82b-ced7f282abbe",
            "description": "BlackSky Technology (NYSE: BKSY) released its Q4 earnings report on Thursday, February 26, 2026, at 07:00 AM. In the latest announcement, it exceeded estimated earnings by 92.59%, with an EPS of $-0.02 compared to an estimate of $-0.27. Additionally, revenue saw a $4.84 million increase from the previous year. Overall, the company has shown strong performance in past earnings, as detailed in the full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/b21408f5-fc14-4f4c-b82b-ced7f282abbe",
            "pub_date": "2026-02-26 20:15:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PENN Entertainment Q4 earnings beat estimates by 138.89%, with EPS of $0.07 vs estimate of $-0.18. Revenue up $137M YoY.",
            "id": "8659edf1-854f-4a21-ac66-854eea15bcd5",
            "description": "On Thursday, February 26, 2026, PENN Entertainment (NASDAQ: PENN) announced its Q4 earnings at 07:00 AM. The company exceeded expected earnings by 138.89%, posting an EPS of $0.07 compared to an estimated $-0.18. Revenue saw a significant increase of $137.00 million from the previous year. In the preceding quarter, PENN Entertainment had experienced an earnings shortfall. For more details, the complete story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/8659edf1-854f-4a21-ac66-854eea15bcd5",
            "pub_date": "2026-02-26 20:15:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2d56c0dd-c6e2-49ee-b804-0c752642ae3e",
            "description": "ACI WORLDWIDE Q4 REVENUE USD 481.6 MILLION VS. IBES ESTIMATE USD 464.7 MILLION  Q4 OPERATING INCOME USD 108.834 MILLION VS. IBES ESTIMATE USD 118.6 MILLION  Q4 PRETAX PROFIT USD 99.039 MILLION VS. IBES ESTIMATE USD 110.1 MILLION  Q4 NET INCOME USD 64.336 MILLION VS. IBES",
            "link": "https://www.markets.news/headlines/2d56c0dd-c6e2-49ee-b804-0c752642ae3e",
            "pub_date": "2026-02-26 20:15:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Anika Therapeutics (NASDAQ: ANIK) beats earnings estimates by 616.67% in Q4 with EPS of $0.31. Revenue up $13k YoY.",
            "id": "5e2f6e5a-ddc2-4d3c-8f7f-fe1792e5e5f6",
            "description": "Anika Therapeutics (NASDAQ: ANIK) released its Q4 earnings on February 26, 2026, at 07:05 AM. The earnings report showcased impressive results, with Anika beating estimated earnings by a significant margin - reporting an EPS of $0.31 compared to an estimate of $-0.06, surpassing expectations by 616.67%. Additionally, the revenue for this quarter increased by $13,000 from the corresponding period last year. In the previous quarter, the company's earnings had also demonstrated strong performance... The complete story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/5e2f6e5a-ddc2-4d3c-8f7f-fe1792e5e5f6",
            "pub_date": "2026-02-26 20:15:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros. Discovery missed Q4 earnings by -433.33%, reporting an EPS of $-0.1 vs estimate of $0.03, with revenue down $567M.",
            "id": "45e30ea8-4e3a-47ae-bcc6-a5d748a0bf57",
            "description": "Warner Bros. Discovery (NASDAQ: WBD) released its Q4 earnings report on February 26, 2026 at 07:00 AM. The company fell short of estimated earnings by -433.33%, posting an EPS of $-0.1 compared to the expected $0.03. Revenue saw a $567.00 million decline from the previous year. Historical data shows the company consistently missing earnings expectations in the past. For more details, the full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/45e30ea8-4e3a-47ae-bcc6-a5d748a0bf57",
            "pub_date": "2026-02-26 20:15:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kimbell Royalty Partners (NYSE: KRP) Q4 earnings surpass estimates by 50% with EPS of $0.21, revenue increased by $15.74 million.",
            "id": "0bd064c1-b914-47ba-9b53-7a87e9e87635",
            "description": "Kimbell Royalty Partners (NYSE: KRP) shared their Q4 earnings on Thursday, February 26, 2026, at 07:00 AM. They surpassed estimated earnings by 50.0%, revealing an EPS of $0.21 compared to the expected $0.14. Revenue saw a $15.74 million increase from the previous year. For more details on their earnings and a comprehensive review, visit the full article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/0bd064c1-b914-47ba-9b53-7a87e9e87635",
            "pub_date": "2026-02-26 20:15:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ceaa7f3c-3a52-407e-9242-371052e2197e",
            "description": "Reports in Iran: negotiations are currently paused for consultation and will resume this evening Geneva time.",
            "link": "https://www.markets.news/headlines/ceaa7f3c-3a52-407e-9242-371052e2197e",
            "pub_date": "2026-02-26 20:15:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9f71e3a3-be50-4ddc-8528-835e0d4803cd",
            "description": "Iran US talks end - reports",
            "link": "https://www.markets.news/headlines/9f71e3a3-be50-4ddc-8528-835e0d4803cd",
            "pub_date": "2026-02-26 20:15:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "212f004d-7e6e-4f34-9d15-5a0b13cafe6f",
            "description": "Delegations leave negotiations site in Geneva",
            "link": "https://www.markets.news/headlines/212f004d-7e6e-4f34-9d15-5a0b13cafe6f",
            "pub_date": "2026-02-26 20:15:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Growing Middle East tensions drive up gold prices as investors seek safety amid US-Iran conflict, impacting equities and Bitcoin.",
            "id": "8744b9f6-4b01-4bf0-9158-08b85d0e4f07",
            "description": "Increasing tensions between the United States and Iran are leading to a rise in demand for safe-haven assets. Gold is particularly drawing the attention of investors as equities and Bitcoin are experiencing downward pressure. The escalating situation has caused gold prices to surge by X% while stocks and Bitcoin are facing losses of Y% and Z%, respectively. Investors are flocking to the precious metal as a way to hedge against the growing uncertainty in the global market.",
            "link": "https://www.markets.news/headlines/8744b9f6-4b01-4bf0-9158-08b85d0e4f07",
            "pub_date": "2026-02-26 20:15:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toberman Becker Wealth in St. Louis welcomes Mike Holtz, CFP® to their team, a new addition to the advisory staff.",
            "id": "f597e03a-a89e-4119-b981-c61ffc8e51f0",
            "description": "In St. Louis, on February 26, 2026, Toberman Becker Wealth, a financial advisory firm catering to individuals and families in the area, welcomed Mike Holtz, CFP®, to its advisory team. Holtz has joined the firm as a CERTIFIED FINANCIAL PLANNER®, bringing his expertise to enhance the services provided to clients. This addition highlights the firm's commitment to offering top-notch financial advice.",
            "link": "https://www.markets.news/headlines/f597e03a-a89e-4119-b981-c61ffc8e51f0",
            "pub_date": "2026-02-26 20:05:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Doritos introduces new Doritos Protein with 10g protein per serving, single-serve bag with 17g expected.",
            "id": "97a8c34d-2d54-43ce-b0e8-e38e0d0a2c57",
            "description": "Soon to be launched by PepsiCo Foods are new Doritos® flavors boasting 10 grams of protein per serving. These products are set to be available on shelves next month. Additionally, a single-serve bag providing 17 grams of protein is anticipated to be released later this year. The introduction of these protein-packed snacks marks a significant development in the snack industry, catering to consumers seeking both flavor and nutrition. The unveiling of these bold flavors in Doritos® is expected to invigorate the market, offering a satisfying option for those looking to satisfy their snack cravings while prioritizing protein intake.",
            "link": "https://www.markets.news/headlines/97a8c34d-2d54-43ce-b0e8-e38e0d0a2c57",
            "pub_date": "2026-02-26 20:06:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}