{
    "data": [
        {
            "title": "Amplify Desmos Math program earns all-green rating from EdReports across all gateways.",
            "id": "b39c8386-50a9-4141-8cdd-c566e08b7ef7",
            "description": "Amplify's Desmos Math program, which is supported by research and focused on nurturing curiosity, has achieved top scores in all three key evaluation areas by EdReport. The program received the highest rating in all metrics, signifying its exceptional quality. This announcement was made by Amplify, a company known for creating innovative educational programs. The success of Amplify Desmos Math highlights its effectiveness and validation, further solidifying its reputation as a leading math program.",
            "link": "https://www.markets.news/headlines/b39c8386-50a9-4141-8cdd-c566e08b7ef7",
            "pub_date": "2026-02-27 05:28:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell stock surged after beating Q4 earnings: $3.89 per share (10%) and $33.38 billion revenue, up 19% for 2026.",
            "id": "15e60a32-26bc-43a1-b03a-230d7230ce86",
            "description": "Shares of Dell Technologies, Inc. (NYSE: DELL) saw a significant boost in after-hours trading on Thursday following the release of its fourth-quarter earnings report, which outperformed expectations across the board. The report revealed quarterly earnings of $3.89 per share, surpassing the consensus estimate of $3.53 by more than 10%. Additionally, quarterly revenue reached $33.38 billion, exceeding the Street estimate of $31.73 billion and showing growth from $23.93 billion in the same period last year. Dell's fiscal 2026 highlights included record full-year revenue of $113.5 billion, marking a 19% increase year-over-year, and record full-year diluted earnings per share (EPS) of $8.68, up 36% year-over-year. For more details, the complete story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/15e60a32-26bc-43a1-b03a-230d7230ce86",
            "pub_date": "2026-02-27 05:28:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1b4746bb-9c22-4136-96b4-ba3c6744765f",
            "description": "OIL SWINGS AS MIXED SIGNALS FROM US-IRAN TALKS OFFSET GEOPOLITICAL RISKS, WITH WTI SETTLING AT $65.21 AND BRENT AT $70.75, WHILE TRADERS SHIFT FOCUS TO THE UPCOMING OPEC+ SUPPLY DECISION AMID SIGNS OF MARKET SOFTNESS.",
            "link": "https://www.markets.news/headlines/1b4746bb-9c22-4136-96b4-ba3c6744765f",
            "pub_date": "2026-02-27 05:28:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US legislators introduce bill to shield blockchain developers from legal action. The Promoting Innovation in Blockchain Development Act aims to prevent prosecution.",
            "id": "c2327c19-f0ad-4f5d-adf3-45816f95db56",
            "description": "Congress is considering the Promoting Innovation in Blockchain Development Act, which is backed by the industry. This act aims to address the issue of criminalizing the writing of code. It has gained widespread support and could potentially be a significant solution to this problem. The act is seen as a proactive step in protecting developers from legal repercussions and promoting innovation in blockchain technology. With the number of supporters increasing, it is becoming increasingly likely that this act will be passed.",
            "link": "https://www.markets.news/headlines/c2327c19-f0ad-4f5d-adf3-45816f95db56",
            "pub_date": "2026-02-27 05:29:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Encord secures $60M Series C funding to scale AI data infrastructure as physical AI grows.",
            "id": "d39da945-37a1-4a02-9c67-e90d4b36e2ef",
            "description": "Encord has announced the successful completion of their $60 million Series C funding round to enhance their AI-native data infrastructure. This funding will help them scale up as demand for physical AI technologies reaches a turning point. The corrected news release clarifies the details surrounding the investment and its strategic importance for Encord's expansion in the market.",
            "link": "https://www.markets.news/headlines/d39da945-37a1-4a02-9c67-e90d4b36e2ef",
            "pub_date": "2026-02-27 05:30:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Matador Resources priced a $750 million offering of 6.000% senior unsecured notes due 2034 at 100% face value.",
            "id": "581e4ef1-a537-4800-b1b4-25b526a852f2",
            "description": "Matador Resources Company (NYSE: MTDR) has disclosed the pricing of a private offering of $750 million in 6.000% senior unsecured notes due 2034 (the “New Notes”) at 100% of their face value. The offering is anticipated to be finalized by March 5, 2026, pending customary closing conditions. Matador plans to utilize the net proceeds from the offering to repurchase any or all of the existing $500 million outstanding aggregate principal.",
            "link": "https://www.markets.news/headlines/581e4ef1-a537-4800-b1b4-25b526a852f2",
            "pub_date": "2026-02-27 05:30:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Senators criticize FTX founder for backing crypto bill; bipartisan opposition to Sam Bankman-Fried's support for Clarity Act.",
            "id": "abe94452-ae3a-4fa6-b389-8e2be900add5",
            "description": "Senators from both the Republican and Democrat parties united in opposition to the endorsement of the Clarity Act crypto bill by Sam Bankman-Fried, the incarcerated founder of FTX. Their collective pushback highlights a growing concern within the government over the proposed legislation, as more lawmakers express reservations about its implications for the cryptocurrency industry. This bipartisan resistance underscores the need for further discussion and analysis of the bill's potential impact.",
            "link": "https://www.markets.news/headlines/abe94452-ae3a-4fa6-b389-8e2be900add5",
            "pub_date": "2026-02-27 05:30:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nexa Res (NYSE: NEXA) beats Q4 earnings estimate by 5.26%, reports $0.60 EPS vs. $0.57 estimate. Revenue up $162 million YoY.",
            "id": "e55973ca-e87e-4956-80ac-27b6f5b578d2",
            "description": "Nexa Res (NYSE: NEXA) revealed its Q4 earnings on February 26, 2026, at 04:00 PM. The earnings report indicates that Nexa Res exceeded estimated earnings by 5.26%, posting an EPS of $0.6 compared to the estimated $0.57. Revenue showed a significant increase of $162.00 million from the previous year. In the prior quarter, Nexa Res fell short on EPS. For a detailed account, refer to the full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/e55973ca-e87e-4956-80ac-27b6f5b578d2",
            "pub_date": "2026-02-27 05:30:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Boardwalktech reported Q3-FY26 financial results with $1 million revenue, $3.8 million ARR, 86.9% gross margin, and $(0.4) million net loss, showing improvements in adjusted EBITDA.",
            "id": "cf42047d-d38b-4749-a9d3-33f049c51e3d",
            "description": "Boardwalktech Software Corp. reported financial results for the three-month period ended December 31, 2025. Revenues for Q3-FY26 were $1 million, unchanged from the previous quarter but a 25% decrease from Q3-FY25. Annual Recurring Revenue at December 31, 2025, was $3.8 million. Gross margin for Q3-FY26 was 86.9%, with Adjusted EBITDA at a loss of $(0.2) million, showing improvement from previous quarters. Net loss for Q3-FY26 was $(0.4) million. SG&A expenses in Q3-FY26 totaled $1.1 million, showing a decrease from the previous quarters. The Company continues to recognize savings from cost alignment efforts. Non-IFRS net loss for Q3 Fiscal 2026 was also reported. The full story is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/cf42047d-d38b-4749-a9d3-33f049c51e3d",
            "pub_date": "2026-02-27 05:30:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Intchains Group Limited reported Q4 2025 revenue of RMB36.1M with a loss of RMB130.7M. Full-year 2025 revenue was RMB220.9M with a loss of RMB52.0M. Cash position as of Dec 31, 2025, was RMB473.8M. Intchains aims to focus on altcoin mining products, cost optimization, ETH accumulation, staking, and aims to mitigate impacts of new regulations.",
            "id": "a608c1c7-bf52-452c-bd2d-4985db99c072",
            "description": "The Intchains Group Limited, a company focusing on altcoin mining products and Ethereum staking, announced its unaudited financial results for Q4 2025 and FY 2025. In Q4 2025, revenue was RMB36.1 million (US$5.2 million), with a loss from operations of RMB83.7 million (US$12.0 million) and net loss of RMB130.7 million (US$18.7 million). For FY 2025, revenue was RMB220.9 million (US$31.6 million), with a loss from operations of RMB104.7 million (US$15.0 million) and net loss of RMB52.0 million (US$7.4 million). The company's cash position was RMB473.8 million (US$67.8 million) as of Dec 31, 2025. Intchains launched Goldshell Stake, a PoS platform, focusing on altcoin mining machines sale and Ethereum accumulation. They have acquired a PoS platform for $1.3 million and plan to introduce new altcoin mining products in 2026. Intchains continued ETH accumulation and staking activities, with 9,070 ETH held as of Feb 23, 2026. The company's long-term strategy involves expanding overseas sales channels given regulatory changes in China, ensuring minimal impact on operations. For further details, a conference call discussing the financial results is scheduled for Feb 26, 2026. Non-GAAP adjusted net loss was RMB128.5 million (US$18.4 million) for Q4 2025 and RMB43.4 million (US$6.2 million) for FY 2025. In terms of assets, the company had total assets of RMB1,015,391 thousand (US$145,198 thousand) as of Dec 31, 2025.",
            "link": "https://www.markets.news/headlines/a608c1c7-bf52-452c-bd2d-4985db99c072",
            "pub_date": "2026-02-27 05:30:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Seer Q4 earnings exceed estimates with EPS of $-0.29 vs $-0.34, revenue up $201k YoY. Full details on Benzinga.com.",
            "id": "cfed9c0b-bfff-4efe-99bf-fc5f0b010fd9",
            "description": "SEER (NASDAQ: SEER) released its Q4 earnings on February 26, 2026, at 04:05 PM. The report revealed an earnings surprise, surpassing estimates by 14.71% with an EPS of $-0.29 compared to the expected $-0.34. Revenue saw a $201 thousand increase from the previous year. In the previous earnings period, SEER fell short on EPS expectations. For further details, the complete article can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/cfed9c0b-bfff-4efe-99bf-fc5f0b010fd9",
            "pub_date": "2026-02-27 05:21:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PubMatic (PUBM) beats Q4 earnings by 262.5% with EPS of $0.29. Revenue down $5.46 million from last year.",
            "id": "0fc532ae-c8b7-4883-af84-a1cc242d5883",
            "description": "PubMatic (PUBM) released its Q4 earnings on February 26, 2026, at 04:05 PM. The company surpassed earnings expectations by 262.5%, reporting an EPS of $0.29 compared to an estimated $0.08. Revenue declined by $5.46 million year-over-year. For more insights on PubMatic's financial performance, visit the full article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/0fc532ae-c8b7-4883-af84-a1cc242d5883",
            "pub_date": "2026-02-27 05:21:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BioLife Solutions Q4 earnings report shows EPS beat estimates by 500%, reaching $0.04 vs $-0.01, revenue up $2.05 million.",
            "id": "1b7dc262-792a-4415-8a22-8b9cd6c00ce1",
            "description": "Biotechnology company BioLife Solutions (NASDAQ: BLFS) announced its fourth-quarter earnings on February 26, 2026, at 04:03 PM. The earnings report revealed significant achievements. BioLife Solutions exceeded estimated earnings by a remarkable 500.0%, posting an earnings per share (EPS) of $0.04 compared to the projected $-0.01. Revenue witnessed a $2.05 million increase from the corresponding period in the previous year. In the preceding earnings records, the company surpassed EPS expectations by $0.05. For the detailed story, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/1b7dc262-792a-4415-8a22-8b9cd6c00ce1",
            "pub_date": "2026-02-27 05:21:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Relay Therapeutics beats Q4 earnings estimate with EPS of $-0.32 versus estimated $-0.39. Revenue up $7.00 million.",
            "id": "cb6f1815-d28a-43ed-8f11-18c7c5012e09",
            "description": "Relay Therapeutics (RLAY) released its Q4 earnings report on February 26, 2026 at 04:05 PM. The company exceeded estimated earnings by 17.95%, with an EPS of $-0.32 compared to an estimate of $-0.39. Revenue increased by $7.00 million from the previous year. In the prior period, the company fell short on EPS by $0.02. For more details, visit a financial news website.",
            "link": "https://www.markets.news/headlines/cb6f1815-d28a-43ed-8f11-18c7c5012e09",
            "pub_date": "2026-02-27 05:21:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Solventum Q4 earnings beat estimates by 4.67%, EPS at $1.57 vs $1.50. Revenue down $76 million from last year.",
            "id": "ab503a88-bfe4-440a-b272-ea76ae42c3df",
            "description": "Solventum, trading on NYSE under the symbol SOLV, released its Q4 earnings report on February 26, 2026, at 04:05 PM. The report revealed that the company exceeded estimated earnings by 4.67%, with an EPS of $1.57 compared to the expected $1.50. However, there was a decrease in revenue by $76.00 million compared to the same period last year. In the preceding quarter, Solventum outperformed expectations on EPS by $0.07, resulting in a 7.91% increase. For further details, the complete story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/ab503a88-bfe4-440a-b272-ea76ae42c3df",
            "pub_date": "2026-02-27 05:21:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OPKO Health Q4 earnings: EPS beats by 42.86% at $-0.04 vs. $-0.07 estimate, revenue down $35.10 million.",
            "id": "463bfb7e-ef6a-405c-8d96-3eaae46f388c",
            "description": "OPKO Health (NASDAQ: OPK) released its Q4 earnings on February 26, 2026, at 04:05 PM. The earnings report showed a beat on estimated earnings by 42.86%, with an EPS of $-0.04 compared to the expected $-0.07. Revenue decreased by $35.10 million from the previous year. The company had historical earnings summary where it missed on EPS. For more detailed information, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/463bfb7e-ef6a-405c-8d96-3eaae46f388c",
            "pub_date": "2026-02-27 05:21:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assured Guaranty (NYSE: AGO) beat Q4 earnings estimates by 49.68% with EPS of $2.32, revenue up $121 million.",
            "id": "5c701b23-3784-431a-8da5-d18d83b6847a",
            "description": "Assured Guaranty (NYSE: AGO) published its Q4 earnings report on Thursday, February 26, 2026, at 04:00 PM. The report revealed that Assured Guaranty exceeded expected earnings by 49.68%, with an EPS of $2.32 compared to the estimated $1.55. Additionally, their revenue saw an increase of $121.00 million from the corresponding period the previous year. For a detailed analysis, the complete article can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/5c701b23-3784-431a-8da5-d18d83b6847a",
            "pub_date": "2026-02-27 05:21:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oportun Financial (OPRT) beat Q4 earnings by 17.39%, with EPS at $0.27 versus estimated $0.23, revenue down $3.20 million from last year.",
            "id": "cc3dd16e-e3ab-458a-afe2-93ce0f9572e2",
            "description": "Oportun Financial (NASDAQ: OPRT) recently reported its Q4 earnings on February 26, 2026, at 04:05 PM. The company surpassed estimated earnings by 17.39%, with an EPS of $0.27 compared to an estimated $0.23. Revenue decreased by $3.20 million from the previous year. In the last quarter, the company exceeded EPS expectations by $0.15, leading to a 1.56% rise in share value. More details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/cc3dd16e-e3ab-458a-afe2-93ce0f9572e2",
            "pub_date": "2026-02-27 05:21:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sprout Social (NASDAQ: SPT) beats Q4 earnings by 900%, reports $0.2 EPS vs. $0.02 estimate, revenue up $13.8 million.",
            "id": "06d869d2-c444-4e32-9ebb-f3df432fd657",
            "description": "Sprout Social (SPT) released their Q4 earnings on Thursday, February 26, 2026, at 04:05 PM. They surpassed estimated earnings by a significant 900.0%, posting an EPS of $0.2 compared to the expected $0.02. Their revenue also saw a substantial increase of $13.80 million from the previous year. In the last quarter, the company exceeded EPS expectations by $0.22, leading to a 3.71% decrease. More details are accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/06d869d2-c444-4e32-9ebb-f3df432fd657",
            "pub_date": "2026-02-27 05:21:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "nLight (LASR) Q4 earnings beat estimates by 133.33% with EPS $0.14 vs $0.06. Revenue up $33.80 million from last year.",
            "id": "bdfa102b-458d-4622-bd7a-4e72355ff600",
            "description": "nLight (NASDAQ: LASR) released its Q4 earnings on Thursday, February 26, 2026, at 04:05 PM. The results exceeded expectations with an EPS of $0.14, surpassing the estimated $0.06 by 133.33%. Revenue witnessed a significant increase of $33.80 million compared to the previous year. In the past quarter, nLight has shown impressive growth in earnings and overall financial performance. For more details, the complete report is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/bdfa102b-458d-4622-bd7a-4e72355ff600",
            "pub_date": "2026-02-27 05:15:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}