{
    "data": [
        {
            "title": "",
            "id": "6ac8ff78-111d-4770-a74d-0d6ba974573b",
            "description": "Fed's Goolsbee: Rates can come down, but don't want to front-load before inflation eases - Fox News",
            "link": "https://www.markets.news/headlines/6ac8ff78-111d-4770-a74d-0d6ba974573b",
            "pub_date": "2026-02-27 03:44:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ce8cee8a-61a0-4eaf-b4db-c580a88c9535",
            "description": "Fed's Goolsbee: The economy has been solid, and the job market is stable.",
            "link": "https://www.markets.news/headlines/ce8cee8a-61a0-4eaf-b4db-c580a88c9535",
            "pub_date": "2026-02-27 03:44:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "291d8109-d1e2-47f0-bc77-1885b3ee128a",
            "description": "Fed's Goolsbee: I am one of the more optimistic people on the Fed about rate cuts this year",
            "link": "https://www.markets.news/headlines/291d8109-d1e2-47f0-bc77-1885b3ee128a",
            "pub_date": "2026-02-27 03:44:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0413c31c-8a6c-48d3-ba8f-2decfca70103",
            "description": "Fed's Goolsbee: I want us to be careful.",
            "link": "https://www.markets.news/headlines/0413c31c-8a6c-48d3-ba8f-2decfca70103",
            "pub_date": "2026-02-27 03:44:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brandon Stanton named 2026 PRWeek Communicator of the Year for his Humans of New York project. Being honored at PRWeek Awards on March 12 in NYC.",
            "id": "b61d8998-6088-4a4a-ae71-b314bfe443c1",
            "description": "New York-based Brandon Stanton, renowned for the Humans of New York online project, has been named as the 2026 Communicator of the Year by PRWeek. The esteemed writer and photographer will receive this honor at the upcoming PRWeek Awards event in New York City on March 12th. Stanton has been a trailblazer in digital engagement since 2010, moving from street photography to conducting deep, unscripted interviews with individuals. With an impressive following of over 29 million, his approach has reshaped online storytelling.",
            "link": "https://www.markets.news/headlines/b61d8998-6088-4a4a-ae71-b314bfe443c1",
            "pub_date": "2026-02-27 03:45:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d3adb577-602c-43ab-befc-65080e6db74c",
            "description": "US STATE DEPT: UP TO $10 MLN IN REWARD OFFERS FOR INFORMATION LEADING TO ARRESTS AND/OR CONVICTIONS OF ALLEGED MEXICAN SINALOA CARTEL PLAZA BOSSES",
            "link": "https://www.markets.news/headlines/d3adb577-602c-43ab-befc-65080e6db74c",
            "pub_date": "2026-02-27 03:33:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Proofpoint integrates with AWS Security Hub Extended plan, providing advanced threat protection and AI innovation.",
            "id": "a15c05df-34db-490e-8dff-0af26932ebcc",
            "description": "A cybersecurity and compliance company based in Sunnyvale, California, Proofpoint, Inc., revealed the integration of Proofpoint Collaboration Protection with the Extended plan in AWS Security Hub. This integration allows customers to access Proofpoint's advanced threat protection and AI technology for email, messaging, and collaboration tools through a unified experience with streamlined contracting and billing. With this integration, users can benefit from enhanced security measures within the Amazon Web Services ecosystem.",
            "link": "https://www.markets.news/headlines/a15c05df-34db-490e-8dff-0af26932ebcc",
            "pub_date": "2026-02-27 03:33:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Upwind integrates CNAPP with AWS Security Hub Extended plan for real-time visibility; reduces alert noise.",
            "id": "4c67e552-b1ab-46a5-b3b8-229e6e9f3aa2",
            "description": "Today, in San Francisco, Upwind, a prominent cloud security company, revealed the integration of its cloud-native application protection platform (CNAPP) with the Extended plan in AWS Security Hub. This collaboration will allow customers to enhance their visibility into AWS workloads in real-time, minimizing alert distractions and prioritizing key risks. By merging AWS detection services with Upwind’s runtime technology, customers can now effectively manage security threats and vulnerabilities.",
            "link": "https://www.markets.news/headlines/4c67e552-b1ab-46a5-b3b8-229e6e9f3aa2",
            "pub_date": "2026-02-27 03:33:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "efb26b0a-b309-431b-a6d0-7a8ded5cee88",
            "description": "NYMEX Natural Gas April futures settle at $2.8270/MMBTU. NYMEX Gasoline March futures settle at $2.0323 a gallon. NYMEX Diesel March futures settle at $2.6125 a gallon. NYMEX WTI crude April futures settle at $65.21 a barrel, down 21 cents, 0.32%.",
            "link": "https://www.markets.news/headlines/efb26b0a-b309-431b-a6d0-7a8ded5cee88",
            "pub_date": "2026-02-27 03:34:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pennsylvania American Water launches American Water Charitable Foundation's 2026 Grant Program promoting clean water.",
            "id": "775a1a64-f32c-409d-8fea-a3995d16ccc3",
            "description": "Pennsylvania American Water, based in Mechanicsburg, announced on Feb. 26, 2026, the initiation of the American Water Charitable Foundation's 2026 Water and Environment Grant Program. Through this program, the Foundation is seeking applications from community partners for grants aimed at supporting initiatives that focus on ensuring clean water availability. This is part of their ongoing efforts to promote environmental conservation and sustainability.",
            "link": "https://www.markets.news/headlines/775a1a64-f32c-409d-8fea-a3995d16ccc3",
            "pub_date": "2026-02-27 03:34:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e74abbf2-4abd-4609-8e0c-dede8d475b56",
            "description": "S&P: Micron Tech rating raised to 'bbb' on AI-driven scale, growth enhancement; outlook positive.",
            "link": "https://www.markets.news/headlines/e74abbf2-4abd-4609-8e0c-dede8d475b56",
            "pub_date": "2026-02-27 03:34:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Video editor at MrBeast suspended from Beast Industries as company probes insider trading allegations. CEO Jeff Housenbold confirms investigation.",
            "id": "e6b5e8a3-34cd-427e-ba7b-72d4fd14ddd5",
            "description": "An employee at Beast Industries has been suspended pending an internal investigation into accusations of insider trading, as confirmed by CEO Jeff Housenbold.",
            "link": "https://www.markets.news/headlines/e6b5e8a3-34cd-427e-ba7b-72d4fd14ddd5",
            "pub_date": "2026-02-27 03:37:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "5877c5a5-7497-4c8f-bcbb-64e24a284a35",
            "description": "Umerov; ‘Another round of negotiations has concluded in Geneva. The work took place in two formats – separately with the American side and a trilateral meeting involving the US and Switzerland. Following the meetings, together with David Arahamiya and representatives of the",
            "link": "https://www.markets.news/headlines/5877c5a5-7497-4c8f-bcbb-64e24a284a35",
            "pub_date": "2026-02-27 03:38:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "00eb6a74-bfb1-40a6-b390-0afb837c75a8",
            "description": "Araghchi: The negotiations were held indirectly and mediated by Mr. Busaidi",
            "link": "https://www.markets.news/headlines/00eb6a74-bfb1-40a6-b390-0afb837c75a8",
            "pub_date": "2026-02-27 03:39:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DXRG.AI: Humans invest $6.1M+ in AI agents for trading on DX Terminal Pro. 1,500+ traders join 21-day battle royale.",
            "id": "f871f90d-a8a1-4a1e-b5f6-79290174299c",
            "description": "In Terminal City, BC, a groundbreaking DeFi experiment is underway where over 1,500 crypto traders have entrusted AI agents with trading decisions in a 21-day battle royale. The event, aiming to have only one token surviving, has seen a massive investment of more than $6.1 million in AI agent wallets. This unique project marks a significant step in exploring the capabilities of AI in the realm of cryptocurrency trading, showcasing the growing intersection of technology and finance in the digital age.",
            "link": "https://www.markets.news/headlines/f871f90d-a8a1-4a1e-b5f6-79290174299c",
            "pub_date": "2026-02-27 03:40:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ripple deploys $550M to XRPL since 2017, shifting to distributed funding model in 2026, supporting 200 projects globally.",
            "id": "00940bd8-5988-4eb5-8f07-d1897579f352",
            "description": "Ripple has invested over $550 million in the XRP Ledger ecosystem since 2017, supporting nearly 200 projects worldwide in areas like payments, DeFi, tokenization, AI, and enterprise applications. The company is shifting its funding model in 2026, moving towards distributed funding with programs like the FinTech Builder Program. This program provides support for startups developing financial applications such as stablecoin payments and credit infrastructure, offering structured support from product design to market launch. Ripple's new approach includes partnerships with accelerators and a focus on independent organizations and regional hubs to support builders.",
            "link": "https://www.markets.news/headlines/00940bd8-5988-4eb5-8f07-d1897579f352",
            "pub_date": "2026-02-27 03:28:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin price drops to $67,681.84, while Ethereum, XRP, Dogecoin fall by 2%. $415.80 million losses from 148,693 liquidated traders.",
            "id": "0677f990-9fc9-43a0-8632-a379795cd6c9",
            "description": "Bitcoin dropped below $68,000 on Thursday, reversing its two-day upward trend as money moved away from alternative and meme cryptocurrencies in a broader risk-off market sentiment. The latest prices for cryptocurrencies are as follows: Bitcoin (BTC) at $67,681.84, Ethereum (ETH) at $2,022.21, Solana (SOL) at $86.00, XRP at $1.39, Dogecoin (DOGE) at $0.09692, and Shiba Inu (SHIB) at $0.005980. According to Coinglass data, 148,693 traders were liquidated in the last 24 hours, totaling $415.80 million in losses. SoSoValue data indicates that spot Bitcoin ETFs had net inflows of $506.5 million on Wednesday, while spot Ethereum ETFs saw net inflows of $157.1 million. For further details, the complete article is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/0677f990-9fc9-43a0-8632-a379795cd6c9",
            "pub_date": "2026-02-27 03:28:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1f4a5c65-4c03-425f-9aeb-86f509f10d0d",
            "description": "STATE DEPT SAYS IT APPROVES POTENTIAL SALE OF KU BAND MULTI-FUNCTION RADIO FREQUENCY SYSTEM (KUMRFS) RADARS TO JORDAN FOR $280 MILLION",
            "link": "https://www.markets.news/headlines/1f4a5c65-4c03-425f-9aeb-86f509f10d0d",
            "pub_date": "2026-02-27 03:28:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a77422f9-cb59-4c8f-920a-a86eda54fcb7",
            "description": "IRAN'S ARAQCHI: TECHNICAL TALKS WILL START IN VIENNA FROM MONDAY",
            "link": "https://www.markets.news/headlines/a77422f9-cb59-4c8f-920a-a86eda54fcb7",
            "pub_date": "2026-02-27 03:28:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ERI offers zero waste, zero emissions ITAD solutions in Indiana with 8 recycling facilities. ISO 27001, SOC 2 Type II certified.",
            "id": "7f039d76-af1a-4e86-8edd-185896b70931",
            "description": "ERI, a top provider in material resource recovery, ITAD, mobility, and data destruction, is also the largest electronics recycler in the U.S. They operate eight e-waste recycling facilities that are zero waste, zero emissions, and carbon-neutral. Among these facilities is their advanced flagship location in Plainfield, Indiana. ERI has been offering electronic waste circularity services in Indiana since 2008. The company adheres to ISO 27001, SOC 2 Type II, and NAI standards for data security and processing.",
            "link": "https://www.markets.news/headlines/7f039d76-af1a-4e86-8edd-185896b70931",
            "pub_date": "2026-02-27 03:28:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}