{
    "data": [
        {
            "title": "",
            "id": "f820e421-4905-44fa-83d7-ebd897e62cf4",
            "description": "SBM Offshore begins EUR227M share buyback after finishing 2025 program.",
            "link": "https://www.markets.news/headlines/f820e421-4905-44fa-83d7-ebd897e62cf4",
            "pub_date": "2026-02-27 02:23:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Melissa Sierra starts Operator's Intelligence Council for founders and executives; aims to restore clarity for lasting businesses.",
            "id": "fba8de9f-6b21-4265-a451-ebb6f43438e3",
            "description": "A specialized mastermind program exclusively for founders and executives aimed at reestablishing strategic focus for businesses aiming for long-term success has been launched in Scarsdale, New York on February 26, 2026. Melissa Sierra, renowned leadership strategist and founder recognized for her expertise in assisting growth-stage CEOs, introduced the program. The initiative is set to provide invaluable insights and guidance for participants in navigating the complexities of business growth.",
            "link": "https://www.markets.news/headlines/fba8de9f-6b21-4265-a451-ebb6f43438e3",
            "pub_date": "2026-02-27 02:23:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "0x debuts Cross-Chain API Beta, facilitating autonomous trading and multi-chain execution for developers.",
            "id": "afbc2fa8-6925-4f30-9bb3-160656db488c",
            "description": "Today, in San Francisco on February 26, 2026, 0x, a prominent decentralized exchange infrastructure provider, revealed the introduction of its Cross-Chain API. This developer API brings together bridging and swap liquidity to facilitate autonomous trading and multi-chain execution.",
            "link": "https://www.markets.news/headlines/afbc2fa8-6925-4f30-9bb3-160656db488c",
            "pub_date": "2026-02-27 02:23:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NPA celebrates reaching 200 programs nationwide, benefitting 100,000+ elderly to live independently.",
            "id": "f61e4fb7-74bf-4688-9cb1-f7035ac8c095",
            "description": "Over 100,000 seniors are supported to live safely and independently in their communities by the Programs of All-Inclusive Care for the Elderly. The National PACE Association (NPA) disclosed a noteworthy achievement as they revealed that the Program of All-Inclusive Care for the Elderly has surpassed this milestone. This program has played a crucial role in enhancing the quality of life for a substantial number of elderly individuals by providing them with the necessary support and services.",
            "link": "https://www.markets.news/headlines/f61e4fb7-74bf-4688-9cb1-f7035ac8c095",
            "pub_date": "2026-02-27 02:23:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Taronga Group invests in Rebound Technologies' IcePoint® platform for thermal energy storage.",
            "id": "34a6c63a-a0b0-4889-a1ba-dd1878e37797",
            "description": "On February 26, 2026, Rebound Technologies, Inc. announced the completion of a strategic investment round. The investment was led by Taronga Group, a prominent investor in real asset technologies. Rebound Technologies is known for its innovative IcePoint® thermal energy storage and cooling platform. The specifics of the investment amount were not disclosed in the news release.",
            "link": "https://www.markets.news/headlines/34a6c63a-a0b0-4889-a1ba-dd1878e37797",
            "pub_date": "2026-02-27 02:23:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ca4de4d7-3a57-4fd5-9917-366ad27a7041",
            "description": "Hungary’s Prime Minister said that his country would deploy troops to protect its energy facilities, claiming that Ukraine was planning ‘further actions aimed at disrupting the operation of Hungary's energy system.’ Viktor Orban, speaking in a video address, repeated his claim",
            "link": "https://www.markets.news/headlines/ca4de4d7-3a57-4fd5-9917-366ad27a7041",
            "pub_date": "2026-02-27 02:26:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Celsius Holdings, Inc. (NASDAQ: CELH) shares surged after delivering upbeat quarterly results. Q4 adjusted EPS was 26 cents, surpassing estimates, with sales of $721.628 million (+117% YoY). CEO noted a 20% market share increase in the U.S. energy drink category. Retail sales for Celsius, Alani Nu, and Rockstar Energy all saw growth, with Alani Nu showing the highest increase at 76.9%. North America sales reached $699.5 million, while International sales hit $22.1 million.",
            "id": "bd50d06d-7e52-4937-883c-68cc906a043d",
            "description": "Celsius Holdings, Inc. saw their shares rise after reporting strong quarterly performance. They exceeded expectations with adjusted earnings per share of 26 cents, beating the estimated 20 cents. Quarterly sales were $721.628 million, a 117% increase year over year, surpassing the expected $640.834 million. The company's CEO highlighted reaching a 20% dollar share of the U.S. energy drink category in Q4 2025. North America sales grew by 124% to $699.5 million, while international sales rose by 9% to $22.1 million. In retail performance, Celsius Holdings' portfolio retail sales increased by 24.4% in tracked U.S. channels, with the CELSIUS brand racking up a 12.8% increase, Alani Nu growing by 76.9%, and Rockstar Energy witnessing a decline of 10.3%.",
            "link": "https://www.markets.news/headlines/bd50d06d-7e52-4937-883c-68cc906a043d",
            "pub_date": "2026-02-27 02:16:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hormel Q1: EPS beats at 34 cents, sales miss at $3.03B. Operating income $244M, cash flow at $349M, retail volume down 6%.",
            "id": "aba706ff-de29-48c2-b113-385f333573c7",
            "description": "Hormel Foods Corp's (NYSE: HRL) stock experienced a decline following the release of their first-quarter FY26 results. The company posted adjusted earnings per share of 34 cents, surpassing the analyst estimate of 32 cents. However, their sales figure of $3.03 billion fell short of the expected $3.07 billion. Operating income was reported at $244 million, with adjusted operating income at $247 million, resulting in operating and adjusted operating margins of 8% and 8.2% respectively. Cash flow from operations for the quarter amounted to $349 million. Inventories at the end of the quarter totaled $1.6 billion, while they had cash reserves of $868 million. In terms of segment performance, retail volume saw a 6% decrease and net sales dropped by 2%, influenced by the company's strategic withdrawal from specific non-core private label snack nut products and challenges in branded items.",
            "link": "https://www.markets.news/headlines/aba706ff-de29-48c2-b113-385f333573c7",
            "pub_date": "2026-02-27 02:16:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8f5fcbe5-2ab0-45d5-93be-2c393a8a1cbb",
            "description": "7 counterparties take $3.796b at the Fed reverse repo operation.",
            "link": "https://www.markets.news/headlines/8f5fcbe5-2ab0-45d5-93be-2c393a8a1cbb",
            "pub_date": "2026-02-27 02:17:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1a149a02-4f6e-41b8-be10-d785e4e19a2b",
            "description": "CANADIAN MINISTER FOR CANADA–US TRADE SAYS PRIVATE GOVERNMENT-TO-GOVERNMENT USMCA TALKS ARE NOT DISCOURAGING",
            "link": "https://www.markets.news/headlines/1a149a02-4f6e-41b8-be10-d785e4e19a2b",
            "pub_date": "2026-02-27 02:17:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IntelePeer partners with Your Social Smile to enhance dental patient engagement, workflow automation, and revenue growth.",
            "id": "bb1db5e7-13f4-44a7-a2b4-2e6f3c0429f5",
            "description": "In a recent announcement, IntelePeer has joined forces with Your Social Smile to enhance their Agentic AI solutions geared towards improving patient engagement, streamlining workflows, and boosting dental revenue growth. The collaboration, effective as of Feb. 26, 2026, is part of IntelePeer's strategy to expand their offerings in this area. This partnership signifies an important step for both companies as they leverage their expertise to provide innovative solutions in the dental industry.",
            "link": "https://www.markets.news/headlines/bb1db5e7-13f4-44a7-a2b4-2e6f3c0429f5",
            "pub_date": "2026-02-27 02:17:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CPKC completed filing 2025 Form 10-K; includes annual report and financial statements. ",
            "id": "6d3685a1-f6da-47a7-b5ee-2dcd6c4cf00a",
            "description": "Calgary-based Canadian Pacific Kansas City announced on February 26, 2026, that it has successfully submitted its 2025 annual report on Form 10-K to the U.S. authorities. This filing contains the audited financial statements and management's discussion and analysis for the year. CPKC trades on the Toronto Stock Exchange under the ticker symbol \"CP\" and on the New York Stock Exchange under \"CP.\"",
            "link": "https://www.markets.news/headlines/6d3685a1-f6da-47a7-b5ee-2dcd6c4cf00a",
            "pub_date": "2026-02-27 02:17:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vego Garden in Tomball, Texas, urges gardeners to plan their spring garden with an ecosystem approach for sustainable growth.",
            "id": "81deb849-fa9e-471e-92c6-0fdf8372b5fc",
            "description": "In Tomball, Texas, on February 26, 2026, Vego Garden from the website vegogarden.com is advocating for gardeners to kickstart the spring season with a well-defined planting strategy and proper tools. The aim is to transition from indecision on plant choices to a sustainable setup that can be easily maintained. This guidance underscores the importance of preparation and having the right resources to maximize gardening efforts as the weather warms up.",
            "link": "https://www.markets.news/headlines/81deb849-fa9e-471e-92c6-0fdf8372b5fc",
            "pub_date": "2026-02-27 02:09:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7d0dd04c-d543-4802-aa09-9a91566d4f22",
            "description": "Iranian TV: Iran demanded during the negotiations the lifting of sanctions and the cancellation of UN Security Council resolutions.",
            "link": "https://www.markets.news/headlines/7d0dd04c-d543-4802-aa09-9a91566d4f22",
            "pub_date": "2026-02-27 02:11:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "$1.1 million grant helps transform historic hotel in Brownsville, Texas into affordable housing apartments.",
            "id": "7780c14c-dc37-46e6-9a9f-bb51e96cf77f",
            "description": "In Brownsville, Texas, the Housing Authority of the City (HACB) marked the grand opening of El Jardin as a renewed affordable residential community downtown. This transformation was made possible with a $1.1 million grant from the Federal Home Loan Bank of Dallas (FHLB Dallas) through Texas Regional Bank. El Jardin, an establishment initially constructed in 1927 as a hotel and later abandoned in the late 1980s, has been revitalized to provide housing options for the community.",
            "link": "https://www.markets.news/headlines/7780c14c-dc37-46e6-9a9f-bb51e96cf77f",
            "pub_date": "2026-02-27 02:12:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Washington DC office mover acquires Baltimore's Hoffberger Moving Services and Re-form, expanding regional footprint.",
            "id": "7617a6c0-6a2d-475b-8039-bb9df5c0562c",
            "description": "A commercial moving company in the Washington DC region has recently acquired Hoffberger Moving Services and Re-form, becoming the only office mover in the area dedicated solely to commercial clients. This acquisition marks a significant expansion for the company, adding to its portfolio of clients and increasing its operational capacity. This move solidifies the company's position as a key player in the commercial moving industry in the region.",
            "link": "https://www.markets.news/headlines/7617a6c0-6a2d-475b-8039-bb9df5c0562c",
            "pub_date": "2026-02-27 02:12:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f82cb38f-1c04-40a3-9e73-7aff84eac937",
            "description": "The Araghchi-Witkoff meet was limited to A handshake AND courtesy - Tasnim.",
            "link": "https://www.markets.news/headlines/f82cb38f-1c04-40a3-9e73-7aff84eac937",
            "pub_date": "2026-02-27 02:13:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0a0ae690-df16-40aa-8e84-380c9dd3bf97",
            "description": "White House envoys Kushner and Witkoff were disappointed by what they heard from the Iranians in the morning negotiations session, per source with knowledge - axios reporter",
            "link": "https://www.markets.news/headlines/0a0ae690-df16-40aa-8e84-380c9dd3bf97",
            "pub_date": "2026-02-27 02:13:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Table Trac declares quarterly dividend of $0.02/share, payable on March 27, 2026, with record date on March 13, 2026.",
            "id": "bb820ed1-f8a2-4672-a8fa-065646af5ab9",
            "description": "Minnetonka-based Table Trac Inc. announced on February 26, 2026, that the company’s Board of Directors has given the green light for a cash dividend of $0.02 per share on its common stock (OTCQX: TBTC). Shareholders of record as of March 13, 2026, will receive the dividend on March 27, 2026.",
            "link": "https://www.markets.news/headlines/bb820ed1-f8a2-4672-a8fa-065646af5ab9",
            "pub_date": "2026-02-27 02:14:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eli Lilly's new oral weight loss drug outperforms Novo Nordisk's drug in a Phase 3 trial with 1,698 participants, eyeing US approval in Q2.",
            "id": "0607fd38-4447-445a-851f-204e8ff0a441",
            "description": "Shares of Eli Lilly and Co. (NYSE: LLY) experienced a decline on Thursday following the company's announcement of positive results for its oral GLP-1 medication, orforglipron. In the ACHIEVE-3 trial, the first head-to-head Phase 3 study comparing orforglipron with Novo Nordisk A/S' (NYSE: NVO) oral semaglutide in adults with type 2 diabetes inadequately managed with metformin, 1,698 participants were enrolled for the 52-week trial. The outcomes revealed that orforglipron surpassed oral semaglutide in primary and secondary endpoints, demonstrating notable enhancements in A1C levels and weight loss. In the most recent update, Eli Lilly disclosed that orforglipron 36 mg exhibited superior efficacy compared to oral semaglutide 14 mg in a Phase 3 trial, achieving a substantial 2.2% decrease in A1C levels.",
            "link": "https://www.markets.news/headlines/0607fd38-4447-445a-851f-204e8ff0a441",
            "pub_date": "2026-02-27 02:02:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}