{
    "data": [
        {
            "title": "",
            "id": "de539580-a612-4aed-a7c2-cbff3f086363",
            "description": "TRUMP TO MEET NEW YORK CITY MAYOR MAMDANI IN WASHINGTON ON THURSDAY -REPORTS",
            "link": "https://www.markets.news/headlines/de539580-a612-4aed-a7c2-cbff3f086363",
            "pub_date": "2026-02-27 01:11:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b624988b-9854-45cd-b331-6094e9803ea9",
            "description": "Air defense forces shot down 167 Ukrainian UAVs in six hours, including 12 flying toward Moscow- The Russian Ministry of Defense",
            "link": "https://www.markets.news/headlines/b624988b-9854-45cd-b331-6094e9803ea9",
            "pub_date": "2026-02-27 01:11:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Luxury home community Ascente by Toll Brothers coming to South Reno, NV with Platinum Heights Collection.",
            "id": "95e53175-ca2a-44fe-8930-2499c6c3b41e",
            "description": "The Platinum Heights Collection at Ascente by Toll Brothers presents breathtaking views and exceptional home designs.",
            "link": "https://www.markets.news/headlines/95e53175-ca2a-44fe-8930-2499c6c3b41e",
            "pub_date": "2026-02-27 01:11:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "78fd2b23-0534-43d8-9b74-af751b72123d",
            "description": "Trifork Group wraps up buyback program in December 2026.",
            "link": "https://www.markets.news/headlines/78fd2b23-0534-43d8-9b74-af751b72123d",
            "pub_date": "2026-02-27 01:12:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NRP Group starts upscale 353-unit community in Mesa's Medina Station, part of a 60-acre plan in Arizona.",
            "id": "5908aeda-fc8c-47a2-8bed-ac95377d5d8d",
            "description": "Phoenix-based company The NRP Group has recently secured financing and initiated construction on a new upscale multifamily development in Mesa, Arizona. The development will consist of 353 apartment units and will be located within the larger Medina Station master planned community spanning 60 acres. Situated on a 10-acre plot in the northeast section of the master plan, the four-story building will feature elevator access. The project aims to provide well-designed living spaces for families in the area.",
            "link": "https://www.markets.news/headlines/5908aeda-fc8c-47a2-8bed-ac95377d5d8d",
            "pub_date": "2026-02-27 01:12:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TKF Burnside Real Estate Partners buys White Plains office property.",
            "id": "df14fa10-44a2-40ef-a80e-f77500ec9d89",
            "description": "In a recent announcement, TKF Burnside Real Estate Partners revealed the acquisition of an office property in White Plains. The move signifies a significant investment in the area's real estate market. This acquisition adds to TKF Burnside's growing portfolio of properties. The specific details regarding the property's size, value, and future plans were not disclosed. This development underscores the company's commitment to expanding its presence in the real estate sector.",
            "link": "https://www.markets.news/headlines/df14fa10-44a2-40ef-a80e-f77500ec9d89",
            "pub_date": "2026-02-27 01:12:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New: U.S. mortgage rates dip below 6%, sparking debate on impact of rate drop amidst administration's housing changes.",
            "id": "d1d8e3fe-c109-47a9-a827-25f79cd00763",
            "description": "There is mixed evidence on whether reduced rates have significantly increased activity, as the Trump administration considers implementing measures aimed at increasing housing affordability.",
            "link": "https://www.markets.news/headlines/d1d8e3fe-c109-47a9-a827-25f79cd00763",
            "pub_date": "2026-02-27 01:13:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Franco and Pietro Gussalli Beretta receive WFSA Dr. Vito Genco Shooting Ambassador Award in Nuremberg, Germany.",
            "id": "848a7d93-bbe2-4d6c-9324-12afcb5a7e87",
            "description": "In Nuremberg, Germany, on February 26, 2026, the World Forum on Shooting Activities (WFSA) awarded the prestigious Dr. Vito Genco Shooting Ambassador Award to brothers Franco Gussalli Beretta and Pietro Gussalli Beretta. This honor recognizes their outstanding contributions to the shooting sports community. Franco Gussalli Beretta was specifically mentioned for his remarkable dedication to promoting shooting activities worldwide.",
            "link": "https://www.markets.news/headlines/848a7d93-bbe2-4d6c-9324-12afcb5a7e87",
            "pub_date": "2026-02-27 01:14:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bybit EU launches 3% APY campaign in EEA for better returns on digital assets in evolving markets.",
            "id": "dbfc8aa6-2460-4e70-b564-65792f9a4950",
            "description": "Bybit EU has recently launched a temporary campaign offering a 3% annual percentage yield (APY) in response to changing market conditions and increasing investor interest in managing digital asset exposure. This campaign is open to individuals in the European Economic Area (EEA) and aims to provide structured opportunities for capital growth.",
            "link": "https://www.markets.news/headlines/dbfc8aa6-2460-4e70-b564-65792f9a4950",
            "pub_date": "2026-02-27 01:14:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eight big cats rescued from Honduras arrived safely at US sanctuaries with DHL's help, marking Honduras' first international big cat rescue mission.",
            "id": "c1cf7475-5ff2-411e-a00a-41906c98c2af",
            "description": "A group of eight large felines from Honduras, whose ongoing care requirements were no longer being fulfilled, have been successfully transported to reputable sanctuaries in the United States. The operation, organized by DHL Global Forwarding and DHL Express, marked Honduras' initial international rescue mission for big cats, with constant veterinary care provided throughout. This initiative by DHL signifies their commitment to animal welfare and further efforts are underway to ensure the successful continuation of the mission.",
            "link": "https://www.markets.news/headlines/c1cf7475-5ff2-411e-a00a-41906c98c2af",
            "pub_date": "2026-02-27 01:08:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Circle Internet Group is compared to Tesla by analysts, receiving price target cuts to $160 and $130 while featuring 93% and 57% upside potentials, respectively. Earnings estimates raised and current estimates include Canaccord's 2026 EBITDA forecast of $618 million, up from $485 million. The company is down 72% from its post-IPO high of $299 but up from $49.90 low. The stablecoin issuer's growth is seen as justifying the comparison to Tesla due to its addressable market being the entire global money supply.",
            "id": "d6c587bd-c3d5-4af2-bd63-1e8de4b68dfa",
            "description": "Circle Internet Group (NYSE: CRCL) has received price target cuts to $160 and $130 from two firms, Canaccord and Needham, who still maintain Buy ratings on the stablecoin issuer. Canaccord reduced its target from $247, but raised its 2026 EBITDA forecast to $618 million from $485 million. Despite being down 72% from its post-IPO high of $299, CRCL is up from its low of $49.90. Both firms argue that the price target cuts are due to risk-off sentiment, not fundamental issues. Needham compared Circle to Tesla, calling it \"paradigm-shifting\" like dominant AI companies, as its addressable market is the global money supply. Needham's $130 target implies 57% upside, while Canaccord's $160 target implies 93% upside. Stablecoins are seen as programmable digital dollars competing with traditional currencies.",
            "link": "https://www.markets.news/headlines/d6c587bd-c3d5-4af2-bd63-1e8de4b68dfa",
            "pub_date": "2026-02-27 01:08:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8e244c16-967d-41e4-b09b-9cdbbef3c349",
            "description": "Volland SPX Dealer Premium This widget shows the total option premium dealers have collected from open positions. Net dealer premium stands at roughly $193.55B, indicating dealers are holding a significant amount of premium exposure overall. 0DTE premium is about $2.30B today,",
            "link": "https://www.markets.news/headlines/8e244c16-967d-41e4-b09b-9cdbbef3c349",
            "pub_date": "2026-02-27 01:08:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fc07a61c-e4fb-40ed-a2b9-1b76e0bfa035",
            "description": "META FILES MULTIPLE LAWSUITS AGAINST DECEPTIVE ADVERTISERS IN BRAZIL, CHINA, AND VIETNAM, TARGETING INDIVIDUALS AND COMPANIES IMPERSONATING CELEBRITIES AND BRANDS. LAWSUITS INCLUDE BRAZIL-BASED B&B SUPLEMENTOS E COSMÉTICOS LTDA, VITOR LOURENÇO DE SOUZA, MILENA LUCIANI SANCHEZ;",
            "link": "https://www.markets.news/headlines/fc07a61c-e4fb-40ed-a2b9-1b76e0bfa035",
            "pub_date": "2026-02-27 01:08:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7a8e95d2-7b33-4d41-a27d-ade54b3c5d41",
            "description": "Afghan govt says military captures 15 Pakistani outposts",
            "link": "https://www.markets.news/headlines/7a8e95d2-7b33-4d41-a27d-ade54b3c5d41",
            "pub_date": "2026-02-27 01:09:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BodyKore CEO launches Tomorrow's Legacy Initiative to support at-risk youth in SoCal with mentorship and job training.",
            "id": "1d5f3a04-43ba-41e8-8e39-71d762e13778",
            "description": "A prominent figure in the fitness sector leverages personal background to establish mentorship, skill development, and employment preparation initiatives for disadvantaged young individuals in Southern California. Situated in GARDEN GROVE, California, as of Feb. 26, 2026, this industry leader, now the CEO of BodyKore, a renowned global fitness gear company, has initiated programs catering to at-risk youth.",
            "link": "https://www.markets.news/headlines/1d5f3a04-43ba-41e8-8e39-71d762e13778",
            "pub_date": "2026-02-27 01:10:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dr. Adrienne O'Connell's SKINformed offers medical-grade skincare products, blending science and integrity for effective results.",
            "id": "2636cfb0-eb5a-4af5-a4e1-cfdc6deaa1af",
            "description": "In Laguna Beach, California, on February 26, 2026, SKINformed, a medical-grade skincare brand established by Dr. Adrienne O'Connell, is transforming contemporary skincare by blending clinical knowledge with pure, top-quality formulations. The brand aims to offer patients a revamped skincare experience based on the belief that they deserve the best.",
            "link": "https://www.markets.news/headlines/2636cfb0-eb5a-4af5-a4e1-cfdc6deaa1af",
            "pub_date": "2026-02-27 01:10:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Psilocybin compound achieves two positive Phase 3 results in treating depression - potential breakthrough in CNS disorders.",
            "id": "f876ce8a-ce85-4244-87e9-52464931e79e",
            "description": "Helus Pharma, based in Vancouver, BC, announced on February 26, 2026, the groundbreaking development that the first psilocybin compound has successfully obtained two positive Phase 3 results for treating treatment-resistant depression. This significant achievement could mark a transformative change in the approach to managing depression. This breakthrough holds the promise of offering a new treatment option for patients struggling with depression.",
            "link": "https://www.markets.news/headlines/f876ce8a-ce85-4244-87e9-52464931e79e",
            "pub_date": "2026-02-27 01:10:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shake Shack stock rose after Q4 earnings beat. EPS at 37 cents, sales at $400.531 million (+21.9% YoY), systemwide sales $618 million (+23.4%).",
            "id": "12c3125e-196e-4c3c-99f8-5ab0c294d3f9",
            "description": "Shake Shack, Inc. saw a rise in their shares following a positive earnings report, despite mixed revenue results. The company exceeded expectations with fourth-quarter adjusted earnings per share at 37 cents, beating the projected 35 cents. Quarterly sales totaled $400.531 million, up by 21.9% compared to the previous year, slightly missing the estimated $401.318 million. Systemwide sales also grew significantly to $618.0 million, a 23.4% increase from 2024. Same-Shack sales were up by 2.1% year-over-year. Investors were particularly interested in the company's continued restaurant expansion plans and improving profitability trends outlined for the upcoming year.",
            "link": "https://www.markets.news/headlines/12c3125e-196e-4c3c-99f8-5ab0c294d3f9",
            "pub_date": "2026-02-27 01:10:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shift4 Payments stock hits 52-week low after Q4 mixed results with 34% rise in gross revenue to $1.19B missing estimates. EPS at $1.60.",
            "id": "5cb0cf1a-cd47-4468-a438-d5d06ec72e45",
            "description": "Shares of Shift4 Payments Inc. (NYSE: FOUR) took a hit on Thursday following the release of its fourth-quarter results, which showed a mixed performance, along with a 2026 outlook that fell short of expectations. Quarterly gross revenue saw a 34% increase from last year, reaching $1.19 billion, slightly below the anticipated $1.20 billion forecasted by analysts. The company's adjusted earnings per share (EPS) came in at $1.60, missing the consensus estimate of $1.62. Payments-based revenue grew from $772 million to $919 million year-over-year, while subscription and other revenues rose to $145 million from $115 million in the previous year. Gross revenue, excluding network fees, also saw an improvement, reaching $610 million. For more details, please refer to the full article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/5cb0cf1a-cd47-4468-a438-d5d06ec72e45",
            "pub_date": "2026-02-27 01:10:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cupshe partners with Jessie James Decker for Casa del Sol collection, available in two parts.",
            "id": "9c345ce5-5134-46aa-bb67-3e474b7e4686",
            "description": "Cupshe, a leading global online fashion retailer, has introduced a new collection in partnership with Jessie James Decker, the renowned singer and entrepreneur behind Kittenish. The collaborative line, named Cupshe x Jessie James Decker: Casa del Sol, was unveiled on Feb. 26, 2026. This collection marks a unique fusion of styles, combining Decker's distinct aesthetic with Cupshe's trendy designs. The initial release of this exclusive collection is now available to customers, offering a range of fashion-forward pieces. The collaboration is expected to resonate well with consumers, given Decker's prominent status in the fashion industry.",
            "link": "https://www.markets.news/headlines/9c345ce5-5134-46aa-bb67-3e474b7e4686",
            "pub_date": "2026-02-27 01:01:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}