{
    "data": [
        {
            "title": "Hard Rock International & Coca-Cola launch 'Women Empower' series for International Women's Month with performances & offerings.",
            "id": "46465e1a-c2e0-4d22-825a-53dc1486c8b9",
            "description": "HOLLYWOOD, Florida - On February 26, 2026, Hard Rock International and Coca-Cola, established partners, are launching a 'Women Empower' content series to support women in music. This initiative will feature various activations in March, coinciding with Hard Rock's International Women's Month celebration. Stay tuned for updates, photos available.",
            "link": "https://www.markets.news/headlines/46465e1a-c2e0-4d22-825a-53dc1486c8b9",
            "pub_date": "2026-02-27 00:14:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d8fe8310-2fc8-47db-8ee3-25600748bcd1",
            "description": "Syria foreign ministry: 'The Minister of Foreign Affairs and Expatriates, Mr. As'ad Hassan al-Shibani, received a diplomatic delegation from the European Union in the capital, Damascus, led by Ms. Rosa Maria Gille, Director of the Middle East and North Africa Directorate at the",
            "link": "https://www.markets.news/headlines/d8fe8310-2fc8-47db-8ee3-25600748bcd1",
            "pub_date": "2026-02-27 00:14:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "cc96fede-3be8-4d91-b572-7043096e367c",
            "description": "HILLARY CLINTON TO TELL OVERSIGHT COMMITTEE MEMBERS THEY SHOULD ASK TRUMP UNDER OATH ABOUT EPSTEIN FILES",
            "link": "https://www.markets.news/headlines/cc96fede-3be8-4d91-b572-7043096e367c",
            "pub_date": "2026-02-27 00:15:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "22542b15-1ecb-42f8-90f0-f448d56c0b96",
            "description": "IRAN’S SUPREME LEADER ALI KHAMENEI HAD BANNED AMERICAN COMPANIES FROM ENTERING IRAN IN THE 2015 NUCLEAR DEAL BUT HAS NOW GRANTED PERMISSION, THE NEW YORK TIMES REPORTED CITING IRANIAN OFFICIALS",
            "link": "https://www.markets.news/headlines/22542b15-1ecb-42f8-90f0-f448d56c0b96",
            "pub_date": "2026-02-27 00:15:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Primary insider at Vow ASA buys 105,453 shares at 2.58 NOK per share, now holding 295,317 shares.",
            "id": "4ac9340a-829c-4857-be90-36bbea5ac9e8",
            "description": "Vow ASA announced on February 26, 2026, that Hamid Gorbani, VP Sales Maritime Solutions and a primary insider, bought 105,453 shares in Vow ASA at a price of 2.58 NOK per share. This transaction increased Gorbani's total shareholding in the company to 295,317 shares.",
            "link": "https://www.markets.news/headlines/4ac9340a-829c-4857-be90-36bbea5ac9e8",
            "pub_date": "2026-02-27 00:15:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sumvin launching AI-powered finance platform with Sei Network for sub-second settlement, raises $1M+ in funding.",
            "id": "086a0660-2fb3-4f77-8000-7dd4741b7813",
            "description": "A new company based in San Francisco, Sumvin, Inc., has announced its official launch with the objective of democratizing permissioned AI-driven money management. In order to build their permissioned financial execution infrastructure, the company has successfully raised over $1 million in pre-seed funding.",
            "link": "https://www.markets.news/headlines/086a0660-2fb3-4f77-8000-7dd4741b7813",
            "pub_date": "2026-02-27 00:16:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "F&M Bank named to Forbes 'America's Best Banks' list for 2026, highlighting fiscal health and client success.",
            "id": "f104e6d2-d0d7-4093-b076-878ffaaafb7a",
            "description": "F&M Bank's inclusion in Forbes' 'America's Best Banks' list for 2026 highlights the institution's strong financial stability and unwavering dedication to customer satisfaction. Based in Long Beach, California, Farmers & Merchants Bank received this recognition on February 26, 2026. This accomplishment showcases the bank's commitment to excellence in the industry.",
            "link": "https://www.markets.news/headlines/f104e6d2-d0d7-4093-b076-878ffaaafb7a",
            "pub_date": "2026-02-27 00:16:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b7c35162-c96f-43b9-bac6-42c3c23b87e0",
            "description": "HILLARY CLINTON: I DON'T RECALL EVER ENCOUNTERING EPSTEIN",
            "link": "https://www.markets.news/headlines/b7c35162-c96f-43b9-bac6-42c3c23b87e0",
            "pub_date": "2026-02-27 00:16:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "26705c1d-8125-4079-81d0-c3593d8bcc87",
            "description": "Fed bids for 4-week bills total $1.8 bln.",
            "link": "https://www.markets.news/headlines/26705c1d-8125-4079-81d0-c3593d8bcc87",
            "pub_date": "2026-02-27 00:16:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b58e9334-1f4c-41bf-ba4f-0fd27674de23",
            "description": "Uruguay becomes first country to ratify EU-South America trade deal",
            "link": "https://www.markets.news/headlines/b58e9334-1f4c-41bf-ba4f-0fd27674de23",
            "pub_date": "2026-02-27 00:16:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "543f2cb6-d1a6-41d4-a8d6-a1896b296c21",
            "description": "ProVen Growth & Income VCT plc report transaction with own shares, details undisclosed.",
            "link": "https://www.markets.news/headlines/543f2cb6-d1a6-41d4-a8d6-a1896b296c21",
            "pub_date": "2026-02-27 00:07:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Faye wins Logo Partner of the Year and top growth performance at SugarCRM 2026 Sales Kickoff. Leader in CRM with new clients and customer success.",
            "id": "1cb75cde-dcae-468b-b81d-be99b50f3261",
            "description": "Faye has solidified its status as a prominent player in the global CRM industry by winning prestigious awards for their exceptional performance in acquiring new clients and maintaining high levels of customer satisfaction within the SugarCRM network. The company based in CALABASAS, Calif. achieved this recognition on Feb. 26, 2026. Faye, known for its expertise in software solutions, has demonstrated strong capabilities in securing new clients and ensuring ongoing success for their customers, positioning themselves as a top performer within the industry.",
            "link": "https://www.markets.news/headlines/1cb75cde-dcae-468b-b81d-be99b50f3261",
            "pub_date": "2026-02-27 00:07:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Leggett & Platt declares $.05 quarterly dividend for Q1 2026, payable on April 15 to shareholders of record on March 13.",
            "id": "a918e8cf-a1f5-4487-8610-23d2ed90dd54",
            "description": "On February 26, 2026, in Carthage, Missouri, Leggett & Platt's Board of Directors announced a dividend of $0.05 per share for the first quarter of 2026. Shareholders of record on March 13, 2026, will receive the dividend on April 15, 2026. For further details, individuals can access Leggett's website.",
            "link": "https://www.markets.news/headlines/a918e8cf-a1f5-4487-8610-23d2ed90dd54",
            "pub_date": "2026-02-27 00:07:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "69fc7c68-f8d4-4d44-be23-5250dd4b33dc",
            "description": "ProVen VCT plc reports buyback of 50,000 ordinary shares at 77.00 pence per share. Total shares in issue now 46,389,930.",
            "link": "https://www.markets.news/headlines/69fc7c68-f8d4-4d44-be23-5250dd4b33dc",
            "pub_date": "2026-02-27 00:08:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3cf84a2a-31de-4f4b-baa7-62bea735acb5",
            "description": "GOOGLE: INTRODUCES NANO BANANA 2 HIGH-FIDELITY IMAGE GENERATION",
            "link": "https://www.markets.news/headlines/3cf84a2a-31de-4f4b-baa7-62bea735acb5",
            "pub_date": "2026-02-27 00:08:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Organ donations post heart stoppage increase, making transplants more common. Public education is crucial. NYC, 2/26/26.",
            "id": "94b29719-dfce-4add-a818-5bb6193f5f1e",
            "description": "With an increasing number of donors contributing to the pool, making more life-saving transplants viable, the significance of public awareness and education has never been more crucial. In New York on Feb. 26, 2026, it was reported that organ donation following the cessation of cardiac activity, known as donation after circulatory death, has transitioned from an infrequent occurrence to a standard practice. This shift highlights the progress in the field, emphasizing the importance of educating communities about the benefits of organ donation.",
            "link": "https://www.markets.news/headlines/94b29719-dfce-4add-a818-5bb6193f5f1e",
            "pub_date": "2026-02-27 00:09:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PointsBet Canada will contest proposed 5-day suspension by AGCO in Ontario, with a hearing request before Licence Appeal Tribunal.",
            "id": "62991336-fce2-429a-a622-ad2a6a0b5423",
            "description": "PointsBet Canada has officially announced its intention to appeal the Notice of Proposed Order issued by the Alcohol and Gaming Commission of Ontario (AGCO) on February 12, 2026. The AGCO proposed a five-day suspension amid regulatory concerns. PointsBet will seek a hearing before the independent Licence Appeal Tribunal in response to this development.",
            "link": "https://www.markets.news/headlines/62991336-fce2-429a-a622-ad2a6a0b5423",
            "pub_date": "2026-02-27 00:09:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Atlanta Technical College partners with Uwill to enhance mental health support for students.  expanding services statewide for numerous students.",
            "id": "89f853aa-e15a-4ec6-bfdf-67387a87d765",
            "description": "Atlanta Technical College has recently teamed up with Uwill, a prominent mental health and wellness provider for colleges and students. This partnership was disclosed today and marks the collaboration of ATC with a growing number of Georgia institutions engaging with Uwill. The endeavor aims to offer support to students in need. The announcement was made in Natick, Massachusetts on February 26, 2026.",
            "link": "https://www.markets.news/headlines/89f853aa-e15a-4ec6-bfdf-67387a87d765",
            "pub_date": "2026-02-27 00:09:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Demand on Flashfood for affordable meat and eggs surges amid rising grocery prices. Protein now accounts for over 30% of sales, with purchases of ground beef up by 28% from January 2025 to 2026.",
            "id": "9f9328ff-45e4-4764-aeef-6584a58108a5",
            "description": "In New York, a recent study by the affordable grocery app Flashfood highlights a concerning trend among Americans facing higher grocery costs and financial difficulties. The data shows a significant surge in the demand for budget-friendly fresh essentials such as beef and eggs, reflecting the widespread affordability challenges across the country. Currently, protein products account for over 30% of all transactions on the Flashfood app. A comparison between January 2025 and January 2026 reveals a notable 28% rise in purchases of ground beef through the platform. This data underscores the escalating affordability crisis affecting many households.",
            "link": "https://www.markets.news/headlines/9f9328ff-45e4-4764-aeef-6584a58108a5",
            "pub_date": "2026-02-27 00:10:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "354ae385-ca9b-4631-be09-a905dae3ac9f",
            "description": "EU’S ANTI-FRAUD AGENCY TO INVESTIGATE PETER MANDELSON - FT",
            "link": "https://www.markets.news/headlines/354ae385-ca9b-4631-be09-a905dae3ac9f",
            "pub_date": "2026-02-27 00:10:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}