{
    "data": [
        {
            "title": "",
            "id": "b95ad866-9141-46bd-9b5c-e1b48e8cd153",
            "description": "Utenos Trikotažas saw a rise in revenue and returned to profitability, with positive financial figures.",
            "link": "https://www.markets.news/headlines/b95ad866-9141-46bd-9b5c-e1b48e8cd153",
            "pub_date": "2026-02-28 04:16:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Alchemy now offers autonomous payment rails for AI agents on Base. AI can pay for data and compute credits in USDC as crypto apps grow.",
            "id": "03cf5e7c-fa6f-41c2-a7bf-1dca3f0a7ff4",
            "description": "A new system has been developed that allows AI agents to autonomously purchase blockchain data and computing credits using USDC. This advancement comes as self-governing crypto applications are becoming more popular.",
            "link": "https://www.markets.news/headlines/03cf5e7c-fa6f-41c2-a7bf-1dca3f0a7ff4",
            "pub_date": "2026-02-28 04:17:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1c205203-5dde-4e71-a408-1415b37849ff",
            "description": "Netflix: WBD terminates merger agreement with Netflix. PSKY pays $2.8 bln termination fee to Netflix - SEC Filing. $NFLX $PSKY",
            "link": "https://www.markets.news/headlines/1c205203-5dde-4e71-a408-1415b37849ff",
            "pub_date": "2026-02-28 04:18:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7e842ffb-133b-424c-94ca-9a0ca8fd4327",
            "description": "DELTA AIR LINES INC: EXERCISING OPTIONS FOR 34 ADDITIONAL AIRBUS A321NEO AIRCRAFT",
            "link": "https://www.markets.news/headlines/7e842ffb-133b-424c-94ca-9a0ca8fd4327",
            "pub_date": "2026-02-28 04:18:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Burnham Holdings' Crown Boiler Company subsidiary enters Chapter 11 bankruptcy to address legacy obligations.",
            "id": "67a89507-c58d-442b-b178-2360a9599332",
            "description": "Crown Boiler Company has initiated a voluntary Chapter 11 process in order to address past commitments, in line with Burnham Holdings' plan to optimize its portfolio and facilitate future expansion. The announcement was made in Lancaster, Pennsylvania on February 27, 2026. Burnham Holdings, Inc. (OTC-Pink: BURCA), the parent company, made this decision as part of its long-term growth strategy.",
            "link": "https://www.markets.news/headlines/67a89507-c58d-442b-b178-2360a9599332",
            "pub_date": "2026-02-28 04:11:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chicago Mayor Brandon Johnson discusses student success and human rights at Northeastern Illinois University on Feb 27, 2026.",
            "id": "de10112a-5e3b-4ec8-902a-5bbe3d722edb",
            "description": "On February 27, 2026, Brandon Johnson, the 57th mayor of Chicago, participated in a Lakeside Chat at Northeastern Illinois University (NEIU) to discuss civic leadership, human rights, and challenges encountered by college students. The visit aimed to address issues relevant to the community and encourage dialogue on important topics. The event attracted a significant audience and sparked thoughtful conversations on key issues affecting students and society.",
            "link": "https://www.markets.news/headlines/de10112a-5e3b-4ec8-902a-5bbe3d722edb",
            "pub_date": "2026-02-28 04:07:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4ecb0757-19bd-4fb3-adc0-7a84bd28af57",
            "description": "HEGSETH: ORDERING CANCELATION OF ALL DEFENSE DEPARTMENT ATTENDANCE AT IVY LEAGUE INSTITUTIONS STARTING ACADEMIC YEAR 2026-2027",
            "link": "https://www.markets.news/headlines/4ecb0757-19bd-4fb3-adc0-7a84bd28af57",
            "pub_date": "2026-02-28 04:09:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mitsubishi Logisnext Americas appoints Darr Equipment Co. as authorized dealer in Arizona, expanding their dealer network.",
            "id": "d4132f93-8187-4f10-829c-36c4f84edbd9",
            "description": "Mitsubishi Logisnext Americas, a prominent manufacturer and supplier of material handling, automation, and fleet solutions, has revealed plans for expanding its dealer network. The company recently appointed Darr Equipment Co. as part of this initiative. This move aims to enhance their reach and services in these sectors. Mitsubishi Logisnext Americas is recognized globally for its innovative solutions in material handling, automation, and fleet management.",
            "link": "https://www.markets.news/headlines/d4132f93-8187-4f10-829c-36c4f84edbd9",
            "pub_date": "2026-02-28 04:09:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "03c614fa-87f9-428d-b5de-257b35e4b1d4",
            "description": "ABBOTT’S NEXT‑GENERATION CARDIOMEMS™ REMOTE HEART FAILURE MONITORING READER RECEIVES FDA APPROVAL TO ENHANCE PATIENT EXPERIENCE AND HELP DETECT DISEASE PROGRESSION",
            "link": "https://www.markets.news/headlines/03c614fa-87f9-428d-b5de-257b35e4b1d4",
            "pub_date": "2026-02-28 04:10:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "60e0946e-ee68-4551-8ebc-d6476f88ec10",
            "description": "SOFTBANK’S PAYPAY SET FOR NASDAQ LISTING WITH QIA, VISA, ADIA BACKING: SOURCES PAYPAY U.S. IPO TO DRAW $200 MLN IN ANCHOR INVESTMENT: SOURCES PAYPAY TARGETS VALUATION OF UP TO $14 BILLION: SOURCES",
            "link": "https://www.markets.news/headlines/60e0946e-ee68-4551-8ebc-d6476f88ec10",
            "pub_date": "2026-02-28 03:58:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RevolutionEHR introduces RevPay, an embedded payments solution to enhance revenue collection in optometry practices.",
            "id": "eb90ef4e-c0cd-49d0-b049-d6b81ae4c8f6",
            "description": "In San Diego, RevolutionEHR, a top optometry-focused operating platform, unveiled RevPay, their new integrated payments solution. RevPay aims to streamline payment processes for practices, facilitating better revenue recovery. This innovative solution links payments directly to RevolutionEHR's AI-powered platform, merging checkout, patient records, engagement, and reporting into a cohesive workflow. By incorporating payments into the platform's intelligence engine, RevPay enhances efficiency and revenue generation for practices.",
            "link": "https://www.markets.news/headlines/eb90ef4e-c0cd-49d0-b049-d6b81ae4c8f6",
            "pub_date": "2026-02-28 04:02:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "07a51b74-86b0-4729-bff5-82cbd7c90833",
            "description": "When Arctic air freezes the Danube, trade across Central Europe slows — unless the icebreakers move in. Launched in 1959, Hungary’s first icebreaker is still clearing frozen shipping lanes in Budapest, helping keep nearly 100 million tons of cargo flowing along one of",
            "link": "https://www.markets.news/headlines/07a51b74-86b0-4729-bff5-82cbd7c90833",
            "pub_date": "2026-02-28 04:02:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI Claude Opus 3 'retired' by Anthropic, now has a blog to ponder its existence. Questions raised on AI identity and retirement process.",
            "id": "ba5790c5-2fb5-4530-aacf-1730619730a6",
            "description": "As questions continue to rise about identity and sentience in artificial intelligence, the Substack platform has introduced a new AI model. The launch comes at a time when concerns are escalating regarding the retirement of AI models. This development has sparked discussions about the ethical implications of AI technology.",
            "link": "https://www.markets.news/headlines/ba5790c5-2fb5-4530-aacf-1730619730a6",
            "pub_date": "2026-02-28 04:02:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "56828288-936d-42d8-a21b-eaaeb08389df",
            "description": "Volland SPX Spot-Vol Beta: 1.42 This gauge measures how much the VIX is reacting relative to the S&P 500’s price move. A reading of 1.42 suggests volatility is over-reacting, meaning options traders are aggressively pricing in protection compared to the actual index move. In",
            "link": "https://www.markets.news/headlines/56828288-936d-42d8-a21b-eaaeb08389df",
            "pub_date": "2026-02-28 04:03:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vuzix sets conference call for Q4 and full year 2025 financial results and business update on Feb 27, 2026.",
            "id": "f555dab0-32b4-4b09-b242-cd5c434c7df6",
            "description": "In Rochester, New York, on February 27, 2026, Vuzix® Corporation, listed on NASDAQ as VUZI, a prominent provider of smart glasses and Augmented Reality (AR) technology, plans to conduct a conference call discussing its fourth-quarter performance. This event marks an important step for the Company in sharing insights with investors and analysts.",
            "link": "https://www.markets.news/headlines/f555dab0-32b4-4b09-b242-cd5c434c7df6",
            "pub_date": "2026-02-28 04:03:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toni Collette headlines launch of The Healthy Aging Revolution campaign with leading experts and advocates to reshape longevity future.",
            "id": "4b0c42a5-10f1-40a0-a7eb-7dee697ba4c0",
            "description": "In a groundbreaking initiative launched on February 27, 2026, Mediaplanet unveiled The Healthy Aging Revolution campaign aiming to redefine the future of longevity in the United States. This national effort brings together top experts, advocates, and prominent brands to address the crucial issue. This initiative is featured in USA Today and online, reaching a wide audience. The campaign marks a significant step forward in promoting healthy aging and aims to engage the public in discussions surrounding longevity.",
            "link": "https://www.markets.news/headlines/4b0c42a5-10f1-40a0-a7eb-7dee697ba4c0",
            "pub_date": "2026-02-28 04:03:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DOJ seized $580M in crypto from Chinese criminals. $580M frozen by DC's Scam Center. US Attorney Pirro founded Strike Force.",
            "id": "9b50adc7-2209-41f0-a53b-f9038b8705b1",
            "description": "In the past three months, a total of seizures and freezing operations were carried out by the Scam Center Strike Force of the District of Columbia. The strike force was founded by US Attorney Jeanine Pirro in November and has been working to combat scams and fraudulent activities in the region.",
            "link": "https://www.markets.news/headlines/9b50adc7-2209-41f0-a53b-f9038b8705b1",
            "pub_date": "2026-02-28 03:52:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LeMaitre Vascular, Inc. (Nasdaq: LMAT) to attend 5 investor conferences in March.",
            "id": "8a7c61c0-c65a-41f5-820a-030e02028d75",
            "description": "On February 27, 2026, LeMaitre Vascular, Inc., listed on Nasdaq as LMAT, revealed plans to engage in five investor conferences in March. This initiative reflects the company's proactive approach to investor engagement and highlights a strong commitment to transparency. Such conferences offer a platform for stakeholders to interact directly with management, fostering a deeper understanding of the company's operations and strategic direction. By participating in these events, LeMaitre Vascular aims to enhance its investor relations and possibly attract potential investors looking to engage with a dynamic and forward-thinking organization.",
            "link": "https://www.markets.news/headlines/8a7c61c0-c65a-41f5-820a-030e02028d75",
            "pub_date": "2026-02-28 03:52:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TomoCredit offers 30-day plan to boost credit using tax refunds for 120 million Americans.",
            "id": "202bf7bc-4603-4755-a404-40d60b7c5858",
            "description": "In San Francisco on February 27, 2026, TomoCredit, an AI startup focused on creating a more inclusive credit framework, unveiled fresh financial advice aimed at being user-friendly for all, particularly the 120 million Americans managing credit without substantial histories.",
            "link": "https://www.markets.news/headlines/202bf7bc-4603-4755-a404-40d60b7c5858",
            "pub_date": "2026-02-28 03:55:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones drops on surprise inflation, Nvidia partner CoreWeave plunges on earnings. Live coverage by Investor's Business Daily.",
            "id": "9f63968e-04b1-482c-b1b2-7ecaf43cf99b",
            "description": "Today, the Dow Jones index experienced a decrease due to unexpected inflation data. CoreWeave, a partner of Nvidia, saw a significant drop in earnings. The market reaction was influenced by these events, with the Dow sinking and Nvidia shares declining following an agreement with OpenAI. The latest market movements can be followed through live coverage updates.",
            "link": "https://www.markets.news/headlines/9f63968e-04b1-482c-b1b2-7ecaf43cf99b",
            "pub_date": "2026-02-28 03:48:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}