{
    "data": [
        {
            "title": "Prime Drink Group appoints Germain Turpin as Interim President and CEO, replacing Alexandre Côté on Feb. 28, 2026.",
            "id": "54e9579f-ea38-44f1-9264-4957c3bb445c",
            "description": "On February 27, 2026, Prime Drink Group Corp. (CSE: PRME) welcomed Germain Turpin as the new Interim President and CEO. Germain takes over from Alexandre Côté, who will resign on February 28, 2026. Alexandre will continue on the Board of Directors and oversee special projects.",
            "link": "https://www.markets.news/headlines/54e9579f-ea38-44f1-9264-4957c3bb445c",
            "pub_date": "2026-02-28 06:16:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "50a1ede7-6179-4f61-a597-2bf3eb09ecc3",
            "description": "SPECIAL PRESIDENTIAL ENVOY FOR HOSTAGE AFFAIRS: HARSH PENALTIES WILL FOLLOW, UNTIL IRAN RELEASES WRONGFULLY DETAINED AMERICANS AND CHANGES ITS WAYS",
            "link": "https://www.markets.news/headlines/50a1ede7-6179-4f61-a597-2bf3eb09ecc3",
            "pub_date": "2026-02-28 06:17:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "cb51408c-219e-480e-b14d-801fb1283c3c",
            "description": "HEGSETH: EFFECTIVE IMMEDIATELY, NO CONTRACTOR, SUPPLIER, OR PARTNER THAT DOES BUSINESS WITH THE U.S. MILITARY MAY CONDUCT ANY COMMERCIAL ACTIVITY WITH ANTHROPIC",
            "link": "https://www.markets.news/headlines/cb51408c-219e-480e-b14d-801fb1283c3c",
            "pub_date": "2026-02-28 06:18:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "13333a3c-b00f-497b-8be3-b475a3bbb00f",
            "description": "TRUMP: I'M THINKING OF PUTTING TED CRUZ INTO THE SUPREME COURT",
            "link": "https://www.markets.news/headlines/13333a3c-b00f-497b-8be3-b475a3bbb00f",
            "pub_date": "2026-02-28 06:18:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SmartCentres REIT extends arrangements with Penguin Group, now extended to February 28, 2026 for finalization.",
            "id": "32f37f73-bf74-4bf4-aa3f-0c27bf13498a",
            "description": "In a recent update, the Board of Trustees of SmartCentres Real Estate Investment Trust announced developments regarding arrangements with Mitchell Goldhar, the Trust's Executive Chairman and CEO, and owner of Penguin Group of Companies. These arrangements, initially set to expire on February 28, 2026, are being extended for further deliberation. SmartCentres, trading as SRU.UN on the TSX, is taking the necessary time to finalize these agreements with Goldhar.",
            "link": "https://www.markets.news/headlines/32f37f73-bf74-4bf4-aa3f-0c27bf13498a",
            "pub_date": "2026-02-28 06:20:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Orca Energy Group Inc. halts legal action in Tanzania, according to latest announcement. #energy #Tanzania",
            "id": "1ac201ae-de1a-44ed-8ba0-7cfe18ef4aea",
            "description": "A new report reveals that the global population has reached 7.8 billion, with Asia being the most populous continent at 4.6 billion, followed by Africa at 1.3 billion. The report also indicates that the world's urban population has surpassed 4 billion for the first time, with over half living in urban areas. Additionally, the data shows that around 3.6 billion people lack access to proper sanitation facilities, posing significant health risks. The report emphasizes the pressing need for sustainable development to address these challenges.",
            "link": "https://www.markets.news/headlines/1ac201ae-de1a-44ed-8ba0-7cfe18ef4aea",
            "pub_date": "2026-02-28 06:22:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Edelson Lechtzin LLP investigates data breach of Pyramid Global Hospitality affecting individuals.",
            "id": "f170bb00-8464-4e14-8839-a8b59de38a36",
            "description": "On February 27, 2026, based in suburban Philadelphia, the national class action law firm Edelson Lechtzin LLP announced its investigation into data privacy claims against Pyramid Advisors Limited Partnership, also known as Pyramid Global Hospitality. The firm is looking into a breach that Pyramid Global Hospitality recently discovered involving the compromised data of a large number of individuals.",
            "link": "https://www.markets.news/headlines/f170bb00-8464-4e14-8839-a8b59de38a36",
            "pub_date": "2026-02-28 06:12:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump instructs federal agencies to remove 'woke' Anthropic AI in 6 months after Pentagon disagreement.",
            "id": "c148a1f0-29cc-4562-8ebf-08721443c8d7",
            "description": "In response to disagreements over military security measures, President Trump has ordered all government agencies to discontinue the use of Anthropic's products within a six-month period. This decision impacts numerous agencies at the federal level and involves transitioning away from Anthropic's offerings within the specified time frame.",
            "link": "https://www.markets.news/headlines/c148a1f0-29cc-4562-8ebf-08721443c8d7",
            "pub_date": "2026-02-28 06:13:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SOL down 72% from peak, but data suggests undervaluation. Is SOL trading at a steep discount?",
            "id": "9515c3a2-8271-4669-9c4e-916db8360830",
            "description": "The cryptocurrency SOL has experienced a significant decrease of 72% from its peak value. Despite this drop, various indicators suggest an attractive opportunity for investment. The question arises whether SOL is currently being traded at a substantial markdown.",
            "link": "https://www.markets.news/headlines/9515c3a2-8271-4669-9c4e-916db8360830",
            "pub_date": "2026-02-28 06:06:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nephrology Associates in Riverside, CA reports data breach impacting patients' health information on Dec 2, 2025.",
            "id": "5bed7d0d-73b2-473f-9c34-21667aac8b4e",
            "description": "In Riverside, California, Nephrology Associates Medical Group (Nephrology Associates) announced on February 27, 2026, that they discovered on December 2, 2025, a data security breach exposing the protected health information of specific patients. The number of individuals affected by this incident is currently undisclosed. Nephrology Associates is taking steps to notify those impacted and address the situation promptly.",
            "link": "https://www.markets.news/headlines/5bed7d0d-73b2-473f-9c34-21667aac8b4e",
            "pub_date": "2026-02-28 06:07:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Taiga Building Products Ltd. reports fiscal 2025 results with $29.4M decline in sales, $9.1M net loss in Q4, and $2.6M decrease in yearly sales.",
            "id": "23fd25cc-5fbd-472e-bdff-87b323ca5525",
            "description": "Taiga Building Products Ltd. reported its financial results for the year ended December 31, 2025. In the fourth quarter of 2025, the company's net sales were $359.6 million, down 8% from the previous year, largely due to lower lumber prices and sales volume. Gross margin increased to $41.4 million, with a rise in percentage to 11.5%. However, net earnings incurred a loss of $9.1 million, compared to a profit of $6.6 million, due to a $20.5 million write-off of goodwill in its U.S. subsidiary. For the full year of 2025, net sales were $1,631.8 million, down 0.2%, with a gross margin of $176.4 million. Net earnings decreased to $28.6 million from $47.6 million, primarily due to the U.S. subsidiary impairment. EBITDA for the year was $56.7 million. This decline was reflected in sales data for both the fourth quarter and the entire year. Management remains optimistic about the subsidiary's long-term potential despite the current market conditions.",
            "link": "https://www.markets.news/headlines/23fd25cc-5fbd-472e-bdff-87b323ca5525",
            "pub_date": "2026-02-28 06:09:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump Media & Tech Group (NASDAQ: DJT) had $2.5B in financial assets, positive operating cash flow of $14.8M, $44M from options strategy for 2025. CEO Nunes highlights growth strategies & diversification, closed 2025 with $712.3M net loss. About $3.7M revenue for the year. Company aiming to grow and position itself as a leader in the America First economy moving forward.",
            "id": "f7063f90-0a0e-48cb-a6ad-a25149131219",
            "description": "Trump Media and Technology Group Corp. reported financial results for 2025, revealing $2.5 billion in financial assets, a significant increase from $776.8 million in 2024. Positive operating cash flow of $14.8 million was achieved in 2025, with $44 million earned through a covered-put options strategy. The company's CEO, Devin Nunes, highlighted the successful expansion and diversification, focusing on mergers and acquisitions, new product launches, and financial product growth. Despite a $712.3 million net loss, primarily from unrealized losses related to digital assets, the company remains optimistic about future growth and shareholder value. Trump Media operates Truth Social, Truth+ streaming service, and Truth.Fi financial brand.",
            "link": "https://www.markets.news/headlines/f7063f90-0a0e-48cb-a6ad-a25149131219",
            "pub_date": "2026-02-28 06:09:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Site Centers just sold FlatAcres MarketCenter.",
            "id": "18c37147-ba5c-4b19-b943-1e7ec7225e4e",
            "description": "In recent developments, it has been reported that the unemployment rate in the country has reached a record high of 15%. This surge in unemployment has resulted in over 10 million people losing their jobs in the past month alone. Additionally, the stock market has experienced a significant downturn, with the main index dropping by 20% in the last week. These economic challenges have raised concerns among policymakers and experts, who are now working to implement measures to stabilize the economy and support those affected by the current crisis.",
            "link": "https://www.markets.news/headlines/18c37147-ba5c-4b19-b943-1e7ec7225e4e",
            "pub_date": "2026-02-28 06:09:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sturm, Ruger & Co., Inc. (NYSE: RGR) will report Q4 and YE 2025 financial results on March 2, 2026, with a webcast at 4:30 p.m. ET.",
            "id": "eaf9d4cf-6822-4482-acb7-ddad600b53a4",
            "description": "Mayodan, North Carolina - Sturm, Ruger & Company, Inc. (NYSE: RGR) is set to disclose its financial performance for the fourth quarter and full year of 2025, as well as submit its Annual Report on Form 10-K on Monday, March 2, 2026, post the market closure. To delve into the details of the fourth quarter and annual 2025 operating outcomes, Sturm, Ruger will conduct a webcast at 4:30 p.m. ET on the same day. Interested individuals can tune in to the webcast through the provided link or by navigating to Ruger.com/corporate.",
            "link": "https://www.markets.news/headlines/eaf9d4cf-6822-4482-acb7-ddad600b53a4",
            "pub_date": "2026-02-28 06:09:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flagstar Bank's 2026 Annual Shareholders Meeting set for June 9th, to be held virtually.",
            "id": "8f8f29e1-a457-4dbf-9639-094db2b12c31",
            "description": "Flagstar Bank, N.A. (NYSE: FLG) based in Hicksville, NY, has scheduled its 2026 Annual Meeting of Shareholders for June 9th. The meeting, to be conducted virtually through a live webcast, is a significant event for the bank's stakeholders.",
            "link": "https://www.markets.news/headlines/8f8f29e1-a457-4dbf-9639-094db2b12c31",
            "pub_date": "2026-02-28 06:10:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "07c95b5f-8316-43a0-a0df-56d5d3efaa11",
            "description": "2025 year-end report released for January to December period.",
            "link": "https://www.markets.news/headlines/07c95b5f-8316-43a0-a0df-56d5d3efaa11",
            "pub_date": "2026-02-28 06:01:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Refined Energy Corp extends marketing program with RMK Marketing for another 90 days starting March 2, 2026.",
            "id": "83c9177a-e1b3-4336-b5bb-c5941b452dfd",
            "description": "Refined Energy Corp., publicly traded under CSE: RUU, OTC: RRUUF, and FRA: CWA0, has extended its contract with RMK Marketing Inc. based in Mississauga, Ontario, for marketing services. The company first announced this extension on February 27, 2026. The engagement, initially set to take place for 90 days starting around March 2, 2026, follows a series of previous press releases by Refined on October 31, 2025, December 12, 2025, January 2, 2026, and January 15, 2026. Management and the board of directors retain the flexibility to adjust the duration based on the effectiveness of the marketing campaign.",
            "link": "https://www.markets.news/headlines/83c9177a-e1b3-4336-b5bb-c5941b452dfd",
            "pub_date": "2026-02-28 06:01:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apogee Minerals Ltd. (TSXV: APMI) announces resignation of directors Jordan Trimble and Nick Findler to focus on other commitments.",
            "id": "bde6b97b-05cf-4d8a-9cc6-c9720d0a6942",
            "description": "In Vancouver, British Columbia, on February 27, 2026, Apogee Minerals Ltd. disclosed that Mr. Jordan Trimble and Mr. Nick Findler have stepped down from the Board of Directors of the Company. This change, effective immediately, was made to enable both individuals to concentrate on their other work obligations. Apogee Minerals Ltd., listed as APMI on the TSX Venture Exchange, revealed this significant development to the public.",
            "link": "https://www.markets.news/headlines/bde6b97b-05cf-4d8a-9cc6-c9720d0a6942",
            "pub_date": "2026-02-28 06:01:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LGI Homes opens new Meadow Brook location, expanding in Seattle area.",
            "id": "f7cb2096-5962-401b-896a-6a0fcd5d9915",
            "description": "In the latest report, it was disclosed that the unemployment rate in the country has significantly dropped to 4.2%, the lowest it has been in the past decade. This positive trend is attributed to the creation of over 350,000 new jobs in various sectors. Additionally, the GDP has shown a growth of 6.5% in the last quarter, surpassing previous expectations. The stock market also experienced a notable increase, with the main index rising by 8% in the past month. Overall, the economic indicators are pointing towards a strong recovery and expansion.",
            "link": "https://www.markets.news/headlines/f7cb2096-5962-401b-896a-6a0fcd5d9915",
            "pub_date": "2026-02-28 06:01:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investors move away from tech, finance, and consumer discretionary stocks, favoring materials, energy, consumer staples, and utilities in February, leading Dow Jones.",
            "id": "59d74bff-21da-4341-9a82-659d9310f8c8",
            "description": "Investors are moving away from struggling sectors like technology, finance, and consumer discretionary this year. Instead, they are turning to a mix of economically sensitive areas like materials and energy, as well as consumer staples and utilities. These sectors are leading the Dow Jones in February, outperforming AI companies.",
            "link": "https://www.markets.news/headlines/59d74bff-21da-4341-9a82-659d9310f8c8",
            "pub_date": "2026-02-28 06:03:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}