{
    "data": [
        {
            "title": "RLJ Lodging Trust reports Q4 2025 results: RevPAR $136.79 (-1.5%), Hotel Revenue $325.1M (+0.2%), Net Income $0.5M, EBITDA $80.4M. Sold 2 hotels for $49.5M.",
            "id": "b33c4e8d-4658-44c2-83bd-781de81703bb",
            "description": "RLJ Lodging Trust (NYSE: RLJ) based in Bethesda, Md. announced its financial results for the fourth quarter and full year ending December 31, 2025. The highlights for the fourth quarter include a Comparable RevPAR of $136.79, showing a 1.5% decrease from the previous year, and Comparable Hotel Revenue of $325.1 million, marking a 0.2% increase from the prior year. The company reported a Net Income of $0.5 million and an Adjusted EBITDA of $80.4 million. Additionally, it achieved an Adjusted FFO per diluted common share and unit of $0.32. RLJ Lodging Trust also successfully sold two hotels for a total of $49.5 million during this period.",
            "link": "https://www.markets.news/headlines/b33c4e8d-4658-44c2-83bd-781de81703bb",
            "pub_date": "2026-02-27 05:53:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wesco International (NYSE: WCC) declares $0.50 per share quarterly dividend on common stock on Feb. 26, 2026.",
            "id": "17291649-f768-4e2f-9024-f08aba9292a4",
            "description": "On February 26, 2026, Wesco International's Board of Directors announced a quarterly cash dividend for its shareholders. The declared dividend on all outstanding common stock is $0.50 per share. Shareholders can expect to receive this dividend on March 31, 2026.",
            "link": "https://www.markets.news/headlines/17291649-f768-4e2f-9024-f08aba9292a4",
            "pub_date": "2026-02-27 05:46:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "XTKG to consolidate shares, board approved decision. Global tech provider across industries.",
            "id": "48d6b6bb-18d6-400a-903a-522c060acbb0",
            "description": "In Singapore on February 26, 2026, X3 Holdings Co., Ltd. (Nasdaq: XTKG) revealed plans for a consolidation of its Class A ordinary shares. As a leading global provider of digital solutions and technology services across various industries, XTKG's board of directors gave the green light for this strategic move. This decision underscores the company's commitment to refining its corporate structure.",
            "link": "https://www.markets.news/headlines/48d6b6bb-18d6-400a-903a-522c060acbb0",
            "pub_date": "2026-02-27 05:46:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ready Capital Corp reports Q4 2025 GAAP loss per share of $(1.46) and distributable loss per share before realized losses of $(0.09). LMM commercial real estate originations at $235M. Total originations for year at $1.8B. Distributable loss before realized losses on investments $(0.09) per common share. Total assets at $7.77B and total liabilities at $6.12B. Full story on Benzinga.com.",
            "id": "3ec4e822-002d-42ae-914e-4aea74599beb",
            "description": "Ready Capital Corporation reported a GAAP loss per common share of $(1.46) and a distributable loss per common share of $(0.43) for Q4 2025. LMM commercial real estate originations totaled $235 million, with Small Business Lending loans at $140 million. Book value per common stock was $8.79 as of Dec 31, 2025. Full-year total originations were $1.8 billion, including the acquisition of UDF IV and the sale of GMFS. The company retired the remaining 5.75% Senior Unsecured Note due Feb 2026. Net loss for Q4 was $232.6 million and $221.1 million for the full year. The company's website has additional information. Total assets stood at $7.77 billion, with liabilities at $6.12 billion. Preferred stock Series C was at $8.36 million, and Series E at $111.37 million, with common stock at $17. Additional paid-in capital was $2.26 billion. For more details, visit the Benzinga website.",
            "link": "https://www.markets.news/headlines/3ec4e822-002d-42ae-914e-4aea74599beb",
            "pub_date": "2026-02-27 05:46:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave Inc (CRWV) reports mixed Q4 earnings: revenue $1.57B, over $66.8B backlog, doubling YOY. Stock down despite hypergrowth signal.",
            "id": "f164a841-e8b9-4490-ac63-2b662f269aea",
            "description": "CoreWeave Inc (NASDAQ: CRWV) released its Q4 financial results, surpassing analyst estimates with $1.57 billion in revenue, a significant increase from the previous year. The company, offering Nvidia GPUs to tech and AI firms, reported a revenue backlog of $66.8 billion at the end of the quarter. Despite this, it also reported a Q4 adjusted loss. The news has caused CRWV shares to trend, prompting questions about their future trajectory. This information, along with additional details, can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/f164a841-e8b9-4490-ac63-2b662f269aea",
            "pub_date": "2026-02-27 05:46:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Monkee's Franchising, LLC opens new boutique - Monkee's of Kiawah, owned by Debbie Creasy. Elevates style and service in Kiawah Island community.",
            "id": "6161f1ee-6e50-4095-a00b-012eb0aacf3a",
            "description": "Monkee's Franchising, LLC has recently unveiled its latest store, Monkee's of Kiawah, situated in Kiawah Island, S.C. Owned by Debbie Creasy, this boutique offers a meticulously curated shopping experience for the local community. The opening took place on February 26, 2026, marking an exciting addition to the area. This new location is set to provide residents and visitors with a unique and diverse shopping destination on Kiawah Island.",
            "link": "https://www.markets.news/headlines/6161f1ee-6e50-4095-a00b-012eb0aacf3a",
            "pub_date": "2026-02-27 05:48:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Globe Life Inc. (NYSE: GL) raises quarterly dividend to $0.33 per share and appoints two new board members.",
            "id": "fb8fcfb7-1e7f-45c4-bb6e-0fa69cfc9c8d",
            "description": "In McKinney, Texas, on February 26, 2026, Globe Life Inc. (NYSE: GL) disclosed that their Board of Directors approved an increase in the quarterly dividend to $0.3300 per share. This dividend applies to all outstanding common stock held by shareholders as of the company's transfer record deadline.",
            "link": "https://www.markets.news/headlines/fb8fcfb7-1e7f-45c4-bb6e-0fa69cfc9c8d",
            "pub_date": "2026-02-27 05:48:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Steel City Hoops is Pittsburgh's digital media organization covering high school basketball, providing latest matchups and scores.",
            "id": "43b19cda-0eea-449d-ac7c-3f6edbbf7bae",
            "description": "In Pittsburgh on February 26, 2026, a new venture has emerged for high school basketball enthusiasts. Steel City Hoops is paving the way as the city's premier digital media outlet focused on high school basketball. This innovative platform is dedicated to bringing the most up-to-date coverage of the sport, including detailed insights on matchups, live scores, and highlights from top games. This initiative marks a significant step forward in amplifying the local high school basketball scene, catering to the growing fan base with exclusive content.",
            "link": "https://www.markets.news/headlines/43b19cda-0eea-449d-ac7c-3f6edbbf7bae",
            "pub_date": "2026-02-27 05:48:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fidium's 100% fiber-to-the-home network earns over 250 top performance rankings in Ookla® Speedtest® Research across 10 states.",
            "id": "4dfd7fa3-a7db-49d7-9ef2-c774dc5162a7",
            "description": "Fidium, a company based in The Woodlands, Texas, revealed that their fiber-to-the-home network received over 250 top performance rankings in Ookla's analysis of Q3-Q4 2025 Speedtest Intelligence® data. These rankings were based on consumer-initiated tests conducted across 10 states. The data emphasized Fidium's superior performance in key metrics such as download speed, upload speed, and latency. Compared to cable and fixed-wireless providers, Fidium demonstrated exceptional performance in regions including New England, Texas, Illinois, Minnesota, and California.",
            "link": "https://www.markets.news/headlines/4dfd7fa3-a7db-49d7-9ef2-c774dc5162a7",
            "pub_date": "2026-02-27 05:49:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c4e411f7-a8af-4cea-a0b3-2e07d85906fc",
            "description": "Afghanistan spox: ‘Press Release from the Ministry of National Defense of the Islamic Emirate of Afghanistan regarding the outcomes of tonight's retaliatory operations: As a few days ago, the Pakistani military establishment brazenly violated the sovereignty of Afghanistan,",
            "link": "https://www.markets.news/headlines/c4e411f7-a8af-4cea-a0b3-2e07d85906fc",
            "pub_date": "2026-02-27 05:50:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ritchie Bros. sells $265+ million at Orlando auction, with 14,500 items sold and 19,500 participants.",
            "id": "19ce6f1e-eeea-47e8-9312-e13248602d24",
            "description": "RB Global, Inc. revealed that Ritchie Bros. Auctioneers achieved a gross transaction value of over $265 million at its recent premier global auction in Orlando, FL. The auction, which took place from Feb. 16-20, saw the sale of over 14,500 equipment items, trucks, and vehicles. With over 19,500 participants in attendance, the five-day event was a major success for the company.",
            "link": "https://www.markets.news/headlines/19ce6f1e-eeea-47e8-9312-e13248602d24",
            "pub_date": "2026-02-27 05:50:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a1873a3f-8ef8-438c-87d5-1aea286394b6",
            "description": "PARAMOUNT SKYDANCE CORP: BANK OF AMERICA MERRILL LYNCH, CITI AND APOLLO PROVIDING $57.5B DEBT COMMITMENT FOR DEAL",
            "link": "https://www.markets.news/headlines/a1873a3f-8ef8-438c-87d5-1aea286394b6",
            "pub_date": "2026-02-27 05:38:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Orion S.A. (NYSE: OEC) declares $0.0207 per share dividend for Q2 2026, totaling $1.2 million; payment on April 2.",
            "id": "5dcb4300-de49-4ca3-93f4-456f894def9b",
            "description": "Orion S.A. (NYSE: OEC), a specialty chemicals company based in Houston, has declared an interim dividend for the second quarter of 2026. The dividend of $0.0207 per common share amounts to a total of approximately $1.2 million based on the current outstanding shares. Shareholders of record as of the closing of business in New York will receive the dividend on April 2, 2026.",
            "link": "https://www.markets.news/headlines/5dcb4300-de49-4ca3-93f4-456f894def9b",
            "pub_date": "2026-02-27 05:39:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Floor & Decor opens 2 new stores in NC and CA, creating over 90 new jobs, supporting expansion.",
            "id": "c5c92ef1-ced6-4d2a-8a55-86e500d9606f",
            "description": "Atlanta-based company Floor & Decor (NYSE: FND) has unveiled new warehouse-format stores and design centers in Fayetteville, North Carolina, and Vacaville, California. These openings are part of the company's expansion strategy and are expected to create over 90 new jobs in the two areas. The initiative reflects Floor & Decor's commitment to providing quality hard-surface flooring options for homeowners and professionals. The introduction of these new locations aligns with the company's mission to make its products and services more accessible to a wider audience.",
            "link": "https://www.markets.news/headlines/c5c92ef1-ced6-4d2a-8a55-86e500d9606f",
            "pub_date": "2026-02-27 05:40:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Betterware de Mexico SAPI (NYSE: BWMX) Q4 earnings missed estimates by -32.73%, with EPS $0.37 vs. $0.55. Revenue increased by $20.68 million.",
            "id": "41201127-2ea3-43f4-8dc3-990db1ebb93f",
            "description": "Betterware de Mexico SAPI (NYSE: BWMX) disclosed its Q4 earnings report on February 26, 2026, at 04:15 PM. The report revealed that the company fell short of estimated earnings by -32.73%, with an EPS of $0.37 instead of the anticipated $0.55. Despite this, revenue saw a $20.68 million increase compared to the previous period. Investors can find more details on this update at Benzinga.com.",
            "link": "https://www.markets.news/headlines/41201127-2ea3-43f4-8dc3-990db1ebb93f",
            "pub_date": "2026-02-27 05:40:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block Inc. plans to cut nearly 50% of its workforce and reported 65 cents per share earnings, missing revenue estimates.",
            "id": "29be53c1-c5d3-4aef-a055-870ee3eda549",
            "description": "Shares of Block Inc. (NYSE: XYZ) surged in after-hours trading following the release of its fourth-quarter earnings report, which revealed quarterly earnings of 65 cents per share, meeting analysts' expectations. However, quarterly revenue fell slightly short at $6.25 billion compared to the estimated $6.28 billion. In response, Block announced a significant headcount reduction of over 40%. The company expressed the challenges faced, leading to the difficult decision to cut nearly half of its workforce. For more, visit Benzinga.com for the complete story.",
            "link": "https://www.markets.news/headlines/29be53c1-c5d3-4aef-a055-870ee3eda549",
            "pub_date": "2026-02-27 05:40:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chemours to issue $700M of 7.875% Senior Notes Due 2034, up from initial amount.",
            "id": "e380723e-b374-40bf-a348-229992cbc273",
            "description": "In Wilmington, Delaware on February 26, 2026, the Chemours Company (Chemours) (NYSE: CC) disclosed the pricing details of its private offering of $700,000,000 principal amount of new 7.875% senior notes due in 2034 (referred to as the \"Notes\"). It was stated that the offering size had been raised...",
            "link": "https://www.markets.news/headlines/e380723e-b374-40bf-a348-229992cbc273",
            "pub_date": "2026-02-27 05:40:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RealReal (NASDAQ: REAL) beat earnings estimates by 200% in Q4, with EPS at $0.06 vs. $0.02 estimate. Revenue up $30.06 million from previous year.",
            "id": "b660253b-f785-4c91-8c4d-9b2d2e4f907d",
            "description": "RealReal (NASDAQ: REAL) released their Q4 earnings on Thursday, February 26, 2026, at 04:10 PM. They exceeded estimated earnings by 200%, with an EPS of $0.06 compared to the expected $0.02. Revenue saw a significant increase, going up by $30.06 million from the previous year. In the previous quarter... (the complete report can be found on Benzinga.com)",
            "link": "https://www.markets.news/headlines/b660253b-f785-4c91-8c4d-9b2d2e4f907d",
            "pub_date": "2026-02-27 05:40:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Expert Mariah Tritz discusses how integrative care accelerates recovery in Thornton, CO; featured in a HelloNation article.",
            "id": "ebe19778-640e-4015-9a66-023344bfb86b",
            "description": "In a recent article by HelloNation, Mariah Tritz from Intrepid Bodyworks in Thornton, Colorado discusses how integrative care can accelerate recovery for individuals managing pain, injury, or post-surgery healing. This approach is gaining attention for its effectiveness in improving rehabilitation outcomes.",
            "link": "https://www.markets.news/headlines/ebe19778-640e-4015-9a66-023344bfb86b",
            "pub_date": "2026-02-27 05:40:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MARA Holdings (NASDAQ: MARA) missed Q4 earnings estimates by -4009.09%, reporting EPS of $-4.52 vs. estimated $-0.11. Revenue down $12.09M.",
            "id": "953488e8-341f-47f6-8a3f-36d9663fdc3f",
            "description": "MARA Holdings (NASDAQ: MARA) released its Q4 earnings on Thursday, February 26, 2026. The company reported an EPS of $-4.52, missing estimated earnings by -4009.09% compared to the expected $-0.11. Revenue showed a decrease of $12.09 million from the previous year. In the previous quarter, MARA Holdings had exceeded expectations. For the full story, visit a financial news website.",
            "link": "https://www.markets.news/headlines/953488e8-341f-47f6-8a3f-36d9663fdc3f",
            "pub_date": "2026-02-27 05:40:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}