{
    "data": [
        {
            "title": "Pentagon faces pivotal moment as standoff with Anthropic over AI contract raises questions on AI use in national security.",
            "id": "eefdfd7a-7352-469a-9666-8b74af93fff1",
            "description": "A disagreement between the Pentagon and Anthropic regarding a contract is emblematic of a larger debate on the integration of artificial intelligence in national security, along with determining the responsible party for establishing safety measures.",
            "link": "https://www.markets.news/headlines/eefdfd7a-7352-469a-9666-8b74af93fff1",
            "pub_date": "2026-02-28 01:26:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0bc746f9-5cc9-404a-aa8f-9a21bf9a6e57",
            "description": "OpenAI expects to raise about $10b more from investors by March.",
            "link": "https://www.markets.news/headlines/0bc746f9-5cc9-404a-aa8f-9a21bf9a6e57",
            "pub_date": "2026-02-28 01:27:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7666ba43-ebf0-4fa7-a574-4ea530d63485",
            "description": "Amazon's $50 billion OpenAI investment is in cash. $AMZN",
            "link": "https://www.markets.news/headlines/7666ba43-ebf0-4fa7-a574-4ea530d63485",
            "pub_date": "2026-02-28 01:27:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2ca7a784-35ab-4d82-b63d-2f5266879cc6",
            "description": "Lawmakers seek a Binance probe over illicit finance risks.",
            "link": "https://www.markets.news/headlines/2ca7a784-35ab-4d82-b63d-2f5266879cc6",
            "pub_date": "2026-02-28 01:28:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Great American Media CEO Bill Abbott partners with NRB President Troy Miller to reclaim American family values. Reaching 50M homes, plans to expand with new original content by 2026.",
            "id": "fe2c392e-d9c3-48da-a0e8-353bdac2d645",
            "description": "Bill Abbott has articulated a strong vision to center faith, family, and country as key values in American entertainment. Great American Media celebrates its fifth year of expansion, now broadcasting to 50 million households via both linear TV and streaming services. The company's 2026 lineup will feature fresh original content to continue its growth trajectory.",
            "link": "https://www.markets.news/headlines/fe2c392e-d9c3-48da-a0e8-353bdac2d645",
            "pub_date": "2026-02-28 01:29:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ORYZON Genomics reported financial results for the year ended Dec 31, 2025 and provided corporate update.",
            "id": "e679a553-25e2-444e-8597-f5153c8b7a4a",
            "description": "On February 27, 2026, Oryzon Genomics, S.A., a leading biopharmaceutical company specializing in epigenetics, shared financial outcomes for the twelve months concluding on December 31, 2025. Headquartered in Madrid and Cambridge, Mass., the company (ISIN Code: ES0167733015, ORY) disclosed its latest financial performance and offered insights into recent corporate advancements.",
            "link": "https://www.markets.news/headlines/e679a553-25e2-444e-8597-f5153c8b7a4a",
            "pub_date": "2026-02-28 01:30:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "49fdb928-24ed-485b-9b43-371beb18ff5c",
            "description": "Trump Administration Delivers Latest DHS Funding Offer – POLITICO",
            "link": "https://www.markets.news/headlines/49fdb928-24ed-485b-9b43-371beb18ff5c",
            "pub_date": "2026-02-28 01:17:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "47ea94b9-ea78-49ee-aa84-1ffccc513f50",
            "description": "EU's Costa: 'It was an immense pleasure to receive at the European Council the Portuguese President, Marcelo Rebelo de Sousa, at the moment he bids farewell at the end of his term. The choice of the European institutions as the destination for his last official visit abroad is",
            "link": "https://www.markets.news/headlines/47ea94b9-ea78-49ee-aa84-1ffccc513f50",
            "pub_date": "2026-02-28 01:17:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ORS Haircare partners with HBCU Culture Shop to celebrate excellence and community, honoring HBCUs. Chicago, Feb. 27, 2026.",
            "id": "9d2c9e2a-034a-4ddf-9d5d-a58500faf164",
            "description": "A special collaboration has been launched to celebrate Historically Black Colleges and Universities (HBCUs), emphasizing their legacy, excellence, and future. ORS Haircare has affirmed its dedication to HBCU students and graduates through this limited-edition partnership. This initiative was announced in Chicago on February 27, 2026, with the aim of honoring the significance of HBCUs. This collaboration reflects ORS' ongoing support for HBCU community.",
            "link": "https://www.markets.news/headlines/9d2c9e2a-034a-4ddf-9d5d-a58500faf164",
            "pub_date": "2026-02-28 01:19:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Galaxy Dispensary in Richton Park, Illinois rebrands as Stash Dispensaries. Grand opening on March 7 at new location, 22214 Governors Hwy.",
            "id": "4b503c5f-3f6d-462c-8a2d-2d9924281835",
            "description": "A dispensary in Richton Park, Illinois, formerly known as Galaxy Dispensary, has undergone a rebranding and is now operating under the name Stash Dispensaries. This change signifies a new beginning for the retailer catering to the adult-use market in the area located at 22214 Governors Hwy. To commemorate this shift, Stash Dispensaries is hosting events...",
            "link": "https://www.markets.news/headlines/4b503c5f-3f6d-462c-8a2d-2d9924281835",
            "pub_date": "2026-02-28 01:19:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MN considering ban on crypto kiosks due to scams. Rep Erin Koegel proposes ban to build on 2024 law restricting operators.",
            "id": "592fd912-18c0-4834-9d46-8bbfde2aed42",
            "description": "A proposal put forth by Representative Erin Koegel suggests implementing a complete prohibition on cryptocurrency ATMs in Minnesota. This motion is in continuation of a state law enacted in 2024, which placed limitations on operators of kiosks. The ban is intended to curb the proliferation of such ATMs in the state and regulate the use of cryptocurrencies.",
            "link": "https://www.markets.news/headlines/592fd912-18c0-4834-9d46-8bbfde2aed42",
            "pub_date": "2026-02-28 01:20:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "56ce1975-95f9-4ed1-b63b-8b56711ff0cd",
            "description": "U.S. SEC SAYS IT ADOPTS FINAL RULES FOR THE HOLDING FOREIGN INSIDERS ACCOUNTABLE ACT",
            "link": "https://www.markets.news/headlines/56ce1975-95f9-4ed1-b63b-8b56711ff0cd",
            "pub_date": "2026-02-28 01:21:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK officials at a roundtable propose integrating compliance solutions into crypto privacy tools to enhance regulations.",
            "id": "56205112-00ca-4f4b-a856-530adb63fb0c",
            "description": "Officials from the UK recently participated in a roundtable discussion hosted by the Royal United Services Institute where they expressed interest in incorporating compliance measures into cryptocurrency privacy tools. The officials discussed strategies for integrating these solutions to enhance security and regulation in the crypto industry. This move aims to ensure transparency and accountability in transactions involving digital assets.",
            "link": "https://www.markets.news/headlines/56205112-00ca-4f4b-a856-530adb63fb0c",
            "pub_date": "2026-02-28 01:22:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Noma AI Security now part of AWS Security Hub Extended plan, enhancing security for customers.",
            "id": "30293f3c-cb9c-4772-82cd-c29668788523",
            "description": "On February 27, 2026, Noma Security, an AI Security company, revealed that their advanced AI Security platform can now be accessed through the Extended plan on AWS Security Hub, the unified security solution by Amazon Web Services. This union allows customers to benefit from the platform's comprehensive features and services.",
            "link": "https://www.markets.news/headlines/30293f3c-cb9c-4772-82cd-c29668788523",
            "pub_date": "2026-02-28 01:23:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "$160K awarded to 6 projects in Avalanche Foundation's Retro9000 cohort, part of $40M grant program. C-Chain round also introduced.",
            "id": "dbe0face-0b8e-4d95-8c59-7b4d0f97b614",
            "description": "The Avalanche platform has implemented a retroactive grant program amounting to $40 million, with initial distributions of over $160,000 allocated to Level 1 builders. Additionally, they have introduced a new round on the C-Chain that rewards projects based on AVAX burned.",
            "link": "https://www.markets.news/headlines/dbe0face-0b8e-4d95-8c59-7b4d0f97b614",
            "pub_date": "2026-02-28 01:24:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ffa0a422-dd76-489e-806f-9773413aa22e",
            "description": "ATLAS SP SAYS IT IS A SENIOR CREDITOR TO MFS AND HAS APPROXIMATELY 400 MILLION POUNDS OF EXPOSURE, OR ABOUT 1% OF ITS BALANCE SHEET, ALONGSIDE SEVERAL INTERNATIONAL BANKS",
            "link": "https://www.markets.news/headlines/ffa0a422-dd76-489e-806f-9773413aa22e",
            "pub_date": "2026-02-28 01:11:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "79501069-9027-4992-b32b-e24287c109ee",
            "description": "US Centcom: 'USS Frank E. Petersen Jr. (DDG 121) is equipped with various weapons, including the Mk.41 VLS, Mk.45 5-inch gun, and Mk.38 25mm chain gun. Frank E. Petersen Jr. recently conducted a Mk.38 live-fire exercise in the Arabian Sea, demonstrating defense capabilities and",
            "link": "https://www.markets.news/headlines/79501069-9027-4992-b32b-e24287c109ee",
            "pub_date": "2026-02-28 01:12:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Globalstar (NASDAQ: GSAT) stock rose as company reported Q4 2025 revenue of $71.96M, surpassing estimates. Service revenue up 17% Y/Y to $67.39M, subscriber equipment sales up 31% Y/Y to $4.57M. Net loss improved to $11.6M from $50.2M Y/Y. EPS loss wider than expected at 11 cents. Adjusted EBITDA rose to $32.4M from $30.4M Y/Y. Company had $447.5M in cash and generated $175.89M in operating cash flow.",
            "id": "8f80b1f9-dcf7-4345-b100-502e94d0d63e",
            "description": "Globalstar, Inc. (NASDAQ: GSAT) saw a stock increase following the release of its fiscal fourth-quarter 2025 results, which were a mix of positive and negative figures. The company reported quarterly revenue of $71.96 million, surpassing analyst expectations of $71.22 million. Service revenue rose by 17% year-over-year to $67.39 million, driven mainly by higher wholesale capacity services revenue. Revenue from subscriber equipment sales also saw an increase of 31% year-over-year to $4.57 million. The net loss for the quarter improved to $11.6 million, a significant decrease from the $50.2 million loss in the previous year. The reported EPS loss was 11 cents, wider than the analyst prediction of a 1-cent loss. Adjusted EBITDA for the quarter rose to $32.4 million from $30.4 million year-over-year. As of December 31, 2025, the company had $447.5 million in cash and equivalents. Operating cash flow during the quarter stood at $175.89 million, showing a decrease from previous figures.",
            "link": "https://www.markets.news/headlines/8f80b1f9-dcf7-4345-b100-502e94d0d63e",
            "pub_date": "2026-02-28 01:12:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ThredUp (TDUP) set to report EPS of $-0.04 on March 2. Historical data shows EPS beat by $0.02 led to 7.53% share drop. Stock up 124.89% in the last year. Investors await guidance for market reaction. ",
            "id": "150ee812-fb42-4d28-8954-40d5dd34f486",
            "description": "ThredUp (NASDAQ: TDUP) is scheduled to release its latest quarterly earnings on March 2, 2026. Analysts predict an EPS of $-0.04 for the apparel resale company. Investors are eager for the report, hoping for earnings that exceed expectations and positive guidance for the upcoming quarter. It is important to note that while earnings are crucial, market reactions are often influenced by future guidance. In the previous quarter, ThredUp surpassed expectations by $0.02, resulting in a 7.53% decrease in share price the following day. Looking at past performance: in Q3 2025, the EPS estimate was -0.05, but ThredUp posted -0.03, leading to a 7.53% drop in share price. ThredUp's shares were valued at $5.07 on February 26, showing a 124.89% increase over the past 52 weeks.",
            "link": "https://www.markets.news/headlines/150ee812-fb42-4d28-8954-40d5dd34f486",
            "pub_date": "2026-02-28 01:07:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BigBear.ai Hldgs (NYSE: BBAI) to announce quarterly earnings with estimated EPS of $-0.06. Historical performance suggests market reactions influence stock price. Shares currently trading at $4.15 with 52-week decrease of 17.96%. Investors eager for positive guidance.",
            "id": "b6e58723-5c7f-4c27-84ae-4bafae6556f1",
            "description": "BigBear.ai Hldgs (NYSE: BBAI) is set to announce its quarterly earnings on Monday, March 2, with analysts predicting an earnings per share (EPS) of $-0.06. Investors are eagerly awaiting the results, hoping for a beat on estimates and positive guidance for the next quarter. In the previous quarter, the company exceeded EPS expectations by $0.04, resulting in a 6.13% increase in share price the following day. However, over the last 52 weeks, BigBear.ai Hldgs' shares have declined by 17.96%, signaling disappointment among long-term shareholders. As of February 26, shares were trading at $4.15. The market response to earnings announcements is typically influenced not only by past performance but also by future guidance. Investors should consider both factors before reacting to the upcoming report. [Word count: 121]",
            "link": "https://www.markets.news/headlines/b6e58723-5c7f-4c27-84ae-4bafae6556f1",
            "pub_date": "2026-02-28 01:07:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}