{
    "data": [
        {
            "title": "Starfighters Space expands operations in Midland, Texas, relocating aircraft and hardware to increase mission cadence.",
            "id": "907d5260-9ea4-4d48-b34c-bb72e15d6c34",
            "description": "Starfighters Space, a leading aerospace company listed on NYSE American under the symbol FJET, is expanding its operations at the Midland International Air & Space Port. The company, known for its fleet of high-speed Mach 2+ capable aircraft, is relocating aircraft, engines, and support equipment to accommodate a rise in mission frequency. This move comes as part of their efforts to enhance their operational presence at the port and align with an expected surge in mission activity. This development signifies a significant step for Starfighters as they gear up for increased operations at the Midland International Air & Space Port.",
            "link": "https://www.markets.news/headlines/907d5260-9ea4-4d48-b34c-bb72e15d6c34",
            "pub_date": "2026-02-26 21:34:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Priority Technology Holdings, Inc. (NASDAQ: PRTH) to report Q4 and full-year 2025 financial results on March 10, 2026.",
            "id": "9a039cfe-1643-420c-a5f6-35fc6cb8137a",
            "description": "Alpharetta, Georgia-based Priority Technology Holdings, Inc. (NASDAQ: PRTH), a provider of payments and banking solutions aimed at simplifying the process of collecting, storing, lending, and transferring money to enhance revenue potential, disclosed plans to unveil its financial outcomes for the fourth quarter and full-year of 2025 on Tuesday, March 10, 2026, before the trading day commences. The Company is scheduled to conduct a conference call and webcast at 10:00 AM to analyze its financial performance and operational highlights.",
            "link": "https://www.markets.news/headlines/9a039cfe-1643-420c-a5f6-35fc6cb8137a",
            "pub_date": "2026-02-26 21:34:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Musaffa launches Global Halal Investment Platform for 600,000+ Muslim investors across 200+ countries to access US markets.",
            "id": "acb3fadb-ac30-46df-b420-3316a7034609",
            "description": "A prominent fintech platform called Musaffa unveiled its Global Halal Investment Platform in New York. This innovative platform caters to over 600,000 Muslim investors from more than 200 countries. It offers these investors enhanced access to US capital markets through a regulated and scalable trading and investment infrastructure, all while ensuring Shariah compliance is integrated directly into the investment process. This launch signifies a significant advancement in expanding opportunities for Muslim investors worldwide.",
            "link": "https://www.markets.news/headlines/acb3fadb-ac30-46df-b420-3316a7034609",
            "pub_date": "2026-02-26 21:34:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Manhattan Associates CFO Dennis Story to retire on March 31, 2026; Linda Pinne to succeed him. Story to advise CEO till 2026.",
            "id": "9f540486-8d33-46f7-86a4-6010c5578852",
            "description": "Today, Manhattan Associates Inc. revealed that Dennis Story, the current Executive Vice President & Chief Financial Officer (NASDAQ: MANH), will retire from his role by March 31, 2026. Following his departure, Linda Pinne will take over his responsibilities as the Senior Vice President and new Chief Financial Officer, Chief Accounting Officer, and Treasurer. Mr. Story will stay on as an advisor to the CEO until the close of 2026, easing into his retirement.",
            "link": "https://www.markets.news/headlines/9f540486-8d33-46f7-86a4-6010c5578852",
            "pub_date": "2026-02-26 21:34:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LG Display and Universal Display Corporation extend OLED partnership with long-term agreements for materials supply and licensing.",
            "id": "b758aae9-5541-4fd7-98df-36b746402746",
            "description": "A company based in Ewing, New Jersey, UDC, has recently disclosed that they have extended their OLED material supply and license agreements with LG Display, a renowned tech company. This development highlights UDC's commitment to a long-term partnership with LG Display. The specifics of the extension, including the duration and financial details, were not provided in the announcement. This agreement signifies a mutually beneficial relationship between the two companies in the OLED industry.",
            "link": "https://www.markets.news/headlines/b758aae9-5541-4fd7-98df-36b746402746",
            "pub_date": "2026-02-26 21:34:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zurn Elkay releases 2025 Sustainability Report, preventing 20 billion plastic bottles and delivering 2.4 billion gallons of filtered water.",
            "id": "b33464cf-f938-49d7-8c76-5650deeea501",
            "description": "Milwaukee-based Zurn Elkay Water Solutions (NYSE: ZWS) unveiled its 2025 Sustainability Report, showcasing advancements in environmental stewardship and expanded offerings to aid customers in achieving sustainability targets. Key accomplishments in 2025 comprise preventing 20 billion plastic bottles from polluting water sources and dumps, as well as delivering 2.4 billion gallons of purified drinking water. The company's dedication to sustainability is evident through these impactful figures and initiatives.",
            "link": "https://www.markets.news/headlines/b33464cf-f938-49d7-8c76-5650deeea501",
            "pub_date": "2026-02-26 21:35:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Family launches BrickPack, a portable play bag with 60-inch play mat on Amazon - solves brick clutter issue - helps kids play anywhere.",
            "id": "6ad0b237-a1bb-4c66-a8ef-483aae2302f2",
            "description": "A new family-designed bag, with a patent pending, featuring a 60-inch play mat has been released on Amazon. This innovative product aims to assist kids in transporting bricks conveniently, while also aiding parents in quicker clean-up and reducing clutter. Originating from Orange County, Calif., the launch of this product occurred on Feb. 26, 2026. Fed up with stepping on bricks, this family now offers a solution to this common issue.",
            "link": "https://www.markets.news/headlines/6ad0b237-a1bb-4c66-a8ef-483aae2302f2",
            "pub_date": "2026-02-26 21:35:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Loar Holdings beat Q4 earnings estimate by 36.84%, reporting EPS of $0.26. Revenue increased by $21.31 million.",
            "id": "20f4b57a-183c-477c-9024-782ae4f7f10f",
            "description": "Loar Holdings (NYSE: LOAR) unveiled its Q4 earnings on Thursday, February 26, 2026 at 08:30 AM. Key highlights include surpassing estimated earnings by 36.84%, posting an EPS of $0.26 compared to the projected $0.19. Revenue also saw growth, increasing by $21.31 million from the corresponding period in the prior year. In the previous quarter, the company outperformed... More details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/20f4b57a-183c-477c-9024-782ae4f7f10f",
            "pub_date": "2026-02-26 21:35:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Airbnb surges in rankings with growth score jumping from 61.98 to 94.75; records $12.2 billion annual revenue. Analysts bullish on stock potential, Deutsche Bank raises price target to $154.",
            "id": "0ee89826-5e33-4f2a-8750-5c231489afbe",
            "description": "Airbnb Inc. (NASDAQ: ABNB) has soared to the top 10% of growth stocks, with its growth score skyrocketing from 61.98 to 94.75 in the latest rankings by Benzinga Edge. The impressive leap in percentile follows a strong fourth-quarter performance where Airbnb reported revenue of $2.78 billion, surpassing the estimated $2.72 billion. Despite falling short of earnings-per-share expectations, the company achieved a record-breaking fiscal year with total revenue hitting $12.2 billion, indicating strong demand in the travel industry. Analysts are increasingly optimistic about Airbnb's long-term growth prospects, with Wall Street cheering its success in the \"narrative battle.\" Deutsche Bank upgraded the stock from Hold to Buy, setting a new price target of $154. Key initiatives like the \"Reserve Now Pay Later\" (RNPL) option and a simplified host fee have been lauded for driving Airbnb's growth. For the full article, please visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/0ee89826-5e33-4f2a-8750-5c231489afbe",
            "pub_date": "2026-02-26 21:35:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "infinitii ai inc. experiences 100% customer retention, grows Q2 revenue to $640,827 with a 2.2% increase from Q1; attracts 2 new firms.",
            "id": "04156e24-85ba-49c2-8897-0f8b386b556f",
            "description": "infinitii ai inc., a leader in AI-driven predictive analytics software for Smart City water and Smart Industry infrastructure applications, has reported its annual financial and operational highlights for the second quarter of fiscal year 2026. The Company closed an oversubscribed $610,000 convertible debenture financing, improving its balance sheet and reducing accounts payable by 33%. Revenue for Q2 FY2026 was $640,827, a 2.2% increase from Q1 FY2026, with 100% customer retention. The operating loss was $266,595, including non-cash charges, but showed improvement from the previous quarter. The Company attracted two large engineering services firms to accelerate revenue growth in FY2026. CEO Jean Charles Phaneuf expressed confidence in the Company's direction and financial stability. Further details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/04156e24-85ba-49c2-8897-0f8b386b556f",
            "pub_date": "2026-02-26 21:35:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "STEALTHGAS INC. (NASDAQ: GASS) to release Q4 & 12M 2025 financial results on March 2, 2026; serves the LPG sector.",
            "id": "24bdb77a-a6d2-4533-a88c-3751c995df29",
            "description": "Greece-based company STEALTHGAS INC. (NASDAQ: GASS), operating in the LPG sector of global shipping, disclosed plans to unveil its Q4 operational and financial performance figures for the period concluding on December 31, 2025. The announcement entails the release of these results beforehand, scheduled to occur in New York on March 2, 2026, prior to the market opening.",
            "link": "https://www.markets.news/headlines/24bdb77a-a6d2-4533-a88c-3751c995df29",
            "pub_date": "2026-02-26 21:26:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Benjamin Beauvalot appointed Senior VP, Chief Strategy and M&A Officer at Quest Diagnostics, bringing valuable experience to the team.",
            "id": "61e2435a-2cf3-484c-bcbe-5d0d50e2c904",
            "description": "A skilled veteran in M&A and transformation management previously associated with Danaher and Patheon has recently become a part of the executive team at Quest Diagnostics in SECAUCUS, New Jersey. This move was made public on February 26, 2026. Quest Diagnostics, a notable player in diagnostic information services, revealed Benjamin Beauvalot's integration into their team. The company, listed on the NYSE as DGX, shared this noteworthy update with the public.",
            "link": "https://www.markets.news/headlines/61e2435a-2cf3-484c-bcbe-5d0d50e2c904",
            "pub_date": "2026-02-26 21:26:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PharmAla donates drugs for fibromyalgia trial to receive trial data from hospital affiliated with Harvard.",
            "id": "67526677-102d-4340-98c0-ae19af69ddca",
            "description": "PharmAla has agreed to receive valuable clinical trial data from a hospital affiliated with Harvard University. In return for this data, PharmAla will be making a generous donation of their drug. This partnership is expected to greatly benefit both parties and advance medical research.",
            "link": "https://www.markets.news/headlines/67526677-102d-4340-98c0-ae19af69ddca",
            "pub_date": "2026-02-26 21:27:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "04928c0a-cae7-4e89-aa5b-5460f54ecd80",
            "description": "Leaving ceremony for India's Narendra Modi at Israel's Ben Gurion airport, at the end of two-day visit",
            "link": "https://www.markets.news/headlines/04928c0a-cae7-4e89-aa5b-5460f54ecd80",
            "pub_date": "2026-02-26 21:28:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Primech Holdings (NASDAQ: PMEC) secures US$5.02M in new cleaning contracts in Singapore, expanding revenue base.",
            "id": "9ad116f5-2701-4531-a2e9-90915d4f6928",
            "description": "Primech Holdings, a company listed on the NASDAQ under the ticker symbol PMEC, has recently announced the acquisition of approximately US$5.02 million in new contracts for residential cleaning services in Singapore. This development is anticipated to significantly increase the company's recurring revenue streams over the course of the next three years.",
            "link": "https://www.markets.news/headlines/9ad116f5-2701-4531-a2e9-90915d4f6928",
            "pub_date": "2026-02-26 21:28:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c034f343-205a-448a-a57d-84532e265c7c",
            "description": "Cuban authorities say their forces killed four armed exiles and wounded six others after a shootout at sea near the island’s north coast. The Interior Ministry said the group arrived in a Florida-registered speedboat, opened fire on a Cuban patrol and intended to carry out a",
            "link": "https://www.markets.news/headlines/c034f343-205a-448a-a57d-84532e265c7c",
            "pub_date": "2026-02-26 21:29:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PennantPark Floating Rate Capital Ltd. prices $200 million public offering of 6.75% notes due 2029, closing March 4, 2026.",
            "id": "5497070d-7465-4148-b31b-071b9c8db69c",
            "description": "On February 26, 2026, PennantPark Floating Rate Capital Ltd. (NYSE: PFLT) revealed the pricing of an underwritten public offering for $200 million aggregate principal amount of its 6.75% notes due 2029. The Notes have a maturity date of March 4, 2029, and can be redeemed either entirely or partially at the Company’s discretion at any time at par with an additional \"make-whole\" premium if applicable. However, if redeemed within three months of maturity, the Notes can be redeemed at par. The closing of this offering is anticipated to occur around March 4, 2026, pending the fulfillment of standard closing conditions.",
            "link": "https://www.markets.news/headlines/5497070d-7465-4148-b31b-071b9c8db69c",
            "pub_date": "2026-02-26 21:30:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e80361fe-489e-4d6a-9594-47e95dbb7ae2",
            "description": "Around 60% of IBS patients saw significant pain reduction and 68% experienced bloating reduction with inFoods® IBS Therapy.",
            "link": "https://www.markets.news/headlines/e80361fe-489e-4d6a-9594-47e95dbb7ae2",
            "pub_date": "2026-02-26 21:21:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SiriusXM offers to buy back 3.125% Senior Notes due 2026, starts cash tender offer for all outstanding notes.",
            "id": "83cdd74a-3a6a-46e7-9ab0-d8d431fd1ff5",
            "description": "On February 26, 2026, Sirius XM Holdings Inc. revealed that its subsidiary, Sirius XM Radio LLC, has initiated a cash tender offer named the \"Offer\" to buy all of the Offeror's outstanding 3.125% Senior Notes. This offer is a significant move for SiriusXM, a company listed on the NASDAQ under the ticker symbol SIRI. The tender offer represents a key financial decision by the corporation to potentially reduce its outstanding debt and streamline its financial obligations. This development underscores SiriusXM's strategic approach to managing its finances and optimizing its capital structure for future growth and stability.",
            "link": "https://www.markets.news/headlines/83cdd74a-3a6a-46e7-9ab0-d8d431fd1ff5",
            "pub_date": "2026-02-26 21:22:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sirius XM Holdings Inc plans to offer $1 billion of Senior Notes due 2032 through its subsidiary.",
            "id": "fd225c22-a789-4d31-bb91-91b148c8942d",
            "description": "In New York on February 26, 2026, Sirius XM Holdings Inc. disclosed plans for its subsidiary, Sirius XM Radio LLC, to issue $1,000,000,000 of Senior Notes due 2032, pending market conditions. This offering is aimed at individuals deemed to be potential investors.",
            "link": "https://www.markets.news/headlines/fd225c22-a789-4d31-bb91-91b148c8942d",
            "pub_date": "2026-02-26 21:22:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}