{
    "data": [
        {
            "title": "Smarsh warns that governance, defensibility, and accountability are key for regulated enterprises in 2026 AI landscape.",
            "id": "b9af4641-cdbc-4e6d-b850-c58f849830c0",
            "description": "Smarsh, a leading company in communications data and intelligence based in Portland, Oregon, has recently unveiled its 2026 AI Insights Report. The report highlights a significant shift in the regulatory landscape, indicating that regulators are progressing from experimenting with AI to actively enforcing regulations. This transition emphasizes the crucial importance of governance, defensibility, and accountability for regulated businesses in the upcoming year. The report specifically focuses on financial institutions and other regulated entities, stressing that the key concern is no longer the decision of whether to embrace AI technology, but rather how to navigate the challenges of compliance amid evolving regulatory standards. Businesses in these sectors will need to prioritize establishing robust frameworks to ensure adherence to regulations and to effectively manage AI-related risks in order to thrive in the increasingly scrutinized regulatory environment.",
            "link": "https://www.markets.news/headlines/b9af4641-cdbc-4e6d-b850-c58f849830c0",
            "pub_date": "2026-02-26 21:10:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "i3 Broadband gets right-of-way approvals in Antioch, Grayslake, and Winthrop Harbor in Lake County, Illinois for FTTH network. The company also joins Lake County Municipal League for 2026.",
            "id": "b4aa5f53-4f29-4bbd-b875-129389da2d88",
            "description": "In East Peoria, Illinois, i3 Broadband, a regional fiber-optic internet company, revealed that it has obtained permissions to establish its fully fiber-to-the-home (FTTH) network in Lake County. This move signifies a notable expansion for the provider in Northern Illinois, specifically in communities such as Antioch, Grayslake, and Winthrop Harbor. Furthermore, i3 Broadband has become an associate member of the Lake County Municipal League for the year 2026, strengthening its presence in the region.",
            "link": "https://www.markets.news/headlines/b4aa5f53-4f29-4bbd-b875-129389da2d88",
            "pub_date": "2026-02-26 21:10:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sensus Healthcare introduces Sensus Link to enhance SRT-100™ system capabilities. Cloud-based software expands advanced operating.",
            "id": "672eafa4-dd97-4179-bb83-0ea05b0c8b18",
            "description": "Sensus Healthcare, Inc., a medical device company focusing on treatments for skin conditions, has unveiled Sensus Link, a cloud-based software for its SRT-100™ system users. Being traded on Nasdaq as SRTS, the company aims to enhance operating capabilities for oncological and non-oncological conditions. The software provides a cost-effective solution for improved connectivity, expanding the system's reach. This innovation showcases the company's commitment to advanced and efficient healthcare technologies.",
            "link": "https://www.markets.news/headlines/672eafa4-dd97-4179-bb83-0ea05b0c8b18",
            "pub_date": "2026-02-26 21:10:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Banuba launches AI Talking Photo API in Dubai, turning static images into talking videos. #AILipSync",
            "id": "9b8bf6df-4fa2-40fc-9a49-626b637a774b",
            "description": "In Dubai, United Arab Emirates, Banuba has introduced a cutting-edge AI-powered tool capable of transforming still portraits into lifelike videos. This innovative technology, known as AILipSync, aims to revolutionize the way videos are created by utilizing artificial intelligence. This tool has caught the attention of many with its ability to generate realistic videos from static images. Its launch signifies a significant advancement in the field of video creation, drawing interest from various industries and professionals.",
            "link": "https://www.markets.news/headlines/9b8bf6df-4fa2-40fc-9a49-626b637a774b",
            "pub_date": "2026-02-26 21:10:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Weave ranked #2 in G2’s 2026 Best Healthcare Software Awards for software companies with 100+ million buyers.",
            "id": "eefd82dd-9afe-4e08-a288-1b06a5f51951",
            "description": "In Lehi, Utah, Weave (NYSE: WEAV) has been recognized as one of the top software platforms for small and medium-sized healthcare businesses. Weave was ranked #2 on G2’s 2026 Best Healthcare Software Products list, which is significant as G2 is a renowned software marketplace reaching over 100 million buyers each year. The annual Best Software Awards by G2 are highly respected for identifying the top software companies and products in the industry.",
            "link": "https://www.markets.news/headlines/eefd82dd-9afe-4e08-a288-1b06a5f51951",
            "pub_date": "2026-02-26 21:10:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Qure.ai gains 6 FDA-approved indications for chest X-ray, leading in radiology AI race.",
            "id": "ae4c5686-095b-4686-8cd6-c5f9cb7cb431",
            "description": "In New York, Qure.ai has achieved a significant milestone with the FDA approving six new indications for its chest X-ray technology. This success solidifies Qure.ai's position as a leader in the radiology AI sector. The approval highlights the efficacy and potential of the technology in revolutionizing healthcare.",
            "link": "https://www.markets.news/headlines/ae4c5686-095b-4686-8cd6-c5f9cb7cb431",
            "pub_date": "2026-02-26 21:10:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Varist introduces Hybrid Detection Engine™ to detect known and zero-day threats instantly at scale, scanning 500 billion files per day.",
            "id": "82c3347d-d226-4d22-91bb-d2dffe3679bf",
            "description": "Varist unveiled their Hybrid Detection Engine™ in Reykjavik, Iceland, marking the release of an innovative AI-powered malware detection solution. This new technology is capable of identifying both known and zero-day threats immediately on a large scale. Drawing from established methods that have facilitated over 500 billion daily file scans for clients worldwide, the Varist system outperforms conventional detection mechanisms by thoroughly scanning every file and emulating suspicious elements in real-time. Its unique approach amalgamates detection of unfamiliar threats with reduced expenses and elevated efficiency.",
            "link": "https://www.markets.news/headlines/82c3347d-d226-4d22-91bb-d2dffe3679bf",
            "pub_date": "2026-02-26 21:10:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "USA Today Co (NYSE: TDAY) Q4 earnings disappoint, EPS at $-0.21 vs $-0.12 estimate, revenue down $36.28M from last year.",
            "id": "93caec09-6f91-4684-b6bf-b95d019e2d56",
            "description": "On Thursday, February 26, 2026, at 07:00 AM, USA Today Co (NYSE: TDAY) released its Q4 earnings report. The company fell short of estimated earnings by -75.0%, revealing an EPS of $-0.21 compared to the expected $-0.12. Revenue for the quarter decreased by $36.28 million year-over-year. This latest announcement marked a disappointing performance for the company compared to prior quarters. For a detailed analysis, visit a financial news website.",
            "link": "https://www.markets.news/headlines/93caec09-6f91-4684-b6bf-b95d019e2d56",
            "pub_date": "2026-02-26 21:10:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Maxell to ship samples of EMC countermeasure components for high-frequency bands from April 2026 for functionality evaluation.",
            "id": "8d899180-a4cc-4fa1-b48a-cdfa6e518221",
            "description": "In Tokyo, Maxell has announced the commencement of sample shipments for evaluation purposes of EMC countermeasure components for high-frequency bands. Interested parties can now receive samples to assess their functionality.",
            "link": "https://www.markets.news/headlines/8d899180-a4cc-4fa1-b48a-cdfa6e518221",
            "pub_date": "2026-02-26 21:10:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Autonomize AI appoints Jennifer Rouse as VP of Marketing and Gina Collins as Chief Regulatory Officer, accelerating adoption of governed AI platform.",
            "id": "c76b952a-cc27-42a0-b9f5-ed24aeb4bc54",
            "description": "In Austin, Texas, Autonomize AI has appointed Jennifer Rouse as VP of Marketing and Gina Collins as Chief Regulatory Officer. The company is leading the way in helping healthcare businesses transition into AI-native organizations. This move comes as Autonomize AI is rapidly implementing its governed AI platform, leading to significant cost savings. These appointments signal the company's dedication to growth, with millions of dollars in savings already delivered to numerous organizations.",
            "link": "https://www.markets.news/headlines/c76b952a-cc27-42a0-b9f5-ed24aeb4bc54",
            "pub_date": "2026-02-26 21:10:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Behrman Capital sells Waterline Renewal Technologies to Azuria Water Solutions, a New Mountain Capital Company.",
            "id": "e267fbc0-9a46-4bb3-8b87-58390c7a6d2f",
            "description": "On February 26, 2026, Behrman Capital, a private equity firm located in New York, revealed the sale of Waterline Renewal Technologies to Azuria Water Solutions. This transaction signifies a significant milestone for Behrman, showcasing their successful exit strategy. The specific financial details of the deal, including the purchase price and any associated figures, were not disclosed to the public. Behrman's decision to sell Waterline aligns with its investment objectives and is expected to have a notable impact on both companies involved.",
            "link": "https://www.markets.news/headlines/e267fbc0-9a46-4bb3-8b87-58390c7a6d2f",
            "pub_date": "2026-02-26 21:01:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Agile Consulting Group receives U.S. Patent for real-time Nexus Study Interface design. ATLANTA, Feb. 26, 2026 /PRNewswire.",
            "id": "d4668084-c3b5-4e59-b14b-c1e0c172a81b",
            "description": "Today, in Atlanta, Agile Consulting Group, specialists in sales tax exemption and compliance, revealed that they have been awarded a U.S. Design Patent by the United States Patent and Trademark Office for their display screen and graphical user interface. This patent recognizes the unique design of their interface, which is utilized in their services. This achievement marks a significant milestone for the company in the realm of intellectual property protection.",
            "link": "https://www.markets.news/headlines/d4668084-c3b5-4e59-b14b-c1e0c172a81b",
            "pub_date": "2026-02-26 21:01:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vertiv partners with Hut 8 to streamline AI deployment using OneCore system, enhancing efficiency and scalability.",
            "id": "df3d9fc5-ed68-4892-9e56-f00c5cc344bd",
            "description": "COLUMBUS, Ohio - On February 26, 2026, Vertiv (NYSE: VRT) introduced its Vertiv™ OneCore factory-integrated infrastructure, designed to streamline deployment processes and enhance schedule predictability. This innovative system aims to combat construction limitations by simplifying on-site implementation. As a prominent player in critical digital solutions, Vertiv continues to prioritize efficiency and reliability in its offerings.",
            "link": "https://www.markets.news/headlines/df3d9fc5-ed68-4892-9e56-f00c5cc344bd",
            "pub_date": "2026-02-26 21:01:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "European Union funds SK-IIDT-Vaxxas consortium for high-density microarray patch vaccines to enhance seasonal & pandemic flu protection.",
            "id": "63b7a47f-b24d-433a-badf-aaf1ee812d40",
            "description": "Consortium comprising SK, IDT, and Vaxxas introduced a high-density microarray patch (HD-MAP) for vaccines in Europe, aiming to enhance vaccine efficacy and availability. They are focused on developing HD-MAP vaccines with high immunogenicity for both seasonal and pandemic influenza. The initiative is set to address pressing immunization challenges by capitalizing on innovative technology.",
            "link": "https://www.markets.news/headlines/63b7a47f-b24d-433a-badf-aaf1ee812d40",
            "pub_date": "2026-02-26 21:01:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lifetime Brands will release its fourth quarter and full year 2025 financial results followed by a conference call.",
            "id": "6f25bf7b-f5a4-4919-be17-c8c58410d0d9",
            "description": "Lifetime Brands has disclosed the upcoming release date for its financial results for the fourth quarter and full year of 2025. The company will be hosting a conference call to discuss these results. The earnings report is anticipated to be published on [insert date], followed by the conference call at [insert time]. Shareholders and interested parties are encouraged to tune in to learn more about the company's performance during this period.",
            "link": "https://www.markets.news/headlines/6f25bf7b-f5a4-4919-be17-c8c58410d0d9",
            "pub_date": "2026-02-26 21:01:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pet grooming franchise Sparkle Grooming Co. exceeds 500 licenses in less than 2 years, with 7% attrition and 73% conversion in 2025.",
            "id": "f03df93c-b71a-49e7-9a1e-c28228b54508",
            "description": "A pet care franchise driven by membership has achieved 500 awarded licenses in 27 states. In 2025, they experienced a 7% annual member attrition rate but achieved a high 73% membership conversion rate. The franchise, Sparkle Grooming Co., based in Scottsdale, Arizona, crossed this milestone on February 26, 2026.",
            "link": "https://www.markets.news/headlines/f03df93c-b71a-49e7-9a1e-c28228b54508",
            "pub_date": "2026-02-26 21:01:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ollie’s Bargain Outlet Holdings, Inc. to report Q4 and FY 2025 earnings on March 12, 2026, with a conference call at 8:30 am ET.",
            "id": "9c9e1278-1f96-4f3b-a2ee-7751e2081161",
            "description": "In Harrisburg, Pennsylvania, on Feb. 26, 2026, Ollie’s Bargain Outlet Holdings, Inc. (NASDAQ: OLLI) revealed plans to disclose its financial performance for Q4 and fiscal year 2025 before the market opens on March 12, 2026. The President and CEO, Eric van der Valk, along with the Executive VP and CFO, Robert Helm, will lead a conference call at 8:30 a.m. ET on the same day to review the results and address inquiries from investors.",
            "link": "https://www.markets.news/headlines/9c9e1278-1f96-4f3b-a2ee-7751e2081161",
            "pub_date": "2026-02-26 21:01:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ScrubaDub opens new car wash in Medford, MA, their first location in the area, at 2 Fulbright Street.",
            "id": "a8c92b92-ffc1-4da5-bf5e-94a0b9d2ecc8",
            "description": "A well-established car wash company in New England, ScrubaDub, which has been operating since 1966, has recently opened a new branch in Medford, located at 2 Fulbright Street near Mystic Ave. This new site signifies ScrubaDub's initial venture into serving the Medford community.",
            "link": "https://www.markets.news/headlines/a8c92b92-ffc1-4da5-bf5e-94a0b9d2ecc8",
            "pub_date": "2026-02-26 21:01:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ImageneBio (Nasdaq: IMA) to attend Leerink Global Healthcare Conference in Miami from March 8-11 for meetings and chat.",
            "id": "a2879614-b3cd-404f-9919-edccb49e4ef7",
            "description": "On February 26, 2026, ImageneBio, Inc. (Nasdaq: IMA) revealed plans for its involvement in the 2026 Leerink Global Healthcare Conference in Miami, Florida from March 8-11. The company will engage in a fireside chat and conduct individual meetings during the event.",
            "link": "https://www.markets.news/headlines/a2879614-b3cd-404f-9919-edccb49e4ef7",
            "pub_date": "2026-02-26 21:01:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Whitehawk Therapeutics (Nasdaq: WHWK) will present at investor conferences as a clinical-stage oncology company.",
            "id": "454b9772-9c7b-453c-8851-ca2ebdffe440",
            "description": "On February 26, 2026, in Morristown, New Jersey, Whitehawk Therapeutics, Inc. (Nasdaq: WHWK), a company in the clinical-stage oncology therapeutics field, announced their focus on utilizing advanced technologies to enhance antibody drug conjugate (ADC) cancer treatments. This company is dedicated to applying these technologies to established tumor biology with the goal of efficiently delivering improved ADC cancer treatments.",
            "link": "https://www.markets.news/headlines/454b9772-9c7b-453c-8851-ca2ebdffe440",
            "pub_date": "2026-02-26 21:01:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}