{
    "data": [
        {
            "title": "Bitcoin price at $66,000, ETF inflows strong. Sentiment at 16, liquidations at $258.85M in 24 hours. Bitcoin ETFs see $254.5M inflows, Ethereum ETFs $6.57M. Cryptos dip, meme coin sector drops 3% to $34.3B in 24 hours. Trader notes Bitcoin regaining 50 EMA support. [Source: Benzinga.com]",
            "id": "f726e995-f65c-471b-9a3a-6e88454c6e7f",
            "description": "Bitcoin's price dropped towards $66,000 despite significant inflows from ETFs. Market sentiment remains in extreme fear at a level of 16, with liquidations totaling $258.85 million in the last 24 hours. Bitcoin ETFs experienced net inflows of $254.5 million, while Ethereum ETFs saw $6.57 million in net inflows. The current cryptocurrency prices are Bitcoin at $66,601.07, Ethereum at $1,976.58, Solana at $84.60, XRP at $1.39, Dogecoin at $0.09608, and Shiba Inu at $0.055912. The meme coin sector as a whole decreased by 3% to $34.3 billion over the past day. Trader Jelle noted that Bitcoin is using its 4-hour 50 EMA as a support level. For more details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/f726e995-f65c-471b-9a3a-6e88454c6e7f",
            "pub_date": "2026-02-27 20:29:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f87f96f9-2025-4d16-ab17-1cd497151998",
            "description": "U.S. ENVOY BARRACK MEETS FORMER IRAQI PRIME MINISTER AND SHI’ITE ALLIANCE PM CANDIDATE NOURI AL-MALIKI - REPORTS",
            "link": "https://www.markets.news/headlines/f87f96f9-2025-4d16-ab17-1cd497151998",
            "pub_date": "2026-02-27 20:30:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Credicorp Ltd. reveals board nominees for 2026 AGM in Peru to be held virtually on March 31, 2026 at 3:00 pm (Peru time).",
            "id": "fd22836a-3773-425e-bea3-85af0422a5ba",
            "description": "On February 27, 2026, Credicorp Ltd. in Lima, Peru, revealed that its Board of Directors has greenlighted the selection of candidates for the upcoming 2026 Annual General Meeting of Shareholders. The AGM is scheduled for March 31, 2026 at 3:00 p.m. (Peru time) and will be conducted entirely online.",
            "link": "https://www.markets.news/headlines/fd22836a-3773-425e-bea3-85af0422a5ba",
            "pub_date": "2026-02-27 20:30:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Caliber sells Holiday Inn Ocotillo for $13M, paving the way for expansion in 2026-2027. Successful capital recycling.",
            "id": "6bf18abd-1678-414c-a4b8-1162ab559376",
            "description": "A recent disposition of assets has led to a successful capital recycling for a hospitality platform, signaling the beginning of its next growth phase. The move has allowed the platform to reallocate resources effectively, positioning it for further expansion. This strategic decision comes after achieving significant milestones, with the platform now poised to capitalize on new opportunities. This marks a key transition for the company, as it gears up for enhanced growth and development.",
            "link": "https://www.markets.news/headlines/6bf18abd-1678-414c-a4b8-1162ab559376",
            "pub_date": "2026-02-27 20:30:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Boralex reports $33M in net earnings for fiscal 2025 following large-scale projects in Canada and UK.",
            "id": "771e6040-fbb2-46a8-9cb4-8b45265fcdc7",
            "description": "Boralex Inc. has announced its financial results for the fourth quarter and full fiscal year of 2025. The corporation, listed as TSX: BLX, shared this information from Montreal on February 27, 2026.",
            "link": "https://www.markets.news/headlines/771e6040-fbb2-46a8-9cb4-8b45265fcdc7",
            "pub_date": "2026-02-27 20:30:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zoomlion starts 2026 strong with $1.2 billion in global equipment shipments; 15,000 units to 40+ markets.",
            "id": "81d85d94-20c6-410c-bd9e-15142a55bce2",
            "description": "Zoomlion Heavy Industry Science & Technology Co., Ltd., a company listed as 1157.HK, has announced a successful start to 2026 by delivering over 15,000 units to customers across 40 international markets. This news was reported from Changsha, China on February 27, 2026. The company is optimistic about their performance and emphasizes the significant reach of their large-scale equipment to various parts of the world.",
            "link": "https://www.markets.news/headlines/81d85d94-20c6-410c-bd9e-15142a55bce2",
            "pub_date": "2026-02-27 20:17:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Healthcare Triangle's QuantumNexis Inc. launches Dubai operations to advance digital health in GCC countries. Strengthening mission to accelerate TeleHealth and Digital Therapeutics. #HCTI #Dubai #DigitalHealth #GCC",
            "id": "174ecae9-e7d6-44ac-a557-428728fa4801",
            "description": "Healthcare Triangle's recent Dubai Operation aims to advance TeleHealth, Digital Therapeutics, and population-scale care in the GCC region, reinforcing their mission. The operation, based in Dubai, signifies a strategic move by Healthcare Triangle, Inc. (Nasdaq: HCTI) to accelerate healthcare services. This development, announced on February 27, 2026, will play a vital role in expanding telehealth and digital therapeutics in the region and enhancing care delivery at a broader scale. The move aligns with Healthcare Triangle's commitment to innovation and growth in the healthcare sector.",
            "link": "https://www.markets.news/headlines/174ecae9-e7d6-44ac-a557-428728fa4801",
            "pub_date": "2026-02-27 20:19:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ef3b1a34-3231-429d-ba93-21e69d756bc6",
            "description": "Zelenskyy: 'We discussed with Pavlo Klimkin the foreign policy situation around Ukraine and some decisions that are needed to strengthen Ukrainian positions in Europe and in other parts of the world. I am grateful to Pavlo for his work for Ukraine and proposed several areas of",
            "link": "https://www.markets.news/headlines/ef3b1a34-3231-429d-ba93-21e69d756bc6",
            "pub_date": "2026-02-27 20:21:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Treace Medical Concepts Q4 earnings show missed estimated EPS by 7.14%, revenue down $6.19 million from last year.",
            "id": "9bd985e1-4c4e-4929-af47-b3fe3c691337",
            "description": "Treace Medical Concepts (NASDAQ: TMCI) published its Q4 financial results on Friday, February 27, 2026, at 07:05 AM. The key points from the earnings report indicate that the company fell short of anticipated earnings by -7.14%, revealing an EPS of $-0.15 compared to the estimated $-0.14. There was a decline in revenue by $6.19 million from the corresponding period in the previous year. Moreover, in the last quarter, Treace had exceeded... Further details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/9bd985e1-4c4e-4929-af47-b3fe3c691337",
            "pub_date": "2026-02-27 20:12:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0a3d5606-a450-4404-9663-e52e96af86a3",
            "description": "MODERNA: CHMP RECOMMENDS FLU PLUS COVID COMBINATION VACCINE",
            "link": "https://www.markets.news/headlines/0a3d5606-a450-4404-9663-e52e96af86a3",
            "pub_date": "2026-02-27 20:12:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fulgent Genetics (NASDAQ: FLGT) Q4 earnings surpass estimates by 277.78%, EPS of $0.16 vs $-0.09. Revenue up $7.12 million.",
            "id": "5f3106b6-e993-4051-8147-c3ef87b37176",
            "description": "Fulgent Genetics (NASDAQ: FLGT) released its Q4 earnings report on February 27, 2026, at 07:00 AM. The report revealed that the company exceeded estimated earnings by an impressive 277.78%, with an EPS of $0.16 compared to an estimated $-0.09. Revenue also saw a significant increase, rising by $7.12 million from the previous year. This positive performance follows a trend of outperforming expectations, with the company surpassing EPS estimates by $0.5 in the last quarter, marking an 18.15% increase. Detailed information is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/5f3106b6-e993-4051-8147-c3ef87b37176",
            "pub_date": "2026-02-27 20:07:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Silver Storm Mining Ltd. is welcoming PDAC 2026 attendees to Booth #2540 on March 1-4 to learn about their rehabilitation work.",
            "id": "5d445cd6-600a-4e99-bd4e-08067b22edee",
            "description": "Silver Storm Mining Ltd. is excited to welcome guests to the 2026 PDAC Convention at Booth #2540 from March 1-4, 2026. The Company, listed on TSX.V as SVRS, OTCQX as SVRSF, and FSE as SVR, invites attendees to engage directly with them and discover the latest updates on rehabilitation efforts as they prepare for a possible relaunch of operations.",
            "link": "https://www.markets.news/headlines/5d445cd6-600a-4e99-bd4e-08067b22edee",
            "pub_date": "2026-02-27 20:07:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TransAlta partners with CPP Investments and Brookfield for data centre at Keephills Site, scaling up to 1 GW.",
            "id": "051d5c17-817a-40c4-9caa-cf2cf162d3df",
            "description": "On February 27, 2026, in Calgary, Alberta, TransAlta Corporation (TSX: TA) (NYSE: TAC) disclosed a significant development. The company has forged a Memorandum of Understanding (MOU) with Canada Pension Plan Investment Board (CPP Investments) and Brookfield. This collaboration aims to propel a data centre project in Alberta. As per the agreement, TransAlta will serve as the sole site and power supplier for this initiative.",
            "link": "https://www.markets.news/headlines/051d5c17-817a-40c4-9caa-cf2cf162d3df",
            "pub_date": "2026-02-27 20:07:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TransAlta to hold Investor Day in Toronto on March 23, 2026, to update shareholders (TSX: TA) (NYSE: TAC).",
            "id": "934eac28-b696-41b8-957a-2ea0c14fda58",
            "description": "TransAlta Corporation (TSX: TA) (NYSE: TAC) has revealed its plans to conduct an Investor Day in Toronto on March 23, 2026. The event aims to provide current and potential investors with valuable insights into the company's operations, strategies, and future goals. This announcement signifies TransAlta's commitment to transparency and engagement with its stakeholders. Attendees can expect to gain a deeper understanding of the company's performance and financial standing, potentially leading to informed investment decisions.",
            "link": "https://www.markets.news/headlines/934eac28-b696-41b8-957a-2ea0c14fda58",
            "pub_date": "2026-02-27 20:07:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "1stdibs.com beat Q4 earnings estimates by 25%, with an EPS of $-0.03 vs estimate of $-0.04. Revenue increased by $198k from last year.",
            "id": "89575209-5103-4851-9553-a500a52aae08",
            "description": "On February 27, 2026, 1stdibs.com (NASDAQ: DIBS) released its Q4 earnings results at 07:00 AM. The announcement revealed that 1stdibs.com exceeded estimated earnings by 25.0%, with an EPS of $-0.03 compared to the estimated $-0.04. Additionally, revenue increased by $198 thousand from the previous year. In terms of past earnings, the company outperformed in EPS. For more detailed information, the full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/89575209-5103-4851-9553-a500a52aae08",
            "pub_date": "2026-02-27 20:08:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3457027c-77ab-4676-8021-9456bc5c98e8",
            "description": "Ukraine FM: ‘Ukraine has taken note of the statement issued by the Ministry of International Relations of the Republic of Botswana on February 26th on reports regarding Batswana nationals recruited into Russia’s war against Ukraine. We welcome the efforts of Botswana’s",
            "link": "https://www.markets.news/headlines/3457027c-77ab-4676-8021-9456bc5c98e8",
            "pub_date": "2026-02-27 20:08:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cirrus360 & Vodafone showcase AI-driven Declarative Digital Twin platform for RAN, automating system analysis.",
            "id": "cc372c42-4f29-4787-83c4-727910c1f3fd",
            "description": "In Richardson, Texas on February 27, 2026, Cirrus360 and Vodafone showcased an innovative AI Reasoning-powered Declarative Digital Twin system. This platform streamlines real-time system analysis and anticipates potential test-induced failures. It offers valuable support to developers by automatically forecasting potential issues.",
            "link": "https://www.markets.news/headlines/cc372c42-4f29-4787-83c4-727910c1f3fd",
            "pub_date": "2026-02-27 20:09:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "513dbea7-61bf-4603-9927-6cd26a78a2a9",
            "description": "PAKISTAN MILITARY SPOKESPERSON: OPERATION IS CONTINUING ON THE DIRECTIONS OF THE PRIME MINISTER",
            "link": "https://www.markets.news/headlines/513dbea7-61bf-4603-9927-6cd26a78a2a9",
            "pub_date": "2026-02-27 20:10:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2cb0c94c-bd10-4ee2-81b9-1b19e1202531",
            "description": "KAZSKHSTAN: SEES OIL SHIPMENTS VIA CPC AT 65M TONS THIS YEAR",
            "link": "https://www.markets.news/headlines/2cb0c94c-bd10-4ee2-81b9-1b19e1202531",
            "pub_date": "2026-02-27 20:10:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ba11c148-e724-417f-8c47-8ad0f2f8c16b",
            "description": "KAZAKHSTAN: TO SHIP 1.7M TONS OIL VIA BAKU-TBILISI-CEYHAN IN '26",
            "link": "https://www.markets.news/headlines/ba11c148-e724-417f-8c47-8ad0f2f8c16b",
            "pub_date": "2026-02-27 20:10:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}