{
    "data": [
        {
            "title": "Prologis executives to present at Citi 2026 Global Property CEO Conference on March 2 at 11:00 a.m. ET.",
            "id": "1b6ab6d0-0c7a-4c1d-8403-99efb2252955",
            "description": "In San Francisco on February 26, 2026, Prologis, Inc. revealed that CEO Dan Letter and CFO Tim Arndt will be speaking at the Citi 2026 Global Property CEO Conference on March 2nd at 11:00 a.m. Eastern Time. Prologis is listed on NYSE under the ticker symbol PLD.",
            "link": "https://www.markets.news/headlines/1b6ab6d0-0c7a-4c1d-8403-99efb2252955",
            "pub_date": "2026-02-27 05:32:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Encompass Health (NYSE: EHC) will join Barclays Global Healthcare Conference on March 10-12, 2026 in Alabama. President & CEO Mark Tarr will attend.",
            "id": "123c1aae-8d14-4b5e-81cb-029102593f84",
            "description": "In Birmingham, Alabama, on February 26, 2026, Encompass Health Corp. (NYSE: EHC) revealed its upcoming involvement in the Barclays Global Healthcare Conference scheduled for March 10-12, 2026. Mark Tarr, the President and Chief Executive Officer of Encompass Health, along with the Executive Vice President, will be representing the company at the event.",
            "link": "https://www.markets.news/headlines/123c1aae-8d14-4b5e-81cb-029102593f84",
            "pub_date": "2026-02-27 05:32:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TXNM Energy Board declares $0.4225 per share dividend on common stock, payable on May 15, 2026.",
            "id": "9f90b9e8-6326-4b6c-a7e3-346f1ee10fe7",
            "description": "A regular meeting was held in Albuquerque, N.M. today by the Board of Directors of TXNM Energy, Inc. (NYSE: TXNM). They declared a quarterly dividend of $0.4225 per share for the company's common stock. Shareholders of record as of May 15, 2026, will be eligible to receive this dividend.",
            "link": "https://www.markets.news/headlines/9f90b9e8-6326-4b6c-a7e3-346f1ee10fe7",
            "pub_date": "2026-02-27 05:32:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novavax (Nasdaq: NVAX) to participate in TD Cowen 46th Annual Health Care Conference on March 3, 2026 at 2:30 p.m. ET.",
            "id": "22f20fcd-b59c-42ee-acc9-2c0511a2d9f5",
            "description": "Novavax, Inc. (Nasdaq: NVAX) of Gaithersburg, Maryland revealed its scheduled participation in investor conferences, including the TD Cowen 46th Annual Health Care Conference for a Fireside Chat on March 3, 2026, at 2:30 p.m. Eastern Time.",
            "link": "https://www.markets.news/headlines/22f20fcd-b59c-42ee-acc9-2c0511a2d9f5",
            "pub_date": "2026-02-27 05:32:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BNY priced public offering of $500M depositary shares representing interests in Preferred Stock.",
            "id": "0c5aa678-d42d-43f3-be10-9791569883ef",
            "description": "On February 26, 2026, The Bank of New York Mellon Corporation (BNY) disclosed the pricing details of its underwritten public offering. The offering consists of 500,000 depositary shares, with each share representing a 1/100th interest in a single share of BNY. This global financial services company is listed on the NYSE under the ticker symbol BK.",
            "link": "https://www.markets.news/headlines/0c5aa678-d42d-43f3-be10-9791569883ef",
            "pub_date": "2026-02-27 05:32:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "06f84e63-5763-44a3-ab90-77fd48eb4e21",
            "description": "HOUSE CHINA PANEL REPORTS CHINA TIES FOUND IN LATIN AMERICAN SPACE FACILITIES",
            "link": "https://www.markets.news/headlines/06f84e63-5763-44a3-ab90-77fd48eb4e21",
            "pub_date": "2026-02-27 05:34:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Progress Rail and Wabtec settle antitrust case; companies reach agreement, emphasizing benefits for both parties and consumers.",
            "id": "c4ba76a7-b9c7-4e79-ad5b-9017a3c5ccdd",
            "description": "Albertville, Alabama, and Pittsburgh - Progress Rail, a subsidiary of Caterpillar, and Wabtec Corporation (NYSE: WAB) have come to a mutual settlement in the case of Progress Rail v. Wabtec. The agreement, deemed advantageous for both entities, customers, and consumers, aims to avoid further legal proceedings that could be detrimental to all parties involved. Notably, no acknowledgment of fault is made. Both companies recognize their roles as providers of long-haul freight services.",
            "link": "https://www.markets.news/headlines/c4ba76a7-b9c7-4e79-ad5b-9017a3c5ccdd",
            "pub_date": "2026-02-27 05:35:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SolSource Solutions and TriBeam Financial launch Propel to simplify TPO solutions for residential solar and battery financing.",
            "id": "cc4b3260-aee2-416a-b2ef-52570135fe41",
            "description": "In Miami, SolSource Solutions and TriBeam Financial have unveiled Propel, a new third-party ownership (TPO) product aiming to enhance the financing of residential solar and battery systems. The collaboration merges SolSource's expertise in residential solar and storage finance with TriBeam's technology platform connecting sales channels to capital providers. Propel sets out to streamline the process, making it more transparent and accessible to consumers. This initiative represents a fresh approach to residential solar financing, proffering a user-friendly solution to leverage solar power efficiently.",
            "link": "https://www.markets.news/headlines/cc4b3260-aee2-416a-b2ef-52570135fe41",
            "pub_date": "2026-02-27 05:35:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Accelerant Holdings (NYSE: ARX) reports unaudited 2025 financial results in Atlanta, showing Q4 and full year highlights.",
            "id": "420d46cf-ae43-49a3-ba9f-bf8b2130b71c",
            "description": "Accelerant Holdings disclosed initial unaudited financial results for the fourth quarter and full year concluding on December 31, 2025. These figures are subject to change pending final audit. Accelerant Holdings trades on the New York Stock Exchange under the ticker symbol ARX.",
            "link": "https://www.markets.news/headlines/420d46cf-ae43-49a3-ba9f-bf8b2130b71c",
            "pub_date": "2026-02-27 05:35:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amplify Desmos Math program earns all-green rating from EdReports across all gateways.",
            "id": "b39c8386-50a9-4141-8cdd-c566e08b7ef7",
            "description": "Amplify's Desmos Math program, which is supported by research and focused on nurturing curiosity, has achieved top scores in all three key evaluation areas by EdReport. The program received the highest rating in all metrics, signifying its exceptional quality. This announcement was made by Amplify, a company known for creating innovative educational programs. The success of Amplify Desmos Math highlights its effectiveness and validation, further solidifying its reputation as a leading math program.",
            "link": "https://www.markets.news/headlines/b39c8386-50a9-4141-8cdd-c566e08b7ef7",
            "pub_date": "2026-02-27 05:28:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell stock surged after beating Q4 earnings: $3.89 per share (10%) and $33.38 billion revenue, up 19% for 2026.",
            "id": "15e60a32-26bc-43a1-b03a-230d7230ce86",
            "description": "Shares of Dell Technologies, Inc. (NYSE: DELL) saw a significant boost in after-hours trading on Thursday following the release of its fourth-quarter earnings report, which outperformed expectations across the board. The report revealed quarterly earnings of $3.89 per share, surpassing the consensus estimate of $3.53 by more than 10%. Additionally, quarterly revenue reached $33.38 billion, exceeding the Street estimate of $31.73 billion and showing growth from $23.93 billion in the same period last year. Dell's fiscal 2026 highlights included record full-year revenue of $113.5 billion, marking a 19% increase year-over-year, and record full-year diluted earnings per share (EPS) of $8.68, up 36% year-over-year. For more details, the complete story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/15e60a32-26bc-43a1-b03a-230d7230ce86",
            "pub_date": "2026-02-27 05:28:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1b4746bb-9c22-4136-96b4-ba3c6744765f",
            "description": "OIL SWINGS AS MIXED SIGNALS FROM US-IRAN TALKS OFFSET GEOPOLITICAL RISKS, WITH WTI SETTLING AT $65.21 AND BRENT AT $70.75, WHILE TRADERS SHIFT FOCUS TO THE UPCOMING OPEC+ SUPPLY DECISION AMID SIGNS OF MARKET SOFTNESS.",
            "link": "https://www.markets.news/headlines/1b4746bb-9c22-4136-96b4-ba3c6744765f",
            "pub_date": "2026-02-27 05:28:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US legislators introduce bill to shield blockchain developers from legal action. The Promoting Innovation in Blockchain Development Act aims to prevent prosecution.",
            "id": "c2327c19-f0ad-4f5d-adf3-45816f95db56",
            "description": "Congress is considering the Promoting Innovation in Blockchain Development Act, which is backed by the industry. This act aims to address the issue of criminalizing the writing of code. It has gained widespread support and could potentially be a significant solution to this problem. The act is seen as a proactive step in protecting developers from legal repercussions and promoting innovation in blockchain technology. With the number of supporters increasing, it is becoming increasingly likely that this act will be passed.",
            "link": "https://www.markets.news/headlines/c2327c19-f0ad-4f5d-adf3-45816f95db56",
            "pub_date": "2026-02-27 05:29:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Encord secures $60M Series C funding to scale AI data infrastructure as physical AI grows.",
            "id": "d39da945-37a1-4a02-9c67-e90d4b36e2ef",
            "description": "Encord has announced the successful completion of their $60 million Series C funding round to enhance their AI-native data infrastructure. This funding will help them scale up as demand for physical AI technologies reaches a turning point. The corrected news release clarifies the details surrounding the investment and its strategic importance for Encord's expansion in the market.",
            "link": "https://www.markets.news/headlines/d39da945-37a1-4a02-9c67-e90d4b36e2ef",
            "pub_date": "2026-02-27 05:30:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Matador Resources priced a $750 million offering of 6.000% senior unsecured notes due 2034 at 100% face value.",
            "id": "581e4ef1-a537-4800-b1b4-25b526a852f2",
            "description": "Matador Resources Company (NYSE: MTDR) has disclosed the pricing of a private offering of $750 million in 6.000% senior unsecured notes due 2034 (the “New Notes”) at 100% of their face value. The offering is anticipated to be finalized by March 5, 2026, pending customary closing conditions. Matador plans to utilize the net proceeds from the offering to repurchase any or all of the existing $500 million outstanding aggregate principal.",
            "link": "https://www.markets.news/headlines/581e4ef1-a537-4800-b1b4-25b526a852f2",
            "pub_date": "2026-02-27 05:30:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Senators criticize FTX founder for backing crypto bill; bipartisan opposition to Sam Bankman-Fried's support for Clarity Act.",
            "id": "abe94452-ae3a-4fa6-b389-8e2be900add5",
            "description": "Senators from both the Republican and Democrat parties united in opposition to the endorsement of the Clarity Act crypto bill by Sam Bankman-Fried, the incarcerated founder of FTX. Their collective pushback highlights a growing concern within the government over the proposed legislation, as more lawmakers express reservations about its implications for the cryptocurrency industry. This bipartisan resistance underscores the need for further discussion and analysis of the bill's potential impact.",
            "link": "https://www.markets.news/headlines/abe94452-ae3a-4fa6-b389-8e2be900add5",
            "pub_date": "2026-02-27 05:30:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nexa Res (NYSE: NEXA) beats Q4 earnings estimate by 5.26%, reports $0.60 EPS vs. $0.57 estimate. Revenue up $162 million YoY.",
            "id": "e55973ca-e87e-4956-80ac-27b6f5b578d2",
            "description": "Nexa Res (NYSE: NEXA) revealed its Q4 earnings on February 26, 2026, at 04:00 PM. The earnings report indicates that Nexa Res exceeded estimated earnings by 5.26%, posting an EPS of $0.6 compared to the estimated $0.57. Revenue showed a significant increase of $162.00 million from the previous year. In the prior quarter, Nexa Res fell short on EPS. For a detailed account, refer to the full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/e55973ca-e87e-4956-80ac-27b6f5b578d2",
            "pub_date": "2026-02-27 05:30:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Boardwalktech reported Q3-FY26 financial results with $1 million revenue, $3.8 million ARR, 86.9% gross margin, and $(0.4) million net loss, showing improvements in adjusted EBITDA.",
            "id": "cf42047d-d38b-4749-a9d3-33f049c51e3d",
            "description": "Boardwalktech Software Corp. reported financial results for the three-month period ended December 31, 2025. Revenues for Q3-FY26 were $1 million, unchanged from the previous quarter but a 25% decrease from Q3-FY25. Annual Recurring Revenue at December 31, 2025, was $3.8 million. Gross margin for Q3-FY26 was 86.9%, with Adjusted EBITDA at a loss of $(0.2) million, showing improvement from previous quarters. Net loss for Q3-FY26 was $(0.4) million. SG&A expenses in Q3-FY26 totaled $1.1 million, showing a decrease from the previous quarters. The Company continues to recognize savings from cost alignment efforts. Non-IFRS net loss for Q3 Fiscal 2026 was also reported. The full story is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/cf42047d-d38b-4749-a9d3-33f049c51e3d",
            "pub_date": "2026-02-27 05:30:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Intchains Group Limited reported Q4 2025 revenue of RMB36.1M with a loss of RMB130.7M. Full-year 2025 revenue was RMB220.9M with a loss of RMB52.0M. Cash position as of Dec 31, 2025, was RMB473.8M. Intchains aims to focus on altcoin mining products, cost optimization, ETH accumulation, staking, and aims to mitigate impacts of new regulations.",
            "id": "a608c1c7-bf52-452c-bd2d-4985db99c072",
            "description": "The Intchains Group Limited, a company focusing on altcoin mining products and Ethereum staking, announced its unaudited financial results for Q4 2025 and FY 2025. In Q4 2025, revenue was RMB36.1 million (US$5.2 million), with a loss from operations of RMB83.7 million (US$12.0 million) and net loss of RMB130.7 million (US$18.7 million). For FY 2025, revenue was RMB220.9 million (US$31.6 million), with a loss from operations of RMB104.7 million (US$15.0 million) and net loss of RMB52.0 million (US$7.4 million). The company's cash position was RMB473.8 million (US$67.8 million) as of Dec 31, 2025. Intchains launched Goldshell Stake, a PoS platform, focusing on altcoin mining machines sale and Ethereum accumulation. They have acquired a PoS platform for $1.3 million and plan to introduce new altcoin mining products in 2026. Intchains continued ETH accumulation and staking activities, with 9,070 ETH held as of Feb 23, 2026. The company's long-term strategy involves expanding overseas sales channels given regulatory changes in China, ensuring minimal impact on operations. For further details, a conference call discussing the financial results is scheduled for Feb 26, 2026. Non-GAAP adjusted net loss was RMB128.5 million (US$18.4 million) for Q4 2025 and RMB43.4 million (US$6.2 million) for FY 2025. In terms of assets, the company had total assets of RMB1,015,391 thousand (US$145,198 thousand) as of Dec 31, 2025.",
            "link": "https://www.markets.news/headlines/a608c1c7-bf52-452c-bd2d-4985db99c072",
            "pub_date": "2026-02-27 05:30:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Seer Q4 earnings exceed estimates with EPS of $-0.29 vs $-0.34, revenue up $201k YoY. Full details on Benzinga.com.",
            "id": "cfed9c0b-bfff-4efe-99bf-fc5f0b010fd9",
            "description": "SEER (NASDAQ: SEER) released its Q4 earnings on February 26, 2026, at 04:05 PM. The report revealed an earnings surprise, surpassing estimates by 14.71% with an EPS of $-0.29 compared to the expected $-0.34. Revenue saw a $201 thousand increase from the previous year. In the previous earnings period, SEER fell short on EPS expectations. For further details, the complete article can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/cfed9c0b-bfff-4efe-99bf-fc5f0b010fd9",
            "pub_date": "2026-02-27 05:21:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}