{
    "data": [
        {
            "title": "Lohman Technologies appoints 2 industry leaders to drive AI-enabled remote cardiac innovation. Board expansion aims to accelerate commercialization pipeline. Dr. Daniel DeBehnke & Peter E. Aftosmes join Board of Directors.",
            "id": "0982e484-7ebb-41bb-a852-3ac23e1bbc59",
            "description": "Lohman Technologies has recently welcomed Dr. Daniel DeBehnke and Peter E. Aftosmes to its Board of Directors in an effort to speed up their commercialization pipeline for explainable AI and scalable RPM partnerships. This move comes as the company aims to expand its reach and enhance its capabilities. The board expansion is expected to bring valuable expertise and strategic guidance to the company as it continues to grow.",
            "link": "https://www.markets.news/headlines/0982e484-7ebb-41bb-a852-3ac23e1bbc59",
            "pub_date": "2026-02-27 01:57:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c1c94b9b-d0e0-4cf2-89c6-de286a2b7538",
            "description": "TRUMP’S IRAN STRIKE PLAN SEEN AS SYMBOLIC The Trump administration is weighing targeted strikes on Iran’s nuclear and missile sites, but objectives remain unclear. Officials say the immediate goal is to damage Iran’s capabilities, while a broader aim may be to force Tehran to",
            "link": "https://www.markets.news/headlines/c1c94b9b-d0e0-4cf2-89c6-de286a2b7538",
            "pub_date": "2026-02-27 01:57:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4eed463e-f274-4a9a-b8cd-e1afb7ddcf70",
            "description": "Geopolitics keeps blowing up longer-term trades. Tariff views shifted. Election-driven FX moves reversed at key levels. In this tape, you trade the level, take profits, and stay nimble.",
            "link": "https://www.markets.news/headlines/4eed463e-f274-4a9a-b8cd-e1afb7ddcf70",
            "pub_date": "2026-02-27 01:58:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9fe17461-3d29-4a1a-9db1-e09d0e13a288",
            "description": "Treasury WI 7-year yield 3.790% before $44 billion auction.",
            "link": "https://www.markets.news/headlines/9fe17461-3d29-4a1a-9db1-e09d0e13a288",
            "pub_date": "2026-02-27 02:00:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ROC Orthopedics and Dr. Mark Wagner win Silver Award for Best Orthopedics in 2025 Best of the Rose City, Portland.",
            "id": "095fc191-1c88-4cda-898f-3f0604f7fc8f",
            "description": "Portland, Oregon on February 26, 2026 - ROC Orthopedics in Portland has received the Silver Award for Best Orthopedics in the 2025 Best of the Rose City awards. This recognition underscores the community's acknowledgment of the quality and patient-centered care offered by the orthopedic center. The award highlights the dedication of ROC Orthopedics in providing trusted orthopedic services in Portland.",
            "link": "https://www.markets.news/headlines/095fc191-1c88-4cda-898f-3f0604f7fc8f",
            "pub_date": "2026-02-27 01:51:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Krispy Kreme (NASDAQ: DNUT) beats profit expectations, shares rise as it reports Q4 EPS of 9 cents (>3 cents est) with sales of $392.367M (> $386.715M est). Company focuses on expansion and cash generation.",
            "id": "3af3da04-1132-49b4-9a32-263e9042fd66",
            "description": "Shares of Krispy Kreme, Inc. (NASDAQ: DNUT) climbed on Thursday following the company's strong financial performance. The popular doughnut chain exceeded profit expectations and surpassed Wall Street's sales forecast. Investors were impressed by the company's efforts in optimizing its store presence and plans to expand distribution, while also focusing on improving cash generation. Krispy Kreme's stock has emerged as one of the top performers of the day. In the fourth quarter, the company reported adjusted earnings per share of nine cents, beating the estimated three cents. Quarterly sales totaled $392.367 million, higher than the expected $386.715 million. Despite a 3.9% decrease in organic revenue, attributed to the strategic closure of underperforming locations, Krispy Kreme's performance has left a positive impact.",
            "link": "https://www.markets.news/headlines/3af3da04-1132-49b4-9a32-263e9042fd66",
            "pub_date": "2026-02-27 01:51:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Baidu reported Q4 2025 revenue of RMB 26.1 billion, with AI Cloud Infra revenue up 34% year-over-year, and Apollo Go providing over 20 million rides.",
            "id": "e0884b7f-6fa7-4125-be5f-c01ff72de9a1",
            "description": "Baidu, Inc. reported its fourth-quarter and fiscal year earnings in 2025 with total revenue in Q4 reaching RMB 26.1 billion. Revenue from the core AI-powered business exceeded RMB 11 billion, representing 43% of the total revenue. Apollo Go, their autonomous ride-hailing service, provided 3.4 million fully driverless rides in the quarter with total rides increasing by over 200% year over year. Revenue from AI Cloud Infra reached around RMB 20 billion, up 34% year over year. Revenue from AI applications surpassed RMB 10 billion in 2025. They announced the proposed spin-off and separate listing of Kunlunxing, their self-developed AI chips. The AI accelerator infrastructure saw a 143% year-over-year growth in subscription-based revenue. Apollo Go expanded its services to new cities globally, reaching a total of 26 cities by February 2026. In Q4, they were testing autonomous vehicles in London, and Abu Dhabi and Dubai as part of their global expansion plans. They also announced a partnership with Uber to bring autonomous ride-hailing services to Dubai. Baidu is focusing on safety, aiming to enhance operational excellence and unit economics while ensuring safety standards are met. With AI integrated across their portfolio, they aim to transform mobility for billions of people globally.",
            "link": "https://www.markets.news/headlines/e0884b7f-6fa7-4125-be5f-c01ff72de9a1",
            "pub_date": "2026-02-27 01:51:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Orion introduces Denali AI Enterprise version with Report Assistant and Query Studio, enhancing advisor productivity. #Orion #AI #Advisors",
            "id": "ee1b3cd2-7c9c-485a-9e57-3af9f14bbd23",
            "description": "Orion, based in Omaha, Nebraska, has reached a significant development in its AI platform strategy at Ascent 2026 by launching the enterprise version of Orion Denali AI. This version is currently live, and there are plans to expand availability later this year to provide the integrated AI experience to advisors and firms of various sizes. In addition to this launch, Orion has introduced two new AI Assistants, namely the Report Assistant and Query Studio. These advancements align with Orion's ongoing leadership in the industry and its momentum in AI technology. This announcement comes after the recent introduction of the AI platform.",
            "link": "https://www.markets.news/headlines/ee1b3cd2-7c9c-485a-9e57-3af9f14bbd23",
            "pub_date": "2026-02-27 01:52:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AHF sues Florida over emergency rule cutting AIDS drugs to 16,000. Action filed to challenge validity, protect public health.",
            "id": "c569daec-934d-4839-9466-b013c13da76a",
            "description": "In Tallahassee, Florida, AIDS Healthcare Foundation (AHF) has taken action by filing an administrative challenge against a recent emergency rule implemented by the Florida Department of Health. This move comes ahead of a scheduled hearing with State Administrative Law Judge W. David Watkins. The Department of Health has utilized emergency powers to safeguard public health, but the consequence has led to 16,000 individuals in Florida being denied access to their HIV medications. This legal dispute has emerged on the brink of a court hearing.",
            "link": "https://www.markets.news/headlines/c569daec-934d-4839-9466-b013c13da76a",
            "pub_date": "2026-02-27 01:52:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tungsten prices have surged fivefold in the past year due to underinvestment and Chinese export restrictions.",
            "id": "1d6573d5-301a-4826-b2ee-1ee5d3f87f8f",
            "description": "GoldHaven Resources Corp. announced in Vancouver, BC on Feb. 26, 2026 that Tungsten prices have increased significantly over the last year, experiencing a fivefold surge. This rise in prices can be attributed to prolonged underinvestment in the industry and a reduction in Chinese exports, leading to market tightness. Analysts at BMO have warned about the potential implications of this trend.",
            "link": "https://www.markets.news/headlines/1d6573d5-301a-4826-b2ee-1ee5d3f87f8f",
            "pub_date": "2026-02-27 01:53:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cerecin's study on CER-0001 for rare pediatric epilepsy shows seizure reduction in infants, well-tolerated. Promising results for metabolic therapy.",
            "id": "6e6f0ce8-0c4f-429e-ba65-ab58dfb60211",
            "description": "Research findings indicate that the new ketogenic drug showed favorable tolerability and exhibited a decrease in seizures among infants with uncommon drug-resistant epileptic spasms. The Phase 1/2a study suggests potential advancement of this medication as a metabolic treatment for rare developmental and epileptic disorders.",
            "link": "https://www.markets.news/headlines/6e6f0ce8-0c4f-429e-ba65-ab58dfb60211",
            "pub_date": "2026-02-27 01:53:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trive Capital buys Rolfson Oil and Flint Logistics Group in Oklahoma City for an undisclosed amount.",
            "id": "26b5b197-5fc7-44bc-81b3-dede61c3bfce",
            "description": "On February 26, 2026, Trive Capital, a private equity firm headquartered in Dallas, Texas, revealed their recent investment in Rolfson Oil, a prominent company specializing in distributing fuel, oils, and lubricants to the energy industry. This partnership signifies Trive's commitment to furthering Rolfson's growth and expansion.",
            "link": "https://www.markets.news/headlines/26b5b197-5fc7-44bc-81b3-dede61c3bfce",
            "pub_date": "2026-02-27 01:53:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "df359403-b32e-44ba-87da-81c9af0cf7b8",
            "description": "$NVDA - GOLDMAN: 'WHEN VERY GOOD IS APPARENTLY NOT SO GOOD' Goldman Sachs notes that despite NVIDIA’s 73% YoY revenue growth and bullish AI guidance, the stock fell 4.5%, dragging semis and the S&P 500 lower. Analysts cite “sell-the-news” moves, profit-taking, and concerns over",
            "link": "https://www.markets.news/headlines/df359403-b32e-44ba-87da-81c9af0cf7b8",
            "pub_date": "2026-02-27 01:53:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Topcon Agriculture expands Precision Ag Solved territory to Western Canada, covering provinces of BC, Alberta, Saskatchewan, and Manitoba.",
            "id": "64b12d32-8ee6-436f-8874-8c2f486e23c6",
            "description": "Topcon Agriculture has revealed that Precision Ag Solved (PAS) will now be extending its reach into Western Canada, serving as the primary distributor of Topcon’s precision agriculture products. PAS, which has experienced steady expansion, will now cater to the provinces of British Columbia, Alberta, Saskatchewan, and Manitoba. The move comes after a similar expansion into the western region of the U.S. PAS aims to enhance accessibility to Topcon's precision agriculture solutions in these Canadian provinces.",
            "link": "https://www.markets.news/headlines/64b12d32-8ee6-436f-8874-8c2f486e23c6",
            "pub_date": "2026-02-27 01:55:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9f3291b9-155e-467b-a029-b93a15ee6b21",
            "description": "UK'S INTELLIGENCE AND SECURITY COMMITTEE: MATERIAL CURRENTLY BEING RECEIVED BY CABINET OFFICE FROM ACROSS GOVERNMENT, IT IS HOPED SOME MATERIAL WILL BE PUBLISHED SHORTLY",
            "link": "https://www.markets.news/headlines/9f3291b9-155e-467b-a029-b93a15ee6b21",
            "pub_date": "2026-02-27 01:42:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1c138731-9a88-4501-bfba-d006254bc399",
            "description": "UK'S INTELLIGENCE AND SECURITY COMMITTEE ON RELEASE OF DOCUMENTS RELATING TO APPOINTMENT OF MANDELSON: GOVERNMENT HAS AGREED FRAMEWORK WITH METROPOLITAN POLICE SERVICE ON WHICH DOCUMENTS CAN BE RELEASED",
            "link": "https://www.markets.news/headlines/1c138731-9a88-4501-bfba-d006254bc399",
            "pub_date": "2026-02-27 01:42:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Greenberg Traurig wins first jury verdict in Texas Business Court for investor in breach of contract suit.",
            "id": "d1d8e195-f3d0-4d2c-b0ba-d5f2bb6f884c",
            "description": "In a groundbreaking milestone for the recently established Texas Business Court, a group of Greenberg Traurig, LLP lawyers from Texas achieved a significant success on February 20, 2026. The jury delivered a favorable verdict for clients Albert Theodore \"Ted\" Powers and his company Allied Ports, LLC. This victory marks the first-ever jury decision within the newly created court, showcasing the prowess of the legal team. This win solidifies Powers and Allied Ports' position in a high-stakes legal battle. The outcome underscores the skill and dedication of the Texas-based Greenberg Traurig, LLP attorneys, highlighting their expertise in navigating complex business litigation. This historic achievement emphasizes the importance of legal representation and the impact it can have on businesses facing judicial challenges.",
            "link": "https://www.markets.news/headlines/d1d8e195-f3d0-4d2c-b0ba-d5f2bb6f884c",
            "pub_date": "2026-02-27 01:42:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3ca3fc0d-3d71-4cb4-9380-c796d6f21883",
            "description": "Afghanistan spokesperson: ‘The number of positions captured from the enemy has reached 15; dozens of Pakistani soldiers have been killed, and a number of them have also been taken alive.’",
            "link": "https://www.markets.news/headlines/3ca3fc0d-3d71-4cb4-9380-c796d6f21883",
            "pub_date": "2026-02-27 01:43:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2dbc033b-93dc-43f2-805c-491da4e220ad",
            "description": "Schumer: our working group of Senator Democratics will go and see all the files unredacted",
            "link": "https://www.markets.news/headlines/2dbc033b-93dc-43f2-805c-491da4e220ad",
            "pub_date": "2026-02-27 01:43:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global Mofy AI Limited's Mofy VFX aids iQIYI's show with VFX production. Nasdaq: GMM. Series: The Devil Between Us.",
            "id": "ccc7722f-3609-4dcb-a565-06da654f49d1",
            "description": "Beijing, Feb. 26, 2026 - Global Mofy AI Limited (Nasdaq: GMM), a leading generative AI-driven technology solutions provider focusing on virtual content production and 3D digital assets development, revealed that their visual effects division, Mofy VFX, has delivered VFX production services for the 16-episode crime drama series, The Devil Between Us in recent news.",
            "link": "https://www.markets.news/headlines/ccc7722f-3609-4dcb-a565-06da654f49d1",
            "pub_date": "2026-02-27 01:44:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}