{
    "data": [
        {
            "title": "",
            "id": "90af52f5-04b1-44c0-97e2-d9efc06adb34",
            "description": "Article on disclosure notices about a company's stake ownership reaching the 5% threshold.",
            "link": "https://www.markets.news/headlines/90af52f5-04b1-44c0-97e2-d9efc06adb34",
            "pub_date": "2026-02-28 05:32:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Frontline plc announces Ørjan Svanevik's resignation as Director. Board thanks him for his contribution.",
            "id": "bf9cad68-e5b7-4d56-adf6-793687bd7ea0",
            "description": "Frontline plc has announced the resignation of Mr. Ørjan Svanevik as Director of the Company. The Board expresses gratitude for his significant contributions during his tenure.",
            "link": "https://www.markets.news/headlines/bf9cad68-e5b7-4d56-adf6-793687bd7ea0",
            "pub_date": "2026-02-28 05:32:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "XTL Biopharmaceuticals Ltd. received Nasdaq delist determination as a \"public shell\"; plans to request hearing.",
            "id": "e09f91e6-9b3f-44e9-af4a-5b26d70a30f0",
            "description": "In Ramat Gan, Israel, on February 27, 2026, XTL Biopharmaceuticals Ltd. (Nasdaq: XTLB) (TASE: XTLB.TA) disclosed receiving a letter on February 25, 2026, from The Nasdaq Stock Market LLC's Listing Qualifications Department. The communication stated that the Company is deemed a \"public shell\" as per Nasdaq Listing Rule 5101, casting doubts on the continued validity of the listing for XTL's American Depositary Shares (ADSs). To challenge this assessment, XTL plans to request a hearing with a Nasdaq Hearings Panel. During this appeal process, the suspension and delisting of the ADSs will be put on hold pending the Panel’s decision.",
            "link": "https://www.markets.news/headlines/e09f91e6-9b3f-44e9-af4a-5b26d70a30f0",
            "pub_date": "2026-02-28 05:32:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chart Industries (NYSE: GTLS) disclosed Q4 & full year 2025 financial results as of Dec 31st. ",
            "id": "b62a7fd4-3129-4f2d-ac2b-d8c00713b5b1",
            "description": "On February 27, 2026, in Houston, Chart Industries, Inc. (NYSE: GTLS) announced its financial results for the fourth quarter and the entire year ending on December 31, 2025.",
            "link": "https://www.markets.news/headlines/b62a7fd4-3129-4f2d-ac2b-d8c00713b5b1",
            "pub_date": "2026-02-28 05:32:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8e3cc756-322e-4d24-bd10-831c4c7fb5bb",
            "description": "TRUMP ON IRAN STRIKE IMPACT ON OIL PRICES: NOT CONCERNED",
            "link": "https://www.markets.news/headlines/8e3cc756-322e-4d24-bd10-831c4c7fb5bb",
            "pub_date": "2026-02-28 05:32:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MTL Cannabis Corp. releases Q3 results, files financial statements for periods ending Dec 31, 2025 and 2024. ",
            "id": "f9d74d64-7651-4069-aafa-8b2f7f7559a7",
            "description": "In Pickering, Ontario, on February 27, 2026, MTL Cannabis Corp. (CSE: MTLC) (OTCQX: MTLNF) announced that it has submitted its financial statements for the three-month and nine-month periods concluding on December 31 of 2025 and 2024. These documents are available for review on the Company's SEDAR+ profile at www.sedarplus.ca. For more information, the complete news story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/f9d74d64-7651-4069-aafa-8b2f7f7559a7",
            "pub_date": "2026-02-28 05:33:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sable Offshore (NYSE: SOC) Q4 earnings beat estimates by 33.9% with EPS of $-0.39. Revenue remained unchanged.",
            "id": "671c97a2-9552-4045-89de-5517f2ced641",
            "description": "Sable Offshore (NYSE: SOC) unveiled its Q4 financial results on February 27, 2026, at 01:00 AM. The earnings report highlighted significant details. Sable Offshore surpassed earnings expectations by 33.9%, posting an EPS of $-0.39 compared to the estimated $-0.59. Revenue remained unchanged from the previous year. In the prior quarter, the company fell short on earnings. For further details, the complete article is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/671c97a2-9552-4045-89de-5517f2ced641",
            "pub_date": "2026-02-28 05:33:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AMTD Digital reports significant financial growth: 565.7% increase in revenue, 132.7% increase in net income, and 280.2% increase in net assets.",
            "id": "7913b984-40b7-4259-8144-0f33ee1a696f",
            "description": "On February 27, 2026, AMTD Digital Inc. (NYSE: HKD), a subsidiary of AMTD Group Inc., disclosed the submission of its annual report for the fiscal year ended October 31, 2025, to the Securities and Exchange Commission. The report encompasses the financial outcomes of The Generation Essentials Group (TGE) listed on NYSE and LSE. Key points include a significant surge in Total Revenue by 565.7% from US$20.4 million to US$136.1 million, and a 132.7% rise in Total Net Income. For more detailed information, the full story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/7913b984-40b7-4259-8144-0f33ee1a696f",
            "pub_date": "2026-02-28 05:33:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is SOL undervalued despite being 72% below its ATH? Resilient data suggests a compelling investment opportunity. #Solana",
            "id": "49a60f3c-791a-4bfa-92a9-a22859a2966d",
            "description": "The price of SOL has decreased by 72% from its peak value, raising questions about its investment potential. However, various data points suggest an attractive opportunity may be emerging. Is SOL currently being traded at a significant markdown?",
            "link": "https://www.markets.news/headlines/49a60f3c-791a-4bfa-92a9-a22859a2966d",
            "pub_date": "2026-02-28 05:33:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Federated Hermes, Inc. files Form 10-K for FY 2025 with SEC, a global leader in active investing (NYSE: FHI).",
            "id": "2d9dea7d-374a-4042-8074-1869ccc43a67",
            "description": "In Pittsburgh on February 27, 2026, Federated Hermes, Inc., a prominent figure in active investing worldwide, submitted its yearly report on Form 10-K to the U.S. Securities and Exchange Commission for the fiscal period concluding on December 31, 2025. Federated Hermes provided comprehensive details on its financial performance and operations during this time.",
            "link": "https://www.markets.news/headlines/2d9dea7d-374a-4042-8074-1869ccc43a67",
            "pub_date": "2026-02-28 05:35:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Neuberger Next Generation Connectivity Fund (NYSE: NBXG) declares $0.12/share distribution, payable on Mar 31, 2026.",
            "id": "dde7b805-6a09-42ef-870c-e3d1ced994e2",
            "description": "On February 27, 2026, Neuberger Next Generation Connectivity Fund Inc. (NYSE: NBXG) disclosed a distribution declaration of $0.12 per common stock share. This distribution will be paid on March 31, 2026, with a record date of March 16.",
            "link": "https://www.markets.news/headlines/dde7b805-6a09-42ef-870c-e3d1ced994e2",
            "pub_date": "2026-02-28 05:31:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Women entrepreneurs celebrated 3rd Anniversary of NYTS HERstory Unveiled in Times Square on International Women's Day.",
            "id": "becfbd8c-8a86-407e-8548-11ab4d36ceae",
            "description": "Entrepreneur Sharon Ringier commemorates the 3rd Anniversary of the NYTS HERstory Unveiled Billboard Experience in Times Square on International Women's Day. The event highlights women entrepreneurs and their leadership, providing a platform for visibility.",
            "link": "https://www.markets.news/headlines/becfbd8c-8a86-407e-8548-11ab4d36ceae",
            "pub_date": "2026-02-28 05:31:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Neuberger High Yield Strategies Fund (NYSE: NHS) declares $0.0905 per share distribution, payable on March 31, 2026.",
            "id": "f6015060-18d1-4506-a9a3-2b4e4182c790",
            "description": "On February 27, 2026, Neuberger High Yield Strategies Fund Inc. disclosed a distribution declaration of $0.0905 per common stock share (NYSE American: NHS). The payment is set for March 31, 2026, with a record date of March 16...",
            "link": "https://www.markets.news/headlines/f6015060-18d1-4506-a9a3-2b4e4182c790",
            "pub_date": "2026-02-28 05:31:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "In 2026, FDA waives fees for Innocan Pharma Corp for the third time. Company focused on pharmaceuticals.",
            "id": "ad189168-29c0-4ce3-b838-e6a9cc2dd054",
            "description": "Innocan Pharma Corporation, a leading company in the pharmaceutical and biotechnology sectors, recently disclosed exciting news. On February 27, 2026, they revealed that the FDA's Center for Veterinary has granted them a special authorization. Based in Herzliya, Israel, and Calgary, AB, Innocan operates under the ticker symbols CSE: INNO, FSE: IP40, and OTCQB: INNPD. This recognition marks a significant milestone for the innovative company, demonstrating its commitment to excellence and advancement in the field.",
            "link": "https://www.markets.news/headlines/ad189168-29c0-4ce3-b838-e6a9cc2dd054",
            "pub_date": "2026-02-28 05:31:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Neuberger Real Estate Securities Income Fund declares $0.0312/share distribution payable on March 31, 2026.",
            "id": "669dcb7d-ec04-4c7d-9fb3-843be8cab59e",
            "description": "On February 27, 2026, Neuberger Real Estate Securities Income Fund Inc. revealed that they declared a distribution of $0.0312 for each share of common stock. This distribution will be paid on March 31, 2026, with a record date that is yet to be announced.",
            "link": "https://www.markets.news/headlines/669dcb7d-ec04-4c7d-9fb3-843be8cab59e",
            "pub_date": "2026-02-28 05:31:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Elong Power Holding Limited closes US$7.0 million public offering for battery tech for energy vehicles and storage systems.",
            "id": "98f04e32-d9c7-432b-9ca2-a186b9490334",
            "description": "In Beijing on February 27, 2026, Elong Power Holding Limited (NASDAQ: ELPW), a company specializing in high-power battery technologies for commercial and specialty alternative energy vehicles and energy storage systems, revealed the completion of its latest transaction.",
            "link": "https://www.markets.news/headlines/98f04e32-d9c7-432b-9ca2-a186b9490334",
            "pub_date": "2026-02-28 05:31:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SOLAI Limited (NYSE: SLAI) receives continued listing notice from NYSE on Jan 29, 2026, announces changes in the board of directors.",
            "id": "f8149bff-99aa-41d1-af64-ee8f9d409958",
            "description": "In Akron, Ohio on February 27, 2026, SOLAI Limited (NYSE: SLAI) formerly known as \"BTCM,\" a prominent technology-focused cryptocurrency infrastructure firm, revealed that on January 29, 2026, they were informed by the New York Stock Exchange.",
            "link": "https://www.markets.news/headlines/f8149bff-99aa-41d1-af64-ee8f9d409958",
            "pub_date": "2026-02-28 05:31:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Quaker Houghton (NYSE: KWR) declares a $0.508 quarterly dividend, payable on April 30, 2026 to shareholders of record on April 16.",
            "id": "7aab12d6-8e9c-48d5-aade-cb4f7eccb4c8",
            "description": "On February 27, 2026, in Conshohocken, Pennsylvania, Quaker Houghton's Board of Directors announced a quarterly cash dividend of $0.508 per share. This dividend will be paid on April 30, 2026, to shareholders who are recorded as such by the end of business on April 16, 2026. Quaker Houghton, traded on the NYSE under the symbol KWR, is a reputable company known for...",
            "link": "https://www.markets.news/headlines/7aab12d6-8e9c-48d5-aade-cb4f7eccb4c8",
            "pub_date": "2026-02-28 05:31:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FMC Corp appoints Michael F. Barry to Board of Directors on Feb 27, 2026. He will serve on Audit and Compensation & Human.",
            "id": "5cbc27e5-3ad7-4307-856f-e65b6c349d42",
            "description": "In Philadelphia on February 27, 2026, FMC Corporation, a prominent global agricultural sciences enterprise, revealed the appointment of Michael F. Barry to its Board of Directors. This appointment, effective immediately, positions Barry to contribute to various aspects of the company, including serving on the Audit and Compensation and Human Relations committees. Barry’s addition to the board highlights FMC Corporation’s commitment to expanding its leadership team with notable expertise.",
            "link": "https://www.markets.news/headlines/5cbc27e5-3ad7-4307-856f-e65b6c349d42",
            "pub_date": "2026-02-28 05:31:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Alimentation Couche-Tard to report Q3 FY2026 results on March 17, 2026. TSX: ATD. Conference call scheduled after release.",
            "id": "94153268-3a2d-47a4-85ea-1d6447c30afa",
            "description": "In Laval, Quebec, on February 27, 2026, Alimentation Couche-Tard Inc. will announce its financial results for the third quarter of fiscal year 2026 on March 17, 2026, following the closure of the TSX. The Corporation (TSX: ATD) will hold a conference call to analyze these results, offering stakeholders an opportunity to delve into the figures.",
            "link": "https://www.markets.news/headlines/94153268-3a2d-47a4-85ea-1d6447c30afa",
            "pub_date": "2026-02-28 05:31:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}