{
    "data": [
        {
            "title": "Barbara Ann Karmanos Cancer Institute partners with WSU to offer three CrossFit sessions for cancer survivors in Michigan.",
            "id": "d66dc998-44f2-46f2-acfc-dcc4a6da580c",
            "description": "Registration has officially begun for the upcoming CAPABLE sessions taking place in Farmington Hills, Grand Blanc, and Detroit. These sessions will be held in Detroit on February 26, 2026. The Barbara Ann Karmanos Cancer Institute has teamed up with Wayne State University (WSU) School of Medicine as well as three athletic facilities to provide access to cancer services.",
            "link": "https://www.markets.news/headlines/d66dc998-44f2-46f2-acfc-dcc4a6da580c",
            "pub_date": "2026-02-26 19:13:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "022daf94-6a75-47a9-ab17-7396a95084e3",
            "description": "Israel MFA: ''Hamas’ Ministry of Social Development reports distributing $3 million to 19,306 widows of “martyrs,” meaning 19,306 MARRIED Hamas terrorists were killed. This, without counting UNMARRIED terrorists (likely a similar number), their own misfired rockets which",
            "link": "https://www.markets.news/headlines/022daf94-6a75-47a9-ab17-7396a95084e3",
            "pub_date": "2026-02-26 19:13:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gray Media's Q4 earnings: EPS $-0.24 missed estimates by -33.33%, Revenue down $253 million from last year.",
            "id": "53a898d6-abd0-46b1-954c-eae10ccf121b",
            "description": "Gray Media (NYSE: GTN) released its Q4 earnings report on February 26, 2026 at 06:00 AM. The company fell short of estimated earnings by -33.33%, posting an EPS of $-0.24 compared to the expected $-0.18. Revenue decreased by $253.00 million from the previous year. For a detailed analysis, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/53a898d6-abd0-46b1-954c-eae10ccf121b",
            "pub_date": "2026-02-26 19:14:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e5a34654-93ea-412c-856f-28488a7dfee5",
            "description": "HORMEL Q1 2026 EARNINGS: ADJ EPS 34C (EST 32C)  NET SALES USD 3.03B (EST USD 3.07B)  SEES FY EPS USD 1.37 TO USD 1.46 (EST USD 1.45)  STILL SEES FY NET SALES USD 12.28 TO USD 12.58 (EST USD 12.39B)",
            "link": "https://www.markets.news/headlines/e5a34654-93ea-412c-856f-28488a7dfee5",
            "pub_date": "2026-02-26 19:16:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c7739041-116a-4238-a12a-841bce457932",
            "description": "INDIA PM MODI: INDIA WILL CONTINUE TO CONSULT AND COOPERATE WITH ALL PARTNERS ON ESTABLISHING PEACE IN WEST ASIA",
            "link": "https://www.markets.news/headlines/c7739041-116a-4238-a12a-841bce457932",
            "pub_date": "2026-02-26 19:16:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c551df0d-e19c-426a-a735-74b0b73c3347",
            "description": "Lukashenko and Putin hold meeting",
            "link": "https://www.markets.news/headlines/c551df0d-e19c-426a-a735-74b0b73c3347",
            "pub_date": "2026-02-26 19:17:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trulieve's 2025 results: $1.2B revenue, 60% gross margin, $273M cash flow, 50.1M products sold, 11 dispensaries added. CEO optimistic for 2026.",
            "id": "32c9d6ee-e1b3-401e-b82b-bf8ef9a4c35d",
            "description": "Trulieve Cannabis Corp reported strong financial results for 2025, with a full-year revenue of $1.2 billion and a 60% gross margin. The company achieved record cash flow from operations of $273 million and free cash flow of $229 million in 2025. They sold a record 50.1 million branded product units, a 5% increase from the previous year. The company also reported a net loss attributable to common shareholders of $116 million. They closed a $140 million private placement of senior secured notes due 2030 and granted conditional approval for a Dispensing Organization license in Texas. Trulieve CEO, Kim Rivers, expressed optimism for 2026, focusing on expanded access, customer loyalty, branded products, and growth initiatives. The company operates 234 dispensaries and over four million square feet of cultivation and processing capacity in the U.S.",
            "link": "https://www.markets.news/headlines/32c9d6ee-e1b3-401e-b82b-bf8ef9a4c35d",
            "pub_date": "2026-02-26 19:17:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bouygues selects Buildots to monitor construction of 44,000 m² logistics platform in Val-d'Oise using AI.",
            "id": "753bb61d-31c0-44d8-a527-b13e97d21762",
            "description": "In Paris on February 26, 2026, Bouygues Bâtiment Industrie, a subsidiary of Bouygues Construction specializing in industrial projects, announced its partnership with Buildots, an AI-based construction progress monitoring tool. This collaboration will aid in the development of the P3 Persan project, covering an area of 44,000 square meters.",
            "link": "https://www.markets.news/headlines/753bb61d-31c0-44d8-a527-b13e97d21762",
            "pub_date": "2026-02-26 19:17:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bilt introduces Neighborhood Concierge service to handle various tasks for members in largest home network, rewarding millions monthly.",
            "id": "ad8a8d82-bb16-4c11-a611-d0f07c195173",
            "description": "In a recent announcement, Bilt Founder and CEO Ankur Jain addressed Bilt Members in a letter, highlighting the evolution of the service into a comprehensive membership program designed to manage various aspects of home and neighborhood life. Over the past five years, Bilt has expanded to become the largest network of homes in the nation, offering rewards to millions of members monthly, particularly on rent and mortgage payments. This transformation has effectively imbued the concept of housing with a newfound level of benefits for the residents.",
            "link": "https://www.markets.news/headlines/ad8a8d82-bb16-4c11-a611-d0f07c195173",
            "pub_date": "2026-02-26 19:19:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AEON releases 2025 payment data, showcasing growth of AI-native payments in new economy, highlighting demand for AI-native and crypto-based payment infrastructure.",
            "id": "0a297cbb-0989-4aae-9ed6-9c14578a3b1c",
            "description": "In Hong Kong on February 26, 2026, AEON, a key payment and settlement platform for the evolving AI economy, has unveiled its payment performance data for 2025. The data underscores the increasing need for AI-integrated and cryptocurrency-driven payment systems. As the year concluded in 2025, AEON experienced a significant rise in demand, showcasing a shift towards AI-centric financial mechanisms.",
            "link": "https://www.markets.news/headlines/0a297cbb-0989-4aae-9ed6-9c14578a3b1c",
            "pub_date": "2026-02-26 19:19:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Perimeter Solutions (NYSE: PRM) beats Q4 earnings with a 18.18% EPS increase to $0.13 and revenue up by $16.52 million.",
            "id": "516b9cd9-0ab2-4a12-b211-bd3c49573faf",
            "description": "Perimeter Solutions (NYSE: PRM) revealed its Q4 earnings on Thursday, February 26, 2026 at 06:00 AM. The earnings report showed a noteworthy performance with an EPS of $0.13, surpassing the estimated earnings by 18.18% which was anticipated to be $0.11. Additionally, revenue saw a substantial increase of $16.52 million compared to the corresponding period in the previous year. For a detailed insight into the company's recent financial status, including a review of its past earnings in the preceding quarter, a more comprehensive article is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/516b9cd9-0ab2-4a12-b211-bd3c49573faf",
            "pub_date": "2026-02-26 19:09:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8044330f-d519-499d-871f-b888296a0493",
            "description": "INDIA PM MODI: WILL SOON GIVE FINAL SHAPE TO A MUTUALLY BENEFICIAL FTA WITH ISRAEL",
            "link": "https://www.markets.news/headlines/8044330f-d519-499d-871f-b888296a0493",
            "pub_date": "2026-02-26 19:09:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BeOne Medicines beats earnings estimates by 37.32%, EPS at $1.95. Revenue increased by $370 million from last year.",
            "id": "90856875-beb2-4a88-899a-c6fec28ad858",
            "description": "On Thursday, February 26, 2026 at 06:00 AM, BeOne Medicines (NASDAQ: ONC) released its Q4 earnings report. The key highlights include an EPS of $1.95, surpassing the estimated $1.42 by 37.32%. Revenue saw a significant increase of $370.00 million compared to the previous year. BeOne Medicines has consistently outperformed expectations in terms of EPS, exceeding estimates by $1.85. For further details, the full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/90856875-beb2-4a88-899a-c6fec28ad858",
            "pub_date": "2026-02-26 19:09:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arhaus (NASDAQ: ARHS) beats Q4 earnings estimates, with EPS of $0.11 vs. $0.10. Revenue up $17.83 million YoY.",
            "id": "a980fb25-8f21-4059-a3a9-eeb727089621",
            "description": "Arhaus (NASDAQ: ARHS) released its Q4 earnings on Thursday, February 26, 2026 at 06:01 AM. The report revealed that Arhaus exceeded estimated earnings by 10.0%, with an EPS of $0.11 compared to the estimated $0.10. Additionally, the revenue saw a significant increase of $17.83 million from the corresponding period in the previous year. This strong performance follows their success in the previous quarter, where the company also surpassed expectations. For a comprehensive analysis, readers can access the full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/a980fb25-8f21-4059-a3a9-eeb727089621",
            "pub_date": "2026-02-26 19:09:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7f9cec42-c94b-47e1-816f-ca0a438f0bf2",
            "description": "WEF CO-CHAIRS SAY ALOIS ZWINGGI WILL SERVE AS INTERIM PRESIDENT AND CEO",
            "link": "https://www.markets.news/headlines/7f9cec42-c94b-47e1-816f-ca0a438f0bf2",
            "pub_date": "2026-02-26 19:11:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "185f21e7-39fd-4eae-98ce-0f5c0af5a6f4",
            "description": "WEF CO-CHAIRS SAY INDEPENDENT REVIEW ON BRENDE'S CONTACTS WITH JEFFREY EPSTEIN CONDUCTED BY OUTSIDE COUNSEL HAS CONCLUDED",
            "link": "https://www.markets.news/headlines/185f21e7-39fd-4eae-98ce-0f5c0af5a6f4",
            "pub_date": "2026-02-26 19:11:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "af8a5afb-644d-4bdb-a27d-28ff03b438bd",
            "description": "BØRGE BRENDE SAYS HE'S STEPPING DOWN AS PRESIDENT AND CEO OF WORLD ECONOMIC FORUM",
            "link": "https://www.markets.news/headlines/af8a5afb-644d-4bdb-a27d-28ff03b438bd",
            "pub_date": "2026-02-26 19:11:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "66b793bf-ab80-4059-a95c-49cb03403586",
            "description": "INDIA PM MODI: WILL MOVE TOWARDS JOINT DEVELOPMENT, PRODUCTION, TRANSFER OF TECHNOLOGY IN DEFENCE WITH ISRAEL",
            "link": "https://www.markets.news/headlines/66b793bf-ab80-4059-a95c-49cb03403586",
            "pub_date": "2026-02-26 19:11:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "eed21e4c-4b2a-4d2f-bac5-502d23bb7076",
            "description": "WEF CO-CHAIRS SAY FINDINGS STATE THAT THERE WERE NO ADDITIONAL CONCERNS BEYOND WHAT HAS BEEN PREVIOUSLY DISCLOSED",
            "link": "https://www.markets.news/headlines/eed21e4c-4b2a-4d2f-bac5-502d23bb7076",
            "pub_date": "2026-02-26 19:11:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flowco Holdings Inc. (NYSE: FLOC) reports Q4 and full year 2025 results for oil and gas industry solutions.",
            "id": "90f4efe4-07f0-44b0-b490-686126f9a689",
            "description": "Houston-based company Flowco Holdings Inc. (NYSE: FLOC) recently disclosed their financial results for Q4 and the entire year ending on December 31, 2025. Flowco specializes in offering production optimization, artificial lift, and emissions management services for the oil and natural gas sector. The figures for 2024 mentioned in the report are from a time when their operating subsidiary, Flowco MergeCo LLC (“Flowco LLC”), was privately owned.",
            "link": "https://www.markets.news/headlines/90f4efe4-07f0-44b0-b490-686126f9a689",
            "pub_date": "2026-02-26 19:04:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}