{
    "data": [
        {
            "title": "Itaú Unibanco Holding S.A. approves BRL3.85 billion payment of interest on capital to stockholders, BRL0.34888 per share.",
            "id": "42484717-1055-49e7-b261-d76ed97d22df",
            "description": "Itaú Unibanco Holding S.A. announced on February 26, 2026, that its Board of Directors sanctioned the disbursement of interest on capital to stockholders (\"IoC\"). The approved payment totals BRL3.85 billion, equivalent to BRL0.34888 per share.",
            "link": "https://www.markets.news/headlines/42484717-1055-49e7-b261-d76ed97d22df",
            "pub_date": "2026-02-27 07:48:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RFI fund discloses distribution sources for shareholders, payment on Feb 27, 2026. (Numbers not provided in snippet).",
            "id": "e736826c-757a-468e-aabc-4ad72393d656",
            "description": "On February 26, 2026, a press release was issued for shareholders of Cohen & Steers Total Return Realty Fund, Inc. (NYSE: RFI) detailing the sources of the upcoming distribution scheduled for February 27, 2026. The release also included cumulative distributions paid during the fiscal year. This disclosure aims to inform stakeholders about the distribution information, enhancing transparency and accountability within the company.",
            "link": "https://www.markets.news/headlines/e736826c-757a-468e-aabc-4ad72393d656",
            "pub_date": "2026-02-27 07:48:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ancient Crunch's MASA sees strong performance with two retail-exclusive flavors, fueling premium snack rise. Los Angeles, Feb. 26, 2026.",
            "id": "e2e432bc-e396-4e7b-9e72-1ae06e2bc540",
            "description": "The parent company of MASA and Vandy, Ancient Crunch, revealed outstanding results on February 26, 2026, as a result of MASA introducing two unique retail-exclusive flavors. The premium retail expansion saw a significant boost in performance, with a surge in sales and customer interest. This successful move further fueled the company's growth in the retail sector, showcasing the demand for exclusive offerings in the market.",
            "link": "https://www.markets.news/headlines/e2e432bc-e396-4e7b-9e72-1ae06e2bc540",
            "pub_date": "2026-02-27 07:53:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stock market recovers as Dow and Nasdaq rise; AMD surges, energy sector shows strength. Online platform operator drops.",
            "id": "c29b0ebe-36e4-471e-bbc4-335df17a93b1",
            "description": "Today, the Dow Jones index experienced a rise after a sell-off on Monday. An online marketplace platform operator saw a decline. The Dow and Nasdaq closed in recovery mode, with the Dow gaining [specific number], while the Nasdaq rose by [specific number]. AMD showed significant growth, and energy companies also performed well. This news was covered by Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/c29b0ebe-36e4-471e-bbc4-335df17a93b1",
            "pub_date": "2026-02-27 07:54:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b2a730ca-9b76-42be-802e-6fe1b1d04c98",
            "description": "ARGENTINA'S SENATE APPROVES MILEI-BACKED REFORM TO GLACIER LAW",
            "link": "https://www.markets.news/headlines/b2a730ca-9b76-42be-802e-6fe1b1d04c98",
            "pub_date": "2026-02-27 07:55:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "37c8fe59-554b-4eca-a050-356e52f568ff",
            "description": "DELL TECHNOLOGIES INC. SHARES SURGED ABOUT 10% AFTER FORECASTING $50 BILLION IN AI SERVER REVENUE FOR FY2027, REPORTING STRONG EARNINGS AND A RECORD $43 BILLION BACKLOG, SIGNALING ROBUST DATA CENTER DEMAND AND STRENGTHENING ITS POSITION ALONGSIDE NVIDIA CORP. IN THE AI",
            "link": "https://www.markets.news/headlines/37c8fe59-554b-4eca-a050-356e52f568ff",
            "pub_date": "2026-02-27 07:55:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "WCCB, a $2.9B bank in Santa Cruz, to open full-service branch in downtown San Jose at 10 Almaden Boulevard.",
            "id": "681f433b-5a07-4950-98f3-533533d2858b",
            "description": "Located in Santa Cruz, California, West Coast Community Bank (WCCB), a community bank with assets totaling $2.9 billion, recently secured a 10-year lease at 10 Almaden Boulevard, Suite 150 in Ten Almaden. This office space is situated within Ten Almaden, a top-tier Class A office tower at a central location.",
            "link": "https://www.markets.news/headlines/681f433b-5a07-4950-98f3-533533d2858b",
            "pub_date": "2026-02-27 07:42:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Missouri Southern State University opens new Public Safety and Forensics Institute, enhancing law enforcement and forensic science education in the region.",
            "id": "3e878712-7258-487d-ac39-dbb701d8c211",
            "description": "In Joplin, Missouri, on February 26, 2026, Missouri Southern State University (MSSU) marked a significant moment with the inauguration of the Public Safety and Forensics Institute. This event signifies a major advancement in law enforcement and forensic science education for the region.",
            "link": "https://www.markets.news/headlines/3e878712-7258-487d-ac39-dbb701d8c211",
            "pub_date": "2026-02-27 07:42:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aura Minerals Inc. declares a dividend of US$0.66 per share based on Q4 2025 results, resulting in a dividend yield of 6.2%.",
            "id": "544cb562-d860-414b-bd48-4aeb390fa2ef",
            "description": "Aura Minerals Inc., based in Road Town, British Virgin Islands, made an announcement on Feb. 26, 2026, declaring a dividend of US$0.66 per common share, totaling approximately US$55.12 million. This amount exceeds the minimum outlined in the Company's Dividend Policy. As per the policy, Aura may distribute quarterly cash dividends up to 20% of its reported Adjusted EBITDA for the respective three-month period, after deducting sustaining and exploration capital expenditures for that period. The company's Board of Directors approved this dividend payment. Aura Minerals is listed on Nasdaq under the symbol AUGO and on B3 under AURA33.",
            "link": "https://www.markets.news/headlines/544cb562-d860-414b-bd48-4aeb390fa2ef",
            "pub_date": "2026-02-27 07:42:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vitalik Buterin plans to upgrade Ethereum with quantum-resistant cryptography, replacing four core components.",
            "id": "a44cdd45-7e31-4b6f-9704-c851ecc8d1b8",
            "description": "Vitalik Buterin has detailed a plan to gradually replace four risky elements of Ethereum's cryptographic structure.",
            "link": "https://www.markets.news/headlines/a44cdd45-7e31-4b6f-9704-c851ecc8d1b8",
            "pub_date": "2026-02-27 07:43:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AHF sues FL Health Dept to block rule cutting HIV drug access for thousands in Fort Lauderdale.",
            "id": "392f333e-2db6-4976-a6d1-70ceaa2371ab",
            "description": "A lawsuit has been filed by AHF against the Florida Health Department in Fort Lauderdale, Florida. The lawsuit aims to prevent the implementation of an emergency rule that would limit access to HIV medication for thousands of individuals. The rule is set to impact a significant number of people who rely on these medications for their health.",
            "link": "https://www.markets.news/headlines/392f333e-2db6-4976-a6d1-70ceaa2371ab",
            "pub_date": "2026-02-27 07:43:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Summit unveils 1229 Hydraulic Crane with 205-pound weight decrease in 12,000-pound capacity class, stows 3 times faster.",
            "id": "7aec28d5-c596-413c-bf26-f9fa25cd701b",
            "description": "A new hydraulic crane, the 1229 model, is set to revolutionize the 12,000-pound capacity class with advanced ASE Phase 5 intelligence and a weight reduction of 205 pounds. This innovative crane, introduced by Summit Truck Bodies, boasts a significantly faster stowage time compared to conventional systems, stowing three times quicker. The company, headquartered in the United States, unveiled this groundbreaking technology at a showcase in Las Vegas on February 26, 2026.",
            "link": "https://www.markets.news/headlines/7aec28d5-c596-413c-bf26-f9fa25cd701b",
            "pub_date": "2026-02-27 07:44:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cohen & Steers Closed-End Opportunity Fund, Inc. (FOF) notifies about distribution sources on Feb 27, 2026.",
            "id": "48f856e5-2092-44d7-844e-4773b2406b2e",
            "description": "On February 26, 2026, a press release was issued for shareholders of Cohen & Steers Closed-End Opportunity Fund, Inc. (NYSE: FOF) announcing details about the upcoming distribution to be paid on February 27, 2026. The release also offered insights into the sources of this distribution and cumulative distributions paid throughout the fiscal year.",
            "link": "https://www.markets.news/headlines/48f856e5-2092-44d7-844e-4773b2406b2e",
            "pub_date": "2026-02-27 07:44:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Approximately 32.6 million viewers tuned in to the State of the Union address, matching Biden's last one in 2024.",
            "id": "9d36b61f-14c0-42bf-a5ca-90c93b5372b7",
            "description": "The number of viewers for the recent event was comparable to the audience size for former President Biden's last State of the Union address in 2024.",
            "link": "https://www.markets.news/headlines/9d36b61f-14c0-42bf-a5ca-90c93b5372b7",
            "pub_date": "2026-02-27 07:44:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "67ea5763-3ddb-43f0-b74a-7f7a99ba312f",
            "description": "VENEZUELA, U.S. TO REVISE OIL PRODUCTION-SHARING CONTRACTS SIGNED UNDER MADURO ADMINISTRATION, MAY REVOKE SOME DEALS, INDUSTRY SOURCES SAY",
            "link": "https://www.markets.news/headlines/67ea5763-3ddb-43f0-b74a-7f7a99ba312f",
            "pub_date": "2026-02-27 07:44:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sunoco LP announced an upsized private offering of $600 million for 5.375% senior notes due in 2031 and 5.625% notes due in 2034.",
            "id": "74f27d80-3f7e-436f-ade1-6e634c04290e",
            "description": "Dallas-based Sunoco LP (NYSE: SUN) recently revealed it has successfully priced a private offering of senior notes due in 2031 and 2034. The offering, totaling $1.2 billion, consists of 5.375% senior notes amounting to $600 million due in 2031 and 5.625% senior notes totaling $600 million due in 2034. The initial offering size of $500 million was upsized to meet the demands of the market.",
            "link": "https://www.markets.news/headlines/74f27d80-3f7e-436f-ade1-6e634c04290e",
            "pub_date": "2026-02-27 07:46:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brandi AI introduces GEO Framework for AI visibility: SEO, AEO, and GEO layers for brand optimization in search.",
            "id": "afcac2bd-6300-4f50-8a8f-3b4b4ea5bcc3",
            "description": "A new AI framework named Brandi has been introduced to provide clarity on Search Engine Optimization (SEO), Answer Engine Optimization (AEO), and Generative Engine Optimization (GEO). These elements are outlined as sequential layers within a unified AI visibility system for brands in the digital space. The updated approach emphasizes the importance of adapting to AI-driven algorithms for improved online presence. Key Takeaways include the shift in search priorities from rankings towards a more comprehensive strategy integrating various optimization techniques.",
            "link": "https://www.markets.news/headlines/afcac2bd-6300-4f50-8a8f-3b4b4ea5bcc3",
            "pub_date": "2026-02-27 07:40:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Commerce Media Tech partners with IPinfo to adopt accuracy-first IP data in AdTech, breaking from consensus-based models.",
            "id": "9111f9d1-e6cc-4190-a9d0-dbe3c2339fcd",
            "description": "In Krakow, Poland, and Seattle, a leading AdTech platform, CMT, has made a groundbreaking move by departing from traditional geolocation models based on consensus and instead embracing a more precise approach. This shift towards accuracy-first, evidence-driven IP data sets CMT apart as a pioneer in the industry.",
            "link": "https://www.markets.news/headlines/9111f9d1-e6cc-4190-a9d0-dbe3c2339fcd",
            "pub_date": "2026-02-27 07:28:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cohen & Steers REIT and Preferred and Income Fund (RNP) to distribute on Feb 27, 2026, with details on sources of distribution.",
            "id": "5a175328-5658-46c8-b11d-2dfe50b9119a",
            "description": "On February 26, 2026, in New York, a press release was issued for shareholders of Cohen & Steers REIT and Preferred and Income Fund, Inc. (NYSE: RNP), detailing the sources of the upcoming distribution scheduled for February 27, 2026. This release also includes information on the cumulative distributions already paid out by the Fund.",
            "link": "https://www.markets.news/headlines/5a175328-5658-46c8-b11d-2dfe50b9119a",
            "pub_date": "2026-02-27 07:28:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Veea Inc. introduces TerraFabric at Mobile World Congress 2026, enabling AI operations at the edge efficiently. #EdgeComputing",
            "id": "a0f4965b-2cf4-4fd9-b7bc-531ea55dad3a",
            "description": "Veea will showcase its innovative control plane for distributed edge environments at the Mobile World Congress 2026 in Barcelona from March 2 to 4. This technology is designed to help organizations with numerous deployments streamline the administration of AI workloads across their networks. It offers automated management capabilities, policy enforcement, and software lifecycle management through prpl LCM. This advancement will enable organizations to efficiently manage their fleets of devices.",
            "link": "https://www.markets.news/headlines/a0f4965b-2cf4-4fd9-b7bc-531ea55dad3a",
            "pub_date": "2026-02-27 07:28:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}