{
    "data": [
        {
            "title": "",
            "id": "9dfe1b1d-5ae6-4fde-8167-d051095e273a",
            "description": "HEALTH AUTHORITIES IN SPAIN'S CATALONIA: HAVE ALERTED WHO TO A CASE OF A(H1N1)V. SWINE FLU VIRUS TRANSMITTED BETWEEN PEOPLE",
            "link": "https://www.markets.news/headlines/9dfe1b1d-5ae6-4fde-8167-d051095e273a",
            "pub_date": "2026-02-27 20:57:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8f30d5bc-e8fe-46c7-b65c-1b22de31bc86",
            "description": "POLISH PARLIAMENT PASSES BILL ON EU'S 'SAFE' DEFENCE LOAN PROGRAMME",
            "link": "https://www.markets.news/headlines/8f30d5bc-e8fe-46c7-b65c-1b22de31bc86",
            "pub_date": "2026-02-27 21:00:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4bbf1fb3-ea88-432d-828f-f8861222f611",
            "description": "German CPI (Y/Y) Feb P: 1.9% (est 2.0%; prev 2.1%) - CPI (M/M): 0.2% (est 0.5%; prev 0.1%) - CPI EU Harmonised (Y/Y): 2.0% (est 2.1%; prev 2.1%) - CPI EU Harmonised (M/M): 0.4% (est 0.5%; prev -0.1%)",
            "link": "https://www.markets.news/headlines/4bbf1fb3-ea88-432d-828f-f8861222f611",
            "pub_date": "2026-02-27 21:01:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Acadia Realty Trust to present at Citi 2026 Global Property CEO Conference on March 1, 2026 - March 4, 2026 in Hollywood, FL. CEO to speak on March 2 at 5:00 p.m. ET.",
            "id": "1058232b-5f60-4796-9d8d-0284fa6cadcc",
            "description": "Acadia Realty Trust (NYSE: AKR) will be participating and presenting at the Citi 2026 Global Property CEO Conference in Hollywood, FL from March 1 to March 4, 2026. Kenneth F. Bernstein, the President and CEO of Acadia, will deliver a company presentation on Monday, March 2, 2026, at 5:00 p.m. ET. This conference will also include individual meetings with investors.",
            "link": "https://www.markets.news/headlines/1058232b-5f60-4796-9d8d-0284fa6cadcc",
            "pub_date": "2026-02-27 20:51:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shareholders affected by Ostin Technology Group Co., Ltd. (NASDAQ: OST) losses advised to contact Wolf Haldenstein regarding class action lawsuit by April 17, 2026.",
            "id": "f0d3d2c9-b793-4ca6-8c17-7d7718ecc5e6",
            "description": "The deadline for the lead plaintiff in a class action lawsuit against Ostin Technology Group Co., Ltd. (NASDAQ: OST) is April 17, 2026. On February 27, 2026, Wolf Haldenstein Adler Freeman & Herz LLP revealed the filing of the lawsuit on behalf of all involved parties.",
            "link": "https://www.markets.news/headlines/f0d3d2c9-b793-4ca6-8c17-7d7718ecc5e6",
            "pub_date": "2026-02-27 20:52:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JinkoSolar's subsidiary Jinko Solar Co., Ltd. released preliminary unaudited financial results for full year 2025.",
            "id": "9c32bb8f-f745-40c1-87cc-210841480f2e",
            "description": "In Shangrao, China, on February 27, 2026, JinkoSolar Holding Co., Ltd. revealed that its subsidiary, Jinko Solar Co., Ltd., had published a new announcement. JinkoSolar, a renowned player in clean energy technology and listed on the NYSE under the symbol JKS, highlighted the update from its majority-owned operating entity, Jiangxi Jinko.",
            "link": "https://www.markets.news/headlines/9c32bb8f-f745-40c1-87cc-210841480f2e",
            "pub_date": "2026-02-27 20:52:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones futures drop on AI concerns, S&P 500 testing support, Block, Netflix, Applied Opto up.",
            "id": "63dda277-17fe-4fc8-9dde-f112ea764208",
            "description": "The stock market experienced a decline as concerns over artificial intelligence disruption resurfaced, leading to a drop in futures. The S&P 500 is once again testing a significant support level. Notable overnight increases were seen in the shares of companies like Block, Netflix, and Applied Opto. The Dow Jones futures recorded a decrease, indicating potential challenges ahead. This development suggests a cautious sentiment among investors, as they closely monitor the market in response to AI-related uncertainties.",
            "link": "https://www.markets.news/headlines/63dda277-17fe-4fc8-9dde-f112ea764208",
            "pub_date": "2026-02-27 20:52:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a7314fc0-fc1c-4632-b677-ea71a32bd53c",
            "description": "CHINESE EMBASSY SAYS IN ISRAEL: ASKS NATIONALS TO STRENGTHEN SECURITY PRECAUTIONS AND EMERGENCY PREPAREDNESS - STATEMENT",
            "link": "https://www.markets.news/headlines/a7314fc0-fc1c-4632-b677-ea71a32bd53c",
            "pub_date": "2026-02-27 20:55:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dd564358-20c3-4b1c-8bf1-fc0950158d3a",
            "description": "PAKISTAN FOREIGN MINISTRY: FURTHER PROVOCATION BY TALIBAN WILL BE MET WITH BEFITTING RESPONSE",
            "link": "https://www.markets.news/headlines/dd564358-20c3-4b1c-8bf1-fc0950158d3a",
            "pub_date": "2026-02-27 20:55:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Odevo acquires Seacrest and PBM in Florida, strengthening its position in largest US market.",
            "id": "235fc7b8-d81c-468f-b8aa-eab6eb174883",
            "description": "In a recent announcement, Odevo, a prominent player in residential property management worldwide, revealed the purchase of Seacrest and PBM, two reputable property management firms in Florida. This strategic move aims to strengthen Odevo's foothold in its primary US market.",
            "link": "https://www.markets.news/headlines/235fc7b8-d81c-468f-b8aa-eab6eb174883",
            "pub_date": "2026-02-27 20:42:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7d776486-f4ec-4ee0-8767-47f3ce8b4e58",
            "description": "Fico: ‘Today I spoke by phone with Hungarian Prime Minister , and later I will also speak with Ukrainian President Zelensky. The topic is the transit of oil through the Druzhba pipeline, which concerns Slovakia and Hungary. We have information that the pipeline",
            "link": "https://www.markets.news/headlines/7d776486-f4ec-4ee0-8767-47f3ce8b4e58",
            "pub_date": "2026-02-27 20:43:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Effective communication involves balancing sharing feelings with staying stoic. Finding the right mix can be beneficial @IBDinvestors.",
            "id": "8a3423c4-93f3-46d5-a531-3f49ba6238ba",
            "description": "To effectively communicate, it is important to maintain a balance between expressing emotions and remaining composed. Finding the right equilibrium requires practice. Sharing too much can also be a beneficial way to connect with others. This advice was shared in a recent post on Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/8a3423c4-93f3-46d5-a531-3f49ba6238ba",
            "pub_date": "2026-02-27 20:44:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dutch Bros® introduces 3 childhood-inspired drinks at all 1,136+ locations, including Brown Butter Chocolate Chip and Fruit Punch.",
            "id": "4e0f2a39-3464-48e8-ab51-8ae8d4bf327c",
            "description": "In Tempe, Arizona on February 27, 2026, Dutch Bros introduces three nostalgic drinks for recess time. The menu includes the Brown Butter Chocolate Chip, Fruit Punch with a Sour Candy Straw, and Kool Blue. These childhood-inspired beverages are now offered at over 1,136 Dutch Bros locations.",
            "link": "https://www.markets.news/headlines/4e0f2a39-3464-48e8-ab51-8ae8d4bf327c",
            "pub_date": "2026-02-27 20:44:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Square parent company Block will cut 40% of staff using AI tools. CEO predicts similar actions by most firms in a year.",
            "id": "3dd3a8b6-dc80-447d-8ca8-70fafaa7d66d",
            "description": "Block, the parent company of Square, announced plans to reduce its workforce by 40%. CEO Jack Dorsey attributed the decision to the implementation of AI tools and foresees a trend where many other companies will also downsize in the coming year. The news of the job cuts was highlighted with the headline \"AI Jobs Scare: Block Axes 40% Of Staff, Says Most Firms Will Follow Suit.\"",
            "link": "https://www.markets.news/headlines/3dd3a8b6-dc80-447d-8ca8-70fafaa7d66d",
            "pub_date": "2026-02-27 20:44:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AB Volvo's vote count changes as 2,000,619 Series A shares converted to 2,000,619 Series B shares in Sweden.",
            "id": "5c408358-8712-44a6-9a91-2b4b4f655e51",
            "description": "In Gothenburg, Sweden on February 27, 2026, a transformation took place in AB Volvo as 2,000,619 Series A shares were converted into an equivalent number of Series B shares. This move resulted in a change in the total number of votes within the company. The conversions were facilitated through the provision allowing for the switching between Series A shares to Series B shares, maintaining the balance within the voting structure of AB Volvo.",
            "link": "https://www.markets.news/headlines/5c408358-8712-44a6-9a91-2b4b4f655e51",
            "pub_date": "2026-02-27 20:48:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "634aa10e-ce5e-49ac-b280-f7dcdb0899a7",
            "description": "US TREASURY TEN-YEAR YIELD FALLS BELOW 4%, HITS LOWEST SINCE LATE NOVEMBER, LAST DOWN 3.4 BPS AT 3.981%",
            "link": "https://www.markets.news/headlines/634aa10e-ce5e-49ac-b280-f7dcdb0899a7",
            "pub_date": "2026-02-27 20:50:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold Reserve Ltd. completes $75M financing with strategic investors, issuing 24.99M common shares at $3 each.",
            "id": "c116f763-6450-406e-93e5-2b7c0b0bffe4",
            "description": "Pleased to announce, Gold Reserve Ltd. recently closed a successful private placement financing, securing US$75 million from a group of mainly strategic investors. The Company issued 24,999,999 common shares at US$3.00 per share. The financing saw participation from various seasoned strategic investors, bolstering the Company's financial position.",
            "link": "https://www.markets.news/headlines/c116f763-6450-406e-93e5-2b7c0b0bffe4",
            "pub_date": "2026-02-27 20:36:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Spanish Mountain Gold signs MoU with Metso Canada Inc. for SMG project in British Columbia, advancing towards feasibility.",
            "id": "507f34ea-6f4e-45ad-8e95-bd617c6c6805",
            "description": "In Vancouver, British Columbia, Spanish Mountain Gold Ltd. (TSX-V: SPA) (FSE: S3Y) (OTCQB: SPAUF) has finalized a Memorandum of Understanding with Metso Canada Inc. in a significant step towards progressing its Spanish Mountain Gold project towards feasibility and permitting. The project is situated in the Cariboo District corridor in British Columbia, Canada. The President and CEO, Peter Mah, expressed his satisfaction with this development, aligning with the company's goal to advance the SMG project further.",
            "link": "https://www.markets.news/headlines/507f34ea-6f4e-45ad-8e95-bd617c6c6805",
            "pub_date": "2026-02-27 20:36:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TechTarget, Inc. appoints Patrick Martell as non-executive director and Chair, succeeding Mary McDowell. Nasdaq: TTGT.",
            "id": "af0748dc-e065-441d-a4a1-d986cc6c7e22",
            "description": "In Newton, Massachusetts, TechTarget, Inc. (Nasdaq: TTGT) revealed Patrick Martell will be appointed as the new Chair of Informa TechTarget. Martell, the Chief Executive of New York-based Informa Markets, will take over from Mary McDowell. McDowell, who previously served as the Senior Independent Director of Informa, will step down. Martell's new role as non-executive director and Chair of Informa TechTarget signifies a strategic move for the leading B2B Technology growth accelerator company.",
            "link": "https://www.markets.news/headlines/af0748dc-e065-441d-a4a1-d986cc6c7e22",
            "pub_date": "2026-02-27 20:38:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ProCap Financial (Nasdaq: BRR) aggressively repurchased 159,904 shares at 25% discount to NAV profitability. CEO Pompliano praises strategy.",
            "id": "67582541-bc7e-4539-ae9f-4ce619873fee",
            "description": "ProCap Financial, Inc. (Nasdaq: BRR) made a significant move by repurchasing 159,904 shares of its common stock in an open market transaction at approximately a 25% discount to Net Asset Value (NAV). This action, part of their strategy, was confirmed by Anthony Pompliano, the Chairman and CEO of ProCap Financial, who expressed that the company's plan is yielding results. By aggressively buying back shares below NAV, the firm aims to close the N.",
            "link": "https://www.markets.news/headlines/67582541-bc7e-4539-ae9f-4ce619873fee",
            "pub_date": "2026-02-27 20:38:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}