{
    "data": [
        {
            "title": "",
            "id": "ffb5a884-899b-4257-919e-6ed1c9369d78",
            "description": "BAYER’S XOFIGO PLUS ENZALUTAMIDE SHOWS SIGNIFICANT OVERALL SURVIVAL BENEFIT IN PEACE-3 TRIAL – STREET INSIDER",
            "link": "https://www.markets.news/headlines/ffb5a884-899b-4257-919e-6ed1c9369d78",
            "pub_date": "2026-02-27 00:36:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin consolidates near $68K, awaiting catalyst as ETF inflows moderate. $68,000 level crucial for market sentiment. Trading balanced, with focus on institutional activity for short-term momentum. ",
            "id": "de35269d-28fb-4ead-86ce-8cf9820458c5",
            "description": "Bitcoin is trading near $68,000 after a strong rally earlier this year fueled by the launch of spot Bitcoin exchange traded funds and renewed institutional interest. The $68,000 level is both technically and psychologically significant, historically leading to profit taking intensifying. Institutional activity has been a key driver of Bitcoin's rally, with spot Bitcoin ETFs attracting strong inflows supporting the market in early 2026. However, recent data indicates that these inflows have moderated, signaling a potential pause in short-term momentum. Traders are assessing whether Bitcoin can sustain above $68,000 or if a pullback will occur. The full story is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/de35269d-28fb-4ead-86ce-8cf9820458c5",
            "pub_date": "2026-02-27 00:36:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US court sets deadline for addressing Sam Bankman-Fried's motion for new trial as former FTX CEO seeks legal remedies.",
            "id": "d3b703d8-d644-4354-b9f9-eb3118ae0ea9",
            "description": "In light of recent reports indicating that the White House is not willing to entertain a presidential pardon, the former CEO of FTX who has been convicted of [insert specific charges] persists in his legal pursuits.",
            "link": "https://www.markets.news/headlines/d3b703d8-d644-4354-b9f9-eb3118ae0ea9",
            "pub_date": "2026-02-27 00:38:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jacobi introduces AI coding resources to speed up investment tech development. Global leader in investment technology aims to streamline processes.",
            "id": "256027c7-759f-49c0-840c-9c8bc8343b2b",
            "description": "On February 26, 2026, a renowned investment technology company called Jacobi Strategies unveiled its latest innovation, the AI-Assisted Coding Resources. This new suite of tools aims to aid investment teams in efficiently creating, standardizing, and expanding customized strategies. Jacobi's cutting-edge solution is expected to revolutionize the industry by providing access to advanced technologies and increasing operational speed.",
            "link": "https://www.markets.news/headlines/256027c7-759f-49c0-840c-9c8bc8343b2b",
            "pub_date": "2026-02-27 00:38:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LoanBud launches AI platform to verify SBA eligibility early, reducing deal risk and delays. NY, Feb. 26, 2026.",
            "id": "24958b07-6fe7-4fa0-a5a8-f50bcd735cac",
            "description": "A new financial technology company named LoanBud has introduced an innovative approach to Small Business Administration (SBA) financing in New York. By utilizing AI-powered intake and human review processes, the company aims to identify eligibility issues early on, ultimately minimizing deal risk and preventing delays. This initiative is set to streamline access to SBA financing and enhance the efficiency of loan processing. LoanBud's system is designed to accelerate the identification of eligibility problems, potentially improving the overall process for small business owners.",
            "link": "https://www.markets.news/headlines/24958b07-6fe7-4fa0-a5a8-f50bcd735cac",
            "pub_date": "2026-02-27 00:38:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Loop Global had a successful 2025 with >50% YoY revenue growth, shipped ~4,200 chargers, and now has 8,500 EV charging ports worldwide.",
            "id": "a9ceef99-44e8-4d82-8ff2-79ee640be006",
            "description": "In 2025, Loop Global, based in El Segundo, California, successfully shipped approximately 4,200 chargers, expanding its global presence to feature 8,500 EV charging ports worldwide. The company, recognized for its comprehensive EV charging solutions, revealed a prosperous year marked by significant growth in operations and network enhancement.",
            "link": "https://www.markets.news/headlines/a9ceef99-44e8-4d82-8ff2-79ee640be006",
            "pub_date": "2026-02-27 00:38:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SPX FLOW released Gerstenberg Schröder® Kombinator® 250 redesign reducing costs, adding CO₂ refrigerant option.",
            "id": "20cc9764-f58a-441f-90a4-a7460a04a4c6",
            "description": "Recently released in Charlotte, North Carolina on February 26, 2026, SPX FLOW introduced an enhanced model of the Gerstenberg Schröder® Kombinator® 250 scraped surface heat exchanger. This upgraded design provides increased options, leading to reduced downtime and a decrease in the total cost of ownership for margarine and shortening processing applications.",
            "link": "https://www.markets.news/headlines/20cc9764-f58a-441f-90a4-a7460a04a4c6",
            "pub_date": "2026-02-27 00:40:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e3bd8809-61c7-4281-ab6b-2577b4738815",
            "description": "Delegations arrive back at US iran talks negotiations site",
            "link": "https://www.markets.news/headlines/e3bd8809-61c7-4281-ab6b-2577b4738815",
            "pub_date": "2026-02-27 00:31:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ee36d614-057b-4d10-97f8-5c790ae97cf5",
            "description": "Sanoma Corporation purchased its own shares on 26 Feb 2026.",
            "link": "https://www.markets.news/headlines/ee36d614-057b-4d10-97f8-5c790ae97cf5",
            "pub_date": "2026-02-27 00:31:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp client from Alameda creates AI financial system TKI-1266 to address systemic gaps in equity, trust, data sovereignty.",
            "id": "04abd9e8-d3ef-47fb-8ec0-def480a73123",
            "description": "In Pittsburgh on February 26, 2026, an inventor from Alameda, California, discussed their development of a system aimed at addressing the persistent issue of financial equity, trust automation, and data sovereignty. The inventor expressed a desire to implement a self-sustaining AI-driven trust framework to tackle these challenges.",
            "link": "https://www.markets.news/headlines/04abd9e8-d3ef-47fb-8ec0-def480a73123",
            "pub_date": "2026-02-27 00:32:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Boyd Gaming is selling Sam's Town Shreveport to Bally's Corporation, according to an agreement announced on Feb. 26, 2026.",
            "id": "6ca2d8a1-37bf-4af7-a881-8f3190d970cf",
            "description": "In Las Vegas on February 26, 2026, Boyd Gaming Corporation (NYSE: BYD) revealed plans to sell Sam's Town Hotel & Casino in Shreveport, Louisiana, known as Sam's Town Shreveport, to Bally's Corporation (NYSE: BALY). This definitive agreement marks a strategic move in the gaming industry. Sam's Town Shreveport, situated next to Bally's, will change ownership as part of this deal.",
            "link": "https://www.markets.news/headlines/6ca2d8a1-37bf-4af7-a881-8f3190d970cf",
            "pub_date": "2026-02-27 00:32:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c03422ba-3fd5-4319-a990-cb48f99dc2bd",
            "description": "US 4-Week Bill Auction High Yield 3.625% Bid-to-cover 2.88 US sells $105 bln Awards 72.51% of bids at high",
            "link": "https://www.markets.news/headlines/c03422ba-3fd5-4319-a990-cb48f99dc2bd",
            "pub_date": "2026-02-27 00:33:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "WBD reports earnings of $9.46 billion revenue, $252 million net loss, $2.22 billion adjusted EBITDA, and decline in TV and content revenues.",
            "id": "547cb550-8dbd-4e5a-908d-49effc524838",
            "description": "Warner Bros. Discovery, Inc. (NASDAQ: WBD) reported its fiscal fourth-quarter results with quarterly revenue at $9.46 billion, a 7% year-on-year decrease, exceeding analyst estimates. The company reported a net loss of 10 cents per share, wider than expected, with a quarterly net loss of $252 million, an improvement from the previous year. Adjusted EBITDA stood at $2.22 billion, a 20% decrease primarily due to the decline in the Global Linear Networks segment. Distribution revenues declined by 3% to $4.79 billion, advertising revenues decreased by 9% to $1.70 billion, and content revenues decreased by 10% to $2.66 billion. The company generated $1.80 billion in operating cash flow and $1.38 billion in free cash flow.",
            "link": "https://www.markets.news/headlines/547cb550-8dbd-4e5a-908d-49effc524838",
            "pub_date": "2026-02-27 00:33:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Halper Sadeh LLC investigating EWCZ, CWAN, BKKT deals to ensure fair shareholder treatment, potential conflicts. Shareholders advised to seek advice.",
            "id": "1e25a87b-227b-4c83-81c3-53688f98412e",
            "description": "Company insiders could potentially receive significant financial advantages that regular shareholders may not have access to. The planned deals might include conditions that could restrict better competing bids. Shareholders are advised to get in touch with the company to talk about their rights and opportunities free of charge.",
            "link": "https://www.markets.news/headlines/1e25a87b-227b-4c83-81c3-53688f98412e",
            "pub_date": "2026-02-27 00:34:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CHOP & Penn Medicine launch CRISPR platform to identify AML drivers in patient cells, Feb 26, 2026.",
            "id": "11fc2a71-12bd-4d68-a08c-25d3f1702c1a",
            "description": "Researchers have developed a new toolkit that enables testing of potential cancer targets within patient leukemia cells. This innovative CRISPR-based tool can pinpoint genes and regulatory elements responsible for driving acute myeloid leukemia. By directly applying this tool in patient cells, scientists aim to enhance understanding of the disease mechanisms. The toolkit is set to revolutionize cancer research by facilitating personalized treatment approaches. The breakthrough was announced in Philadelphia, with the tool showing promising results in identifying crucial factors in leukemia development. This development signifies a major advancement in cancer therapeutics, with significant potential to improve patient outcomes.",
            "link": "https://www.markets.news/headlines/11fc2a71-12bd-4d68-a08c-25d3f1702c1a",
            "pub_date": "2026-02-27 00:34:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Batteries Plus named Best Retail Franchise of 2025 at IFA Annual Convention in Las Vegas by Global Franchise Awards.",
            "id": "8829f3fe-6f6f-4c1b-b6cb-89779de81533",
            "description": "Recognized at the IFA Annual Convention in Las Vegas, a distinguished battery and power solutions franchise based in HARTLAND, Wis., achieved accolades for its exceptional systemwide services in 2025. Batteries Plus, the premier battery and power solutions service center in the country, was honored as the Best Retail company. This acknowledgment signifies the franchise's commitment to excellence and customer service. The ceremony took place on February 26, 2026.",
            "link": "https://www.markets.news/headlines/8829f3fe-6f6f-4c1b-b6cb-89779de81533",
            "pub_date": "2026-02-27 00:34:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Native will attend AAAAI 2026 Annual Meeting, introducing their Sensitive Series with hypoallergenic fragrances excluding 81 allergens.",
            "id": "1019adbd-b522-4f4c-8c91-6a23189d6786",
            "description": "In San Francisco, personal care brand Native shared at the American Academy of Allergy, Asthma and Immunology (AAAAI) 2026 Annual Meeting about their new Sensitive Series. This line features hypoallergenic fragrances made without 81 known allergens and using only 7-10 perfume raw materials. The ceramides in the products are sourced from nature. Native aims to address skin sensitivities with this new range, providing a clean and simplified option for consumers attending the meeting and beyond.",
            "link": "https://www.markets.news/headlines/1019adbd-b522-4f4c-8c91-6a23189d6786",
            "pub_date": "2026-02-27 00:35:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trial attorneys advise on weather preparedness for trucking companies in Texas and New Mexico to prevent accidents. #SafetyFirst.",
            "id": "fd1568f9-b1e1-42d6-8939-e8d77b0b7887",
            "description": "In the latest updates from Houston on February 26, 2026, the National Weather Service (NWS) is ramping up its Weather Awareness campaign for the upcoming season. Focusing on Tornado, Lightning, and Flood safety, this initiative aims to educate the public on staying safe during severe weather events. Trial attorneys Joel Simon and Ryan Perdue of Simon Perdue Law, PLLC are encouraging trucking companies to take heed of these precautions. This proactive stance will help mitigate risks for drivers and the general public. Stay tuned for more updates on this important safety campaign.",
            "link": "https://www.markets.news/headlines/fd1568f9-b1e1-42d6-8939-e8d77b0b7887",
            "pub_date": "2026-02-27 00:26:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AuthMind enhances identity protection for vaults, secrets, and AI workloads. Bethesda, Md., Feb. 26, 2026.",
            "id": "94f5cc31-5e83-4a5a-a499-6b98210ac93d",
            "description": "AuthMind, a leading identity observability-driven threat protection company, has expanded its end-to-end identity protection services to cover vault and secrets manager access, secret usage, and workload execution. The company's move comes as agentic AI technologies continue to advance rapidly. The announcement was made in Bethesda, Md., on February 26, 2026. AuthMind's initiative reflects the increasing importance of safeguarding against cyber threats, with a growing emphasis on protecting sensitive information.",
            "link": "https://www.markets.news/headlines/94f5cc31-5e83-4a5a-a499-6b98210ac93d",
            "pub_date": "2026-02-27 00:26:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AGBT awards 2026 Next Gen Leadership Awards to early-career researchers and grad students for AGBT meeting in Orlando.",
            "id": "f3b9b6fe-40d7-4705-80bc-92864b6412b0",
            "description": "AGBT has revealed the winners of the 2026 Next Gen Leadership Awards at the AGBT General Meeting in Orlando, Florida. This prestigious award acknowledges exceptional early-career researchers and graduate students contributing to innovation in genomics and related fields. Recipients are granted financial assistance to present their research at the conference, enabling scientific collaboration and career development.",
            "link": "https://www.markets.news/headlines/f3b9b6fe-40d7-4705-80bc-92864b6412b0",
            "pub_date": "2026-02-27 00:26:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}