{
    "data": [
        {
            "title": "Retail traders are abandoning crypto for equities in 2026 due to plunging crypto volatility and a new AI-powered edge in the stock market. $2.3 trillion digital asset market sees capital outflow. Retailers treating stocks as direct substitutes. Dip-buying behavior shifting to stock market.",
            "id": "f44da5d0-37b2-4280-a8fd-b559423ded4a",
            "description": "Bitcoin (CRYPTO: BTC) and the wider digital asset market worth $2.3 trillion are experiencing an outflow of retail capital as traders are shifting focus towards equities. This change in preference is driven by the decreasing volatility in cryptocurrencies and the emergence of a new AI-powered edge in the stock market. Recent flow data from JPMorgan and Wintermute indicates a breakdown in the historical relationship between retail stock and crypto investments in late 2024. Retail traders now view stocks and crypto as direct substitutes rather than complementary risk-on assets, resulting in a negative correlation. When retail investors are actively buying stock market dips, they are staying away from the crypto market. The movement of money out of crypto is a shift from the previous trend where retail participation influenced major crypto cycles through dip-buying and capital rotation. This behavioral change is now being observed in the stock market. For the full story, refer to Benzinga.com.",
            "link": "https://www.markets.news/headlines/f44da5d0-37b2-4280-a8fd-b559423ded4a",
            "pub_date": "2026-02-27 02:31:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thousands of schools nationwide participate in National No One Eats Alone® Day, a program by Sandy Hook Promise to tackle social isolation.",
            "id": "5b6814de-81fd-4165-80c0-3bf8e44e2b45",
            "description": "In Louisville, Kentucky, Sandy Hook Promise and WellCare collaboratively organized an event on Feb. 26, 2026, to promote student connections within schools. The initiative, National No One Eats Alone® Day, was observed in numerous educational institutions nationwide. This program, spearheaded by Sandy Hook Promise with the goal of combatting social isolation, saw participation from thousands of schools. The event aimed to foster inclusivity and unity among students, emphasizing the importance of interaction among classmates.",
            "link": "https://www.markets.news/headlines/5b6814de-81fd-4165-80c0-3bf8e44e2b45",
            "pub_date": "2026-02-27 02:31:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CINC Systems introduces AI-powered payables solution for CAM industry. Largest tech partner in CAM, launched on Feb. 26, 2026.",
            "id": "52575ee1-a7c4-4e1e-bac9-97a1f2178764",
            "description": "In Duluth, Georgia on February 26, 2026, CINC Systems, a prominent technology partner in the community association management (CAM) sector, unveiled a new CAM solution. This innovative system aims to streamline invoice ingestion, ledger coding, and digital vendor payments. As a leader in the industry, CINC Systems' launch of this automated solution marks a significant advancement in CAM technology. The company's dedication to revolutionizing processes in the field is evident, solidifying their position as a top player.",
            "link": "https://www.markets.news/headlines/52575ee1-a7c4-4e1e-bac9-97a1f2178764",
            "pub_date": "2026-02-27 02:31:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1f23acc4-f7c1-41a9-9c17-1732a5158ea1",
            "description": "Eu council: ‘#Sanctions against terrorism: expands the scope of the EU terrorist list to better address the continued threat posed by terrorism & violent extremism + prolongs the list’s validity by 1 year’",
            "link": "https://www.markets.news/headlines/1f23acc4-f7c1-41a9-9c17-1732a5158ea1",
            "pub_date": "2026-02-27 02:32:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8584c825-83dc-4904-ac62-f863ac6b05e7",
            "description": "Cars from the US delegation in the Iran talks leave the venue - Iran State TV.",
            "link": "https://www.markets.news/headlines/8584c825-83dc-4904-ac62-f863ac6b05e7",
            "pub_date": "2026-02-27 02:33:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fd1a3663-2add-4b4c-8bed-db8ce8153d84",
            "description": "Afghanistan spokesperson: ‘40 Pakistani soldiers have been killed in Kunar Province, and the bodies of 13 of them have been transferred by the Mujahideen.’",
            "link": "https://www.markets.news/headlines/fd1a3663-2add-4b4c-8bed-db8ce8153d84",
            "pub_date": "2026-02-27 02:34:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c167548c-2863-4431-adf3-09dc0eb07c1c",
            "description": "Oman FM: We have finished the day after significant progress in the negotiation between the United States and Iran. We will resume soon after consultation in the respective capitals. Discussions on a technical level will take place next week in Vienna. I am grateful to all",
            "link": "https://www.markets.news/headlines/c167548c-2863-4431-adf3-09dc0eb07c1c",
            "pub_date": "2026-02-27 02:35:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "14608800-2325-4b74-a6ce-af2a1e358e77",
            "description": "Iran US talks end - Oman FM",
            "link": "https://www.markets.news/headlines/14608800-2325-4b74-a6ce-af2a1e358e77",
            "pub_date": "2026-02-27 02:36:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SambaNova launches SN50 AI chip 5X faster than competitors, partners with Intel, secures $350M+.",
            "id": "154a0d3a-76ba-4530-8d78-3b11a37732e4",
            "description": "In Dubai, the United Arab Emirates, SambaNova unveiled the SN50 AI chip with a maximum speed 5 times faster than rivals. The company revealed a partnership with Intel for advanced AI inference solutions, along with over $350 million in funding from both new and existing investors. Positioned as the top choice for efficient AI, the SN50 chip promises enterprises a 3 times lower total cost of ownership, making it a reliable foundation for cutting-edge technology.",
            "link": "https://www.markets.news/headlines/154a0d3a-76ba-4530-8d78-3b11a37732e4",
            "pub_date": "2026-02-27 02:27:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apex Media Partners brings Dr. Charles Stanley's teachings to Comcast Florida via In Touch+, expanding reach in the Sunshine State.",
            "id": "30068e4b-c708-49ab-9b39-2cc116e35fc6",
            "description": "A prominent cable provider in Florida has begun airing the teachings of Dr. Charles Stanley. In Touch+, which offers religious teachings from In Touch Ministries, has been officially introduced in Scottsdale, Arizona on February 26, 2026. This new channel broadcasts a range of biblical lessons and has gained traction in the Sunshine State.",
            "link": "https://www.markets.news/headlines/30068e4b-c708-49ab-9b39-2cc116e35fc6",
            "pub_date": "2026-02-27 02:27:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chewy appoints Amazon veteran Chris Deppe as CFO, stock up despite sector downturn. Deppe brings 16 years experience.",
            "id": "44dfc169-a8d0-490f-a25d-2404b31568f3",
            "description": "Chewy, Inc. (CHWY) saw its shares rise despite a general downturn in the Consumer Discretionary sector, which was at -0.21%. The company appointed Chris Deppe as CFO, who brings over 16 years of experience from Amazon.com (AMZN). This move is seen as a step to strengthen Chewy's financial foundation and enhance its position in the e-commerce space. The stock has declined by 23% in the past year but is currently trading 3.2% above its 20-day SMA and 15.7% below its 100-day SMA. This leadership transition signals potential strategic shifts or stability for Chewy.",
            "link": "https://www.markets.news/headlines/44dfc169-a8d0-490f-a25d-2404b31568f3",
            "pub_date": "2026-02-27 02:29:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f820e421-4905-44fa-83d7-ebd897e62cf4",
            "description": "SBM Offshore begins EUR227M share buyback after finishing 2025 program.",
            "link": "https://www.markets.news/headlines/f820e421-4905-44fa-83d7-ebd897e62cf4",
            "pub_date": "2026-02-27 02:23:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Melissa Sierra starts Operator's Intelligence Council for founders and executives; aims to restore clarity for lasting businesses.",
            "id": "fba8de9f-6b21-4265-a451-ebb6f43438e3",
            "description": "A specialized mastermind program exclusively for founders and executives aimed at reestablishing strategic focus for businesses aiming for long-term success has been launched in Scarsdale, New York on February 26, 2026. Melissa Sierra, renowned leadership strategist and founder recognized for her expertise in assisting growth-stage CEOs, introduced the program. The initiative is set to provide invaluable insights and guidance for participants in navigating the complexities of business growth.",
            "link": "https://www.markets.news/headlines/fba8de9f-6b21-4265-a451-ebb6f43438e3",
            "pub_date": "2026-02-27 02:23:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "0x debuts Cross-Chain API Beta, facilitating autonomous trading and multi-chain execution for developers.",
            "id": "afbc2fa8-6925-4f30-9bb3-160656db488c",
            "description": "Today, in San Francisco on February 26, 2026, 0x, a prominent decentralized exchange infrastructure provider, revealed the introduction of its Cross-Chain API. This developer API brings together bridging and swap liquidity to facilitate autonomous trading and multi-chain execution.",
            "link": "https://www.markets.news/headlines/afbc2fa8-6925-4f30-9bb3-160656db488c",
            "pub_date": "2026-02-27 02:23:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NPA celebrates reaching 200 programs nationwide, benefitting 100,000+ elderly to live independently.",
            "id": "f61e4fb7-74bf-4688-9cb1-f7035ac8c095",
            "description": "Over 100,000 seniors are supported to live safely and independently in their communities by the Programs of All-Inclusive Care for the Elderly. The National PACE Association (NPA) disclosed a noteworthy achievement as they revealed that the Program of All-Inclusive Care for the Elderly has surpassed this milestone. This program has played a crucial role in enhancing the quality of life for a substantial number of elderly individuals by providing them with the necessary support and services.",
            "link": "https://www.markets.news/headlines/f61e4fb7-74bf-4688-9cb1-f7035ac8c095",
            "pub_date": "2026-02-27 02:23:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Taronga Group invests in Rebound Technologies' IcePoint® platform for thermal energy storage.",
            "id": "34a6c63a-a0b0-4889-a1ba-dd1878e37797",
            "description": "On February 26, 2026, Rebound Technologies, Inc. announced the completion of a strategic investment round. The investment was led by Taronga Group, a prominent investor in real asset technologies. Rebound Technologies is known for its innovative IcePoint® thermal energy storage and cooling platform. The specifics of the investment amount were not disclosed in the news release.",
            "link": "https://www.markets.news/headlines/34a6c63a-a0b0-4889-a1ba-dd1878e37797",
            "pub_date": "2026-02-27 02:23:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ca4de4d7-3a57-4fd5-9917-366ad27a7041",
            "description": "Hungary’s Prime Minister said that his country would deploy troops to protect its energy facilities, claiming that Ukraine was planning ‘further actions aimed at disrupting the operation of Hungary's energy system.’ Viktor Orban, speaking in a video address, repeated his claim",
            "link": "https://www.markets.news/headlines/ca4de4d7-3a57-4fd5-9917-366ad27a7041",
            "pub_date": "2026-02-27 02:26:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Celsius Holdings, Inc. (NASDAQ: CELH) shares surged after delivering upbeat quarterly results. Q4 adjusted EPS was 26 cents, surpassing estimates, with sales of $721.628 million (+117% YoY). CEO noted a 20% market share increase in the U.S. energy drink category. Retail sales for Celsius, Alani Nu, and Rockstar Energy all saw growth, with Alani Nu showing the highest increase at 76.9%. North America sales reached $699.5 million, while International sales hit $22.1 million.",
            "id": "bd50d06d-7e52-4937-883c-68cc906a043d",
            "description": "Celsius Holdings, Inc. saw their shares rise after reporting strong quarterly performance. They exceeded expectations with adjusted earnings per share of 26 cents, beating the estimated 20 cents. Quarterly sales were $721.628 million, a 117% increase year over year, surpassing the expected $640.834 million. The company's CEO highlighted reaching a 20% dollar share of the U.S. energy drink category in Q4 2025. North America sales grew by 124% to $699.5 million, while international sales rose by 9% to $22.1 million. In retail performance, Celsius Holdings' portfolio retail sales increased by 24.4% in tracked U.S. channels, with the CELSIUS brand racking up a 12.8% increase, Alani Nu growing by 76.9%, and Rockstar Energy witnessing a decline of 10.3%.",
            "link": "https://www.markets.news/headlines/bd50d06d-7e52-4937-883c-68cc906a043d",
            "pub_date": "2026-02-27 02:16:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hormel Q1: EPS beats at 34 cents, sales miss at $3.03B. Operating income $244M, cash flow at $349M, retail volume down 6%.",
            "id": "aba706ff-de29-48c2-b113-385f333573c7",
            "description": "Hormel Foods Corp's (NYSE: HRL) stock experienced a decline following the release of their first-quarter FY26 results. The company posted adjusted earnings per share of 34 cents, surpassing the analyst estimate of 32 cents. However, their sales figure of $3.03 billion fell short of the expected $3.07 billion. Operating income was reported at $244 million, with adjusted operating income at $247 million, resulting in operating and adjusted operating margins of 8% and 8.2% respectively. Cash flow from operations for the quarter amounted to $349 million. Inventories at the end of the quarter totaled $1.6 billion, while they had cash reserves of $868 million. In terms of segment performance, retail volume saw a 6% decrease and net sales dropped by 2%, influenced by the company's strategic withdrawal from specific non-core private label snack nut products and challenges in branded items.",
            "link": "https://www.markets.news/headlines/aba706ff-de29-48c2-b113-385f333573c7",
            "pub_date": "2026-02-27 02:16:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8f5fcbe5-2ab0-45d5-93be-2c393a8a1cbb",
            "description": "7 counterparties take $3.796b at the Fed reverse repo operation.",
            "link": "https://www.markets.news/headlines/8f5fcbe5-2ab0-45d5-93be-2c393a8a1cbb",
            "pub_date": "2026-02-27 02:17:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}