{
    "data": [
        {
            "title": "nLIGHT, Inc. (Nasdaq: LASR) to attend investor events in Q1 2026, including Raymond James Conference on March 3.",
            "id": "7508a6e4-5fc7-4f6b-945c-148d5f2dca66",
            "description": "CAMAS, Wash.--nLIGHT, Inc., a top supplier of high-power lasers for critical directed energy, optical sensing, and advanced manufacturing uses, shared their involvement in various investor events in Q1 2026. The key events include Raymond James 47th Annual Institutional Investors Conference on March 3, 2026, held at JW Marriott Grande Lakes in Orlando, FL, and the Stifel 2026 NYC Technology One-on-One Conference later in the month. nLIGHT, listed on Nasdaq as LASR, continues to drive innovation with their leading laser technology.",
            "link": "https://www.markets.news/headlines/7508a6e4-5fc7-4f6b-945c-148d5f2dca66",
            "pub_date": "2026-02-27 21:12:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BlackRock TCP Cap Q4 earnings (02/27/26) miss estimates by -3.85%, EPS of $0.25 vs $0.26, revenue dips $17.35M yearly.",
            "id": "ff4fc44f-3927-4de9-adb6-f9de53095740",
            "description": "On February 27, 2026, BlackRock TCP Cap (NASDAQ: TCPC) disclosed its Q4 earnings at 08:05 AM, revealing a significant dip in performance. The company fell short of expected earnings by -3.85%, recording an EPS of $0.25 instead of the anticipated $0.26. Additionally, their revenue plummeted by $17.35 million compared to the previous year. This decline in financial figures signals a challenging quarter for BlackRock TCP Cap. For a comprehensive analysis, the complete report can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/ff4fc44f-3927-4de9-adb6-f9de53095740",
            "pub_date": "2026-02-27 21:12:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PhotonIC Technologies introduces ROCS platform with 10G – 1.6T products, to showcase at OFC 2026 in Los Angeles.",
            "id": "8ea1eec7-0c2d-4c9c-b9ae-6dc76bdf3020",
            "description": "PhotonIC Technologies, a worldwide fabless optoelectronic semiconductor company, is utilizing CMOS and SiGe processes in multiple fabs around the globe through the ROCS platform. The company will be exhibiting their range of products, from 10 gigabits to 1.6 terabits, at OFC 2026 in Los Angeles, California. The announcement was made on February 27, 2026.",
            "link": "https://www.markets.news/headlines/8ea1eec7-0c2d-4c9c-b9ae-6dc76bdf3020",
            "pub_date": "2026-02-27 21:12:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f0beaecb-7274-4ced-88fd-3566e8b9bd9b",
            "description": ".Afghan Interior Minister: 'The issue of the Taliban in Pakistan is considered a pretext, and we are committed to maintaining Afghanistan's independence. Formation of reform committees to prevent Afghans from traveling to Pakistan to engage in combat outside the country.'",
            "link": "https://www.markets.news/headlines/f0beaecb-7274-4ced-88fd-3566e8b9bd9b",
            "pub_date": "2026-02-27 21:13:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ellisons-led Paramount beats Netflix for Warner Bros. Discovery. Challenge now: merging the media giants effectively.",
            "id": "97c5d5ef-ea7d-45fb-8b1c-39679b33f70f",
            "description": "A media corporation owned by the Ellisons has successfully outbid Netflix to gain control of Warner Bros. Discovery. The focus now shifts to integrating the two entities to create a combined media powerhouse.",
            "link": "https://www.markets.news/headlines/97c5d5ef-ea7d-45fb-8b1c-39679b33f70f",
            "pub_date": "2026-02-27 21:14:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "abfb9d60-5008-4b19-bcb4-34b8a26d43dd",
            "description": "The Afghan Interior Minister: 'The doors of dialogue and negotiation are still open, appreciating the efforts made by Qatar, Turkey, and Saudi Arabia'",
            "link": "https://www.markets.news/headlines/abfb9d60-5008-4b19-bcb4-34b8a26d43dd",
            "pub_date": "2026-02-27 21:14:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "College seniors Madhav Aggarwal and Tanvi Gadamsetti pitch their patented \"Shoelaces That Never Quit™\" on Shark Tank for their tech startup BRCĒ.",
            "id": "00f53514-f534-44dc-831f-62d3c5f92c5c",
            "description": "Entrepreneurs Madhav Aggarwal and Tanvi Gadamsetti are set to present their innovative product, \"Shoelaces That Never Quit™,\" as a proof-of-concept for their company, EAST LANSING-based BRCĒ. Established by the duo, BRCĒ focuses on advanced material technology in Michigan. The pitch is scheduled for February 27, 2026, marking an important milestone for the startup. The product aims to revolutionize traditional shoelaces by introducing a durable and long-lasting alternative. The event will showcase the capabilities of the material and the potential impact of the startup in the industry. This undertaking represents a significant step in the journey of BRCĒ, highlighting their commitment to innovation and product development.",
            "link": "https://www.markets.news/headlines/00f53514-f534-44dc-831f-62d3c5f92c5c",
            "pub_date": "2026-02-27 21:14:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CHMP recommends approval of expanded use of Lilly's Olumiant for adolescents with severe alopecia. 42% reached 80% scalp hair coverage at 36 weeks.",
            "id": "b229b4f1-12a8-4a8f-a7e4-8e47b33752d3",
            "description": "According to data from the Phase 3 BRAVE-AA-PEDS study, a significant 42% of individuals with severe alopecia areata (AA) achieved 80% or higher coverage of scalp hair after 36 weeks. This research is the initial and most extensive study focusing on investigating this condition in children and is an indicator of a positive outcome.",
            "link": "https://www.markets.news/headlines/b229b4f1-12a8-4a8f-a7e4-8e47b33752d3",
            "pub_date": "2026-02-27 21:14:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Marc Zieger becomes EVP of Investment Solutions at QuantumStreet AI, which aims for institutional expansion after growing to $60B assets.",
            "id": "d0c20898-d364-4bf4-8575-0ab184b8f90b",
            "description": "A co-founder of Scientific Beta, instrumental in growing the index platform to $60 billion in assets, has been selected to spearhead QuantumStreet's institutional expansion. QuantumStreet AI, a renowned fintech firm known for constructing AI-driven indexes and predictive analysis, announced this development in New York and San Francisco on Feb. 27, 2026.",
            "link": "https://www.markets.news/headlines/d0c20898-d364-4bf4-8575-0ab184b8f90b",
            "pub_date": "2026-02-27 21:15:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1ebe901c-6769-404f-895f-0dba35a9347c",
            "description": "BOE'S PILL SAYS DISINFLATION PROCESS 'ADVANCED AND INTACT'",
            "link": "https://www.markets.news/headlines/1ebe901c-6769-404f-895f-0dba35a9347c",
            "pub_date": "2026-02-27 21:15:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ELLC rescheduled meeting to Mar 19, 2026. Provides supplemental disclosure on acquisition by ELL Ventures Ltd.",
            "id": "d6d0074e-a042-4d9a-a7fe-3972b0e3820d",
            "description": "Toronto-based language learning company, Everybody Loves Languages Corp. (ELLC), has rescheduled its annual general and special meeting to March 19, 2026. The Company trades on the TSX-V under the symbol ELL, OTC as LMDCF, and FSE as LIMA. ELLC specializes in edtech language learning edutainment and content development. The Meeting will include enhanced disclosure to complement information in the Circular. For more details, visit www.everybodyloveslanguages.com.",
            "link": "https://www.markets.news/headlines/d6d0074e-a042-4d9a-a7fe-3972b0e3820d",
            "pub_date": "2026-02-27 21:08:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bragg Gaming Group allows CEO to sell 1,039,000 shares in private block trade despite blackout period waiver.",
            "id": "10b0f4d3-ca60-46ef-8600-1400f476e389",
            "description": "In Toronto, Bragg Gaming Group (NASDAQ: BRAG, TSX: BRAG), a prominent iGaming content and technology provider, disclosed that its Board of Directors has granted a limited waiver for the company's set blackout period. This waiver allows their CEO, Matevž Mazij, to carry out a block sale of 1,039,000 common shares of the Company to a sole buyer in a private transaction. The decision to grant the waiver was made in acknowledgment of a situation.",
            "link": "https://www.markets.news/headlines/10b0f4d3-ca60-46ef-8600-1400f476e389",
            "pub_date": "2026-02-27 21:08:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Green Dot's Q4 2025 results to be announced on March 12, without earnings call due to a proposed transaction.",
            "id": "9b564179-cff7-422e-8005-3cb201d3b3a4",
            "description": "Green Dot Corporation (NYSE: GDOT) is set to announce its fourth quarter 2025 financial results on March 12, 2026. Due to the proposed transaction involving CommerceOne Financial Corporation and Smith Ventures LLC, Green Dot will not conduct an earnings conference call. Instead, a press release containing the financial results, commentary, and slides will be shared post-market close.",
            "link": "https://www.markets.news/headlines/9b564179-cff7-422e-8005-3cb201d3b3a4",
            "pub_date": "2026-02-27 21:08:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NiCE CEO to speak at Morgan Stanley Conference on March 3, 2026 at 1:00 PM ET. Webcast available.",
            "id": "5236192e-5091-46d5-9ffe-321bee884b4d",
            "description": "NiCE (Nasdaq: NICE) has revealed that the CEO, Scott Russell, will be taking part in a fireside chat at the Morgan Stanley Technology, Media & Telecom Conference on March 3, 2026, at 1:00 PM ET. A live webcast and replay of the event can be accessed on the Company’s Investor Relations website at https://www.nice.com/company/investors/upcoming-event. NiCE, listed on NASDAQ as NICE, specializes in AI technology that is reshaping industries.",
            "link": "https://www.markets.news/headlines/5236192e-5091-46d5-9ffe-321bee884b4d",
            "pub_date": "2026-02-27 21:08:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UL Solutions (NYSE: ULS) to attend Raymond James 47th Annual Institutional Investors Conference on March 2 and Bank of America 2026 Information and Business Services Conference on March 12.",
            "id": "26c5985c-42e7-44bd-8ff3-70fbba3a6bd0",
            "description": "Northbrook, Illinois – UL Solutions Inc., a prominent player in applied safety science, shared plans for senior management participation in upcoming investor conferences. Specifically, they will attend Raymond James' 47th Annual Institutional Investors Conference on March 2 and Bank of America's 2026 Information and Business Services Conference on March 12. Notably, the company's live presentation at the Bank of America event on March 12 will offer insights to a wider audience. UL Solutions Inc. trades on the NYSE under the ticker symbol ULS.",
            "link": "https://www.markets.news/headlines/26c5985c-42e7-44bd-8ff3-70fbba3a6bd0",
            "pub_date": "2026-02-27 21:08:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Visa has acquired Prisma & Newpay in Argentina, strengthening payment innovation. Prisma offers card issuer processing.",
            "id": "409bbb6b-6cfd-4de7-b485-be64fde77de0",
            "description": "Visa (NYSE: V) has finalized its acquisition of Prisma Medios de Pago S.A.U. (\"Prisma\") and Newpay S.A.U. (\"Newpay\") in Argentina. The acquisition aims to enhance payment innovation and modernize financial infrastructure in the country. Prisma specializes in credit, debit, and prepaid card issuer processing, while Newpay operates as a multi-network infrastructure provider offering real-time payments services. This move underscores Visa's dedication to advancing financial technology and services in Argentina.",
            "link": "https://www.markets.news/headlines/409bbb6b-6cfd-4de7-b485-be64fde77de0",
            "pub_date": "2026-02-27 21:08:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KIND Snacks and Rob Rausch surprise fans with free Rise & Kind breakfast boxes with Scottish salmon and Protein Max Granola.",
            "id": "787cf395-f756-4d19-8244-fb29c670ab52",
            "description": "A new collaboration between KIND Snacks and reality TV star Rob Rausch has introduced limited-time releases of popular Scottish salmon and Protein Max Granola to breakfast tables across the country. This partnership aims to infuse morning routines with a touch of kindness by giving consumers access to sought-after, trending products.",
            "link": "https://www.markets.news/headlines/787cf395-f756-4d19-8244-fb29c670ab52",
            "pub_date": "2026-02-27 21:08:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enterprise Products Partners L.P. (NYSE: EPD) to release 2025 tax packages, including K-1s, on March 3, 2026. Access online at www.Taxpackagesupport.com/enterprise. Contact (800) 599- for details.",
            "id": "763a10f4-04e8-4d79-9159-ae1f58836ef2",
            "description": "Enterprise Products Partners L.P. (NYSE: EPD) has disclosed that its 2025 tax packages, along with schedule K-1s, will be accessible online from March 3, 2026. These packages can be obtained via the K-1 Tax Package Support website, www.Taxpackagesupport.com/enterprise. Distribution of the 2025 tax packages through mail is anticipated to commence on the same day. For further details, unitholders can contact K-1 Tax Package Support toll-free at (800) 599-XXXX.",
            "link": "https://www.markets.news/headlines/763a10f4-04e8-4d79-9159-ae1f58836ef2",
            "pub_date": "2026-02-27 21:09:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mineros S.A. confirms high-grade discovery with 52,214 metres drilled in Nicaragua, potential district expansion.",
            "id": "16c423d0-e654-429c-b166-eee84c656690",
            "description": "In Colombia, Mineros S.A. has completed its 2025 diamond drilling campaign at the Hemco Property in Nicaragua. The campaign involved drilling 52,214 meters of core samples. This initiative aimed to assess regional targets and gather infill data for existing mining operations to confirm structural consistency and explore potential resource growth. All technical information has been reviewed by a Qualified Person following Ca standards. The company's stock is listed on various exchanges including TSX (symbol: MSA), OTCQX (symbol: MNSAF), and BVC (symbol: MINEROS).",
            "link": "https://www.markets.news/headlines/16c423d0-e654-429c-b166-eee84c656690",
            "pub_date": "2026-02-27 21:09:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RINGOFYRE launches Fire Pit Grill, first of its kind, offering premium outdoor experience.",
            "id": "147096eb-bc4a-44df-8a8f-f37c8216bf29",
            "description": "In Atlanta on February 27, 2026, RINGOFYRE introduced the RINGOFYRE Fire Pit Grill, marking the debut of a high-end outdoor focal point. The grill represents a groundbreaking combination of a fire pit and cooking grill, promising top-notch culinary results and superior aesthetics. This state-of-the-art fire pit grill sets a new standard in outdoor cooking by seamlessly blending functionality with style.",
            "link": "https://www.markets.news/headlines/147096eb-bc4a-44df-8a8f-f37c8216bf29",
            "pub_date": "2026-02-27 21:10:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}