{
    "data": [
        {
            "title": "Delta optimistic on Q1 revenue",
            "description": "<div class=\"archives\">\n\n<h2>\n<font class=\"red\">EXPANSION: </font>\n                        Delta Electronics is planning to expand its capacity in Thailand, India and the US, and has visited Mexico to gauge potential future investment there                    </h2>\n\n<p>Power supply and electronic components maker Delta Electronics Inc (台達電) yesterday said that it is optimistic about revenue this quarter and for the full year, as artificial intelligence (AI) infrastructure continues to drive demand for its power and thermal management products.</p><p>While the first quarter is typically a slow season due to the Lunar New Year holiday, the impact is expected to be milder this year as AI data center power products account for a growing share of revenue, Delta Electronics chairman Ping Cheng (鄭平) said at an earnings conference in Taipei.</p><p>Shipments of power products this quarter could be flat or increase slightly from last quarter, while those of cooling products are expected to decline from last quarter due to seasonality, the company said.</p><p>Demand for Delta’s products used in AI data centers is expected to remain strong this year, with shipments likely to grow steadily in the following quarters if major cloud service providers (CSPs) execute their capital expenditure plans on schedule, Delta vice president Lanford Liu (劉亮甫) said.</p><p>However, data center construction still faces multiple constraints, including the availability of land, water and power supply, and labor shortages, all of which could pose uncertainties for Delta’s shipments, Cheng said.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>A persistent shortage of memory chips is another uncertainty that could affect customers’ data center construction, he said.</p><p>Delta’s net profit last quarter fell 7 percent quarter-on-quarter, but surged 141 percent year-on-year to NT$17.3 billion (US$553.6 million), driven by continued strong demand from CSPs.</p><p>Earnings per share decreased to NT$6.67 from NT$7.16 in the previous quarter, but were up from NT$2.76 a year earlier.</p><p>Gross margin fell to 34.6 percent from 34.9 percent the previous quarter, and operating margin also fell to 16.35 percent from 16.5 percent.</p><p>Power electronics products accounted for 50 percent of Delta’s revenue of NT$161.61 billion last quarter, followed by infrastructure products at 37 percent, automation devices at 9 percent and mobility applications at 4 percent.</p><p>Total revenue last year rose 32 percent year-on-year to NT$554.9 billion, with AI-related power supply units accounting for more than 20 percent, while AI-related cooling and heat-dissipation solutions made up about 9 percent, Cheng said.</p><p>To ease capacity tightness driven by strong AI demand, the company started operating three new plants in Thailand last quarter, he said.</p><p>Delta is planning to expand its capacity in Thailand, India and the US, and has visited Mexico to gauge potential future investment there, he said.</p><p>As the electric vehicle (EV) market is expected to remain subdued over the next one to two years, Delta has decided to consolidate its EV production in Thailand from two plants to one, with the freed capacity to be reassigned for power supply products, Cheng said.</p><p>Delta spent NT$46.1 billion on capital expenditure last year and plans to increase its spending this year to support its AI and data center-related product lines, he said.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/27/2003852942",
            "pub_date": "2026-02-27 00:05:57",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Airoha forecasts modest growth",
            "description": "<div class=\"archives\">\n\n\n<p>Airoha Technology Corp (達發科技), a supplier of network and communications chips, yesterday said that revenue would grow moderately this year, driven by rising demand for optical fiber chips used in artificial intelligence (AI) data centers and Ethernet chips for ground stations of low Earth orbit satellites.</p><p>Airoha, 66.41 percent owned by the world’s largest smartphone chip designer, MediaTek Inc (聯發科), reported record-high revenue last year of NT$20.93 billion (US$669.7 million), up 9.4 percent from NT$19.12 billion in 2024.</p><p>“We expect optical fiber and Ethernet chips to deliver the strongest growth. The two product lines are likely to account for about 20 percent of the company’s total revenue this year,” Airoha executive vice president M.H. Shieh (謝孟翰) told an earnings conference yesterday.</p><p>Airoha expects its optical fiber chips to enjoy high-speed growth this year and over the next few years as optical fiber transceiver modules remain the top choice for AI data center operators, Shieh said.</p><p>The company plans to start volume production of a new high-speed single-lane digital signal processor (DSP) supporting 100 gigabit transmission in the middle of this year, he said.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>The 100-gigabit-per-second SerDes DSP is critical for data center interconnects, enabling high-speed data transmission over a single optical lane using PAM4 technology, Shieh said.</p><p>Marvell Technology Inc and Broadcom Inc are the leading suppliers of high-speed DSPs.</p><p>Airoha expects high-speed DSPs supporting transmission speed of 400 gigabits, 800 gigabits or 1.6 terabits per second to remain the mainstream technology for optical fiber modules in the next five years, while copackaged optics (CPO) technology would support much higher-speed transmission up to 3.2 terabits per second for the main AI chips, he said.</p><p>Nvidia Corp is expected to adopt CPO technology for new AI chips to address power consumption issues.</p><p>In addition, Airoha expects rapid deployment of low Earth orbit satellites this year to fuel demand for the company’s ethernet chips used in ground stations and receivers, Shieh said.</p><p>Strong customer demand and higher average selling prices are expected to boost the revenue contribution of networking chips — fixed broadband chips, ethernet chips and optical fiber chips — from 45 percent of the total last year and 35 percent in 2024, he said.</p><p>Bluetooth chips accounted for 50 percent of the company’s revenue last year, he added.</p><p>Airoha counts major cloud service providers and optical fiber transceiver module makers among its customers.</p><p>This quarter’s revenue is expected to grow sequentially and annually, bucking the traditional downtrend in the first quarter of the year, Shieh said.</p><p>Airoha reported net profit of NT$533 million for the fourth quarter of last year, down 8.6 percent year-on-year and 35.4 percent quarter-on-quarter.</p><p>Last year’s net profit grew 8.2 percent to NT$2.83 billion from NT$2.61 billion in 2024, with earnings per share rising to NT$17.32 from NT$16.1.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/27/2003852943",
            "pub_date": "2026-02-27 00:05:57",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Computer and IT service sector posts record-high revenue",
            "description": "<div class=\"archives\">\n\n<h2>\n<font class=\"red\">AI BOOM: </font>\n                        The adoption of Industry 4.0 and increased demand for cross-border operations from major chipmakers have driven demand, an ADI report said                    </h2>\n\n<p>The computer and information technology (IT) service sector’s revenue in the fourth quarter of last year increased 8.5 percent year-on-year to NT$190.72 billion (US$6.1 billion), the highest for the October-to-December period on record, the Administration for Digital Industries (ADI) said yesterday.</p><p>The growth was mainly driven by the computer programming industry, benefiting from the private and public sectors’ accelerated adoption of artificial intelligence (AI) applications, cloud services and digital governance systems, the ADI said in a report.</p><p>The adoption of Industry 4.0 and increased demand for cross-border operations from major semiconductor manufacturers have also driven demand for system integration, software development, and outsourced maintenance and operation management services, the report said.</p><p>The computer programming industry’s revenue rose 11.11 percent to NT$141.54 billion in the fourth quarter, accounting for 74.22 percent of total revenue, the report said.</p><p>The IT service industry’s revenue grew 1 percent to NT$49.17 billion, or 25.78 percent of the total.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>That was mainly due to securities firms, banks, insurance companies and regulatory agencies continuing investment in cloud computing, cybersecurity and AI services, it said.</p><p>For the whole of last year, the computer and IT service sector’s revenue totaled NT$659.6 billion, up 8.06 percent from the previous year, with computer programming and IT service industries growing by 10.87 percent and 0.75 percent respectively, the report showed.</p><p>“Last year’s performance showed that large enterprises, manufacturers, financial institutions and government agencies continued to expand their investments in AI, cloud computing and cybersecurity, further driving stable growth in demand for system integration and consulting services,” the ADI said.</p><p>This year, with businesses continuing to increase investment in AI, cloud computing and cybersecurity, as well as accelerating overseas expansion, and the government promoting policies related to digital government and smart services, the growth momentum of the computer and IT service sector is expected to continue, it said.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/27/2003852944",
            "pub_date": "2026-02-27 00:05:58",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Standard Chartered CEO sets ambitious growth strategy",
            "description": "<div class=\"archives\">\n\n\n<p>Standard Chartered Bank Taiwan’s newly appointed chief executive officer, Anthony Yu (游天立), yesterday unveiled an ambitious growth strategy for the bank’s wealth management division, reflecting a bullish outlook on Taiwan’s high-net-worth market.</p><p>Yu, the first local executive to lead Standard Chartered Bank’s Taiwan operations, emphasized rising client demand and detailed plans to expand the bank’s digital capabilities, as well as its physical presence across the country.</p><p>Standard Chartered Taiwan saw a remarkable surge in new wealth management clients last month, with the number of clients holding assets equivalent to US$1 million more than doubling compared with the same month last year, he said.</p><p>“The strong equity market, combined with growing demand for diversified and succession-focused financial solutions, has created a substantial opportunity for our wealth management business,” Yu told reporters.</p><p>Taiwan’s benchmark equity index has surged past the 35,000-point mark, generating significant paper gains and expanding the pool of investable assets.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>As the foreign bank with the largest market share in custody services for overseas institutional investors, Standard Chartered has benefited from the capital inflows and heightened market activity, said the veteran banker, who previously worked at HSBC and Citi before joining Standard Chartered.</p><p>Since taking the helm three months ago, Yu has prioritized raising Taiwan’s profile within the London-headquartered group.</p><p>He said that one of his main objectives is to ensure headquarters recognizes Taiwan as a high-potential market, enabling greater flexibility in strategic planning, resource allocation and product innovation.</p><p>The bank entered this year on a strong footing. Standard Chartered Taiwan last year posted an 18 percent rise in profit, with a return on equity exceeding 14 percent.</p><p>Overall operations and wealth management each delivered double-digit percentage growth, reflecting robust client demand and effective execution of the bank’s strategy.</p><p>Yu outlined a multipronged approach for this year.</p><p>The bank aims to enhance product offerings, refine internal processes through digitization and expand its relationship manager team, which currently numbers about 400, he said.</p><p>Last year, about 70 new relationship managers were added, and further expansion is planned through a mix of external hiring and internal development, he said.</p><p>Physical presence remains a key component of the strategy. Following flagship wealth management branches in Taipei’s Xinyi District (信義) and Taichung’s central business district, a third flagship outlet is scheduled to open in May near Taipei’s affluent Tianmu (天母) area, he said.</p><p>Additional expansions in Kaohsiung and other major cities are under review, reflecting a continued focus on personalized, high-touch client service, Yu said.</p><p>Yu expressed confidence that the bank’s wealth management business would sustain double-digit growth this year and beyond under his leadership.</p><p>Taiwan’s strong economic fundamentals and robust capital market performance create a fertile environment for growth, he said.</p><p>With strategic investments in product offerings, talent and transaction processes, Standard Chartered is well positioned to seize upcoming opportunities and reinforce its market leadership, he added.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/27/2003852945",
            "pub_date": "2026-02-27 00:05:58",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investors tepid about Nvidia’s upbeat forecast",
            "description": "<div class=\"archives\">\n\n\n<p>Nvidia Corp, the dominant maker of artificial intelligence (AI) processors, failed to impress investors with its latest sales forecast, signaling that concerns about an overheated AI economy would continue to dog the company.</p><p>Although the chipmaker delivered a first-quarter outlook that easily beat the average Wall Street estimate, Nvidia shares fell as much as 1.5 percent during a conference call with analysts. By Wednesday evening, the stock was little changed.</p><p>It was a stark reminder of the skepticism now surrounding Nvidia. After explosive sales growth turned the chipmaker into the world’s most valuable company, investors are seeking stronger assurances that booming AI sales are here to stay.</p><p>Nvidia chief executive officer Jensen Huang (黃仁勳) pushed back on the concerns during Wednesday’s call, arguing that customers are already making money from their newly acquired computing power.</p><p>That is why clients would keep investing at elevated levels, he said.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>“You need compute capacity, and that translates directly to growth, and that translates directly to revenues,” Huang said. “I’m confident their cash flows are growing.”</p><p>Nvidia chief financial officer Colette Kress tried to defuse other concerns raised by analysts, including the specter of supply constraints.</p><p>The company has secured enough components to be able to meet growing demand, she said.</p><p>It remains a challenge to produce enough of Nvidia’s most advanced chips, but the company’s current Blackwell lineup — and an upcoming successor, called Rubin — would still beat earlier sales projections, she told analysts.</p><p>Nvidia had previously said that the chips would generate US$500 billion by the end of this year.</p><p>“We believe we have inventory and supply commitments in place to address future demand, including shipments extending into calendar [year] 2027,” Kress said.</p><p>Nvidia still faces uncertainty in China, the largest market for chips. The US government has granted licenses to ship a small amount of H200 processors to customers there, but Nvidia does not know if the Chinese government would give its approval, she said.</p><p>For now, the company would continue to exclude data center revenue in China from its forecasts, she added.</p><p>Fiscal first-quarter revenue would be about US$78 billion, the Santa Clara, California-based chipmaker said. The average prediction was US$72.8 billion, according to data compiled by Bloomberg.</p><p>In the fiscal fourth quarter, which ended on Jan. 25, revenue gained 73 percent to US$68.1 billion. Profit a shares was US$1.62, excluding certain items. Analysts had predicted US$65.9 billion in sales and US$1.53 earnings per share.</p><p>Adjusted gross margin was 75.2 percent.</p><p>Nvidia’s data center unit had revenue of US$62.3 billion in the quarter. That compared with an average analyst estimate of US$60.4 billion.</p><p>Other areas were not as strong. Gaming generated US$3.73 billion in sales. The average estimate was US$4.01 billion. Automotive-related sales were US$604 million, with Wall Street predicting US$643 million.</p><p>One cloud is hanging over the technology industry — a shortage of memory chips — and that has held back the gaming division, Kress said.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/27/2003852946",
            "pub_date": "2026-02-27 00:05:59",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rare earth shortages worsen in US aerospace, chips despite trade truce, sources say",
            "description": "<div class=\"archives\">\n\n\n<p>Suppliers to US aerospace and semiconductor firms face worsening rare earth shortages, with two turning away some clients, industry insiders said, weeks before US President Donald Trump is expected to meet his Chinese counterpart Xi Jinping (習近平) for a summit in Beijing.</p><p>The shortages center on rare earths such as yttrium and scandium, niche members of the family of 17 elements, which play tiny but vital roles in defense technology, aerospace and semiconductors and are almost entirely produced in China.</p><p>While Beijing has allowed many rare earth exports to resume since it imposed restrictions in April last year, shipments of these materials still rarely make it to the US despite the October detente with Washington, Chinese customs data show.</p><p>That easing of trade tensions, premised in part on China pausing its critical mineral export restrictions, will be on the table when Trump and Xi meet in Beijing next month.</p><p>A key pain point is yttrium, used in coatings that keep engines and turbines from melting at high temperatures. Without regular application of these coatings, engines cannot be used.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>Since Reuters first reported about yttrium shortages in November last year, prices have jumped 60 percent and are now about 69 times as high as a year ago. Some coatings manufacturers are also now starting to ration material, according to company executives and traders.</p><p>Executives at two North American firms that buy yttrium to make coatings told Reuters they have needed to temporarily pause production due to shortages. One is also now turning away smaller and offshore customers in order to conserve supply for larger clients, which include certain engine makers.</p><p>Another firm in the coating supply chain recently ran out of material and stopped selling products containing yttrium oxide, according to a source with direct knowledge of the matter.</p><p>While shortages of yttrium and scandium have not weighed on production of jet engines or chips yet, a US government official told Reuters some US manufacturers now face “shortages” of certain rare earths from China.</p><p>China exported 17 tonnes of yttrium products to the US in the eight months after controls were introduced in April last year versus 333 tonnes in the eight months before the measures.</p><p>A White House official said the Trump administration is committed to ensuring access to critical minerals for all US businesses.</p><p>“This includes negotiating with China and monitoring compliance with President Trump’s agreement with President Xi, as well as developing alternative supply chains as warranted.”</p><p>While low yttrium supplies have not hurt engine production, manufacturers remain concerned, aerospace supply chain specialist Kevin Michaels said.</p><p>“This is a watch item and a tangible example of how China is flexing its rare earth muscle,” said Michaels, managing director at US consultant AeroDynamic Advisory.</p><p>Enginemakers are already struggling to meet demand for spare parts from airlines and higher production by planemakers Boeing Co and Airbus SE.</p><p>In addition to yttrium, US semiconductor makers are running low on scandium, putting production of next-generation 5G chips at risk, SemiAnalysis founder and CEO Dylan Patel said.</p><p>With global production of only several tens of tonnes a year, scandium plays small but important parts in fuel cells, specialty aluminium aerospace alloys and advanced chip processing and packaging.</p><p>Major US semiconductor manufacturers all rely on scandium for making chip components that “go into essentially every 5G smartphone and base station,” Patel said.</p><p>US chipmakers have experienced delays in receiving new scandium export licenses from China in recent months and have reached out to Washington for help, two industry sources said.</p><p>Many of these firms had obtained scandium from third-country suppliers, another US official said, but China requires license applicants to declare their end-users.</p><p>“Our thesis is that it is precisely the semi industry being targeted,” the US official said.</p><p>“The US currently has zero domestic scandium production and no operational alternative sources outside China,” Patel said, adding that stockpiles are likely in months rather than years.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/27/2003852947",
            "pub_date": "2026-02-27 00:10:52",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fortune seekers",
            "description": "<div class=\"archives\">\n\n\n<p>People dressed as the “God of Wealth” stand outside a jewelry store in Hanoi yesterday. Vietnamese believe that purchasing gold products on the 10th day of the first lunar month, known as “God of Wealth Day,” brings good fortune throughout the year.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/27/2003852948",
            "pub_date": "2026-02-27 00:10:53",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Unemployment drops to 26-year low",
            "description": "<div class=\"archives\">\n\n<h2>\n<font class=\"red\">‘STABLE LABOR MARKET’:</font>\n                        The vibrant stock market has generated wealth effects that support consumption, further stabilizing employment, a DGBAS official said                    </h2>\n\n<p>The unemployment rate fell last month for the fifth consecutive month, reaching the lowest level in 26 years as robust economic growth, rising wages and buoyant equity markets underpinned labor demand, the Directorate-General of Budget, Accounting and Statistics (DGBAS) said yesterday.</p><p>The jobless rate edged down 0.01 percentage points from December last year to 3.29 percent and was steady at 3.36 percent after seasonal adjustments, DGBAS data showed.</p><p>DGBAS Deputy Director Tan Wen-ling (譚文玲) attributed the decline mainly to fewer workers quitting due to dissatisfaction, as companies increased salaries and handed out generous bonuses amid a solid economic backdrop.</p><p>“Improved business conditions, salary hikes, a rallying stock market and higher bonus payouts have lifted household disposable income and contributed to a stable labor market,” Tan said.</p><p>The number of unemployed people last month fell by 2,000 from a month earlier to 396,000, the data showed.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>People out of work due to dissatisfaction with their previous job dropped by 2,000, as did those out of work due to health reasons, the data showed.</p><p>However, layoffs tied to business downsizing or closures increased by 3,000 from a month earlier, although the figure was unchanged from a year earlier, the data showed.</p><p>There was a decline in layoffs related to corporate cutbacks and voluntary departures in the second half of last year, as exports gained steam, Tan said.</p><p>The DGBAS last month said the economy expanded 8.68 percent last year and projected GDP growth of 7.71 percent this year, a pace that has encouraged firms to increase wages and bonuses, she said.</p><p>The vibrant stock market has also generated wealth effects that support consumption, further stabilizing employment, she said.</p><p>For the first time, the DGBAS also released employment data based on the “resident population,” instead of the traditional household registration system.</p><p>The measure includes migrant workers and foreign white-collar professionals in Taiwan, while excluding nationals working overseas, offering a better reflection of domestic labor market conditions.</p><p>Under the resident population measure, the unemployment rate was 3.25 percent, lower than the household registration-based figure, the data showed.</p><p>Migrant workers typically move to Taiwan for employment and therefore contribute to relatively stable job statistics, Tan said.</p><p>By education level, university graduates posted the highest unemployment rate at 4.47 percent, followed by senior-high and vocational high-school graduates at 2.99 percent, and those with postgraduate degrees at 2.89 percent, the data showed.</p><p>By age group, unemployment among people aged 15 to 24 stood at 11.44 percent as first-time job seekers adjusted to the workplace. The rate was 5.93 percent for those aged 25 to 29 and 3.43 percent for those aged 30 to 34, the data showed.</p><p>The average duration of unemployment was 21.2 weeks, the data for last month showed, 0.6 weeks longer than the data showed a month earlier.</p><p>First-time job seekers were unemployed for an average of 23.1 weeks, up 0.4 weeks, the DGBAS said.</p><p>Tan said that people changing jobs could push the unemployment rate higher in the next few months, as workers often switch jobs after collecting year-end bonuses.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/26/2003852880",
            "pub_date": "2026-02-26 00:08:10",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Samsung, SK Hynix rise as KOSPI exceeds 6,000",
            "description": "<div class=\"archives\">\n\n\n<p>South Korea’s equity benchmark yesterday crossed a new milestone just a month after surpassing the once-unthinkable 5,000 mark as surging global memory demand powers the country’s biggest chipmakers.</p><p>The KOSPI advanced as much as 2.6 percent to a record 6,123, with Samsung Electronics Co and SK Hynix Inc each gaining more than 2 percent.</p><p>With the benchmark now up 45 percent this year, South Korea’s stock market capitalization has also moved past France’s, following last month’s overtaking of Germany’s.</p><p>Long overlooked by foreign funds, despite being undervalued, South Korean stocks have now emerged as clear winners in the global market.</p><p>The so-called “artificial intelligence (AI) scare trade” has proven a boon for the country, where software stocks play only a minor role and hardware manufacturers continue to drive the market higher.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>Corporate governance reforms have helped fuel the rally, with the South Korean legislature expected to pass a bill later yesterday requiring companies to cancel treasury shares.</p><p>“With the KOSPI now at 6,000, upside from here is likely to be more incremental, and sustainability will depend on earnings delivery and a meaningful broadening beyond a handful of semiconductor heavyweights,” said Jung In-yun, chief executive officer at Fibonacci Asset Management Global. “Absent that, some consolidation or rotation across sectors wouldn’t be surprising.”</p><p>The US Supreme Court’s decision on Friday last week to strike down US President Donald Trump’s “reciprocal” tariffs is also seen as a boost for South Korean equities.</p><p>Tiffany Hsiao, portfolio manager at Matthews, expects South “Korean exporters tied to US consumer demand — particularly in electronics and components — would benefit from any reduction in tariff uncertainty.”</p><p>There are early signs that retail investors, who have traditionally favored US stocks over local ones, are returning home. Such a shift, if sustained, could drive the next leg of the rally.</p><p>Late last month, South Korea’s market value overtook Germany’s, and this week it climbed to US$3.76 trillion, exceeding France’s, despite its much smaller economy.</p><p>Such a swift advance might normally spark concern and some market watchers are closely monitoring valuations.</p><p>“I was looking at buying KOSPI futures, but given the relative move in KOSPI the past month, it’s a tough call to initiate new longs,” said Matthew Haupt, portfolio manager at Wilson Asset Management in Sydney.</p><p>Samsung share prices have nearly quadrupled since the start of last year, while those for SK Hynix have jumped sixfold.</p><p>However, analysts remain broadly bullish, citing that South Korea’s two leading chipmakers are likely to continue to benefit from the ongoing memory crunch and sustained AI demand.</p><p>Citigroup Inc and Macquarie Capital raised target prices overnight, with Macquarie’s forecast for Samsung implying a 65 percent upside from the current share price.</p><p>Nomura recently raised its target on the KOSPI gauge to as high as 8,000 in the first half of the year, citing a memory supercycle, earnings in the AI capex chain and defense sector, and a re-rating of the physical AI supply chain.</p><p>“If [South] Korea can accelerate its corporate value reform and structural improvement of the KOSDAQ, we expect a further re-rating beyond 8,000,” Nomura analysts including Cindy Park and Dongmin Lee wrote in a note.</p><p>The path to 8,000 also hinges on whether the South Korean government can deliver the reforms promised through multiple revisions of the Commercial Act, the nation’s main business law, Park and Lee wrote.</p><p>The latest proposal, requiring the cancelation of treasury shares, would eliminate a mechanism that governance experts say conglomerate owners have used to reinforce control with minimal direct holdings.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/26/2003852881",
            "pub_date": "2026-02-26 00:08:11",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lite-On expects Q1 revenue bump",
            "description": "<div class=\"archives\">\n\n\n<p>Lite-On Technology Corp (光寶科技) expects revenue this quarter to grow sequentially and year-on-year, driven by demand for advanced artificial intelligence (AI) power management systems, as well as integrated power and energy-storage racks, company president Anson Chiu (邱森彬) told an earnings conference in Taipei yesterday.</p><p>The company expects the growth momentum to extend into next quarter and through the rest of the year, Chiu said.</p><p>Demand for integrated power racks boosted shipments last quarter of the company’s 33 kilowatt (kW) power shelves and backup battery units (BBUs) after it added several new US cloud service providers to its customer base, he said.</p><p>Lite-On plans to begin mass production of its new 110kW power shelves next quarter to support Nvidia Corp’s next-generation Rubin platform, he said.</p><p>With the rollout of the new power shelves, the company expects AI-related business to contribute more than 30 percent to total revenue this year, up from 20 percent last year, Chiu said.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>The company began mass production of its 50 volt direct-current power racks earlier this quarter, while its 800-volt high-voltage direct-current (HVDC) rack system is undergoing testing and could enter volume production by the end of this year, he said.</p><p>Lite-On yesterday reported fourth-quarter net profit of NT$3.86 billion (US$123.17 million), down 16.89 percent quarter-on-quarter, but up 26.6 percent year-on-year.</p><p>Earnings per share fell to NT$1.7, from NT$2.05 in the previous quarter and NT$1.33 a year earlier.</p><p>Fourth-quarter revenue last year rose 16 percent year-on-year to NT$44.36 billion, driven by growth in cloud computing and AI-of-Things applications, the company said.</p><p>Sales in the cloud computing and AI-of-Things segments accounted for 48 percent of total sales, followed by the information technology and consumer electronics segment at 37 percent and the optoelectronics segment at 15 percent, it said.</p><p>Gross margin fell to 21.7 percent, down 3.3 percentage points quarter-on-quarter, due to an accounting adjustment related to tariffs, but up 0.4 percentage points from a year earlier, the company said.</p><p>Lite-On’s BBU capacity remains tight after doubling output last year, Chiu said.</p><p>The company plans to double BBU capacity again this year, he said.</p><p>The company plans to increase the number of its BBU production lines to 12 this year from eight last year, while also developing a new type of BBU tailored for 800 volt HVDC systems in addition to its existing products, he said.</p><p>Total capital expenditure this year is expected to rise 57.1 percent to NT$11 billion from last year, with most spending earmarked for its plants in Vietnam and Kaohsiung, Lite-On chief financial officer K.T. Lim (林建忠) said.</p><p>All of the new capacity is expected to go online as early as the third quarter, Lin said.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/26/2003852882",
            "pub_date": "2026-02-26 00:08:11",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        }
    ]
}