{
    "data": [
        {
            "title": "How should journalists govern use of AI in their products?",
            "description": "<div class=\"archives\">\n\n<h3>A vast majority of US consumers believe that it is very important that newsrooms tell the public when AI is used to write stories or edit photographs, the University of Minnesota’s Benjamin Toff says</h3>\n\n<p>Like so many sectors of the economy, the news industry is hurtling toward a future where artificial intelligence (AI) plays a major role — grappling with questions about how much the technology is used, what consumers should be told about it, whether anything can be done for the journalists who would be left behind. </p><p>These issues were on the minds of reporters for the independent outlet ProPublica as they walked picket lines last month. They are inching toward a potential strike, in what is believed would be the first such job action in the news business where how to deal with AI is the chief sticking point. </p><p>Few expect this dispute would be the last. </p><p>AI has undeniably helped journalists, simplifying complex tasks and saving time, particularly with data-focused stories. News organizations are using it to help sift through the Epstein files. AI suggests headlines, summarizes stories. Transcription technology has largely eliminated the need for a human to type up interviews. These days, even a simple Google search frequently involves AI. </p><p>Yet rushing to see how AI can help a financially troubled industry has resulted in several cases of publications owning up to errors. </p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>Within the past year, Bloomberg issued several corrections for mistakes in AI-generated news summaries. Business Insider and Wired were forced to remove articles by a fake author named Margaux Blanchard. The Los Angeles Times had trouble with AI and opinion pieces. Ars Technica said AI fabricated quotes, and the publication that has frequently reported on the risks of overreliance on AI tools embarrassed itself further by failing to follow its policy to tell readers when the tool is used. </p><p>The ProPublica dispute is noteworthy for how it touches on issues that are frequently cause for debates. The union representing ProPublica’s journalists, negotiating its first contract with the outlet known for investigative reporting, says it wants commitments that mirror those sought elsewhere in the industry about disclosure and the role of humans in the use of AI. </p><p>Along with holding informational pickets, union members pledged overwhelmingly that they would be willing to strike without a satisfactory agreement, New York Guild spokeswoman Jen Sheehan said. </p><p>“It feels to me pretty monumental when we think about the trajectory of AI and journalism,” said Alex Mahadevan, an expert on the topic at the Poynter Institute journalism think tank. </p><p>ProPublica has rejected its requests, the union said. </p><p>Insight into why can be found in an essay, “Something Big is Happening,” that circulated widely last month. Author and investor Matt Shumer, who said he has spent six years building an AI start-up, wrote that the technology is advancing so quickly that “if you haven’t tried AI in the last few months, what exists today would be unrecognizable to you.” </p><p>Small wonder, then, that news executives are reluctant to put guarantees in writing that could quickly become outdated. </p><p>Rather than make promises that cannot be kept, ProPublica is exploring how technology can create more space for investigative reporting, company spokesman Tyson Evans said. </p><p>In the “unlikely event” of AI-related layoffs, ProPublica is proposing expanded severance packages for those affected, he said. </p><p>“We’re approaching AI with both curiosity and skepticism,” Evans said. “It would be a mistake to freeze editorial decisions in a contract that will last years.” </p><p>Fifty-seven of 283 contracts at US news organizations negotiated by the NewsGuild-USA contain language related to AI, said Jon Schleuss, president of the union that represents more journalists than any in the US. </p><p>The first such deals happened in 2023. He wants provisions in more contracts. </p><p>It would not be easy, judging by the reluctance of many outlets to be tied down. The organization Trusting News, which encourages news organizations to develop and make public its policies on AI use, estimates that less than half of US outlets have done so. </p><p>“I think it is becoming harder,” Schleuss said, “because too many newsrooms are being run by the greedy side of the organization and not by the journalism side of the organization.” </p><p>The New York guild is pushing for contracts that guarantee AI would not eliminate jobs. That is no surprise; unions exist to protect jobs. Schleuss characterized a proposal that ensures an actual journalist is involved when AI is used to prevent errors and help an outlet build trust with its readers. </p><p>“Humans are actually so much better at going out, finding the story, interviewing sources, bringing back the relevant pieces, asking the hard follow-up questions and putting that in a way that people can understand and see, whether it’s a news story or a video,” he said. “Humans are way better at doing that than AI ever will be.” </p><p>Apparently, not everyone in journalism agrees. Chris Quinn, editor of the Plain Dealer in Cleveland, Ohio, last this month of his disgust with a recent college graduate who turned down a job offer, because the person had been taught that AI was bad for journalism. </p><p>Quinn’s newspaper has been sending some of its journalists out to cover stories by interviewing people, collecting quotes and information, then feeding it to a computer to write. While a human would edit what the computer spits out, an integral part of the process — a reporter using his or her judgement about how to tell a story — has been stripped from their hands. Quinn defended it as the best use of limited resources. </p><p>Research shows that a vast majority of US consumers believe that it is very important that newsrooms tell the public when AI is used to write stories or edit photographs, said Benjamin Toff, director of the Minnesota Journalism Center at the University of Minnesota. </p><p>However, here is the rub: Such disclosure makes them trust the outlet’s stories less, not more. </p><p>A significant minority — 30 percent in a study Toff conducted last year — does not want AI used in journalism at all. </p><p>Telling a reader that AI was used is not as simple as it sounds. </p><p>“There are just so many, many uses of AI in journalism, from the very beginning of the reporting process to when you hit publish, that just broadly declaring that when AI is used in the newsgathering process that you have to disclose it, just seems like it is actually a disservice to the reader in some cases,” Mahadevan said. </p><p>Two lawmakers in New York state — the US’ publishing capital — introduced legislation last month requiring clear disclaimers when AI is used in published content. There is no immediate word on its chances for passage, but both sponsors are Democrats in a legislature controlled by that party. </p><p>Mahadevan believes it is fair to have policies that require human involvement — editing to prevent slip-ups, for example. </p><p>However, even these declarations are open to interpretation, he said. </p><p>If an outlet uses chatbots to answer reader questions, are they being edited by a human being? </p><p>“Speaking realistically, the newsroom of the future is going to look completely different than it does today,” Mahadevan said. “Which means people will lose jobs. There will be new jobs. So, I think it’s important that we are having these conversations right now, because audiences do not want a newsroom completely taken over by AI.”</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/03/01/2003853042",
            "pub_date": "2026-03-01 00:05:57",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zimbabwe bans lithium exports",
            "description": "<div class=\"archives\">\n\n\n<p>Zimbabwe’s ban on raw lithium exports is forcing Chinese miners to rethink their strategy, speeding up plans to process the metal locally instead of shipping it to China’s vast rechargeable battery industry. </p><p>The country is Africa’s largest lithium producer and has one of the world’s largest reserves, according to the US Geological Survey (USGS). </p><p>Zimbabwe already banned the export of lithium ore in 2022 and last year announced it would halt exports of lithium concentrates from January next year. </p><p>However, on Wednesday it imposed the ban with immediate effect, leaving unclear what the lithium mining sector would do in the short term, as Zimbabwe has no facilities to process lithium concentrates. </p><p>The move, which also included a blanket ban on export of all raw minerals, aims to capture the added value of refining and processing, thus creating jobs and additional government tax revenue. </p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>However, critics say the push to refine should have come sooner, with Zimbabwe already having lost out on several years of revenues for the hard-pressed local economy. </p><p>Prospect Lithium Zimbabwe, owned by Zhejiang Huayou Cobalt, has spent US$400 million on a processing plant that should be operational in the coming weeks, its representative Patience Chizodza told Zimbabwean state broadcaster ZBC. </p><p>It would reportedly be the first factory in Africa to refine lithium concentrate into lithium sulfate — a powdered form that is one step closer to the product used in batteries. </p><p>The facility should be capable of handling 400,000 tonnes a year of concentrate. </p><p>The Zimbabwean state-owned Mutapa Energy Minerals is set to start work in the coming months on a similar plant, chief executive officer Innocent Rukweza told reporters last month. </p><p>“We expect that by mid-year — around June at the latest — construction of a concentrate-processing plant will be under way,” Rukweza said. </p><p>The US$270 million facility funded by Chinese firms would be able to process 600,000 tonnes annually, he said. </p><p>Bikita Minerals, Zimbabwe’s largest lithium mine and owned by Sinomine Resources Group, is working on feasibility studies for the construction of a lithium sulphate plant in December, spokesman Tinomuda Chakanyuka said. </p><p>“The project, which will be developed in phases, represents an estimated investment of approximately US$500 million from shareholders,” Chakanyuka said. </p><p>The facility would increase local capacity to separate minerals and “contribute to Zimbabwe’s broader industrialization and export diversification objectives,” he added. </p><p>Global demand for the soft, white metal was up 20 percent last year from 2024, with a key factor being electric vehicle sales growth in China and Europe and increased demand for batteries, the USGS said. </p><p>Zimbabwe’s exports of lithium concentrate rose to 1.5 million tonnes last year, generating the Zimbabwean government revenue of US$571.6 million, the Minerals Marketing Authority of Zimbabwe announced in early last month. </p><p>The Zimbabwean government’s moves to ban exports of raw minerals did not impress its critics. </p><p>“Government is doing too little, too late,” said Farai Maguwu, executive director of Zimbabwe’s Center for Natural Resource Governance. </p><p>With the new rush for critical minerals around the world, “people are asking serious questions about the benefits to the producer country,” he said. </p><p>“A country like Zimbabwe is exporting raw lithium and, in the process, enriching China at its own expense,” Maguwu said. </p><p>Instead it should be building its own “mine-to-market ecosystem” that manufactures and markets lithium products, he added. </p><p>Economist Godfrey Kanyenze accused the Zimbabwean government of a “deficit in policy implementation” when it effectively gave a five-year grace period on the 2022 lithium ore ban by allowing exports of raw concentrates. </p><p>Kanyenze said state oversight at Chinese-owned lithium mines was limited, making it difficult to determine how much companies produced and earned. </p><p>There have also been allegations of environmental damage and exploitation of workers, including by paying low wages. </p><p>“Zimbabwe must learn from countries like Norway, Botswana and Kuwait, which safeguard their natural resources through firm, consistent and strategic policy frameworks,” he said. </p><p>SEE CONGO’S ON PAGE 7</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/03/01/2003853043",
            "pub_date": "2026-03-01 00:05:57",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "F1 hopes to fuel growth in North America",
            "description": "<div class=\"archives\">\n\n\n<p>Formula One is well anchored in the US with its American owners and three Grand Prix races, but the sport hopes to push its growing popularity further with the help of Netflix and Apple. </p><p>The Netflix documentary F1: Drive to Survive, which began its eighth season on Friday, has already taken motor sport’s top discipline into a new dimension. </p><p>The series provides a behind-the-scenes look at the sport’s drivers, managers and team owners. </p><p>While critics complain that the series magnifies tensions between drivers and managers for entertainment value, it has introduced a younger audience, particularly women, to F1. </p><p>The documentary series and the additional races in the US have been “seismic changes in terms of where we were as a sport,” said Liam Parker, head of communications for F1, which has been a subsidiary of US group Liberty Media since 2016. </p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>Founded in 1991, Nasdaq-listed Liberty Media has spent the past decade pushing hard to boost F1’s audience in the US, where NASCAR and IndyCar dominate. </p><p>Drive to Survive co-executive producer Tom Rogers believes F1 has enormous potential in the US thanks to it now hosting three Grand Prix races — in Miami, Las Vegas and Austin, Texas. </p><p>Out of F1’s global audience of about 800 million viewers, only about 52 million are in the US, Parker said. </p><p>“We’re not really scratching the surface in the US in terms of what we can do given the size of that audience,” he said recently in Bahrain, where F1 held a series of preseason tests. </p><p>The sport is also still basking in the success of F1: The Movie starring Brad Pitt. In addition to box office success last year, the film garnered four Oscar nominations, including for best picture. </p><p>This year, five of the 24 Grand Prix races would be broadcast live at giant-screen IMAX theatres across the US. </p><p>This year also sees a switch in TV broadcasting rights from Disney’s ESPN to Apple TV. </p><p>The deal is worth a reported US$150 million per year to F1, US media reported. </p><p>“When we are talking about Apple in the US, we are talking about a new partner of Formula 1 that is believing in us with a great plan of being the protagonist of the growth in the US,” F1 chief executive officer Stefano Domenicali said. </p><p>However, F1 is setting its sights on more than just the US. </p><p>“I think we’re all anticipating probably a Latin American boost in Formula One interest... with Franco” Colapinto, the Argentinian driver for Alpine, Rogers said. </p><p>“And I think Latin America is an enormous market, especially for Netflix,” he added. </p><p>Mexican driver Sergio Perez with Cadillac and Brazilian Gabriel Bortoleto with Audi are also draws for Latin American viewers.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/03/01/2003853044",
            "pub_date": "2026-03-01 00:05:58",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wiwynn expects revenue to increase",
            "description": "<div class=\"archives\">\n\n<h2>\n<font class=\"red\">SHIPMENTS BOOST: </font>\n                        The firm expects this year’s shipments of general-purpose servers to exceed last year’s, with AI servers to account for more than half of sales                    </h2>\n\n<p>Cloud computing equipment supplier Wiwynn Corp (緯穎科技) on Thursday said it expects revenue this year to exceed last year’s level, as shipments of new servers based on application-specific integrated circuits (ASIC) and graphics processing units (GPU) are set to begin in the second half of this year.</p><p>Shipments of both platforms are expected to drive growth and raise the share of artificial intelligence (AI) revenue this year, Wiwynn chairwoman Emily Hong (洪麗甯) told an online earnings conference.</p><p>Revenue from AI servers this year is expected to remain dominated by ASIC orders, while on the GPU side, the company is shifting its focus to Nvidia Corp’s next-generation servers, Hong said.</p><p>Wiwynn is positive about orders for its ASIC-based AI servers and general-purpose servers this quarter, as order momentum is expected to support stable year-on-year growth, company CEO and president William Lin (林威遠) said.</p><p>Meanwhile, as customers increasingly separate AI workloads from general computing due to cost considerations, demand for general-purpose servers has risen, giving Wiwynn strong visibility into shipment growth for such systems, Lin said.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>Shipments of general-purpose servers this year are expected to exceed last year’s level, with year-on-year growth projected in each quarter, he said.</p><p>Last year, AI servers and general-purpose servers each accounted for about half of the company’s revenue, Lin said.</p><p>Within the AI segment, servers powered by ASICs made up about 90 percent of the revenue, he added.</p><p>This year, AI servers are expected to account for more than half of the company’s total revenue, Lin said.</p><p>For the second half of this year, Wiwynn has not only secured new ASIC-based server orders, but also those powered by GPUs from Nvidia and Advanced Micro Devices Inc, he said.</p><p>The recent surge in memory prices has had little effect on Wiwynn’s profitability so far, despite memory accounting for about 30 percent of the bill of materials (BOMs) for its general-purpose servers — a share that could rise further if prices continue climbing, he said.</p><p>Memory accounts for a relatively small share of AI server BOM costs, as such systems are already pricy, and the company has secured sufficient memory supply through at least next quarter, Lin said.</p><p>Wiwynn is expanding production capacity in Taiwan, Malaysia, Mexico and the US, with output from its new Texas plant going online last quarter and mass production expected to begin in the first half of this year, he said.</p><p>The company’s capital expenditure this year is expected to rise significantly from NT$13 billion (US$415.99 million) last year to meet AI demand, he said.</p><p>To cope with increases in operating funds as the cost of producing server racks surges, as are costs for components such as memory chips, Wiwynn is adjusting its cash dividend distribution approach this year, Hong said.</p><p>Wiwynn’s board on Thursday approved its first dividend policy combining cash and stock payouts, with a cash dividend of NT$145 per share and a stock dividend of NT$20 per share for last year.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/28/2003853000",
            "pub_date": "2026-02-28 00:06:10",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Smartphone market set to shrink 12.9 percent: IDC",
            "description": "<div class=\"archives\">\n\n<h2>\n<font class=\"red\">‘SEISMIC SHIFT’: </font>\n                        The researcher forecast there would be about 1.1 billion mobile shipments this year, down from 1.26 billion the prior year and erasing years of gains                    </h2>\n\n<p>The global smartphone market is expected to contract 12.9 percent this year due to the unprecedented memorychip shortage, marking “a crisis like no other,” researcher International Data Corp (IDC) said.</p><p>The new forecast, a dramatic revision down from earlier estimates, gives the latest accounting of the ongoing memory crunch that is affecting every corner of the electronics industry. The demand for advanced memory to power artificial intelligence (AI) tasks has drained global supply until well into next year and jeopardizes the business model of many smartphone makers.</p><p>IDC forecast about 1.1 billion mobile shipments this year, down from 1.26 billion the prior year and erasing years of gradual gains.</p><p>Smartphone manufacturers are adapting to the elevated component costs by reining in specifications, eliminating unprofitable entry-level models and pushing consumers to buy more premium devices.</p><p>“The tariffs and [COVID-19] pandemic crisis seem a joke compared to this,” IDC senior research director Nabila Popal said. “The smartphone market will witness a seismic shift by the time this crisis is over — in size, average selling prices and competitive landscape. We don’t expect the situation to ease up until mid-2027, at least.”</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>Another research firm, Counterpoint, yesterday issued a similarly dire forecast, predicting a decline of 12.4 percent for smartphone sales this year, citing a “full-scale supply shock” related to memory chips.</p><p>This year “is shaping up to be the worst year in smartphone history,” Counterpoint analyst Yang Wang (汪洋) said. “The industry has never seen a drop this steep.”</p><p>The spiking cost of chips — both DRAM for handling processing tasks and NAND for storage — is affecting already thin profit margins for many Android device brands. Chinese players such as Xiaomi Corp (小米) and Oppo (歐珀) engage in a fierce battle for consumers, spending heavily on the top components, to secure a larger share of the domestic market and burnish their credentials on the global stage.</p><p>Their entry-level devices are most exposed to the new cost pressures, as memory represents a larger share of their cost of materials, IDC said.</p><p>“We just wish there was more memory,” said Cristiano Amon, chief executive officer of Qualcomm Inc, the biggest provider of mobile processors, after reporting earnings this week. “That issue is not just the price. The issue is just availability. So I think the memory availability will determine the overall size of the handset market.”</p><p>Premium handsets, such as the bulk of Apple Inc’s iPhone lineup, would weather the crisis better, although companies such as Xiaomi and Lenovo Group Ltd (聯想) have warned that consumer prices might have to rise.</p><p>The memory shortage is set to extend into next year and even when supply is replenished, returning to the old pricing structures now appears unlikely.</p><p>“The days of cheap smartphones are gone, as even when the crisis is over, we don’t expect memory prices to go back down to 2025 levels,” Popal said.</p><p>Last year, there were about 170 million smartphones shipped that cost below US$100, a segment that IDC said is now uneconomical to maintain.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/28/2003853001",
            "pub_date": "2026-02-28 00:06:10",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japanese state hands Rapidus US$1.6 billion",
            "description": "<div class=\"archives\">\n\n\n<p>The Japanese government would invest ￥250 billion (US$1.6 billion) in state-backed Rapidus Corp as part of Japanese Prime Minister Sanae Takaichi’s pledge to boost domestic chipmaking.</p><p>The latest funding, which would be distributed over the next two financial years, brings Japan closer to its goal of providing ￥3 trillion in total support to help Rapidus mass-produce 2-nanometer logic chips and potentially challenge industry leader Taiwan Semiconductor Manufacturing Co (TSMC, 台積電).</p><p>Under the new arrangement, the government would initially hold only about 10 percent of Rapidus’ voting shares and own the majority of its stake in non-voting stock, Japanese Ministry of Economy, Trade and Industry official Tomoshige Nambu said yesterday.</p><p>However, the state retains the right to convert them into voting shares to seize majority control if the company faces financial distress.</p><p>The government would also acquire “golden shares,” granting it the ultimate veto power over major corporate changes, Nambu said.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>Takaichi has doubled down on her predecessors’ semiconductor ambitions, viewing domestic production as a pillar of economic security.</p><p>The ministry is set to nearly quadruple its budgeted support for cutting-edge semiconductors and artificial intelligence (AI) development to about ￥1.23 trillion for the fiscal year starting in April.</p><p>The push comes as geopolitical tensions and a surge in generative AI heighten the strategic importance of high-end silicon.</p><p>On top of state support, Rapidus has also secured ￥167.6 billion from about 30 private companies to help its goal of launching mass production by March 2028.</p><p>Still, Takaichi’s government is not pinning its chipmaking ambitions on Rapidus alone. The prime minister has also secured a pledge from TSMC that it would upgrade its technology and plants in Japan.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/28/2003853002",
            "pub_date": "2026-02-28 00:06:10",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New ASML machines are ready for manufacturers",
            "description": "<div class=\"archives\">\n\n\n<p>ASML Holding’s next-generation chipmaking machine is ready for manufacturers to start bringing it into use for production at high volumes, a senior executive said — a big step for the chip industry.</p><p>The Dutch company produces the world’s only commercial extreme ultraviolet lithography (EUV) tools, which are a critical piece of equipment for chipmakers.</p><p>The new tool would help chipmakers such as Taiwan Semiconductor Manufacturing Co (台積電) and Intel produce more powerful and efficient chips by eliminating several costly and complex steps from the chip-manufacturing process, ASML data showed.</p><p>ASML planned to release the data, which represents a key milestone, at a technical conference in San Jose, California, on Thursday, company chief technology officer Marco Pieters said on Wednesday.</p><p>It has taken ASML years to develop the next-generation tools, as chipmakers have attempted to determine at what point it makes economic sense to begin to use them for mass production.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>However, given that the current generation of EUV tools is approaching the technical limit of their ability to make complex artificial intelligence (AI) chips, the next-generation machines — called High-NA EUV tools — are key for the AI industry to improve chatbots such as OpenAI’s ChatGPT and help chipmakers deliver their AI chip road maps on time to meet surging demand.</p><p>The new tools cost about US$400 million, twice the cost of the original EUV machines.</p><p>The High-NA EUV tools now experience limited downtime, have produced 500,000 dinner-plate-sized silicon wafers and can draw sufficiently precise patterns that make up the circuits on the chip, the ASML data showed.</p><p>In combination, the three data points indicate the tools are ready for manufacturers.</p><p>“I think that it’s at a critical point to look at the amount of learning cycles that have happened,” Pieters said, referring to the number of tests that have been conducted on the machines by customers.</p><p>Despite their technical readiness, it would take two to three years for companies to conduct enough testing and development to integrate them into manufacturing.</p><p>Chipmakers “have all the knowledge to qualify these tools,” Pieters said.</p><p>The company has achieved about 80 percent uptime at the moment and plans to achieve 90 percent by the end of the year, he added.</p><p>The imaging data ASML was to release are enough to convince customers to replace multiple steps with the older-generation tools with a single High-NA step, Pieters said.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/28/2003853003",
            "pub_date": "2026-03-01 00:18:05",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Delta optimistic on Q1 revenue",
            "description": "<div class=\"archives\">\n\n<h2>\n<font class=\"red\">EXPANSION: </font>\n                        Delta Electronics is planning to expand its capacity in Thailand, India and the US, and has visited Mexico to gauge potential future investment there                    </h2>\n\n<p>Power supply and electronic components maker Delta Electronics Inc (台達電) yesterday said that it is optimistic about revenue this quarter and for the full year, as artificial intelligence (AI) infrastructure continues to drive demand for its power and thermal management products.</p><p>While the first quarter is typically a slow season due to the Lunar New Year holiday, the impact is expected to be milder this year as AI data center power products account for a growing share of revenue, Delta Electronics chairman Ping Cheng (鄭平) said at an earnings conference in Taipei.</p><p>Shipments of power products this quarter could be flat or increase slightly from last quarter, while those of cooling products are expected to decline from last quarter due to seasonality, the company said.</p><p>Demand for Delta’s products used in AI data centers is expected to remain strong this year, with shipments likely to grow steadily in the following quarters if major cloud service providers (CSPs) execute their capital expenditure plans on schedule, Delta vice president Lanford Liu (劉亮甫) said.</p><p>However, data center construction still faces multiple constraints, including the availability of land, water and power supply, and labor shortages, all of which could pose uncertainties for Delta’s shipments, Cheng said.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>A persistent shortage of memory chips is another uncertainty that could affect customers’ data center construction, he said.</p><p>Delta’s net profit last quarter fell 7 percent quarter-on-quarter, but surged 141 percent year-on-year to NT$17.3 billion (US$553.6 million), driven by continued strong demand from CSPs.</p><p>Earnings per share decreased to NT$6.67 from NT$7.16 in the previous quarter, but were up from NT$2.76 a year earlier.</p><p>Gross margin fell to 34.6 percent from 34.9 percent the previous quarter, and operating margin also fell to 16.35 percent from 16.5 percent.</p><p>Power electronics products accounted for 50 percent of Delta’s revenue of NT$161.61 billion last quarter, followed by infrastructure products at 37 percent, automation devices at 9 percent and mobility applications at 4 percent.</p><p>Total revenue last year rose 32 percent year-on-year to NT$554.9 billion, with AI-related power supply units accounting for more than 20 percent, while AI-related cooling and heat-dissipation solutions made up about 9 percent, Cheng said.</p><p>To ease capacity tightness driven by strong AI demand, the company started operating three new plants in Thailand last quarter, he said.</p><p>Delta is planning to expand its capacity in Thailand, India and the US, and has visited Mexico to gauge potential future investment there, he said.</p><p>As the electric vehicle (EV) market is expected to remain subdued over the next one to two years, Delta has decided to consolidate its EV production in Thailand from two plants to one, with the freed capacity to be reassigned for power supply products, Cheng said.</p><p>Delta spent NT$46.1 billion on capital expenditure last year and plans to increase its spending this year to support its AI and data center-related product lines, he said.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/27/2003852942",
            "pub_date": "2026-02-27 00:05:57",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netflix drops out of bidding for Warner",
            "description": "<div class=\"archives\">\n\n\n<p>Netflix Inc has dropped out of the fight to buy Warner Bros Discovery Inc, clearing the way for rival bidder Paramount Skydance Corp to clinch its US$111 billion deal for the historic Hollywood studio.</p><p>The streaming industry leader said that while it believed its deal would have cleared with regulators and created shareholder value, it did not want to keep bidding.</p><p>“We’ve always been disciplined and at the price required to match Paramount Skydance’s latest offer, the deal is no longer financially attractive,” Netflix said in a statement on Thursday.</p><p>Instead, it would keep investing in its business, including about US$20 billion this year on films, TV shows and other entertainment offerings, it said.</p><p>Netflix inked an US$82.7 billion deal, including assumed debt, to acquire the studio and streaming businesses of Warner Bros in December last year, but repeated counteroffers from Paramount for the entire company kept the auction open.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>Late on Thursday, Warner Bros deemed Paramount’s latest US$31-a-share bid the superior offer.</p><p>“Once our board votes to adopt the Paramount merger agreement, it will create tremendous value for our shareholders,” Warner Bros chief executive officer David Zaslav said in a statement. “We are excited about the potential of a combined Paramount Skydance and Warner Bros Discovery and can’t wait to get started working together telling the stories that move the world.”</p><p>Netflix’s decision not to raise its offer “has paved the way for shareholders to receive meaningfully more cash and a truly viable path to government approvals,” Ancora Holdings Group, an activist investor in Warner Bros, said in a separate statement. “This is a win-win for shareholders and the industry.”</p><p>The takeover fight has been contentious, in Hollywood and in Washington. Netflix co-CEO Ted Sarandos and Paramount CEO David Ellison traveled to the US capital this week to meet with lawmakers.</p><p>Sarandos spent about an hour on Thursday with officials in the administration of US President Donald Trump.</p><p>Ellison attended Trump’s State of the Union address on Tuesday as a guest of US Senator Lindsey Graham, a Republican from South Carolina.</p><p>Graham was also seen at the White House on Thursday.</p><p>Paramount would face ongoing scrutiny for its deal. The US Senate Judiciary Committee had scheduled a hearing for March 4 to once again examine the Warner Bros sale following a hearing earlier this month.</p><p>US Senator Cory Booker once again extended an invitation for Ellison to attend.</p><p>US Senator Elizabeth Warren also weighed in on the Paramount deal.</p><p>“A Paramount Skydance-Warner Bros merger is an antitrust disaster threatening higher prices and fewer choices for American families,” Warren said in a statement. “A handful of Trump-aligned billionaires are trying to seize control of what you watch and charge you whatever price they want.”</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/28/2003853004",
            "pub_date": "2026-03-01 00:11:43",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pikachu turns 30",
            "description": "<div class=\"archives\">\n\n\n<p>People stand in a Pokemon store in Tokyo on Thursday. One of the world highest-grossing franchises is celebrated its 30th anniversary yesterday.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/28/2003853005",
            "pub_date": "2026-03-01 00:11:44",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        }
    ]
}