{
    "data": [
        {
            "title": "Unemployment drops to 26-year low",
            "description": "<div class=\"archives\">\n\n<h2>\n<font class=\"red\">‘STABLE LABOR MARKET’:</font>\n                        The vibrant stock market has generated wealth effects that support consumption, further stabilizing employment, a DGBAS official said                    </h2>\n\n<p>The unemployment rate fell last month for the fifth consecutive month, reaching the lowest level in 26 years as robust economic growth, rising wages and buoyant equity markets underpinned labor demand, the Directorate-General of Budget, Accounting and Statistics (DGBAS) said yesterday.</p><p>The jobless rate edged down 0.01 percentage points from December last year to 3.29 percent and was steady at 3.36 percent after seasonal adjustments, DGBAS data showed.</p><p>DGBAS Deputy Director Tan Wen-ling (譚文玲) attributed the decline mainly to fewer workers quitting due to dissatisfaction, as companies increased salaries and handed out generous bonuses amid a solid economic backdrop.</p><p>“Improved business conditions, salary hikes, a rallying stock market and higher bonus payouts have lifted household disposable income and contributed to a stable labor market,” Tan said.</p><p>The number of unemployed people last month fell by 2,000 from a month earlier to 396,000, the data showed.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>People out of work due to dissatisfaction with their previous job dropped by 2,000, as did those out of work due to health reasons, the data showed.</p><p>However, layoffs tied to business downsizing or closures increased by 3,000 from a month earlier, although the figure was unchanged from a year earlier, the data showed.</p><p>There was a decline in layoffs related to corporate cutbacks and voluntary departures in the second half of last year, as exports gained steam, Tan said.</p><p>The DGBAS last month said the economy expanded 8.68 percent last year and projected GDP growth of 7.71 percent this year, a pace that has encouraged firms to increase wages and bonuses, she said.</p><p>The vibrant stock market has also generated wealth effects that support consumption, further stabilizing employment, she said.</p><p>For the first time, the DGBAS also released employment data based on the “resident population,” instead of the traditional household registration system.</p><p>The measure includes migrant workers and foreign white-collar professionals in Taiwan, while excluding nationals working overseas, offering a better reflection of domestic labor market conditions.</p><p>Under the resident population measure, the unemployment rate was 3.25 percent, lower than the household registration-based figure, the data showed.</p><p>Migrant workers typically move to Taiwan for employment and therefore contribute to relatively stable job statistics, Tan said.</p><p>By education level, university graduates posted the highest unemployment rate at 4.47 percent, followed by senior-high and vocational high-school graduates at 2.99 percent, and those with postgraduate degrees at 2.89 percent, the data showed.</p><p>By age group, unemployment among people aged 15 to 24 stood at 11.44 percent as first-time job seekers adjusted to the workplace. The rate was 5.93 percent for those aged 25 to 29 and 3.43 percent for those aged 30 to 34, the data showed.</p><p>The average duration of unemployment was 21.2 weeks, the data for last month showed, 0.6 weeks longer than the data showed a month earlier.</p><p>First-time job seekers were unemployed for an average of 23.1 weeks, up 0.4 weeks, the DGBAS said.</p><p>Tan said that people changing jobs could push the unemployment rate higher in the next few months, as workers often switch jobs after collecting year-end bonuses.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/26/2003852880",
            "pub_date": "2026-02-26 00:08:10",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Samsung, SK Hynix rise as KOSPI exceeds 6,000",
            "description": "<div class=\"archives\">\n\n\n<p>South Korea’s equity benchmark yesterday crossed a new milestone just a month after surpassing the once-unthinkable 5,000 mark as surging global memory demand powers the country’s biggest chipmakers.</p><p>The KOSPI advanced as much as 2.6 percent to a record 6,123, with Samsung Electronics Co and SK Hynix Inc each gaining more than 2 percent.</p><p>With the benchmark now up 45 percent this year, South Korea’s stock market capitalization has also moved past France’s, following last month’s overtaking of Germany’s.</p><p>Long overlooked by foreign funds, despite being undervalued, South Korean stocks have now emerged as clear winners in the global market.</p><p>The so-called “artificial intelligence (AI) scare trade” has proven a boon for the country, where software stocks play only a minor role and hardware manufacturers continue to drive the market higher.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>Corporate governance reforms have helped fuel the rally, with the South Korean legislature expected to pass a bill later yesterday requiring companies to cancel treasury shares.</p><p>“With the KOSPI now at 6,000, upside from here is likely to be more incremental, and sustainability will depend on earnings delivery and a meaningful broadening beyond a handful of semiconductor heavyweights,” said Jung In-yun, chief executive officer at Fibonacci Asset Management Global. “Absent that, some consolidation or rotation across sectors wouldn’t be surprising.”</p><p>The US Supreme Court’s decision on Friday last week to strike down US President Donald Trump’s “reciprocal” tariffs is also seen as a boost for South Korean equities.</p><p>Tiffany Hsiao, portfolio manager at Matthews, expects South “Korean exporters tied to US consumer demand — particularly in electronics and components — would benefit from any reduction in tariff uncertainty.”</p><p>There are early signs that retail investors, who have traditionally favored US stocks over local ones, are returning home. Such a shift, if sustained, could drive the next leg of the rally.</p><p>Late last month, South Korea’s market value overtook Germany’s, and this week it climbed to US$3.76 trillion, exceeding France’s, despite its much smaller economy.</p><p>Such a swift advance might normally spark concern and some market watchers are closely monitoring valuations.</p><p>“I was looking at buying KOSPI futures, but given the relative move in KOSPI the past month, it’s a tough call to initiate new longs,” said Matthew Haupt, portfolio manager at Wilson Asset Management in Sydney.</p><p>Samsung share prices have nearly quadrupled since the start of last year, while those for SK Hynix have jumped sixfold.</p><p>However, analysts remain broadly bullish, citing that South Korea’s two leading chipmakers are likely to continue to benefit from the ongoing memory crunch and sustained AI demand.</p><p>Citigroup Inc and Macquarie Capital raised target prices overnight, with Macquarie’s forecast for Samsung implying a 65 percent upside from the current share price.</p><p>Nomura recently raised its target on the KOSPI gauge to as high as 8,000 in the first half of the year, citing a memory supercycle, earnings in the AI capex chain and defense sector, and a re-rating of the physical AI supply chain.</p><p>“If [South] Korea can accelerate its corporate value reform and structural improvement of the KOSDAQ, we expect a further re-rating beyond 8,000,” Nomura analysts including Cindy Park and Dongmin Lee wrote in a note.</p><p>The path to 8,000 also hinges on whether the South Korean government can deliver the reforms promised through multiple revisions of the Commercial Act, the nation’s main business law, Park and Lee wrote.</p><p>The latest proposal, requiring the cancelation of treasury shares, would eliminate a mechanism that governance experts say conglomerate owners have used to reinforce control with minimal direct holdings.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/26/2003852881",
            "pub_date": "2026-02-26 00:08:11",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lite-On expects Q1 revenue bump",
            "description": "<div class=\"archives\">\n\n\n<p>Lite-On Technology Corp (光寶科技) expects revenue this quarter to grow sequentially and year-on-year, driven by demand for advanced artificial intelligence (AI) power management systems, as well as integrated power and energy-storage racks, company president Anson Chiu (邱森彬) told an earnings conference in Taipei yesterday.</p><p>The company expects the growth momentum to extend into next quarter and through the rest of the year, Chiu said.</p><p>Demand for integrated power racks boosted shipments last quarter of the company’s 33 kilowatt (kW) power shelves and backup battery units (BBUs) after it added several new US cloud service providers to its customer base, he said.</p><p>Lite-On plans to begin mass production of its new 110kW power shelves next quarter to support Nvidia Corp’s next-generation Rubin platform, he said.</p><p>With the rollout of the new power shelves, the company expects AI-related business to contribute more than 30 percent to total revenue this year, up from 20 percent last year, Chiu said.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>The company began mass production of its 50 volt direct-current power racks earlier this quarter, while its 800-volt high-voltage direct-current (HVDC) rack system is undergoing testing and could enter volume production by the end of this year, he said.</p><p>Lite-On yesterday reported fourth-quarter net profit of NT$3.86 billion (US$123.17 million), down 16.89 percent quarter-on-quarter, but up 26.6 percent year-on-year.</p><p>Earnings per share fell to NT$1.7, from NT$2.05 in the previous quarter and NT$1.33 a year earlier.</p><p>Fourth-quarter revenue last year rose 16 percent year-on-year to NT$44.36 billion, driven by growth in cloud computing and AI-of-Things applications, the company said.</p><p>Sales in the cloud computing and AI-of-Things segments accounted for 48 percent of total sales, followed by the information technology and consumer electronics segment at 37 percent and the optoelectronics segment at 15 percent, it said.</p><p>Gross margin fell to 21.7 percent, down 3.3 percentage points quarter-on-quarter, due to an accounting adjustment related to tariffs, but up 0.4 percentage points from a year earlier, the company said.</p><p>Lite-On’s BBU capacity remains tight after doubling output last year, Chiu said.</p><p>The company plans to double BBU capacity again this year, he said.</p><p>The company plans to increase the number of its BBU production lines to 12 this year from eight last year, while also developing a new type of BBU tailored for 800 volt HVDC systems in addition to its existing products, he said.</p><p>Total capital expenditure this year is expected to rise 57.1 percent to NT$11 billion from last year, with most spending earmarked for its plants in Vietnam and Kaohsiung, Lite-On chief financial officer K.T. Lim (林建忠) said.</p><p>All of the new capacity is expected to go online as early as the third quarter, Lin said.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/26/2003852882",
            "pub_date": "2026-02-26 00:08:11",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia has no H200 sales in China, US official says",
            "description": "<div class=\"archives\">\n\n<h2>\n<font class=\"red\">‘FOLLOW THE LAW’:</font>\n                        A US Department of Commerce official said authorities have a stringent approach to cracking down on firms that breach export control rules                    </h2>\n\n<p>Nvidia Corp has yet to sell any of its H200 chips to China two months after US President Donald Trump’s decision to allow shipments of the artificial intelligence (AI) processors to the world’s second-largest economy, US Department of Commerce Assistant Secretary for Export Enforcement David Peters said on Tuesday.</p><p>Peters told the US House of Representatives Foreign Affairs Committee that the US was boosting efforts to crack down on smuggling of advanced semiconductors used in AI.</p><p>US Representative Sydney Kamlager-Dove asked how many H200s have been approved for sale to China, to which he said: “My understanding is that so far, none.”</p><p>While Peters does not directly participate in the licensing process, his comments on H200s offer a rare window into the workings of the department’s Bureau of Industry and Security, which oversees required US approvals for exports of sensitive technology.</p><p>His testimony came as investors await Nvidia’s earnings release, when the company might outline progress toward regaining access to the lucrative Chinese market.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>Trump in December last year moved to allow Nvidia to sell H200s to select Chinese customers, but formal rules for the process, published last month by the bureau, have imposed conditions that make it harder to earn the green light.</p><p>More broadly, Peters said that there is a stringent approach to cracking down on companies that are contravening export control rules.</p><p>He highlighted a US$252 million settlement earlier this month between the US and Applied Materials Inc, which he said reached the statutory ceiling and was the largest in bureau history.</p><p>Underscoring this approach, Peters also said he would be open to increasing the statute of limitations to 10 years and lifting enforcement penalties to potentially more than four times the value of unlawful transactions.</p><p>“The message to everyone paying attention should be: Follow the law or face the consequences,” Peters said.</p><p>He also answered a question from US Representative Bill Huizenga on semiconductor smuggling specifically, calling it a top enforcement priority.</p><p>“There is chip smuggling,” Peters said. “It is going on.”</p><p>When asked specifically about potential Nvidia violations related to the company’s work with engineers at Chinese AI start-up DeepSeek (深度求索), Peters declined to comment, but said that the bureau would “enforce without regard to who the violator may be.”</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/26/2003852883",
            "pub_date": "2026-02-26 00:08:11",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Manufacturing begins year on a high",
            "description": "<div class=\"archives\">\n\n\n<p>Taiwan’s manufacturing sector began the year on a firm footing, with sentiment last month up for the seventh straight month as easing tariff headwinds and resilient global demand reinforced exporters’ confidence, despite uncertainty over US trade policy, the Taiwan Institute of Economic Research (TIER, 台經院) said yesterday.</p><p>TIER’s manufacturing business climate index last month rose 1.27 points from a month earlier to 98.44, reflecting better-than-expected results from Taiwan-US trade talks and early signs of a pickup in global demand, the Taipei-based institute said.</p><p>The improvement came as exporters welcomed greater clarity over US tariff arrangements.</p><p>However, a new cloud emerged on Friday last week, when the US Supreme Court ruled that the International Emergency Economic Powers Act does not authorize US presidents to impose tariffs.</p><p>The decision effectively invalidated the broad “reciprocal” tariffs introduced last year by US President Donald Trump.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>TIER economist Gordon Sun (孫明德) said that the ruling removed what he described as the “most lethal weapon” in Washington’s tariff arsenal.</p><p>“Reciprocal tariffs have the widest scope and the greatest room for raising rates,” Sun said, adding that other trade tools that Washington can use — such as Section 232 and Section 301 investigations — require time-consuming probes and cannot be implemented immediately.</p><p>Although Trump has invoked Section 122 to levy a 15 percent global tariff on top of “most favored nation” rates, Sun said that the provision is capped at five months and limited to a maximum 15 percent rate, making it less potent than the now-invalidated “reciprocal” tariffs.</p><p>“When you lay out the available tariff tools, the most damaging one has been scrapped,” Sun said, adding that while the policy environment remains fluid, overall tariff pressure this year should be lighter than last year.</p><p>Still, Taiwan’s highly concentrated industrial structure leaves it exposed if semiconductors, and information and communications technology products become direct targets.</p><p>However, the government has gained concrete headway in mitigating risks through trade negotiations, he said.</p><p>The services sector gauge climbed for a fourth straight month to 95.47, while the construction industry index slipped to 99.92, the TIER said.</p><p>Ongoing rallies on the TAIEX are generating wealth effects that could bolster private consumption, Sun said.</p><p>On the property front, TIER researcher Arisa Liu (劉佩真) said that the housing market remained decoupled from broader economic and equity market trends.</p><p>With the central bank maintaining tight credit controls and banks adopting a cautious stance, the residential sector is expected to remain in a consolidation phase in the near term.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/26/2003852884",
            "pub_date": "2026-02-26 00:08:12",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Taiwan investment in EU grows 650% over decade amid closer trade ties",
            "description": "<div class=\"archives\">\n\n\n<p>Taiwan’s investment in the European Union (EU) has surged 650% over the past decade as trade ties between the two economies continue to strengthen, according to data from Taiwan’s International Trade Administration (ITA).</p><p>From 2016 to 2025, Taiwan’s total investment in the EU reached about US$13.88 billion, compared with US$1.85 billion from 2006 to 2015, representing an increase of approximately 650 percent, the data show.</p><p>The EU is Taiwan’s fourth-largest trading partner, with bilateral trade totaling more than US$68.64 billion in 2024, and it is also Taiwan’s largest source of foreign investment.</p><p>EU-Taiwan trade rose sharply in 2021, the year after the outbreak of the COVID-19 pandemic, reaching US$68.76 billion, up 32.51 percent from 2020, Hsu Li-mei (許莉美), head of the economic division at the Taipei Representative Office in the EU and Belgium, told CNA.</p><p>Taiwan’s investment in the EU had previously been relatively limited, with Taiwanese businesses mainly concentrating funds in China and Southeast Asia, she said.</p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>After the pandemic, however, companies began exploring other markets due to supply chain diversification, risk dispersion and global deployment, Hsu explained.</p><p>Even before the COVID-19 pandemic, the two sides had gradually established multiple economic and trade cooperation platforms, Hsu said.</p><p>Post-pandemic cooperation has become closer in both content and level of interaction, and its scope has continued to expand, she said.</p><p>Officials from EU directorates-general have increased visits to Taiwan in recent years and, after visiting, “became clearer about Taiwan’s industrial strength and technological development, therefore found more cooperation possibilities, and attitudes also became more open,” Hsu said.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/26/2003852885",
            "pub_date": "2026-02-26 00:13:55",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fortune seekers",
            "description": "<div class=\"archives\">\n\n\n<p>People dressed as the “God of Wealth” stand outside a jewelry store in Hanoi yesterday. Vietnamese believe that purchasing gold products on the 10th day of the first lunar month, known as “God of Wealth Day,” brings good fortune throughout the year.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/27/2003852948",
            "pub_date": "2026-02-27 00:00:51",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vietnamese bar",
            "description": "<div class=\"archives\">\n\n\n<p>People watch as a train approaches on a street in Hanoi yesterday.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/26/2003852886",
            "pub_date": "2026-02-26 00:13:55",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI demand to boost ChipMOS spending",
            "description": "<div class=\"archives\">\n\n<h2>\n<font class=\"red\">‘STRONG DEMAND’: </font>\n                        As ChipMOS is facing capacity constraints, it reserves most of its capacity for major customers and has to turn down small-scale orders, its chairman said                    </h2>\n\n<p>Chip packaging services provider ChipMOS Technologies Inc (南茂科技) yesterday said it plans to ramp up capital expenditure this year amid growing chip demand for artificial intelligence (AI) and data centers. </p><p>The company said that part of the spending would be used to build advanced chip packaging capacity for customers’ next-generation chips used in cutting-edge AI devices. </p><p>It said this year’s capital spending would account for 22 percent to 27 percent of total revenue, compared with about 16 percent last year. </p><p>That means a substantial increase from NT$3.67 billion (US$116.7 million) spent on new manufacturing equipment last year. </p><p>“There is strong customer demand. For the new capital spending, we have secured a longer-than-three-year supply contract for protection,” ChipMOS chairman Cheng Chih-chieh (鄭世杰) said at an earnings conference. </p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>As ChipMOS is facing capacity constraints, it reserves most of its capacity for major customers and has to turn down small-scale orders, even though some customers offered to double the prices they pay, Cheng said. </p><p>He said the company’s higher capital expenditure budget reflects its optimistic business prospects for this year, and it expects growth momentum to be stronger than that of last year, driven mainly by memory-related businesses. </p><p>“The deployment of AI and cloud-based data centers is fueling enterprises’ demand for NAND flash and DRAM chips. Together with the emergence of cutting-edge AI devices, demand for memory chips is on the rise,” Cheng said. </p><p>ChipMOS said it expects fewer working days this quarter to lead to a mild correction in its business, although the DRAM segment would still outgrow other segments. </p><p>The company is hiking prices for memory packaging and testing services this quarter due to an uptrend in raw materials such as gold, Cheng said. </p><p>The company also raised prices in last year’s third quarter. </p><p>It reported the strongest quarterly earnings in nine quarters for last quarter, benefiting from strong demand for memory packaging and testing services. </p><p>Net profit more than doubled to NT$499.7 million in the fourth quarter last year, compared with NT$232.2 million during the same period of 2024, marking the best quarter since the third quarter of 2023. That represented quarterly growth of 41.9 percent from NT$352.2 million. </p><p>Earnings per share rose to NT$0.71 last quarter from NT$0.32 a year earlier and NT$0.5 a quarter earlier. </p><p>Gross margin improved to 14.3 percent last quarter from 9.5 percent a year earlier and from 12.4 percent in last year’s third quarter. The company attributed the improvement to an optimized product portfolio and higher equipment utilization for memory chips at 75 percent versus a 65 percent corporate average. </p><p>Last year, net profits slumped about 65 percent to NT$495.1 million from NT$1.42 billion in 2024. Earnings per share dipped to NT$0.7 from NT$1.95.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/25/2003852824",
            "pub_date": "2026-02-25 00:07:01",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "E.Sun earnings hit record-high NT$34.29bn last year",
            "description": "<div class=\"archives\">\n\n\n<p>E.Sun Financial Holding Co (玉山金控) yesterday said it closed last year with record-high earnings and outlined an ambitious expansion blueprint for this year, with deeper integration of its new businesses intended to reinforce growth across its banking, securities and asset management franchises. </p><p>At its earnings briefing in Taipei, the conglomerate struck a confident tone as strategy chief Charles Tan (譚宏) made his debut appearance, outlining a post-acquisition road map following the addition of asset management and life insurance operations. </p><p>The Taipei-based financial group recorded net income of NT$34.29 billion (US$1.09 billion) last year, up 31.2 percent from 2024, and total revenue of NT$91.77 billion. Earnings per share were NT$2.12. </p><p>Tan, who joined the group in November last year, said total assets are set to surpass NT$6 trillion, meaning E.Sun is among the top five financial holding firms in Taiwan. </p><p>However, scale alone is not the endgame, he said. </p> <!-- /21202031/TT-mobile-sub-P-IR1 -->\n\n<p>“E.Sun is not pursuing asset expansion for its own sake,” he said. “Our priority is to convert scale into long-term, sustainable value through integration, efficiency and a superior customer experience.” </p><p>The company is repositioning itself as an integrated financial services platform spanning banking, securities, asset management and insurance — a shift aimed at diversifying revenue streams and deepening client relationships, he said. </p><p>E.Sun is serving more than 8 million retail banking customers and more than 1 million securities clients, while the life insurance arm adds more than 2.5 million policyholders, significantly expanding the group’s addressable customer base, Tan said. </p><p>Executives plan to integrate customer and product data across subsidiaries to build a more comprehensive financial ecosystem, he said, adding that the goal is to move from a product-centric approach to needs-based services by better understanding clients’ financial profiles, risk appetites and behavioral patterns. </p><p>Distribution capacity would also expand materially, he said. </p><p>The addition of about 8,000 life insurance agents is expected to complement bank branches and securities channels, enhancing offline reach and reinforcing customer engagement across subsidiaries, he said. </p><p>On the product side, the newly added asset management and insurance businesses are designed to fill gaps in long-term asset allocation and protection planning, enabling E.Sun to evolve from a product provider into a platform capable of supporting clients’ long-term wealth management needs, Tan said. </p><p>Technology would underpin the transformation as E.Sun intends to extend artificial intelligence applications across subsidiaries, deploying them in areas such as risk monitoring, personalized marketing, advisory services and process automation to enhance operational efficiency and regulatory responsiveness, he added. </p><p>E.Sun chairman Joseph Huang (黃男州) said the group is targeting 10 percent growth in credit card spending this year and aims to lift combined annual transaction volume from credit cards, debit cards and mobile payments to more than NT$1 trillion within three years, underscoring its push to deepen customer engagement and fee-based income.</p>\n</div>",
            "link": "https://www.taipeitimes.com/News/biz/archives/2026/02/25/2003852825",
            "pub_date": "2026-02-25 00:07:01",
            "source": "taipeitimes",
            "kind": 1,
            "language": "en"
        }
    ]
}