{
    "data": [
        {
            "title": "Rate cut expectations push rupee to a new low despite falling dollar index",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tThe rupee depreciated to a new intra-day low of 87.49 against the US dollar on Wednesday due to expectations of a 25 basis points rate cut by the Reserve Bank of India (RBI) this week, before ending the day at a new closing low of 87.46/$. There was strong dollar demand from importers as a rate cut would put further pressure on the Indian unit.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe meeting of the RBI’s Monetary Policy Committee, which sets interest rates, is underway, and the outcome will be announced on Friday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDespite a weaker dollar index and stronger Asian currencies, the rupee depreciated due</div></div>",
            "pub_date": "2025-02-05 22:20:30",
            "link": "https://www.business-standard.com/economy/news/rate-cut-expectations-push-rupee-to-a-new-low-despite-falling-dollar-index-125020501555_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501555"
        },
        {
            "title": "'Want to play same cricket as India', says Jos Buttler ahead of ODI series",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><div>\r\n\tEngland skipper Jos Buttler addressed the media ahead of the 1st ODI against India and praised Team India and skipper Rohit Sharma's approach in games, expressing his side's objective to play the same brand of cricket in the coming days as well.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"A lot of credit goes to Rohit Sharma for the way he came forward as captain and led India towards that style of cricket. We also want to play exactly the same cricket\". Buttler said during the press conference.<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/cricket/champions-trophy\"><strong>Check all latest updates for Champions Trophy 2025 here</strong></a><small class=\"brtagPara\"> </small> <strong>Joe Root returns to ODI cricket</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJoe Root is making his return to England's ODI squad for the upcoming three-match series against India, starting Thursday.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRoot's last ODI appearance was in India back in November 2023, when he played against Pakistan in a World Cup match at Eden Gardens, Kolkata, scoring 60 off 72 balls.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/cricket/news/no-reason-to-look-behind-skipper-rohit-sharma-ahead-of-ind-vs-eng-series-125020501486_1.html\">'No reason to look behind' Skipper Rohit Sharma ahead of IND vs ENG series</a></strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhen asked about Brendon McCullum's successful 'Bazball' strategy that has greatly benefited England's team, Root, who has worked with the Kiwi in the England Test setup, shared his confidence in McCullum's approach. \"The way McCullum views the game aligns perfectly with how the team is set up and the skills we have. It’s a really exciting mix, and with everything coming together, the potential is limitless for this squad,\" Root said in a video shared by the England and Wales Cricket Board (ECB).</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRoot expressed his excitement about rejoining the ODI team, emphasizing the importance of team chemistry. \"By playing together more and understanding each other better, I’m confident we’ll achieve success. It’s a thrilling time to be part of the white-ball team, and hopefully, we’ll see results soon on the field.\"</div></div>",
            "pub_date": "2025-02-05 22:20:29",
            "link": "https://www.business-standard.com/cricket/news/want-to-play-same-cricket-as-india-says-jos-buttler-ahead-of-odi-series-125020501552_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501552"
        },
        {
            "title": "Ola Electric enters EV motorcycle segment with launch of Roadster X series",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tOla Electric, the leading brand in the electric two-wheeler market, has entered the electric motorcycle segment with the launch of the Roadster X series. The lineup includes five variants, with introductory prices starting at Rs 74,999.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDeliveries for the Roadster series are set to begin in mid-March. The company has been teasing the launch of its electric motorcycles multiple times. With this new addition, Ola aims to further expand its footprint in India’s growing electric vehicle (EV) market, where electric two-wheelers are gaining traction due to rising fuel costs and government incentives.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBhavish Aggarwal, chairman and managing director, Ola Electric, said: “Motorcycles are at the heart of India’s mobility landscape. With our electric motorcycles, we’re driving the EV revolution, as our futuristic Roadster series of motorcycles are here to accelerate EV adoption further and make electric the first choice for every rider in India.”</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to Vahan data, Ola Electric's market share reached 30 per cent by the end of January, up from 19 per cent in December.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis places Ola Electric in direct competition with other players in the nascent but growing Indian electric motorcycle market, which currently includes models like RV400 and RV300 from Revolt Motors, Ultraviolette Automotive's F77 series, Tork Motors' Kratos and Kratos R, and Oben Electric's Hop Oxo.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Roadster X is available in 2.5kWh, 3.5kWh, and 4.5kWh variants, priced at Rs 74,999, Rs 84,999, and Rs 94,999, respectively. The Roadster X+ is offered with 4.5kWh and 9.1kWh battery options, priced at Rs 1,04,999 and Rs 1,54,999. All models come with a three-year/50,000 km warranty.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOla Electric has been expanding its EV portfolio. Before launching the Roadster X series, the company introduced its Gen 3 scooters, including the S1 Pro+ and S1 X range. Ola also launched its Gig and S1 Z scooter lineup, targeting personal and commercial users with removable battery options.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOla Electric has been developing EVs and battery technology at its factory in Tamil Nadu, supported by its Battery Centre in Bengaluru. The company has focused on vertical integration, producing EV components and battery cells in-house. Ola operates over 800 stores across India, using a direct-to-customer sales model.</div></div>",
            "pub_date": "2025-02-05 22:10:30",
            "link": "https://www.business-standard.com/industry/auto/ola-electric-enters-ev-motorcycle-segment-with-launch-of-roadster-x-series-125020501527_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501527"
        },
        {
            "title": "A year on, clearing charges still a bone of contention between NSE, BSE",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tThe National Stock Exchange (NSE) and BSE are yet to reach common ground on clearing and settlement charges, a disagreement which has now stretched for more than a year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNSE has stated in its latest financial statements that its wholly-owned subsidiary NSE Clearing (NCL) was in deficit of Rs 177 crore in the minimum liquid assets required under the norms laid down by the Securities and Exchange Board of India (Sebi).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNCL added that the deficit was mostly on the account of pending dues from rival BSE amounting to Rs 312 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This deficit will be replenished by the internal</div></div>",
            "pub_date": "2025-02-05 22:10:30",
            "link": "https://www.business-standard.com/markets/news/a-year-on-clearing-charges-still-a-bone-of-contention-between-nse-bse-125020501534_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501534"
        },
        {
            "title": "Delhi voters seek action on daily issues like sanitation, jobs, inflation",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tDelhiites on Wednesday exercised their right to vote while expressing concerns about key issues such as civic amenities, employment opportunities, and inflation -- matters which directly impact their daily lives.</p>\n<p>\r\n\tBasin (67), a resident of Kalkaji, said he was voting in the hope of improving the entire constituency.</p>\n<p>\r\n\t\"I am here to vote against corruption and poor sanitation. The issues don't need to be highlightedjust look at the roads. When you step out of the house, you can clearly see all the sanitation problems. The entire constituency needs cleanliness. The roads are there, but they're broken and congested. Similarly, the drainage and sewage systems are open,\" he stated.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tPolling, which began at 7 am, is underway at 13,766 stations across Delhi's 70 constituencies to decide the fate of 699 candidates. It will continue until 6 pm.</p>\n<p>\r\n\tDamodar Kumar (50), a motorcycle garage owner and resident of Okhla, said the maintenance of public washrooms is poor and open drains also trouble the residents.<small class=\"brtag\"> </small></p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/elections/delhi-elections/delhi-elections-2025-exit-poll-results-bjp-congress-aap-contest-125020501482_1.html\" target=\"_blank\">Delhi elections: Exit polls predict BJP return to power after 2 decades</a></strong></div>\n<p>\r\n\t\"The management is poor. There are public restrooms on the roads, but their maintenance is terrible. They're open, so they stink all the time. And these open drains create the same problem during rainthey're not even covered, and many are newly built. If someone isn't careful, they could fall right into them,\" Kumar stated.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIn northeast Delhi, where communal riots occurred five years ago, residents are focusing on development as the central theme of their votes. A voter said that they have \"bad memories of the riots\" but people are \"voting in large numbers for the future.\"<small class=\"brtagPara\"> </small>\r\n\tMohammad Wahid (38), a resident of Jaffrabad, said that the unavailability of a sewer line in Seelampur is a major concern for the residents.</p>\n<p>\r\n\t\"Whatever happened in February 2020 was done to disturb the harmony of the area and polarise the population. We have a Hindu family living on our street. They celebrate their festivals, and we also participate in them. They could have left after the riots, but they chose to stay because they feel safe here. This is not the issue now. The sewer is a big problem in the area. Sometimes, we get dirty water,\" Wahid, a restaurant owner, said.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tSimilarly, Rehman Ali (42) also expressed concern about crime in Seelampur and Jaffrabad.</p>\n<p>\r\n\t\"We do not have a sewer in our area, which is a major issue for every street in the locality. Apart from this, the crime rate is also increasing, which is worrying people about their children's future,\" Ali said.</p>\n<p>\r\n\tRaisuddin (54), a resident of Babapur, said all the issues would be resolved with a stable government.</p>\n<p>\r\n\tDr. Faizan Sheikh (26), a resident of Mustafabad, said the entire northeast area shares the same problems.</p>\n<p>\r\n\t\"People still have bad memories of the riots, and it will never fade away. However, residents are voting in large numbers for the future. The main issues in Mustafabad are the same as those faced by the entire northeast region -- sewer problems, cleanliness, better roads, drainage, and pollution,\" Sheikh, an eye specialist, said.</p>\n<p>\r\n\tMore than 50 people were killed, and many others injured in the February 2020 riots, which occurred just after the assembly elections.</p>\n<p>\r\n\tUma Singh, a 45-year-old resident of Rohini and a native of Bihar, expressed her concerns about rising prices.</p>\n<p>\r\n\t\"We belong to a middle-class family, and in today's times, the increasing costs are making life difficult for us. Many big promises are made, but nothing ever gets fulfilled. The water supply in our area sometimes has a bad smell. I feel that change is needed now so that we can get some relief,\" she said.</p>\n<p>\r\n\tKavita Verma, a 37-year-old resident of Jahangirpuri who works as a house help, also shared her concerns about poor living conditions.</p>\n<p>\r\n\t\"The water we get here smells bad, and the roads are in terrible condition. When it rains, the entire road gets flooded, making our lives difficult for the whole season. I still haven't received my ration card. I have been trying to get one for the past two years, but I haven't received it yet,\" Verma said.</p>\n<p>\r\n\tShe also claimed that they haven't received 'pucca housing' as promised earlier and are still living in a rented home.</p><p></p></div>",
            "pub_date": "2025-02-05 22:05:25",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-voters-seek-action-on-daily-issues-like-sanitation-jobs-inflation-125020501439_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501439"
        },
        {
            "title": "Prudent fiscal management likely to soften G-sec yields: DEA secretary Seth",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe government's prudent fiscal management may soften government securities yields and leave more funds for corporates to invest in the economy, DEA Secretary Ajay Seth has said.</p>\n<p>\r\n\tIn absolute terms, he said, \"we will be borrowing (for FY26) less than what we intend to borrow in the current year. Even the gross borrowings are also marginally more than what it was, signalling that the government will leave enough into the market for the private sector to pick up\".<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/budget-2025-centre-s-fiscal-discipline-may-push-govt-bond-yields-lower-125020200359_1.html\" target=\"_blank\">Budget 2025: Fiscal consolidation efforts may pull govt bond yields down</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tThe government has reduced its borrowings estimate for next financial year to Rs 11.54 trillion on net basis as it expects an improvement in tax collection. However, gross market borrowings have now been revised upward to Rs 14.82 trillion from Rs 14.01 trillion estimated for the current financial year.<small class=\"brtag\"> </small></p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/finance/news/will-actively-manage-cash-needs-amid-tight-liquidity-says-ajay-seth-125020301593_1.html\" target=\"_blank\">Will actively manage cash needs amid tight liquidity, says Ajay Seth</a></strong></div>\n<p>\r\n\tThe government has to borrow by issuing dated securities to meet its fiscal deficit target.</p>\n<p>\r\n\t\"So, I see that the fiscal consolidation this year and fiscal consolidation road map next year should rather soften the yield...there are other factors also in place,\" the secretary in the department of economic affairs (DEA) told PTI in an interview.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tIt is to be noted that softening of yield on G-secs would bring burden on interest payment on the government.</p>\n<p>\r\n\tThe yield on 10-year government bonds is currently hovering around 6.7 per cent.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAs per the government data, the weighted average yield softened to 6.94 per cent in the second quarter relative to 7.14 per cent in first quarter of 2024-25.</p>\n<p>\r\n\tThe government has lowered its fiscal deficit target to 4.8 per cent of GDP for the current financial year against 4.9 per cent estimated earlier.</p>\n<p>\r\n\tFor the next fiscal year, the fiscal deficit has been pegged at 4.4 per cent of the GDP in line with the glide path announced in amended FRBM Act.</p>\n<p>\r\n\tThe government has announced a new roadmap to reduce debt-GDP ratio to about 50 per cent by March 2031 from 57.1 per cent currently.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAs per the new roadmap for the next five years, the government aims to bring down the debt-GDP ratio to about 56 per cent by the end of FY26.</p>\n<p>\r\n\tThe glide path takes into account different scenarios for the next 5 years with debt to GDP-ratio as the anchor.</p><p></p></div>",
            "pub_date": "2025-02-05 22:05:24",
            "link": "https://www.business-standard.com/economy/news/prudent-fiscal-management-likely-to-soften-g-sec-yields-dea-secretary-seth-125020501438_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501438"
        },
        {
            "title": "Delhi voters seek action on daily issues like sanitation, jobs, inflation",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tDelhiites on Wednesday exercised their right to vote while expressing concerns about key issues such as civic amenities, employment opportunities, and inflation -- matters which directly impact their daily lives.</p>\n<p>\r\n\tBasin (67), a resident of Kalkaji, said he was voting in the hope of improving the entire constituency.</p>\n<p>\r\n\t\"I am here to vote against corruption and poor sanitation. The issues don't need to be highlightedjust look at the roads. When you step out of the house, you can clearly see all the sanitation problems. The entire constituency needs cleanliness. The roads are there, but they're broken and congested. Similarly, the drainage and sewage systems are open,\" he stated.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tPolling, which began at 7 am, is underway at 13,766 stations across Delhi's 70 constituencies to decide the fate of 699 candidates. It will continue until 6 pm.</p>\n<p>\r\n\tDamodar Kumar (50), a motorcycle garage owner and resident of Okhla, said the maintenance of public washrooms is poor and open drains also trouble the residents.<small class=\"brtag\"> </small></p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/elections/delhi-elections/delhi-elections-2025-exit-poll-results-bjp-congress-aap-contest-125020501482_1.html\" target=\"_blank\">Delhi elections: Exit polls predict BJP return to power after 2 decades</a></strong></div>\n<p>\r\n\t\"The management is poor. There are public restrooms on the roads, but their maintenance is terrible. They're open, so they stink all the time. And these open drains create the same problem during rainthey're not even covered, and many are newly built. If someone isn't careful, they could fall right into them,\" Kumar stated.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIn northeast Delhi, where communal riots occurred five years ago, residents are focusing on development as the central theme of their votes. A voter said that they have \"bad memories of the riots\" but people are \"voting in large numbers for the future.\"<small class=\"brtagPara\"> </small>\r\n\tMohammad Wahid (38), a resident of Jaffrabad, said that the unavailability of a sewer line in Seelampur is a major concern for the residents.</p>\n<p>\r\n\t\"Whatever happened in February 2020 was done to disturb the harmony of the area and polarise the population. We have a Hindu family living on our street. They celebrate their festivals, and we also participate in them. They could have left after the riots, but they chose to stay because they feel safe here. This is not the issue now. The sewer is a big problem in the area. Sometimes, we get dirty water,\" Wahid, a restaurant owner, said.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tSimilarly, Rehman Ali (42) also expressed concern about crime in Seelampur and Jaffrabad.</p>\n<p>\r\n\t\"We do not have a sewer in our area, which is a major issue for every street in the locality. Apart from this, the crime rate is also increasing, which is worrying people about their children's future,\" Ali said.</p>\n<p>\r\n\tRaisuddin (54), a resident of Babapur, said all the issues would be resolved with a stable government.</p>\n<p>\r\n\tDr. Faizan Sheikh (26), a resident of Mustafabad, said the entire northeast area shares the same problems.</p>\n<p>\r\n\t\"People still have bad memories of the riots, and it will never fade away. However, residents are voting in large numbers for the future. The main issues in Mustafabad are the same as those faced by the entire northeast region -- sewer problems, cleanliness, better roads, drainage, and pollution,\" Sheikh, an eye specialist, said.</p>\n<p>\r\n\tMore than 50 people were killed, and many others injured in the February 2020 riots, which occurred just after the assembly elections.</p>\n<p>\r\n\tUma Singh, a 45-year-old resident of Rohini and a native of Bihar, expressed her concerns about rising prices.</p>\n<p>\r\n\t\"We belong to a middle-class family, and in today's times, the increasing costs are making life difficult for us. Many big promises are made, but nothing ever gets fulfilled. The water supply in our area sometimes has a bad smell. I feel that change is needed now so that we can get some relief,\" she said.</p>\n<p>\r\n\tKavita Verma, a 37-year-old resident of Jahangirpuri who works as a house help, also shared her concerns about poor living conditions.</p>\n<p>\r\n\t\"The water we get here smells bad, and the roads are in terrible condition. When it rains, the entire road gets flooded, making our lives difficult for the whole season. I still haven't received my ration card. I have been trying to get one for the past two years, but I haven't received it yet,\" Verma said.</p>\n<p>\r\n\tShe also claimed that they haven't received 'pucca housing' as promised earlier and are still living in a rented home.</p><p></p></div>",
            "pub_date": "2025-02-05 22:00:36",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-voters-seek-action-on-daily-issues-like-sanitation-jobs-inflation-125020501439_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501439"
        },
        {
            "title": "Prudent fiscal management likely to soften G-sec yields: DEA secretary Seth",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe government's prudent fiscal management may soften government securities yields and leave more funds for corporates to invest in the economy, DEA Secretary Ajay Seth has said.</p>\n<p>\r\n\tIn absolute terms, he said, \"we will be borrowing (for FY26) less than what we intend to borrow in the current year. Even the gross borrowings are also marginally more than what it was, signalling that the government will leave enough into the market for the private sector to pick up\".<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/budget-2025-centre-s-fiscal-discipline-may-push-govt-bond-yields-lower-125020200359_1.html\" target=\"_blank\">Budget 2025: Fiscal consolidation efforts may pull govt bond yields down</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tThe government has reduced its borrowings estimate for next financial year to Rs 11.54 trillion on net basis as it expects an improvement in tax collection. However, gross market borrowings have now been revised upward to Rs 14.82 trillion from Rs 14.01 trillion estimated for the current financial year.<small class=\"brtag\"> </small></p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/finance/news/will-actively-manage-cash-needs-amid-tight-liquidity-says-ajay-seth-125020301593_1.html\" target=\"_blank\">Will actively manage cash needs amid tight liquidity, says Ajay Seth</a></strong></div>\n<p>\r\n\tThe government has to borrow by issuing dated securities to meet its fiscal deficit target.</p>\n<p>\r\n\t\"So, I see that the fiscal consolidation this year and fiscal consolidation road map next year should rather soften the yield...there are other factors also in place,\" the secretary in the department of economic affairs (DEA) told PTI in an interview.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tIt is to be noted that softening of yield on G-secs would bring burden on interest payment on the government.</p>\n<p>\r\n\tThe yield on 10-year government bonds is currently hovering around 6.7 per cent.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAs per the government data, the weighted average yield softened to 6.94 per cent in the second quarter relative to 7.14 per cent in first quarter of 2024-25.</p>\n<p>\r\n\tThe government has lowered its fiscal deficit target to 4.8 per cent of GDP for the current financial year against 4.9 per cent estimated earlier.</p>\n<p>\r\n\tFor the next fiscal year, the fiscal deficit has been pegged at 4.4 per cent of the GDP in line with the glide path announced in amended FRBM Act.</p>\n<p>\r\n\tThe government has announced a new roadmap to reduce debt-GDP ratio to about 50 per cent by March 2031 from 57.1 per cent currently.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAs per the new roadmap for the next five years, the government aims to bring down the debt-GDP ratio to about 56 per cent by the end of FY26.</p>\n<p>\r\n\tThe glide path takes into account different scenarios for the next 5 years with debt to GDP-ratio as the anchor.</p><p></p></div>",
            "pub_date": "2025-02-05 22:00:36",
            "link": "https://www.business-standard.com/economy/news/prudent-fiscal-management-likely-to-soften-g-sec-yields-dea-secretary-seth-125020501438_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501438"
        },
        {
            "title": "Delhi voters seek action on daily issues like sanitation, jobs, inflation",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tDelhiites on Wednesday exercised their right to vote while expressing concerns about key issues such as civic amenities, employment opportunities, and inflation -- matters which directly impact their daily lives.</p>\n<p>\r\n\tBasin (67), a resident of Kalkaji, said he was voting in the hope of improving the entire constituency.</p>\n<p>\r\n\t\"I am here to vote against corruption and poor sanitation. The issues don't need to be highlightedjust look at the roads. When you step out of the house, you can clearly see all the sanitation problems. The entire constituency needs cleanliness. The roads are there, but they're broken and congested. Similarly, the drainage and sewage systems are open,\" he stated.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tPolling, which began at 7 am, is underway at 13,766 stations across Delhi's 70 constituencies to decide the fate of 699 candidates. It will continue until 6 pm.</p>\n<p>\r\n\tDamodar Kumar (50), a motorcycle garage owner and resident of Okhla, said the maintenance of public washrooms is poor and open drains also trouble the residents.<small class=\"brtag\"> </small></p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/elections/delhi-elections/delhi-elections-2025-exit-poll-results-bjp-congress-aap-contest-125020501482_1.html\" target=\"_blank\">Delhi elections: Exit polls predict BJP return to power after 2 decades</a></strong></div>\n<p>\r\n\t\"The management is poor. There are public restrooms on the roads, but their maintenance is terrible. They're open, so they stink all the time. And these open drains create the same problem during rainthey're not even covered, and many are newly built. If someone isn't careful, they could fall right into them,\" Kumar stated.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIn northeast Delhi, where communal riots occurred five years ago, residents are focusing on development as the central theme of their votes. A voter said that they have \"bad memories of the riots\" but people are \"voting in large numbers for the future.\"<small class=\"brtagPara\"> </small>\r\n\tMohammad Wahid (38), a resident of Jaffrabad, said that the unavailability of a sewer line in Seelampur is a major concern for the residents.</p>\n<p>\r\n\t\"Whatever happened in February 2020 was done to disturb the harmony of the area and polarise the population. We have a Hindu family living on our street. They celebrate their festivals, and we also participate in them. They could have left after the riots, but they chose to stay because they feel safe here. This is not the issue now. The sewer is a big problem in the area. Sometimes, we get dirty water,\" Wahid, a restaurant owner, said.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tSimilarly, Rehman Ali (42) also expressed concern about crime in Seelampur and Jaffrabad.</p>\n<p>\r\n\t\"We do not have a sewer in our area, which is a major issue for every street in the locality. Apart from this, the crime rate is also increasing, which is worrying people about their children's future,\" Ali said.</p>\n<p>\r\n\tRaisuddin (54), a resident of Babapur, said all the issues would be resolved with a stable government.</p>\n<p>\r\n\tDr. Faizan Sheikh (26), a resident of Mustafabad, said the entire northeast area shares the same problems.</p>\n<p>\r\n\t\"People still have bad memories of the riots, and it will never fade away. However, residents are voting in large numbers for the future. The main issues in Mustafabad are the same as those faced by the entire northeast region -- sewer problems, cleanliness, better roads, drainage, and pollution,\" Sheikh, an eye specialist, said.</p>\n<p>\r\n\tMore than 50 people were killed, and many others injured in the February 2020 riots, which occurred just after the assembly elections.</p>\n<p>\r\n\tUma Singh, a 45-year-old resident of Rohini and a native of Bihar, expressed her concerns about rising prices.</p>\n<p>\r\n\t\"We belong to a middle-class family, and in today's times, the increasing costs are making life difficult for us. Many big promises are made, but nothing ever gets fulfilled. The water supply in our area sometimes has a bad smell. I feel that change is needed now so that we can get some relief,\" she said.</p>\n<p>\r\n\tKavita Verma, a 37-year-old resident of Jahangirpuri who works as a house help, also shared her concerns about poor living conditions.</p>\n<p>\r\n\t\"The water we get here smells bad, and the roads are in terrible condition. When it rains, the entire road gets flooded, making our lives difficult for the whole season. I still haven't received my ration card. I have been trying to get one for the past two years, but I haven't received it yet,\" Verma said.</p>\n<p>\r\n\tShe also claimed that they haven't received 'pucca housing' as promised earlier and are still living in a rented home.</p><p></p></div>",
            "pub_date": "2025-02-05 21:55:25",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-voters-seek-action-on-daily-issues-like-sanitation-jobs-inflation-125020501439_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501439"
        },
        {
            "title": "Prudent fiscal management likely to soften G-sec yields: DEA secretary Seth",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe government's prudent fiscal management may soften government securities yields and leave more funds for corporates to invest in the economy, DEA Secretary Ajay Seth has said.</p>\n<p>\r\n\tIn absolute terms, he said, \"we will be borrowing (for FY26) less than what we intend to borrow in the current year. Even the gross borrowings are also marginally more than what it was, signalling that the government will leave enough into the market for the private sector to pick up\".<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/budget-2025-centre-s-fiscal-discipline-may-push-govt-bond-yields-lower-125020200359_1.html\" target=\"_blank\">Budget 2025: Fiscal consolidation efforts may pull govt bond yields down</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tThe government has reduced its borrowings estimate for next financial year to Rs 11.54 trillion on net basis as it expects an improvement in tax collection. However, gross market borrowings have now been revised upward to Rs 14.82 trillion from Rs 14.01 trillion estimated for the current financial year.<small class=\"brtag\"> </small></p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/finance/news/will-actively-manage-cash-needs-amid-tight-liquidity-says-ajay-seth-125020301593_1.html\" target=\"_blank\">Will actively manage cash needs amid tight liquidity, says Ajay Seth</a></strong></div>\n<p>\r\n\tThe government has to borrow by issuing dated securities to meet its fiscal deficit target.</p>\n<p>\r\n\t\"So, I see that the fiscal consolidation this year and fiscal consolidation road map next year should rather soften the yield...there are other factors also in place,\" the secretary in the department of economic affairs (DEA) told PTI in an interview.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tIt is to be noted that softening of yield on G-secs would bring burden on interest payment on the government.</p>\n<p>\r\n\tThe yield on 10-year government bonds is currently hovering around 6.7 per cent.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAs per the government data, the weighted average yield softened to 6.94 per cent in the second quarter relative to 7.14 per cent in first quarter of 2024-25.</p>\n<p>\r\n\tThe government has lowered its fiscal deficit target to 4.8 per cent of GDP for the current financial year against 4.9 per cent estimated earlier.</p>\n<p>\r\n\tFor the next fiscal year, the fiscal deficit has been pegged at 4.4 per cent of the GDP in line with the glide path announced in amended FRBM Act.</p>\n<p>\r\n\tThe government has announced a new roadmap to reduce debt-GDP ratio to about 50 per cent by March 2031 from 57.1 per cent currently.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAs per the new roadmap for the next five years, the government aims to bring down the debt-GDP ratio to about 56 per cent by the end of FY26.</p>\n<p>\r\n\tThe glide path takes into account different scenarios for the next 5 years with debt to GDP-ratio as the anchor.</p><p></p></div>",
            "pub_date": "2025-02-05 21:55:25",
            "link": "https://www.business-standard.com/economy/news/prudent-fiscal-management-likely-to-soften-g-sec-yields-dea-secretary-seth-125020501438_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501438"
        }
    ]
}