{
    "data": [
        {
            "title": "Meta adds $235 bn of value in winning streak as investors cheer AI bets",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><strong>By Subrat Patnaik</strong><small class=\"brtagPara\"> </small>\n<div>\r\n\tMeta Platforms Inc. shares are on track to post a gain for a 12th consecutive session, their longest winning streak ever, as investors cheer the social media giant’s artificial intelligence strategy.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe stock is up 1.1 per cent Tuesday. If the gains hold through end of the session, the owner of Facebook will have added more than $235 billion in market value during the streak, bringing its market capitalization to nearly $1.8 trillion.<small class=\"brtagPara\"> </small>\n<div>\r\n\t\tThis is a “really big year” for Meta, Chief Executive Officer Mark Zuckerberg said last week, as he predicted that the company’s AI assistant will become the most widely used in the industry. The Menlo Park, California-based company also earmarked as much as $65 billion for AI-related investments in 2025.  </div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe company, which has rallied almost 700 per cent from its low in November 2022, is considered a net beneficiary from the DeepSeek AI update that rocked the majority of technology stocks last week. Analysts noted that Meta’s Llama series of AI models is open sourced, like the Chinese startup. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“The company looks extremely competent, being the only one of the ‘Magnificent 7’ to focus on an open-sourced model,” CFRA Research analyst Angelo Zino said. “Ultimately, the DeepSeek model should lead to faster AI product development and quicker return on investment for Meta.”</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 01:30:33",
            "link": "https://www.business-standard.com/companies/news/meta-adds-235-bn-of-value-in-winning-streak-as-investors-cheer-ai-bets-125020401801_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401801"
        },
        {
            "title": "Bank gold loan disbursals up 71.3% to Rs 1.72 trillion in 9MFY25",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tGold loan portfolio of banks rose by 71.3 per cent year-on-year (Y-o-Y) till December of the current financial year (FY25) to Rs 1.72 trillion, compared to 17 per cent growth a year ago, on the back of rising prices of the yellow metal and slowdown in unsecured loan following increase in risk weights last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Over the last year, gold loan growth has sharply increased, with a 68 per cent rise from April 2024 to December 2024 (M9FY25), while gold prices increased by around 21 per cent during the time,” said Ajit Velonie, senior director, Crisil Ratings.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“There has also been a partial slowdown in unsecured loan growth due to stricter regulations. The growth in gold loans has coincided with this period. Personal loans grew by only 5-6 per cent, compared to 16.5 per cent in the previous year. The slower growth in unsecured loans has likely led borrowers to turn to gold loans as an alternative,” said Velonie.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn November 2023, the Reserve Bank of India (RBI) increased risk weight for unsecured loans by 25 percentage points to 125 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe personal loans segment showed 9.7 per cent growth in December 2024, compared to 20.8 per cent in December 2023. Credit card loans also saw moderation in growth at 15.6 per cent in December 2024, down from 32.6 per cent a year ago.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBank credit growth in the retail loan segment, including housing, vehicle, credit cards, and personal loans, dropped to 14.9 per cent Y-o-Y in December 2024, down from 17.6 per cent in December 2023.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe gold loan prices increased by 20.4 per cent to Rs 75,857 per 10 gram in December 2024 from Rs 62,993 per 10 gram in the year-ago period.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Factors contributing to the rise in gold loans include rising prices of the yellow metal, as the value of loans taken against jewellery also increases amid rise in gold prices. People with gold jewellery are also borrowing more to refinance their loans as the value of gold increases,” said Kirti Timmanagoudar, head of strategy and co-lending, IIFL Finance.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The crackdown on unsecured lending and stress in the MFI space might also be contributing factors. It is likely a cumulative effect of these elements, rather than one factor being responsible,” said Timmanagoudar.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording RBI data, since May 2024, one bank has changed the classification of agricultural loan into “Loans against gold jewellery” under the retail segment.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Loans previously classified as agricultural are now being treated as gold loans. This reclassification might explain the slower growth in agricultural loans, which have only grown by 8 per cent compared to previous years,” Timmanagoudar added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The slowdown in supply of unsecured lending might give an impetus but gold loan has been witnessing an upward trajectory due to its own features. Today it is a popular choice among customers, especially for short-term requirements, and acts as a vital financial inclusion tool,” said Shaji Varghese, chief executive officer (CEO), Muthoot FinCorp.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe December edition of the financial stability report (FSR) of the RBI observed the rapid increase in gold loan disbursals during the period ending September 2024 compared to the same time period last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTo address the non-adherence to prudential guidelines by the supervised entities (SEs) in grant of loans against pledge of gold ornaments and jewellery, the RBI has advised SEs to comprehensively review their policies, identify gaps, and implement corrective measures within a specified timeframe.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 01:30:32",
            "link": "https://www.business-standard.com/industry/banking/gold-loan-portfolio-of-banks-jumps-71-3-to-rs-1-72-trillion-till-dec-2024-125020401498_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401498"
        },
        {
            "title": "India presents Rs 7,500 cr premiumisation opportunity for Nestle: CMD",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFast-moving consumer goods (FMCG) major Nestle India on Tuesday said that with sustained economic growth in the country and increasing consumption of packaged foods, India presents a Rs 7,500 crore premiumisation opportunity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a call with analysts, Suresh Narayanan, chairman and managing director, said premium products in each category have been outpacing the overall category growth, adding the trend is visible across urban and rural markets.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company’s premium portfolio has registered a compounded annual growth rate (CAGR) of 16 per cent since 2015.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt will drive market share gains by continuing premiumising the core categories and products, he added.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNarayanan added that the announcements related to tax benefits made in the Union Budget will give a fillip to sales of packaged food companies, and spur consumption in the country.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“While some money from the Rs 1 lakh crore will go towards savings and shedding the EMI burden, I hope part of it will come into consumption and give us a fillip,” Narayanan told investors.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNarayanan, however, pointed out challenges like rising food inflation and a slowdown in urban consumption, alongside a shift in consumption patterns like rising health consciousness.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCommodities like milk, coffee, and cocoa have seen a high rate of inflation, thus prompting the company to take moderate price hikes last year. Factors like urban unemployment, slow real wage growth, and a post-Covid moderation have impacted demand from urban markets.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNarayanan added that the company will undertake price increases in categories like coffee. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe maker of Kitkat chocolate and Maggi noodles reported a 4.9 per cent year-on-year increase in net profits to Rs 688 crore in the third quarter of FY25, and a 3.9 per cent hike in the net sales to Rs 4,779.7 crore from Rs 4,600.4 crore in the year-ago period.</div></div>",
            "pub_date": "2025-02-05 01:25:27",
            "link": "https://www.business-standard.com/companies/news/premiumisation-a-rs-7-500-cr-opportunity-for-nestle-india-cmd-125020401569_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401569"
        },
        {
            "title": "Delhi HC refuses relief to Rashmi Saluja in Religare reappointment matter",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Delhi High Court (HC) on Friday denied relief to Rashmi Saluja, executive chairperson of Religare Enterprises (REL), in her plea against a resolution seeking to replace her with a new director at the upcoming annual general meeting (AGM) on February 7.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja, who is set to retire by rotation, argued that her appointment was for a fixed term of five years, ending 2028.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, the court noted that while she was appointed in 2023 for a five-year term, the board meeting and AGM minutes explicitly stipulated retirement by rotation.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJustice Purushaindra Kumar Kaurav said, “This clearly indicates that the understanding of the plaintiff that she is liable to retire is not something that was introduced for the first time in 2025...It is evident that the plaintiff has failed to establish a prima facie case in her favour.”</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe court further emphasised that every shareholder has the right, subject to statutory procedures, to participate in the company's affairs. “The participation is essentially to uphold the principle of corporate democracy. Shareholders must be allowed to regulate and determine the affairs of the company through general meetings, which serve as the primary forum for decision-making within a corporate entity,” the court stated.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe HC's decision clears the way for the AGM and the voting on the appointment of a new director to replace Saluja.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHer plea was opposed by four independent directors of the company and the Burman family, the largest shareholder in REL that launched an open offer to acquire an additional 26 per cent stake. The open offer, which closes on Friday, has so far received bids for only 1,668 shares.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja has offered herself for reappointment, and the outcome of the voting will be known at the AGM. The AGM, originally scheduled for December, was delayed due to legal proceedings before the Madhya Pradesh High Court. A plea filed by a non-shareholder was later dismissed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn another plea, the Delhi HC refused interim relief to minority shareholder Sapna Govind Rao who had contended that Burmans open offer undervalued the company. However, the court has directed Securities and Exchange Board of India (Sebi) to decide fast on the application for exemption filed by US entrepreneur Danny Gaekwad</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThree leading proxy firms — Stakeholders Empowerment Services, Institutional Investor Advisory Services, and InGovern Research — have recommended an 'against' vote on the resolution pertaining to Saluja's reappointment. They cited concerns over corporate governance, ESOPs, and higher remuneration.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRefuting these concerns, REL described the reports as “orchestrated and motivated” and questioned the timing of the advisory firms' reports.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company stated that matters regarding compensation practices and ESOPs were sub-judice and that any attempt to influence public opinion through “misleading analysis” was unethical.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 01:25:25",
            "link": "https://www.business-standard.com/companies/news/delhi-hc-refuses-relief-to-rashmi-saluja-in-religare-reappointment-matter-125020401469_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401469"
        },
        {
            "title": "US job openings post biggest drop in 14 months, falls to 7.6 mn in December",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tUS job openings dropped by the most in 14 months in December, but steady hiring and low layoffs suggested that the labor market was not abruptly slowing down and probably keep the Federal Reserve on the sidelines at least until June.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe Labor Department's Job Openings and Labor Turnover Survey, or JOLTS report, on Tuesday showed there were 1.1 job openings for every unemployed person, down from 1.15 in November. Fed Chair Jerome Powell told reporters last week, \"We do not need to be in a hurry to adjust our policy stance.\" \"Labor demand is softening but not collapsing,\" said Eugenio Aleman, chief economist at Raymond James.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tJob openings, a measure of labor demand, decreased 556,000 to 7.6 million on the last day of December, the Labor Department's Bureau of Labor Statistics said. The decline was the largest since October 2023.<small class=\"brtag\"> </small></div>\n<div>\r\n\tData for November was revised higher to show 8.156 million vacancies instead of the previously reported 8.098 million.<small class=\"brtag\"> </small></div>\n<div>\r\n\tEconomists polled by Reuters had forecast 8.0 million unfilled positions. Vacancies were down 1.3 million over the year. They remain above the 2019 average.<small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tSome economists viewed jobs openings as too volatile to offer a good signal on the labor market.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe decline in job openings was led by professional and business services, with 225,000 fewer positions.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tVacancies fell 180,000 in healthcare and social assistance, while there were 136,000 fewer open positions in the finance and insurance industry. But arts, entertainment and recreation had 65,000 more unfilled positions. The job openings rate dropped to 4.5 per cent from 4.9 per cent in November.<small class=\"brtag\"> </small></div>\n<div>\r\n\tLayoffs fell 29,000 to 1.771 million as increases in transportation, warehousing and utilities as well as mining and logging were more than offset by decreases in professional and business services. There were also fewer leisure and hospitality layoffs.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe layoffs rate was unchanged at 1.1 per cent for a fourth straight month. It is, however, becoming harder for laid-off workers to find new jobs as employers remain cautious about adding headcount. Hires increased 89,000 to 5.462 million.<small class=\"brtag\"> </small></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tThey were, however, down 325,000 over the year. The increase in December was mostly in finance and retail sectors. The hire rates was unchanged at 3.4 per cent for the third consecutive month.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe US central bank left its benchmark overnight interest rate unchanged in the 4.25 per cent-4.50 per cent range last week amid uncertainty over the economic impact of President Donald Trump's fiscal, trade and immigration policies.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe policy rate has been reduced by 100 basis points since September when the US central bank started its easing policy cycle. The Fed hiked the policy rate by 5.25 percentage points in 2022 and 2023 to tame inflation.<small class=\"brtag\"> </small></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tFinancial markets do not expect a rate cut before June.<small class=\"brtagPara\"> </small>\n<small class=\"brtagPara\"> </small>\n<div>\n<i>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</i></div>\n</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 01:20:31",
            "link": "https://www.business-standard.com/world-news/us-job-openings-post-biggest-drop-in-14-months-falls-to-7-6-mn-in-december-125020401788_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401788"
        },
        {
            "title": "Hope 50% of our portfolio firms go public in 5 years: GSV Ventures CEO",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\n<strong>Michael Moe</strong>, founding partner and chief executive officer, GSV Ventures, expects half the firm’s portfolio companies in India to go public in five years. GSV Ventures has invested in Indian edtech players such as PhysicsWallah, Emeritus, AdmitKard, Apna, and Bright Champs. In an interview with <em>Udisha Srivastav</em> on the sidelines of the ASU + GSV &amp; Emeritus summit, he talks of India’s edtech sector and the impact of artificial intelligence (AI). Edited excerpts:</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Edtech in India has faced the brunt of high valuation. What trends do you foresee in fundraising in 2025?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe edtech sector in India — and globally</div></div>",
            "pub_date": "2025-02-05 01:20:31",
            "link": "https://www.business-standard.com/companies/interviews/hope-50-of-our-portfolio-firms-go-public-in-5-years-gsv-ventures-ceo-125020401417_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401417"
        },
        {
            "title": "Trump wants Ukraine's rare earth elements as condition of further support",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tPresident Donald Trump on Monday indicated that he wants to reach an agreement with Ukraine to gain access to the country's rare earth materials as a condition for continuing US support for its war against Russia.</p>\n<p>\r\n\tSpeaking to reporters in the Oval Office, Trump complained that the US had sent more in military and economic assistance to Ukraine than its European partners, adding, We're looking to do a deal with Ukraine where they're going to secure what we're giving them with their rare earth and other things.\"<small class=\"brtagPara\"> </small> Trump suggested that he's received word from the Ukrainian government that they'd be willing to make a deal to give the US access to the elements critical to the modern high-tech economy.</p>\n<p>\r\n\tI want to have security of rare earth, Trump added. We're putting in hundreds of billions of dollars. They have great rare earth. And I want security of the rare earth, and they're willing to do it.</p>\n<p>\r\n\tTrump, who had previously said he'd bring about a rapid end to the war, said talks are ongoing to bring the conflict to a close.</p>\n<p>\r\n\tWe made a lot of progress on Russia, Ukraine,\" Trump said. \"We'll see what happens. We're going to stop that ridiculous war.</p>\n<p>\r\n\tUkrainian President Volodymyr Zelenskyy told the Associated Press on Saturday that any negotiations between the US and Russia but without his country were unacceptable.</p>\n<p>\r\n\tThey may have their own relations, but talking about Ukraine without us it is dangerous for everyone, Zelenskyy said.</p>\n<p>\r\n\tHe said his team has been in contact with the Trump administration, but those discussions are at a general level, and he believes in-person meetings will take place soon to develop more detailed agreements.</p>\n<p>\r\n\tWe need to work more on this, Zelenskyy said.</p>\n<div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div><blockquote class=\"blockquoteBG styleQ1\" style=\"background-color:#FFF5EB;padding:8px;overflow:hidden\">\n<p>\n<strong>El Salvador offers to take US criminal deportees </strong><small class=\"brtagPara\"> </small>\r\n\t\tEl Salvador’s president made an extraordinary offer to Donald Trump as the US seeks to ramp up deportations: the Central American nation is willing to accept convicted criminals of any nationality, including American citizens. “We have offered the US the opportunity to outsource part of its prison system,” President Nayib Bukele said on X. He added that he’d take the deportees “for a fee”. <strong><span style=\"white-space:pre\"> B</span>loomberg</strong></p>\n</blockquote></div></div>",
            "pub_date": "2025-02-05 01:15:36",
            "link": "https://www.business-standard.com/world-news/trump-wants-ukraine-s-rare-earth-elements-as-condition-of-further-support-125020400038_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400038"
        },
        {
            "title": "Markets rebound to settle at 1-month high after Trump delays tariff storm",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tBenchmark indices rallied on Tuesday along with most Asian peers as investors welcomed a 30-day pause on trade tariffs against Canada and Mexico.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Sensex closed at 78,584, up 1,397 points, or 1.8 per cent. The Nifty ended at 23,739, gaining 378 points, or 1.6 per cent. These gains marked the largest single-day increase for both indices since January 2.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInvestors were relieved after US President Donald Trump announced a temporary halt to additional tariffs on imports from Mexico and Canada, following both countries' commitment to enhance border enforcement efforts. Previously, Trump had imposed a 25 per cent tariff on imports from Canada and Mexico, and a 10 per cent levy on Chinese goods, stoking fears of a global trade war. China's measured response to the US tariffs also reassured investors, who are hopeful of negotiations. China, however, warned several US companies of potential sanctions, which led to a pullback in European equities.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDomestic investors are optimistic that India will avoid Trump's focus, given its relatively smaller exports to the US compared to China.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSigns of recovery in India's manufacturing sector further boosted investor sentiment. The Purchasing Managers' Index (PMI) rose to 57.7 in January, up from a 12-month low of 56.4 in December, driven by increased exports and new orders.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"There is still a lot of uncertainty surrounding tariffs, which is why the market is volatile. The 30-day pause is seen as a positive development, but fundamentally, little has changed. Recent results have been unremarkable,\" said U R Bhat, co-founder of Alphaniti Fintech.<small class=\"brtagPara\"> </small>\n<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"data\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"data\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/04/full/1738689279-5075.jpg?im=Resize=(640,480)\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span></div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndian equity benchmarks have declined for four consecutive months, driven by concerns over slowing earnings and significant foreign portfolio investor (FPI) selling. This selloff has made many stocks cheaper, with several falling sharply from their recent highs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Tuesday, FPIs were net buyers to the tune of Rs 809 crore, while domestic institutions sold shares worth Rs 431 crore. FPIs were net buyers since January 2 for the first time. On the other hand, DIIs (domestic institutional investors) were net sellers for the first time since December 16. Excerpts attributed the selling from DIIs mainly to rebalancing in ITC Hotels by passive funds tracking BSE indices.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"We still face challenges ahead. Gross domestic product (GDP) and earnings growth will be difficult for a few more quarters, and valuations remain elevated. We should not overstate the latest rally. We have an expensive market with single-digit earnings growth,\" said Saurabh Mukherjea, founder of Marcellus Investment Managers.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHDFC Bank, which rose 2.5%, was the biggest contributor to Sensex gains, followed by Reliance Industries (up 3.3 per cent) and Larsen &amp; Toubro (up 4.8 per cent). The rally in RIL follows Reliance Retail’s tie-up with Chinese fast fashion giant Shein, which will be relaunched in India five years after it was banned by the government. Shares of Tata group firm Trent crashed 6.4 per cent, making it the biggest loser among Nifty components.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Nifty Midcap 100 and Nifty Smallcap 100 rose by 1.6 per cent and 1.1 per cent, respectively. Market breadth was strong, with 2,422 stocks advancing and 1,499 declining. The total market capitalisation of BSE-listed companies rose by Rs 6 trillion, reaching Rs 425 trillion.</div></div>",
            "pub_date": "2025-02-05 01:15:33",
            "link": "https://www.business-standard.com/markets/news/markets-log-biggest-jump-in-a-month-sensex-ends-1-397-points-higher-125020401571_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401571"
        },
        {
            "title": "Updated income-tax return: Ensure accuracy as revisions are not permitted",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFinance Minister Nirmala Sitharaman has proposed extending the deadline for filing updated income tax returns (ITRs) from two to four years.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“In the financial year 2024–25, a person can file an updated return for assessment years 2022–23 and 2023–24. The Finance Bill 2025 proposes to extend this deadline to 48 months from the end of the relevant financial year,” says Naveen Wadhwa, deputy general manager, Taxmann.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What is an updated return?</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tAn updated return, filed under Section 139(8A), allows taxpayers to amend missed or incorrect income declarations. It can be filed if they failed to file a return despite exceeding the threshold, omitted income, or overstated losses or refunds.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“A taxpayer liable to pay higher taxes for earlier assessment years can rectify the situation by filing an updated return and paying the additional tax,” says Vivek Jalan, partner, Tax Connect Advisory Services LLP.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIf you wrongly declared long-term capital gains at 12.5 per cent instead of applying the slab rate or carried forward excess losses, an updated return can be used to correct these mistakes.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWadhwa informs that an updated return gives taxpayers more time by allowing them to file a return after deadlines for belated and revised returns have passed.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Conditions attached</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tOnly those with additional tax outgo or reduction in loss claim can file an updated return. “The updated return effectively increases the tax flow to the government,” says Anshul Khemuka, partner, Khaitan &amp; Co.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn updated return cannot be filed in certain circumstances.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“It cannot be filed if it is a return of loss, if the total tax liability gets reduced, or if the refund increases due to the filing of the updated return. Adjustment of additional losses against income is also not allowed,” says Akhil Chandna, partner, global people solutions leader, Grant Thornton Bharat.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis avenue also closes down once tax audits have begun.<small class=\"brtag\"> </small></div>\n<div>\r\n\t“If a search or survey proceeding has been initiated, or a reassessment proceeding is pending, or there is a proceeding under the Black Money Act, the Prevention of Money Laundering Act, or the Benami Act,” says Khemuka.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe option is also unavailable if the assessing officer has relevant information under the Double Taxation Avoidance Agreement (DTAA) or the Tax Information Exchange Agreement (TIEA).<small class=\"brtagPara\"> </small>\n<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"data\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"data\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/04/full/1738688488-4776.jpg?im=Resize=(640,480)\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Compliance benefit</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tFiling an updated return allows taxpayers to rectify errors voluntarily and comply with tax laws.</div>\n<div>\r\n\t“If the tax office discovers a gap in compliance, they could initiate audit proceedings, which could lead to penalties,” says Khemuka.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFiling an updated return also mitigates the risk of an additional tax burden.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“If you file an updated return in the second year, you would pay 50 per cent more on additional tax and interest. But if the department detects undisclosed income, you could end up paying a penalty as high as 200 per cent,” says Jalan.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn updated return also helps avoid prosecution under Section 276CC, according to Wadhwa.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tITRs have become essential for obtaining government contracts and visas.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Someone who has not filed a return but needs one can file an updated return,” says Jalan.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Costs involved</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tTaxpayers filing updated returns must pay an additional tax liability of between 25 and 70 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This additional tax liability would have been avoided if the taxpayer had filed their ITR correctly and within the specified timeline. Adjusting for losses or increasing the loss claim is also not possible through an updated return. A higher tax refund cannot be obtained through this route,” says Chandna.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFiling an updated return may draw scrutiny.</div>\n<div>\r\n\t“There is a chance of your past tax returns being picked up for reassessment, based on an updated return” says Khemuka.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Precautions to exercise</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tBefore filing an updated return, make sure you are eligible to file one. Also, confirm that deadlines for belated or revised returns have expired. Use this option solely to correct issues you are permitted to.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe updated return must accurately reflect changes to income and deductions.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Once filed, it cannot be revised or rectified,” says Jalan.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWadhwa warns that significant changes could attract queries. He advises retaining supporting documents, such as bank statements and investment proofs, to deal with scrutiny.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFinally, Chandna urges taxpayers to file by December rather than waiting until the last moment.</div></div>",
            "pub_date": "2025-02-05 01:10:27",
            "link": "https://www.business-standard.com/finance/personal-finance/updated-i-t-return-ensure-accuracy-as-revisions-are-not-permitted-125020401466_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401466"
        },
        {
            "title": "Welspun New Energy to invest Rs 13.5k cr in clean energy projects in Odisha",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tWelspun New Energy has signed a pact with the Odisha government to invest Rs 13,500 crore for the development of two clean energy projects in the state, a statement said on Tuesday.</p>\n<p>\r\n\tUnder this agreement, Welspun New Energy has committed investments worth Rs 13,500 crore to develop a 1,200 MW pumped hydro project and a 1,000 MW floating solar power project in Odisha, its parent firm Welspun World said in the statement.</p>\n<p>\r\n\tThese projects are expected to enhance the state's energy storage capacity, support the integration of renewable energy into the grid, and contribute to India's overall target of achieving 500 GW of renewable energy capacity by 2030, it added.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"The projects, backed by our Rs 13,500 crore investment in green technologies, mark a key milestone in our mission to accelerate renewable energy adoption in the state, highlighting our unwavering commitment to innovation and sustainability,\" Kapil Maheshwari, Executive Director &amp; CEO of Welspun New Energy, said.</p>\n<p>\r\n\tWelspun World is a conglomerate with a dominant presence in sectors like steel, renewables, line pipes, oil and gas, and infrastructures among others.</p><p></p></div>",
            "pub_date": "2025-02-05 01:10:27",
            "link": "https://www.business-standard.com/companies/news/welspun-new-energy-to-invest-rs-13-5k-cr-in-clean-energy-projects-in-odisha-125020401170_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401170"
        }
    ]
}