{
    "data": [
        {
            "title": "Weak margin in Q3 show drags Titan share price 4%; analysts weigh in",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Titan share price:</strong> Watch and eyewear brand Titan share price took a hit on Wednesday, February 5, 2025, falling as much as 3.53 per cent to an intraday low of Rs 3,472.05 per share despite reporting a decent overall performance for Q3FY25. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe primary concern weighing on the Titan share was weaker-than-expected margin in Q3 results, analysts said. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDomestic brokerage InCred Equities cited weaker-than-expected margin in Q3 in its ‘First Cut’ note. The brokerage, however, maintained an ‘Add’ rating with a target price of Rs 3,840. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThose at Motilal Oswal, too, noted while revenue growth was strong, margins were impacted by a lower studded share and a contraction in gross margin. Therefore, they maintained a ‘Buy’ rating with a target price of Rs 3,588. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTitan’s Ebitda margin contracted 170 basis points (bps) to 9.4 per cent in Q3FY25, from 11.1 per cent in the same quarter the previous year (Q3FY24). However, Ebitda grew 7 per cent year-on-year (Y-o-Y) to Rs 1,674 crore, from Rs 1,565 crore in Q3FY24. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmong other brokerages, JM Financial retained a ‘Hold’ rating, highlighting strong jewellery demand but noting margin pressure. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGlobal brokerages, meanwhile, remained positive on Titan. Goldman Sachs reportedly maintained a ‘Buy’ rating with a target price of Rs 3,900. Macquarie kept an ‘Outperform’ rating, with a target price of Rs 4,150. Similarly, Morgan Stanley maintained an ‘Overweight’ rating on the company, with a target price of Rs 3,876.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOverall, Titan’s profit remained nearly flat, at Rs 1,047 crore, compared to Rs 1,053 crore a year ago, while revenue surged 25.2 per cent Y-o-Y to Rs 17,740 crore, up from Rs 14,164 crore in Q3FY24. The growth in revenue was driven by strong performances in the jewellery and eyecare segments.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Titan Q3 results (segment-wise)</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe jewellery division posted a strong total income of Rs 14,697 crore, growing 26 per cent over Q3FY24. The India business itself grew 25 per cent during the same period. The festive quarter boosted consumer demand, with secondary sales growing 28 per cent, wedding-related purchases up by 29 per cent, and same-store sales growing by 22 per cent. Gold jewellery and coins continued to perform well, with a 27 per cent growth compared to the previous year. The Ebit margin for the jewellery division stood at 9.5 per cent, and after normalising for the impact of custom duties, the margin improved to 11.2 per cent. During the quarter, the company expanded its presence by opening 11 new Tanishq stores and 13 Mia stores in the domestic market.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe watches and wearables division recorded a total income of Rs 1,128 crore, reflecting a 15 per cent increase over Q3FY24. The domestic business grew 14 per cent during the same period, with the analog segment seeing a robust 20 per cent growth. Titan brand itself recorded an 18 per cent increase, while international brands saw a 30 per cent growth in retail sales. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, the wearables segment saw a 20 per cent decline, with both average selling prices and volumes decreasing 8 per cent and 7 per cent, respectively. Ebit for the division was Rs 111 crore, with a margin of 9.8 per cent. The company added 23 new stores, including 12 Titan World stores, 10 Helios stores, and 1 Fastrack store.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEyecare showed promising growth, with total income rising 16 per cent Y-o-Y to Rs 194 crore. International brand sales grew 56 per cent, while sunglasses sales outpaced other product categories, growing 35 per cent. Frames and lenses also posted solid growth in the mid-double digits. The division recorded an Ebit of Rs 21 crore, with a margin of 10.8 per cent. During the quarter, Titan Eye+ opened 3 new stores.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the international front, Titan's jewellery business in North America grew 64 per cent, fuelled by new store openings and solid regional demand. The international presence of Tanishq expanded with two new stores in Dubai and Seattle, bringing the global count to 20 stores (18 Tanishq and 2 Mia). Titan Eye+ also made strides with four international locations.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe festive quarter firmly established a strong growth trajectory for FY25, after a subdued Q1 and healthy Q2. C K Venkataraman, managing director of Titan, noted that the quarter saw the strongest jewellery performance yet for the fiscal year, with retail growth in gold, watches, and eyewear. Despite the profitability being impacted by customs duties, the company is focused on scaling its businesses, especially emerging ones, and remains optimistic for a strong finish to FY25.</div></div>",
            "pub_date": "2025-02-05 14:35:26",
            "link": "https://www.business-standard.com/markets/news/weak-margin-in-q3-show-drags-titan-share-price-4-analysts-weigh-in-125020500530_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500530"
        },
        {
            "title": "Google has plans for placing ads within Gemini AI, but not in 2025: Report",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tGoogle has reportedly confirmed plans to introduce advertisements in the Gemini AI chatbot in the future. According to The Verge, Google CEO Sundar Pichai stated during the company's investor call that Google has \"good ideas\" for native ad concepts in Gemini, however, the current focus remains on user experience.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhen asked about future monetisation opportunities for Gemini and whether ads are part of the strategy, Pichai reportedly said the company will \"give people options over time,\" similar to YouTube. However, for this year, Google will prioritise the subscription-based model. This suggests that ads are unlikely to show up in Gemini for now, but the company has plans for introducing it at some point in the future.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"I do think we're always committed to making the products work and reach billions of users at scale. And advertising has been a great aspect of that strategy. Just like you've seen with YouTube, we'll give people options over time. But for this year, I think you'll see us be focused on the subscription direction,\" Pichai said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAlthough Pichai did not specify how ads will be integrated, they may follow a similar approach to AI Overviews in Google Search results.</div>\n<div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/technology/tech-news/google-to-show-advertisements-in-search-s-ai-generated-overviews-details-124100400309_1.html\" target=\"_blank\">Google to show advertisements in Search's AI-generated Overviews: Details</a></strong></div>\n</div>\n<div>\r\n\tSince October last year, AI-generated summaries in Search have been accompanied by product suggestions related to the search query, marked with a \"sponsored\" label to indicate advertisements. If Google takes a similar approach for Gemini, the AI chatbot's interface might display suggested content or products based on user queries or responses. These ads will likely appear for free-tier Gemini users, while the Advanced subscription is expected to remain ad-free.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 14:35:26",
            "link": "https://www.business-standard.com/technology/tech-news/google-has-plans-for-placing-ads-within-gemini-ai-but-not-in-2025-report-125020500492_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500492"
        },
        {
            "title": "Google has plans for placing ads within Gemini AI, but not in 2025: Report",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tGoogle has reportedly confirmed plans to introduce advertisements in the Gemini AI chatbot in the future. According to The Verge, Google CEO Sundar Pichai stated during the company's investor call that the company has \"good ideas\" for native ad concepts in Gemini, however, the current focus remains on user experience.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhen asked about future monetisation opportunities for Gemini and whether ads are part of the strategy, Pichai reportedly said the company will \"give people options over time,\" similar to YouTube. However, for this year, Google will prioritise the subscription-based model. This suggests that ads are unlikely to show up in Gemini for now, but the company has plans for introducing it at some point in the future.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"I do think we're always committed to making the products work and reach billions of users at scale. And advertising has been a great aspect of that strategy. Just like you've seen with YouTube, we'll give people options over time. But for this year, I think you'll see us be focused on the subscription direction,\" Pichai said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAlthough Pichai did not specify how ads will be integrated, they may follow a similar approach to AI Overviews in Google Search results.</div>\n<div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/technology/tech-news/google-to-show-advertisements-in-search-s-ai-generated-overviews-details-124100400309_1.html\" target=\"_blank\">Google to show advertisements in Search's AI-generated Overviews: Details</a></strong></div>\n</div>\n<div>\r\n\tSince October last year, AI-generated summaries in Search have been accompanied by product suggestions related to the search query, marked with a \"sponsored\" label to indicate advertisements. If Google takes a similar approach for Gemini, the AI chatbot's interface might display suggested content or products based on user queries or responses. These ads will likely appear for free-tier Gemini users, while the Advanced subscription is expected to remain ad-free.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 14:30:31",
            "link": "https://www.business-standard.com/technology/tech-news/google-has-plans-for-placing-ads-within-gemini-ai-but-not-in-2025-report-125020500492_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500492"
        },
        {
            "title": "Trump wants Ukraine to supply US with rare earths in exchange for war aid",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tUS President Donald Trump said on Monday he wants Ukraine to supply the United States with rare earth minerals as a form of payment for financially supporting the country's war efforts against Russia.<small class=\"brtag\"> </small></div>\n<div>\r\n\tTrump, speaking to reporters at the White House, said Ukraine was willing, adding that he wants \"equalisation\" from Ukraine for Washington's \"close to $300 billion\" in support.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/world-news/us-will-take-over-the-gaza-strip-own-it-and-develop-it-says-trump-125020500088_1.html\" target=\"_blank\">US will 'take over' the Gaza strip, own it and develop it, says Trump</a></strong></div>\n</div>\n<div>\r\n\t\"We're telling Ukraine they have very valuable rare earths,\" Trump said. \"We're looking to do a deal with Ukraine where they're going to secure what we're giving them with their rare earths and other things.\"<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tIt was not immediately clear if Trump was using the term \"rare earths\" to refer to all types of critical minerals or just to rare earths.<small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tRare earths are a group of 17 metals used to make magnets that turn power into motion for electric vehicles, cellphones and other electronics. There are no known substitutes.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe US Geological Survey considers 50 minerals to be critical for the country's economy and national defense, including several types of rare earths, nickel and lithium.<small class=\"brtag\"> </small></div>\n<div>\r\n\tUkraine contains large deposits of uranium, lithium and titanium, although none are considered to be among the world's five biggest by volume and the US has its own untapped reserves of those and other critical minerals.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tThe US has only one operating rare earths mine, which is owned by MP Materials. Several other companies are working to develop US rare earths projects.<small class=\"brtag\"> </small></div>\n<div>\r\n\tIn 2024, the United States was reliant on China, Malaysia, Japan and Estonia for 80 percent of its rare earths needs, according to the US Geological Survey.<small class=\"brtagPara\"> </small></div></div>",
            "pub_date": "2025-02-05 14:30:30",
            "link": "https://www.business-standard.com/world-news/trump-wants-ukraine-to-supply-us-with-rare-earths-in-exchange-for-war-aid-125020500526_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500526"
        },
        {
            "title": "K Balasubramanian to succeed Ashu Khullar as India head for Citibank",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tK Balasubramanian will succeed Ashu Khullar as India subcontinent sub-cluster and banking head of Citibank, subject to approval from the Reserve Bank of India (RBI). He will report to Amol Gupte, head of Asia South and banking head.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tKhullar, who has led Citi India since 2019, will now serve as co-head of global asset managers (GAM) alongside Anthony Diamandakis. He will also be part of the investment banking global operating committee.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring Khullar’s tenure from 2019 to 2025, Citi recorded strong growth, emerging as the top investment bank across the equity capital market and mergers and acquisitions, the US-headquartered bank said in a statement.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“These moves highlight the deep talent bench we have across our franchise. India is one of Citi’s largest markets globally, where we have strong business momentum, and we are confident Balasubramanian will build further on our leadership position in this key market,” said Gupte.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBalasubramanian, a seasoned banker, has worked in multiple markets, covering clients across major industries and geographies in India. He joined Citi India in 1996 and has spent over two decades in various roles. He is a commerce graduate from St Xavier’s College, Kolkata, and a qualified chartered accountant (CA) and cost accountant (ICWA).</div></div>",
            "pub_date": "2025-02-05 14:25:25",
            "link": "https://www.business-standard.com/companies/news/k-balasubramanian-to-succeed-ashu-khullar-as-india-head-for-citibank-125020500516_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500516"
        },
        {
            "title": "IND vs ENG: Here's why Varun Chakravarthy added in India's ODI squad?",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><div>\r\n\tWith air still not clear over the fitness of India lynchpin Jasprit Bumrah, the addition of Varun Chakravarthy in the squad for the three-match ODI series against England hinted that the spinner might take the flight to Dubai for the <a href=\"https://www.business-standard.com/cricket/champions-trophy\" target=\"_blank\"><strong>Champions Trophy</strong></a>. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn-form mystery spinner Varun Chakravarthy linked up with India’s ODI squad following his sensational performances in the recently concluded T20 International series against England. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Kolkata Knight Riders (KKR) star, who bagged 14 wickets in five matches and was named Player of the Series, has not been selected for the three-match ODI series against England or the Champions Trophy later this month. However, the team management wants him to \"keep up the momentum.\"</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChakravarthy was seen training and bowling in the nets on Tuesday, sparking fresh speculation about his potential inclusion in India’s Champions Trophy squad.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Yes, Varun Chakravarthy is part of the squad,\" confirmed India’s vice-captain Shubman Gill during a media interaction after the team’s training session.<small class=\"brtagPara\"> </small>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><colgroup span=\"13\" width=\"128\"></colgroup><tbody><tr><td colspan=\"13\" height=\"26\" style=\"text-align:center\" valign=\"middle\">\n<strong>Varun Chakravarthy bowling stats</strong></td></tr><tr><td height=\"26\" style=\"text-align:center\">\n<strong>Format</strong></td><td style=\"text-align:center\">\n<strong>Mat</strong></td><td style=\"text-align:center\">\n<strong>Inns</strong></td><td style=\"text-align:center\">\n<strong>Balls</strong></td><td style=\"text-align:center\">\n<strong>Runs</strong></td><td style=\"text-align:center\">\n<strong>Wkts</strong></td><td style=\"text-align:center\">\n<strong>BBI</strong></td><td style=\"text-align:center\">\n<strong>BBM</strong></td><td style=\"text-align:center\">\n<strong>Ave</strong></td><td style=\"text-align:center\">\n<strong>Econ</strong></td><td style=\"text-align:center\">\n<strong>SR</strong></td><td style=\"text-align:center\">\n<strong>4w</strong></td><td style=\"text-align:center\">\n<strong>5w</strong></td></tr><tr><td height=\"26\" style=\"text-align:center\">\n<strong>T20Is</strong></td><td sdnum=\"16393;\" sdval=\"18\" style=\"text-align:center\">\r\n\t\t\t\t\t18</td><td sdnum=\"16393;\" sdval=\"18\" style=\"text-align:center\">\r\n\t\t\t\t\t18</td><td sdnum=\"16393;\" sdval=\"411\" style=\"text-align:center\">\r\n\t\t\t\t\t411</td><td sdnum=\"16393;\" sdval=\"481\" style=\"text-align:center\">\r\n\t\t\t\t\t481</td><td sdnum=\"16393;\" sdval=\"33\" style=\"text-align:center\">\r\n\t\t\t\t\t33</td><td style=\"text-align:center\">\r\n\t\t\t\t\t5/17</td><td style=\"text-align:center\">\r\n\t\t\t\t\t5/17</td><td sdnum=\"16393;\" sdval=\"14.57\" style=\"text-align:center\">\r\n\t\t\t\t\t14.57</td><td sdnum=\"16393;\" sdval=\"7.02\" style=\"text-align:center\">\r\n\t\t\t\t\t7.02</td><td sdnum=\"16393;\" sdval=\"12.4\" style=\"text-align:center\">\r\n\t\t\t\t\t12.4</td><td sdnum=\"16393;\" sdval=\"0\" style=\"text-align:center\">\r\n\t\t\t\t\t0</td><td sdnum=\"16393;\" sdval=\"2\" style=\"text-align:center\">\r\n\t\t\t\t\t2</td></tr><tr><td height=\"26\" style=\"text-align:center\">\n<strong>FC</strong></td><td sdnum=\"16393;\" sdval=\"1\" style=\"text-align:center\">\r\n\t\t\t\t\t1</td><td sdnum=\"16393;\" sdval=\"1\" style=\"text-align:center\">\r\n\t\t\t\t\t1</td><td sdnum=\"16393;\" sdval=\"234\" style=\"text-align:center\">\r\n\t\t\t\t\t234</td><td sdnum=\"16393;\" sdval=\"105\" style=\"text-align:center\">\r\n\t\t\t\t\t105</td><td sdnum=\"16393;\" sdval=\"1\" style=\"text-align:center\">\r\n\t\t\t\t\t1</td><td style=\"text-align:center\">\r\n\t\t\t\t\t1/105</td><td style=\"text-align:center\">\r\n\t\t\t\t\t1/105</td><td sdnum=\"16393;\" sdval=\"105\" style=\"text-align:center\">\r\n\t\t\t\t\t105</td><td sdnum=\"16393;\" sdval=\"2.69\" style=\"text-align:center\">\r\n\t\t\t\t\t2.69</td><td sdnum=\"16393;\" sdval=\"234\" style=\"text-align:center\">\r\n\t\t\t\t\t234</td><td sdnum=\"16393;\" sdval=\"0\" style=\"text-align:center\">\r\n\t\t\t\t\t0</td><td sdnum=\"16393;\" sdval=\"0\" style=\"text-align:center\">\r\n\t\t\t\t\t0</td></tr><tr><td height=\"26\" style=\"text-align:center\">\n<strong>List A</strong></td><td sdnum=\"16393;\" sdval=\"23\" style=\"text-align:center\">\r\n\t\t\t\t\t23</td><td sdnum=\"16393;\" sdval=\"23\" style=\"text-align:center\">\r\n\t\t\t\t\t23</td><td sdnum=\"16393;\" sdval=\"1169\" style=\"text-align:center\">\r\n\t\t\t\t\t1169</td><td sdnum=\"16393;\" sdval=\"834\" style=\"text-align:center\">\r\n\t\t\t\t\t834</td><td sdnum=\"16393;\" sdval=\"59\" style=\"text-align:center\">\r\n\t\t\t\t\t59</td><td sdnum=\"16393;0;@\" style=\"text-align:center\">\r\n\t\t\t\t\t5/9</td><td sdnum=\"16393;0;@\" style=\"text-align:center\">\r\n\t\t\t\t\t5/9</td><td sdnum=\"16393;\" sdval=\"14.13\" style=\"text-align:center\">\r\n\t\t\t\t\t14.13</td><td sdnum=\"16393;\" sdval=\"4.28\" style=\"text-align:center\">\r\n\t\t\t\t\t4.28</td><td sdnum=\"16393;\" sdval=\"19.8\" style=\"text-align:center\">\r\n\t\t\t\t\t19.8</td><td sdnum=\"16393;\" sdval=\"0\" style=\"text-align:center\">\r\n\t\t\t\t\t0</td><td sdnum=\"16393;\" sdval=\"4\" style=\"text-align:center\">\r\n\t\t\t\t\t4</td></tr><tr><td height=\"26\" style=\"text-align:center\">\n<strong>T20s</strong></td><td sdnum=\"16393;\" sdval=\"106\" style=\"text-align:center\">\r\n\t\t\t\t\t106</td><td sdnum=\"16393;\" sdval=\"105\" style=\"text-align:center\">\r\n\t\t\t\t\t105</td><td sdnum=\"16393;\" sdval=\"2371\" style=\"text-align:center\">\r\n\t\t\t\t\t2371</td><td sdnum=\"16393;\" sdval=\"2919\" style=\"text-align:center\">\r\n\t\t\t\t\t2919</td><td sdnum=\"16393;\" sdval=\"138\" style=\"text-align:center\">\r\n\t\t\t\t\t138</td><td style=\"text-align:center\">\r\n\t\t\t\t\t5/17</td><td style=\"text-align:center\">\r\n\t\t\t\t\t5/17</td><td sdnum=\"16393;\" sdval=\"21.15\" style=\"text-align:center\">\r\n\t\t\t\t\t21.15</td><td sdnum=\"16393;\" sdval=\"7.38\" style=\"text-align:center\">\r\n\t\t\t\t\t7.38</td><td sdnum=\"16393;\" sdval=\"17.1\" style=\"text-align:center\">\r\n\t\t\t\t\t17.1</td><td sdnum=\"16393;\" sdval=\"1\" style=\"text-align:center\">\r\n\t\t\t\t\t1</td><td sdnum=\"16393;\" sdval=\"3\" style=\"text-align:center\">\r\n\t\t\t\t\t3</td></tr></tbody></table>\n</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Gambhir's Influence and Champions Trophy Selection Puzzle</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tIt is understood that head coach Gautam Gambhir wants Chakravarthy to stay in rhythm and bowl against top Indian batters like Virat Kohli, Rohit Sharma, and Rishabh Pant. With the deadline for any last-minute squad changes for the Champions Trophy set for February 12, the spinner remains a strong candidate for selection.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, Chakravarthy faces an uphill battle. India’s squad already includes three finger spinners—Ravindra Jadeja, Axar Patel, and Washington Sundar—along with wrist spinner Kuldeep Yadav, who is returning from a sports hernia surgery.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"As of now, the team management wanted Varun to bowl in the ODI squad nets ahead of the England series. Varun doesn’t play red-ball cricket,\" a senior BCCI source told PTI on conditions of anonymity.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"With the domestic white-ball season already concluded, he doesn’t have any assignments until the start of IPL in late March. He is in good rhythm, and they want him to continue that,\" the source added.<small class=\"brtagPara\"> </small>\n<strong>India squad for Champions Trophy 2025</strong><small class=\"brtagPara\"> </small>\n<strong>India:</strong> Rohit Sharma (c), Shubman Gill, Virat Kohli, Shreyas Iyer, KL Rahul, Hardik Pandya, Axar Patel, Washington Sundar, Kuldeep Yadav, Jasprit Bumrah, Mohammad Shami, Arshdeep Singh, Yashasvi Jaiswal, Rishabh Pant, Ravindra Jadeja.<small class=\"brtag\"> </small>\n<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/cricket/champions-trophy/schedule\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 full schedule, match timings (IST) here</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Will Chakravarthy be added to the India squad for Champions Trophy?</strong></div>\n<small class=\"brtagPara\"> </small>\n<div>\r\n\t\"The selectors have already picked four spinners, and there are only three ODIs before the Champions Trophy,\" the official said.</div><div id=\"between_article_content_10-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"But if the team management wants Varun, they will have to speak to the chairman of the selection committee. Whether they intend to or not is still unknown.\"<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/cricket/champions-trophy/points-table\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 points table here</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Chakravarthy performance in Dubai</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tVarun was part of India's squad for the 2021 ICC T20 World Cup which was hosted by UAE. He was selected on the back of the superb outing in IPL which preceeded the T20 World Cup. </div>\n<div>\n<small class=\"brtag\"> </small>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><colgroup span=\"6\" width=\"128\"></colgroup><tbody><tr><td colspan=\"6\" height=\"26\" style=\"text-align:center\" valign=\"middle\">\n<strong>Varun Chakaravarthy T20 International stats in Dubai</strong></td></tr><tr><td height=\"26\" style=\"text-align:center\">\n<strong>Overs</strong></td><td style=\"text-align:center\">\n<strong>Runs conceeded</strong></td><td style=\"text-align:center\">\n<strong>Wickets</strong></td><td style=\"text-align:center\">\n<strong>Opposition</strong></td><td style=\"text-align:center\">\n<strong>Ground</strong></td><td style=\"text-align:center\">\n<strong>Match Date</strong></td></tr><tr><td height=\"26\" sdnum=\"16393;\" sdval=\"4\" style=\"text-align:center\">\r\n\t\t\t\t\t4</td><td sdnum=\"16393;\" sdval=\"33\" style=\"text-align:center\">\r\n\t\t\t\t\t33</td><td sdnum=\"16393;\" sdval=\"0\" style=\"text-align:center\">\r\n\t\t\t\t\t0</td><td style=\"text-align:center\">\r\n\t\t\t\t\tv Pakistan</td><td style=\"text-align:center\">\r\n\t\t\t\t\tDubai (DICS)</td><td sdnum=\"16393;0;@\" style=\"text-align:center\">\r\n\t\t\t\t\t24 Oct 2021</td></tr><tr><td height=\"26\" sdnum=\"16393;\" sdval=\"4\" style=\"text-align:center\">\r\n\t\t\t\t\t4</td><td sdnum=\"16393;\" sdval=\"23\" style=\"text-align:center\">\r\n\t\t\t\t\t23</td><td sdnum=\"16393;\" sdval=\"0\" style=\"text-align:center\">\r\n\t\t\t\t\t0</td><td style=\"text-align:center\">\r\n\t\t\t\t\tv New Zealand</td><td style=\"text-align:center\">\r\n\t\t\t\t\tDubai (DICS)</td><td sdnum=\"16393;0;@\" style=\"text-align:center\">\r\n\t\t\t\t\t31 Oct 2021</td></tr><tr><td height=\"26\" sdnum=\"16393;\" sdval=\"3\" style=\"text-align:center\">\r\n\t\t\t\t\t3</td><td sdnum=\"16393;\" sdval=\"15\" style=\"text-align:center\">\r\n\t\t\t\t\t15</td><td sdnum=\"16393;\" sdval=\"0\" style=\"text-align:center\">\r\n\t\t\t\t\t0</td><td style=\"text-align:center\">\r\n\t\t\t\t\tv Scotland</td><td style=\"text-align:center\">\r\n\t\t\t\t\tDubai (DICS)</td><td sdnum=\"16393;0;@\" style=\"text-align:center\">\r\n\t\t\t\t\t5 Nov 2021</td></tr></tbody></table>\n</div><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 14:25:25",
            "link": "https://www.business-standard.com/cricket/champions-trophy/ind-vs-eng-here-s-why-varun-chakravarthy-added-in-india-s-odi-squad-125020500508_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500508"
        },
        {
            "title": "Lemon Tree Hotels gain 5% after posting Q3 results; check details here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tLemon Tree Hotels shares advanced 4.9 per cent on Wednesday, logging an intraday high at Rs 154.8 per share on BSE. The buying on the counter came after the company reported its Q3 numbers. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAround 10:36 AM, <a href=\"https://www.business-standard.com/markets/lemon-tree-hotels-ltd-share-price-40619.html\" target=\"_blank\">Lemon Tree share price</a> was up 4.04 per cent at Rs 153.4 per share on BSE. In comparison, the BSE Sensex was down 0.08 per cent at 78,523.99. The market capitalisation of the company stood at Rs 12,073.84 crore. The 52-week high of the stock was at Rs 162.25 per share and the 52-week low was at Rs 112.3 per share. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company released its Q3 results on Tuesday after market hours. Lemon Tree in the quarter ended December 31, 2024, reported a 82 per cent rise in consolidated net profit to Rs 79.9 crore as compared to Rs 43.8 crore a year ago. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company's revenue for the third quarter stood at Rs 355.2 crore as compared to Rs 290.2 crore a year ago implying an increase of 25 per cent year-on-year (Y-o-Y).<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/news/weak-demand-weighs-on-asian-paints-q3-analysts-see-more-pain-in-near-term-125020500157_1.html\" target=\"_blank\">Weak demand weighs on Asian Paints Q3; analysts see more pain in near-term</a></strong></div>\n</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h3>\r\n\tLemon Tree Hotels management commentary</h3>\n<div>\r\n\tGoing forward, the management is confident in the company’s ability to sustain growth in the coming quarters by focusing on accelerated growth in management and franchised portfolio, with a proportionate increase in fee-based income and timely completion of renovation activities in the owned portfolio to further improve gross ARR and occupancy. </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe management noted added that the increased investment in renovation expenses will continue into FY26 until the entire portfolio of owned hotels has been fully renovated and refreshed. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPost this, renovation expenses will be close to 1.8 per cent of revenue on an ongoing basis. With demand growth expected to outpace supply in the next few years and increasing discretionary spending on branded hotels in India, Lemon Tree's increased investment in renovation will allow us to position Lemon Tree as the preferred brand in the mid-market segment, as per management. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the past one year, Lemon Tree shares have gained 5.3 per cent against Sensex's rise of 9.5 per cent. </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 14:20:28",
            "link": "https://www.business-standard.com/markets/news/lemon-tree-shares-gain-5-after-posting-q3-results-check-details-here-125020500364_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500364"
        },
        {
            "title": "Maha Kumbh 2025: PM Modi takes holy dip at Triveni Sangam in Prayagraj",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tPrime Minister Narendra Modi took a holy dip at Triveni Sangam in Prayagraj, Uttar Pradesh, on Wednesday during his visit to the city. He was accompanied by Chief Minister Yogi Adityanath.  </div>\n<small class=\"brtag\"> </small>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"et\">\n<a href=\"https://twitter.com/hashtag/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#WATCH</a> | Prime Minister Narendra Modi takes a holy dip at Triveni Sangam in Prayagraj, Uttar Pradesh<small class=\"brtagPara\"> </small> (Source: ANI/DD)<a href=\"https://twitter.com/hashtag/KumbhOfTogetherness?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#KumbhOfTogetherness</a> <a href=\"https://t.co/a0WAqkSrDb\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/a0WAqkSrDb</a></p>\r\n\t— ANI (@ANI) <a href=\"https://twitter.com/ANI/status/1887016611921449074?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 5, 2025</a></blockquote></div>\n<!-- --> <!-- --> <!-- -->\n<div>\n<small class=\"brtag\"> </small> Earlier, PM Modi was seen taking a boat ride with Uttar Pradesh Chief Minister Yogi Adityanath from Areal Ghat to the Mahakumbh. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMahakumbh 2025 commenced on Paush Purnima, January 13, and is expected to draw millions of devotees. The grand event will continue until Mahashivratri on February 26.  </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHeld once every 12 years, the Maha Kumbh has already welcomed over 380 million pilgrims from India and abroad, according to the Uttar Pradesh government, which is organizing the massive gathering.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSeveral prominent politicians, including Union Home Minister Amit Shah and Defence Minister Rajnath Singh, have attended the grand festival. The Maha Kumbh has also attracted global visitors, including Laurene Powell Jobs, wife of Steve Jobs; Coldplay's lead singer Chris Martin; and Hollywood actor Dakota Johnson.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>February 5: A day of spiritual importance  </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFebruary 5 holds great spiritual significance in Hindu tradition, marking the observance of Magh Ashtami and Bhishma Ashtami — both deeply connected to religious and historical beliefs.  </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Magh Ashtami</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMagh Ashtami, observed on the eighth day of the Hindu month of Magh, is considered highly auspicious for spiritual practices. Devotees participate in holy dips at Triveni Sangam in Prayagraj, engage in almsgiving, and practice meditation. This sacred day also aligns with Gupt Navratri, a period dedicated to deep spiritual devotion and ritual</div></div>",
            "pub_date": "2025-02-05 14:20:27",
            "link": "https://www.business-standard.com/india-news/pm-modi-performs-ritual-bath-at-maha-kumbh-2025-125020500488_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500488"
        },
        {
            "title": "NAPA urges Punjab govt to set up fund for rehabilitation of deported youths",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe North American Punjabi Association (NAPA) on Wednesday urged the Punjab government to establish a rehabilitation fund to support young boys and girls being deported from the United States.</p>\n<p>\r\n\tIn a statement, NAPA Executive Director Satnam Singh Chahal said lack of support and resources for these returnees could lead to severe social and economic challenges for the state.</p>\n<p>\r\n\tHe warned the Punjab government that negligence in addressing this growing crisis would only create more problems for the state, exacerbating unemployment, mental health issues and potential involvement in illegal activities.</p>\n<p>\r\n\tThis comes amid reports that a US military plane carrying 205 illegal immigrants hailing from Punjab and neighbouring states is likely to land at the Amritsar airport on Wednesday afternoon.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Many of these young individuals leave their homes with dreams of a better future but find themselves deported due to immigration challenges. They return with shattered hopes, financial distress, and psychological trauma.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\t\"It is the government's responsibility to ensure their proper rehabilitation and reintegration into society,\" Chahal said.</p>\n<p>\r\n\tHe urged the state government to allocate funds for skill development programmes, employment opportunities and mental health counselling to help these individuals rebuild their lives.</p>\n<p>\r\n\tHe also urged policymakers to engage with organisations like NAPA to create comprehensive strategies to address the issue effectively.</p>\n<p>\r\n\t\"This is not just an individual problem but a societal one,\" Chahal said.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"If we fail to act now, the consequences will be dire, not just for the youth but for Punjab's social fabric and economy as a whole,\" he said.</p>\n<p>\r\n\tAfter Donald Trump assumed office as the US President last month, the country's law enforcement agencies have launched a crackdown against illegal immigrants.</p>\n<p>\r\n\tMany people from Punjab, who entered the US through \"donkey routes\" or other illegal means by spending lakhs of rupees, are now facing deportation.</p><p></p></div>",
            "pub_date": "2025-02-05 14:15:28",
            "link": "https://www.business-standard.com/india-news/napa-urges-punjab-govt-to-set-up-fund-for-rehabilitation-of-deported-youths-125020500233_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500233"
        },
        {
            "title": "Public is in mood for change: EAM after casting his vote for Delhi polls",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tExternal Affairs Minister S Jaishankar and his wife, Kyoko Jaishankar, cast their vote at a polling booth in Delhi's NDMC School of Science and Humanities, Tughlaq Crescent for the Delhi assembly polls.</p>\n<p>\r\n\tAfter casting his vote, Jaishankar said, \"I have been an early voter...I think the public is in a mood for change.\"</p>\n<p>\r\n\tUnion Minister Hardeep Singh Puri, along with his wife Lakshmi Puri, also cast their vote for the Delhi assembly election at Mount Carmel School in Anand Niketan.</p>\n<p>\r\n\tAfter casting his vote in the Assembly poll, Union Minister Hardeep Singh Puri asked Delhi residents to restore Delhi, which, according to him, has been devastated by 'AAP-da' (AAP) in the last so many years.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tPolling for 70 assembly seats began on Wednesday morning in Delhi, as voters cast their ballots for the 8th Assembly amid tight security.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tVoting commenced at 7.00 am and will continue till 6.00 pm, officials said.</p>\n<p>\r\n\tHotly contested constituencies include New Delhi, Jangpura, Kalkaji, Okhla, Mustafabad, Bijwasan, Kasturba Nagar, Greater Kailash, and Patparganj, among others.</p>\n<p>\r\n\tAAP, which currently holds more than 60 seats in the 70-seat assembly, seeks re-election based on its previous terms' achievements.</p>\n<p>\r\n\tThe New Delhi seat sees a high-profile three-way contest with former Delhi CM Arvind Kejriwal (AAP), BJP's Parvesh Verma, and Congress's Sandeep Dikshit (son of former CM Sheila Dikshit). Jangpura sees a contest between AAP's Manish Sisodia, Congress's Farhad Suri, and BJP's Tarvinder Singh Marwah.</p>\n<p>\r\n\tA total of 699 candidates is in the electoral fray on the 70 assembly constituency seats of the national capital.</p>\n<p>\r\n\tDelhi has 1,561,400 registered voters, including 837,617 males, 723,656 females, and 1,267 third-gender voters. The electorate also includes 239,905 first-time voters aged 18-19, 109,368 elderly voters aged 85 and above, and 79,885 persons with disabilities.</p><p></p></div>",
            "pub_date": "2025-02-05 14:15:28",
            "link": "https://www.business-standard.com/elections/delhi-elections/public-is-in-mood-for-change-eam-after-casting-his-vote-for-delhi-polls-125020500231_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500231"
        }
    ]
}