{
    "data": [
        {
            "title": "Galaxy S25 series: Samsung kicks off early deliveries ahead of Feb 7 sale",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tSamsung has started the early deliveries of the new Galaxy S25 series smartphones in India for customers who had pre-ordered the devices. Samsung started accepting pre-orders for the new flagship smartphones from January 23 and will continue to do so until February 6, ahead of the first sale date of February 7. Customers pre-ordering the Galaxy S25 series smartphones also get benefits up to Rs 21,000. </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Samsung Galaxy S25 Ultra: Price, variants and offers</strong></div>\n<ul>\n<li>\r\n\t\t12GB RAM + 256GB Storage: Rs 129,999</li>\n<li>\r\n\t\t12GB RAM + 512GB Storage: Rs 141,999</li>\n<li>\r\n\t\t12GB RAM + 1TB Storage: Rs 165,999</li>\n</ul>\n<div>\r\n\tColours: </div>\n<ul>\n<li>\r\n\t\t256GB and 512GB storage variants are available in Titanium Silverblue, Titanium Gray, Titanium Whitesilver, Titanium Black.</li>\n<li>\r\n\t\tThe 1TB storage variant only comes in Titanium Silverblue colourway.</li>\n<li>\r\n\t\tExclusive colours on Samsung's website: Titanium Jadegreen, Titanium Jetblack and Titanium Pinkgold.</li>\n</ul>\n<div>\r\n\tPre-order offers:</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSamsung is providing a storage upgrade option for customers pre-ordering the Galaxy S25 Ultra in the 256GB variant. This means that customers will be able to get a 12GB RAM + 512GB storage model at the price of the 12GB RAM + 256GB storage variant. Additionally, the company is offering an upgrade bonus of Rs 9,000 on trade-in deals. Those opting not to exchange their current smartphone for the Galaxy S25 Ultra can instead avail a cashback of Rs 7,000 while purchasing the device with a no-interest equated monthly instalment (EMI) plan of nine months.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/technology/tech-news/samsung-to-launch-128gb-storage-variant-of-galaxy-s25-in-india-report-125012900697_1.html\" target=\"_blank\">Samsung to launch 128GB storage variant of Galaxy S25 in India: Report</a></strong></div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\n<strong>Galaxy S25 Plus: Price and variants and offers</strong></div>\n<ul>\n<li>\r\n\t\t12GB RAM + 256GB Storage: Rs 99,999</li>\n<li>\r\n\t\t12GB RAM + 512GB Storage: Rs 111,999</li>\n</ul>\n<div>\r\n\tColours: Navy, Silver Shadow </div>\n<div>\r\n\tExclusive colours on Samsung’s website: Blueblack, Coralred and Pinkgold</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPre-order offers:</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs part of the pre-order offers, customers can avail the 12GB RAM + 512GB storage variant of the Galaxy S25 Plus at the price of the 12GB RAM + 256GB storage variant. There are also no-interest EMI plans of up to 24 months.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Galaxy S25: Price and variants and offers</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t12GB RAM + 256GB Storage: Rs 80,999</div>\n<div>\r\n\t12GB RAM + 512GB Storage: Rs 92,999</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tColours: Icyblue, Silver Shadow, Navy, Mint</div>\n<div>\r\n\tExclusive colours on Samsung’s website: Blueblack, Coralred and Pinkgold</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPre-order offers:</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSamsung announced that customers pre-ordering the Galaxy S25 can receive benefits of up to Rs 11,000 on trade-in deals. Alternatively, those purchasing the smartphone with a no-interest EMI plan of nine months can avail a cashback of Rs 7,000. No-interest EMI plans of up to 24 months are available for the Galaxy S25.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Samsung Galaxy S25 Ultra: Specifications</strong></div>\n<ul>\n<li>\r\n\t\tDisplay: 6.9-inch QHD+ Dynamic AMOLED 2X Display, 120Hz refresh rate (1-120Hz)</li>\n<li>\r\n\t\tProcessor: Qualcomm Snapdragon 8 Elite for Galaxy </li>\n<li>\r\n\t\tRAM: 12GB</li>\n<li>\r\n\t\tStorage: 256GB, 512GB, 1TB</li>\n<li>\r\n\t\tRear camera: 200MP primary (OIS), 50MP Ultra-wide, 50MP telephoto (5x), 10MP telephoto (3x zoom)</li>\n<li>\r\n\t\tFront camera: 12MP</li>\n<li>\r\n\t\tBattery: 5000mAh</li>\n<li>\r\n\t\tCharging: Up to 65 per cent charge in around 30 mins with 45W adapter, wireless charging support</li>\n<li>\r\n\t\tOS: Android 15-based One UI 7</li>\n<li>\r\n\t\tProtection: Corning Gorilla Armor 2, IP68</li>\n</ul>\n<div>\n<strong>Samsung Galaxy S25 Plus: Specifications</strong></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<ul>\n<li>\r\n\t\tDisplay: 6.7-inch QHD+ Dynamic AMOLED 2X Display, 120Hz refresh rate (1-120Hz)</li>\n<li>\r\n\t\tProcessor: Qualcomm Snapdragon 8 Elite for Galaxy </li>\n<li>\r\n\t\tRAM: 12GB</li>\n<li>\r\n\t\tStorage: 256GB, 512GB</li>\n<li>\r\n\t\tRear camera: 50MP primary (OIS), 12MP Ultra-wide, 10MP telephoto (3x zoom)</li>\n<li>\r\n\t\tFront camera: 12MP</li>\n<li>\r\n\t\tBattery: 4900mAh</li>\n<li>\r\n\t\tCharging: Up to 65 per cent charge in around 30 mins with 45W adapter, wireless charging support</li>\n<li>\r\n\t\tOS: Android 15-based One UI 7</li>\n<li>\r\n\t\tProtection: IP68</li>\n</ul>\n<div>\n<strong>Samsung Galaxy S25: Specifications</strong></div>\n<ul>\n<li>\r\n\t\tDisplay: 6.2-inch FHD+ Dynamic AMOLED 2X Display, 120Hz refresh rate (1-120Hz)</li>\n<li>\r\n\t\tProcessor: Qualcomm Snapdragon 8 Elite for Galaxy </li>\n<li>\r\n\t\tRAM: 12GB</li>\n<li>\r\n\t\tStorage: 256GB, 512GB</li>\n<li>\r\n\t\tRear camera: 50MP primary (OIS), 12MP Ultra-wide, 10MP telephoto (3x zoom)</li>\n<li>\r\n\t\tFront camera: 12MP</li>\n<li>\r\n\t\tBattery: 4000mAh</li>\n<li>\r\n\t\tCharging: Up to 50 per cent charge in around 30 mins with 25W adapter and 3A USB-C cable, wireless charging support</li>\n<li>\r\n\t\tOS: Android 15-based One UI 7</li>\n<li>\r\n\t\tProtection: IP68</li>\n</ul></div>",
            "pub_date": "2025-02-04 13:00:34",
            "link": "https://www.business-standard.com/technology/tech-news/galaxy-s25-series-samsung-kicks-off-early-deliveries-ahead-of-feb-7-sale-125020400246_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400246"
        },
        {
            "title": "Apple raises concerns over first porn app on iPhone under new EU rules",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tApple on Monday criticized a pornography app newly available on iPhones in the European Union, saying the bloc's digital policy was undermining consumer confidence in Apple.<small class=\"brtag\"> </small></div>\n<div>\r\n\tSince it first opened the App Store on iPhones in 2008, Apple has controlled what apps could be downloaded to the devices, with then-CEO Steve Jobs saying in 2010 that keeping porn off the iPhone was Apple's \"moral responsibility\" and one of the company's major motivations for acting as a gatekeeper.<small class=\"brtag\"> </small></div>\n<div>\r\n\tIn the EU, Apple's gatekeeper status changed with the 2022 adoption of the Digital Markets Act (DMA), which required Apple to allow alternative app stores. One of those stores, called AltStore, has begun distributing an app called Hot Tub, which describes itself as \"a private, secure, and elegant way to browse adult content.\"<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tIn a statement, Apple said it is \"deeply concerned about the safety risks that hardcore porn apps of this type create for EU users, especially kids. This app and others like it will undermine consumer trust and confidence in our ecosystem.\" AltStore said it had received backing from Epic Games, the creator of the \"Fortnite\" video game that pursued an antitrust complaint against Apple.<small class=\"brtagPara\"> </small> AltStore said it used that funding to pay fees that Apple charges to alternative app stores that are under investigation by the EU, according to media reports.<small class=\"brtag\"> </small></div>\n<div>\r\n\tAs part of its alternative app store process, Apple still requires apps to undergo a baseline review called \"notarization\" that checks for cybersecurity threats such as known malware but does not involve approving the app's content.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tAltStore said Hot Tub was notarized by Apple and in a post on X described that move as making the app \"the world's 1st Apple-approved porn app,\" raising Apple's ire.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"Contrary to the false statements made by the marketplace developer, we certainly do not approve of this app and would never offer it in our App Store,\" Apple said in a statement.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"The truth is that we are required by the European Commission to allow it to be distributed.\"<small class=\"brtag\"> </small></div>\n<div>\r\n\tAltStore said comments on X were in reference to Apple's notarization decision, and Hot Tub steered press inquiries to AltStore.<small class=\"brtag\"> </small></div>\n<div>\r\n\tIn a post on X, Epic Games Chief Executive Tim Sweeney said his firm has supported laws such as the DMA because \"when Apple are allowed to be the gatekeeper of competing apps and stores, they grossly misuse that power to disadvantage competition.\" He added that Epic's own app store in the EU, which rolled out last year, is not carrying the Hot Tub app and has never hosted porn apps.<small class=\"brtag\"> </small></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\n<div>\n<i>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</i></div>\n</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 13:00:34",
            "link": "https://www.business-standard.com/technology/tech-news/apple-raises-concern-over-first-porn-app-on-iphone-under-new-eu-rules-125020400252_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400252"
        },
        {
            "title": "Power Grid share price slips 4% on weak Q3 performance; details here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Power Grid share price: </strong>Power Grid announced a weak set of December quarter of financial year <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">(Q3FY25) results</a> on Monday, February 3, 2025, post-market hours. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing this, on Tuesday, <a href=\"https://www.business-standard.com/markets/power-grid-corporation-of-india-ltd-share-price-5455.html\" target=\"_blank\">Power Grid share price</a> slipped as much as 4.08 per cent to hit an intraday low of Rs 272.30. It was also the top loser on the BSE Sensex index.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, at 9:45 AM, Power Grid share was off day’s low, and was trading 1.88 per cent lower at Rs 278.55 per share. In comparison, BSE Sensex was trading 0.91 per cent higher at 77,890.78 levels.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/companies/results/power-grid-corp-q3-results-pat-dips-4-to-rs-3-682-cr-on-weak-demand-125020301166_1.html\" target=\"_blank\">Power Grid’s consolidated profit dropped</a> 4.1 per cent year-on-year (Y-o-Y) to Rs 3,861.6 crore in the December quarter of financial year 2025 (Q3FY25), from Rs 4,028.3 crore in the same quarter last year (Q3FY24).</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company’s revenue dropped 2.7 per cent Y-o-Y to Rs 11,233 crore in Q3FY25, from Rs 11,549.8 crore in Q3FY24. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt the operating front, earnings before interest, tax, depreciation and amortisation (Ebitda) tanked 6.6 per cent annually to Rs 9,538 crore in Q3FY25, from Rs 10,212.9 crore in Q3FY24. Subsequently, Ebitda margin squeezed 350 bps to 84.9 per cent in Q3FY25, from 88.4 per cent in Q3FY24. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company declared a second interim dividend of Rs 3.25 per share for FY25. February 7 has been fixed as the record date for the dividend.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAdditionally, the Board approved an investment of Rs 370 crore for the 400kV Vindhyachal PS – Sasan D/C Line at Hindalco Switchyard, scheduled for commissioning by December 2026.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDespite the weak Q3 show, ICICI Securities analysts said that the transmission opportunity over the next 5 years is major given the strong generation capacity addition programme and Power Grid will be one of the key beneficiaries. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTherefore, analysts at ICICI Securities said that they await the company’s guidance in terms of capacity addition over the next 3-5 years, and suggest using any major corrections to add the stock.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPower Grid primarily focuses on the transmission of electricity through its EHVAC/HVDC network. Additionally, the company has expanded into the telecom sector by utilising its extensive Pan-India transmission infrastructure, incorporating the installation of Optical Ground Wire (OPGW).</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLast checked, Power Grid market capitalisation stood at Rs 2,60,835 crore, according to BSE.</div></div>",
            "pub_date": "2025-02-04 12:55:29",
            "link": "https://www.business-standard.com/markets/news/power-grid-share-price-slips-4-on-weak-q3-performance-details-here-125020400242_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400242"
        },
        {
            "title": "18,000 Indians identified as illegal immigrants in US; 205 deported so far",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tA US military plane has deported 205 Indian migrants as part of President Donald Trump’s strict immigration policies. The C-17 aircraft departed from San Antonio, Texas, early on Tuesday morning, around 3 am IST.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump introduced military deportation flights last week under his emergency declaration on immigration.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"For the first time in history, we are locating and loading illegal aliens into military aircraft and flying them back to the places from which they came,\" Trump told reporters last month.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing a call with Prime Minister Narendra Modi, Trump said he expected India to cooperate. “He (Modi) will do what’s right when it comes to taking back illegal Indian immigrants from America,” he said.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndia and the US have identified around 18,000 Indian nationals in the US without legal status. In the 2023-24 period, the US Department of Homeland Security deported over 1,100 Indian nationals. Globally, 495 repatriation flights returned 160,000 individuals to 145 countries, including India.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe number of Indian migrants attempting to enter the US unlawfully has grown. In 2023-24, US officials recorded 90,415 attempts by Indian nationals to enter the country without authorisation, mostly via the northern border. Indians now make up around 3% of all unauthorised crossings, surpassing other Asian groups such as Filipinos, according to US Customs and Border Protection (CBP) data.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Why do Indians attempt illegal migration?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEconomic challenges and visa restrictions are major factors driving migration.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The lowest per capita income in the US is $48,110, in the state of Mississippi,” said Russell A Stamets, partner at Circle of Counsels. “The net national income for India is about 2.4% of that—around $1,161—and Bihar has the lowest per capita income at about $708, or around 1.5% of the poorest state in the US.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHe added, “There will always be people looking to better their life situation.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tVisa delays are another challenge.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Many Indians face restrictions and long delays in obtaining visas or green cards,” said Zeeshan Farooqui, partner at King Stubb &amp; Kasiva. “This drives some to explore alternative routes, often at great financial and personal risk.”</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Skilled migration still dominates</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDespite the rise in illegal migration, Indians remain the largest recipients of skilled worker visas in the US. By September 30, 2023, Indian nationals received about 78% of the 265,777 H-1B visas issued, totalling around 207,307. The H-1B visa programme plays a key role in US industries such as science, technology, engineering, and mathematics (STEM).</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Immigration and crime</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe role of immigrants in society has sparked debate. Last month, Bishop Mariann Edgar Budde of the National Cathedral in Washington urged Trump to reconsider his stance.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“In the name of our God, I ask you to have mercy upon the people in our country who are scared now,” she said.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The people...they are people who pick our crops, clean our office buildings, who labour in poultry and meat-packing plants, who wash our dishes after we eat in restaurants, and work the night shifts in hospitals,” she said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“They may not be citizens nor have proper documentation, but the vast majority of immigrants are not criminals. They pay taxes and are good neighbours. They are faithful members of our churches, synagogues, gurdwaras, mosques and temples.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump, however, maintained his position, saying, “A large number of immigrants have come to the United States illegally and killed people.” He did not provide specific figures.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tStudies suggest immigration is not linked to increased crime.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Immigrants in the United States commit crimes at lower rates than the US-born population,” according to a report by Migration Policy.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tData from the National Bureau of Economic Research and state records from Texas indicate that most prosecutions of immigrants involve immigration law violations rather than violent or property crimes. Some experts suggest that fear of deportation discourages unauthorised immigrants from engaging in criminal activity.</div></div>",
            "pub_date": "2025-02-04 12:55:29",
            "link": "https://www.business-standard.com/finance/personal-finance/18-000-indians-identified-as-illegal-immigrants-in-us-205-deported-so-far-125020400247_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400247"
        },
        {
            "title": "Ladki Bahin scheme to continue in Maharashtra without interruption: Shinde",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tMaharashtra Deputy Chief Minister Eknath Shinde has said the Ladki Bahin scheme will continue without interruption, reaffirming the Mahayuti government's commitment to the welfare of women.</p>\n<p>\r\n\tThe Ladki Bahin scheme is widely credited to have contributed to the BJP-led coalition's big win in the state assembly polls in November 2024.</p>\n<p>\r\n\tWomen are provided a monthly assistance of Rs 1,500 under the scheme.</p>\n<p>\r\n\tThe Shiv Sena headed by Shinde and the Ajit Pawar-led NCP are constituents of the ruling Mahayuti.</p>\n<p>\r\n\tAddressing a gathering at an event in Thane city on Monday night, Shinde said, \"The Mahayuti government would never allow the Ladki Bahin scheme to be discontinued.\"<small class=\"brtagPara\"> </small>\r\n\tHe reiterated the government's commitment to social welfare programmes.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\t\"Our responsibility has increased as we have been given another chance to serve the people,\" said Shinde, who holds charge of the housing and urban development departments.</p>\n<p>\r\n\tHe addressed concerns related to pending housing projects across Mumbai, Thane, Pune and the rest of Maharashtra.</p>\n<p>\r\n\tThe minister assured that stalled development projects, some pending for over 25 years, would now be completed in a time-bound manner.</p>\n<p>\r\n\tHe praised the cluster development scheme introduced by the Maharashtra government, calling it a one-of-a-kind initiative not seen in any other country.</p>\n<p>\r\n\tIt would effectively address shortcomings of the Slum Rehabilitation Authority (SRA) scheme, particularly the exclusion of residents living on upper floors from rehabilitation benefits, Shinde said.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"The cluster scheme will provide a comprehensive solution for all types of rehabilitation and development, ensuring that every affected family receives the benefits they deserve,\" he said.</p>\n<p>\r\n\tTaking a dig at political opponents, Shinde said his government does not merely show pictures and make grand announcements, but takes action and delivers results.</p>\n<p>\r\n\t\"Now that I am the housing minister, I will ensure that long-pending projects finally see the light of day and are completed on time,\" he said.</p><p></p></div>",
            "pub_date": "2025-02-04 12:50:29",
            "link": "https://www.business-standard.com/india-news/ladki-bahin-scheme-to-continue-in-maharashtra-without-interruption-shinde-125020400221_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400221"
        },
        {
            "title": "Power Grid share price slips 4% on weak Q3 performance; details here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Power Grid share price: </strong>Power Grid announced a weak set of December quarter of financial year <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">(Q3FY25) results</a> on Monday, February 3, 2025, post-market hours. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing this, on Tuesday, <a href=\"https://www.business-standard.com/markets/power-grid-corporation-of-india-ltd-share-price-5455.html\" target=\"_blank\">Power Grid share price</a> slipped as much as 4.08 per cent to hit an intraday low of Rs 272.30. It was also the top loser on the BSE Sensex index.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, at 9:45 AM, Power Grid share was off day’s low, and was trading 1.88 per cent lower at Rs 278.55 per share. In comparison, BSE Sensex was trading 0.91 per cent higher at 77,890.78 levels.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/companies/results/power-grid-corp-q3-results-pat-dips-4-to-rs-3-682-cr-on-weak-demand-125020301166_1.html\" target=\"_blank\">Power Grid’s consolidated profit dropped</a> 4.1 per cent year-on-year (Y-o-Y) to Rs 3,861.6 crore in the December quarter of financial year 2025 (Q3FY25), from Rs 4,028.3 crore in the same quarter last year (Q3FY24).</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company’s revenue dropped 2.7 per cent Y-o-Y to Rs 11,233 crore in Q3FY25, from Rs 11,549.8 crore in Q3FY24. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt the operating front, earnings before interest, tax, depreciation and amortisation (Ebitda) tanked 6.6 per cent annually to Rs 9,538 crore in Q3FY25, from Rs 10,212.9 crore in Q3FY24. Subsequently, Ebitda margin squeezed 350 bps to 84.9 per cent in Q3FY25, from 88.4 per cent in Q3FY24. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company declared a second interim dividend of Rs 3.25 per share for FY25. February 7 has been fixed as the record date for the dividend.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAdditionally, the Board approved an investment of Rs 370 crore for the 400kV Vindhyachal PS – Sasan D/C Line at Hindalco Switchyard, scheduled for commissioning by December 2026.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDespite the weak Q3 show, ICICI Securities analysts said that the transmission opportunity over the next 5 years is major given the strong generation capacity addition programme and Power Grid will be one of the key beneficiaries. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTherefore, analysts at ICICI Securities said that they await the company’s guidance in terms of capacity addition over the next 3-5 years, and suggest using any major corrections to add the stock.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPower Grid primarily focuses on the transmission of electricity through its EHVAC/HVDC network. Additionally, the company has expanded into the telecom sector by utilising its extensive Pan-India transmission infrastructure, incorporating the installation of Optical Ground Wire (OPGW).</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLast checked, Power Grid market capitalisation stood at Rs 2,60,835 crore, according to BSE.</div></div>",
            "pub_date": "2025-02-04 12:50:28",
            "link": "https://www.business-standard.com/markets/news/power-grid-share-price-slips-4-on-weak-q3-performance-details-here-125020400242_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400242"
        },
        {
            "title": "Trump's proposed tariffs come with inflation risks: Fed officials",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<div>\r\n\t\tThe Trump administration's plans for trade tariffs come with inflation risks, three Federal Reserve officials warned on Monday, with one arguing that uncertainty over the outlook for prices calls for slower interest-rate cuts than otherwise.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tTrump on Saturday slapped across-the-board tariffs on the three largest US trade partners, though by late Monday the leaders of Mexico and Canada had won a 30-day reprieve after they agreed to stepped-up efforts to stem drug trafficking.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tTariffs on China are set to begin on Tuesday, and Trump has signaled he will impose duties on other trading partners as well.</div>\n<div>\r\n\t\t\"The kind of broad-based tariffs that were announced over the weekend, one would expect to have an impact on prices,\" Boston Fed President Susan Collins said in an interview with CNBC, adding that \"with broad-based tariffs, you actually would not only see increases in prices of final goods, but also a number of intermediate goods.\"</div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tLittle modern experience on how mega-tariffs impact the economy makes it hard for the Fed to know exactly how big or long-lasting the effects will be, she said, noting that it is possible the Fed could even shrug off a one-time increase in inflation tied to the tariffs.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tSpeaking later in the day on Marketplace Radio, Chicago Fed President Austan Goolsbee said that very lack of clarity requires a go-slower approach on interest-rate cuts.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\"Now we've got to be a little more careful and more prudent of how fast rates could come down because there are risks that inflation is about to start kicking back up again,\" Goolsbee said.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tHe did not repeat his recent mantra, voiced as recently as last week, that rates will need to come down a fair bit over the next year, given progress on bringing down inflation and the goal of keeping the economy at full employment.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tEarlier in the day, Atlanta Fed President Raphael Bostic warned his business contacts were planning to pass through any rising costs from the tariffs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\"The ultimate question about whether that is significantly inflationary depends on exactly how it plays out,\" as there are scenarios where the Fed may be able to shrug off these increases and ones where it might not be able to. \"To the extent that were to impact things like inflation expectations then you'd have to,\" Bostic told reporters after a speech.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tAnalysts at the Peterson Institute for International Economics said on Monday that the full suite of tariffs on the three nations, if implemented, will cost the typical American household an additional $1,200 a year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\"The burden will fall disproportionately on low-income households who spend more of their income on physical goods relative to higher income households,\" ING chief international economist James Knightley said, noting that tariffs are effectively tax increases on American citizens, as they are paid by the citizens of importing nations.</div>\n<h3>\r\n\t\t'No Urgency'</h3>\n<div>\r\n\t\tThe Federal Reserve, which cut interest rates by a full percentage point last year, held its policy rate steady last week, flagging uncertainty in the economic outlook. Fed Chair Jerome Powell said after the meeting that when it comes to tariffs, \"we need to let those policies be articulated before we can even begin to make a plausible assessment of what their implications for the economy will be.\"</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tCollins, who is a voting member of the Fed's rate-setting committee this year, told CNBC that Fed policy is well-positioned. She noted that \"it's really appropriate for policy to be patient, careful, and there's no urgency for making additional adjustments, especially given all of the uncertainty, even though, of course, we're still somewhat restrictive\" with the current stance of interest rates.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tBostic also signaled he was ready to stay on the sidelines for the time being. There is \"a ton of uncertainty in a ton of space,\" Bostic told a Rotary Club of Atlanta meeting, adding \"there are a lot of things I am going to wait and see about ...</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<div>\r\n\t\tI'd be very satisfied to wait for a while\" with rates at their current levels.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tCollins left the door open to further rate cuts, saying \"I certainly would see additional ... normalization, in terms of what the policy stance is,\" without providing a time frame.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tFinancial markets are currently betting the Fed will wait until at least June before it cuts rates again.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</em></div>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 12:45:30",
            "link": "https://www.business-standard.com/world-news/trump-s-proposed-tariffs-come-with-inflation-risks-fed-officials-125020400240_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400240"
        },
        {
            "title": "Dr Agarwal's Health Care IPO listing: Shares list flat on NSE, down on BSE",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Dr Agarwal's Health Care's IPO listing:</strong> Shares of healthcare services provider Dr Agarwal's Health Care made a negative debut on D-Street on Tuesday, February 4, 2025, following the completion of its <a href=\"https://www.business-standard.com/about/what-is-ipo\" target=\"_blank\">initial public offering (IPO)</a>. Dr Agarwal's Health Care shares listed at Rs 396.90 apiece on the BSE, a discount of Rs 5.10 or 1.27 per cent against its allotment price of Rs 402.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the National Stock Exchange (NSE), the company's shares listed flat at Rs 402, the same as the IPO allotment price.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/markets/ipo/dr-agarwals-health-care-ltd-ipo-71013\" target=\"_blank\">Dr Agarwal's Health Care's IPO</a> listing was largely in line with grey market expectations. Ahead of the listing, the company's shares were trading at Rs 398 apiece, a discount of Rs 4 per share or 1 per cent against the issue price, according to the sources tracking unofficial markets. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Dr Agarwal's Health Care IPO details</strong></div>\n<div>\r\n\tDr Agarwal's Health Care launched a book-built issue worth Rs 3,027.26 crore, comprising a fresh issue of 74,62,686 equity shares and an offer for sale (OFS), with promoters and shareholders divesting up to 6,78,42,284 equity shares with a face value of Rs 1 apiece.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe IPO was available at a price band of Rs 382-402 per share with a lot size of 35 equity shares. The public offering was open for subscription from Wednesday, January 29, 2025, to Friday, January 31, 2025. The basis of allotment was finalized on Monday, February 3, 2025.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDr Agarwal's Health Care raised Rs 875.51 crore from anchor investors through bidding on January 28, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company will not receive any proceeds from the OFS. \"Each of the Selling Shareholders shall be entitled to their respective portion of the proceeds of the Offer for Sale after deducting their proportion of offer-related expenses and relevant taxes thereon, as applicable,\" the company stated in its RHP (Red Herring Prospectus).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDr Agarwal's Health Care, however, proposes to utilize the net proceeds from the fresh issue for the repayment/prepayment (in part or full) of certain borrowings and for general corporate purposes, including unidentified inorganic acquisitions.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>About Dr Agarwal's Health Care</strong></div>\n<div>\r\n\tDr Agarwal's Health Care provides a comprehensive range of eye care services, including cataract, refractive, and other surgeries; consultations, diagnoses, and non-surgical treatments; as well as the sale of opticals, contact lenses, accessories, and eye care-related pharmaceutical products. According to the CRISIL MI&amp;A Report, Dr Agarwal's Health Care held a market share of approximately 25 per cent of the total eye care service chain market in India during the financial year 2024.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 12:45:29",
            "link": "https://www.business-standard.com/markets/news/dr-agarwal-s-health-care-ipo-listing-shares-list-flat-on-nse-down-on-bse-125020400225_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400225"
        },
        {
            "title": "Trump's proposed tariffs could mean higher costs for Canadian whisky in US",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tGlobal makers of alcoholic drinks like Diageo are caught in the cross-fire of a major trade war as threatened tariffs -- postponed for a month-- could deal a hefty blow to an industry already struggling with falling sales.<small class=\"brtag\"> </small></div>\n<div>\r\n\tUS President Donald Trump over the weekend signed executive orders imposing 25 per cent tariffs on Canada and Mexico, the United States' two main trading partners. On Monday, after discussions with each country's leader, he postponed his decision on tariffs for one month.<small class=\"brtag\"> </small></div>\n<div>\r\n\tWith the US pausing tariffs on Monday, Canada dropped retaliatory measures, such as 25 per cent levies on a raft of US</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\timports, including beer, wine and bourbon. Similarly, Ontario Premier Doug Ford dropped his previous order to pull American-made liquor off the shelves in the province.<small class=\"brtag\"> </small></div>\n<div>\r\n\tKey brands like Don Julio tequila and Jack Daniel's whiskey from producers like Diageo and Brown-Forman would become more expensive for US and Canadian drinkers if importers hike prices to cover the cost of future tariffs. Some analysts estimated brands like Diageo's Crown Royal Canadian whisky would rise in price by as much as 10 per cent, threatening to hurt sales.<small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tUS tariffs would drive steep price hikes on imported booze like Canadian whisky at a time when financially stretched consumers are already cutting back. But while US bourbon and whiskey producers could see a bump in domestic sales, their own export businesses could be curtailed by retaliatory tariffs.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\t\"Given pressures on consumer budgets, such a price increase would likely lead to a shift in demand to cheaper/unimpacted products,\" Fintan Ryan, analyst at stockbroker Goodbody, said in a note.<small class=\"brtag\"> </small></div>\n<div>\r\n\tFor example, home-brewed beer or spirits might become more competitive as costs of foreign goods rise.<small class=\"brtag\"> </small></div>\n<div>\r\n\tRalph De La Rosa, president of Miami-based freight company Imperial Freight Brokers, which works with alcohol companies, said alcohol companies' options to offset tariffs would be limited.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"There really aren't too many mitigation strategies,\" he said, adding that spirit makers would have to decide how they handle the higher cost: pass it all on to consumers or use their own margin to absorb at least some of it, he continued.<small class=\"brtag\"> </small></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tDiageo declined to comment ahead of its results on Tuesday.<small class=\"brtag\"> </small></div>\n<div>\r\n\tBrown-Forman did not respond to requests for comment.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"At a time when the combined wine and spirits marketplace is down 5.5 per cent in volume, the combination of tariffs and increased domestic pressure could have severe and negative effects on the US beverage alcohol marketplace,\" the Wine &amp; Spirits Wholesalers of America industry body said in a note published after tariffs were announced on Feb 1.<small class=\"brtag\"> </small></div>\n<div>\r\n\tBrian Rosen, founder of alcohol investor InvestBev, said tariffs on foreign goods could boost US spirits like US-made whiskey as they become more price competitive.<small class=\"brtag\"> </small></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tBut Jeff Quint, CEO of Cedar Ridge Distillery, a small bourbon maker in Swisher, Iowa, worried that any retaliatory tariffs imposed by Canada would cut off a key export market when production far outstrips domestic demand.<small class=\"brtag\"> </small></div>\n<div>\r\n\tHe feared this could prompt supply gluts and drive price wars as local producers struggle to sell all their stock domestically.<small class=\"brtag\"> </small></div>\n<div>\r\n\tFor others, the negative impact was immediate. Victor Yarbrough, chief executive officer of Brough Brothers Distillery, a small bourbon producer, had been in talks to have his products stocked in Canada - a key pillar of the firm's growth plan.<small class=\"brtag\"> </small></div>\n<div>\r\n\tFollowing the tariffs, his Canadian partner axed the deal as a result of an instruction not to stock US spirits.<small class=\"brtag\"> </small></div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tFor Diageo, whose Mexican tequila labels like Don Julio would also be at risk, a shift to cheaper products by US</div>\n<div>\r\n\tconsumers could equate to a cost of up to $600 million per year, or 3 per cent of group sales, Goodbody's Ryan estimated, though analysts at Jefferies put this at more like 1.5 per cent.<small class=\"brtag\"> </small></div>\n<div>\r\n\tDiageo's shares closed over 2 per cent lower on Monday.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe tariffs and retaliatory tariffs would threaten alcohol sales in all three markets-- the US, Canada and potentially Mexico-- which are among the highest alcohol-consuming countries on a per capita basis.<small class=\"brtag\"> </small></div>\n<div>\r\n\tShares of Constellation Brands, which makes Modelo and Corona beer for the US market in Mexico, and Jack Daniel's maker Brown-Forman, also fell on Monday.<small class=\"brtag\"> </small></div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tBrown-Forman Corp. CEO Lawson Whiting said in an investor call in December that previous European retaliatory tariffs on American whiskey were \"a very painful and challenging time for us.\"<small class=\"brtag\"> </small></div>\n<div>\n<div>\n<i>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</i></div>\n</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 12:40:29",
            "link": "https://www.business-standard.com/world-news/trump-s-proposed-tariffs-could-mean-higher-costs-for-canadian-whisky-in-us-125020400223_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400223"
        },
        {
            "title": "Dr Agarwal's Health Care IPO listing: Shares list flat on NSE, down on BSE",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Dr Agarwal's Health Care's IPO listing:</strong> Shares of healthcare services provider Dr Agarwal's Health Care made a negative debut on D-Street on Tuesday, February 4, 2025, following the completion of its <a href=\"https://www.business-standard.com/about/what-is-ipo\" target=\"_blank\">initial public offering (IPO)</a>. Dr Agarwal's Health Care shares listed at Rs 396.90 apiece on the BSE, a discount of Rs 5.10 or 1.27 per cent against its allotment price of Rs 402.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the National Stock Exchange (NSE), the company's shares listed flat at Rs 402, the same as the IPO allotment price.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/markets/ipo/dr-agarwals-health-care-ltd-ipo-71013\" target=\"_blank\">Dr Agarwal's Health Care's IPO</a> listing was largely in line with grey market expectations. Ahead of the listing, the company's shares were trading at Rs 398 apiece, a discount of Rs 4 per share or 1 per cent against the issue price, according to the sources tracking unofficial markets. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Dr Agarwal's Health Care IPO details</strong></div>\n<div>\r\n\tDr Agarwal's Health Care launched a book-built issue worth Rs 3,027.26 crore, comprising a fresh issue of 74,62,686 equity shares and an offer for sale (OFS), with promoters and shareholders divesting up to 6,78,42,284 equity shares with a face value of Rs 1 apiece.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe IPO was available at a price band of Rs 382-402 per share with a lot size of 35 equity shares. The public offering was open for subscription from Wednesday, January 29, 2025, to Friday, January 31, 2025. The basis of allotment was finalized on Monday, February 3, 2025.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDr Agarwal's Health Care raised Rs 875.51 crore from anchor investors through bidding on January 28, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company will not receive any proceeds from the OFS. \"Each of the Selling Shareholders shall be entitled to their respective portion of the proceeds of the Offer for Sale after deducting their proportion of offer-related expenses and relevant taxes thereon, as applicable,\" the company stated in its RHP (Red Herring Prospectus).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDr Agarwal's Health Care, however, proposes to utilize the net proceeds from the fresh issue for the repayment/prepayment (in part or full) of certain borrowings and for general corporate purposes, including unidentified inorganic acquisitions.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>About Dr Agarwal's Health Care</strong></div>\n<div>\r\n\tDr Agarwal's Health Care provides a comprehensive range of eye care services, including cataract, refractive, and other surgeries; consultations, diagnoses, and non-surgical treatments; as well as the sale of opticals, contact lenses, accessories, and eye care-related pharmaceutical products. According to the CRISIL MI&amp;A Report, Dr Agarwal's Health Care held a market share of approximately 25 per cent of the total eye care service chain market in India during the financial year 2024.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 12:40:29",
            "link": "https://www.business-standard.com/markets/news/dr-agarwal-s-health-care-ipo-listing-shares-list-flat-on-nse-down-on-bse-125020400225_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400225"
        }
    ]
}