{
    "data": [
        {
            "title": "Premier League refs set to make in-stadium announcements for VAR calls",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><p>\r\n\tReferees are set to make in-stadium announcements about the outcome of video reviews in the Premier League from the start of next season and Liverpool manager Arne Slot isn't a fan.</p>\n<p>\r\n\tThe protocol is currently being trialed in this season's English League Cup semifinals, with a first announcement coming in the first leg of Tottenham's match with Liverpool when a goal for Spurs was ruled out for offside.</p>\n<p>\r\n\tTony Scholes, the Premier League's chief football officer, told reporters the protocol could now be used in league play, too.</p>\n<p>\r\n\tAsked for his reaction, Slot said for me, that's not necessary, but he did acknowledge it might benefit match-going fans in the stadium.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIf the fans like it and it's something nice for the fans, let's do this, said Slot, speaking Wednesday ahead of the second leg against Tottenham on Thursday, which Liverpool goes into trailing 1-0. But I wonder if we are all going to like this.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tOn that occasion in the first leg, referee Stuart Attwell used the public address system to announce via a wireless microphone that the goal scored by Tottenham striker Dominic Solanke in the 76th minute had been ruled out for offside. Attwell spoke after a VAR review lasting around two minutes.</p>\n<p>\r\n\tTottenham manager Ange Postecoglou wasn't impressed with the historic moment at the time, saying: If people think that announcement tonight added anything to the game, I'm sorry. I mean, really, just get on with it.</p><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tSlot was more concerned that the officials chose to make an announcement about what he described as an obvious decision rather than on a more contentious call, when Tottenham midfielder Lucas Bergvall avoided getting a second yellow card for a foul on Kostas Tsimikas.</p>\n<p>\r\n\tWhile Tsimikas was off the field, waiting to come back on having received treatment, Bergvall scored the only goal of the game.</p>\n<p>\r\n\tI think the one we were more interested in was why he didn't give the second yellow card and that is something he didn't have to explain, Slot said.</p>\n<p>\r\n\tSemi-automated offside technology might come into the Premier League even earlier before the end of this season.</p>\n<p>\r\n\tInitially, the technology was supposed to be brought in after one of the international breaks in the first half of this season but was delayed because of issues in the testing process. Scholes said progress had been made in recent weeks.</p>\n<p>\r\n\tWe believe it to be the most accurate and the most future-proof system as well, Scholes said. I have to confess, given the difficulties that we had over the first few months of the season, I had severe doubts about this, but the progress made over the last four to six weeks has been significant.</p>\n<p>\r\n\tScholes said introducing the technology with potentially only a handful of games to go would not create an integrity issue.</p>\n<p>\r\n\tLeague officials have said they hope it will reduce the time it takes to check for offside by an average of 31 seconds.</p><p></p></div>",
            "pub_date": "2025-02-05 23:10:30",
            "link": "https://www.business-standard.com/sports/football-news/premier-league-refs-set-to-make-in-stadium-announcements-for-var-calls-125020501176_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501176"
        },
        {
            "title": "Alexander-Arnold to miss 2nd leg vs Tottenham in EFL Cup SF due to injury",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><p>\r\n\tLiverpool right back Trent Alexander-Arnold will miss the second leg against Tottenham in the English League Cup semifinals on Thursday because of an injury sustained at the weekend.</p>\n<p>\r\n\tLiverpool trails Tottenham 1-0 from the first leg on Jan. 8. The return match is at Anfield, with Liverpool looking to retain its trophy.</p>\n<p>\r\n\tAlexander-Arnold came off in the 70th minute of the 2-0 win at Bournemouth in the Premier League on Saturday because of a suspected thigh injury.</p>\n<p>\r\n\tHe is going to miss the game tomorrow,\" Liverpool manager Arne Slot said Wednesday, and we have to see if he is able to play on Sunday.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tLiverpool plays Plymouth in the FA Cup on Sunday before a Merseyside derby at Everton in the Premier League next Wednesday.</p>\n<p>\r\n\tAsked for more details about Alexander-Arnold's injury, Slot said: I think you saw that he left the pitch with a bit of pain in his leg, so that's why he misses the game tomorrow.</p>\n<p>\r\n\tBut he is already on the pitch, not with the team but with the rehab coach, so let's see how long it is going to take.</p><p></p></div>",
            "pub_date": "2025-02-05 23:10:30",
            "link": "https://www.business-standard.com/sports/football-news/alexander-arnold-to-miss-2nd-leg-vs-tottenham-in-efl-cup-sf-due-to-injury-125020501170_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501170"
        },
        {
            "title": "Edtech company Great Learning launches AI Mentor and AI Teacher",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tGreat Learning, the professional learning and upskilling company, said it is leveraging artificial intelligence (AI) to chart the next phase of its growth with the launch of AI Mentor and AI Teacher. These AI innovations are set to improve the overall digital learning experience, making high-quality education personalised, accessible, affordable, and scalable for learners worldwide.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We were the first globally to introduce online mentored learning in 2017—combining the flexibility of self-learning with the power of expert human guidance to drive real outcomes at scale,” said Mohan Lakhamraju, founder and chief executive officer (CEO), Great Learning.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“However, great teachers are few, and most learners never get to experience the magic of learning from them. This is what we are trying to solve using AI. As AI advances further, we will continue to push boundaries, making high-quality education more accessible, affordable, and impactful for learners everywhere.”</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith the AI Mentor, every learner gets their own personal learning coach to support them through their learning journey at every step. It delivers an uninterrupted learning experience with 24/7 doubt resolution and step-by-step guidance while working on projects.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIf a learner gets stuck while coding, the AI Mentor provides real-time coding support, dropping intelligent hints to nudge them towards the correct solution without revealing the answer directly. It also makes them job-ready through AI-driven mock interviews, simulating real-world job interview scenarios.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSince its rollout across select cohorts of learners over the past few months, the company said the AI Mentor has made a significant impact. This includes:</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t- Over 400,000 coding hints generated </div>\n<div>\r\n\t- 130,000 learner queries resolved </div>\n<div>\r\n\t- Over 300 mock interviews conducted.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe AI Teacher customises lessons based on learners' context and evaluates their understanding. It identifies knowledge gaps and provides valuable feedback on their progress—just like a human teacher would.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis is in addition to the guidance and mentorship from industry experts and faculty that learners already have access to as part of Great Learning’s ‘Mentored Learning’ model.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company also announced that all its AI-powered learning enablements will come under the umbrella brand ‘Glaide’—a combination of ‘GL’ (Great Learning), ‘AI’, and ‘aide’.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOver the coming months and years, Great Learning will roll out its AI-powered learning experiences to newer and larger audiences.</div></div>",
            "pub_date": "2025-02-05 23:05:28",
            "link": "https://www.business-standard.com/companies/start-ups/edtech-company-great-learning-launches-ai-mentor-and-ai-teacher-125020501611_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501611"
        },
        {
            "title": "Newcastle United vs Arsenal Carabao Cup live match time and streaming",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div>\r\n\tArsenal will need to overturn a 2-0 deficit against Newcastle United on Wednesday night if they are to reach the Carabao Cup final.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOver the weekend, the Gunners secured an impressive 5-1 victory over Manchester City, keeping up with Liverpool in the Premier League title race. Mikel Arteta’s team has won four consecutive matches across all competitions and remains unbeaten in 90 minutes since their semi-final first leg defeat to Newcastle at the start of 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt home, Arsenal were highly wasteful, and Newcastle capitalized on their chances, with Alexander Isak and Anthony Gordon scoring to give Eddie Howe's side a commanding lead.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNewcastle, who were in excellent form before the first leg, have faltered since, suffering back-to-back defeats at St. James’ Park. While their advantage is considerable, Arsenal can still turn the tie around with an early goal, which would change the course of the match.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/sports/football-news/cristiano-ronaldo-s-former-coach-carlo-ancelloti-backs-cr7-as-the-goat-125020501405_1.html\">Cristiano Ronaldo's former coach Carlo Ancelloti backs CR7 as 'the GOAT'</a></strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Newcastle United team news</strong></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGoalkeeper Nick Pope is available for selection again for Newcastle, although Eddie Howe opted to keep Martin Dubravka in goal during the weekend's 2-1 loss to Fulham at St. James' Park. Pope may return to the starting lineup on Wednesday.</div><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBruno Guimaraes and Fabian Schar were both suspended for Newcastle's win at the Emirates but are now eligible to play in this match.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCallum Wilson is a doubt due to a hamstring injury, while Harvey Barnes will miss the game with a similar issue. Jamaal Lascelles remains sidelined with a long-term injury.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/sports/football-news/why-cristiano-ronaldo-can-never-be-overshadowed-by-old-rival-lionel-messi-125020501056_1.html\">Why Cristiano Ronaldo can never be overshadowed by old rival Lionel Messi?</a></strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Arsenal team news</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAfter their FA Cup elimination, Arsenal will have the weekend off and head to Dubai for a warm-weather training camp following Wednesday's cup clash. As a result, Arteta is unlikely to make many changes to the lineup at Newcastle.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEthan Nwaneri, who scored a standout goal in Arsenal's 5-1 win over Manchester City, might earn a spot in the starting XI, possibly replacing Gabriel Martinelli.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBen White is the closest of the injured players to returning, but he will miss out, along with Takehiro Tomiyasu, Bukayo Saka, and Gabriel Jesus, who are all still sidelined.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Key player battles to look out for</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Alexander Isak vs Gabriel:</strong> Swedish striker Isak can be a handful to play against and the striker would be looking forward to increase the lead to 3 or even 4-0 on the night. However, Gabriel's performance against Manchester City will give him confidence ahead of the all-important semi-final clash.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Odegaard vs Guimaraes: </strong>The midfield battle will be key tonight as the likes of Odegaard will be up against Brazilian midfielder Bruno Guimaraes at St. James Park. Will be interesting to see whether the home side are able to hold onto their 2-0 lead or perhaps extend it as well in order to book their Wembley berth.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/sports/football-news/winter-transfer-deadline-rashford-shifts-to-villa-nico-omar-joins-city-125020400500_1.html\">Winter transfer deadline: Rashford shifts to Villa; Nico, Omar joins City</a></strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Newcastle United vs Arsenal playing 11</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Newcastle United playing 11 (probable):</strong> Pope; Livramento, Schar, Botman, Hall; Guimaraes, Tonali, Joelinton; Murphy, Isak, Gordon.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Arsenal playing 11 (probable):</strong> Raya; Timber, Saliba, Gabriel, Lewis-Skelly; Partey, Rice, Odegaard; Nwaneri, Havertz, Trossard.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Newcastle United vs Arsenal Carabao cup live telecast and live streaming details</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>When will the Carabao Cup clash between Newcastle United and Arsenal be played?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Carabao Cup clash between Newcastle United and Arsenal will be played on February 5 at St. James Park.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What time will Newcastle United vs Arsenal begin in the Carabao Cup?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNewcastle United vs Arsenal will begin at 1:30 AM IST in the Carabao Cup.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Where will the live telecast of the Newcastle United vs Arsenal be available in India?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe live telecast of the Newcastle United vs Arsenal carabao Cup clash will be available on the Star Sports network.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Where will the live streaming of the Newcastle United vs Arsenal be available in India?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe live streaming of the Newcastle United vs Arsenal Carabao Cup clash will be available on the Disney+Hotstar app and website.</div></div>",
            "pub_date": "2025-02-05 23:05:28",
            "link": "https://www.business-standard.com/sports/football-news/newcastle-united-vs-arsenal-carabao-cup-live-match-time-and-streaming-125020501606_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501606"
        },
        {
            "title": "Edtech company Great Learning launches AI Mentor and AI Teacher",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tGreat Learning, the professional learning and upskilling company, said it is leveraging artificial intelligence (AI) to chart the next phase of its growth with the launch of AI Mentor and AI Teacher. These AI innovations are set to improve the overall digital learning experience, making high-quality education personalised, accessible, affordable, and scalable for learners worldwide.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We were the first globally to introduce online mentored learning in 2017—combining the flexibility of self-learning with the power of expert human guidance to drive real outcomes at scale,” said Mohan Lakhamraju, founder and chief executive officer (CEO), Great Learning.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“However, great teachers are few, and most learners never get to experience the magic of learning from them. This is what we are trying to solve using AI. As AI advances further, we will continue to push boundaries, making high-quality education more accessible, affordable, and impactful for learners everywhere.”</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith the AI Mentor, every learner gets their own personal learning coach to support them through their learning journey at every step. It delivers an uninterrupted learning experience with 24/7 doubt resolution and step-by-step guidance while working on projects.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIf a learner gets stuck while coding, the AI Mentor provides real-time coding support, dropping intelligent hints to nudge them towards the correct solution without revealing the answer directly. It also makes them job-ready through AI-driven mock interviews, simulating real-world job interview scenarios.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSince its rollout across select cohorts of learners over the past few months, the company said the AI Mentor has made a significant impact. This includes:</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t- Over 400,000 coding hints generated </div>\n<div>\r\n\t- 130,000 learner queries resolved </div>\n<div>\r\n\t- Over 300 mock interviews conducted.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe AI Teacher customises lessons based on learners' context and evaluates their understanding. It identifies knowledge gaps and provides valuable feedback on their progress—just like a human teacher would.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis is in addition to the guidance and mentorship from industry experts and faculty that learners already have access to as part of Great Learning’s ‘Mentored Learning’ model.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company also announced that all its AI-powered learning enablements will come under the umbrella brand ‘Glaide’—a combination of ‘GL’ (Great Learning), ‘AI’, and ‘aide’.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOver the coming months and years, Great Learning will roll out its AI-powered learning experiences to newer and larger audiences.</div></div>",
            "pub_date": "2025-02-05 23:00:37",
            "link": "https://www.business-standard.com/companies/start-ups/edtech-company-great-learning-launches-ai-mentor-and-ai-teacher-125020501611_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501611"
        },
        {
            "title": "Newcastle United vs Arsenal Carabao Cup live match time and streaming",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div>\r\n\tArsenal will need to overturn a 2-0 deficit against Newcastle United on Wednesday night if they are to reach the Carabao Cup final.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOver the weekend, the Gunners secured an impressive 5-1 victory over Manchester City, keeping up with Liverpool in the Premier League title race. Mikel Arteta’s team has won four consecutive matches across all competitions and remains unbeaten in 90 minutes since their semi-final first leg defeat to Newcastle at the start of 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt home, Arsenal were highly wasteful, and Newcastle capitalized on their chances, with Alexander Isak and Anthony Gordon scoring to give Eddie Howe's side a commanding lead.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNewcastle, who were in excellent form before the first leg, have faltered since, suffering back-to-back defeats at St. James’ Park. While their advantage is considerable, Arsenal can still turn the tie around with an early goal, which would change the course of the match.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/sports/football-news/cristiano-ronaldo-s-former-coach-carlo-ancelloti-backs-cr7-as-the-goat-125020501405_1.html\">Cristiano Ronaldo's former coach Carlo Ancelloti backs CR7 as 'the GOAT'</a></strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Newcastle United team news</strong></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGoalkeeper Nick Pope is available for selection again for Newcastle, although Eddie Howe opted to keep Martin Dubravka in goal during the weekend's 2-1 loss to Fulham at St. James' Park. Pope may return to the starting lineup on Wednesday.</div><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBruno Guimaraes and Fabian Schar were both suspended for Newcastle's win at the Emirates but are now eligible to play in this match.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCallum Wilson is a doubt due to a hamstring injury, while Harvey Barnes will miss the game with a similar issue. Jamaal Lascelles remains sidelined with a long-term injury.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/sports/football-news/why-cristiano-ronaldo-can-never-be-overshadowed-by-old-rival-lionel-messi-125020501056_1.html\">Why Cristiano Ronaldo can never be overshadowed by old rival Lionel Messi?</a></strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Arsenal team news</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAfter their FA Cup elimination, Arsenal will have the weekend off and head to Dubai for a warm-weather training camp following Wednesday's cup clash. As a result, Arteta is unlikely to make many changes to the lineup at Newcastle.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEthan Nwaneri, who scored a standout goal in Arsenal's 5-1 win over Manchester City, might earn a spot in the starting XI, possibly replacing Gabriel Martinelli.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBen White is the closest of the injured players to returning, but he will miss out, along with Takehiro Tomiyasu, Bukayo Saka, and Gabriel Jesus, who are all still sidelined.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Key player battles to look out for</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Alexander Isak vs Gabriel:</strong> Swedish striker Isak can be a handful to play against and the striker would be looking forward to increase the lead to 3 or even 4-0 on the night. However, Gabriel's performance against Manchester City will give him confidence ahead of the all-important semi-final clash.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Odegaard vs Guimaraes: </strong>The midfield battle will be key tonight as the likes of Odegaard will be up against Brazilian midfielder Bruno Guimaraes at St. James Park. Will be interesting to see whether the home side are able to hold onto their 2-0 lead or perhaps extend it as well in order to book their Wembley berth.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/sports/football-news/winter-transfer-deadline-rashford-shifts-to-villa-nico-omar-joins-city-125020400500_1.html\">Winter transfer deadline: Rashford shifts to Villa; Nico, Omar joins City</a></strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Newcastle United vs Arsenal playing 11</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Newcastle United playing 11 (probable):</strong> Pope; Livramento, Schar, Botman, Hall; Guimaraes, Tonali, Joelinton; Murphy, Isak, Gordon.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Arsenal playing 11 (probable):</strong> Raya; Timber, Saliba, Gabriel, Lewis-Skelly; Partey, Rice, Odegaard; Nwaneri, Havertz, Trossard.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Newcastle United vs Arsenal Carabao cup live telecast and live streaming details</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>When will the Carabao Cup clash between Newcastle United and Arsenal be played?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Carabao Cup clash between Newcastle United and Arsenal will be played on February 5 at St. James Park.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What time will Newcastle United vs Arsenal begin in the Carabao Cup?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNewcastle United vs Arsenal will begin at 1:30 AM IST in the Carabao Cup.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Where will the live telecast of the Newcastle United vs Arsenal be available in India?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe live telecast of the Newcastle United vs Arsenal carabao Cup clash will be available on the Star Sports network.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Where will the live streaming of the Newcastle United vs Arsenal be available in India?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe live streaming of the Newcastle United vs Arsenal Carabao Cup clash will be available on the Disney+Hotstar app and website.</div></div>",
            "pub_date": "2025-02-05 23:00:36",
            "link": "https://www.business-standard.com/sports/football-news/newcastle-united-vs-arsenal-carabao-cup-live-match-time-and-streaming-125020501606_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501606"
        },
        {
            "title": "MF industry leverage fund-of-fund route to create debt alternative",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tIn the quest for a tax-efficient debt fund alternative, the mutual fund (MF) industry is knocking on the doors of Fund of Funds (FoF).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCurrently, there are four FoFs that allocate a portion of their assets to arbitrage funds to improve tax efficiency.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/topic/kotak-mutual-funds\" target=\"_blank\">Kotak Mutual Fund</a> was the first to introduce this approach by adjusting the asset allocation framework of its Kotak All Weather Debt FoF in October 2024, renaming it the Kotak Income Plus Arbitrage Fund.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRecently, Bandhan MF, Axis MF, and Aditya Birla Sun Life (ABSL) MF have followed suit.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn response to the changes in</div></div>",
            "pub_date": "2025-02-05 22:55:24",
            "link": "https://www.business-standard.com/markets/mutual-fund/mf-industry-leverage-fund-of-fund-route-to-create-debt-alternative-125020501475_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501475"
        },
        {
            "title": "Goal is for Axis Max Life Insurance to become a listed entity: MD",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tFollowing its Q3 earnings, Axis Max Life Insurance said its board approved a roadmap that envisages the listing of Axis Max Life through the merger of Max Financial Services into Axis Max Life. <strong>Prashant Tripathy</strong>, MD&amp;CEO, Axis Max Life Insurance, in a conversation with <strong>Subrata Panda</strong> and <strong>Aathira Varier</strong>, spoke about the listing plan and discussed the company’s performance. Edited excerpts:</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What is the merger plan with Max Financial Services and the subsequent listing plan of Axis Max Life Insurance?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWe aim to merge the two entities – Max Financial Services and Axis Max Life Insurance – and we believe</div></div>",
            "pub_date": "2025-02-05 22:55:24",
            "link": "https://www.business-standard.com/finance/interviews/goal-is-for-axis-max-life-insurance-to-become-a-listed-entity-md-125020501496_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501496"
        },
        {
            "title": "MF industry leverage fund-of-fund route to create debt alternative",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tIn the quest for a tax-efficient debt fund alternative, the mutual fund (MF) industry is knocking on the doors of Fund of Funds (FoF).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCurrently, there are four FoFs that allocate a portion of their assets to arbitrage funds to improve tax efficiency.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/topic/kotak-mutual-funds\" target=\"_blank\">Kotak Mutual Fund</a> was the first to introduce this approach by adjusting the asset allocation framework of its Kotak All Weather Debt FoF in October 2024, renaming it the Kotak Income Plus Arbitrage Fund.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRecently, Bandhan MF, Axis MF, and Aditya Birla Sun Life (ABSL) MF have followed suit.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn response to the changes in</div></div>",
            "pub_date": "2025-02-05 22:50:27",
            "link": "https://www.business-standard.com/markets/mutual-fund/mf-industry-leverage-fund-of-fund-route-to-create-debt-alternative-125020501475_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501475"
        },
        {
            "title": "Goal is for Axis Max Life Insurance to become a listed entity: MD",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tFollowing its Q3 earnings, Axis Max Life Insurance said its board approved a roadmap that envisages the listing of Axis Max Life through the merger of Max Financial Services into Axis Max Life. <strong>Prashant Tripathy</strong>, MD&amp;CEO, Axis Max Life Insurance, in a conversation with <strong>Subrata Panda</strong> and <strong>Aathira Varier</strong>, spoke about the listing plan and discussed the company’s performance. Edited excerpts:</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What is the merger plan with Max Financial Services and the subsequent listing plan of Axis Max Life Insurance?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWe aim to merge the two entities – Max Financial Services and Axis Max Life Insurance – and we believe</div></div>",
            "pub_date": "2025-02-05 22:50:27",
            "link": "https://www.business-standard.com/finance/interviews/goal-is-for-axis-max-life-insurance-to-become-a-listed-entity-md-125020501496_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501496"
        }
    ]
}