{
    "data": [
        {
            "title": "CM Mamata meets representatives of FICCI, CII, biz tycoons ahead of BGBS",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tWest Bengal Chief Minister Mamata Banerjee attended a meeting with representatives from FICCI, CII, and industry leaders on Wednesday, ahead of the 8th edition of the two-day Bengal Global Business Summit (BGBS), which begins this afternoon.</p>\n<p>\r\n\tThe two-day summit, set to take place from February 5 in Kolkata, is a key event for promoting investment in the state.</p>\n<p>\r\n\tBanerjee shared on Facebook, \"Our much-awaited Bengal Global Business Summit is having its preludes in the Special Meeting of the National Executive Committees of the Apex Chambers of Commerce and Industry, CII and FICCI. I joined them briefly to encourage investments in West Bengal from our national industry magnates. Bengal the destination!!.\"<small class=\"brtagPara\"> </small>\r\n\tThe chief minister on Tuesday night in a social media post had also mentioned that over 5,000 delegates, including representatives from 40 countries, have already started arriving in Kolkata.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAdditionally, 20 ambassadors and high commissioners are attending to represent their respective countries, while prominent Indian business leaders are coming together, often accompanied by their chambers, CII, FICCI, and ICC, she said.</p>\n<p>\r\n\tAccording to the Bengal Global Business Summit website, West Bengal has been among the fastest-growing states in terms of economic development, with the state's Gross State Domestic Product (GSDP) expected to reach Rs 18.79 lakh crore in 2024-25.</p><p></p></div>",
            "pub_date": "2025-02-05 17:25:27",
            "link": "https://www.business-standard.com/india-news/cm-mamata-meets-representatives-of-ficci-cii-biz-tycoons-ahead-of-bgbs-125020500776_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500776"
        },
        {
            "title": "Delhi polls: AAP-BJP clash outside Seelampur polling booth over fake voting",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tDelhi Assembly elections 2025: A clash broke out between the Aam Aadmi Party (AAP) and Bharatiya Janata Party (BJP) workers outside a polling booth in Seelampur during the Delhi Assembly polls on Wednesday. The BJP had alleged fake voting, and the police had to intervene to maintain peace.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe BJP accused the AAP of enabling fake voting, alleging that women wearing burqas were seen casting fraudulent votes at several polling stations. BJP leaders claimed that these women voted multiple times, suggesting a deliberate effort to sway the election outcome. Party workers raised alarms about the fairness of the voting process, calling on the Election Commission to look into these allegations and take appropriate action. They provided reports detailing several instances where such activities were reportedly observed.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\tVIDEO | Delhi Assembly Elections 2025: Uproar outside a polling booth in Seelampur as BJP alleges fake voting. Police jostle to maintain peace. <a href=\"https://twitter.com/hashtag/DelhiElections2025?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#DelhiElections2025</a> <a href=\"https://twitter.com/hashtag/DelhiElectionsWithPTI?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#DelhiElectionsWithPTI</a> <a href=\"https://t.co/ldxATD8N4k\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/ldxATD8N4k</a></p>\r\n\t— Press Trust of India (@PTI_News) <a href=\"https://twitter.com/PTI_News/status/1887054220047867913?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 5, 2025</a></blockquote></div>\n<!-- --> <!-- --> <!-- -->\n<div>\n<small class=\"brtag\"> </small> In response, the AAP dismissed the accusations, asserting that they were politically driven and intended to discredit the electoral process.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe situation unfolded after a voter reported that her vote had already been cast. Sabina Sadiq, Block Level Officer of Seelampur, said, “A woman voter who had come to vote was told that her vote had already been cast. At that moment, the voting was temporarily halted...”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing the incident, the Delhi Police said, “A PCR call was made by one 26-year-old Mohini, resident of Usmanpur, alleging that her vote had already been cast by someone else. The enquiry revealed that confusion arose due to a voter having a similar name, Munni Devi, aged 60 years having the same address. The 60-year-old woman was an earlier tenant at the same address. After verification, the Presiding Officer allowed both women to cast their vote.”<small class=\"brtag\"> </small></div>\n<div>\r\n\tAdditionally, police force has been deployed outside the polling booth in Seelampur.</div>\n<small class=\"brtag\"> </small>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\tVIDEO | Delhi Assembly Election 2025: Heavy police deployment outside a polling booth in Seelampur after BJP alleged fake votes being cast.<a href=\"https://twitter.com/hashtag/DelhiElectionsWithPTI?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#DelhiElectionsWithPTI</a><small class=\"brtag\"> </small> (Full video available on PTI Videos - <a href=\"https://t.co/n147TvrpG7\" rel=\"nofollow\" target=\"_blank\">https://t.co/n147TvrpG7</a>) <a href=\"https://t.co/AivjfUoPwb\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/AivjfUoPwb</a></p>\r\n\t— Press Trust of India (@PTI_News) <a href=\"https://twitter.com/PTI_News/status/1887045217616015496?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 5, 2025</a></blockquote></div>\n<!-- --> <!-- --> <!-- -->\n<h3>\r\n\tDelhi elections 2025</h3>\n<div>\r\n\tMeanwhile, voting across all 70 Assembly constituencies started at 7 am and will close at 6.30 pm. The national capital witnessed a voter turnout of 33.31 per cent by 1 pm, with the North-East district continuing to lead the polls.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGovernment offices and schools will remain closed on polling day, while some private offices may also shut or allow employees flexible working hours to facilitate voting.  <small class=\"brtag\"> </small></div>\n<div>\r\n\tDelhi has around 15.6 million registered voters, who will be able to vote at 13,766 polling stations. This includes 8.37 million male voters, 7.23 million female voters, and 1,267 third-gender voters.  </div>\n<div>\r\n\tTo ensure accessibility, 733 polling stations have been specifically set up for persons with disabilities. Security arrangements include 220 paramilitary companies, 19,000 home guards, and 35,626 Delhi Police personnel to maintain order during polling.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<em>[With agency inputs]</em></div></div>",
            "pub_date": "2025-02-05 17:25:27",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-elections-2025-seelampur-voting-row-125020500850_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500850"
        },
        {
            "title": "'Indians justifiably outraged': Bryan Johnson shares study on air quality",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tUS-based entrepreneur, Bryan Johnson, known for his work in anti-aging research, has once again drawn attention to India’s poor air quality. In a detailed post on X, Johnson referred to a study outlining the severe health risks associated with air pollution, including liver inflammation, fibrosis, blood fat imbalance, and gene dysregulation linked to cancer.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Indians are justifiably outraged by the poor air quality they are exposed to daily. It creates serious negative health effects. There’s no such thing as a safe level of PM2.5,” said Johnson.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\t\tIndians are justifiably outraged by the poor air quality they are exposed to daily. It creates serious negative health effects.<small class=\"brtagPara\"> </small> Below is a study showing how air pollution causes liver inflammation, fibrosis, blood fat imbalance, and liver protein markers associated with… <a href=\"https://t.co/SODON2KOh8\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/SODON2KOh8</a></p>\r\n\t\t— Bryan Johnson /dd (@bryan_johnson) <a href=\"https://twitter.com/bryan_johnson/status/1886866090967621844?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 4, 2025</a></blockquote></div>\n<!-- --> <!-- --> </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn another post on X, he said, “Improve the air quality in your home, apartment, office and gym by upgrading the air filter in the HVAC system.”</div>\n<small class=\"brtag\"> </small>\n<div>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\t\tImprove the air quality in your home, apartment, office and gym by upgrading the air filter in the HVAC system.<small class=\"brtagPara\"> </small> The higher the MERV filter, the better. Not all HVAC systems can handle the higher MERV filter so get the best one you can.<small class=\"brtagPara\"> </small> Try to have MERV 13 at a minimum. <a href=\"https://t.co/vruOv8NlKO\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/vruOv8NlKO</a></p>\r\n\t\t— Bryan Johnson /dd (@bryan_johnson) <a href=\"https://twitter.com/bryan_johnson/status/1886879502007173387?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 4, 2025</a></blockquote></div>\n<!-- --> <!-- --> </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis comes days after he made headlines for walking out of a podcast with Zerodha CEO Nikhil Kamath, citing pollution as the reason.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>‘No safe level of exposure'</strong></div>\n<div>\r\n\tThe study shared by Johnson involved exposing mice to low levels of PM2.5 pollutants from traffic emissions over 12 weeks. The particulate matter was collected from the sides of busy roads and introduced into the mice’s noses via a saline solution. The results showed that prolonged exposure led to liver inflammation, fibrosis, blood fat imbalance, and the presence of liver protein markers typically associated with alcoholism. It also indicated gene dysregulation linked to cancer.  <small class=\"brtagPara\"> </small>\n<strong>ALSO READ: </strong><a href=\"https://www.business-standard.com/social-viral/bryan-johnson-nikhil-kamath-podcast-air-pollution-mumbai-anti-ageing-125020400730_1.html\" target=\"_blank\"><strong>Why anti-ageing millionaire Bryan Johnson left Nikhil Kamath's podcast midway</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJohnson said that PM2.5 is particularly harmful as it penetrates deep into the lungs and enters circulation. He reiterated that there is no safe level of exposure and urged authorities to prioritise tackling air pollution, especially in heavily-polluted cities.  </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe tech entrepreneur also shared practical ways to reduce exposure to poor air quality. His suggestions included monitoring PM2.5 levels, wearing an N95 mask, and using air recirculation mode in vehicles while travelling through polluted areas.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJohnson’s concerns about India’s air quality were previously highlighted during his visit in December last year when he abruptly left Nikhil Kamath’s ‘WTF’ podcast, despite the presence of air purifiers in the room and his use of an N95 mask. The interview was recorded in a luxury hotel in Mumbai’s Bandra area, where the AQI at the time was around 120.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile praising Kamath as a “gracious host”, Johnson said that the room was circulating outdoor air, rendering the purifier ineffective. He also criticised the extent to which air pollution has become normalised in India.  </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>‘Pollution is deeply normalised in India’</strong></div>\n<div>\r\n\t“This was my third day in India, and the air pollution had caused my skin to break out in a rash, with my eyes and throat burning. Pollution is so deeply normalised that no one even notices it anymore, despite the well-documented health risks. People were outside running, and babies and small children were exposed from birth. No one wore a mask, which could significantly reduce exposure. It was baffling,” he wrote on X.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, Nikhil’s brother and Zerodha co-founder Nithin Kamath, who was also on the podcast with Johnson, has ignited a debate by suggesting that real estate prices should be tied to air quality. “So, shouldn’t property prices be linked to AQI? The higher the AQI, the lower the real estate prices should be. That means if an area has poor air quality, property prices and rents should be lower, and vice versa. After all, by living in such areas, you are accepting higher odds of respiratory ailments, cancer, etc,” Kamath wrote on LinkedIn.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 17:20:31",
            "link": "https://www.business-standard.com/india-news/bryan-johnson-india-air-pollution-wtf-podcast-nikhil-kamath-nithin-kamath-125020500815_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500815"
        },
        {
            "title": "BlackRock to hire 1,200 employees in India to expand AI and support hubs",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe world’s largest asset manager <a href=\"https://www.business-standard.com/topic/blackrock\" target=\"_blank\">BlackRock Inc</a> is set to expand its presence in India by hiring nearly 1,200 people across its support hubs in Mumbai and Gurugram, <em>Moneycontrol </em>reported on Wednesday. The new hires will increase BlackRock’s headcount in these cities by about a third, adding to the existing 3,500 employees.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tExpanding AI and data capabilities</h2>\n<div>\r\n\tBlackRock’s hiring drive is aimed at strengthening its <a href=\"https://www.business-standard.com/about/what-is-artificial-intelligence\" target=\"_blank\">artificial intelligence (AI)</a> capabilities and expanding its iHubs - its innovation and support centres that handle investment research, risk management, financial engineering, business operations, and data analytics. The company is particularly looking for engineers and data experts to support these functions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe firm is also acquiring a global capabilities centre (GCC) in Bengaluru, which has around 1,500 employees, through its proposed purchase of data firm Preqin. This acquisition is expected to further bolster its technology and data-driven operations.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tBlackRock’s office expansion in Mumbai</h2>\n<div>\r\n\tTo accommodate its expanding workforce, BlackRock has leased additional office space in Mumbai’s Goregaon from Oberoi Realty Ltd. The deal, valued at nearly Rs 4 billion ($45.9 million), was first reported by <em>The Economic Times.</em></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tIndia’s growing role in global financial services</h2>\n<div>\r\n\tIndia has become a key hub for global financial firms, with multinational corporations expanding their operations beyond traditional back-office work to high-value services. The country's GCC market is projected to reach $110 billion by 2030, employing over 4.5 million people, according to Ernst &amp; Young. India already houses over 1,700 GCCs, accounting for 17 per cent of such centres globally, as highlighted in India's <a href=\"https://www.business-standard.com/budget\">Union Budget 2025</a>.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSeveral global banks and asset managers, including JPMorgan Chase, HSBC, Apollo Global Management, and Goldman Sachs, have significant GCC operations in India. Goldman Sachs, for instance, employs around 9,000 people across its Bengaluru and Hyderabad centres.</div></div>",
            "pub_date": "2025-02-05 17:20:30",
            "link": "https://www.business-standard.com/companies/news/blackrock-to-hire-1-200-employees-in-india-to-expand-ai-and-support-hubs-125020500836_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500836"
        },
        {
            "title": "More than 250 fall ill in Kolhapur village due to suspected food poisoning",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tMore than 250 persons fell ill due to suspected food poisoning after attending a village fair in western Maharashtra's Kolhapur district, police said on Wednesday.</p>\n<p>\r\n\tAbout 50 persons were undergoing treatment at hospital at Shirol at present and the condition of all of them was said to be stable, said an official of Kurundwad police station.</p>\n<p>\r\n\tA fair had been organised at Shivnakwadi village on Tuesday where 'kheer', a sweet preparation made from milk, was served as 'prasad', he said.</p>\n<p>\r\n\t\"People started complaining of diarrhoea, nausea and fever since today morning. So far, 255 people have fallen sick due to suspected food poisoning. Most of them are claiming that they had 'kheer' at the fair. But there were food stalls too,\" the police official said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tMore than 50 persons were undergoing treatment at the hospital and the rest were discharged, he said, adding that all the admitted patients were stable. \"Food samples from the fair have been sent to the forensic laboratory to ascertain if it was food poisoning,\" said the official.</p><p></p></div>",
            "pub_date": "2025-02-05 17:15:30",
            "link": "https://www.business-standard.com/india-news/more-than-250-fall-ill-in-kolhapur-village-due-to-suspected-food-poisoning-125020500762_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500762"
        },
        {
            "title": "NSE Clearing fails to meet liquidity norms; reports Rs 176.65 cr shortfall",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tNSE Clearing Ltd, the clearing house of the National Stock Exchange (NSE), has failed to meet the capital markets regulator Sebi's mandated liquidity requirements, citing the non-payment of dues by rival BSE as the primary reason for the shortfall.</p>\n<p>\r\n\tIn its December 2024 quarterly results, NSE Clearing, the exchange's unit responsible for clearing and settling its trades, reported a shortfall of Rs 176.65 crore in its minimum liquid assets.</p>\n<p>\r\n\tThe company informed Sebi in a letter dated January 9 that this deficit was primarily due to the non-receipt of Rs 312.37 crore in dues from BSE.</p>\n<p>\r\n\tAn NSE Clearing spokesperson said its auditors flagged the outstanding payment issue in their third-quarter financial review.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe outstanding amount pertains to \"interoperability arrangements\", the official said.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\t\"The company is yet to receive outstanding dues of over Rs 300 crore from BSE Ltd. NSE Clearing is communicating with BSE on this matter,\" the spokesperson added.</p>\n<p>\r\n\tThe Securities and Exchange Board of India (Sebi) has prescribed risk-based capital and net worth requirements for clearing corporations, which must maintain adequate liquid assets to ensure financial stability.</p>\n<p>\r\n\tThe regulator introduced a framework for interoperability among clearing corporations on June 1, 2019, to reduce trading costs.</p>\n<p>\r\n\tThis allows trading members to clear trades through a clearing firm of their choice rather than being restricted to the clearing corporation affiliated with the exchange where the trade was executed.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 17:15:29",
            "link": "https://www.business-standard.com/markets/news/nse-clearing-fails-to-meet-liquidity-norms-reports-rs-176-65-cr-shortfall-125020500754_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500754"
        },
        {
            "title": "Symphony share price falls 11%  as Q3 result disappoints investors",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tHousehold appliances maker <a href=\"https://www.business-standard.com/markets/symphony-ltd-share-price-3465.html\" target=\"_blank\">Symphony's shares</a> fell 10.65 per cent to the day's low of Rs 1,276.3 on the National Stock Exchange (NSE) during intra-day deals on Wednesday, February 5, 2025. The decline in the company's share price followed the announcement of its <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">financial results for the third quarter</a> of the financial year 2024-25 (Q3FY25).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn an exchange filing, the company said that during Q3FY25, it incurred a net loss of Rs 10 crore against a net profit of Rs 41 crore reported in the same quarter of the previous fiscal year on the consolidated basis. The company's revenue declined 2 per cent Year-on-Year (Y-o-Y) to Rs 242 crore from Rs 247 crore reported in Q3FY24.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSimilarly, the company's earnings before interest, taxes, depreciation, and amortization (Ebitda) fell to Rs 29 crore, down 34.1 per cent Y-o-Y from Rs 44 crore reported in Q3FY24.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAlong with the results, Symphony's board has also declared the third interim dividend of Rs 2 (100 per cent) per equity share with a face value of Rs 2 each for the financial year 2024-25. The said interim dividend, the company stated, shall be payable to shareholders on or before February 28, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSymphony operates in air cooling solutions, manufacturing residential, commercial, and industrial air coolers for customers in 60 countries. Founded in 1988 by Achal Anil Bakeri, the company has expanded its product portfolio over the years to include room heaters, ventilation fans, and domestic flour mills. Symphony is recognized as one of the world's largest manufacturers of residential, commercial, and industrial air coolers. As of February 5, 2025, the company's market capitalisation stands at Rs 8,933.81 crore on the BSE.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tShares of Symphony hit their all-time high of Rs 2,212.75 apiece on January 11, 2018, while their all-time low of Rs 0.13 was recorded on January 1, 1998.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSymphony shares have a 52-week range of Rs 1,880.95 - Rs 820 on the NSE.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt around 2:15 PM on Wednesday, Symphony shares were trading at Rs 1,305 per share, down 8.65 per cent from its previous close of Rs 1,428.50 per share. A combined total of nearly 0.95 million equity shares of Symphony, worth around Rs 126.32 crore, were traded on the NSE and BSE.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn comparison, the benchmark <a href=\"https://www.business-standard.com/markets/nse-nifty-indices-20559\" target=\"_blank\">NSE Nifty50</a> was trading flat at 23,743.05, up merely 6.20 points or 0.03 per cent.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 17:10:33",
            "link": "https://www.business-standard.com/markets/news/symphony-share-price-falls-11-as-q3-results-disappoints-investors-125020500819_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500819"
        },
        {
            "title": "Adani Wilmar bets on urban revival, quick grocery delivery to boost growth",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tAdani Wilmar expects its sales volumes to grow by around 10 per cent next fiscal year, CEO Angshu Mallick told Reuters on Wednesday, counting on demand from 10-minute grocery delivery apps and a tax cut-led revival in urban consumer spending.</p>\n<p>\r\n\tTop executives in sectors such as consumer goods and automobiles expect India's plans to cut personal income tax rates to put more disposable income in the hands of the people and eventually boost consumption.</p>\n<p>\r\n\t\"Whenever consumers have excess money, we have found they first go and buy good food,\" Mallick said, adding the company's food business is expected to grow by more than 20 per cent for the fiscal year that ends in March 2026.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tFor the third quarter, Adani Wilmar's sales volume grew by only 5 per cent, with its edible oil business posting a 4 per cent growth.</p>\n<p>\r\n\tThe edible oil business, which makes 'Fortune' cooking oil, will grow by at least 6 per cent next year, helping the broader group return to overall growth in the region of 10 per cent, Mallick said.</p>\n<p>\r\n\t </p><p></p></div>",
            "pub_date": "2025-02-05 17:10:32",
            "link": "https://www.business-standard.com/companies/news/adani-wilmar-bets-on-urban-revival-quick-grocery-delivery-to-boost-growth-125020500734_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500734"
        },
        {
            "title": "Muthoot Finance hits new high on strong earnings hope; up 31% from Nov low",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tShares of Muthoot Finance hit a new high at Rs 2,308.75, gaining 3 per cent on the BSE in Wednesday’s intra-day trade on expectations of strong earnings for the December 2024 quarter (Q3FY25). The stock price of the India’s largest gold financing company in terms of loan portfolio surpassed its previous high of Rs 2,274.15 touched on Budget day i.e. February 1, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSince November 14, 2024, the stock price of <a href=\"https://www.business-standard.com/markets/muthoot-finance-ltd-share-price-24769.html\" target=\"_blank\">Muthoot Finance</a> has outperformed the market and zoomed 31 per cent after the management revised upward its earlier guidance for FY25 on gold loan growth from 15 per cent to 25 per cent.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs part of the core business, Muthoot Finance provides loans secured against household gold jewellery at highly affordable rates and amazing product features. Globally, the Group has presence across, the US, UK, UAE, Costa Rica, Nepal and Sri Lanka.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMuthoot Finance is one of the best franchises for gold loans in the country, as is evident from its ability to deliver stronger gold loan growth and best-in-class profitability.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the first half (April to September) of the financial year 2025-25 (H1FY25), the company’s standalone loan assets under management  (AUM) reached a historic high of Rs 90,197 crore, driven by a robust 28 per cent year-on-year (YoY) growth in core gold loan portfolio. The standalone profit after tax grew by 18 per cent YoY at Rs 2,330 crore. This half year saw the highest-ever gold loan disbursements to new customers of Rs 10,687 crore to 9.66 lakh customers.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn Q2FY25, the company crossed the historic milestone of Rs 1 trillion in consolidated loan AUM. In Q2FY25, it recorded a net profit of Rs 1,321 crore, registering a 21 per cent YoY growth, and its total revenue from operations surged by 36.7 per cent to Rs 4,928.8 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tManagement acknowledged that the competitive aggression from banks in gold loans has reduced. Additionally, lower availability of unsecured credit in the form of personal loans/MFI loans have resulted in stronger demand for gold loans. Management also indicated that some of the Fintechs/ NBFCs have calibrated their lending into unsecured loans. This suggests that the strong gold loan demand could sustain in the near term, according to Motilal Oswal Financial Services.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith a favorable demand outlook for gold loans driven by reduced competition from banks and limited availability of unsecured credit, the company is well positioned to maintain its growth momentum. However, we would continue to watch out for any increase in competitive intensity and the impact of any decline in gold prices in H2FY25, the brokerage firm said in Q2 result update.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGold AUM growth remains strong backed by high gold prices and moderating competitive intensity. Further, growth guidance has been revised upwards to 25 per cent vs 15 per cent while need to watch out for higher credit cost as stage III assets have increased in last few quarters, said analyst at IDBI Capital in result update.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 17:05:27",
            "link": "https://www.business-standard.com/markets/news/muthoot-finance-hits-new-high-on-strong-earnings-hope-up-31-from-nov-low-125020500801_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500801"
        },
        {
            "title": "Why should Mumbaikars fund Dharavi land grab, questions Aaditya Thackery",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tAaditya Uddhav Thackeray, MLA Worli and President of Yuva Sena raised allegations on social media about Mumbai residents being forced to fund the Adani Group's land acquisition in Dharavi.</p>\n<p>\r\n\tIn a post on social media website 'X', Thackeray wrote, \"Why should Mumbaikars fund Adani Group's Dharavi land grab? Last week BJP run state government told @mybmc to spend (Mumbai's tax money) on cleaning Deonar dumping ground. It will cost BMC approximately Rs3000 crores.\"</p>\n<p>\r\n\tHe further pointed out that the Deonar land was already grabbed by the Adani Group, despite objections from the Brihanmumbai Municipal Corporation (BMC). \"The Deonar land already has been grabbed by the Adani Group, against the wishes of the BMC,\" Thackeray said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThackeray also highlighted a new proposal in the BMC budget that would force Mumbai residents to pay a fee for garbage collection, indirectly funding the Deonar cleanup. He questioned the rationale behind this, asking, \"Why should Mumbaikars fund this land grab forcefully? Will Mumbaikars get free homes in Dharavi as against this contribution?\"</p>\n<p>\r\n\tEarlier, Leader of Opposition in Lok Sabha and Congress MP Rahul Gandhi had alleged in Novermber 2024 that the people in Maharashtra were \"deprived\" of their government and claimed that the current government \"handed over\" Dharavi to Adani.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tNotably, Maharashtra Chief Minister Eknath Shinde had later accused Lok Sabha Leader of Opposition Rahul Gandhi of spreading false information on the Dharavi redevelopment project and said that around \"two lakh people will be getting homes in Dharavi.\"</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAaditya Thackeray has time and again been vocal about Dharavi. In August 2024, he had demanded assurance from the Maharashtra government that the new buildings constructed in Dharavi as part of Dharavi Redevelopment Project will be allocated to its residents.</p>\n<p>\r\n\tWhile addressing the 'Dharavi Bachao Andolan', the Shiv Sena (UBT) leader had said that the government won't be \"able to remove our Dharavikars\" from Dharavi.</p>\n<p>\r\n\t.</p><p></p></div>",
            "pub_date": "2025-02-05 17:05:26",
            "link": "https://www.business-standard.com/politics/why-should-mumbaikars-fund-dharavi-land-grab-questions-aaditya-thackery-125020500596_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500596"
        }
    ]
}