{
    "data": [
        {
            "title": "Stocks to Watch, Feb 5: Swiggy, Tata Power, NLC India, Global Health, RVNL",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Stocks to watch on Wednesday, February 5, 2025:</strong> <a href=\"https://www.business-standard.com/markets/news/stock-market-live-updates-feb-5-nse-bse-nifty-today-pmi-trump-china-fii-ipo-swiggy-q3-delhi-polls-125020500077_1.html\" target=\"_blank\">Indian bourses are poised for a positive start</a>, indicated GIFT Nifty futures. The GIFT Nifty futures quoted at 23,840 level, 55 points higher than Nifty50 futures. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Tuesday, the key benchmarks settled in the positive zone with the <a href=\"https://www.business-standard.com/markets/news/why-sensex-surged-1-250-pts-today-despite-a-trade-war-brewing-in-the-us-125020400742_1.html\" target=\"_blank\">BSE Sensex</a> closing at 78,583.81, up 1,397 or 1.81 per cent while the Nifty50 settled at 23,739.25, rising 378 points or 1.62 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em>Meanwhile, for Wednesday, below are some buzzing stocks to keep tabs on:</em></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Stocks to Watch:</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Earnings today: </strong>Reliance Power, Zydus Lifesciences, Abbott India, Cummins India, Gujarat Gas, Welspun Corp, Info Edge (India), Swiggy, Matrimony.com, H.G. Infra Engineering, Aarti Pharmalabs, Eveready Industries India, Piccadily Agro Industries, Exicom Tele-Systems, Sagility India, Inventurus Knowledge Solutions, Zinka Logistics Solutions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtagPara\"> </small></div>\n<div>\n<strong>Tata Power: </strong><a href=\"https://www.business-standard.com/companies/results/tata-power-q3-results-net-profit-rises-8-2-to-rs-1-031-cr-revenue-up-5-125020400954_1.html\" target=\"_blank\">Q3 consolidated net profit surged</a> to Rs 1,030 crore, up from Rs 953 crore Y-o-Y. Revenue climbed to Rs 15,400 crore, compared to Rs 14,651 crore. Ebitda jumped to Rs 3,352 crore, rising from Rs 2,417 crore, while Ebitda margin improved significantly to 21.78 per cent from 16.50 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Lemon Tree Hotels: </strong>Q3 consolidated net profit surged to Rs 62.5 crore, a sharp rise from Rs 35.4 crore year-on-year (Y-o-Y) and Rs 29.6 crore sequentially. Revenue climbed to Rs 360 crore, up from Rs 289 crore Y-o-Y. Ebitda jumped to Rs 184 crore from Rs 142 crore, while Ebitda margin expanded to 51.86 per cent from 48.80 per cent.  </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Metropolis Healthcare:</strong> Q3 consolidated net profit improved to Rs 31.4 crore, compared to Rs 27.15 crore in the previous year. Revenue climbed to Rs 323 crore, up from Rs 290 crore. Ebitda stood at Rs 72 crore, higher than Rs 64.8 crore, while Ebitda margin remained stable at 22.31 per cent, marginally up from 22.28 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Happiest Minds Technologies: </strong>Q3 consolidated net profit stood at Rs 50.1 crore, compared to Rs 49.5 crore in the previous quarter. Revenue increased to Rs 530 crore from Rs 521 crore. EBIT came in at Rs 72.9 crore, rising from Rs 68.7 crore, with EBIT margin improving to 13.74 per cent from 13.17 per cent.  </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sun Pharma: </strong>Philogen has completed patient enrollment for the Phase III Fibrosarc trial in soft tissue sarcoma.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Whirlpool of India:</strong> Q3 consolidated net profit jumped to Rs 44 crore, compared to Rs 28 crore Y-o-Y. Revenue expanded to Rs 1,700 crore, rising from Rs 1,526 crore. Ebitda grew to Rs 69.3 crore, against Rs 62.7 crore, while Ebitda margin stood at 4.06 per cent, slightly lower than 4.08 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>India Glycols:</strong> Q3 consolidated net profit climbed to Rs 56.8 crore, up from Rs 41.63 crore in the corresponding period last year. Revenue rose to Rs 2,424 crore, compared to Rs 2,119 crore. Ebitda increased to Rs 129 crore, up from Rs 107 crore, with Ebitda margin improving slightly to 5.32 per cent from 5.05 per cent.  </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Global Health:</strong> Q3 consolidated net profit stood at Rs 143 crore, compared to Rs 123 crore in the prior year. Revenue increased to Rs 943 crore, rising from Rs 836 crore. Ebitda at Rs 238 crore, up from Rs 216 crore, while Ebitda margin was 25.21 per cent, slightly lower than 25.82 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Aditya Birla Capital: </strong>Tax demand revised to Rs 184 crore following a rectification order.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Niva Bupa Health Insurance:</strong> Q3 net profit soared to Rs 13.2 crore, significantly higher than Rs 4.6 crore a year earlier. Net premium written increased to Rs 1,150 crore, compared to Rs 1,120 crore. Gross Non-Performing Assets (GNPA) improved to 0.86 per cent, down from 1.05 per cent in the previous quarter.  </div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Indian Energy Exchange (IEX):</strong> January traded volume stood at 10,910 MU, marking a 16 per cent increase Y-o-Y. The average DAM price was Rs 4.43/unit, reflecting a 24 per cent decline from the previous year.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Alkem Laboratories: </strong>Introduced Kojiglo Serum in India to address facial hyperpigmentation.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>NLC India: </strong>Secured its third commercial coal mine – New Patrapara South in Angul. The mine has a total geological reserve of 720.87 million tonnes.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JG Chemicals:</strong> Q3 consolidated net profit at Rs 16.97 crore, up from Rs 10.2 crore. Revenue surged to Rs 209 crore, compared to Rs 160 crore. Ebitda improved to Rs 23.1 crore, against Rs 14.8 crore, while Ebitda margin expanded to 11.05 per cent, compared to 9.16 per cent.  </div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Interarch Building Products: </strong>Q3 standalone net profit amounted to Rs 28.2 crore, increasing from Rs 22 crore Y-o-Y. Revenue rose to Rs 364 crore, against Rs 316 crore in the previous year. Ebitda reached Rs 35.1 crore, up from Rs 27.5 crore, with Ebitda margin at 9.66 per cent, improving from 8.70 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Azad Engineering: </strong>Q3 standalone net profit reached Rs 24.3 crore, advancing from Rs 16.8 crore a year ago. Revenue surged to Rs 119 crore, compared to Rs 89.2 crore. Ebitda expanded to Rs 42.6 crore, rising from Rs 32.8 crore, while Ebitda margin stood at 35.92 per cent, slightly lower than 36.77 per cent.  </div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Prism Johnson: </strong>Approved the sale of a portion of its industrial premises at a tile plant to JSW Steel, valued at Rs 165 crore.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>RVNL: </strong>Received a Letter of Acceptance for a Rs 404 crore project.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>TTK Healthcare: </strong>Issued a 90-day stop-work order by USAID, with financial implications yet to be assessed. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 10:55:25",
            "link": "https://www.business-standard.com/markets/news/stocks-to-watch-feb-5-swiggy-tata-power-nlc-india-global-health-rvnl-125020500083_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500083"
        },
        {
            "title": "US will 'take over' the Gaza strip, own it and develop it, says Trump",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>US President Donald Trump said on Tuesday that the US would “take over” and “own” the Gaza strip, pledging to rebuild and develop it. Speaking at a joint press conference with Israeli Prime Minister Benjamin Netanyahu, Trump stated \"The US will take over the Gaza Strip, and we will do a job with it too.\" \"We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site.\"<small class=\"brtagPara\"> </small>\n<h2>\n<strong>Economic development and long-term control</strong></h2>\n<h2>\n<small class=\"brtagPara\"> </small></h2>\r\nTrump further said \"We're going to take over that piece, we're going to develop it, create thousands and thousands of jobs, and it'll be something that the entire Middle East can be very proud of.\" Trump said he envisioned the US taking a “long-term ownership position” over the Gaza strip, but did not clarify under what authority the US could assume control. When asked about the legality of such a move, he did not respond directly.<small class=\"brtagPara\"> </small>\n<h2>\n<strong>Criticism of Biden and regional strategy</strong></h2>\n<small class=\"brtagPara\"> </small> Trump criticised former President Joe Biden, claiming his administration had shown incompetence in the Middle East. He said “nobody did anything for four years” in the Middle East except demonstrate incompetence.\"<small class=\"brtagPara\"> </small> Earlier Trump reiterated his call for Arab nations, including Jordan and Egypt, to take in Gazans saying Palestinians there had no alternative but to abandon the Gaza strip. This time, he advocated for the permanent resettlement of Palestinians. Trump said that he might be reconsidering an independent Palestine as part of a two-state solution to the decades-long Israel-Palestinian conflict.\r\n<h2>\n<small class=\"brtagPara\"> </small></h2>\n<h2>\n<strong>Talks with Netanyahu on security and diplomacy</strong></h2>\n<small class=\"brtagPara\"> </small> Netanyahu’s visit to Washington comes two weeks into Trump’s second term. The leaders discussed eliminating Hamas, restoring peace “to a troubled region\", and maintaining the Gaza ceasefire.<small class=\"brtagPara\"> </small> Netanyahu, when asked about the US taking over Gaza, said, “I think it’s something that could change history.” “And I think it’s really worth pursuing this avenue.\"<small class=\"brtagPara\"> </small> <em>(With agency inputs)</em><br/></div>",
            "pub_date": "2025-02-05 10:55:25",
            "link": "https://www.business-standard.com/world-news/us-will-take-over-the-gaza-strip-own-it-and-develop-it-says-trump-125020500088_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500088"
        },
        {
            "title": "Australia bans China's DeepSeek from government tech over security",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Ben Westcott</strong></div>\n<small class=\"brtagPara\"> </small>\n<div>\r\n\tAustralia has banned DeepSeek AI services from all government systems and devices, becoming one of the first countries to take direct action against a Chinese artificial intelligence startup that shook Silicon Valley and global markets this year.<small class=\"brtag\"> </small></div>\n<div>\r\n\tHome Affairs Minister Tony Burke said in a statement Tuesday that all DeepSeek products, applications and services would be removed from government systems on national security grounds effective immediately. A threat assessment by the country’s intelligence agencies found the technology posed an unacceptable risk, he said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFounded in Hangzhou only 20 months ago, DeepSeek’s technology made waves in January with a new mobile app featuring its reasoning AI chatbot — which articulates its approximation of thought process and research before delivering a response — that seemed to suggest top-tier AI could be developed without huge investments in hardware. Its appeal took it to the top of worldwide download charts. However, doubts quickly arose about the security of the service.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“AI is a technology full of potential and opportunity but the government will not hesitate to act when our agencies identify a national security risk,” Burke said in the statement. Forestalling any criticisms about Australia acting against the app simply because of its Chinese origin, he added that the government’s approach was “country-agnostic and focused on the risk to the Australian government and our assets.”</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe action does not extend to the personal devices of private citizens. However, Australians could “read something into the fact that the government has decided that it’s not secure to have on government phones,” Minister for Employment and Workplace Relations Murray Watt told Channel 7 on Wednesday.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“People might want to have a think about that when it comes to their personal phones,” he said. “We’d certainly be encouraging people to really get across the online privacy guidelines and rules that DeepSeek has and make a really good decision about whether they want to take that risk themselves.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAustralia is not the first country to take action against DeepSeek. Italy’s privacy regulator has ordered for it to be blocked to protect consumers’ data, while Ireland’s Data Protection Commission has asked for more information from the company. Hundreds of private companies have also taken the precautionary measure of blocking access to DeepSeek, Bloomberg News reported last week.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Australian government was a leader in deciding to ban Chinese networking giant Huawei Technologies Co. from its 5G systems in 2018, which sparked a diplomatic feud between Canberra and Beijing. The spat eventually culminated in China imposing trade sanctions on Australian exports at the height of the Covid-19 pandemic. Relations between the two countries have improved since the election of the center-left Anthony Albanese government in May 2022.</div></div>",
            "pub_date": "2025-02-05 10:50:28",
            "link": "https://www.business-standard.com/world-news/australia-bans-china-s-deepseek-from-government-tech-over-security-125020500094_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500094"
        },
        {
            "title": "Stocks to Watch, Feb 5: Swiggy, Tata Power, NLC India, Global Health, RVNL",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Stocks to watch on Wednesday, February 5, 2025:</strong> <a href=\"https://www.business-standard.com/markets/news/stock-market-live-updates-feb-5-nse-bse-nifty-today-pmi-trump-china-fii-ipo-swiggy-q3-delhi-polls-125020500077_1.html\" target=\"_blank\">Indian bourses are poised for a positive start</a>, indicated GIFT Nifty futures. The GIFT Nifty futures quoted at 23,840 level, 55 points higher than Nifty50 futures. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Tuesday, the key benchmarks settled in the positive zone with the <a href=\"https://www.business-standard.com/markets/news/why-sensex-surged-1-250-pts-today-despite-a-trade-war-brewing-in-the-us-125020400742_1.html\" target=\"_blank\">BSE Sensex</a> closing at 78,583.81, up 1,397 or 1.81 per cent while the Nifty50 settled at 23,739.25, rising 378 points or 1.62 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em>Meanwhile, for Wednesday, below are some buzzing stocks to keep tabs on:</em></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Stocks to Watch:</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Earnings today: </strong>Reliance Power, Zydus Lifesciences, Abbott India, Cummins India, Gujarat Gas, Welspun Corp, Info Edge (India), Swiggy, Matrimony.com, H.G. Infra Engineering, Aarti Pharmalabs, Eveready Industries India, Piccadily Agro Industries, Exicom Tele-Systems, Sagility India, Inventurus Knowledge Solutions, Zinka Logistics Solutions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtagPara\"> </small></div>\n<div>\n<strong>Tata Power: </strong><a href=\"https://www.business-standard.com/companies/results/tata-power-q3-results-net-profit-rises-8-2-to-rs-1-031-cr-revenue-up-5-125020400954_1.html\" target=\"_blank\">Q3 consolidated net profit surged</a> to Rs 1,030 crore, up from Rs 953 crore Y-o-Y. Revenue climbed to Rs 15,400 crore, compared to Rs 14,651 crore. Ebitda jumped to Rs 3,352 crore, rising from Rs 2,417 crore, while Ebitda margin improved significantly to 21.78 per cent from 16.50 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Lemon Tree Hotels: </strong>Q3 consolidated net profit surged to Rs 62.5 crore, a sharp rise from Rs 35.4 crore year-on-year (Y-o-Y) and Rs 29.6 crore sequentially. Revenue climbed to Rs 360 crore, up from Rs 289 crore Y-o-Y. Ebitda jumped to Rs 184 crore from Rs 142 crore, while Ebitda margin expanded to 51.86 per cent from 48.80 per cent.  </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Metropolis Healthcare:</strong> Q3 consolidated net profit improved to Rs 31.4 crore, compared to Rs 27.15 crore in the previous year. Revenue climbed to Rs 323 crore, up from Rs 290 crore. Ebitda stood at Rs 72 crore, higher than Rs 64.8 crore, while Ebitda margin remained stable at 22.31 per cent, marginally up from 22.28 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Happiest Minds Technologies: </strong>Q3 consolidated net profit stood at Rs 50.1 crore, compared to Rs 49.5 crore in the previous quarter. Revenue increased to Rs 530 crore from Rs 521 crore. EBIT came in at Rs 72.9 crore, rising from Rs 68.7 crore, with EBIT margin improving to 13.74 per cent from 13.17 per cent.  </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sun Pharma: </strong>Philogen has completed patient enrollment for the Phase III Fibrosarc trial in soft tissue sarcoma.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Whirlpool of India:</strong> Q3 consolidated net profit jumped to Rs 44 crore, compared to Rs 28 crore Y-o-Y. Revenue expanded to Rs 1,700 crore, rising from Rs 1,526 crore. Ebitda grew to Rs 69.3 crore, against Rs 62.7 crore, while Ebitda margin stood at 4.06 per cent, slightly lower than 4.08 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>India Glycols:</strong> Q3 consolidated net profit climbed to Rs 56.8 crore, up from Rs 41.63 crore in the corresponding period last year. Revenue rose to Rs 2,424 crore, compared to Rs 2,119 crore. Ebitda increased to Rs 129 crore, up from Rs 107 crore, with Ebitda margin improving slightly to 5.32 per cent from 5.05 per cent.  </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Global Health:</strong> Q3 consolidated net profit stood at Rs 143 crore, compared to Rs 123 crore in the prior year. Revenue increased to Rs 943 crore, rising from Rs 836 crore. Ebitda at Rs 238 crore, up from Rs 216 crore, while Ebitda margin was 25.21 per cent, slightly lower than 25.82 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Aditya Birla Capital: </strong>Tax demand revised to Rs 184 crore following a rectification order.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Niva Bupa Health Insurance:</strong> Q3 net profit soared to Rs 13.2 crore, significantly higher than Rs 4.6 crore a year earlier. Net premium written increased to Rs 1,150 crore, compared to Rs 1,120 crore. Gross Non-Performing Assets (GNPA) improved to 0.86 per cent, down from 1.05 per cent in the previous quarter.  </div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Indian Energy Exchange (IEX):</strong> January traded volume stood at 10,910 MU, marking a 16 per cent increase Y-o-Y. The average DAM price was Rs 4.43/unit, reflecting a 24 per cent decline from the previous year.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Alkem Laboratories: </strong>Introduced Kojiglo Serum in India to address facial hyperpigmentation.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>NLC India: </strong>Secured its third commercial coal mine – New Patrapara South in Angul. The mine has a total geological reserve of 720.87 million tonnes.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JG Chemicals:</strong> Q3 consolidated net profit at Rs 16.97 crore, up from Rs 10.2 crore. Revenue surged to Rs 209 crore, compared to Rs 160 crore. Ebitda improved to Rs 23.1 crore, against Rs 14.8 crore, while Ebitda margin expanded to 11.05 per cent, compared to 9.16 per cent.  </div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Interarch Building Products: </strong>Q3 standalone net profit amounted to Rs 28.2 crore, increasing from Rs 22 crore Y-o-Y. Revenue rose to Rs 364 crore, against Rs 316 crore in the previous year. Ebitda reached Rs 35.1 crore, up from Rs 27.5 crore, with Ebitda margin at 9.66 per cent, improving from 8.70 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Azad Engineering: </strong>Q3 standalone net profit reached Rs 24.3 crore, advancing from Rs 16.8 crore a year ago. Revenue surged to Rs 119 crore, compared to Rs 89.2 crore. Ebitda expanded to Rs 42.6 crore, rising from Rs 32.8 crore, while Ebitda margin stood at 35.92 per cent, slightly lower than 36.77 per cent.  </div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Prism Johnson: </strong>Approved the sale of a portion of its industrial premises at a tile plant to JSW Steel, valued at Rs 165 crore.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>RVNL: </strong>Received a Letter of Acceptance for a Rs 404 crore project.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>TTK Healthcare: </strong>Issued a 90-day stop-work order by USAID, with financial implications yet to be assessed. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 10:50:27",
            "link": "https://www.business-standard.com/markets/news/stocks-to-watch-feb-5-swiggy-tata-power-nlc-india-global-health-rvnl-125020500083_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500083"
        },
        {
            "title": "Stocks to Watch, Feb 5: Swiggy, Tata Power, NLC India, Global Health, RVNL",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Stocks to watch on Wednesday, February 5, 2025:</strong> <a href=\"https://www.business-standard.com/markets/news/stock-market-live-updates-feb-5-nse-bse-nifty-today-pmi-trump-china-fii-ipo-swiggy-q3-delhi-polls-125020500077_1.html\" target=\"_blank\">Indian bourses are poised for a positive start</a>, indicated GIFT Nifty futures. The GIFT Nifty futures quoted at 23,840 level, 55 points higher than Nifty50 futures. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Tuesday, the key benchmarks settled in the positive zone with the <a href=\"https://www.business-standard.com/markets/news/why-sensex-surged-1-250-pts-today-despite-a-trade-war-brewing-in-the-us-125020400742_1.html\" target=\"_blank\">BSE Sensex</a> closing at 78,583.81, up 1,397 or 1.81 per cent while the Nifty50 settled at 23,739.25, rising 378 points or 1.62 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em>Meanwhile, for Wednesday, below are some buzzing stocks to keep tabs on:</em></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Stocks to Watch:</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Earnings today: </strong>Reliance Power, Zydus Lifesciences, Abbott India, Cummins India, Gujarat Gas, Welspun Corp, Info Edge (India), Swiggy, Matrimony.com, H.G. Infra Engineering, Aarti Pharmalabs, Eveready Industries India, Piccadily Agro Industries, Exicom Tele-Systems, Sagility India, Inventurus Knowledge Solutions, Zinka Logistics Solutions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtag\"> </small> <strong>Listing today:</strong> Dr Agarwal's Health Care Limited IPO will list on the BSE, NSE today.<small class=\"brtag\"> </small></div>\n<div>\n<strong>Tata Power: </strong><a href=\"https://www.business-standard.com/companies/results/tata-power-q3-results-net-profit-rises-8-2-to-rs-1-031-cr-revenue-up-5-125020400954_1.html\" target=\"_blank\">Q3 consolidated net profit surged</a> to Rs 1,030 crore, up from Rs 953 crore Y-o-Y. Revenue climbed to Rs 15,400 crore, compared to Rs 14,651 crore. Ebitda jumped to Rs 3,352 crore, rising from Rs 2,417 crore, while Ebitda margin improved significantly to 21.78 per cent from 16.50 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Lemon Tree Hotels: </strong>Q3 consolidated net profit surged to Rs 62.5 crore, a sharp rise from Rs 35.4 crore year-on-year (Y-o-Y) and Rs 29.6 crore sequentially. Revenue climbed to Rs 360 crore, up from Rs 289 crore Y-o-Y. Ebitda jumped to Rs 184 crore from Rs 142 crore, while Ebitda margin expanded to 51.86 per cent from 48.80 per cent.  </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Metropolis Healthcare:</strong> Q3 consolidated net profit improved to Rs 31.4 crore, compared to Rs 27.15 crore in the previous year. Revenue climbed to Rs 323 crore, up from Rs 290 crore. Ebitda stood at Rs 72 crore, higher than Rs 64.8 crore, while Ebitda margin remained stable at 22.31 per cent, marginally up from 22.28 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Happiest Minds Technologies: </strong>Q3 consolidated net profit stood at Rs 50.1 crore, compared to Rs 49.5 crore in the previous quarter. Revenue increased to Rs 530 crore from Rs 521 crore. EBIT came in at Rs 72.9 crore, rising from Rs 68.7 crore, with EBIT margin improving to 13.74 per cent from 13.17 per cent.  </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sun Pharma: </strong>Philogen has completed patient enrollment for the Phase III Fibrosarc trial in soft tissue sarcoma.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Whirlpool of India:</strong> Q3 consolidated net profit jumped to Rs 44 crore, compared to Rs 28 crore Y-o-Y. Revenue expanded to Rs 1,700 crore, rising from Rs 1,526 crore. Ebitda grew to Rs 69.3 crore, against Rs 62.7 crore, while Ebitda margin stood at 4.06 per cent, slightly lower than 4.08 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>India Glycols:</strong> Q3 consolidated net profit climbed to Rs 56.8 crore, up from Rs 41.63 crore in the corresponding period last year. Revenue rose to Rs 2,424 crore, compared to Rs 2,119 crore. Ebitda increased to Rs 129 crore, up from Rs 107 crore, with Ebitda margin improving slightly to 5.32 per cent from 5.05 per cent.  </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Global Health:</strong> Q3 consolidated net profit stood at Rs 143 crore, compared to Rs 123 crore in the prior year. Revenue increased to Rs 943 crore, rising from Rs 836 crore. Ebitda at Rs 238 crore, up from Rs 216 crore, while Ebitda margin was 25.21 per cent, slightly lower than 25.82 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Aditya Birla Capital: </strong>Tax demand revised to Rs 184 crore following a rectification order.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Niva Bupa Health Insurance:</strong> Q3 net profit soared to Rs 13.2 crore, significantly higher than Rs 4.6 crore a year earlier. Net premium written increased to Rs 1,150 crore, compared to Rs 1,120 crore. Gross Non-Performing Assets (GNPA) improved to 0.86 per cent, down from 1.05 per cent in the previous quarter.  </div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Indian Energy Exchange (IEX):</strong> January traded volume stood at 10,910 MU, marking a 16 per cent increase Y-o-Y. The average DAM price was Rs 4.43/unit, reflecting a 24 per cent decline from the previous year.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Alkem Laboratories: </strong>Introduced Kojiglo Serum in India to address facial hyperpigmentation.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>NLC India: </strong>Secured its third commercial coal mine – New Patrapara South in Angul. The mine has a total geological reserve of 720.87 million tonnes.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JG Chemicals:</strong> Q3 consolidated net profit at Rs 16.97 crore, up from Rs 10.2 crore. Revenue surged to Rs 209 crore, compared to Rs 160 crore. Ebitda improved to Rs 23.1 crore, against Rs 14.8 crore, while Ebitda margin expanded to 11.05 per cent, compared to 9.16 per cent.  </div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Interarch Building Products: </strong>Q3 standalone net profit amounted to Rs 28.2 crore, increasing from Rs 22 crore Y-o-Y. Revenue rose to Rs 364 crore, against Rs 316 crore in the previous year. Ebitda reached Rs 35.1 crore, up from Rs 27.5 crore, with Ebitda margin at 9.66 per cent, improving from 8.70 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Azad Engineering: </strong>Q3 standalone net profit reached Rs 24.3 crore, advancing from Rs 16.8 crore a year ago. Revenue surged to Rs 119 crore, compared to Rs 89.2 crore. Ebitda expanded to Rs 42.6 crore, rising from Rs 32.8 crore, while Ebitda margin stood at 35.92 per cent, slightly lower than 36.77 per cent.  </div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Prism Johnson: </strong>Approved the sale of a portion of its industrial premises at a tile plant to JSW Steel, valued at Rs 165 crore.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>RVNL: </strong>Received a Letter of Acceptance for a Rs 404 crore project.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>TTK Healthcare: </strong>Issued a 90-day stop-work order by USAID, with financial implications yet to be assessed. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 10:45:28",
            "link": "https://www.business-standard.com/markets/news/stocks-to-watch-feb-5-swiggy-tata-power-nlc-india-global-health-rvnl-125020500083_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500083"
        },
        {
            "title": "US will 'take over' the Gaza strip, 'own it' and 'develop it', says Trump",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>US President Donald Trump said on Tuesday that the US would “take over” and “own” the Gaza strip, pledging to rebuild and develop it. Speaking at a joint press conference with Israeli Prime Minister Benjamin Netanyahu, Trump stated \"The US will take over the Gaza Strip, and we will do a job with it too.\" \"We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site.\"<small class=\"brtagPara\"> </small> <strong>Economic development and long-term control</strong><small class=\"brtagPara\"> </small> Trump further said \"We're going to take over that piece, we're going to develop it, create thousands and thousands of jobs, and it'll be something that the entire Middle East can be very proud of.\" Trump said he envisioned the US taking a “long-term ownership position” over the Gaza strip, but did not clarify under what authority the US could assume control. When asked about the legality of such a move, he did not respond directly.<small class=\"brtagPara\"> </small> <strong>Criticism of Biden and regional strategy</strong><small class=\"brtagPara\"> </small> Trump criticised former President Joe Biden, claiming his administration had shown incompetence in the Middle East. He said “nobody did anything for four years” in the Middle East except demonstrate incompetence.\"<small class=\"brtagPara\"> </small> Earlier Trump reiterated his call for Arab nations, including Jordan and Egypt, to take in Gazans saying Palestinians there had no alternative but to abandon the Gaza strip. This time, he advocated for the permanent resettlement of Palestinians. Trump said that he might be reconsidering an independent Palestine as part of a two-state solution to the decades-long Israel-Palestinian conflict.<small class=\"brtagPara\"> </small> <strong>Talks with Netanyahu on security and diplomacy</strong><small class=\"brtagPara\"> </small> Netanyahu’s visit to Washington comes two weeks into Trump’s second term. The leaders discussed eliminating Hamas, restoring peace “to a troubled region\", and maintaining the Gaza ceasefire.<small class=\"brtagPara\"> </small> Netanyahu, when asked about the US taking over Gaza, said, “I think it’s something that could change history.” “And I think it’s really worth pursuing this avenue.<small class=\"brtagPara\"> </small> <em>(With agency inputs)</em><br/></div>",
            "pub_date": "2025-02-05 10:45:28",
            "link": "https://www.business-standard.com/world-news/us-will-take-over-the-gaza-strip-own-it-and-develop-it-says-trump-125020500088_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500088"
        },
        {
            "title": "Stocks to Watch, Feb 5: Swiggy, Tata Power, NLC India, Global Health, RVNL",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Stocks to watch on Wednesday, February 5, 2025:</strong> <a href=\"https://www.business-standard.com/markets/news/stock-market-live-updates-feb-5-nse-bse-nifty-today-pmi-trump-china-fii-ipo-swiggy-q3-delhi-polls-125020500077_1.html\" target=\"_blank\">Indian bourses are poised for a positive start</a>, indicated GIFT Nifty futures. The GIFT Nifty futures quoted at 23,840 level, 55 points higher than Nifty50 futures. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Tuesday, the key benchmarks settled in the positive zone with the <a href=\"https://www.business-standard.com/markets/news/why-sensex-surged-1-250-pts-today-despite-a-trade-war-brewing-in-the-us-125020400742_1.html\" target=\"_blank\">BSE Sensex</a> closing at 78,583.81, up 1,397 or 1.81 per cent while the Nifty50 settled at 23,739.25, rising 378 points or 1.62 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em>Meanwhile, for Wednesday, below are some buzzing stocks to keep tabs on:</em></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Stocks to Watch:</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Earnings today: </strong>Reliance Power, Zydus Lifesciences, Abbott India, Cummins India, Gujarat Gas, Welspun Corp, Info Edge (India), Swiggy, Matrimony.com, H.G. Infra Engineering, Aarti Pharmalabs, Eveready Industries India, Piccadily Agro Industries, Exicom Tele-Systems, Sagility India, Inventurus Knowledge Solutions, Zinka Logistics Solutions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtag\"> </small> <strong>Listing today:</strong> Dr Agarwal's Health Care Limited IPO will list on the BSE, NSE today.<small class=\"brtag\"> </small></div>\n<div>\n<strong>Tata Power: </strong><a href=\"https://www.business-standard.com/companies/results/tata-power-q3-results-net-profit-rises-8-2-to-rs-1-031-cr-revenue-up-5-125020400954_1.html\" target=\"_blank\">Q3 consolidated net profit surged</a> to Rs 1,030 crore, up from Rs 953 crore Y-o-Y. Revenue climbed to Rs 15,400 crore, compared to Rs 14,651 crore. Ebitda jumped to Rs 3,352 crore, rising from Rs 2,417 crore, while Ebitda margin improved significantly to 21.78 per cent from 16.50 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Lemon Tree Hotels: </strong>Q3 consolidated net profit surged to Rs 62.5 crore, a sharp rise from Rs 35.4 crore year-on-year (Y-o-Y) and Rs 29.6 crore sequentially. Revenue climbed to Rs 360 crore, up from Rs 289 crore Y-o-Y. Ebitda jumped to Rs 184 crore from Rs 142 crore, while Ebitda margin expanded to 51.86 per cent from 48.80 per cent.  </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Metropolis Healthcare:</strong> Q3 consolidated net profit improved to Rs 31.4 crore, compared to Rs 27.15 crore in the previous year. Revenue climbed to Rs 323 crore, up from Rs 290 crore. Ebitda stood at Rs 72 crore, higher than Rs 64.8 crore, while Ebitda margin remained stable at 22.31 per cent, marginally up from 22.28 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Happiest Minds Technologies: </strong>Q3 consolidated net profit stood at Rs 50.1 crore, compared to Rs 49.5 crore in the previous quarter. Revenue increased to Rs 530 crore from Rs 521 crore. EBIT came in at Rs 72.9 crore, rising from Rs 68.7 crore, with EBIT margin improving to 13.74 per cent from 13.17 per cent.  </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sun Pharma: </strong>Philogen has completed patient enrollment for the Phase III Fibrosarc trial in soft tissue sarcoma.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Whirlpool of India:</strong> Q3 consolidated net profit jumped to Rs 44 crore, compared to Rs 28 crore Y-o-Y. Revenue expanded to Rs 1,700 crore, rising from Rs 1,526 crore. Ebitda grew to Rs 69.3 crore, against Rs 62.7 crore, while Ebitda margin stood at 4.06 per cent, slightly lower than 4.08 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>India Glycols:</strong> Q3 consolidated net profit climbed to Rs 56.8 crore, up from Rs 41.63 crore in the corresponding period last year. Revenue rose to Rs 2,424 crore, compared to Rs 2,119 crore. Ebitda increased to Rs 129 crore, up from Rs 107 crore, with Ebitda margin improving slightly to 5.32 per cent from 5.05 per cent.  </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Global Health:</strong> Q3 consolidated net profit stood at Rs 143 crore, compared to Rs 123 crore in the prior year. Revenue increased to Rs 943 crore, rising from Rs 836 crore. Ebitda at Rs 238 crore, up from Rs 216 crore, while Ebitda margin was 25.21 per cent, slightly lower than 25.82 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Aditya Birla Capital: </strong>Tax demand revised to Rs 184 crore following a rectification order.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Niva Bupa Health Insurance:</strong> Q3 net profit soared to Rs 13.2 crore, significantly higher than Rs 4.6 crore a year earlier. Net premium written increased to Rs 1,150 crore, compared to Rs 1,120 crore. Gross Non-Performing Assets (GNPA) improved to 0.86 per cent, down from 1.05 per cent in the previous quarter.  </div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Indian Energy Exchange (IEX):</strong> January traded volume stood at 10,910 MU, marking a 16 per cent increase Y-o-Y. The average DAM price was Rs 4.43/unit, reflecting a 24 per cent decline from the previous year.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Alkem Laboratories: </strong>Introduced Kojiglo Serum in India to address facial hyperpigmentation.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>NLC India: </strong>Secured its third commercial coal mine – New Patrapara South in Angul. The mine has a total geological reserve of 720.87 million tonnes.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JG Chemicals:</strong> Q3 consolidated net profit at Rs 16.97 crore, up from Rs 10.2 crore. Revenue surged to Rs 209 crore, compared to Rs 160 crore. Ebitda improved to Rs 23.1 crore, against Rs 14.8 crore, while Ebitda margin expanded to 11.05 per cent, compared to 9.16 per cent.  </div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Interarch Building Products: </strong>Q3 standalone net profit amounted to Rs 28.2 crore, increasing from Rs 22 crore Y-o-Y. Revenue rose to Rs 364 crore, against Rs 316 crore in the previous year. Ebitda reached Rs 35.1 crore, up from Rs 27.5 crore, with Ebitda margin at 9.66 per cent, improving from 8.70 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Azad Engineering: </strong>Q3 standalone net profit reached Rs 24.3 crore, advancing from Rs 16.8 crore a year ago. Revenue surged to Rs 119 crore, compared to Rs 89.2 crore. Ebitda expanded to Rs 42.6 crore, rising from Rs 32.8 crore, while Ebitda margin stood at 35.92 per cent, slightly lower than 36.77 per cent.  </div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Prism Johnson: </strong>Approved the sale of a portion of its industrial premises at a tile plant to JSW Steel, valued at Rs 165 crore.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>RVNL: </strong>Received a Letter of Acceptance for a Rs 404 crore project.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>TTK Healthcare: </strong>Issued a 90-day stop-work order by USAID, with financial implications yet to be assessed. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 10:40:29",
            "link": "https://www.business-standard.com/markets/news/stocks-to-watch-feb-5-swiggy-tata-power-nlc-india-global-health-rvnl-125020500083_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500083"
        },
        {
            "title": "US will 'take over' the Gaza strip, 'own it' and 'develop it', says Trump",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>US President Donald Trump said on Tuesday that the United States would “take over” and “own” the Gaza strip, pledging to rebuild and develop it. Speaking at a joint press conference with Israeli Prime Minister Benjamin Netanyahu, Trump stated \"The US will take over the Gaza Strip, and we will do a job with it too,\" \"We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site.\"<small class=\"brtagPara\"> </small>\n<strong>Economic development and long-term control</strong><small class=\"brtagPara\"> </small>\r\nTrump further said \"We're going to take over that piece, we're going to develop it, create thousands and thousands of jobs, and it'll be something that the entire Middle East can be very proud of. Trump said he envisioned the US taking a “long-term ownership position” over the Gaza strip but did not clarify under what authority the US could assume control. When asked about the legality of such a move, he did not respond directly.<small class=\"brtagPara\"> </small>\n<strong>Criticism of Biden and regional strategy</strong><small class=\"brtagPara\"> </small>\r\nTrump criticised former President Joe Biden, claiming his administration had shown incompetence in the Middle East. He said “nobody did anything for four years” in the Middle East except demonstrate incompetence.\"<small class=\"brtagPara\"> </small>\r\nEarlier Trump reiterated his call for Arab nations, including Jordan and Egypt, to take in Gazans saying Palestinians there had no alternative but to abandon the Gaza strip. This time, he advocated for the permanent resettlement of Palestinians. Trump said that he might be reconsidering an independent Palestine as part of a two-state solution to the decades-long Israel-Palestinian conflict.<small class=\"brtagPara\"> </small>\n<strong>Talks with Netanyahu on security and diplomacy</strong><small class=\"brtagPara\"> </small>\r\nNetanyahu’s visit to Washington comes two weeks into Trump’s second term. The leaders discussed eliminating Hamas, restoring peace “to a troubled region\", and maintaining the Gaza ceasefire.<small class=\"brtagPara\"> </small>\r\nNetanyahu, when asked about the US taking over Gaza, said, “I think it’s something that could change history.” “And I think it’s really worth pursuing this avenue.<small class=\"brtagPara\"> </small>\n<em>(With agency inputs)</em><br/></div>",
            "pub_date": "2025-02-05 10:40:28",
            "link": "https://www.business-standard.com/world-news/us-will-take-over-the-gaza-strip-own-it-and-develop-it-says-trump-125020500088_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500088"
        },
        {
            "title": "Families sue over Trump's order to halt funds for gender-affirming care",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tA group of families with transgender children filed a lawsuit Tuesday over President Donald Trump's executive order to halt federal support for gender-affirming health care for transgender people under age 19.</p>\n<p>\r\n\tPFLAG, a national group for family of LGBTQ+ people; and GLMA, a doctors organisation, are also plaintiffs in the court challenge in US District Court in Baltimore.</p>\n<p>\r\n\tIt comes one week after Trump signed an order calling for the federal government to stop funding the medical care through federal government-run health insurance programs including Medicaid and TRICARE.</p>\n<p>\r\n\tKristen Chapman, the mother of one of the plaintiffs in the case, said her family moved to Richmond, Virginia, from Tennessee in 2023 because of a ban on gender-affirming care in their home state. Her 17-year-old daughter, Willow, had an initial appointment scheduled for last week with a new provider who would accept Medicaid. But Trump signed his order the day before and the hospital said it could not provide care.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tI thought Virginia would be a safe place for me and my daughter, Kristen Chapman said in a statement. \"Instead, I am heartbroken, tired, and scared.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe ACLU and Lambda Legal, who are representing the plaintiffs, want a judge to put the order on hold.</p>\n<p>\r\n\tSome health providers immediately paused providing the coverage while they assess how the order affects them. New York Attorney General Letitia James, who has repeatedly battled Trump in court, told hospitals in her state Monday that it would violate the law to stop offering gender-affirming care to people under 19.</p>\n<p>\r\n\tTrump's approach on transgender policy represents an abrupt change from the Biden administration, which sought to explicitly extend civil rights protections to transgender people.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tTrump has used strong language, asserting in the order on gender-affirming care that \"medical professionals are maiming and sterilising a growing number of impressionable children under the radical and false claim that adults can change a child's sex.</p>\n<p>\r\n\tAlex Sheldon, executive director of GLMA, the doctors group in the legal challenge, said there are established medical standards for caring for transgender youth. Now, an extreme political agenda is trying to overrule that expertise, putting young people and their providers in danger,\" Sheldon said in a statement. \"We are confident that the law, science, and history are on our side.</p>\n<p>\r\n\tIn addition to the order on health care access, Trump has also signed orders that narrowly define the sexes as unchangeable, open the door to banning transgender people from military service and set up new rules about how schools can teach about gender.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tLegal challenges have already been filed on the military order and a plan to move transgender women in federal prisons to men's facilities. Others are expected to be filed, just as there have been challenges to a variety of Trump's policies.</p>\n<p>\r\n\tResearchers have found that fewer than 1 in 1,000 adolescents receive the care, which includes treatments such as puberty blockers, hormone treatments and surgeries though surgery is rare for children.</p>\n<p>\r\n\tAs transgender people have gained visibility and acceptance in some ways, there's been vehement pushback. At least 26 states have passed laws to restrict or ban the care for minors. The US Supreme Court heard arguments last year but has not yet ruled on whether Tennessee's ban on the care is constitutional.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 10:35:26",
            "link": "https://www.business-standard.com/world-news/families-sue-over-trump-s-order-to-halt-funds-for-gender-affirming-care-125020500019_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500019"
        },
        {
            "title": "Stocks to Watch, Feb 5: Swiggy, Tata Power, NLC India, Global Health, RVNL",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Stocks to watch on Wednesday, February 5, 2025:</strong> <a href=\"https://www.business-standard.com/markets/news/stock-market-live-updates-feb-5-nse-bse-nifty-today-pmi-trump-china-fii-ipo-swiggy-q3-delhi-polls-125020500077_1.html\" target=\"_blank\">Indian bourses are poised for a positive start</a>, indicated GIFT Nifty futures. The GIFT Nifty futures quoted at 23,840 level, 55 points higher than Nifty50 futures. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Tuesday, the key benchmarks settled in the positive zone with the <a href=\"https://www.business-standard.com/markets/news/why-sensex-surged-1-250-pts-today-despite-a-trade-war-brewing-in-the-us-125020400742_1.html\" target=\"_blank\">BSE Sensex</a> closing at 78,583.81, up 1,397 or 1.81 per cent while the Nifty50 settled at 23,739.25, rising 378 points or 1.62 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em>Meanwhile, for Wednesday, below are some buzzing stocks to keep tabs on:</em></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Stocks to Watch:</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Earnings today: </strong>Reliance Power, Zydus Lifesciences, Abbott India, Cummins India, Gujarat Gas, Welspun Corp, Info Edge (India), Swiggy, Matrimony.com, H.G. Infra Engineering, Aarti Pharmalabs, Eveready Industries India, Piccadily Agro Industries, Exicom Tele-Systems, Sagility India, Inventurus Knowledge Solutions, Zinka Logistics Solutions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtag\"> </small> <strong>Listing today:</strong> Dr Agarwal's Health Care Limited IPO will list on the BSE, NSE today.<small class=\"brtag\"> </small></div>\n<div>\n<strong>Tata Power: </strong><a href=\"https://www.business-standard.com/companies/results/tata-power-q3-results-net-profit-rises-8-2-to-rs-1-031-cr-revenue-up-5-125020400954_1.html\" target=\"_blank\">Q3 consolidated net profit surged</a> to Rs 1,030 crore, up from Rs 953 crore Y-o-Y. Revenue climbed to Rs 15,400 crore, compared to Rs 14,651 crore. Ebitda jumped to Rs 3,352 crore, rising from Rs 2,417 crore, while Ebitda margin improved significantly to 21.78 per cent from 16.50 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Lemon Tree Hotels: </strong>Q3 consolidated net profit surged to Rs 62.5 crore, a sharp rise from Rs 35.4 crore year-on-year (Y-o-Y) and Rs 29.6 crore sequentially. Revenue climbed to Rs 360 crore, up from Rs 289 crore Y-o-Y. Ebitda jumped to Rs 184 crore from Rs 142 crore, while Ebitda margin expanded to 51.86 per cent from 48.80 per cent.  </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Metropolis Healthcare:</strong> Q3 consolidated net profit improved to Rs 31.4 crore, compared to Rs 27.15 crore in the previous year. Revenue climbed to Rs 323 crore, up from Rs 290 crore. Ebitda stood at Rs 72 crore, higher than Rs 64.8 crore, while Ebitda margin remained stable at 22.31 per cent, marginally up from 22.28 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Happiest Minds Technologies: </strong>Q3 consolidated net profit stood at Rs 50.1 crore, compared to Rs 49.5 crore in the previous quarter. Revenue increased to Rs 530 crore from Rs 521 crore. EBIT came in at Rs 72.9 crore, rising from Rs 68.7 crore, with EBIT margin improving to 13.74 per cent from 13.17 per cent.  </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sun Pharma: </strong>Philogen has completed patient enrollment for the Phase III Fibrosarc trial in soft tissue sarcoma.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Whirlpool of India:</strong> Q3 consolidated net profit jumped to Rs 44 crore, compared to Rs 28 crore Y-o-Y. Revenue expanded to Rs 1,700 crore, rising from Rs 1,526 crore. Ebitda grew to Rs 69.3 crore, against Rs 62.7 crore, while Ebitda margin stood at 4.06 per cent, slightly lower than 4.08 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>India Glycols:</strong> Q3 consolidated net profit climbed to Rs 56.8 crore, up from Rs 41.63 crore in the corresponding period last year. Revenue rose to Rs 2,424 crore, compared to Rs 2,119 crore. Ebitda increased to Rs 129 crore, up from Rs 107 crore, with Ebitda margin improving slightly to 5.32 per cent from 5.05 per cent.  </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Global Health:</strong> Q3 consolidated net profit stood at Rs 143 crore, compared to Rs 123 crore in the prior year. Revenue increased to Rs 943 crore, rising from Rs 836 crore. Ebitda at Rs 238 crore, up from Rs 216 crore, while Ebitda margin was 25.21 per cent, slightly lower than 25.82 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Aditya Birla Capital: </strong>Tax demand revised to Rs 184 crore following a rectification order.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Niva Bupa Health Insurance:</strong> Q3 net profit soared to Rs 13.2 crore, significantly higher than Rs 4.6 crore a year earlier. Net premium written increased to Rs 1,150 crore, compared to Rs 1,120 crore. Gross Non-Performing Assets (GNPA) improved to 0.86 per cent, down from 1.05 per cent in the previous quarter.  </div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Indian Energy Exchange (IEX):</strong> January traded volume stood at 10,910 MU, marking a 16 per cent increase Y-o-Y. The average DAM price was Rs 4.43/unit, reflecting a 24 per cent decline from the previous year.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Alkem Laboratories: </strong>Introduced Kojiglo Serum in India to address facial hyperpigmentation.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>NLC India: </strong>Secured its third commercial coal mine – New Patrapara South in Angul. The mine has a total geological reserve of 720.87 million tonnes.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JG Chemicals:</strong> Q3 consolidated net profit at Rs 16.97 crore, up from Rs 10.2 crore. Revenue surged to Rs 209 crore, compared to Rs 160 crore. Ebitda improved to Rs 23.1 crore, against Rs 14.8 crore, while Ebitda margin expanded to 11.05 per cent, compared to 9.16 per cent.  </div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Interarch Building Products: </strong>Q3 standalone net profit amounted to Rs 28.2 crore, increasing from Rs 22 crore Y-o-Y. Revenue rose to Rs 364 crore, against Rs 316 crore in the previous year. Ebitda reached Rs 35.1 crore, up from Rs 27.5 crore, with Ebitda margin at 9.66 per cent, improving from 8.70 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Azad Engineering: </strong>Q3 standalone net profit reached Rs 24.3 crore, advancing from Rs 16.8 crore a year ago. Revenue surged to Rs 119 crore, compared to Rs 89.2 crore. Ebitda expanded to Rs 42.6 crore, rising from Rs 32.8 crore, while Ebitda margin stood at 35.92 per cent, slightly lower than 36.77 per cent.  </div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Prism Johnson: </strong>Approved the sale of a portion of its industrial premises at a tile plant to JSW Steel, valued at Rs 165 crore.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>RVNL: </strong>Received a Letter of Acceptance for a Rs 404 crore project.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>TTK Healthcare: </strong>Issued a 90-day stop-work order by USAID, with financial implications yet to be assessed. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 10:35:26",
            "link": "https://www.business-standard.com/markets/news/stocks-to-watch-feb-5-swiggy-tata-power-nlc-india-global-health-rvnl-125020500083_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500083"
        }
    ]
}