{
    "data": [
        {
            "title": "Budget 2025: Where should investors park funds? EV, IT, tourism big themes",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFollowing the announcement of Budget 2025, smallcase Managers, Sebi registered research analysts and investment advisors have identified promising sectors for investment. The rise in capital expenditure (Capex) budget, projected to exceed $1.2 trillion by 2030, is set to benefit banks and infrastructure NBFCs. Additionally, sectors such as urban housing, insurance, and defense-related industries look favorable due to long-term policy support.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile consumption-driven companies are considered overvalued, consumer finance, electric vehicles (EVs), and tourism—particularly religious tourism—are emerging as compelling investment opportunities. Additionally, India’s growing IT market, fueled by AI advancements, presents substantial long-term growth potential.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Here are the key sectors selected for investment: </strong></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<ul>\n<li>\r\n\t\tCapex budget has risen 15% CAGR in the past 10 years, allocation until 2030 likely to exceed $1.2 trillion. Large capex investments likely to be beneficial for Banks and specialized infra NBFCs</li>\n<li>\r\n\t\tConsumer finance companies available at a more reasonable valuation</li>\n<li>\r\n\t\tEVs, Mobility, Tourism, and religious tourism provide interesting opportunities</li>\n<li>\r\n\t\tDeepSeek has expanded the market for IT, but near-term growth rates and valuations a concern</li>\n</ul>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Capex budget</strong></div>\n<div>\r\n\tWhile the showstopper in this budget was the zero income tax for those incurring Rs 12 lakh of salary, there was a lot of capex and infrastructure allocation which was not in the limelight. From 2014-15 where capex was 20% of the total budget, it has increased to 31% this year. Capex budget has been growing at nearly 15% CAGR over the last 10 years compared to the revenue budget which has grown at around 10% CAGR.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sectors in focus</strong></div>\n<div>\r\n\tSuch large capex investments are likely to be beneficial to Banks and specialized infrastructure NBFCs. Further, the focus on power sector “nudge” reforms, which encourage state discoms to focus on timely payments to generators, are likely to benefit the whole power ecosystem. Housing and Urbanization focus would benefit housing finance companies. Besides these, Defence, Railways, and Construction and Engineering and EPC companies would benefit to a large extent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tArvind Kothari, smallcase Manager and Founder of Niveshaay highlighted power, transformers, and clean energy sectors are attractive investment opportunities, especially with the government’s continued focus on energy transition, infrastructure development, and sustainability. The Budget’s increased allocation towards renewable energy, grid modernization, and EV infrastructure is set to drive robust growth in these areas. He also pointed out PLI schemes have significantly accelerated the growth of textile companies by enhancing manufacturing capabilities and promoting exports. The Budget’s focus on boosting domestic production, coupled with favorable policies, is expected to further strengthen this sector.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Consumption sector is a big winner</strong></div>\n<div>\r\n\tWhile consumption is likely to benefit, most of the consumption companies are extremely overvalued. smallcase managers believe that consumer finance companies could be a way to play this at a more reasonable valuation. Also, EVs and other means of mobility could provide interesting opportunities. Another sector which could be interesting due to the tax benefits and the budget focus on the sector is Tourism, especially, religious tourism.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSonam Srivastava, smallcase Manager, and Founder of Wright Research said, “Retail consumption remains a theme for investment. Trent, Zomato and Dixon Tech are available at attractive valuations currently. We also have a bias towards defensives, capital market focused companies, pharma and hospitals. Electronic manufacturing, Banks and IT sectors also look interesting at the current juncture.”</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>DeepSeek and IT sector</strong></div>\n<div>\r\n\tIT remains an interesting play with DeepSeek catalyzing an extraordinarily large TAM (total addressable market) for Indian IT services companies. With the cost of training new AI models being brought down to 1/30th to 1/50th of the earlier paradigm, this makes it possible for small and mid-sized companies and startups to develop new models and launch numerous products based on AI in the next 2-10 years. This enlarges the market for Indian IT services many fold. However, with some uncertainty on the near-term growth rates and valuations slightly high, IT remains potentially alpha-generating.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t “Toy industry is a $400 billion global market, with significant manufacturing happening in China. The budget has allocated funds for the toy manufacturing industry, which could lead to significant growth in the next 10-15 years. At a macro level, we need the economy to clock over 7.5-8% for long-term growth of the market and currency,\" said Ambareesh Baliga, veteran market expert and smallcase Manager.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDr. Vikas Gupta, smallcase Manager &amp; Founder of OmniScience Capital said, “The US Tariffs on China is a big opportunity for India. At a macro level, Trump favors a weak dollar to increase competitiveness of American exports. Add to that it is challenging for the RBI to cut rates given the fall in INR, the central bank may look at other ways to boost market liquidity given INR fall, largely the street is expecting a 25 bps rate cut by the RBI this week.\"</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 13:35:27",
            "link": "https://www.business-standard.com/finance/personal-finance/budget-2025-where-should-investors-park-funds-ev-it-tourism-big-themes-125020500365_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500365"
        },
        {
            "title": "IND vs ENG - One series does not define the form of whole team: Gill",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><p>\r\n\tIndia's vice-captain Shubman Gill on Tuesday defended their performance in the Test series loss in Australia, saying that one poor series does not define a team and that it is unfair to criticise a side after a rare bad outing.</p>\n<p>\r\n\tIndia suffered a 1-3 defeat in the five-match series in Australia, bringing to an end their decade-long dominance in the Border-Gavaskar Trophy.</p>\n<p>\r\n\tKey players such as Rohit Sharma, Virat Kohli, KL Rahul, Rishabh Pant, and Gill himself are now set to return for the three-match ODI series against England before heading to Dubai for the all-important <a href=\"https://www.business-standard.com/cricket/champions-trophy\" target=\"_blank\"><strong>ICC Champions Trophy</strong></a>.</p>\n<p>\r\n\t\"One series does not define the form of the whole team. There are a lot of players who, in the past, have performed consistently in a lot of series and tournaments,\" Gill told reporters here ahead of the first ODI against England.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Definitely, we did not play as per our expectations in the Australian series, but still we played some good cricket. We were unfortunate not to have (Jasprit) Bumrah on the last day and we would have won the match and the series would have been a draw and this talk wouldn't have happened.</p>\n<p>\r\n\t\"One match and one day doesn't define us, we won there twice before and earlier won a World Cup and then reached the final of a World Cup, so we should keep all those things in mind.\"<small class=\"brtagPara\"> </small>\r\n\tBefore the reverse in Australia, India were also whitewashed 3-0 by New Zealand at home, unprecedented in the country's cricket history.<small class=\"brtagPara\"> </small>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/points-table\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 points table here</strong></a><small class=\"brtagPara\"> </small>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/schedule\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 full schedule, match timings (IST) here</strong></a></p><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 13:35:26",
            "link": "https://www.business-standard.com/cricket/news/ind-vs-eng-one-series-does-not-define-the-form-of-whole-team-gill-125020401286_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401286"
        },
        {
            "title": "Lemon Tree shares gain 5% after posting Q3 results; check details here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tLemon Tree Hotels shares advanced 4.9 per cent on Wednesday, logging an intraday high at Rs 154.8 per share on BSE. The buying on the counter came after the company reported its Q3 numbers. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAround 10:36 AM, Lemon Tree share price was up 4.04 per cent at Rs 153.4 per share on BSE. In comparison, the BSE Sensex was down 0.08 per cent at 78,523.99. The market capitalisation of the company stood at Rs 12,073.84 crore. The 52-week high of the stock was at Rs 162.25 per share and the 52-week low was at Rs 112.3 per share. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company released its Q3 results on Tuesday after market hours. Lemon Tree in the quarter ended December 31, 2024, reported a 82 per cent rise in consolidated net profit to Rs 79.9 crore as compared to Rs 43.8 crore a year ago. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company's revenue for the third quarter stood at Rs 355.2 crore as compared to Rs 290.2 crore a year ago implying an increase of 25 per cent year-on-year (Y-o-Y).<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/news/weak-demand-weighs-on-asian-paints-q3-analysts-see-more-pain-in-near-term-125020500157_1.html\" target=\"_blank\">Weak demand weighs on Asian Paints Q3; analysts see more pain in near-term</a></strong></div>\n</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h3>\r\n\tLemon Tree Hotels management commentary</h3>\n<div>\r\n\tGoing forward, the management is confident in the company’s ability to sustain growth in the coming quarters by focusing on accelerated growth in management and franchised portfolio, with a proportionate increase in fee-based income and timely completion of renovation activities in the owned portfolio to further improve gross ARR and occupancy. </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe management noted added that the increased investment in renovation expenses will continue into FY26 until the entire portfolio of owned hotels has been fully renovated and refreshed. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPost this, renovation expenses will be close to 1.8 per cent of revenue on an ongoing basis. With demand growth expected to outpace supply in the next few years and increasing discretionary spending on branded hotels in India, Lemon Tree's increased investment in renovation will allow us to position Lemon Tree as the preferred brand in the mid-market segment, as per management. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the past one year, Lemon Tree shares have gained 5.3 per cent against Sensex's rise of 9.5 per cent. </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 13:30:35",
            "link": "https://www.business-standard.com/markets/news/lemon-tree-shares-gain-5-after-posting-q3-results-check-details-here-125020500364_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500364"
        },
        {
            "title": "Titagarh Rail Systems shares surge 7% on new business plans; details here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tShares of freight wagons and passenger coaches maker Titagarh Rail Systems climbed 6.90 per cent to hit the day's high of Rs 964.05 apiece on the BSE during intra-day trade on Wednesday, February 5, 2025. The northward movement in the company's share price came on the back of news that the company has announced a management reorganisation and strengthening, as well as plans to venture into new areas of growth.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/markets/titagarh-rail-systems-ltd-share-price-19939.html\" target=\"_blank\">Titagarh Rail Systems</a> has informed the exchanges about the formation of new verticals under the names Ship Building and Maritime Systems (SMS), and Safety and Signaling Systems (SSS).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"While Titagarh has already been in the shipbuilding and maritime business in the past and has designed, manufactured, and delivered several projects, including specialized ships such as a Fast Patrol Vessel for the Indian Coast Guard, a passenger ferry exported to Guyana (both through GRSE), and coastal research vessels 'Sagar Tara' and 'Sagar Anveshika,' along with many vessels for the Indian Navy,\" the company said in a release.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small> The comapny further said that, the SMS vertical of Titagarh would be headed by Saket Kandoi, who is the director of the company and was earlier the chief operating officer of the Freight Rail Systems division. He will now be the director and CEO of the Ship Building and Maritime Systems.</div>\n<div>\n<div>\n<small class=\"brtag\"> </small> \"Prithish Chowdhary, dy managing director of the company, apart from handing various corporate functions, will be responsible for developing the two new business verticals i.e. Shipbuilding and Maritime Systems (SMS) and Safety and Signalling Systems (SSS),\" it added. <small class=\"brtagPara\"> </small>\n<strong>READ: </strong><a href=\"https://www.business-standard.com/markets/news/rvnl-shares-gain-4-on-receiving-rs-404-cr-loa-from-east-coast-railway-125020500239_1.html?1738732292\" target=\"_blank\"><strong>RVNL shares gain 4% on receiving Rs 404-cr LoA from East Coast Railway</strong></a></div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTitagarh Rail Systems is a comprehensive mobility solutions provider with a strong presence in India and Italy. With state-of-the-art factories in both countries, the company is committed to meeting the diverse requirements of passenger and freight rolling stock. It specialises in crafting cutting-edge transportation solutions, including semi-high-speed trains, urban metros, passenger coaches, propulsion systems, and a wide array of wagons, including specialized ones.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe railway wagons maker's market capitalisation stands at Rs 1,082.10 crore on the BSE, as of February 5, 2025. The company is a constituent of the BSE 500 index.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTitagarh Rail Systems share price has dropped 32 per cent in the last six months, and 7 per cent in the last one year.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company's shares hit their 52-week high of Rs 1,896.50—which is also their all-time high—on June 27, 2024, while their 52-week low of Rs 782.10 was recorded on March 13, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt around 10:30 AM, Titagarh Rail Systems shares were trading at Rs 947.90, up 5.12 per cent from their previous close of Rs 901.75 on the NSE. A combined total of nearly 2 million shares of Titagarh Rail Systems, worth approximately Rs 184.16 crore, exchanged hands on the NSE and BSE.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, benchmark equity indices <a href=\"https://www.business-standard.com/markets/sp-bse-sensex-share-price-20558.html\" target=\"_blank\">BSE Sensex</a> and NSE Nifty50 were trading flat on Wednesday. The Sensex was at 78,513.38, down 70.43 points or 0.09 per cent, while the Nifty50, on the other hand, was trading 30.90 points or 0.13 per cent higher at around 23,770 levels.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 13:30:34",
            "link": "https://www.business-standard.com/markets/news/titagarh-rail-systems-shares-surge-7-on-new-business-plans-details-here-125020500359_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500359"
        },
        {
            "title": "If your salary is just above Rs 12 lakh, do you pay full tax of Rs 61,500?",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tBudget 2025 has proposed to make normal income up to Rs 12 lakh tax-free under the new tax regime for fiscal year 2025-26. This has become possible due to revised tax slabs and an enhanced rebate of Rs 60,000 under section 87A. However, ever since the announcement of revised tax slabs and rates under the new tax regime for FY 2025-26, there has been a lot of confusion about tax on incomes slightly above Rs 12 lakh. For example, what happens when a person is earning Rs 12.1 lakh or Rs 12.5 lakh?</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIf your salary is a little over Rs 12 lakh, say Rs 12.10 lakh, you might expect to pay Rs 61,500 in income tax.  However, due to marginal relief, you won’t pay the full tax. This relief ensures that your total tax liability doesn’t exceed the tax you would have paid if your income were exactly Rs 12 lakh. So, while your tax on Rs 12.10 lakh would normally be Rs 61,500, marginal relief reduces it to Rs 25,000 (plus cess), saving you a significant amount in tax.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Central Board of Direct Taxes (CBDT) has cleared the doubts, saying the total income till which marginal relief is available is near about Rs 12,75,000.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What is marginal tax relief?</strong></div>\n<div>\r\n\tMarginal tax relief is the relief provided by the income tax department when a person's income is marginally above the tax-free limit.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Marginal relief is a provision that grants relief to a taxpayer whose income may have just exceeded the threshold of a higher tax bracket so that he / she does not have to pay a tax higher than the additional income. While income up to Rs 12.75 lakh will be tax-free in the hands of salaried individuals by virtue of the slab rates and rebate along with the standard deduction of Rs 75,000, for non-salaried individuals, the benefit of a standard deduction will be available in the form of marginal relief making income up to Rs 12.75 lakh tax-free for the non-salaried individuals as well. However, marginal relief will not be available for income exceeding Rs 12.75 lakh,\" said SR Patnaik, Partner (Head - Taxation), Cyril Amarchand Mangaldas.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Let's see how much tax one has to pay with or without marginal relief on incomes of Rs 12.1 lakh, Rs 12.5 lakh, and Rs 12.7 lakh, according to CBDT.</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\n<strong>Examples of Tax Calculation with and without Marginal Relief</strong><small class=\"brtag\"> </small></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\n<strong>Rs 12.10 lakh income:</strong></div>\n<div>\r\n\tTax without relief: Rs 61,500</div>\n<div>\r\n\tTax with relief: Rs 10,000</div>\n<div>\r\n\t(Tax relief of Rs 51,500)</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rs 12.50 lakh income:</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\r\n\tTax without relief: Rs 67,500</div>\n<div>\r\n\tTax with relief: Rs 50,000</div>\n<div>\r\n\t(Tax relief of Rs 17,500)</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rs 12.70 lakh income:</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\r\n\tTax without relief: Rs 70,500</div>\n<div>\r\n\tTax with relief: Rs 70,000</div>\n<div>\r\n\t(Tax relief of Rs 500)</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rs 12.75 lakh income:</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\r\n\tTax without relief: Rs 71,250</div>\n<div>\r\n\tTax with relief: Rs 71,250</div>\n<div>\r\n\t(No relief at this level)</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>How is Marginal Relief Calculated?</strong></div>\n<div>\r\n\tFor an income of Rs 12.1 lakh, the tax payable without relief is Rs 61,500. This is broken down as follows:</div>\n<small class=\"brtag\"> </small>\n<ul>\n<li>\r\n\t\tRs 0 tax on the first Rs 4 lakh</li>\n<li>\r\n\t\t5% on Rs 4 lakh to Rs 8 lakh, amounting to Rs 20,000</li>\n<li>\r\n\t\t10% on Rs 8 lakh to Rs 12 lakh, amounting to Rs 40,000</li>\n<li>\r\n\t\t15% on Rs 12 lakh to Rs 12.1 lakh, amounting to Rs 1,500</li>\n</ul>\n<div>\r\n\tBut because of the Rs 60,000 rebate, tax on Rs 12 lakh is zero, and the marginal relief calculation is based on the excess income above Rs 12 lakh. For Rs 12.1 lakh, the excess income is Rs 10,000. The relief is calculated by subtracting Rs 10,000 from the total tax liability, reducing the tax payable to just Rs 10,0<strong>00.</strong><small class=\"brtagPara\"> </small>\n<div>\n<strong>Marginal relief is available to resident individuals whose income exceeds Rs 12 lakh but does not exceed Rs 12.75 lak</strong>h. If a taxpayer’s income exceeds Rs 12.75 lakh, marginal relief no longer applies, and they will be subject to the regular tax rates. <small class=\"brtagPara\"> </small>\n<div>\r\n\t\t\tMr X, with a gross taxable income of Rs 14 lakh, claims deductions of Rs 1.75 lakh ( standard deduction of Rs 75,000  and deduction under Section 80CCD (2) for the NPS contribution by an employer for Rs 1 lakh). Although his income exceeds Rs 12 lakh, he’s not eligible for a rebate under Section 87A. Without marginal relief, his tax liability would be Rs 63,750. However, due to marginal relief, he pays only Rs 25,000, plus a 4% cess, making his final tax Rs 26,000. Marginal relief applies up to Rs 12.75 lakh, after which full tax is due according to the new tax slabs.<small class=\"brtagPara\"> </small>\n<div>\n<strong>Rajarshi Dasgupta, Executive Director-Tax, AQUILAW explains the difference between salaried and non-salaried individuals and their tax exemptions:</strong></div></div></div></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div>\r\n\t\t\t\tUnion Budget 2025 has raised the income tax exemption threshold to INF 12 lakhs effectively making incomes up to this amount tax-free. For salaried individuals, this limit increases to INR 12.75 lakh after factoring in the standard deduction of Rs 75,000.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tFor non salaried individuals earning just above Rs 12 lakh also stand to benefit through a mechanism known as marginal relief which otherwise ensures </div>\n<div>\r\n\t\t\t\ttaxpayers with income slightly exceeding Rs 12 lakh but not above Rs 12.75 lakh are not subjected to disproportionately high tax rates. In simple words, marginal relief is available to resident individuals whose income exceeds Rs 12 lakh but does not exceed Rs 12.75 lakh. If a taxpayer’s income exceeds Rs 12.75 lakh, marginal relief no longer applies, and they will be subject to the regular tax rates.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tTo give an example, if a non-salaried individual earns Rs 12.1 lakh they would typically incur a tax liability of Rs 61,500 under the regular tax slabs. However, with marginal relief, this liability is substantially reduced to just Rs 10,000.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tNo marginal relief will be applicable if income exceeds Rs 12.75 lakh and will be taxed at normal slab rates.</div>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 13:25:26",
            "link": "https://www.business-standard.com/finance/personal-finance/if-your-salary-is-rs-12-10-lakh-do-you-have-to-pay-full-tax-of-rs-61-125020500219_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500219"
        },
        {
            "title": "Singapore passes new law on racial harmony, to check foreign interference",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tA new law consolidating existing statutes to preserve racial harmony and providing safeguards against foreign interference has been passed unanimously in the Singapore Parliament.</p>\n<p>\r\n\tNew safeguards against foreign interference will be introduced in multi-racial Singapore where some 300 clan and business associations are to be designated as race-based entities subject to disclosures, such as receiving foreign donations.</p>\n<p>\r\n\tThe law was passed on Tuesday.</p>\n<p>\r\n\tWhile the authorities already had powers to deal with conduct that threatened racial harmony, Home Affairs and Law Minister K. Shanmugam said the Bill brought these powers together in one place, while affirming the importance of racial harmony in the multi-ethnic city-state.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe new law empowers the authorities to issue restraining orders against individuals involved in making content that prejudices Singapore's racial harmony, taking close reference from the existing Maintenance of Religious Harmony Act (MRHA).</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tIt also introduces a community remedial initiative, which gives those who have committed less egregious race-related offences a chance to mend community ties in lieu of prosecution.</p>\n<p>\r\n\t\"We have always treated racial harmony as being fundamental in Singapore, and so this Bill has to be seen in that context, Shanmugam said.</p>\n<p>\r\n\t\"Multiracialism, underpinned by racial harmony, is a foundational principle for us,\" local media reports had the Minister as saying in the house.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tDuring the debate on the bill, Shanmugam sought to allay concerns that the legislative changes would curtail free speech.</p>\n<p>\r\n\tMembers of parliament had raised concerns that the Government's new power to issue restraining orders could stifle legitimate discourse and sought clarity on scenarios where this power would be used.</p>\n<p>\r\n\tMinister Shanmugam said the best evidence of how these powers are likely to be used is how the Government has used similar powers it has had since the MRHA was enacted in 1990.</p>\n<p>\r\n\tNo orders have been issued under the MRHA to date, but the legal framework means everyone understands what is not allowed in Singapore, he added.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"That gives you an indication of how the Government approaches these powers. The important thing is to have the powers, but also to be very, very careful and judicious in how you use them, he said.</p>\n<p>\r\n\tThe Minister cited a previous case where a preacher made highly disparaging remarks on YouTube about Buddhism and Taoism. Officials spoke to the preacher, who agreed to withdraw his remarks.</p>\n<p>\r\n\t\"We didn't need to resort to issuing an order... the fact that we had the power helped, and after that, others took reference from that (case), Shanmugam said.</p>\n<p>\r\n\tShanmugam said the scope of unacceptable conduct regarding race relations remains substantively the same, as offences under the new law cover what is already in the Penal Code.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tReferring to online comments that call for 'Palestine to be free', the Minister pointed out that these are not calls for violence here but expressions of opinion.</p>\n<p>\r\n\tResponding to a question, Shanmugam said acts that did not flout existing racial harmony laws will still not be offences, but added that there are other laws governing protected places and which regulate public assemblies.</p>\n<p>\r\n\t\"I would suggest, therefore, a careful understanding of the (Bill's) provisions. Otherwise, there is a serious risk that the public may be misled, he said.</p>\n<p>\r\n\tShanmugam noted that the new law has safeguards in place beyond the minister who issues the restraining order, as such an application would have to be sent to a new Presidential Council for Racial and Religious Harmony, which will make recommendations to the president on whether to confirm, cancel or vary the order.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe Minister said he agreed entirely that Singapore must remain open, and a consistent message by government leaders here over the last 60 years is that the nation must be open and interact with the world.</p>\n<p>\r\n\tYet, it also means that groups like clan associations can potentially be vectors of influence from countries that want to influence Singapore's politics, he added.</p>\n<p>\r\n\tThe authorities have engaged many race-based entities here, and they understand and accept the need for such safeguards, said Shanmugam.</p>\n<p>\r\n\tThe intent is to safeguard from malicious foreign influence, not to curtail legitimate exchanges, business deals or trade promotion activities conducted by our clan or business associations, he added.</p><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tGerald Giam, a member of parliament from the opposition Workers' Party had expressed concern that genuine dialogue about racial issues will be curtailed under the new Act, citing the examples of the Israeli-Palestinian conflict.</p>\n<p>\r\n\tThe scope of unacceptable conduct regarding race relations will remain substantially the same as today. There is, in fact, no change in the law, said Shanmugam.</p>\n<p>\r\n\tSome updates will be made to align the language and defences under the Bill with the equal provision. So, the changes are that we actually provided for some additional defences, and in fact, narrowed one of the provisions.</p>\n<p>\r\n\tWe agree entirely that Singapore must remain open. We must be able to reach out to the world. In fact, we have to for our success, said Shanmugam, responding to a question about the new Act deterring clans and business associations from interacting with foreigners and foreign entities altogether.</p><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tEconomically, we'll be finished if we don't interact. Socially, we are such a small place, we need to get ideas from outside, and then we need to adapt the ideas that work for us to our own situations, Channel News Asia quoted the Minister as responding to concerns raised by parliamentarians.</p>\n<p>\r\n\tThe main issue, he noted, is that those groups could potentially be vectors of influence from countries that want to influence our politics. Evidence from around the world gives Singapore some reasons to be concerned about this, said Shanmugam.</p>\n<p>\r\n\tHe likened the safeguards under the new Act to the Foreign Interference (Countermeasures) Act, which subjects MPs and Cabinet ministers to similar measures, to prevent them from being used in the same way by foreign actors.</p><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tNothing in the Bill is meant to suggest that foreign influence is in itself undesirable, and designation under this Bill as a race-based entity does not imply any wrongdoing, said Shanmugam.</p>\n<p>\r\n\tIt simply means that the entities or the entity has engaged in activities that relate to race, which sometimes is its raison d'etre.</p>\n<p>\r\n\tShanmugam emphasised that such clans and associations are important for Singapore. They play a constructive role in building social bonds and preserving traditions and cultures while strengthening business networks too, he said.</p><p></p></div>",
            "pub_date": "2025-02-05 13:25:25",
            "link": "https://www.business-standard.com/world-news/singapore-passes-new-law-on-racial-harmony-to-check-foreign-interference-125020500072_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500072"
        },
        {
            "title": "If your salary is just above Rs 12 lakh, do you pay full tax of Rs 61,500?",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tBudget 2025 has proposed to make normal income up to Rs 12 lakh tax-free under the new tax regime for fiscal year 2025-26. This has become possible due to revised tax slabs and an enhanced rebate of Rs 60,000 under section 87A. However, ever since the announcement of revised tax slabs and rates under the new tax regime for FY 2025-26, there has been a lot of confusion about tax on incomes slightly above Rs 12 lakh. For example, what happens when a person is earning Rs 12.1 lakh or Rs 12.5 lakh?</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIf your salary is a little over Rs 12 lakh, say Rs 12.10 lakh, you might expect to pay Rs 61,500 in income tax.  However, due to marginal relief, you won’t pay the full tax. This relief ensures that your total tax liability doesn’t exceed the tax you would have paid if your income were exactly Rs 12 lakh. So, while your tax on Rs 12.10 lakh would normally be Rs 61,500, marginal relief reduces it to Rs 25,000 (plus cess), saving you a significant amount in tax.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Central Board of Direct Taxes (CBDT) has cleared the doubts, saying the total income till which marginal relief is available is near about Rs 12,75,000.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What is marginal tax relief?</strong></div>\n<div>\r\n\tMarginal tax relief is the relief provided by the income tax department when a person's income is marginally above the tax-free limit.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Marginal relief is a provision that grants relief to a taxpayer whose income may have just exceeded the threshold of a higher tax bracket so that he / she does not have to pay a tax higher than the additional income. While income up to Rs 12.75 lakh will be tax-free in the hands of salaried individuals by virtue of the slab rates and rebate along with the standard deduction of Rs 75,000, for non-salaried individuals, the benefit of a standard deduction will be available in the form of marginal relief making income up to Rs 12.75 lakh tax-free for the non-salaried individuals as well. However, marginal relief will not be available for income exceeding Rs 12.75 lakh,\" said SR Patnaik, Partner (Head - Taxation), Cyril Amarchand Mangaldas.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Let's see how much tax one has to pay with or without marginal relief on incomes of Rs 12.1 lakh, Rs 12.5 lakh, and Rs 12.7 lakh, according to CBDT.</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\n<strong>Examples of Tax Calculation with and without Marginal Relief</strong><small class=\"brtag\"> </small></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\n<strong>Rs 12.10 lakh income:</strong></div>\n<div>\r\n\tTax without relief: Rs 61,500</div>\n<div>\r\n\tTax with relief: Rs 10,000</div>\n<div>\r\n\t(Tax relief of Rs 51,500)</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rs 12.50 lakh income:</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\r\n\tTax without relief: Rs 67,500</div>\n<div>\r\n\tTax with relief: Rs 50,000</div>\n<div>\r\n\t(Tax relief of Rs 17,500)</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rs 12.70 lakh income:</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\r\n\tTax without relief: Rs 70,500</div>\n<div>\r\n\tTax with relief: Rs 70,000</div>\n<div>\r\n\t(Tax relief of Rs 500)</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rs 12.75 lakh income:</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\r\n\tTax without relief: Rs 71,250</div>\n<div>\r\n\tTax with relief: Rs 71,250</div>\n<div>\r\n\t(No relief at this level)</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>How is Marginal Relief Calculated?</strong></div>\n<div>\r\n\tFor an income of Rs 12.1 lakh, the tax payable without relief is Rs 61,500. This is broken down as follows:</div>\n<small class=\"brtag\"> </small>\n<ul>\n<li>\r\n\t\tRs 0 tax on the first Rs 4 lakh</li>\n<li>\r\n\t\t5% on Rs 4 lakh to Rs 8 lakh, amounting to Rs 20,000</li>\n<li>\r\n\t\t10% on Rs 8 lakh to Rs 12 lakh, amounting to Rs 40,000</li>\n<li>\r\n\t\t15% on Rs 12 lakh to Rs 12.1 lakh, amounting to Rs 1,500</li>\n</ul>\n<div>\r\n\tBut because of the Rs 60,000 rebate, tax on Rs 12 lakh is zero, and the marginal relief calculation is based on the excess income above Rs 12 lakh. For Rs 12.1 lakh, the excess income is Rs 10,000. The relief is calculated by subtracting Rs 10,000 from the total tax liability, reducing the tax payable to just Rs 10,0<strong>00.</strong><small class=\"brtagPara\"> </small>\n<div>\n<strong>Marginal relief is available to resident individuals whose income exceeds Rs 12 lakh but does not exceed Rs 12.75 lak</strong>h. If a taxpayer’s income exceeds Rs 12.75 lakh, marginal relief no longer applies, and they will be subject to the regular tax rates. <small class=\"brtagPara\"> </small>\n<div>\r\n\t\t\tMr X, with a gross taxable income of Rs 14 lakh, claims deductions of Rs 1.75 lakh ( standard deduction of Rs 75,000  and deduction under Section 80CCD (2) for the NPS contribution by an employer for Rs 1 lakh). Although his income exceeds Rs 12 lakh, he’s not eligible for a rebate under Section 87A. Without marginal relief, his tax liability would be Rs 63,750. However, due to marginal relief, he pays only Rs 25,000, plus a 4% cess, making his final tax Rs 26,000. Marginal relief applies up to Rs 12.75 lakh, after which full tax is due according to the new tax slabs.<small class=\"brtagPara\"> </small>\n<div>\n<strong>Rajarshi Dasgupta, Executive Director-Tax, AQUILAW explains the difference between salaried and non-salaried individuals and their tax exemptions:</strong></div></div></div></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div>\r\n\t\t\t\tUnion Budget 2025 has raised the income tax exemption threshold to INF 12 lakhs effectively making incomes up to this amount tax-free. For salaried individuals, this limit increases to INR 12.75 lakh after factoring in the standard deduction of Rs 75,000.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tFor non salaried individuals earning just above Rs 12 lakh also stand to benefit through a mechanism known as marginal relief which otherwise ensures </div>\n<div>\r\n\t\t\t\ttaxpayers with income slightly exceeding Rs 12 lakh but not above Rs 12.75 lakh are not subjected to disproportionately high tax rates. In simple words, marginal relief is available to resident individuals whose income exceeds Rs 12 lakh but does not exceed Rs 12.75 lakh. If a taxpayer’s income exceeds Rs 12.75 lakh, marginal relief no longer applies, and they will be subject to the regular tax rates.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tTo give an example, if a non-salaried individual earns Rs 12.1 lakh they would typically incur a tax liability of Rs 61,500 under the regular tax slabs. However, with marginal relief, this liability is substantially reduced to just Rs 10,000.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tNo marginal relief will be applicable if income exceeds Rs 12.75 lakh and will be taxed at normal slab rates.</div>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 13:20:32",
            "link": "https://www.business-standard.com/finance/personal-finance/if-your-salary-is-rs-12-10-lakh-do-you-have-to-pay-full-tax-of-rs-61-125020500219_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500219"
        },
        {
            "title": "Singapore passes new law on racial harmony, to check foreign interference",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tA new law consolidating existing statutes to preserve racial harmony and providing safeguards against foreign interference has been passed unanimously in the Singapore Parliament.</p>\n<p>\r\n\tNew safeguards against foreign interference will be introduced in multi-racial Singapore where some 300 clan and business associations are to be designated as race-based entities subject to disclosures, such as receiving foreign donations.</p>\n<p>\r\n\tThe law was passed on Tuesday.</p>\n<p>\r\n\tWhile the authorities already had powers to deal with conduct that threatened racial harmony, Home Affairs and Law Minister K. Shanmugam said the Bill brought these powers together in one place, while affirming the importance of racial harmony in the multi-ethnic city-state.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe new law empowers the authorities to issue restraining orders against individuals involved in making content that prejudices Singapore's racial harmony, taking close reference from the existing Maintenance of Religious Harmony Act (MRHA).</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tIt also introduces a community remedial initiative, which gives those who have committed less egregious race-related offences a chance to mend community ties in lieu of prosecution.</p>\n<p>\r\n\t\"We have always treated racial harmony as being fundamental in Singapore, and so this Bill has to be seen in that context, Shanmugam said.</p>\n<p>\r\n\t\"Multiracialism, underpinned by racial harmony, is a foundational principle for us,\" local media reports had the Minister as saying in the house.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tDuring the debate on the bill, Shanmugam sought to allay concerns that the legislative changes would curtail free speech.</p>\n<p>\r\n\tMembers of parliament had raised concerns that the Government's new power to issue restraining orders could stifle legitimate discourse and sought clarity on scenarios where this power would be used.</p>\n<p>\r\n\tMinister Shanmugam said the best evidence of how these powers are likely to be used is how the Government has used similar powers it has had since the MRHA was enacted in 1990.</p>\n<p>\r\n\tNo orders have been issued under the MRHA to date, but the legal framework means everyone understands what is not allowed in Singapore, he added.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"That gives you an indication of how the Government approaches these powers. The important thing is to have the powers, but also to be very, very careful and judicious in how you use them, he said.</p>\n<p>\r\n\tThe Minister cited a previous case where a preacher made highly disparaging remarks on YouTube about Buddhism and Taoism. Officials spoke to the preacher, who agreed to withdraw his remarks.</p>\n<p>\r\n\t\"We didn't need to resort to issuing an order... the fact that we had the power helped, and after that, others took reference from that (case), Shanmugam said.</p>\n<p>\r\n\tShanmugam said the scope of unacceptable conduct regarding race relations remains substantively the same, as offences under the new law cover what is already in the Penal Code.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tReferring to online comments that call for 'Palestine to be free', the Minister pointed out that these are not calls for violence here but expressions of opinion.</p>\n<p>\r\n\tResponding to a question, Shanmugam said acts that did not flout existing racial harmony laws will still not be offences, but added that there are other laws governing protected places and which regulate public assemblies.</p>\n<p>\r\n\t\"I would suggest, therefore, a careful understanding of the (Bill's) provisions. Otherwise, there is a serious risk that the public may be misled, he said.</p>\n<p>\r\n\tShanmugam noted that the new law has safeguards in place beyond the minister who issues the restraining order, as such an application would have to be sent to a new Presidential Council for Racial and Religious Harmony, which will make recommendations to the president on whether to confirm, cancel or vary the order.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe Minister said he agreed entirely that Singapore must remain open, and a consistent message by government leaders here over the last 60 years is that the nation must be open and interact with the world.</p>\n<p>\r\n\tYet, it also means that groups like clan associations can potentially be vectors of influence from countries that want to influence Singapore's politics, he added.</p>\n<p>\r\n\tThe authorities have engaged many race-based entities here, and they understand and accept the need for such safeguards, said Shanmugam.</p>\n<p>\r\n\tThe intent is to safeguard from malicious foreign influence, not to curtail legitimate exchanges, business deals or trade promotion activities conducted by our clan or business associations, he added.</p><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tGerald Giam, a member of parliament from the opposition Workers' Party had expressed concern that genuine dialogue about racial issues will be curtailed under the new Act, citing the examples of the Israeli-Palestinian conflict.</p>\n<p>\r\n\tThe scope of unacceptable conduct regarding race relations will remain substantially the same as today. There is, in fact, no change in the law, said Shanmugam.</p>\n<p>\r\n\tSome updates will be made to align the language and defences under the Bill with the equal provision. So, the changes are that we actually provided for some additional defences, and in fact, narrowed one of the provisions.</p>\n<p>\r\n\tWe agree entirely that Singapore must remain open. We must be able to reach out to the world. In fact, we have to for our success, said Shanmugam, responding to a question about the new Act deterring clans and business associations from interacting with foreigners and foreign entities altogether.</p><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tEconomically, we'll be finished if we don't interact. Socially, we are such a small place, we need to get ideas from outside, and then we need to adapt the ideas that work for us to our own situations, Channel News Asia quoted the Minister as responding to concerns raised by parliamentarians.</p>\n<p>\r\n\tThe main issue, he noted, is that those groups could potentially be vectors of influence from countries that want to influence our politics. Evidence from around the world gives Singapore some reasons to be concerned about this, said Shanmugam.</p>\n<p>\r\n\tHe likened the safeguards under the new Act to the Foreign Interference (Countermeasures) Act, which subjects MPs and Cabinet ministers to similar measures, to prevent them from being used in the same way by foreign actors.</p><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tNothing in the Bill is meant to suggest that foreign influence is in itself undesirable, and designation under this Bill as a race-based entity does not imply any wrongdoing, said Shanmugam.</p>\n<p>\r\n\tIt simply means that the entities or the entity has engaged in activities that relate to race, which sometimes is its raison d'etre.</p>\n<p>\r\n\tShanmugam emphasised that such clans and associations are important for Singapore. They play a constructive role in building social bonds and preserving traditions and cultures while strengthening business networks too, he said.</p><p></p></div>",
            "pub_date": "2025-02-05 13:20:31",
            "link": "https://www.business-standard.com/world-news/singapore-passes-new-law-on-racial-harmony-to-check-foreign-interference-125020500072_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500072"
        },
        {
            "title": "Aga Khan IV, spiritual leader of Ismailis and philanthropist, dies at 88",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Aga Khan, renowned for his success in horse racing, vast wealth, and global development efforts, passed away in Lisbon at the age of 88, as confirmed by the Aga Khan Development Network on X.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHis Highness Prince Karim Al-Hussaini, also known as the Aga Khan IV and the 49th hereditary imam of Shia Ismaili Muslims, died on Tuesday in Portugal, surrounded by his family. Both the Aga Khan Foundation and the Ismaili religious community shared this news on their websites. An announcement regarding his successor will be made at a later time. He is survived by three sons and one daughter.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<h3>\r\n\tA legacy of leadership</h3>\n<div>\r\n\tPrince Karim Aga Khan IV, viewed by his followers as a direct descendant of the Prophet Muhammad, became the community leader at a young age. His grandfather passed over his father in favour of him, believing that a younger leader would be better suited for guiding the Ismaili Muslim diaspora in the modern era.</div>\n<h3>\r\n\tA distinguished title and early leadership</h3>\n<div>\r\n\tIn July 1957, Queen Elizabeth bestowed the title \"His Highness\" upon him. This came shortly after Aga Khan III, his grandfather, named him heir to the 1,300-year-old dynasty of the Ismaili Muslim community. He officially became Aga Khan IV on October 19, 1957, in Dar es Salaam, Tanzania — the same location where his grandfather had once received gifts worth his weight in diamonds.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHaving left Harvard to be with his ailing grandfather, the Aga Khan returned to his studies after 18 months, now accompanied by an entourage and a deep sense of responsibility.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h3>\r\n\tRacehorse owner and billionaire</h3>\n<div>\r\n\tApart from his religious leadership, Aga Khan IV became synonymous with success in horse racing, owning the famous thoroughbred Shergar. His lifestyle was equally extravagant, marked by private jets, a $200 million super-yacht, and a private island in the Bahamas. His wealth was estimated to range from $800 million to $13 billion, stemming from his family inheritance, horse breeding business, and investments in tourism and real estate.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<h3>\r\n\tCommitment to global philanthropy</h3>\n<div>\r\n\tThe Aga Khan, who held citizenship in Britain, France, Switzerland, and Portugal, used his wealth to improve conditions in impoverished parts of the world. In a 2007 interview with The New York Times, he stated that poverty often leads to desperation and extremism, and that by assisting the poor through business, he was helping prevent these issues.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe scope of the Aga Khan’s financial empire is difficult to gauge, with some estimates placing his wealth in the billions. His community of Ismailis, originally based in India, considers it a religious duty to contribute up to 10 per cent of their income to him as their steward.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<h3>\r\n\tThe Ismailis</h3>\n<div>\r\n\tThe Ismailis are a distinct sect within Shia Islam, emerging in the 8th century from a schism regarding the rightful succession of leadership after the Prophet Muhammad's death. They derive their name from Imam Isma'il ibn Jafar, whom they recognise as the seventh Imam. This group emphasises the esoteric interpretation of Islam, focusing on the deeper, allegorical meanings of the Quran, which sets them apart from more literalist Islamic sects.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIsmailism developed during a period of significant political and religious upheaval in the Islamic world. Following the death of Muhammad ibn Isma'il, the movement evolved, leading to the establishment of the Fatimid Caliphate in the 10th century, which marked a peak in Ismaili political power and cultural influence.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIsmaili beliefs centre on the concept of an ongoing spiritual leadership through a line of Imams believed to be divinely appointed. The current leader is Karim Aga Khan IV, who plays a significant role in promoting social development and interfaith dialogue within and outside the community. The Ismailis practice a unique form of worship that differs from mainstream Islamic practices; for instance, they pray three times a day instead of five.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tToday, Ismailis are spread across more than 25 countries worldwide, with significant populations in India, Pakistan, Syria, Iran, and Canada. Their history in these regions often dates back over a millennium.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<em>(With agency inputs)</em></div></div>",
            "pub_date": "2025-02-05 13:15:26",
            "link": "https://www.business-standard.com/world-news/aga-khan-death-lisbon-leader-ismailis-125020500320_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500320"
        },
        {
            "title": "If your salary is just above Rs 12 lakh, do you pay full tax of Rs 61,500?",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tBudget 2025 has proposed to make normal income up to Rs 12 lakh tax-free under the new tax regime for fiscal year 2025-26. This has become possible due to revised tax slabs and an enhanced rebate of Rs 60,000 under section 87A. However, ever since the announcement of revised tax slabs and rates under the new tax regime for FY 2025-26, there has been a lot of confusion about tax on incomes slightly above Rs 12 lakh. For example, what happens when a person is earning Rs 12.1 lakh or Rs 12.5 lakh?</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIf your salary is a little over Rs 12 lakh, say Rs 12.10 lakh, you might expect to pay Rs 61,500 in income tax.  However, due to marginal relief, you won’t pay the full tax. This relief ensures that your total tax liability doesn’t exceed the tax you would have paid if your income were exactly Rs 12 lakh. So, while your tax on Rs 12.10 lakh would normally be Rs 61,500, marginal relief reduces it to Rs 25,000 (plus cess), saving you a significant amount in tax.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Central Board of Direct Taxes (CBDT) has cleared the doubts, saying the total income till which marginal relief is available is near about Rs 12,75,000.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What is marginal tax relief?</strong></div>\n<div>\r\n\tMarginal tax relief is the relief provided by the income tax department when a person's income is marginally above the tax-free limit.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Marginal relief is a provision that grants relief to a taxpayer whose income may have just exceeded the threshold of a higher tax bracket so that he / she does not have to pay a tax higher than the additional income. While income up to Rs 12.75 lakh will be tax-free in the hands of salaried individuals by virtue of the slab rates and rebate along with the standard deduction of Rs 75,000, for non-salaried individuals, the benefit of a standard deduction will be available in the form of marginal relief making income up to Rs 12.75 lakh tax-free for the non-salaried individuals as well. However, marginal relief will not be available for income exceeding Rs 12.75 lakh,\" said SR Patnaik, Partner (Head - Taxation), Cyril Amarchand Mangaldas.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Let's see how much tax one has to pay with or without marginal relief on incomes of Rs 12.1 lakh, Rs 12.5 lakh, and Rs 12.7 lakh, according to CBDT.</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\n<strong>Examples of Tax Calculation with and without Marginal Relief</strong><small class=\"brtag\"> </small></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\n<strong>Rs 12.10 lakh income:</strong></div>\n<div>\r\n\tTax without relief: Rs 61,500</div>\n<div>\r\n\tTax with relief: Rs 10,000</div>\n<div>\r\n\t(Tax relief of Rs 51,500)</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rs 12.50 lakh income:</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\r\n\tTax without relief: Rs 67,500</div>\n<div>\r\n\tTax with relief: Rs 50,000</div>\n<div>\r\n\t(Tax relief of Rs 17,500)</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rs 12.70 lakh income:</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\r\n\tTax without relief: Rs 70,500</div>\n<div>\r\n\tTax with relief: Rs 70,000</div>\n<div>\r\n\t(Tax relief of Rs 500)</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rs 12.75 lakh income:</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<div>\r\n\tTax without relief: Rs 71,250</div>\n<div>\r\n\tTax with relief: Rs 71,250</div>\n<div>\r\n\t(No relief at this level)</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>How is Marginal Relief Calculated?</strong></div>\n<div>\r\n\tFor an income of Rs 12.1 lakh, the tax payable without relief is Rs 61,500. This is broken down as follows:</div>\n<small class=\"brtag\"> </small>\n<ul>\n<li>\r\n\t\tRs 0 tax on the first Rs 4 lakh</li>\n<li>\r\n\t\t5% on Rs 4 lakh to Rs 8 lakh, amounting to Rs 20,000</li>\n<li>\r\n\t\t10% on Rs 8 lakh to Rs 12 lakh, amounting to Rs 40,000</li>\n<li>\r\n\t\t15% on Rs 12 lakh to Rs 12.1 lakh, amounting to Rs 1,500</li>\n</ul>\n<div>\r\n\tBut because of the Rs 60,000 rebate, tax on Rs 12 lakh is zero, and the marginal relief calculation is based on the excess income above Rs 12 lakh. For Rs 12.1 lakh, the excess income is Rs 10,000. The relief is calculated by subtracting Rs 10,000 from the total tax liability, reducing the tax payable to just Rs 10,0<strong>00.</strong><small class=\"brtagPara\"> </small>\n<div>\n<strong>Marginal relief is available to resident individuals whose income exceeds Rs 12 lakh but does not exceed Rs 12.75 lak</strong>h. If a taxpayer’s income exceeds Rs 12.75 lakh, marginal relief no longer applies, and they will be subject to the regular tax rates. <small class=\"brtagPara\"> </small>\n<div>\r\n\t\t\tMr X, with a gross taxable income of Rs 14 lakh, claims deductions of Rs 1.75 lakh ( standard deduction of Rs 75,000  and deduction under Section 80CCD (2) for the NPS contribution by an employer for Rs 1 lakh). Although his income exceeds Rs 12 lakh, he’s not eligible for a rebate under Section 87A. Without marginal relief, his tax liability would be Rs 63,750. However, due to marginal relief, he pays only Rs 25,000, plus a 4% cess, making his final tax Rs 26,000. Marginal relief applies up to Rs 12.75 lakh, after which full tax is due according to the new tax slabs.<small class=\"brtagPara\"> </small>\n<div>\n<strong>Rajarshi Dasgupta, Executive Director-Tax, AQUILAW explains the difference between salaried and non-salaried individuals and their tax exemptions:</strong></div></div></div></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div>\r\n\t\t\t\tUnion Budget 2025 has raised the income tax exemption threshold to INF 12 lakhs effectively making incomes up to this amount tax-free. For salaried individuals, this limit increases to INR 12.75 lakh after factoring in the standard deduction of Rs 75,000.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tFor non salaried individuals earning just above Rs 12 lakh also stand to benefit through a mechanism known as marginal relief which otherwise ensures </div>\n<div>\r\n\t\t\t\ttaxpayers with income slightly exceeding Rs 12 lakh but not above Rs 12.75 lakh are not subjected to disproportionately high tax rates. In simple words, marginal relief is available to resident individuals whose income exceeds Rs 12 lakh but does not exceed Rs 12.75 lakh. If a taxpayer’s income exceeds Rs 12.75 lakh, marginal relief no longer applies, and they will be subject to the regular tax rates.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tTo give an example, if a non-salaried individual earns Rs 12.1 lakh they would typically incur a tax liability of Rs 61,500 under the regular tax slabs. However, with marginal relief, this liability is substantially reduced to just Rs 10,000.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tNo marginal relief will be applicable if income exceeds Rs 12.75 lakh and will be taxed at normal slab rates.</div>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 13:15:26",
            "link": "https://www.business-standard.com/finance/personal-finance/if-your-salary-is-rs-12-10-lakh-do-you-have-to-pay-full-tax-of-rs-61-125020500219_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500219"
        }
    ]
}