{
    "data": [
        {
            "title": "US deports 205 Indian migrants amid Donald Trump's border crackdown",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tOn Tuesday, the United States deported (US) the first batch of undocumented Indian migrants, sending a US C-17 military aircraft carrying 205 Indian citizens who were residing illegally in the country. Punjab government officials said they would receive the 205 deported Indians, hailing from Punjab and neighboring states, at Amritsar airport. The aircraft is scheduled to land in Amritsar in the early hours of Wednesday.<small class=\"brtag\"> </small></div>\n<div>\r\n\tPunjab’s Minister for NRI (Non-Resident Indians) Affairs, Kuldeep Singh Dhaliwal, expressed disappointment over the US decision to deport these individuals. He stated that they had contributed to the US economy and should have been granted permanent residency instead of being deported. In a statement issued in Amritsar, Dhaliwal called the deportation of Indians from the US a “very serious” issue and said he plans to meet External Affairs Minister S Jaishankar next week to discuss the concerns of Punjabis living in the US.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tWhen asked about reports of the US aircraft carrying illegal immigrants landing in Amritsar, Director General of Police (DGP) Gaurav Yadav said the matter was discussed in a meeting in Chandigarh. “The CM (Bhagwant Mann) said that from the Punjab government’s side, we will receive our immigrants and set up counters for them at the airport,”|he stated. “We are in touch with the Centre. As and when information comes, we will share it,” the DGP added. Mann held a meeting in Chandigarh with police officials to discuss various issues.<small class=\"brtag\"> </small></div>\n<div>\r\n\tFormer US President Donald Trump has threatened trade action against countries that refuse to comply with his immigration policies. New Delhi has previously stated that it will take back any Indian citizens living illegally in the US after verifying their nationality. US authorities have identified nearly 18,000 Indians residing in the country without legal status.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tIndia has expressed its willingness to cooperate with the Trump administration on the issue while also seeking to protect the legal immigration of its skilled workers and students. Prime Minister Narendra Modi is scheduled to travel to Washington next week, where he will meet Trump. The two leaders spoke on January 27, discussing immigration, security cooperation, and bilateral trade ties. Following their conversation, Trump stated that India “will do what is right” regarding the deportation of illegal migrants from the US.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtag\"> </small>\r\n\tEarlier in the day, a US Embassy spokesperson in New Delhi said the US is rigorously enforcing its border policies, tightening immigration laws, and removing illegal migrants. \"These actions send a clear message: illegal migration is not worth the risk,\" he added.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLast month, the Ministry of External Affairs (MEA) reiterated its opposition to illegal immigration and confirmed that India would take back its citizens residing illegally in the US once their nationality is verified. MEA spokesperson Randhir Jaiswal stated on January 24 that India opposes illegal immigration due to its links to organized crime. \"We will take them back, provided documents are shared with us so we can verify their nationality and confirm they are indeed Indians,\" he said. However, Jaiswal also noted that it would be \"premature\" to discuss the exact number of illegal Indian immigrants in the US.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA US Department of Homeland Security report published last year estimated the number of illegal Indian immigrants in the US at around 220,000 as of 2022.</div></div>",
            "pub_date": "2025-02-05 02:20:27",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/us-deports-205-indian-migrants-amid-donald-trump-s-border-crackdown-125020401718_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401718"
        },
        {
            "title": "US-China trade war may open new opportunities for Indian exporters",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<div>\r\n\t\tThe restart of a tariff war between the United States (US) and China may have a positive impact on Indian exporters, as observed from the previous trade war during US President <a href=\"https://www.business-standard.com/topic/donald-trump\" target=\"_blank\">Donald Trump</a>’s first term.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“When the trade war between the US and China took place last time, India was the fourth largest beneficiary of the trade diversion. Data shows that during the trade war (2017-19), there was a significant jump in exports to the US,” a senior government official said.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\tDays after taking over as President of the US, Trump on Saturday announced a 25 per cent tariff on imports from its top two trade partners and neighbouring nations — Canada and Mexico — and a 10 per cent levy on Chinese imports.</div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tWhile Canada and Mexico retaliated, on Monday, a 30-day suspension on US tariffs was announced after reaching an agreement with Trump.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\tHowever, China on Tuesday announced retaliation and said the country plans to impose higher tariffs on US imports.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\t\tTrump’s move is in line with its protectionist ‘America First Trade Policy’ that it plans to implement. The policy will include imposition of global ‘supplemental tariffs’ to tackle ‘unfair and unbalanced trade’.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tAn external revenue service (ERS) is also being set up to collect tariff, duties and other foreign-related revenues.</div>\n<div>\r\n\t\tHowever, the official warned that going ahead, India may not be completely ‘immune’ from additional tariffs from the US, considering Trump’s announcement of America’s latest policy stance.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\t\tExporters have also stated that the imposition of Customs duties by the US on imports from China provides huge export opportunities for them.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe tariffs would affect exports from China to the US as they would push up prices of their goods in the American market, making them less competitive.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\tOfficials said sectors such as electronics, pharmaceuticals, textiles, auto components and chemicals may see further export boost to the US due to the trade war between Washington and Beijing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tTrade between India and the US is robust and has been growing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tDuring the financial year 2023-24, the size of the bilateral merchandise trade between both the nations stood at nearly $120 billion. The trade balance has been in favour of India, with a surplus of $35.3 billion. The US is also India’s largest trade partner.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small></div>\n<small class=\"brtagPara\"> </small> <small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 02:20:27",
            "link": "https://www.business-standard.com/economy/news/us-china-trade-war-may-open-new-opportunities-for-indian-exporters-125020401443_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401443"
        },
        {
            "title": "Bhavish Aggarwal injects Rs 2K cr into Krutrim, open-sources its AI",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tOla founder Bhavish Aggarwal on Tuesday announced an investment of Rs 2,000 crore in his artificial intelligence (AI) firm, Krutrim, with a commitment to invest an additional Rs 10,000 crore by next year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurthermore, he announced the launch of KritrimAI lab and said that India’s first AI unicorn has released its work to the open-source community, while publishing several technical reports. This move follows DeepSeek’s recent decision to open-source its own generative AI (GenAI) model.<small class=\"brtag\"> </small></div>\n<div>\r\n\tWith this latest investment, Krutrim has raised close to $280 million.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThis includes the Rs 2,000 crore (approximately $230 million), and the $50 million secured from Matrix Partners India in early 2024. According to sources, the latest funds were raised through a mix of equity and debt. The company declined to comment on the specifics of the fundraising.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tIn India's GenAI ecosystem, Sarvam AI is the only other player to have secured funding, raising $41 million in 2023 in a round led by Lightspeed, with participation from Peak XV Partners and Khosla Ventures. Hanooman, another firm developing small language models (SLMs), has also been exploring funding opportunities.<small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\t In a X post, Aggarwal said: “We’ve been working on AI for a year; today we’re releasing our work to the open source community and also publishing a bunch of technical reports. Our focus is on developing AI for India -- to make AI better on Indian languages, data scarcity, cultural context, etc.”<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tHe further noted that Krutrim has deployed India’s first GB200 system in partnership with Nvidia, which will be operational by March. “…and we will make it the largest supercomputer in India by end of year,” stated the founder of Ola Electric and Ola Mobility.<small class=\"brtagPara\"> </small>\n<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"Chart\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"Chart\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/04/full/1738692635-679.jpg\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span></div>\n<small class=\"brtag\"> </small></div>\n<div>\r\n\tIn a separate post on January 31, Aggarwal noted that Krutrim is utilising the DeepSeek model. “India can’t be left behind in AI. @Krutrim has accelerated efforts to develop world-class AI… Our cloud now has DeepSeek models live, hosted on Indian servers. Pricing lowest in the world,” he wrote. He added that thousands of developers have already accessed DeepSeek models hosted on Krutrim’s cloud.<small class=\"brtag\"> </small></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tTuesday’s announcement of the AI lab is a milestone for Krutrim, marking the first time the company has shared its models with the open-source community. Until now, Krutrim had not disclosed details about its GenAI models.<small class=\"brtag\"> </small></div>\n<div>\r\n\tAmong the models released to the open-source community are Krutrim 2 and Krutrim 1, both large language models (LLMs). “While Krutrim 1 (India’s first LLM) was launched on January 24, it was a basic 7B model. We’re launching Krutrim 2 today as a much improved model,” said Aggarwal. The company claims that Krutrim 2 is a best-in-class LLM for Indic languages.<small class=\"brtag\"> </small></div>\n<div>\r\n\t“Krutrim-2 is a 12 billion parameters dense transformer model, built on the Mistral-NeMo architecture. Our team ensured that Krutrim-2 received comprehensive training on a rich dataset encompassing English, Indic languages (hundreds of billions of tokens), code snippets, mathematical concepts, literary works, and high quality synthetically generated content. It is natively multilingual (English and 22 Indian languages) and supports a context window of 128K tokens,” said the firm’s blog.<small class=\"brtag\"> </small></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tKrutrim also introduced Chitrarth 1, a vision-language model built on Krutrim 1, capable of interpreting images and documents. Additionally, the firm unveiled Dhwani 1, a speech-language model designed for tasks such as speech translation, and announced Vyakhyarth 1, an art Indic Embedding model for use cases like search and retrieval-augmented generation (RAG).<small class=\"brtag\"> </small></div>\n<div>\r\n\tAggarwal further announced the development of benchmarks to assess Indian LLM performance. “Since there was no global benchmark for Indic performance, we’ve developed ‘BharatBench,’” he said. This evaluation tool is designed to assess AI models’ effectiveness in Indian languages and cultural contexts.<small class=\"brtag\"> </small></div>\n<div>\r\n\tWhether BharatBench will gain acceptance among other Indian AI developers remains to be seen. Krutrim argued that existing benchmarks in English and Chinese, such as MMLU, ARC, and TruthfulQA, fail to capture India's linguistic and cultural nuances. \"There is a specific need for a benchmark that addresses the diversity of India,” explained the startup.<small class=\"brtag\"> </small>\n<div></div></div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><div><blockquote class=\"blockquoteBG styleQ1\" style=\"background-color:#FFF5EB;padding:8px;overflow:hidden\">\n<p>\r\n\t\t\t </p>\n<p>\n<strong>Players building AI in India</strong><span style=\"white-space:pre\"><strong> </strong></span><small class=\"brtag\"> </small></p>\n<p>\r\n\t\t\tOla Krutrim: Creating AI <span style=\"white-space:pre\"> </span>computing stack, which includes GPU, language hub, Silicon </p>\n<p>\n<small class=\"brtag\"> </small>\r\n\t\t\tSarvam AI: Full stack GenAI for population scale; working on 11 Indic languages</p>\n<p>\n<small class=\"brtag\"> </small>\r\n\t\t\tHanooman AI: Multilingual AI platform, understands 98 languages</p>\n<p>\n<small class=\"brtag\"> </small>\n<em>Sources: News report, company release</em></p>\n</blockquote></div>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 02:15:31",
            "link": "https://www.business-standard.com/companies/news/ola-founder-bhavish-aggarwal-to-invest-rs-2-000-crore-in-ai-firm-krutrim-125020400838_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400838"
        },
        {
            "title": "Day before polls, Kejriwal booked in Haryana for 'poison in Yamuna' remark",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tA case has been registered Haryana's Kurukshetra district against AAP supremo Arvind Kejriwal in connection with his \"poison in Yamuna\" remark in on Tuesday.</p>\n<p>\r\n\tThe development comes a day before the assembly polls in Delhi.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/elections/delhi-elections/kejriwal-responds-to-ec-notice-on-yamuna-water-controversy-submits-report-125013100792_1.html\" target=\"_blank\">Kejriwal responds to EC notice on Yamuna water controversy, submits report</a></strong></div>\n<p>\r\n\tAs per the FIR, the case has been registered against the former Delhi chief minister and other unknown members of the Aam Aadmi Party at Shahabad police station on a complaint filed by Kurukshetra resident and advocate Jagmohan Manchanda on Tuesday.</p>\n<p>\r\n\tKejriwal has been under fire from the BJP for his \"poison in Yamuna\" remark with the saffron party leaders criticising him for his \"irresponsible\" statement.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe BJP leaders had accused Kejriwal of spreading fear not only among Delhi's people but also among Haryana's citizens with his false claims.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe case has been registered under sections including 192 (penalizes those who maliciously or wantonly provoke others with the intent to incite a riot), 196 (1) (promoting enmity between different groups on ground of religion, race) and 299 (deliberate and malicious acts, intended to outrage religious feelings of any class by insulting its religion or religious beliefs) of the Bharatiya Nyaya Sanhita.</p>\n<p>\r\n\tThe complainant accused Kejriwal of making provocative statements and wild allegations against the state of Haryana including Haryana government and the BJP.</p>\n<p>\r\n\tManchanda in his complaint alleged that Kejriwal, in conspiracy with other members of AAP, has given such provocative, false and misleading statements with \"an ulterior motive and desperation to cause havoc and riots in Delhi and Haryana which would sway some votes towards him\".</p>\n<p>\r\n\tKejriwal deliberately, intentionally and consciously has given this false statement, the complainant alleged.</p>\n<p>\r\n\tThe case was registered following a complaint lodged by the complainant in a court of the sub-divisional magistrate in Shahabad.</p>\n<p>\r\n\tThe AAP had earlier accused the ruling BJP in Haryana of intentionally draining industrial waste into the Yamuna, with Kejriwal alleging that it was trying to kill people by \"mixing poison\" in the river.</p>\n<p>\r\n\tDelhi Chief Minister Atishi had also alleged that the BJP is \"deliberately disrupting\" Delhi's water supply as a \"historic loss\" awaits the saffron party in the February 5 assembly polls in the national capital.</p>\n<p>\r\n\tKejriwal had alleged that the BJP is trying to keep the people of Delhi thirsty as it indulges in \"dirty politics\".</p>\n<p>\r\n\t\"BJP people in Haryana are mixing poison in the water and sending it to Delhi. If people in Delhi drink this water, many will die.</p>\n<p>\r\n\tCan anything be more disgusting than this? \"The poison that is being mixed in the water cannot even be cleaned in water treatment plants. For the safety of the people of Delhi, the water supply has to be stopped in many areas,\" Kejriwal had said in a post on X recently.</p><p></p></div>",
            "pub_date": "2025-02-05 02:15:29",
            "link": "https://www.business-standard.com/elections/delhi-elections/day-before-polls-kejriwal-booked-in-haryana-for-poison-in-yamuna-remark-125020401781_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401781"
        },
        {
            "title": "Bank gold loan disbursals up 71.3% to Rs 1.72 trillion in 9MFY25",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tGold loan portfolio of banks rose by 71.3 per cent year-on-year (Y-o-Y) till December of the current financial year (FY25) to Rs 1.72 trillion, compared to 17 per cent growth a year ago, on the back of rising prices of the yellow metal and slowdown in unsecured loan following increase in risk weights last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Over the last year, gold loan growth has sharply increased, with a 68 per cent rise from April 2024 to December 2024 (M9FY25), while gold prices increased by around 21 per cent during the time,” said Ajit Velonie, senior director, Crisil Ratings.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“There has also been a partial slowdown in unsecured loan growth due to stricter regulations. The growth in gold loans has coincided with this period. Personal loans grew by only 5-6 per cent, compared to 16.5 per cent in the previous year. The slower growth in unsecured loans has likely led borrowers to turn to gold loans as an alternative,” said Velonie.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn November 2023, the Reserve Bank of India (RBI) increased risk weight for unsecured loans by 25 percentage points to 125 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe personal loans segment showed 9.7 per cent growth in December 2024, compared to 20.8 per cent in December 2023. Credit card loans also saw moderation in growth at 15.6 per cent in December 2024, down from 32.6 per cent a year ago.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBank credit growth in the retail loan segment, including housing, vehicle, credit cards, and personal loans, dropped to 14.9 per cent Y-o-Y in December 2024, down from 17.6 per cent in December 2023.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe gold loan prices increased by 20.4 per cent to Rs 75,857 per 10 gram in December 2024 from Rs 62,993 per 10 gram in the year-ago period.<small class=\"brtagPara\"> </small>\n<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"Chart\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"Chart\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/04/full/1738692233-9615.jpg\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Factors contributing to the rise in gold loans include rising prices of the yellow metal, as the value of loans taken against jewellery also increases amid rise in gold prices. People with gold jewellery are also borrowing more to refinance their loans as the value of gold increases,” said Kirti Timmanagoudar, head of strategy and co-lending, IIFL Finance.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The crackdown on unsecured lending and stress in the MFI space might also be contributing factors. It is likely a cumulative effect of these elements, rather than one factor being responsible,” said Timmanagoudar.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording RBI data, since May 2024, one bank has changed the classification of agricultural loan into “Loans against gold jewellery” under the retail segment.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Loans previously classified as agricultural are now being treated as gold loans. This reclassification might explain the slower growth in agricultural loans, which have only grown by 8 per cent compared to previous years,” Timmanagoudar added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The slowdown in supply of unsecured lending might give an impetus but gold loan has been witnessing an upward trajectory due to its own features. Today it is a popular choice among customers, especially for short-term requirements, and acts as a vital financial inclusion tool,” said Shaji Varghese, chief executive officer (CEO), Muthoot FinCorp.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe December edition of the financial stability report (FSR) of the RBI observed the rapid increase in gold loan disbursals during the period ending September 2024 compared to the same time period last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTo address the non-adherence to prudential guidelines by the supervised entities (SEs) in grant of loans against pledge of gold ornaments and jewellery, the RBI has advised SEs to comprehensively review their policies, identify gaps, and implement corrective measures within a specified timeframe.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 02:10:29",
            "link": "https://www.business-standard.com/industry/banking/gold-loan-portfolio-of-banks-jumps-71-3-to-rs-1-72-trillion-till-dec-2024-125020401498_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401498"
        },
        {
            "title": "About 10 persons killed in shooting at adult education centre in Sweden",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tSwedish police said that about 10 people, including the gunman, were killed during a shooting Tuesday at an adult education centre. But a final death toll and a conclusive number of wounded hadn't yet been determined.</p>\n<p>\r\n\tThe damage at the crime scene was so extensive that investigators were unable to be more definitive, said Roberto Eid Forest, head of the local police. The shooting happened on the outskirts of the city of Orebro, which is located about 200 km (125 miles) west of Stockholm.</p>\n<p>\r\n\tEid Forest told reporters that one of those killed was the suspected perpetrator. Police believe the perpetrator acted alone. He wasn't previously known to police, officials said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe school, called Campus Risbergska, serves students who are over age 20, according to its website. Primary and upper secondary school courses are offered, as well as Swedish classes for immigrants, vocational training and programs for people with intellectual disabilities.</p>\n<p>\r\n\tPolice said that there were no suspected connections to terrorism at this point. Authorities were working to identify the deceased.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tGun violence at schools is very rare in Sweden. But there have been several incidents in recent years in which people were wounded or killed with other weapons such as knives or axes.</p>\n<p>\r\n\tPrime Minister Ulf Kristersson will hold a news conference at 7:30 pm local time (1830 GMT) alongside Justice Minister Gunnar Strmmer.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe shooting erupted after many students had gone home following a national exam. Police vehicles and ambulances, lights flashing, blanketed the parking lots and streets around the school as a helicopter buzzed overhead.</p>\n<p>\r\n\tTeacher Lena Warenmark told SVT News that there were unusually few students on the campus Tuesday afternoon after the exam. She also told the broadcaster that she heard probably 10 gunshots.</p>\n<p>\r\n\tStudents sheltered in nearby buildings. Other parts of the school were evacuated following the shooting, which began at around 12:30 pm local time (1130 GMT).</p><p></p></div>",
            "pub_date": "2025-02-05 02:10:28",
            "link": "https://www.business-standard.com/world-news/about-10-persons-killed-in-shooting-at-adult-education-centre-in-sweden-125020401826_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401826"
        },
        {
            "title": "Two-thirds of sectoral indices still a premium to 10-year averages",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tDespite the benchmark indices falling over 10 per cent from their highs, two-thirds of sectoral indices still trade at a premium to their 10-year average price-to-earnings (P/E) multiples, according to a report by domestic brokerage Motilal Oswal.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmong the sectors commanding the highest premiums are infrastructure, utilities, and consumer durables. Conversely, media, banks, and auto companies are trading at a discount to their historical averages.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmong prominent sectors, IT is trading at a premium, while banks are available at a discount. Consumer stocks are largely in line with their long-term averages.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe IT sector, with a P/E ratio of 27.6x, is trading at a 31% premium. This premium is driven by guidance upgrades from most software exporters following their third-quarter results.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The commentary in pockets turned incrementally positive, and we believe the tech spending recovery—primarily driven by BFSI over the past six months—is now expanding into other verticals such as hi-tech and retail,” Motilal Oswal observed.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPrivate banks are currently trading at a price-to-book (P/B) ratio of 2.2x, compared to their historical average of 2.5x, indicating a discount. “Loan growth stood at 11.5 per cent, down from its peak of 18 per cent, as the deposits market remains competitive. Additionally, a higher credit-deposit ratio is constraining loan growth, while stress in unsecured persists. Deposits growth stood steady, while the CASA ratio is expected to see a negative bias amid faster growth in term deposits,” noted the brokerage.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe consumer sector's P/E and P/B ratios are currently at 42.9x and 10.4x, respectively, which are in line with their 10-year averages. However, the sector faces challenges- demand recovery continues to be delayed, with urban consumption under pressure. Margins are also strained due to high food inflation and rising palm oil prices. To offset these pressures, companies are implementing price hikes.<small class=\"brtagPara\"> </small>\n<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"Two-thirds of sectoral indices still a premium to 10-yr averages\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"Two-thirds of sectoral indices still a premium to 10-yr averages\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/04/full/1738692079-6069.jpg\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span></div>\n</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 02:05:28",
            "link": "https://www.business-standard.com/markets/news/two-thirds-of-sectoral-indices-still-a-premium-to-10-yr-averages-125020400946_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400946"
        },
        {
            "title": "Bank gold loan disbursals up 71.3% to Rs 1.72 trillion in 9MFY25",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tGold loan portfolio of banks rose by 71.3 per cent year-on-year (Y-o-Y) till December of the current financial year (FY25) to Rs 1.72 trillion, compared to 17 per cent growth a year ago, on the back of rising prices of the yellow metal and slowdown in unsecured loan following increase in risk weights last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Over the last year, gold loan growth has sharply increased, with a 68 per cent rise from April 2024 to December 2024 (M9FY25), while gold prices increased by around 21 per cent during the time,” said Ajit Velonie, senior director, Crisil Ratings.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“There has also been a partial slowdown in unsecured loan growth due to stricter regulations. The growth in gold loans has coincided with this period. Personal loans grew by only 5-6 per cent, compared to 16.5 per cent in the previous year. The slower growth in unsecured loans has likely led borrowers to turn to gold loans as an alternative,” said Velonie.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn November 2023, the Reserve Bank of India (RBI) increased risk weight for unsecured loans by 25 percentage points to 125 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe personal loans segment showed 9.7 per cent growth in December 2024, compared to 20.8 per cent in December 2023. Credit card loans also saw moderation in growth at 15.6 per cent in December 2024, down from 32.6 per cent a year ago.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBank credit growth in the retail loan segment, including housing, vehicle, credit cards, and personal loans, dropped to 14.9 per cent Y-o-Y in December 2024, down from 17.6 per cent in December 2023.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe gold loan prices increased by 20.4 per cent to Rs 75,857 per 10 gram in December 2024 from Rs 62,993 per 10 gram in the year-ago period.<small class=\"brtagPara\"> </small>\n<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"Chart\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"Chart\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/04/full/1738692233-9615.jpg\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Factors contributing to the rise in gold loans include rising prices of the yellow metal, as the value of loans taken against jewellery also increases amid rise in gold prices. People with gold jewellery are also borrowing more to refinance their loans as the value of gold increases,” said Kirti Timmanagoudar, head of strategy and co-lending, IIFL Finance.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The crackdown on unsecured lending and stress in the MFI space might also be contributing factors. It is likely a cumulative effect of these elements, rather than one factor being responsible,” said Timmanagoudar.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording RBI data, since May 2024, one bank has changed the classification of agricultural loan into “Loans against gold jewellery” under the retail segment.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Loans previously classified as agricultural are now being treated as gold loans. This reclassification might explain the slower growth in agricultural loans, which have only grown by 8 per cent compared to previous years,” Timmanagoudar added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The slowdown in supply of unsecured lending might give an impetus but gold loan has been witnessing an upward trajectory due to its own features. Today it is a popular choice among customers, especially for short-term requirements, and acts as a vital financial inclusion tool,” said Shaji Varghese, chief executive officer (CEO), Muthoot FinCorp.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe December edition of the financial stability report (FSR) of the RBI observed the rapid increase in gold loan disbursals during the period ending September 2024 compared to the same time period last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTo address the non-adherence to prudential guidelines by the supervised entities (SEs) in grant of loans against pledge of gold ornaments and jewellery, the RBI has advised SEs to comprehensively review their policies, identify gaps, and implement corrective measures within a specified timeframe.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 02:05:28",
            "link": "https://www.business-standard.com/industry/banking/gold-loan-portfolio-of-banks-jumps-71-3-to-rs-1-72-trillion-till-dec-2024-125020401498_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401498"
        },
        {
            "title": "Hamas officials say they've started talks on second phase of ceasefire",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tHamas officials on Tuesday said they've begun talks with international mediators over the second phase of the ceasefire while claiming Israel hasn't abided by some of the terms of the first phase.</p>\n<p>\r\n\tAbdel-Latif al-Qanoua, a spokesperson for the militant group, said Tuesday that it had started communications and negotiations over the next phase, which is expected to include further hostage releases and Israel's withdrawal from the Gaza Strip.</p>\n<p>\r\n\tThe group also claimed in a statement Tuesday that Israel had delayed and obstructed the flow of aid into the enclave.</p>\n<p>\r\n\t\"What has been implemented in these aspects is much less than what was agreed on, Hazem Qassam, the group's spokesperson, said in a statement.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tNegotiations of the ceasefire's second phase were set to begin Monday. Netanyahu's office said Tuesday that he would send a delegation to Qatar this weekend to continue negotiations.</p>\n<p>\r\n\tNetanyahu is in Washington, where he met with Trump's Mideast envoy Steve Witkoff on Monday and was set to meet Trump on Tuesday.</p>\n<p>\r\n\tThe second phase is expected to be more difficult to negotiate than the first phase agreement. Israel has said it won't agree to a complete withdrawal from Gaza until Hamas' military and political capabilities are eliminated. Hamas says it won't hand over the last hostages until Israel removes all troops from the territory.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 02:00:39",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/hamas-officials-say-they-ve-started-talks-on-second-phase-of-ceasefire-125020401816_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401816"
        },
        {
            "title": "Ujjivan SFB applies for a universal banking licence to expand offerings",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tUjjivan Small Finance Bank (SFB) on Tuesday said it has submitted an application to the Reserve Bank of India (RBI) seeking a universal banking licence to strengthen its offerings and its position in the sector.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Bengaluru-based lender is the second SFB after AU SFB to apply for a universal banking licence under the voluntary transition route.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The Bank has consistently demonstrated strong financial performance and a commitment to financial inclusion, serving a diverse customer base across the country. Securing the universal banking licence, if approved, will strengthen Ujjivan’s efforts to provide holistic financial services to its customers and empower all aspiring Indians with a wider range of banking solutions,” said Sanjeev Nautiyal, MD &amp; CEO, Ujjivan SFB.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUjjivan SFB, which started operations in February 2017, has about 9.3 million customers through its 753 branches spread across 26 states and union territories in the country. As of December 31, 2024, its gross loan book stands at Rs 30,466 crore, and its deposits stand at Rs 34,494 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The diversification of the loan book has seen accelerated results, with the secured segment contributing 39 per cent to the overall loan book,” the bank said in a statement.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to RBI norms, to be eligible for conversion into a universal bank, these banks must have a minimum net worth of Rs 1,000 crore, hold scheduled status, and have a satisfactory track record of at least five years. Additionally, they must maintain a gross non-performing asset (NPA) ratio of 3 per cent or less and a net NPA ratio of 1 per cent or less over the past two financial years. Additionally, the norms say only listed small finance banks will qualify.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, these must also have reported a net profit in the past two financial years and meet the prescribed capital adequacy norms. The RBI also requires these SFBs to provide a detailed rationale for their conversion into a universal bank, with preference given to those with a diversified loan portfolio.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, Bengaluru-based Jana Small Finance Bank is also harboring ambitions of transitioning into a universal bank. The bank has made additional or accelerated provisions to keep its gross and net non-performing assets (NPA) within the regulatory requirement of 3 per cent and 1 per cent respectively.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 02:00:38",
            "link": "https://www.business-standard.com/industry/banking/ujjivan-sfb-applies-for-a-universal-banking-licence-to-expand-offerings-125020401318_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401318"
        }
    ]
}