{
    "data": [
        {
            "title": "HFCL shares down 3% after posting Q3 results; PAT down 10%; revenue 2%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tHFCL shares slipped 3.2 per cent on Tuesday, logging an intraday low at Rs 98.25 per share on BSE. The selling pressure in the stock came after the company posted its Q3 results.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAround 12:59 PM, HFCL share price was down 1.51 per cent at Rs 100.01 per share on BSE. In comparison, the BSE Sensex was up 1.17 per cent at 78,091.81. The market capitalisation of the company stood at Rs 14,501.75 crore. The 52-week high of the stock was at Rs 171 per share and the 52-week low was at Rs 81.25 per share. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company released its Q3 results on Monday after market hours. HFCL reported 10 per cent decline in net profit to Rs 74 crore as compared to Rs 82.24 crore a year ago. The company's revenue for the quarter under review declined 2 per cent at Rs 1,011.95 crore as compared to Rs 1,032.31 crore a year ago. <small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/companies/results/hfcl-q3-results-pat-dips-11-95-to-rs-72-58-cr-revenue-at-rs-1-011-95-cr-125020301194_1.html\" target=\"_blank\">HFCL Q3 results: PAT dips 11.95% to Rs 72.58 cr, revenue at Rs 1,011.95 cr</a></strong></div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Despite a dynamic and challenging market environment, HFCL has demonstrated resilience with a stable quarterly performance. Our unwavering commitment to innovation and strategic growth continues to drive us forward. The recent BharatNet order wins are a testament to our expertise in strengthening India’s digital infrastructure, reinforcing our position as a trusted technology partner in the Country’s broadband revolution\" said Mahendra Nahata, managing director, HFCL.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNahata added: As we move ahead, HFCL remains focused on expanding its technological capabilities, fostering innovation, and delivering value to our stakeholders. We are confident that our strategic initiatives will create long-term sustainable growth and strengthen our leadership in the industry.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHFCL is a technology company specialising in creating digital networks for telcos, enterprises, and governments. Over the years, HFCL has emerged as a trusted partner offering sustainable high tech solutions with a commitment to provide the latest technology products to its customers. The company’s in-house reserach and development (R&amp;D) centers located at Gurgaon, Bengaluru and Hyderabad along with invested R&amp;D houses and other R&amp;D collaborators at different locations in India and abroad, innovate a futuristic range of technology products and solutions. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the past one year, HFCL shares have gained 3.3 per cent against Sensex's rise of 7.6 per cent. </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 16:10:28",
            "link": "https://www.business-standard.com/markets/news/hfcl-shares-down-3-after-company-posts-q3-results-pat-down-125020400638_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400638"
        },
        {
            "title": "Subhash Ghai buys Rs 24 cr flat in same building as Sonakshi Sinha's sale",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tBollywood director Subhash Ghai along with his wife Mukta Ghai has bought an apartment in Bandra West, Mumbai, for Rs 24 crore, according to property registration documents reviewed by Square Yards on the website of Inspector General of Registration (IGR) https://igrmaharashtra.gov.in. The transaction was registered in February 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe property bought by Ghai along with his wife is located in 81 Aureate, a project by MJ Shah Group, spread across 4.48 acres and featuring 4 BHK apartments. As per the IGR property registration documents reviewed by Square Yards, the apartment has a carpet area of 4,364 sq. ft. (405.42 sq. m.) and a built-up area of 486.69 sq. m. (~5,239 sq. ft.). It also includes three car parking spaces. The transaction incurred a stamp duty payment of Rs 1.44 crore and registration charges of Rs 30,000.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn January, actress Sonakshi Sinha sold her apartment in the same project for Rs 22.5 crore, noted Square Yards. As per the registration documents, the actress brought this apartment in March 2020 for around Rs 14 crore and sold it in January this year for Rs 22.50 crore. With this, Sinha earned a profit of around 61 per cent after the deal was finalised. According to the IGR documents reviewed by Square Yards, the apartment features a carpet area of 391.2 sq. m. (approximately 4,211 sq. ft.) and a built-up area of 430.32 sq. m. (around 4,632 sq. ft.), along with three designated parking spaces. The transaction involved a stamp duty of Rs 1.35 crore and registration fees of Rs 30,000.  Notably, Sinha owns one more apartment in 81 Aureate, as per IGR property registration records.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to Square Yards Project Data Intelligence, eight transactions amounting to a gross transaction value of Rs 76 crore were registered with IGR in 81 Aureate between February 2024 and January 2025. Currently, the average resale property price for a 4BHK in the project stands at Rs 51,636 per sq.ft. while the average monthly asking rent is Rs 8.5 lakh.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBandra’s proximity to Bandra Kurla Complex (BKC), Mumbai’s key commercial hub, makes it an attractive residential option for corporate executives and business owners seeking minimal commute times. Connectivity is a major advantage, with the Western Express Highway, Bandra-Worli Sea Link, international airport, and the upcoming metro enhancing accessibility. Bollywood stars such as Suniel Shetty, Ranveer Singh, and Deepika Padukone, Sonakshi Sinha along with sports personalities like KL Rahul and Athiya Shetty, also own properties in this neighbourhood.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSubhash Ghai is an Indian film director, producer, actor, lyricist, music director, and screenwriter known for his work in Hindi cinema. He has directed and produced several films across different genres. His notable works include Kalicharan (1976), Vishwanath (1978), Karz (1980), Hero (1983), Vidhaata (1982), Meri Jung (1985), Karma (1986), Ram Lakhan (1989), Saudagar (1991), Khalnayak (1993), Pardes (1997), and Taal (1999). His films are known for their storytelling, music, and character-driven narratives.</div></div>",
            "pub_date": "2025-02-04 16:10:28",
            "link": "https://www.business-standard.com/finance/personal-finance/bollywood-director-subhash-ghai-wife-buy-rs-24-crore-flat-in-bandra-west-125020400626_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400626"
        },
        {
            "title": "Mobikwik shares slip 5% after company posts net loss against profit YoY",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tMobikwik shares slumped 3.2 per cent on Tuesday, logging an intraday low at Rs 385.65 per share on BSE. The selling pressure in the stock came after the company posted its <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">Q3 results</a>.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAround 1:11 PM, <a href=\"https://www.business-standard.com/markets/one-mobikwik-systems-ltd-share-price-68099.html\" target=\"_blank\">Mobikwik share price</a> was down 1.49 per cent at Rs 400.2 per share on BSE. In comparison, the BSE Sensex was up 1.17 per cent at 78,091.81. The market capitalisation of the company stood at Rs 3,109.01 crore. The 52-week high of the stock was at Rs 698.3 per share and the 52-week low was at Rs 366.85 per share. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company released its Q3 results on Tuesday during market hours. The company reported a consolidated net loss to Rs 55.28 crore as compared to a profit of Rs 5.27 crore a year ago. Mobikwik's revenue for the quarter under review rose 17.7 per cent at Rs 269.47 crore as compared to Rs 228.93 crore a year ago. <small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/companies/results/mobikwik-posts-rs-3-59-crore-loss-in-q2fy25-total-income-grows-42-125010700679_1.html\" target=\"_blank\">MobiKwik posts Rs 3.59 crore loss in Q2FY25, total income grows 42%</a></strong></div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the previous quarter (Q2), the fintech firm reported a consolidated net loss of Rs 3.59 crore in the July-September quarter of the financial year 2024-2025 (FY25). The Gurugram-based company’s total income rose 42 per cent on a year-on-year (Y-o-Y) basis to Rs 293.66 crore in Q2FY25 from Rs 206.83 crore in Q2FY24. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tShares of One Mobikwik Systems made a stellar debut on bourses on December 18, 2024, with a 58.51 per cent premium over the IPO allotment price of Rs 279 on BSE at Rs 442.25 apiece. <small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/news/mobikwik-shares-list-at-58-premium-on-bse-nse-follow-ipo-gmp-trend-124121800233_1.html\" target=\"_blank\">Mobikwik shares list at 58% premium on BSE, NSE; follow IPO GMP trend</a></strong></div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the National Stock Exchange (NSE), Mobikwik shares were listed at Rs 440, reflecting a premium of 57.7 per cent per share against the issue price. Currently, the stock trading at Rs 572.85 per share has gained over 120 per cent from its issue price. <small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/news/mobikwik-q3-results-should-you-buy-stock-ahead-of-nos-what-analysts-say-125010600290_1.html\" target=\"_blank\">Mobikwik Q2 results: Should you buy stock ahead of nos? What analysts say</a></strong></div>\n</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 16:05:26",
            "link": "https://www.business-standard.com/markets/news/mobikwik-shares-slip-5-after-company-posts-net-loss-against-profit-yoy-125020400621_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400621"
        },
        {
            "title": "Eris Lifesciences shares drop 5% after profit slides in Q3 results; details",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tEris Lifesciences share price slipped 5.35 per cent at Rs 1,181.20 a piece on the BSE in Tuesday’s intraday trade after the company’s net profit dropped in the third quarter of the financial year 2024-25 (Q3FY25).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company’s net profit came in at Rs 87 crore, down 14.3 per cent year-on-year (Y-o-Y), compared to Rs 101 crore in the same quarter last year. <small class=\"brtag\"> </small></div>\n<div>\r\n\tMeanwhile, the revenue from operations surged 35 per cent Y-o-Y to Rs 635 crore, compared to Rs 471 crore in Q3FY24. For the first nine months of FY25 (9MFY25), revenue stood at Rs 1,911 crore, a 35 per cent Y-o-Y growth over Rs 1,418 crore in 9MFY24.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtagPara\"> </small>\r\n\tEarnings before interest, tax, depreciation and amortisation (Ebitda) witnessed a robust increase, reaching Rs 230 crore in Q3FY25, reflecting a 31 per cent growth from Rs 174 crore in Q3FY24. On a 9M basis, Ebitda grew 36 per cent Y-o-Y to Rs 695 crore, up from Rs 524 crore in 9MFY24.<small class=\"brtag\"> </small></div>\n<div>\r\n\tEbitda Margin dropped to 36.2 per cent in Q3FY25, compared to 37.0 per cent in Q3FY24, while for 9M FY25, the margin came in at 36.4 per cent, slightly lower than 36.9 per cent in 9MFY24.<small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tOn the equities front, Eris Lifesciences share price has risen 6.6 per cent in the last six months, while gaining 34.3 per cent in the last one year. In comparison, the BSE Sensex has slipped 3.4 per cent in the last six months, while rising 8.4 per cent in the last one year. <small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tEris Lifesciences has a total market capitalisation of Rs 16,281.74  crore. Its shares are listed at a price to earnings multiple of 146.07 and at an earning per share of Rs 8.54, according to BSE.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt 1:28 PM, the stock price of the company was down 4.16 per cent at Rs 1196.05 a piece on the BSE. By comparison, the BSE’s Sensex was up 1.27 per cent to 78,168.23 level.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 16:05:25",
            "link": "https://www.business-standard.com/markets/news/eris-lifesciences-shares-drop-5-after-profit-slides-in-q3-results-details-125020400627_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400627"
        },
        {
            "title": "Upcoming IPO: Indogulf Cropsciences secures green light from Sebi; details",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tCrop protection products, plant nutrients, and biologicals manufacturing company Indogulf Cropsciences is all set to go public as the company has received final observation from the capital markets regulator, Securities and Exchange Board of India (SEBI), to raise funds through an initial public offering (IPO).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndogulf Cropsciences had filed its IPO papers with SEBI on September 25, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/markets/ipo/indogulf-cropsciences-ltd-ipo-89824\" target=\"_blank\">Indogulf Cropsciences IPO</a> comprises a fresh issue of up to Rs 200 crore, and an offer for sale (OFS) with shareholders divesting up to 38,54,840 equity shares of face value Rs 10 apiece. The OFS consists of up to 15,40,960 equity shares by Om Prakash Aggarwal (HUF) and up to 23,13,880 equity shares by Sanjay Aggarwal (HUF). \"The price band and the minimum bid lot will be decided by our company in consultation with the BRLM,\" Indogulf Cropsciences said in its DRHP.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe equity shares offered through the IPO are proposed to be listed on the BSE and NSE.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBigshare Services serves as the registrar to the offer. Systematix Corporate Services is the sole book-running lead manager for the public offering.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The company, in consultation with the book-running lead managers, may consider a pre-IPO placement of specified securities, which shall not exceed 20 per cent of the size of the fresh issue. If such a placement is completed, the fresh issue size will be reduced,\" said the company in its Draft Red Herring Prospectus (DRHP).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company will not receive any proceeds from the OFS. According to the DRHP, the selling shareholders will be entitled to their respective portion of the proceeds from the Offer for Sale after deducting their proportion of offer expenses and relevant taxes thereon.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndogulf Cropsciences, however, intends to utilise the proceeds from the fresh issue for funding working capital requirements, and for repayment/prepayment, in full or in part, of certain outstanding borrowings availed by them. The company will further use the proceeds for capital expenditure, including setting up an in-house dry flowable (DF) plant at Barwasni, Sonipat, Haryana, as well as for general corporate purposes.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndogulf Cropsciences is engaged in the business of manufacturing crop protection products, plant nutrients, and biologicals in India. It is also one of the first indigenous manufacturers of Pyrazosulfuron Ethyl technical (Source: CareEdge Report), which commenced production in 2018. Indogulf Cropsciences began its operations in 1993 and primarily operates under three business verticals: crop protection, plant nutrients, and biologicals, catering to retail and institutional customers focused on improving crop yield.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 16:00:40",
            "link": "https://www.business-standard.com/markets/news/upcoming-ipo-indogulf-cropsciences-secures-green-light-from-sebi-details-125020400606_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400606"
        },
        {
            "title": "Mobikwik shares slip 5% after company posts net loss against profit YoY",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tMobikwik shares slumped 3.2 per cent on Tuesday, logging an intraday low at Rs 385.65 per share on BSE. The selling pressure in the stock came after the company posted its <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">Q3 results</a>.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAround 1:11 PM, <a href=\"https://www.business-standard.com/markets/one-mobikwik-systems-ltd-share-price-68099.html\" target=\"_blank\">Mobikwik share price</a> was down 1.49 per cent at Rs 400.2 per share on BSE. In comparison, the BSE Sensex was up 1.17 per cent at 78,091.81. The market capitalisation of the company stood at Rs 3,109.01 crore. The 52-week high of the stock was at Rs 698.3 per share and the 52-week low was at Rs 366.85 per share. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company released its Q3 results on Tuesday during market hours. The company reported a consolidated net loss to Rs 55.28 crore as compared to a profit of Rs 5.27 crore a year ago. Mobikwik's revenue for the quarter under review rose 17.7 per cent at Rs 269.47 crore as compared to Rs 228.93 crore a year ago. <small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/companies/results/mobikwik-posts-rs-3-59-crore-loss-in-q2fy25-total-income-grows-42-125010700679_1.html\" target=\"_blank\">MobiKwik posts Rs 3.59 crore loss in Q2FY25, total income grows 42%</a></strong></div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the previous quarter (Q2), the fintech firm reported a consolidated net loss of Rs 3.59 crore in the July-September quarter of the financial year 2024-2025 (FY25). The Gurugram-based company’s total income rose 42 per cent on a year-on-year (Y-o-Y) basis to Rs 293.66 crore in Q2FY25 from Rs 206.83 crore in Q2FY24. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tShares of One Mobikwik Systems made a stellar debut on bourses on December 18, 2024, with a 58.51 per cent premium over the IPO allotment price of Rs 279 on BSE at Rs 442.25 apiece. <small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/news/mobikwik-shares-list-at-58-premium-on-bse-nse-follow-ipo-gmp-trend-124121800233_1.html\" target=\"_blank\">Mobikwik shares list at 58% premium on BSE, NSE; follow IPO GMP trend</a></strong></div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the National Stock Exchange (NSE), Mobikwik shares were listed at Rs 440, reflecting a premium of 57.7 per cent per share against the issue price. Currently, the stock trading at Rs 572.85 per share has gained over 120 per cent from its issue price. <small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/news/mobikwik-q3-results-should-you-buy-stock-ahead-of-nos-what-analysts-say-125010600290_1.html\" target=\"_blank\">Mobikwik Q2 results: Should you buy stock ahead of nos? What analysts say</a></strong></div>\n</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 16:00:40",
            "link": "https://www.business-standard.com/markets/news/mobikwik-shares-slip-5-after-company-posts-net-loss-against-profit-yoy-125020400621_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400621"
        },
        {
            "title": "BMC allocates Rs 1,000 cr for BEST bus services in FY 2025-26 budget",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe Brihanmumbai Municipal Corporation (BMC) has in its budget for the financial year 2025-26 allocated Rs 1,000 crore for the civic bus services BEST, acknowledging its financial challenges.</p>\n<p>\r\n\tThe Brihanmumbai Electric Supply and Transport (BEST) undertaking, the second-largest public transport system in the metropolis after suburban trains, operates a fleet of around 3,000 buses, serving more than 30 lakh commuters daily.</p>\n<p>\r\n\tIn the budget document presented on Tuesday, the BMC stated that despite its own financial commitments, it has made the provision considering BEST's financial position.</p>\n<p>\r\n\t\"Although BMC itself has a huge requirement of funds towards its ongoing projects and other important objectives, a total provision of Rs 1000 crore is proposed in 2025-26 as a grant to BEST undertaking considering its financial position,\" the document stated.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAs per the budget documents, the funds will be used for infrastructure development, capital equipment purchases, loan repayments, wet lease buses, pay revisions, daily operations, the Intelligent Transport Management System (ITMS) project, Diwali bonuses of employees, pensioner dues and electricity bills.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe document also says that as per the state directives, BMC will contribute Rs 128.65 crore, its 5 per cent share, towards the procurement and deployment of 2,000 electric buses for Mumbai, but it is not clear if the amount is part of the Rs 1,000 crore assistance or a separate provision.</p>\n<p>\r\n\tThe BMC also pointed out that since 2012-13, it has provided Rs 11,304.59 crore in financial assistance to BEST, which is financially bleeding and its accumulated loss amount is around Rs 9,500 crore.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe document also noted that Rs 992 crore has been sanctioned by the 15th Finance Commission for BEST's electric bus purchases.</p>\n<p>\r\n\tOf this, Rs 493.38 crore has already been received and disbursed, with the remaining Rs 498.62 crore to be provided once received.</p><p></p></div>",
            "pub_date": "2025-02-04 15:55:26",
            "link": "https://www.business-standard.com/india-news/bmc-allocates-rs-1-000-cr-for-best-bus-services-in-fy-2025-26-budget-125020400586_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400586"
        },
        {
            "title": "Different standards applied to our neighbours in East and West: Jaishankar",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tExternal Affairs Minister S Jaishankar on Tuesday, criticized the inconsistent application of principles in global politics, particularly regarding democracy and military rule, while pointing to the \"different standards\" being applied to India's eastern and western neighbours.</p>\n<p>\r\n\tWhile delivering the keynote address at the IIC-Bruegel Annual Seminar in Delhi, the Minister emphasised that the agenda can no longer be set by some only to be observed by the rest.</p>\n<p>\r\n\t\"Even on a question like democracy and military rule. Different standards have been applied to our neighbours in the East and our neighbours in the West. It is not my case that principles are dispensable or that we must be utterly into real politics but the agenda can no longer be set by some, only to be observed by the rest,\" he said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tFurther, he pointed out that the world is currently witnessing two major conflicts referring to the Middle-East conflict and the Russia-Ukraine war, and they are often presented as matters of principle, but with selective and uneven application.</p>\n<p>\r\n\t\"The world is currently witnessing two major conflicts. These are often presented as matters of principle. We are told that the very future of the world order is at stake. Yet the record shows how selectively and unevenly these principles have been applied,\" Jaishankar stated.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tHe highlighted India's experience, citing the ongoing occupation of its territory and the overlooking of terrorism when convenient.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"We in India have yet to see aggression on our territory vacated after so many decades. Equally, terrorism has been overlooked when convenient. In our own continent, international law has been disregarded with significant consequences,\" he said.</p>\n<p>\r\n\tThe Foreign Minister also emphasised on the importance of India-European relations and stated, \"In a world that promises to be so volatile and so uncertain, a stronger India-EU relationship can be an important stabilizing factor.\"</p>\n<p>\r\n\tIndia is certainly cognizant of the greater strategic awakening of Europe in the last few years. That too can serve as a driver of deeper engagement. We already see that happening, for example, in closer defence in security and technology cooperation. The bottom line is that the India-EU relationship is more important than ever before,\" Jaishankar said.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tNotably, India and the EU are two of the world's largest economies having shared synergies and offering significant trade and investment opportunities. The EU is India's largest trading partner and India is the EU's 9th trading partner in terms of bilateral trade in goods.</p><p></p></div>",
            "pub_date": "2025-02-04 15:55:25",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/different-standards-applied-to-our-neighbours-in-east-and-west-jaishankar-125020400524_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400524"
        },
        {
            "title": "BMC allocates Rs 1,000 cr for BEST bus services in FY 2025-26 budget",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe Brihanmumbai Municipal Corporation (BMC) has in its budget for the financial year 2025-26 allocated Rs 1,000 crore for the civic bus services BEST, acknowledging its financial challenges.</p>\n<p>\r\n\tThe Brihanmumbai Electric Supply and Transport (BEST) undertaking, the second-largest public transport system in the metropolis after suburban trains, operates a fleet of around 3,000 buses, serving more than 30 lakh commuters daily.</p>\n<p>\r\n\tIn the budget document presented on Tuesday, the BMC stated that despite its own financial commitments, it has made the provision considering BEST's financial position.</p>\n<p>\r\n\t\"Although BMC itself has a huge requirement of funds towards its ongoing projects and other important objectives, a total provision of Rs 1000 crore is proposed in 2025-26 as a grant to BEST undertaking considering its financial position,\" the document stated.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAs per the budget documents, the funds will be used for infrastructure development, capital equipment purchases, loan repayments, wet lease buses, pay revisions, daily operations, the Intelligent Transport Management System (ITMS) project, Diwali bonuses of employees, pensioner dues and electricity bills.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe document also says that as per the state directives, BMC will contribute Rs 128.65 crore, its 5 per cent share, towards the procurement and deployment of 2,000 electric buses for Mumbai, but it is not clear if the amount is part of the Rs 1,000 crore assistance or a separate provision.</p>\n<p>\r\n\tThe BMC also pointed out that since 2012-13, it has provided Rs 11,304.59 crore in financial assistance to BEST, which is financially bleeding and its accumulated loss amount is around Rs 9,500 crore.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe document also noted that Rs 992 crore has been sanctioned by the 15th Finance Commission for BEST's electric bus purchases.</p>\n<p>\r\n\tOf this, Rs 493.38 crore has already been received and disbursed, with the remaining Rs 498.62 crore to be provided once received.</p><p></p></div>",
            "pub_date": "2025-02-04 15:50:27",
            "link": "https://www.business-standard.com/india-news/bmc-allocates-rs-1-000-cr-for-best-bus-services-in-fy-2025-26-budget-125020400586_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400586"
        },
        {
            "title": "Different standards applied to our neighbours in East and West: Jaishankar",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tExternal Affairs Minister S Jaishankar on Tuesday, criticized the inconsistent application of principles in global politics, particularly regarding democracy and military rule, while pointing to the \"different standards\" being applied to India's eastern and western neighbours.</p>\n<p>\r\n\tWhile delivering the keynote address at the IIC-Bruegel Annual Seminar in Delhi, the Minister emphasised that the agenda can no longer be set by some only to be observed by the rest.</p>\n<p>\r\n\t\"Even on a question like democracy and military rule. Different standards have been applied to our neighbours in the East and our neighbours in the West. It is not my case that principles are dispensable or that we must be utterly into real politics but the agenda can no longer be set by some, only to be observed by the rest,\" he said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tFurther, he pointed out that the world is currently witnessing two major conflicts referring to the Middle-East conflict and the Russia-Ukraine war, and they are often presented as matters of principle, but with selective and uneven application.</p>\n<p>\r\n\t\"The world is currently witnessing two major conflicts. These are often presented as matters of principle. We are told that the very future of the world order is at stake. Yet the record shows how selectively and unevenly these principles have been applied,\" Jaishankar stated.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tHe highlighted India's experience, citing the ongoing occupation of its territory and the overlooking of terrorism when convenient.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"We in India have yet to see aggression on our territory vacated after so many decades. Equally, terrorism has been overlooked when convenient. In our own continent, international law has been disregarded with significant consequences,\" he said.</p>\n<p>\r\n\tThe Foreign Minister also emphasised on the importance of India-European relations and stated, \"In a world that promises to be so volatile and so uncertain, a stronger India-EU relationship can be an important stabilizing factor.\"</p>\n<p>\r\n\tIndia is certainly cognizant of the greater strategic awakening of Europe in the last few years. That too can serve as a driver of deeper engagement. We already see that happening, for example, in closer defence in security and technology cooperation. The bottom line is that the India-EU relationship is more important than ever before,\" Jaishankar said.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tNotably, India and the EU are two of the world's largest economies having shared synergies and offering significant trade and investment opportunities. The EU is India's largest trading partner and India is the EU's 9th trading partner in terms of bilateral trade in goods.</p><p></p></div>",
            "pub_date": "2025-02-04 15:50:27",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/different-standards-applied-to-our-neighbours-in-east-and-west-jaishankar-125020400524_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400524"
        }
    ]
}