{
    "data": [
        {
            "title": "This recently listed rail-related IPO surges 18%; up 119% from issue price",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tShares of Quadrant Future Tek hit a new high of Rs 634, as they surged 18.2 per cent on the BSE in Tuesday’s intra-day trade amid heavy volumes. The stock of electrical cables has more-than-doubled or zoomed 119 per cent against the issue price of Rs 290 per share. The company made its stock market debut on January 14, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt 12:24 PM; Quadrant Future Tek was trading 17.7 per cent higher at Rs 631.20, as compared to 0.95 per cent rise in the BSE Sensex. The average trading volumes at the counter more-than-doubled, with 6.07 lakh equity shares representing 15 per cent of total equity of the company changing hands on the NSE and BSE.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tQuadrant is a research-focused company specialising in Train Control and Signalling Systems under the KAVACH project, enhancing safety and reliability for Indian Railways. It also manufactures specialty cables for railways, defence, and renewable energy, using advanced Electron Beam technology for superior performance. The company has received significant contracts for its KAVACH system and partners with RailTel to expand its deployment in India and abroad. Kavach is the most cost-effective Automatic Train Protection (ATP) system globally.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to analysts at Elara Capital, Kavach is at the forefront given rising train accidents. Expect a sharp rise in approved vendors from three, led by low deployment (1,548rkm completed versus 68,584rkm), large order pipeline (bids for 15,000 kms in FY26; Kavach for 10,000 locos) and overall opportunity size at Rs 45,000 crore. </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRail infra is another focus area, with an opportunity size of Rs 4.5 trillion from network expansion (new lines: Rs 2.6 trillion, gauge conversion: Rs 30,000 crore, doubling: Rs 1.7 trillion), as 73 per cent of the outlay is still to be spent. Also, the three new economic rail corridors proposed may add 40,000kms of new lines in the next 8-10 years (60 per cent of rail’s current network), the brokerage firm said in the railway sector update.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, among peers, Quadrant leads with an EBITDA margin of 24.1 per cent in FY24 and its return ratios are equally competitive. The industry forecast indicates a robust growth for the Indian Specialty Cable and Train Control System market projected to expand at a compound annual growth rate (CAGR) of 9.8 per cent and 12.7 per cent from CY24E-CY30E period. </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAdditionally, the strategic MoU signed with RailTel Corp. to provide KAVACH coupled with recent order win from Chittaranjan Locomotive Works (CLW) of Rs 978.6 crore, solidifies the company’s position as a premier Original Equipment Manufacturer (OEM), SBI Securities had said in the IPO note.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe growing demand for automated railway safety systems under the “Make in India” initiative and increasing applications for E-beam cables in renewable energy and EV sectors present significant growth opportunities. With its innovative solutions, robust financial performance, and focus on quality, Quadrant is well positioned for sustained growth and offers a promising investment opportunity, Ventura Securities said in its IPO note.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 15:40:27",
            "link": "https://www.business-standard.com/markets/news/this-recently-listed-rail-related-ipo-surges-18-up-119-from-issue-price-125020400533_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400533"
        },
        {
            "title": "Waqf Bill will benefit poor Muslims, widows: JPC Chair on Owaisi's remarks",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe Chairman of the Waqf JPC Jagdambika Pal on Tuesday responded to AIMIM Chief Asaduddin Owaisi's remarks on Waqf (Amendment) Bill and said that when the new Bill comes, it will benefit the poor Muslims, Pasmandas and widows.</p>\n<p>\r\n\t\"When Article 370 was discussed, Mehbooba Mufti had said that rivers of blood would flow. The way Triple Talaq Bill benefited, similarly, when the new Waqf Bill comes, it will also lead to benefits,\" Pal told ANI.</p>\n<p>\r\n\tHe also mentioned that Owaisi himself has participated in the meetings of the Committee where amendments were passed through voting and dissent notes of the opposition were registered.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Owaisi himself has been part of the Joint Parliamentary Committee (JPC), participating in meetings, amendments were passed through voting, report was adopted and even dissent notes were taken,\" he said.</p>\n<p>\r\n\tHe emphasized further that the government wants to ensure that places of worship remain intact and that the benefits of Waqf reach the poor Muslims, Pasmandas, and widows.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tAsaduddin Owaisi on Monday warned the government against tabling the Waqf (Amendment) Bill, 2024, in its current form, saying that it would lead to social instability in the country.</p>\n<p>\r\n\tOwaisi said that the Bill has been rejected by the entire Muslim community.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"I am cautioning and warning this government - if you bring and make a Waqf law in the present form, which will be a violation of Article 25, 26 and 14, it will lead to social instability in this country. It has been rejected by the entire Muslim community. No Waqf property will be left, nothing will be left,\" the AIMIM chief said during his address in the Lok Sabha.</p>\n<p>\r\n\t\"You want to make India 'Viksit Bharat', we want 'Viksit Bharat'. You want to take this country back to the '80s and early '90s, it will be your responsibility,\" he added.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tHe further said, \"As a proud Indian Muslim, I will not lose an inch of my Masjid...I will not lose an inch of my Dargah. I will not allow that. We will no more come and give a diplomatic talk over here. This is the House where I have to stand and speak honestly, that my community - we are proud Indians. It is my property, not given by anyone. You cannot snatch it away from me. Waqf is a form of worship for me.</p><p></p></div>",
            "pub_date": "2025-02-04 15:40:27",
            "link": "https://www.business-standard.com/politics/waqf-bill-will-benefit-poor-muslims-widows-jpc-chair-on-owaisi-s-remarks-125020400489_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400489"
        },
        {
            "title": "Galaxy S25 series: Samsung kicks off early deliveries ahead of Feb 7 sale",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tSamsung has started the early deliveries of the new Galaxy S25 series smartphones in India for customers who had pre-ordered the devices. The company on February 4 announced that it has handed out devices to over 700 customers from its flagship store at Bandra Kurla Complex (BKC) in Mumbai, Maharashtra as part of its early delivery drive.<small class=\"brtagPara\"> </small>\r\n\tSamsung started accepting pre-orders for the new flagship smartphones from January 23 and will continue to do so until February 6, ahead of the first sale date of February 7. Customers pre-ordering the Galaxy S25 series smartphones also get benefits up to Rs 21,000. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Samsung Galaxy S25 Ultra: Price, variants and offers</strong></div>\n<ul>\n<li>\r\n\t\t12GB RAM + 256GB Storage: Rs 129,999</li>\n<li>\r\n\t\t12GB RAM + 512GB Storage: Rs 141,999</li>\n<li>\r\n\t\t12GB RAM + 1TB Storage: Rs 165,999</li>\n</ul>\n<div>\r\n\tColours: </div>\n<ul>\n<li>\r\n\t\t256GB and 512GB storage variants are available in Titanium Silverblue, Titanium Gray, Titanium Whitesilver, Titanium Black.</li>\n<li>\r\n\t\tThe 1TB storage variant only comes in Titanium Silverblue colourway.</li>\n<li>\r\n\t\tExclusive colours on Samsung's website: Titanium Jadegreen, Titanium Jetblack and Titanium Pinkgold.</li>\n</ul>\n<div>\r\n\tPre-order offers:</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSamsung is providing a storage upgrade option for customers pre-ordering the Galaxy S25 Ultra in the 256GB variant. This means that customers will be able to get a 12GB RAM + 512GB storage model at the price of the 12GB RAM + 256GB storage variant. Additionally, the company is offering an upgrade bonus of Rs 9,000 on trade-in deals. Those opting not to exchange their current smartphone for the Galaxy S25 Ultra can instead avail a cashback of Rs 7,000 while purchasing the device with a no-interest equated monthly instalment (EMI) plan of nine months.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/technology/tech-news/samsung-to-launch-128gb-storage-variant-of-galaxy-s25-in-india-report-125012900697_1.html\" target=\"_blank\">Samsung to launch 128GB storage variant of Galaxy S25 in India: Report</a></strong></div>\n</div>\n<div>\n<strong>Galaxy S25 Plus: Price and variants and offers</strong></div>\n<ul>\n<li>\r\n\t\t12GB RAM + 256GB Storage: Rs 99,999</li>\n<li>\r\n\t\t12GB RAM + 512GB Storage: Rs 111,999</li>\n</ul>\n<div>\r\n\tColours: Navy, Silver Shadow </div>\n<div>\r\n\tExclusive colours on Samsung’s website: Blueblack, Coralred and Pinkgold</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPre-order offers:</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs part of the pre-order offers, customers can avail the 12GB RAM + 512GB storage variant of the Galaxy S25 Plus at the price of the 12GB RAM + 256GB storage variant. There are also no-interest EMI plans of up to 24 months.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Galaxy S25: Price and variants and offers</strong></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t12GB RAM + 256GB Storage: Rs 80,999</div>\n<div>\r\n\t12GB RAM + 512GB Storage: Rs 92,999</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tColours: Icyblue, Silver Shadow, Navy, Mint</div>\n<div>\r\n\tExclusive colours on Samsung’s website: Blueblack, Coralred and Pinkgold</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPre-order offers:</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSamsung announced that customers pre-ordering the Galaxy S25 can receive benefits of up to Rs 11,000 on trade-in deals. Alternatively, those purchasing the smartphone with a no-interest EMI plan of nine months can avail a cashback of Rs 7,000. No-interest EMI plans of up to 24 months are available for the Galaxy S25.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Samsung Galaxy S25 Ultra: Specifications</strong></div>\n<ul>\n<li>\r\n\t\tDisplay: 6.9-inch QHD+ Dynamic AMOLED 2X Display, 120Hz refresh rate (1-120Hz)</li>\n<li>\r\n\t\tProcessor: Qualcomm Snapdragon 8 Elite for Galaxy </li>\n<li>\r\n\t\tRAM: 12GB</li>\n<li>\r\n\t\tStorage: 256GB, 512GB, 1TB</li>\n<li>\r\n\t\tRear camera: 200MP primary (OIS), 50MP Ultra-wide, 50MP telephoto (5x), 10MP telephoto (3x zoom)</li>\n<li>\r\n\t\tFront camera: 12MP</li>\n<li>\r\n\t\tBattery: 5000mAh</li>\n<li>\r\n\t\tCharging: Up to 65 per cent charge in around 30 mins with 45W adapter, wireless charging support</li>\n<li>\r\n\t\tOS: Android 15-based One UI 7</li>\n<li>\r\n\t\tProtection: Corning Gorilla Armor 2, IP68</li>\n</ul>\n<div>\n<strong>Samsung Galaxy S25 Plus: Specifications</strong></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<ul>\n<li>\r\n\t\tDisplay: 6.7-inch QHD+ Dynamic AMOLED 2X Display, 120Hz refresh rate (1-120Hz)</li>\n<li>\r\n\t\tProcessor: Qualcomm Snapdragon 8 Elite for Galaxy </li>\n<li>\r\n\t\tRAM: 12GB</li>\n<li>\r\n\t\tStorage: 256GB, 512GB</li>\n<li>\r\n\t\tRear camera: 50MP primary (OIS), 12MP Ultra-wide, 10MP telephoto (3x zoom)</li>\n<li>\r\n\t\tFront camera: 12MP</li>\n<li>\r\n\t\tBattery: 4900mAh</li>\n<li>\r\n\t\tCharging: Up to 65 per cent charge in around 30 mins with 45W adapter, wireless charging support</li>\n<li>\r\n\t\tOS: Android 15-based One UI 7</li>\n<li>\r\n\t\tProtection: IP68</li>\n</ul>\n<div>\n<strong>Samsung Galaxy S25: Specifications</strong></div>\n<ul>\n<li>\r\n\t\tDisplay: 6.2-inch FHD+ Dynamic AMOLED 2X Display, 120Hz refresh rate (1-120Hz)</li>\n<li>\r\n\t\tProcessor: Qualcomm Snapdragon 8 Elite for Galaxy </li>\n<li>\r\n\t\tRAM: 12GB</li>\n<li>\r\n\t\tStorage: 256GB, 512GB</li>\n<li>\r\n\t\tRear camera: 50MP primary (OIS), 12MP Ultra-wide, 10MP telephoto (3x zoom)</li>\n<li>\r\n\t\tFront camera: 12MP</li>\n<li>\r\n\t\tBattery: 4000mAh</li>\n<li>\r\n\t\tCharging: Up to 50 per cent charge in around 30 mins with 25W adapter and 3A USB-C cable, wireless charging support</li>\n<li>\r\n\t\tOS: Android 15-based One UI 7</li>\n<li>\r\n\t\tProtection: IP68</li>\n</ul></div>",
            "pub_date": "2025-02-04 15:35:26",
            "link": "https://www.business-standard.com/technology/tech-news/galaxy-s25-series-samsung-kicks-off-early-deliveries-ahead-of-feb-7-sale-125020400246_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400246"
        },
        {
            "title": "South Africa's SA20 confirms official window for next three seasons",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><p>\r\n\tSA20 and Cricket South Africa on Monday formalised the window of the lucrative franchise-based tournament for the next three years in order to \"bring certainty\" to stakeholders and also help the national team plan its international calendar in advance.</p>\n<p>\r\n\tAs per the schedule, Season 4 will get underway on December 26, 2025 and run through to January 26, 2026. The season will lead up to the T20 World Cup in India and Sri Lanka in February next year.</p>\n<p>\r\n\tSeason 5 will return to its original slot, running from January 9 to February 14, 2027, while Season 6 will be held from January 9 to February 13, 2028.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Confirming the SA20 window for a three-year period allows the league to bring certainty to all stakeholders and assists in securing our place when planning the global calendar,\" said former South Africa skipper the League Commissioner Graeme Smith.</p>\n<p>\r\n\t\"We know fans respond particularly well to weekend and holiday fixtures and with the ICC T20 World Cup in early February next year, our Season 4 dates provide the unique opportunity to capitalise on South Africa's peak cricket season.</p>\n<p>\r\n\t\"Early planning has also meant that we are able to look at an extended window from 2026/27 and this will optimise scheduling, logistics and the fan experience,\" said Smith, clearly indicating that the ICC schedule, which has been confirmed until 2031 and the current Future Tours Programme (FTP) until 2027, had been taken into consideration while making the schedule for the next three seasons of the lucrative league.</p><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tSeason 3 of SA20 has entered the business end with the final scheduled on February 8.</p><p></p></div>",
            "pub_date": "2025-02-04 15:35:26",
            "link": "https://www.business-standard.com/cricket/news/south-africa-s-sa20-confirms-official-window-for-next-three-seasons-125020301529_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020301529"
        },
        {
            "title": "Here's why L&T share gained 4% in trade on February 4; check reasons here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tShares of construction engineering giant Larsen and Toubro (L&amp;T) were in demand on Tuesday, February 4, 2025, rising as much as 4.38 per cent to hit an intraday high of Rs 3,431.30 per share.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe rise in L&amp;T's share price followed the company’s announcement that its Minerals &amp; Metals (M&amp;M) business vertical would be setting up a Pellet Plant and Direct Reduction of Iron (DRI) Plant for a client in the Middle East and North Africa (MENA) region. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThese pertains to a major order secured earlier from the client – a leading steel producer in MENA and are part of the global initiative towards decarbonisation, L&amp;T revealed, in a statement. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs per the agreement, L&amp;T's M&amp;M division will design-build Pellet and DRI plants encompassing engineering, supply, erection and construction works based on globally acclaimed technologies. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tL&amp;T’s M&amp;M vertical offers end-to-end solutions in the EPC domain across sectors such as mining, minerals processing, industrial products and metallurgical plants. Its product business provides cost-effective end-to-end solutions for industries such as mining, cement, construction, steel, fertilisers and ports.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This reflects M&amp;M’s leadership position in successful execution of complex iron &amp; steel plant projects in the MENA region. It further demonstrates the unwavering commitment of M&amp;M in delivering steel plant projects conforming to international standards in quality, safety, and on time completion,” said D K Sen, executive committee member and advisor to the CMD, L&amp;T. </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>L&amp;T Q3 results</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLarsen &amp; Toubro reported a consolidated net profit of Rs 3,359 crore in Q3FY25, reflecting a 13.9 per cent increase compared to Rs 2,947.4 crore in the same period last year (Q3FY24).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company also posted a consolidated revenue of Rs 64,668 crore for the quarter ending December 31, 2024, reflecting a 17.3 per cent year-on-year (Y-o-Y) growth from Rs 55,127.82 crore. The revenue increase was primarily driven by a robust order book and enhanced execution momentum across L&amp;T's Projects &amp; Manufacturing (P&amp;M) businesses. </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>About L&amp;T</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLarsen &amp; Toubro is a $27 billion Indian multinational enterprise engaged in EPC Projects, Hi-Tech Manufacturing, and Services, operating across multiple geographies. </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt 12:55 PM, L&amp;T share price was trading 4.25 per cent higher at Rs 3,427. In comparison, BSE Sensex was trading 1.13 per cent higher at 78,056.68 levels.</div></div>",
            "pub_date": "2025-02-04 15:30:37",
            "link": "https://www.business-standard.com/markets/news/here-s-why-l-t-share-gained-4-in-trade-on-february-4-check-reasons-here-125020400581_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400581"
        },
        {
            "title": "Delhi HC issues notice to registrar general on bail plea of Rashid Engineer",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe Delhi High Court on Tuesday issued notice to its registrar general on the issue of designation of a court to hear the bail plea of Jammu and Kashmir MP Rashid Engineer in a terror funding case.</p>\n<p>\r\n\tJustice Vikas Mahajan was hearing Rashid's petition alleging that he had been left without any remedy after the NIA court dealing with his bail application left him in a limbo post his election to the Lok Sabha last year on account of it not being a special MP-MLA court.</p>\n<p>\r\n\tCounsel for the NIA opposed Rashid's plea seeking interim bail to attend the ongoing Parliament session, and said he had no such \"right\" as a parliamentarian.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe counsel, however, said the registrar general has filed an application in the Supreme Court to seek a clarification on the issue of designation of a court.</p>\n<p>\r\n\tThe court was also told that in November last year, the agency had also made a representation to the registrar general on the issue of designation of the NIA court as a court which could hear MP/MLA cases.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\t\"It is deemed appropriate to issue notice to the registrar general of the court to ascertain the status as regard the administrative order and clarification on the issue. Issue notice,\" Justice Mahajan said, and listed the matter for hearing on February 6.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tHis main petition, Rashid has urged the high court to either direct the expeditious disposal of his pending bail plea by the NIA court or decide the matter itself.</p>\n<p>\r\n\tOn December 24 last year, additional sessions judge Chander Jit Singh -- who requested the district judge to transfer the case to a court designated to try lawmakers as Rashid was an MP -- dismissed his plea asking for an order on the pending bail application in the NIA case.</p>\n<p>\r\n\tWith the matter sent back to him by the district judge, the trial judge said in his decision that he could only decide the miscellaneous application and not the bail plea.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-04 15:30:36",
            "link": "https://www.business-standard.com/india-news/delhi-hc-issues-notice-to-registrar-general-on-bail-plea-of-rashid-engineer-125020400453_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400453"
        },
        {
            "title": "'Are you waiting for muhurat to deport foreigners': SC slams Assam govt",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\t\"Are you waiting for some muhurat\", the Supreme Court remarked on Tuesday as it came down heavily on the Assam government for keeping people declared as foreigners in detention centres indefinitely rather than deporting them.</p>\n<p>\r\n\tA bench of justices Abhay S Oka and Ujjal Bhuyan said once the detained persons are held to be foreigners, they should be deported immediately.</p>\n<p>\r\n\t\"You have refused to start deportation saying their addresses are not known. Why should it be our concern? You deport to their foreign country. Are you waiting for some muhurat (auspicious time)?<small class=\"brtagPara\"> </small>\r\n\t\"Once you declare a person foreigner, then you have to take the next logical step. You cannot detain them till eternity. Article 21 of the Constitution is there. There are many foreigner detention centres in Assam. How many have you deported?\" the bench told the counsel appearing for the Assam government.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe top court directed the Assam government to start within two weeks the deportation of 63 persons kept in detention centres and file a compliance affidavit.</p>\n<p>\r\n\tThe bench was hearing a plea concerning the deportation of persons declared foreigners and facilities at the detention centres in Assam.</p><p></p></div>",
            "pub_date": "2025-02-04 15:25:25",
            "link": "https://www.business-standard.com/india-news/are-you-waiting-for-muhurat-to-deport-foreigners-sc-slams-assam-govt-125020400464_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400464"
        },
        {
            "title": "iQOO Neo 10r set to launch in March with India-exclusive colours: Details",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tChinese smartphone brand iQOO has announced that it will be launching its Neo 10r smartphone in India on March 11. CEO of iQOO India, Nipun Marya, posted the first-look image of the smartphone on X (formerly Twitter), revealing the dual-tone back panel design of the iQOO Neo 10r. The company has also confirmed that the upcoming <a href=\"https://www.business-standard.com/topic/iqoo\" target=\"_blank\">iQOO smartphone</a> will be available in an India-exclusive colour variant called \"Raging Blue.\"</div>\n<div>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\t\tNew Year, Neo Power.<a href=\"https://twitter.com/hashtag/iQOONeo10R?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#iQOONeo10R</a> <a href=\"https://twitter.com/hashtag/PowerToPlay?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#PowerToPlay</a> <a href=\"https://t.co/16V3IBCidK\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/16V3IBCidK</a></p>\r\n\t\t— Nipun Marya (@nipunmarya) <a href=\"https://twitter.com/nipunmarya/status/1886618179494945167?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 4, 2025</a></blockquote></div>\n<!-- --> <!-- --> </div>\n<div>\n<strong>iQOO Neo 10r: What to expect</strong></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe smartphone appears to have a flat-style frame which holds a quad-curved back panel, featuring a dual-tone design. The rear camera module design on the Neo 10r feels inspired by the company's flagship iQOO 13 series. The smartphone will likely feature dual cameras at the back, while the \"OIS\" branding on the camera module suggests that it will support optical image stabilisation.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/technology/tech-news/nothing-phone-3a-series-to-get-iphone-16-like-camera-button-what-to-expect-125020400479_1.html\" target=\"_blank\">Nothing Phone 3a series to get iPhone 16-like camera button: What to expect</a></strong></div>\n</div>\n<div>\r\n\tAccording to a report by GSMArena, the upcoming iQOO Neo 10r smartphone could be a rebranded version of the iQOO Z9 Turbo Endurance Edition smartphone, which launched in the company's home country last month. Based on this, the iQOO Neo 10r is expected to sport a 6.78-inch AMOLED display of 1260x2800 resolution and 144Hz refresh rate. The dual rear camera system will likely offer a 50MP primary sensor and an 8MP ultra-wide. The iQOO Neo 10r is expected to feature a 6400mAh battery with support for 80W wired charging.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>iQOO Neo 10r: Expected specifications</strong></div>\n<ul>\n<li>\r\n\t\tDisplay: 6.78-inch AMOLED, 1260x2800 resolution, 144Hz refresh rate, HDR</li>\n<li>\r\n\t\tProcessor: Qualcomm Snapdragon 8s Gen 3</li>\n<li>\r\n\t\tRAM: up to 16GB</li>\n<li>\r\n\t\tStorage: up to 512GB</li>\n<li>\r\n\t\tRear camera: 50MP primary (OIS) + 8MP ultra-wide</li>\n<li>\r\n\t\tFront camera: 16MP</li>\n<li>\r\n\t\tBattery: 6400mAh</li>\n<li>\r\n\t\tCharging: 80W wired</li>\n<li>\r\n\t\tOS: Android 15-based Vivo FunTouch OS 15</li>\n</ul></div>",
            "pub_date": "2025-02-04 15:25:24",
            "link": "https://www.business-standard.com/technology/tech-news/iqoo-neo-10r-set-to-launch-in-march-with-india-exclusive-colours-details-125020400535_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400535"
        },
        {
            "title": "ITC Q3 preview: Cigarette volume may remain resilient; FMCG biz to grow 6%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tTobacco-to-fast-moving consumer goods (FMCG) conglomerate ITC will announce its Q3FY25 numbers on Thursday, February 6, 2025. In the third quarter (Q3FY25) brokerages tracked by Business Standard expect ITC's adjusted net profit to decline 3.5 per cent in the quarter ended December 31, 2024, on average, to Rs 5,151.12 crore as compared to Rs 5,340 crore a year ago. PAT is likely to decline due to the low tax rate in the base quarter.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, on a sequential basis, the PAT is expected to rise 3.2 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn Q3, the revenue of ITC, on average, is pegged at Rs 18,395.42 crore as compared to Rs 19,484.5 crore a year ago which implies a slip of 5.5 per cent year-on-year (Y-o-Y). On a quarter-on-quarter (Q-o-Q) basis, the revenue is estimated to slip 3.9 per cent. Analysts and investors will keep an eye out for management's commentary on FMCG, cigarette business growth outlook.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<h3>\r\n\tHere's how brokerages expect ITC to perform in Q3:</h3>\n<div>\n<strong>HDFC Securities: </strong>The brokerage expects low single digit cigarette volume growth owing to increased competitive intensity. Further, the FMCG business is likely to grow 6-7 per cent revenue growth owing to urban slowdown.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBesides, Earnings before interest, tax, depreciation and amortisation  (Ebitda) margin is expected to remain flat sequentially due to inflationary pressure related to the raw material index of the cigarette business and adverse business mix which is higher salience from the agriculture segment.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHDFC Securities pegged the Ebitda for Q3 at Rs 6155.7 crore as compared to Rs 6,024.3 crore a year ago. Ebitda margin is expected at 34.1 per cent as compared to 36.9 per cent a year ago and 33.1 per cent in Q2.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThey expected Q3 adjusted PAT at Rs 4,975.4 crore as compared to Rs 5,577.6 crore a year ago.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Motilal Oswal: </strong>The brokerage expects the cigarette business to show stable volumes and pricing, with the portfolio continuing to grow, aided by improvements in product mix. Analysts anticipate 4 per cent volume growth in the cigarette business in Q3FY25, along with 7 per cent Y-o-Y sales growth in cigarette business and 5 per cent Y-o-Y sales growth in FMCG business.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, cigarette Earnings before interest and tax (Ebit) is likely to grow 6 per cent Y-o-Y with 70 basis points (bps) decline in margins due to a rise in leaf tobacco prices.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the FMCG business, they expect 3 per cent de-growth in Ebit with 60 bps decline in margins as price hike lags raw material inflation. The paper segment is forecasted to remain weak, while the agriculture segment and hotel business are expected to perform well during the quarter.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Centrum Institutional Research:</strong> In Q3, analysts expect cigarette volume/value to grow by 4 per cent/5 per cent, followed by other FMCG/hotel/agriculture to grow by 5.5 per cent/15 per cent/20 per cent in Q3.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGiven the rising competition, higher input and leaf tobacco cost, a cut in operating margins is forecasted. They expect Ebitda margin to decline by 172 bps to 34.2 per cent Y-o-Y from 35.9 per cent and net profit is likely to decline 10.6 per cent Y-o-Y to Rs 4.983.8 crore as  compared to Rs 5,577.6 crore.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JM Financial:</strong> As per the brokerage cigarette volume may remain resilient at 3 per cent resulting in sales growth of 7 per cent. Ebit growth could be  lower due to raw material inflation.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnalysts pegged Ebitda for Q3 at Rs 6,337.5 crore as compared to Rs 6,024.3 crore a year ago. Ebitda margin is expected at 33.4 per cent as against 34.5 per cent Y-o-Y. FMCG sales and margins are likely to moderate given weak demand and high raw material prices.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 15:20:29",
            "link": "https://www.business-standard.com/markets/news/itc-q3-preview-cigarette-volume-may-remain-resilient-fmcg-biz-to-grow-6-125020400495_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400495"
        },
        {
            "title": "Emami share price drops 5% as ex-dividend date kicks in; details here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tShares of fast-moving consumer goods (FMCG) player Emami fell 4.75 per cent to today's low of Rs 585.10 apiece on the National Stock Exchange (NSE) during intraday deals on Tuesday, February 4, 2025. The decline in the company's share price aligns with the company's announcement of a second interim dividend for the financial year 2024-25. Emami shares trade ex-dividend today.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a regulatory filing, Emami informed the exchanges that its board of directors has declared the payment of a second interim dividend of Rs 4 per equity share of Re 1 each, fully paid-up, i.e., 400 per cent on 43,65,00,000 equity shares of the company for the financial year 2024-25.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe record date for ascertaining the names of the members entitled to receive the interim dividend, Emami said, is Tuesday, February 4, 2025.<small class=\"brtagPara\"> </small> Earlier, in November 2024, Emami had announced an interim dividend of Rs 4 per share for its shareholders for FY25. At the current market price, the company’s dividend yield stands at 1.70 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEmami is a leading FMCG company in India, manufacturing and marketing personal care and healthcare products. The company offers over 300 products across various categories, including hair care, skin care, and Ayurvedic healthcare. Emami's product portfolio includes brands like Navratna, BoroPlus, and Zandu Balm. <small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tEmami's market capitalisation, as of February 4, 2025, stands at Rs 25,591.99 crore on the NSE. The NBFC company is a constituent of the NIFTY 500 index.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHistorically, Emami's shares have shown mixed performance, advancing 0.38 per cent in the last month, and 17 per cent in the last year. However, Emami’s share price has dropped around 21 per cent in the last six months.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEmami shares reached their 52-week high of Rs 860 apiece on the NSE on September 6, 2024, while they fell to their 52-week low of Rs 417.10 per share on March 15, 2024.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt around 12:35 PM on Tuesday, Emami shares were trading at approximately Rs 585.50 apiece, down 4 per cent from their previous close of Rs 614.30 on the NSE. A combined total of nearly 0.23 million equity shares of the company, worth around Rs 13.94 crore, exchanged hands on the BSE and NSE today.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt the same time, the benchmark equity indices were trading higher, with the BSE Sensex gaining 805 points to reach 77,992 levels, and Nifty50 around 23,593.30, up 1 per cent.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 15:20:28",
            "link": "https://www.business-standard.com/markets/news/emami-share-price-drops-5-as-ex-dividend-date-kicks-in-details-here-125020400531_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400531"
        }
    ]
}