{
    "data": [
        {
            "title": "Rs 1.2 cr monthly rent! Mahindra Logistics inks 5-yr pact for Pune facility",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tMahindra Logistics, the third-party logistics (3PL) solutions arm of the Mahindra Group, has inked a five-year leasing pact for nearly half a million sq ft warehousing space in Pune’s Khed locality for a monthly rent of Rs 1.15 crore, according to documents accessed CRE Matrix - a real estate data analytics firm.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Mahindra arm has secured the prime leasing agreement in Pune with Karanje Emerald Logistics Park Pvt Ltd for a newly developed logistics space in the Karanje Emerald Industrial Park, located in Village Karanje Vihire, Khed, Pune.  The agreement, for which Mahindra Logistics paid a security deposit of Rs 3.45 crore, will see the company occupy a built-up area of 4,75,742 square feet, with a monthly rent of approximately Rs 1.15 crore. <small class=\"brtagPara\"> </small>\n<div>\r\n\t\tAccording to the documents, the security deposit for the transaction is Rs 3.45 crore, and a stamp duty of over Rs 18 lakh was paid along with a Rs 1,000 registration fee.</div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis lease marks a significant milestone for Mahindra Logistics, as the company expands its footprint in the growing logistics and warehousing sector in Pune. The premises, which are located in one of the most sought-after industrial zones in the region, are expected to play a key role in supporting the company’s operations in the area.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe lease agreement stipulates a 5-year license period, with the license commencement date set for January 3, 2025. Rent for the premises will begin on April 3, 2025, offering a strategic timeline for Mahindra Logistics to set up its operations. Additionally, the agreement includes a lock-in period of five years.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOne of the key features of the agreement is that the rent will remain the same for the first two years, after that there will be an annual rent escalation of 5%, which will be applied every year, providing a built-in adjustment for inflation and operational costs over the lease period.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith a substantial built-up area and prime location, the new lease is expected to boost Mahindra Logistics’ operational efficiency.<small class=\"brtagPara\"> </small>\n<div>\r\n\t\t\"Mahindra Logistics currently manages over 22.1 million Sq. ft. and is continually exploring and assessing new opportunities for growth. As per policy, we do not comment on any specific financial deals,\" Mahindra Logistics said in a statement. </div></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tIn 2024, Mahindra Logistics Limited (MLL) said it would invest Rs 170 crore in a warehouse facility near Pune in an area called Phaltan.</div>\n<small class=\"brtag\"> </small>\n<small class=\"brtagPara\"> </small> <small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 11:30:32",
            "link": "https://www.business-standard.com/finance/personal-finance/rs-1-2-cr-monthly-rent-mahindra-logistics-inks-5-yr-pact-for-pune-facility-125020401804_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401804"
        },
        {
            "title": "Donald Trump vows to close Department of Education, seeks Congress' help",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Jordan Fabian and Akayla Gardner</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPresident Donald Trump on Tuesday reiterated his preference to dismantle the Department of Education during his second term, but indicated he preferred to build consensus around the idea rather than attempt the maneuver through executive fiat.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump said that some of his advisers had said he could shutter the Education Department through an executive order, but that his preference was to work with Congress as well as teachers’ unions.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“I think I’d work with Congress,” Trump told reporters Tuesday in the Oval Office. “I think we’d get — look, we have to work with the teachers union, because the teachers union is the only one that’s opposed to it. Nobody else would want to hold it back. Look, we have to tell the teachers union we’re rated last in the world in education.”</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump said his primary concern was improving education after tests showed students lagging well behind historical standards, as well as other Western nations, despite federal spending on students. He said he believed that giving states more control over education while dismantling federal oversight would benefit more students.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe president’s comments come amid reports that the White House was preparing an executive action intending to dismantle the department. White House officials have said only that preparations were being made to fulfill Trump’s campaign promise to do so.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tStill, any effort is likely to face resistance from teachers unions, which have historically viewed efforts to turn control over to the states skeptically in part because they could funnel funds to private and charter schools staffed by educators without similar certifications. Those unions have historically backed Democratic presidential candidates, making the prospect of collaborating with Trump a long shot.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAbolishing the Department of Education would also be a challenging task. The agency has broad responsibilities: last year it distributed approximately $121 billion in federal grants, loans and work-study programs to nearly 10 million people, according to a fiscal year report. An annual application, known as FAFSA, managed by the agency has also become a fixture in the college application process, used by universities to help determine eligibility for scholarships. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump has nominated Linda McMahon, the onetime CEO of World Wrestling Entertainment who also ran the Small Business Administration in his first term, to head the agency. McMahon is awaiting confirmation, but the president has already moved to rein in the department, part of a broad assault aimed at reducing government spending and responsibilities and shrinking the size of the federal workforce.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“I told Linda: ‘Linda, I hope you do a great job and put yourself out of a job,’” Trump said Tuesday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt least 70 employees were placed on leave at the Education Department in recent days, according to Brittany Holder, a spokesperson for the American Federation of Government Employees, a union that represents some staffers at the agency. But that figure only accounts for members and employees who fall under the union, according to Holder, and the actual figure could be higher.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSome Education Department employees put on leave were caught in the administration’s efforts to purge federal workers involved in diversity, equity and inclusion initiatives. Overall, the department has around 4,200 employees, according to its website.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We are evaluating staffing in line with the commitment to prioritizing meaningful learning ahead of divisive ideology in schools and putting student outcomes above special interests,” Madison Biedermann, an Education Department spokesperson, said in a statement.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDespite longstanding pressure from conservatives to shrink or do away with the Education Department, lawmakers have balked at eliminating it before. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tStill, that pressure has intensified with Trump’s reelection after a campaign in which many issues dealing with education became political flash points, including former President Joe Biden’s student-loan debt relief, and criticism over teachings on race, gender and sexuality in schools.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 11:30:32",
            "link": "https://www.business-standard.com/world-news/donald-trump-vows-to-close-department-of-education-seeks-congress-help-125020500127_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500127"
        },
        {
            "title": "Trump administration begins flying detained migrants to Guantanamo Bay",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Alicia A. Caldwell and Tony Capaccio</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Trump administration has started flying detained migrants on a military aircraft to Guantanamo Bay after the president ordered a large-scale effort to prepare for thousands of prisoners to be sent to the US naval base in Cuba.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Today the first flights from the United States to Guantanamo Bay with illegal migrants are underway,” White House Press Secretary Karoline Leavitt said in an interview on Fox Business on Tuesday. A US military C-17 aircraft has taken off from Fort Bliss in El Paso, Texas, according to a US Transportation Command statement to Bloomberg News.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLast month, President Donald Trump signed an executive order directing the expansion of a migrant detention center at the military installation to full capacity, saying it could hold up to 30,000 people. While the US has previously housed small numbers of migrants at Guantanamo, primarily those intercepted at sea, its not been used in years for large-scale detention.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe administration hasn’t said how many migrants are in the initial group or provided details on their backgrounds, including whether any have criminal records. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe transfers come a day after Secretary of State Marco Rubio announced an agreement with El Salvador to deport foreign criminals, and potentially some US citizens to that country.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“President Trump is not messing around and he’s no longer going to allow America to be a dumping ground for illegal criminals from nations all around the world,” Leavitt told Fox Business.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSince taking office, Trump has issued a series of executive orders and launched high-profile raids targeting illegal immigration, leading to thousands of arrests by federal agents. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOfficials say many of those detained have criminal histories, but the administration has not released a full accounting, making it difficult to verify how many convicted or suspected criminals have been deported.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe prospect of using the Guantanamo base for migrants, which has also housed terrorism suspects since shortly after the Sept. 11 terrorist attacks, has long been criticized by immigrant rights groups who have warned such a move would bypass legal protections in place for many migrants.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 11:25:26",
            "link": "https://www.business-standard.com/world-news/trump-administration-begins-flying-detained-migrants-to-guantanamo-bay-125020500123_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500123"
        },
        {
            "title": "Rs 1.2 cr monthly rent! Mahindra Logistics inks 5-yr pact for Pune facility",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tMahindra Logistics, the third-party logistics (3PL) solutions arm of the Mahindra Group, has inked a five-year leasing pact for nearly half a million sq ft warehousing space in Pune’s Khed locality for a monthly rent of Rs 1.15 crore, according to documents accessed CRE Matrix - a real estate data analytics firm.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Mahindra arm has secured the prime leasing agreement in Pune with Karanje Emerald Logistics Park Pvt Ltd for a newly developed logistics space in the Karanje Emerald Industrial Park, located in Village Karanje Vihire, Khed, Pune.  The agreement, for which Mahindra Logistics paid a security deposit of Rs 3.45 crore, will see the company occupy a built-up area of 4,75,742 square feet, with a monthly rent of approximately Rs 1.15 crore. <small class=\"brtagPara\"> </small>\n<div>\r\n\t\tAccording to the documents, the security deposit for the transaction is Rs 3.45 crore, and a stamp duty of over Rs 18 lakh was paid along with a Rs 1,000 registration fee.</div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis lease marks a significant milestone for Mahindra Logistics, as the company expands its footprint in the growing logistics and warehousing sector in Pune. The premises, which are located in one of the most sought-after industrial zones in the region, are expected to play a key role in supporting the company’s operations in the area.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe lease agreement stipulates a 5-year license period, with the license commencement date set for January 3, 2025. Rent for the premises will begin on April 3, 2025, offering a strategic timeline for Mahindra Logistics to set up its operations. Additionally, the agreement includes a lock-in period of five years.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOne of the key features of the agreement is that the rent will remain the same for the first two years, after that there will be an annual rent escalation of 5%, which will be applied every year, providing a built-in adjustment for inflation and operational costs over the lease period.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith a substantial built-up area and prime location, the new lease is expected to boost Mahindra Logistics’ operational efficiency.<small class=\"brtagPara\"> </small>\n<div>\r\n\t\t\"Mahindra Logistics currently manages over 22.1 million Sq. ft. and is continually exploring and assessing new opportunities for growth. As per policy, we do not comment on any specific financial deals,\" Mahindra Logistics said in a statement. </div></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tIn 2024, Mahindra Logistics Limited (MLL) said it would invest Rs 170 crore in a warehouse facility near Pune in an area called Phaltan.</div>\n<small class=\"brtag\"> </small>\n<small class=\"brtagPara\"> </small> <small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 11:25:25",
            "link": "https://www.business-standard.com/finance/personal-finance/rs-1-2-cr-monthly-rent-mahindra-logistics-inks-5-yr-pact-for-pune-facility-125020401804_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401804"
        },
        {
            "title": "Elon Musk's 'buyout' offer accepted by more than 20,000 US federal workers",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Gregory Korte</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMore than 20,000 employees — about 1 per cent of the federal workforce — have signed up for an offer to quit their jobs in exchange for a deferred resignation deal that would have taxpayers continue to pay their salaries through the end of September.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBut those numbers are increasing every day, according to an official familiar with the data, and the Trump administration expects a spike in resignations as employees near Thursday’s deadline to accept the offer.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPresident Donald Trump and his efficiency czar, Tesla Inc. and SpaceX CEO Elon Musk, hopes that the offer could cull as much as 10 per cent of the federal workforce. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThat target could be difficult to meet. There are nearly 2.3 million civilian federal employees, but perhaps half of those — including civilian defense and intelligence employees, postal workers, law enforcement personnel and certain other sensitive positions — are ineligible for the offer.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThose 20,000 employees could also include many people who were already planning to retire in the coming months. An average of 62,000 federal workers have retired each year over the past decade, according to data provided by the US Office of Personnel Management. Some 298,000 employees will become eligible for retirement within the next two years.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnd federal employee unions have urged members to be skeptical of the offers, which they said were not guaranteed. The National Treasury Employees Union said the program was “designed to entice or scare you into resigning,” and the American Federation of Government Employees said the intent was “to turn the federal government into a toxic environment where workers cannot stay even if they want to.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs a result, the Office of Personnel Management has given increasingly detailed guidance on the offer, and put its key terms in writing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOPM’s acting director and top lawyer also defended the legality of the plan in a memo to agencies Tuesday, assuring employees that any signed departure agreement was “binding on the government.”</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Were the government to backtrack on its commitments, an employee would be entitled to request a rescission of his or her resignation,” OPM Acting Director Charles Ezell wrote.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThough colloquially known as a “buyout,” the deferred resignation plan is structured differently than those often found in the private sector. Employees have until Thursday to accept and could leave their jobs by the end of February. They’re free to take other jobs as long as they don’t conflict with their continued federal employment. They also have to agree not to sue the government.</div></div>",
            "pub_date": "2025-02-05 11:20:27",
            "link": "https://www.business-standard.com/world-news/elon-musk-s-buyout-offer-accepted-by-more-than-20-000-us-federal-workers-125020500114_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500114"
        },
        {
            "title": "Trump, Musk demand termination of federal office leases through GSA",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tOne of the next moves in President Donald Trump and Elon Musk's sweeping effort to fire government employees and curtail operations is using the agency that manages thousands of federal employee worksites around the country to cut down on office space.</p>\n<p>\r\n\tLast week, regional managers for the General Services Administration, or GSA, received a message from the agency's Washington headquarters to begin terminating leases on all of the roughly 7,500 federal offices nationwide, according to an email shared with The Associated Press by a GSA employee.</p>\n<p>\r\n\tThe order seems to contradict Trump's own return-to-office mandate for federal employees, adding confusion to what was already a scramble by the GSA to find workspace, internet connections and office building security credentials for employees who had been working remotely for years.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tBut it may reflect the Trump administration's belief that it won't need as many offices due to its efforts to fire employees or encourage them to resign.</p>\n<p>\r\n\tHere's what to know about the GSA and how Trump's Republican administration is using it in its pursuit of changes with other federal agencies:</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h3>\r\n\tWhat is the General Services Administration?</h3>\n<p>\r\n\tAn independent agency, the GSA in essence acts like the federal government's real estate broker, managing federal property for various agencies. President Harry S Truman established the GSA in 1949, streamlining administrative duties of procuring workplaces for federal employees that had to that point been handled by a variety of entities.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tInitially, in the wake of World War II, the GSA was tasked with disposing of war surplus goods and stockpiling strategic supplies for use in wartime. These days, it handles the acquisition of workplaces for more than 1 million federal civilian workers, oversees preservation of hundreds of historic buildings and manages government purchases from commercial vendors.</p>\n<p>\r\n\tAs of last fall, the GSA owned and leased more than 363 million square feet of space in 8,397 buildings in more than 2,200 communities nationwide, according to the agency's website. Those properties include courthouses, post offices and data processing centres.</p>\n<h3>\r\n\tWhat does Trump want the GSA to do?</h3>\n<p>\r\n\tMusk and his Department of Government Efficiency have homed in on the GSA.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAn email sent last week from GSA headquarters in Washington instructed regional managers to begin terminating leases on roughly 7,500 federal offices nationwide.</p>\n<p>\r\n\tLease terminations are the clear priority at this time, according to a Jan 29 email from a senior GSA manager, a copy of which was provided to the AP by a GSA employee.</p>\n<p>\r\n\tIn a follow-up meeting, GSA regional managers were told the goal is to terminate as many as 300 leases per day, according to the employee, who spoke on the condition of anonymity for fear of retaliation.</p>\n<h3>\r\n\tWho is leading Trump's moves concerning the GSA?</h3>\n<p>\r\n\tAccording to the employee who spoke to the AP, the initiative is being led by Nicole Hollander, who has been embedded in the GSA's headquarters in recent days.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tOn her LinkedIn profile, Hollander describes herself as an X employee with a background in real estate, in the Washington area. Hollander's X account which shows that she joined in March 2015 but where posts date only to September 2023 is full of posts related to X's real estate acquisitions, as well as information about auctions of items from Twitter's former offices after Musk purchased the platform.</p>\n<p>\r\n\tTrump has ordered the GSA to make sure it promotes beautiful federal civic architecture as the president dislikes styles that are less traditional.</p>\n<h3>\r\n\tHas Trump had a dustup with the GSA before?</h3>\n<p>\r\n\tYes. During the transition period following his November win, Trump declined to sign an agreement with the GSA that would have given his team access to secure government offices and email accounts. That refusal came in part because it would have required that the then-president-elect limit contributions to $5,000 and reveal who was donating to his transition effort.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIn late November, nearly two months past the deadline, Trump did reach an agreement with President Joe Biden's White House to allow transition staff to coordinate with the existing federal workforce before taking office on Jan 20.</p><p></p></div>",
            "pub_date": "2025-02-05 11:20:25",
            "link": "https://www.business-standard.com/world-news/trump-musk-demand-termination-of-federal-office-leases-through-gsa-125020500024_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500024"
        },
        {
            "title": "Dividend, Stock-split: Sun Pharma, Ksolves, 5 others to go ex-date tomorrow",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tShares of Container Corporation of India, India Motor Parts &amp; Accessories, IRB Infrastructure Developers, Sharda Cropchem, Sun Pharmaceutical Industries, Triveni Turbine, and Ksolves India are set to remain in focus during today's trading session on account of their corporate announcements, such as dividends or <a href=\"https://www.business-standard.com/article/pf/what-is-a-stock-split-111042600064_1.html\" target=\"_blank\">stock splits</a>.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBSE data shows that Container Corporation of India, India Motor Parts &amp; Accessories, IRB Infrastructure Developers, Sharda Cropchem, Sun Pharmaceutical Industries, and Triveni Turbine will trade ex-dividend tomorrow, Thursday, February 6, 2025, whereas Ksolves India is set to trade ex-date for its stock-split announcement.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmong these companies, <a href=\"https://www.business-standard.com/markets/sun-pharmaceuticals-industries-ltd-share-price-4325.html\" target=\"_blank\">Sun Pharmaceutical Industries</a> has announced the highest interim dividend of Rs 10.50 per share for its shareholders. This is followed by India Motor Parts &amp; Accessories, which has announced an interim dividend of Rs 10 per share. Both companies have set February 6, 2025, as the record date to ascertain shareholders' eligibility for the interim dividends.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/markets/container-corporation-of-india-ltd-share-price-12607.html\" target=\"_blank\">Container Corporation of India</a> and <a href=\"https://www.business-standard.com/markets/irb-infrastructure-developers-ltd-share-price-28365.html\" target=\"_blank\">IRB Infrastructure Developers</a> have announced interim dividends of Rs 4.25, Rs 0.10, and Rs 3 per share, respectively. These companies have also set February 6, 2025, as the record date for the interim dividend payout.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, Triveni Turbine, and Sharda Cropchem have announced interim dividends of Rs 2 and Rs 3 per share, respectively. Both companies have set February 6, 2025, as the record date to determine shareholders' eligibility for the interim dividends.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, <a href=\"https://www.business-standard.com/markets/ksolves-india-ltd-share-price-74805.html\" target=\"_blank\">Ksolves India</a> has announced a sub-division (stock split) of its existing equity shares, where one equity share of Rs 10 face value will be split into two equity shares of Rs 5 each. The company has fixed Thursday, February 6, 2025, as the record date to determine shareholders’ entitlement for the stock split.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBesides these, Coromandel International, GTV Engineering, Indian Metals &amp; Ferro Alloys, Dr. Lal PathLabs, Manba Finance, MAS Financial Services, Shree Cement, SMC Global Securities, and Sona BLW Precision Forgings will be in focus as they trade ex-dividend today.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe ex-date marks the point when a stock begins trading without the entitlement to dividends or stock splits. To qualify for these benefits, investors must own the stock before the ex-date. Beneficiaries of these corporate actions are finalized based on the list of shareholders recorded at the end of the record date.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 11:15:30",
            "link": "https://www.business-standard.com/markets/news/dividend-stock-split-sun-pharma-ksolves-5-others-to-go-ex-date-tomorrow-125020500100_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500100"
        },
        {
            "title": "LIVE: Tulsi Gabbard clears Senate panel vote for nomination as director of National Intelligence",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFormer United States Representative Tulsi Gabbard has cleared the Senate Intelligence Committee vote for her nomination to become the next Director of National Intelligence (DNI), putting her one step closer to confirmation by the full Senate, as reported by The Hill. The vote was a close call, passing 9-8 along party lines. \"The Intelligence Committee just voted for Tulsi Gabbard's nomination to be the Director of National Intelligence favourably to the full United States Senate. We look forward to her confirmation and working with her to keep America safe,\" Senate Intelligence Committee Chair Tom Cotton (R-Ark.) told reporters.</div>\n<div>\r\n\tThe vote came just hours after Senator Todd Young (R-Ind.), a key swing vote, announced that he would support Gabbard.<small class=\"brtagPara\"> </small> President Donald Trump announced Tuesday that the United States will withdraw from the top UN human rights body and will not resume funding for the UN agency helping Palestinian refugees. The US left the Geneva-based Human Rights Council last year, and it stopped funding the agency assisting Palestinian refugees, known as UNRWA, after Israel accused it of harboring Hamas militants who participated in the surprise October 7, 2023, attacks in southern Israel, which UNRWA denies. Trump's announcement came on the day he met with visiting Israeli Prime Minister Benjamin Netanyahu, whose country has long accused both the rights body and UNRWA of bias against Israel and antisemitism. Trump's executive orders also call for a review of American involvement in the Paris-based UN Educational, Scientific and Cultural Organization, known as Unesco, and a review of US funding for the United Nations in light of the wild disparities in levels of funding among different countries.<small class=\"brtagPara\"> </small> Maharashtra Chief Minister Devendra Fadnavis on Tuesday dismissed claims of not shifting to the official CM residence in south Mumbai due to superstition, and said he would move in after his daughter's board exams get over. His clarification comes hours after Shiv Sena (UBT) MP Sanjay Raut said that buffaloes sacrificed in Guwahati during Eknath Shinde's visit to the Kamakhya temple were buried on the premises of 'Varsha', the official residence of the chief minister, so that the CM's post should not go to anybody else other than Shinde. Ridiculing the claims, Fadnavis said, \"These absurd rumours do not even deserve a response from someone at my level.\" Deputy Chief Minister Eknath Shinde, who currently resides at Varsha, also commented on the controversy, saying, \"Those making these claims probably have more experience in such matters.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 11:15:29",
            "link": "https://www.business-standard.com/india-news/live-tulsi-gabbard-clears-senate-panel-vote-for-nomination-as-director-of-national-intelligence-125020500105_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500105"
        },
        {
            "title": "US will 'take over' the Gaza strip, own it and develop it, says Trump",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>US President <a href=\"https://www.business-standard.com/about/who-is-donald-trump\" target=\"_blank\">Donald Trump</a> said on Tuesday that the US would “take over” and “own” the Gaza strip, pledging to rebuild and develop it. Speaking at a joint press conference with Israeli Prime Minister <a href=\"https://www.business-standard.com/about/who-is-benjamin-netanyahu\" target=\"_blank\">Benjamin Netanyahu</a>, Trump stated \"The US will take over the Gaza Strip, and we will do a job with it too.\" \"We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site.\"<small class=\"brtagPara\"> </small>\n<h2>\n<strong>Economic development and long-term control</strong></h2>\n<h2>\n<small class=\"brtagPara\"> </small></h2>\r\nTrump further said \"We're going to take over that piece, we're going to develop it, create thousands and thousands of jobs, and it'll be something that the entire Middle East can be very proud of.\" Trump said he envisioned the US taking a “long-term ownership position” over the Gaza strip, but did not clarify under what authority the US could assume control. When asked about the legality of such a move, he did not respond directly.<small class=\"brtagPara\"> </small>\n<h2>\n<strong>Criticism of Biden and regional strategy</strong></h2>\n<small class=\"brtagPara\"> </small> Trump criticised former President Joe Biden, claiming his administration had shown incompetence in the Middle East. He said “nobody did anything for four years” in the Middle East except demonstrate incompetence.\"<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/world-news/trump-sees-long-term-us-ownership-of-gaza-doesn-t-dismiss-using-military-125020500055_1.html\" target=\"_blank\">Trump sees 'long-term' US ownership of Gaza, doesn't dismiss using military</a></strong><small class=\"brtagPara\"> </small> Earlier Trump reiterated his call for Arab nations, including Jordan and Egypt, to take in Gazans saying Palestinians there had no alternative but to abandon the Gaza strip. This time, he advocated for the permanent resettlement of Palestinians. Trump said that he might be reconsidering an independent Palestine as part of a two-state solution to the decades-long Israel-Palestinian conflict.\r\n<h2>\n<small class=\"brtagPara\"> </small></h2>\n<h2>\n<strong>Talks with Netanyahu on security and diplomacy</strong></h2>\n<small class=\"brtagPara\"> </small> Netanyahu’s visit to Washington comes two weeks into Trump’s second term. The leaders discussed eliminating Hamas, restoring peace “to a troubled region\", and maintaining the Gaza ceasefire.<small class=\"brtagPara\"> </small> Netanyahu, when asked about the US taking over Gaza, said, “I think it’s something that could change history.” “And I think it’s really worth pursuing this avenue.\"<small class=\"brtagPara\"> </small> <em>(With agency inputs)</em><br/></div>",
            "pub_date": "2025-02-05 11:10:32",
            "link": "https://www.business-standard.com/world-news/us-will-take-over-the-gaza-strip-own-it-and-develop-it-says-trump-125020500088_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500088"
        },
        {
            "title": "FBI agents sue over justice dept's effort to ID those probing Trump cases",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tFBI agents who participated in investigations related to President Donald Trump have sued over Justice Department efforts to develop a list of employees involved in those inquiries that they fear could be a precursor to mass firings.</p>\n<p>\r\n\tThe class-action complaint, filed Tuesday in federal court in Washington, seeks an immediate halt to the Justice Development's plans to compile a list of investigators who participated in probes of the Jan 6, 2021 riot at the US Capitol as well as Trump's hoarding of classified documents at his Mar-a-Lago estate.</p>\n<p>\r\n\tThe lawsuit notes that Trump on the campaign trail \"repeatedly stated that he would personify the vengeance' or the retribution, for those whom he called \"political hostages, for their actions during the Jan 6 attack.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe agents contend the very act of compiling lists of persons who worked on matters that upset Donald Trump is retaliatory in nature, intended to intimidate FBI agents and other personnel and to discourage them from reporting any future malfeasance and by Donald Trump and his agents.</p>\n<p>\r\n\tThe complaint also cites the Justice Department's firing last week of prosecutors on special counsel Jack Smith's team as proof that the effort to compile the list is rooted in a desire for retribution.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tDonald Trump has made repeated public pronouncements of his intent to exact revenge upon persons he perceives to be disloyal to him by simply executing their duties in investigating acts incited by him and persons loyal to him, the complaint says.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tWhatever the Trump administration believes about Plaintiffs' political affiliation, it clearly believes that persons who were involved in the investigation and prosecution of Jan 6 and Mar-a-Lago cases are insufficiently politically affiliated with Donald Trump to be entitled to retain their employment, it says.</p>\n<p>\r\n\tA Justice Department spokesman did not immediately return a message seeking comment.</p><p></p></div>",
            "pub_date": "2025-02-05 11:10:32",
            "link": "https://www.business-standard.com/world-news/fbi-agents-sue-over-justice-dept-s-effort-to-id-those-probing-trump-cases-125020500020_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500020"
        }
    ]
}