{
    "data": [
        {
            "title": "Aga Khan IV, spiritual leader of Ismailis and philanthropist, dies at 88",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Aga Khan, renowned for his success in horse racing, vast wealth, and global development efforts, passed away in Lisbon at the age of 88, as confirmed by the Aga Khan Development Network on X.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHis Highness Prince Karim Al-Hussaini, also known as the Aga Khan IV and the 49th hereditary imam of Shia Ismaili Muslims, died on Tuesday in Portugal, surrounded by his family. Both the Aga Khan Foundation and the Ismaili religious community shared this news on their websites. An announcement regarding his successor will be made at a later time. He is survived by three sons and one daughter.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<h3>\r\n\tA legacy of leadership</h3>\n<div>\r\n\tPrince Karim Aga Khan IV, viewed by his followers as a direct descendant of the Prophet Muhammad, became the community leader at a young age. His grandfather passed over his father in favour of him, believing that a younger leader would be better suited for guiding the Ismaili Muslim diaspora in the modern era.</div>\n<h3>\r\n\tA distinguished title and early leadership</h3>\n<div>\r\n\tIn July 1957, Queen Elizabeth bestowed the title \"His Highness\" upon him. This came shortly after Aga Khan III, his grandfather, named him heir to the 1,300-year-old dynasty of the Ismaili Muslim community. He officially became Aga Khan IV on October 19, 1957, in Dar es Salaam, Tanzania — the same location where his grandfather had once received gifts worth his weight in diamonds.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHaving left Harvard to be with his ailing grandfather, the Aga Khan returned to his studies after 18 months, now accompanied by an entourage and a deep sense of responsibility.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h3>\r\n\tRacehorse owner and billionaire</h3>\n<div>\r\n\tApart from his religious leadership, Aga Khan IV became synonymous with success in horse racing, owning the famous thoroughbred Shergar. His lifestyle was equally extravagant, marked by private jets, a $200 million super-yacht, and a private island in the Bahamas. His wealth was estimated to range from $800 million to $13 billion, stemming from his family inheritance, horse breeding business, and investments in tourism and real estate.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<h3>\r\n\tCommitment to global philanthropy</h3>\n<div>\r\n\tThe Aga Khan, who held citizenship in Britain, France, Switzerland, and Portugal, used his wealth to improve conditions in impoverished parts of the world. In a 2007 interview with The New York Times, he stated that poverty often leads to desperation and extremism, and that by assisting the poor through business, he was helping prevent these issues.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe scope of the Aga Khan’s financial empire is difficult to gauge, with some estimates placing his wealth in the billions. His community of Ismailis, originally based in India, considers it a religious duty to contribute up to 10 per cent of their income to him as their steward.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<h3>\r\n\tThe Ismailis</h3>\n<div>\r\n\tThe Ismailis are a distinct sect within Shia Islam, emerging in the 8th century from a schism regarding the rightful succession of leadership after the Prophet Muhammad's death. They derive their name from Imam Isma'il ibn Jafar, whom they recognise as the seventh Imam. This group emphasises the esoteric interpretation of Islam, focusing on the deeper, allegorical meanings of the Quran, which sets them apart from more literalist Islamic sects.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIsmailism developed during a period of significant political and religious upheaval in the Islamic world. Following the death of Muhammad ibn Isma'il, the movement evolved, leading to the establishment of the Fatimid Caliphate in the 10th century, which marked a peak in Ismaili political power and cultural influence.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIsmaili beliefs centre on the concept of an ongoing spiritual leadership through a line of Imams believed to be divinely appointed. The current leader is Karim Aga Khan IV, who plays a significant role in promoting social development and interfaith dialogue within and outside the community. The Ismailis practice a unique form of worship that differs from mainstream Islamic practices; for instance, they pray three times a day instead of five.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tToday, Ismailis are spread across more than 25 countries worldwide, with significant populations in India, Pakistan, Syria, Iran, and Canada. Their history in these regions often dates back over a millennium.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<em>(With agency inputs)</em></div></div>",
            "pub_date": "2025-02-05 13:05:28",
            "link": "https://www.business-standard.com/world-news/aga-khan-death-lisbon-leader-ismailis-125020500320_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500320"
        },
        {
            "title": "Motilal Oswal says 'Buy' ACME Solar for 59% upside, initiates coverage",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>ACME Solar share price: </strong>Recently-listed solar energy company ACME Solar Holdings shares were buzzing in trade on Wednesday, February 5, 2025, as the scrip zoomed as much as 7.77 per cent to hit an intraday high of Rs 223.75 per share. ACME Solar made its stock market debut on November 13, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe uptick in ACME Solar share price came after domestic brokerage Motilal Oswal initiated coverage with ‘Buy’ rating for a target price of Rs 330, which reflects an upside potential of 58.95 per cent from the previous close (Feb 4) of Rs 207.60.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We initiate coverage on ACME with a ‘Buy’ rating. We assign an EV/Ebitda multiple of 11x to FY28E Ebitda. Adjusting for net debt, we derive our TP of Rs 330, implying a 59 per upside potential. Our EV/Ebitda multiple is at a discount to competitors, such as NTPC Green, which is trading at ~14x FY28 EV/Ebitda. Further, the Street is currently attributing 15x EV/Ebitda to the renewable businesses of JSWE and Tata Power,” Motilal Oswal said in a note.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnalysts at Motilal Oswal believe ACME Solar’s steep valuation discount compared to NTPC Green is unsustainable and should narrow in the coming quarters. They also noted that NTPC Green’s premium valuation is largely due to its lower financing costs (up to a 2 per interest rate advantage). However, this advantage is somewhat reduced as NTPC Green outsources both EPC and O&amp;M for its projects, whereas other players handle these functions in-house.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em><strong>Given this, here are the top factors behind initiating coverage on ACME Solar share:</strong></em></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Diversified renewable energy portfolio</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnalysts said ACME Solar’s diversified portfolio includes ~7GW of renewable capacity (solar, wind, hybrid, and firm &amp; dispatchable renewable energy). With 86 per cent of its portfolio contracted with central off-takers like SECI, NTPC, and NHPC, the company ensures minimal counterparty risk. The portfolio consists of 49 per solar, 2 per wind, and 49 per hybrid/FDRE projects.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Strong Ebitda growth eyed</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMotilal Oswal analysts noted that ACME Solar is set for strong earnings growth, with an estimated Ebitda CAGR of 52 per from FY24 to FY27. The company’s operational capacity is set to triple by FY27, and it continues to secure new projects, having won 1.9GW of new orders in FY25 so far.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>High visibility with PPAs in place </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company has already signed PPAs for 100 per of its FY26 and 83 per of its FY27 capacity. This gives the company high visibility for future revenue streams. Additionally, it has secured grid connectivity for all under-construction projects, easing concerns about grid availability.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Focus on High-IRR, complex projects </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tACME Solar’s growing focus on complex projects, like FDRE and hybrid systems, positions it well for strong returns (mid-to-high teens IRRs) as competition in traditional solar and wind projects has increased. The company’s investment in wind energy also sets it apart from competitors.</div>\n<div>\r\n\t“ACME is one of the few players building wind capabilities. This gives the company an edge over peers, such as NTPC Green, which is less focused on wind energy,” Motilal Oswal analysts said, in a note.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Capital and growth funding plans </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnalysts noted that the company plans to fund its pipeline through a combination of project debt, operating cash flow, and debt refinancing. With major capex planned for FY25-27, the company has already secured debt for 1.7GW of projects, and operating cash flow is expected to remain strong, aiding growth financing.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Key risks</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThough ACME Solar remains confident in signing PPAs for all its under-construction projects, the increasing competitive pressure in the RE sector, especially for plain solar/wind projects, poses a risk. However, the company’s focus on complex projects with higher IRRs mitigates some of this risk.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt 10:11 AM, ACME Solar share price was trading 6.65 per cent higher at Rs 221.40 per share. In comparison, BSE Sensex was trading 0.14 per cent lower at 78,471.32 levels.</div></div>",
            "pub_date": "2025-02-05 13:05:26",
            "link": "https://www.business-standard.com/markets/news/motilal-oswal-says-buy-acme-solar-for-59-upside-initiates-coverage-125020500322_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500322"
        },
        {
            "title": "Delhi Assembly elections: 8.10 per cent voter turnout till 9 am in polls",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tA turnout of 8.10 per cent was recorded in the Delhi Assembly polls till 9 am on Wednesday with President Droupadi Murmu, Congress leader Rahul Gandhi and Union minister S Jaishankar among the early voters.</p>\n<p>\r\n\tAround 15.6 million voters are eligible to cast their votes. Polling began at 7 am and will conclude at 6 pm.</p>\n<p>\r\n\tAccording to Election Commission data, 8.10 per cent of voters had cast their votes till 9 am.</p>\n<p>\r\n\tNorth East district recorded the highest voter turnout of 10.7 per cent. Mustafabad was leading among constituencies with 12.43 per cent polling, the data showed.</p>\n<p>\r\n\tPolling is underway at 13,766 stations across all of Delhi's 70 assembly constituencies to decide the fate of 699 candidates in a contest that could reshape the political landscape of the capital.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tWhile AAP is eyeing a third consecutive term, BJP and Congress are hoping for a resurgence in Delhi.</p>\n<p>\r\n\tIn the 2020 assembly polls, Delhi recorded a voter turnout of 62.59 per cent while only 56 per cent of voters participated in the 2024 Lok Sabha elections.</p>\n<p>\r\n\tPresident Droupadi Murmu, Congress leader Rahul Gandhi, Union ministers S Jaishankar and Hardeep Singh Puri, and Chief Election Commissioner Rajiv Kumar were among those who cast their votes early in the morning.</p>\n<p>\r\n\tDelhi Lt Governor V K Saxena, Chief Minister Atishi, Delhi Chief Electoral Officer Alice Vaz, and Delhi Police Commissioner Sanjay Arora were also among those who cast their votes soon after the polling began.</p>\n<p>\r\n\tDelhi BJP president Virendra Sachdeva and party candidates Parvesh Verma (New Delhi) and Kapil Mishra (Karwal Nagar), Congress candidates Sandeep Dikshit (New Delhi) and Alka Lamba (Kalkaji) were also among the early voters.</p>\n<p>\r\n\tAAP's Jangpura candidate and former deputy CM Manish Sisodia, party candidates Saurabh Bharadwaj (Greater Kailash) and Sanjeev Jha (Burari) also voted in the initial hours.</p><p></p></div>",
            "pub_date": "2025-02-05 13:00:37",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-assembly-elections-8-10-per-cent-voter-turnout-till-9-am-in-polls-125020500265_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500265"
        },
        {
            "title": "Here's why stock broking firm Angel One share price gained 6% in trade",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAngel One shares rose 6.2 per cent on Wednesday, logging an intraday high at Rs 2,497.2 per share on BSE. The buying on the counter came after the stock broking company released its January business update. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAround 9:59 AM, Angel One share price was up 4.69 per cent at Rs 2,460 per share on BSE. In comparison, the BSE Sensex was down 0.11 per cent at 78,501.11. The market capitalisation of the company stood at Rs 22,207.05 crore. The 52-week high of the stock was at Rs 3,502.6 per share and the 52-week low was at Rs 2,027.25 per share. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company released its January update on Wednesday before market hours. The report showed that Angel One's client base increased 47.5 per cent year-on-year (Y-o-Y) to 3.01 crore as compared to 2.04 crore. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, the number of orders reduced by 24.3 per cent to 12.59 crore as compared to 16.63 crore a year ago. Its average daily turnover based on notion decreased 29.8 per cent to Rs 30,82,400 crore as compared to 43,87,900 crore a year ago. Average daily turnover based on option premium increased 28.3 per cent year-on-year (Y-o-Y) to Rs 85,000 crore as compared to Rs 66,200 crore a year ago. </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn Q3, Angel One reported its third-quarter profit at Rs 281 crore as compared to Rs 260.31 crore, a rise of 8 per cent Y-o-Y. However, on a sequential basis, profit fell 33.5 per cent.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company's revenue for the quarter under review stood at Rs 1,262 crore as compared to Rs 1,059 crore a year ago, up 19.2 per cent. On a quarter-on-quarter (Q-o-Q) basis revenue decreased by 16 per cent. <small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/news/angel-one-shares-drop-7-in-trade-here-s-how-company-fared-in-q3fy25-125011400276_1.html\" target=\"_blank\">Angel One shares drop 7% in trade; here's how company fared in Q3FY25</a></strong></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAngel One is a stock brokerage firm that provides online trading and investment services, offering a range of financial products like stocks, mutual funds, commodities, and more. The company operates through a digital platform, offering a user-friendly interface for retail investors to trade and manage their portfolios.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt also provides various tools for research, financial advisory, and stock recommendations. They focus on simplifying investing and trading for individuals with varying levels of experience. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the past one year, Angel One shares have lost 26.8 per cent against Sensex's rise of 9.5 per cent. </div></div>",
            "pub_date": "2025-02-05 13:00:35",
            "link": "https://www.business-standard.com/markets/news/here-s-why-stock-broking-firm-angel-one-share-price-gained-6-in-trade-125020500291_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500291"
        },
        {
            "title": "US Postal Service suspends some inbound parcels from China amid trade war",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe United States Postal Service (USPS) announced a temporary suspension of international package acceptance from China and Hong Kong, effective February 4.</p>\n<p>\r\n\tThis suspension only applies to inbound parcels from China and Hong Kong Posts and does not affect the delivery of letters and flats from these regions.</p>\n<p>\r\n\tUSPS shared the announcement on Tuesday (local time) on its official website and wrote, \"Effective Feb. 4, the Postal Service will temporarily suspend only international package acceptance of inbound parcels from China and Hong Kong Posts until further notice. Note the flow of letters and flats from China and Hong Kong will not be impacted.\"</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tTrump, who recently took office, imposed 25 per cent tariffs on goods imported from China, Mexico, and Canada over the weekend. Later on Monday, US President Donald Trump postponed the tariffs on Mexico and Canada by a month under ongoing negotiation on terms.</p>\n<p>\r\n\tIn response to the US government's announcement of a 10 per cent tariff on all Chinese goods exported to America, China too imposed additional tariffs on various US goods, including a 15 per cent tariff on coal and liquefied natural gas, and a 10 per cent tariff on crude oil starting from February 10.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tRecently Al Jazeera reported that Trump is also expected to speak with Chinese President Xi Jinping citing Trump's top trade adviser, Peter Navarro.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tWhite House press secretary Karoline Leavitt did not provide a specific timeline for the Trump-Xi call but said it would happen \"soon.\"</p>\n<p>\r\n\tChina has strongly denounced US President Donald Trump's decision of imposing tariffs, while also leaving the door open for talks to avoid a deepening conflict.</p>\n<p>\r\n\tMeanwhile, Mexico's President Claudia Sheinbaum and Canada's Prime Minister Justin Trudeau have announced a 30-day suspension on US tariffs after an agreement was reached with Trump, as per Al Jazeera.</p>\n<p>\r\n\tThe Mexican and Canadian leaders have agreed to send police to their borders with the US to fight drug trafficking and undocumented migration.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tA senior trade adviser to Trump said that Mexico has been \"very cooperative\" in efforts to crack down on the influx of fentanyl into the US, and Canada has started to understand that it needs to do more, Al Jazeera reported.</p><p></p></div>",
            "pub_date": "2025-02-05 12:55:25",
            "link": "https://www.business-standard.com/world-news/us-postal-service-suspends-some-inbound-parcels-from-china-amid-trade-war-125020500227_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500227"
        },
        {
            "title": "MTNL share price hits 20% upper circuit on heavy volumes; up 28% in 2 days",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tMahanagar Telephone Nigam Limited share price (MTNL share price) was locked in the 20-per cent upper circuit, at Rs 57.16 per share, on the BSE today. The rise in MTNL share in Wednesday's intraday trade came was led by heavy volumes. In the last two day, the stock of the state-owned telecom cellular and fixed line services provider has surged 28 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTill 09:43 AM, average trading volume on the counter had jumped over three fold with a combined 21.17 million equity shares, representing 3.4 per cent of total equity of MTNL, having changed hands on the NSE and BSE.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<h3>\r\n\tMTNL share price news</h3>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFinance Minister Nirmala Sitharaman, while presenting Union Budget 2025, on February 1, announced a new scheme to provide broadband connectivity to all government secondary schools and health centres.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Broadband connectivity will be added to all government secondary schools and primary healthcare centres in rural areas under the 'Bharat Net' project,\" the finance minister had said while presenting Budget 2025 in the Parliament.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, news reports suggest that the Government will likely allow MTNL and BSNL to monetise their assets.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to a report by Hindi business news channel, CNBC Awaaz, Centre has cleared decks to monetise non-core properties worth Rs 16,000-crore. A Group of Ministers has also waived off various charges and fees on these properties.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBusiness Standard, however, could not verify these reports.</div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tMTNL share price history</h3>\n<div>\r\n\tThe stock price of MTNL hit a low of Rs 41.40 on January 28, 2025, and has corrected 59 per cent from its 52-week high level of Rs 101.88, touched on July 29, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn December 17, 2024, CARE Ratings had upgraded long-term debt instruments (bonds issue) of MTNL to 'CARE AAA', and simultaneously removed the 'Rating Watch with Negative Implications' and assigned a 'Stable' outlook.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"This rating action follows sustained track record of timely fund infusion by Government of India (GoI) in accordance with the stipulated T-structure payment mechanism (SPM), besides comprehensive understanding of the escrow account’s operational management maintained with Bank of India for servicing Sovereign Guarantee (SG) backed bonds,\" the rating agency said in its rationale.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe outlook for MTNL, thus, is expected to be stable, backed by the expectation of consistent support to be extended by the Government of India. Furthermore, operating in a strategically important sector and support mechanisms such as sovereign guarantees shall ensure timely servicing of the obligations providing stability to credit enhanced ratings.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMNTL enjoys a 'Navratna Status' that gives greater autonomy to central public sector enterprises (CPSEs) in their investment and capital expenditure (capex) decisions. Such a status also aims at facilitating expansion of its operations in domestic and global markets, CARE Ratings said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn October 2019, considering MTNL's legacy and strategic importance, GoI announced a revival plan for MTNL and BSNL and continued to support the company’s funding requirements through issuance of LoC. To make public sector units (PSUs) financially viable, the Union Cabinet approved a second revival plan for BSNL and MTNL (the telcos) amounting to Rs 1.64 trillion on July 27, 2022. Revival plan is aimed at upgrading services, rolling out 4G services, augmenting the telecom network, and de-stressing balance sheets.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs BSNL is handling MTNL's operations, fund infusion per revival package has taken place in BSNL, which is managing combined capex for the telcos. Progress on monetisation of MTNL’s certain identified land assets has also been slow, which has since been transferred from the Department of Investment and Public Asset Management (DIPAM) to the Department of Public Enterprise (DPE), CARE Ratings said.</div></div>",
            "pub_date": "2025-02-05 12:55:24",
            "link": "https://www.business-standard.com/markets/news/mtnl-zooms-20-on-heavy-volumes-surges-28-in-2-days-125020500268_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500268"
        },
        {
            "title": "Late night FIRs against AAP leaders Kejriwal, Atishi and Amanatullah Khan",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tDelhi Police have registered late night FIRs against the Aam Aadmi Party (AAP) candidates, including former Delhi CM Arvind Kejriwal, Kalkaji candidate Atishi Marlena, and Okhla constituency candidate Amanatullah Khan for violating the Model Code of Conduct (MCC). Additionally, the police also registered an FIR against AAP MLA Dinesh Mohaniya after a woman filed a complaint against him for giving a flying kiss to her during the poll campaign.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, polling for 70 assembly seats began on Wednesday morning in Delhi, as voters cast their ballots for the 8th Assembly amid tight security. Voting commenced at 7.00 am and will continue till 6.00 pm, officials said.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tFIR against AAP MLA Dinesh Mohaniya for sexual harrassment</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAam Aadmi Party (AAP) legislator Dinesh Mohaniya has been booked for allegedly misbehaving with a woman, making inappropriate gestures, and blowing flying kisses at her while campaigning for the <a href=\"https://www.business-standard.com/elections/delhi-elections/delhi-assembly-election-2025-voting-live-updates-5-feb-bjp-aap-congress-delhi-vidhan-sabha-polling-percentage-125020500062_1.html\" target=\"_blank\">Delhi Assembly elections</a>, police said on Tuesday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe FIR, registered against the Sangam Vihar MLA, includes charges of molestation and sexual harassment. The woman, in her complaint, alleged that Mohaniya blew flying kisses at her during the campaign and submitted a video as evidence.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe incident comes on the day Delhi heads to the polls. Mohaniya, a three-time MLA from Sangam Vihar, is contesting from the constituency once again.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tFIR Against Amanatullah Khan</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe police took action after a video emerged allegedly showing the AAP leader roaming in his Okhla constituency with his supporters after the official campaigning period had ended.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe DCP, South East Delhi, on the official handle on X posted, \"In this matter, FIR No 95/25 under section 223/3/5 BNS &amp; 126 RP Act against <a href=\"https://www.business-standard.com/about/who-is-amanatullah-khan\" target=\"_blank\">Amanatullah</a> has been registered at Police Station Jamia Nagar for violating MCC.\"</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tFIR against Arvind Kejriwal</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA day before the Delhi Assembly elections, an FIR was registered against <a href=\"https://www.business-standard.com/about/what-is-aam-aadmi-party-aap\" target=\"_blank\">Aam Aadmi Party (AAP)</a> chief and former Delhi CM <a href=\"https://www.business-standard.com/about/who-is-arvind-kejriwal\" target=\"_blank\">Arvind Kejriwal</a> under multiple sections of the Bharatiya Nyaya Sanhita (BNS) Act in Kurukshetra, Haryana. The complaint was filed by Shahbad resident Jagmohan Manchanda, accusing Kejriwal of falsely alleging that the Haryana government had \"poisoned\" the Yamuna’s waters.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tKejriwal and other AAP leaders have been booked under Sections 192, 196(1), 197(1), 248(a), and 299 of the BNS Act. The FIR states that the complainant, an advocate and public-spirited individual, was aggrieved by the statements made by Kejriwal.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis legal action comes shortly after Delhi Police also registered a case against AAP leader Atishi for allegedly violating the Model Code of Conduct.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn response, Kejriwal took to the social media to denounce the FIR, accusing the Election Commission of India (ECI) and Delhi Police of acting in favour of the BJP. He claimed that their actions were aimed at disrupting the electoral process, protecting BJP’s interests, and facilitating the distribution of liquor and money to sway voters.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tFIR against Atishi Marlena</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe police also lodged an FIR against the CM <a href=\"https://www.business-standard.com/about/who-is-atishi\" target=\"_blank\">Atishi</a> on Tuesday over violation of MCC. The South East Delhi DCP on Tuesday stated that AAP candidate Atishi, along with 50-70 supporters and 10 vehicles, was found violating the Model Code of Conduct (MCC) in Kalkaji.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"On February 4 at 12:30 am, AAP candidate from Kalkaji (AC-51), along with a group of 50-70 people and 10 vehicles, was found at Fateh Singh Marg. Police instructed them to vacate the area due to MCC restrictions. Following a complaint by the Flying Squad Team (FST), a case under Section 223 of the BNS Act and Section 126 of the RP Act was registered at Govindpuri Police Station,\" the DCP said.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tOther FIR against AAP leaders</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a separate incident, DCP, South East Delhi, reported that two AAP members, Ashmit and Sagar Mehta, allegedly obstructed and assaulted a head constable during a police response.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"On February 4 at 12:59 am, a gathering was reported at Baba Fateh Singh Marg, Govindpuri. Head Constable Kaushal Pal responded and began videography. AAP members Ashmit and Sagar Mehta obstructed and assaulted him,\" the police stated.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn FIR (No. 106/25) has been registered under Sections 221, 132, 121(1), and 3(5) of the BNS Act at Govindpuri Police Station for obstructing public duty and assaulting a police officer on duty. The investigation is ongoing.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em>(With inputs from ANI)</em></div></div>",
            "pub_date": "2025-02-05 12:45:25",
            "link": "https://www.business-standard.com/elections/delhi-elections/fir-aap-leaders-kejriwal-atishi-amanatullah-mcc-violation-delhi-voting-125020500259_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500259"
        },
        {
            "title": "CIA offers staff buyouts as Donald Trump looks to shrink workforce",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Natalia Drozdiak</strong></div>\n<small class=\"brtagPara\"> </small>\n<div>\r\n\tThe Central Intelligence Agency has offered staff buyouts to shrink the workforce in line with the Trump administration’s broader job cuts across the government and to sharpen the spy service’s focus on top priorities like China. <small class=\"brtag\"> </small></div>\n<div>\r\n\tAs part of the offer sent to the workforce on Tuesday, employees could receive pay and benefits through Sept 30, without having to work. It’s unclear how many will take the offer at the agency, where staff retention is high and workers often stay for decades. <small class=\"brtagPara\"> </small>\n<div>\r\n\t\tJohn Ratcliffe, President Donald Trump’s nominee to lead the CIA, promised in his Senate confirmation hearing to focus on the threats posed by China and expand the volume of intelligence that officers collect around the world.</div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“Director Ratcliffe is moving swiftly to ensure the CIA workforce is responsive to the administration’s national security priorities,” the CIA said in an emailed statement, adding the efforts were part of a strategy to “infuse the agency with renewed energy, provide opportunities for rising leaders to emerge, and better position the CIA to deliver on its mission.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe move, first reported by the Wall Street Journal, comes after 2 million federal workers were given similar offers as part of Trump ally Elon Musk’s efforts to cut government headcount and programs. That has initially excluded national security agencies but Ratcliffe decided to allow the CIA to participate.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 12:45:25",
            "link": "https://www.business-standard.com/world-news/cia-offers-staff-buyouts-as-donald-trump-looks-to-shrink-workforce-125020500269_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500269"
        },
        {
            "title": "BlackRock planning to hire 1,200 people to expand 2 support hubs in India",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Preeti Singh</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBlackRock Inc. plans to hire nearly 1,200 people to expand two support hubs in India and build out its artificial intelligence capabilities in the country, according to people familiar with the matter.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe world’s largest asset manager is hiring for its iHubs, as the centers are known, in Mumbai and Gurugram, a satellite town near New Delhi. BlackRock is also inheriting a so-called global capabilities center with roughly 1,500 staff in Bangalore through its proposed purchase of data firm Preqin, said the people, who declined to be identified citing confidential information.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe new hires will bolster headcount in this area by about a third, adding to the roughly 3,500 staff in the Gurugram and Mumbai offices, the people said. BlackRock wants to build out its artificial intelligence team, and will hire engineers and data experts when the plans firm up, the people said. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA spokesperson for the New York-based firm declined to comment on the hiring plans. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOnce an outpost for grunt back-office work, India has witnessed a rapid increase in global capability centers, where employees include engineers and lawyers for companies ranging from banks to pharmaceutical firms. India is expected to become a $110 billion market for these GCCs by 2030, and will employ more than 4.5 million people, according to a report from Ernst &amp; Young.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFinancial firms such as JPMorgan Chase &amp; Co., HSBC Holdings Plc and Apollo Global Management Inc. employ thousands in their India hubs. Goldman Sachs Group Inc. has invested in its GCCs in Bengaluru and Hyderabad that employ about 9,000 people, according to the firm’s website. </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBlackRock’s iHubs work on value-added products and services ranging from investment research to risk management, financial engineering, business operations and data analytics, the people said. Several of these areas incorporate and leverage artificial intelligence, they added. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTo accommodate more employees and support future growth, BlackRock has leased additional office space in the Mumbai suburb of Goregaon from developer Oberoi Realty Ltd. in a deal worth nearly 4 billion rupees ($45.9 million), the people said. Economic Times first reported the real estate deal. </div></div>",
            "pub_date": "2025-02-05 12:40:29",
            "link": "https://www.business-standard.com/companies/news/blackrock-plans-to-hire-1-200-people-to-expand-2-support-hubs-in-india-125020500254_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500254"
        },
        {
            "title": "Late night FIRs against AAP leaders Kejriwal, Atishi and Amanatullah Khan",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tDelhi Police have registered late night FIRs against the Aam Aadmi Party (AAP) candidates, including former Delhi CM Arvind Kejriwal, Kalkaji candidate Atishi Marlena, and Okhla constituency candidate Amanatullah Khan for violating the Model Code of Conduct (MCC). Additionally, the police also registered an FIR against AAP MLA Dinesh Mohaniya after a woman filed a complaint against him for giving a flying kiss to her during the poll campaign.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, polling for 70 assembly seats began on Wednesday morning in Delhi, as voters cast their ballots for the 8th Assembly amid tight security. Voting commenced at 7.00 am and will continue till 6.00 pm, officials said.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tFIR against AAP MLA Dinesh Mohaniya for sexual harrassment</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAam Aadmi Party (AAP) legislator Dinesh Mohaniya has been booked for allegedly misbehaving with a woman, making inappropriate gestures, and blowing flying kisses at her while campaigning for the <a href=\"https://www.business-standard.com/elections/delhi-elections/delhi-assembly-election-2025-voting-live-updates-5-feb-bjp-aap-congress-delhi-vidhan-sabha-polling-percentage-125020500062_1.html\" target=\"_blank\">Delhi Assembly elections</a>, police said on Tuesday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe FIR, registered against the Sangam Vihar MLA, includes charges of molestation and sexual harassment. The woman, in her complaint, alleged that Mohaniya blew flying kisses at her during the campaign and submitted a video as evidence.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe incident comes on the day Delhi heads to the polls. Mohaniya, a three-time MLA from Sangam Vihar, is contesting from the constituency once again.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tFIR Against Amanatullah Khan</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe police took action after a video emerged allegedly showing the AAP leader roaming in his Okhla constituency with his supporters after the official campaigning period had ended.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe DCP, South East Delhi, on the official handle on X posted, \"In this matter, FIR No 95/25 under section 223/3/5 BNS &amp; 126 RP Act against <a href=\"https://www.business-standard.com/about/who-is-amanatullah-khan\" target=\"_blank\">Amanatullah</a> has been registered at Police Station Jamia Nagar for violating MCC.\"</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tFIR against Arvind Kejriwal</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA day before the Delhi Assembly elections, an FIR was registered against <a href=\"https://www.business-standard.com/about/what-is-aam-aadmi-party-aap\" target=\"_blank\">Aam Aadmi Party (AAP)</a> chief and former Delhi CM <a href=\"https://www.business-standard.com/about/who-is-arvind-kejriwal\" target=\"_blank\">Arvind Kejriwal</a> under multiple sections of the Bharatiya Nyaya Sanhita (BNS) Act in Kurukshetra, Haryana. The complaint was filed by Shahbad resident Jagmohan Manchanda, accusing Kejriwal of falsely alleging that the Haryana government had \"poisoned\" the Yamuna’s waters.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tKejriwal and other AAP leaders have been booked under Sections 192, 196(1), 197(1), 248(a), and 299 of the BNS Act. The FIR states that the complainant, an advocate and public-spirited individual, was aggrieved by the statements made by Kejriwal.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis legal action comes shortly after Delhi Police also registered a case against AAP leader Atishi for allegedly violating the Model Code of Conduct.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn response, Kejriwal took to the social media to denounce the FIR, accusing the Election Commission of India (ECI) and Delhi Police of acting in favour of the BJP. He claimed that their actions were aimed at disrupting the electoral process, protecting BJP’s interests, and facilitating the distribution of liquor and money to sway voters.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tFIR against Atishi Marlena</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe police also lodged an FIR against the CM <a href=\"https://www.business-standard.com/about/who-is-atishi\" target=\"_blank\">Atishi</a> on Tuesday over violation of MCC. The South East Delhi DCP on Tuesday stated that AAP candidate Atishi, along with 50-70 supporters and 10 vehicles, was found violating the Model Code of Conduct (MCC) in Kalkaji.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"On February 4 at 12:30 am, AAP candidate from Kalkaji (AC-51), along with a group of 50-70 people and 10 vehicles, was found at Fateh Singh Marg. Police instructed them to vacate the area due to MCC restrictions. Following a complaint by the Flying Squad Team (FST), a case under Section 223 of the BNS Act and Section 126 of the RP Act was registered at Govindpuri Police Station,\" the DCP said.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tOther FIR against AAP leaders</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a separate incident, DCP, South East Delhi, reported that two AAP members, Ashmit and Sagar Mehta, allegedly obstructed and assaulted a head constable during a police response.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"On February 4 at 12:59 am, a gathering was reported at Baba Fateh Singh Marg, Govindpuri. Head Constable Kaushal Pal responded and began videography. AAP members Ashmit and Sagar Mehta obstructed and assaulted him,\" the police stated.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn FIR (No. 106/25) has been registered under Sections 221, 132, 121(1), and 3(5) of the BNS Act at Govindpuri Police Station for obstructing public duty and assaulting a police officer on duty. The investigation is ongoing.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em>(With inputs from ANI)</em></div></div>",
            "pub_date": "2025-02-05 12:40:28",
            "link": "https://www.business-standard.com/elections/delhi-elections/fir-aap-leaders-kejriwal-atishi-amanatullah-mcc-violation-delhi-voting-125020500259_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500259"
        }
    ]
}