{
    "data": [
        {
            "title": "Preview: Will SBI Q3 profit rise or fall? Provisions hold key, say analysts",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>SBI Q3 preview:</strong> The largest government-owned bank, State Bank of India (SBI), is expected to report a strong set of <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">results for the October-December quarter (Q3)</a> of the current financial year 2024-25 (FY25).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to analysts, the public sector bank (PSB) is estimated to report a double digit net profit growth on the back of healthy loan book expansion and stable asset quality.</div>\n<h2>\r\n\tSBI Q3 results date and time</h2>\n<div>\r\n\tState Bank of India (SBI) is scheduled to report its Q3 results on Thursday, February 6.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"This is to inform you that a meeting of the Central Board of the Bank will be held on Thursday, February 6, 2025, at Mumbai, inter-alia, to consider the financial results of the Bank for the quarter ended 31.12.2024,\" SBI said in a stock exchange filing on January 16, 2025.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, SBI's Q3 Analyst Meet will be conducted on February 6, 2025, at 5.00 PM post Q3FY25 results at State Bank Bhavan Auditorium, it added.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/itc-q3-preview-cigarette-volume-may-remain-resilient-fmcg-biz-to-grow-6-125020400495_1.html\" target=\"_blank\">ITC Q3 preview: Cigarette volume may remain resilient; FMCG biz to grow 6%</a></strong><small class=\"brtagPara\"> </small> Ahead of SBI Q3 results, <a href=\"https://www.business-standard.com/markets/state-bank-of-india-share-price-1375.html\" target=\"_blank\"><strong>SBI share price</strong></a> was trading 1.9 per cent higher on Tuesday, February 4, 2025. Thus far in 2025, SBI share price has slipped 4.2 per cent on the BSE as against 1.2 per cent decline in the benchmark Sensex index. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tSBI Q3 results expectations:</h2>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tNomura</h3>\n<div>\r\n\tGlobal brokerage Nomura expects SBI to report a solid growth of 86 per cent year-on-year (Y-o-Y) in net profit. It pegs SBI Q3 net profit at Rs 17,010 crore as against Q3FY24 net profit of Rs 9,160 crore. On a sequential basis, Nomura expects Q3 net profit to decline 7 per cent from Rs 18,330 crore.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOperationally, the brokerage expects SBI's net interest income (NII) to grow 7 per cent Y-o-Y to Rs 42,560 crore from Rs 39,820 crore and 2 per cent Q-o-Q from Rs 41,620 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPre-provision operating profit (PPOP), too, is expected to surge 30 per cent Y-o-Y to Rs 26,450 crore as against Rs 20,340-crore PPOP in Q3FY24. In Q2FY25, PPOP was Rs 29,290 crore.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/britannia-s-q3-pat-likely-to-slip-5-yoy-margins-may-contract-analysts-125020400527_1.html\" target=\"_blank\">Britannia's Q3 PAT likely to slip 5% YoY; margins may contract: Analysts</a> </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"We expect SBI's Q3 deposit growth to be soft, rising 9 per cent Y-o-Y/1 per cent Q-o-Q to Rs 51.94 trillion. Loan growth, however, is projected to be healthy at 14 per cent Y-o-Y/4 per cent Q-o-Q to Rs 40.11 trillion. We expect net interest margin (NIM) to decline 10bps Y-o-Y/2bps Q-o-Q to 3.1 per cent, aided by re-pricing of MCLR loans. Credit cost are expected to remain under control at 0.4 per cent,:\" Nomura said in its Q3 results preview report.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tCiti Research</h3>\n<div>\r\n\tCiti Research estimates domestic advances growth to align with system average growth, at 13 per cent Y-o-Y/3 per cent Q-o-Q, to Rs 39.75 trillion. The bank's focus towards more secured products may continue in Q3FY25, it added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBesides, it expects SBI's Q3 deposit book to stand at Rs 52.48 trillion, up 10 per cent Y-o-Y/3 per cent Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tComfortable loan-to-deposit ratio (LDR) may allow its deposit growth to lag advances growth, Citi noted.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Post contraction of 8bps in domestic NIM in Q2FY25, we expect SBI Q3 NIM to be broadly stable during the quarter (as MCLR hike benefit over past 6 months may reflect in Q3). However, a fall in global benchmark rates may put some pressure on overseas NIMs,\" the research note said.<small class=\"brtagPara\"> </small> <strong>ALSO READ: </strong><a href=\"https://www.business-standard.com/markets/news/hero-motocorp-q3-preview-net-profit-may-climb-up-to-rs-1-130-crore-yoy-125020400683_1.html\" target=\"_blank\"><strong>Hero MotoCorp Q3 Preview: Net profit may climb up to Rs 1,130 crore YoY</strong></a></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt pegs NII at Rs 42,725 crore (up 7 per cent Y-o-Y/3 per cent Q-o-Q); PPOP at Rs 25,786 crore (up 17 per cent Y-o-Y/down 12 per cent Q-o-Q); net profit at Rs 15,097 crore (up 65 per cent Y-o-Y/down 18 per cent Q-o-Q).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNIM is seen at 3 per cent, down 8bps Y-o-Y/3bps Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the asset quality front, Citi Research expects slippages to be contained, along with resolution and pull-back of SMA-1/2.</div>\n<div>\r\n\tTrends in slippages from unsecured personal loans (Xpress Credit) will be key.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCiti Research analysts anticipate SBI to drive further cost-to-income (C/I) ratio efficiency by shoring up income and improving productivity.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tPrabhudas Lilladher</h3>\n<div>\r\n\tThe brokerage has the most cautious estimate for SBI Q3 2025 results. It expects SBI Q3 profit to rise just 7 per cent Y-o-Y to Rs 15,463.2 crore. This would be lower by 15.6 per cent Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tQ3 NII growth, too, is seen muted at 7.5 per cent Y-o-Y/2.8 per cent Qo-Q at Rs 42,795.2 crore. Q3 PPOP, on the other hand, is anticipated at Rs 25,627.3 crore, up 26 per cent Y-o-Y/down 12.5 per cent Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tProvisions, Prabhudas Lilladher analysts said, are expected to increase by 5 per cent Q-o-Q/588 per cent Y-o-Y to Rs 4,731 crore, leading to a fall in PAT. Asset quality, in terms of gross non-performing asset (GNPA) ratio, is expected to worsen by 7 bps Q-o-Q to 2.06 per cent, while credit cost is expected to increase by 1bps to 0.48 per cent.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tNuvama Institutional Equities</h3>\n<div>\r\n\tThis brokerage, too, has subdued NII estimates for SBI Q3 results. It expects SBI Q3 NII at Rs 42,120 crore, up around 6 per cent Y-o-Y and 1.2 per cent Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIncluding Trading Gains of Rs 3,000 crore (up 20 per cent Y-o-Y/down 35.4 per cent Q-o-Q), Other Income of Rs 9,830 crore (up 9.8 per cent Y-o-Y/down 7.5 per cent Q-o-Q), and Non-interest Income of Rs 12,830 crore (up 12 per cent Y-o-Y/down 16 per cent Q-o-Q), Total Revenue is projected at Rs 54,950 crore (up 7.2 per cent Y-o-Y/down 3.4 per cent Q-o-Q).</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNuvama estimates SBI Q3 PPOP to come at Rs 27,590 crore (up 109 per cent Y-o-Y/down 6 per cent Q-o-Q), and net profit at Rs 17,090 crore (up 86.5 per cent Y-o-Y/down 6.8 per cent Q-o-Q).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis brokerage, also, expects provisions to surge 554 per cent Y-o-Y/flat Q-o-Q at Rs 4,500 crore.</div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tMotilal Oswal Financial Services</h3>\n<div>\r\n\tMOFSL forecasts SBI's provisions to remain elevated in Q3FY25, at Rs 5,160 crore, limiting net profit growth at 77 per cent Y-o-Y at Rs 16,240 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt expects cost ratios to be slightly higher in the quarter, but asset quality may remain contained. GNPA ratio, MOFSL said, may improve to 2.04 per cent from 2.13 per cent. NNPA ratio, meanwhile, is seen at 0.5 per cent vs 0.53 per cent Q-o-Q.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNIM is expected to be flat. </div></div>",
            "pub_date": "2025-02-06 00:15:30",
            "link": "https://www.business-standard.com/markets/news/preview-will-sbi-q3-profit-rise-or-fall-provisions-hold-key-say-analysts-125020400731_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400731"
        },
        {
            "title": "IDBI Bank could increase rates on non-callable deposits post LCR norms",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tIf the proposed liquidity coverage ratio (LCR) norms were to come into effect from April 1, private sector lender IDBI Bank would look at raising interest rates on non-callable deposits by 10–25 basis points, said a senior executive at the bank.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile banks have asked the Reserve Bank of India (RBI) to implement the LCR norms in a staggered manner, the RBI has so far not deferred the implementation date but has asked for more data from banks on their LCR status and the potential impact of implementing the norms from April 1.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn July 2024, the RBI proposed to impose an additional run-off factor of 5 per cent on both stable and less stable retail deposits that are enabled with internet and mobile banking facilities. Run-offs refer to withdrawals of deposits by individuals or businesses, which are not anticipated by banks.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to the proposed norms, stable retail deposits enabled with internet and mobile banking will have a 10 per cent run-off factor, while less stable deposits will have a 15 per cent run-off factor. Current norms mandate that banks maintain a 100 per cent liquidity coverage ratio (LCR).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis means the stock of high-quality liquid assets (HQLAs) should be at least equal to total net cash outflows. The LCR promotes the short-term resilience of banks to potential liquidity disruptions by ensuring that they have sufficient HQLAs to survive an acute stress scenario lasting 30 days.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAdditionally, the proposed norms state that Level 1 HQLAs in the form of government securities should be valued at an amount not greater than their current market value, adjusted for applicable haircuts in line with the margin requirements under the Liquidity Adjustment Facility (LAF) and Marginal Standing Facility (MSF).</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-06 00:15:28",
            "link": "https://www.business-standard.com/industry/banking/idbi-bank-could-increase-rates-on-non-callable-deposits-post-lcr-norms-125020501711_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501711"
        },
        {
            "title": "Happiest Minds Q3FY25 results: PAT down 16% on higher finance costs",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tHappiest Minds Technologies, a mid-tier IT services firm, reported a 16 per cent year-on-year (Y-o-Y) drop in its profit after tax (PAT) for the third quarter of the current financial year (FY25) at Rs 50 crore due to higher finance costs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, the revenue for the quarter grew 27.5 per cent to Rs 553 crore compared with the year-ago period.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“During the quarter, we witnessed healthy demand from BFSI, healthcare, CPG, and manufacturing,” said Joseph Anantharaju, executive vice chairman and CEO of Product and Digital Engineering Services (PDES).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnantharaju’s comments come in the backdrop of larger IT services companies noticing some green shoots in demand after a prolonged period of lull which dampened the mood of the sector.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The results reflect our continued ability to execute and deliver high-quality digital capabilities to our customers. During the quarter, Happiest Minds accelerated its net new growth opportunities while increasing the number of large customers. Our acquisitions are allowing us to diversify our revenue base across geos and verticals while leveraging synergies to accelerate growth,” he added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company also said it would create a GenAI business unit, verticalise into six industry groups, and appoint a chief growth officer to boost growth for the next financial year. “Our goal is to integrate generative AI features into their products, services, and provide them with a competitive advantage. The adoption of this promising technology has picked up speed with our customers embarking on enterprise-wide adoption. Apart from projects already delivered, we have about 15 projects in a proof-of-concept stage which will lead to significant orders/projects in the next financial year,” said executive chairman Ashok Soota.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company currently has a total revenue of $3 million from GenAI projects.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-06 00:10:31",
            "link": "https://www.business-standard.com/companies/results/happiest-minds-q3fy25-results-pat-down-16-on-higher-finance-costs-125020501636_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501636"
        },
        {
            "title": "Secy Group on Asset Monetisation to meet on Thursday; to discuss NMP 2.0",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAhead of a formal rollout of the second edition of the National Monetisation Pipeline (NMP 2.0), valued at Rs 10 trillion, the Core Group of Secretaries on Asset Monetisation (CGAM), chaired by Cabinet secretary TV Somanathan, will meet on Thursday to discuss the final progress of the first phase of the NMP.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis comes as the Centre fine-tunes plans for the second one.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe CGAM, comprising relevant infra secretaries, undertakes periodic review to monitor the progress of transactions. It resolves structural issues, if any, for undertaking the projects in all the sectors covered under the NMP.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Building on the success of the first Asset Monetisation Plan announced in 2021, the second plan for 2025-30 will be launched to plough back capital of Rs 10 trillion in new projects. Regulatory and fiscal measures will be fine tuned to support the plan,” finance minister Nirmala Sitharaman said in her Budget speech on February 1.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBusiness Standard had reported in October that the government had to tweak its monetisation targets in the final year of the first pipeline – FY25 – to Rs 1.9 trillion to get close to its original four-year target of Rs 6 trillion.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSo far, highways, coal, and mines have been the brightest performers for the government in monetisation, achieving nearly Rs 2.7 trillion by the end of FY24.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRailways has been among the worst performers in terms of achieving the target.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring its inception, the national transporter was supposed to contribute a fourth of the total monetisation proceeds with Rs 1.52 trillion in monetisation from trains, stations, and terminals.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt the end of FY24, the Ministry of Railways had monetised assets worth Rs 20,417 crore over the past three financial years.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt achieved 30 per cent of its revised target – much lower than its initial target.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe railways was given a target of Rs 17,000 crore during the current financial year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tQueries sent to NITI Aayog remained unanswered till the time of going to press.</div></div>",
            "pub_date": "2025-02-06 00:10:30",
            "link": "https://www.business-standard.com/economy/news/secy-group-on-asset-monetisation-to-meet-on-thursday-to-discuss-nmp-2-0-125020501677_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501677"
        },
        {
            "title": "Riju Raveendran moves NCLAT against decision to reinstate 2 Byju's lenders",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tRiju Raveendran, the largest shareholder in the cash-strapped edtech firm Byju’s, has moved the National Company Law Appellate Tribunal (NCLAT) challenging a decision to reinstate Glas Trust and Aditya Birla Finance as lenders of the edtech firm.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRiju, brother of founder Byju Raveendran, has challenged a January 29 order of the National Company Law Tribunal (NCLT).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe NCLT had ordered disciplinary action against resolution professional (RP) Pankaj Srivastava and rejected his decision to exclude Glas Trust and Aditya Birla Finance from the Committee of Creditors (CoC) of the edtech firm.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe matter will be heard by the NCLAT on February 6.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBoth Glas Trust and Aditya Birla Finance were part of the CoC last year in August but were later axed from the reconstituted committee. Aditya Birla Finance alleged that the RP had wrongfully classified it as an “operational creditor” instead of financial creditor or lender, while Glas Trust said it was wrongfully ousted from the CoC.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFinancial creditors have a financial contract with the debtor, such as a loan, debt security, or guarantee. Operational creditors provide goods or services to the debtor, such as employees, suppliers, or government entities.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, the NCLT is yet to decide the application by the Board of Control for Cricket in India (BCCI) seeking to settle its dispute with Byju’s for the default of Rs 158 crore.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Wednesday, the suspended director of the edtech firm told the NCLAT that the NCLT had only ruled on the application of the lenders but had not ruled on the application of BCCI.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe NCLT had in July last year started the insolvency proceedings after BCCI alleged that Byju’s had defaulted on Rs 158 crore. But the appellate tribunal halted the proceedings against the firm after it claimed that it had reached an agreement to pay Rs 158 crore to BCCI towards outstanding dues.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLater, Glas Trust moved the Supreme Court, alleging that the money was “illegal” and siphoned from them. In October last year, the apex court set aside the NCLAT order halting the insolvency proceedings against Byju’s.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe matter was then sent back to the NCLT. </div></div>",
            "pub_date": "2025-02-06 00:05:25",
            "link": "https://www.business-standard.com/companies/start-ups/raveendran-moves-nclat-challenging-decision-to-reinstate-2-byju-s-lenders-125020501639_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501639"
        },
        {
            "title": "2 suspected GBS cases from Delhi NCR region admitted in Jaipur",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tTwo more cases of Guillain-Barre Syndrome (GBS), a rare nerve disorder, were reported in the Delhi National Capital Region (NCR), sources said. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Union Health Ministry, however, has not confirmed the development.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOne of the suspects from Gurugram, and the other from Uttar Pradesh, were admitted to Jaipur’s Sawai Man Singh Hospital.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt comes after one of the prominent hospitals in Gurugram claimed to have reported a suspected case of GBS earlier this week.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGBS is a rare neurological disorder that occurs when the body’s immune system attacks its peripheral nervous system, leading to weakness, tingling, and even paralysis. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMaharashtra has witnessed a sudden surge in GBS cases since January. So far, the state has reported 132 confirmed GBS cases. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMaharashtra also has reported five suspected deaths due to this disorder.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSeveral suspected cases were also reported from Assam and Tamil Nadu.   </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Monday, Union Health Minister JP Nadda chaired a review meeting to check the status of GBS in Maharashtra, asking the state to work in coordination with the Centre to explore the possible causes of the outbreak to prevent recurrences in the future.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile assuring the state government of all support in the management of the disease, Nadda asserted that the situation was being closely monitored.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to the World Health Organisation (WHO), while the cause of GBS is not fully understood, most cases follow an infection with a virus or bacteria, leading the immune system to attack the body itself. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Infection with the bacteria Campylobacter jejuni, which causes gastroenteritis (including symptoms of nausea, vomiting, and diarrhoea), is one of the most common risk factors for GBS,” the world health body said.</div></div>",
            "pub_date": "2025-02-06 00:05:25",
            "link": "https://www.business-standard.com/health/2-suspected-gbs-cases-from-delhi-ncr-region-admitted-in-jaipur-125020501642_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501642"
        },
        {
            "title": "Secy Group on Asset Monetisation to meet on Thursday; to discuss NMP 2.0",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAhead of a formal rollout of the second edition of the National Monetisation Pipeline (NMP 2.0) valued at Rs 10 trillion, the Core Group of Secretaries on Asset Monetisation (CGAM), chaired by Cabinet Secretary TV Somanathan, will meet on Thursday to discuss final progress on the first phase of NMP, while ministries fine-tune their plans for the second phase.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe CGAM, comprising relevant infrastructure secretaries, undertakes periodic reviews to monitor the progress of transactions and resolve structural issues, if any, for undertaking projects in all the sectors covered under the NMP.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Building on the success of the first Asset Monetisation Plan announced in 2021, the second plan for 2025-30 will be launched to plough back capital of Rs 10 lakh crore (10 trillion) into new projects. Regulatory and fiscal measures will be fine-tuned to support the plan,” finance minister Nirmala Sitharaman said in her budget speech on February 1.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<em>Business Standard</em> had reported in October that the government had to tweak its monetisation targets in the final year of the first pipeline – FY25 – to Rs 1.9 trillion to get close to its original four-year target of Rs 6 trillion.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSo far, highways, coal, and mines have been the best-performing sectors for the government in monetisation, achieving nearly Rs 2.7 trillion in monetisation proceeds by the end of FY24.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRailways has been among the worst performers in terms of achieving the target. At the time of its inception, the national transporter was expected to contribute a fourth of the total monetisation proceeds, with Rs 1.52 trillion from trains, stations, and terminals.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt the end of FY24, the Ministry of Railways had monetised assets worth Rs 20,417 crore over the past three financial years, achieving 30 per cent of its revised target – much lower than its initial target.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe national transporter was given a target of Rs 17,000 crore in the current financial year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tQueries sent to Niti Aayog remained unanswered at the time of publishing.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-06 00:00:40",
            "link": "https://www.business-standard.com/economy/news/secy-group-on-asset-monetisation-to-meet-on-thursday-to-discuss-nmp-2-0-125020501677_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501677"
        },
        {
            "title": "US military plane carrying 104 illegal Indian immigrants lands in Amritsar",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tA US military aircraft carrying 104 “illegal” Indian immigrants landed at Shri Guru Ramdas Ji International Airport in Amritsar on Wednesday, as President Donald Trump’s administration upped the ante over the immigration issue.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to news agency<em> PTI</em>, 30 of the deportees are from Punjab, 33 each from Haryana and Gujarat, three each from Maharashtra and Uttar Pradesh, and two from Chandigarh.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOpposition parties alleged that the deportees were “handcuffed” and “humiliated”. However, Congress Lok Sabha member Shashi Tharoor, who heads the parliamentary standing committee on external affairs, said the US was entitled to send illegal immigrants back, but his only problem with the deportation was that they were sent back in a military aircraft.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Tharoor-led committee held a meeting on Tuesday where the issue of deportation was discussed. Later in a series of posts on X, he pointed out that there were 725,000 undocumented Indian immigrants in the US, the third-largest group after Mexico and El Salvador. \"Since October 2020, US Customs and Border Protection officials have detained nearly 170,000 Indian migrants attempting to cross the border illegally from either Canada or Mexico. They are all subject to deportation,\" Tharoor said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPunjab’s NRI Affairs minister Kuldeep Singh Dhaliwal, who received the deportees, said 30 of the 104 were from Punjab. “All are healthy and okay. It was a long flight. They had their meal,” he said, adding that the authorities first completed the immigration process of those from Punjab, and then from Haryana, Gujarat, and other states. He urged the Centre to resolve the issue with the US.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDhaliwal said he met some youths from Punjab and asked them about travel agents who sent them to the US. \"Most of them have said that the agents were from Dubai and they spoke to them over the phone. I feel bad for some people who had Canadian visas and visas for other countries. But their work got spoiled when they reached there (US),\" the minister said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEarlier, some reports claimed that US military plane C-17 was bringing back 205 illegal immigrants. The flight landed at 1.55 pm amid tight security outside the airport. According to the sources, the deportees are expected to be allowed to go home following verification and background checks. Police will focus on identifying any deportee with a criminal record, they said.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe North American Punjabi Association (NAPA) on Wednesday urged the Punjab government to establish a rehabilitation fund to support young boys and girls deported from the United States.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-06 00:00:39",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/us-military-plane-carrying-104-illegal-indian-immigrants-lands-in-amritsar-125020501620_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501620"
        },
        {
            "title": "Madhya Pradesh looks to become drone manufacturing hub with new policy",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe Madhya Pradesh government has formulated a new drone policy to foster manufacturing of drones in the state as well as encourage their use across sectors like agriculture, logistics, security and governance.</p>\n<p>\r\n\tThe state cabinet in its meeting on Tuesday approved the Madhya Pradesh Drone Promotion and Utilisation Policy 2025, officials said.</p>\n<p>\r\n\tThe policy focuses on promoting drone manufacturing, assembly, and maintenance. It offers incentives such as subsidies and tax incentives to manufacturers, aiming to make Madhya Pradesh a hub for drone production and services.</p>\n<p>\r\n\tIt provides for a 40 per cent capital investment subsidy with a cap of Rs 30 crore for new investments. Also, a 25 per cent subsidy on lease rent, with a maximum of Rs 5 lakh per year, is provided for three years. A Rs 2 crore R&amp;D grant is provided in identified sectors.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tTo promote skill development in key sectors, Chief Minister's Seekho-Kamao Yojana (MMSKY) offers an incentive of Rs 8,000 per month for up to six months, officials said.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tAlso, 100 per cent stamp duty and registration fee waiver is given for land leased for industrial use, and up to Rs 5 lakh per year with a maximum of Rs 20 lakh is provided for capital support for testing, calibration, and certification during the policy period.</p>\n<p>\r\n\tTo encourage patent filing, Rs 5 lakh for domestic patents and Rs 10 lakh or the actual cost incurred for international patents is borne by the state government.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tMega-scale units making investments of over Rs 50 crore will be eligible for enhanced incentives.</p>\n<p>\r\n\tOfficials said the state government is hoping to attract Rs 370 crore of investment in the sector in the next five years. This would create 8,000 new jobs (2,200 direct and 6,600 indirect).</p>\n<p>\r\n\tWhile the global drone market is expected to grow from $71 billion in 2022 to $144 billion by 2030, the Indian market is projected to rise from $2.71 billion currently to $13 billion by 2030.</p>\n<p>\r\n\tDrones are used in sectors like agriculture, defence and security, logistics, and infrastructure sectors.</p>\n<p>\r\n\tWith 90 per cent of Indian airspace designated as 'Green Zone' for drone operations, their use can lead to economic growth, job creation, and enhanced service delivery in both urban and rural areas.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tMadhya Pradesh wants to leverage drone technology to improve efficiency, reduce costs, and foster innovation, making the state a leading player in the unmanned aerial vehicle (UAV) industry.</p>\n<p>\r\n\tThe state will provide financial support in the form of subsidies and tax incentives will be provided for drone manufacturing and service providers who establish operations in the state.</p>\n<p>\r\n\tDrones can be used in precision agriculture to improve crop monitoring, spraying pesticides, fertilizers, and data collection, leading to higher productivity.</p>\n<p>\r\n\tIn the infrastructure and logistics sectors, drones can be used for surveying and mapping of projects, improving accuracy, and reducing costs.</p>\n<p>\r\n\tDrones can also be used for enhancing surveillance, monitoring infrastructure, and law enforcement. This includes using drones for traffic monitoring, disaster management, and crowd management.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tMadhya Pradesh plans to integrate drones into the public safety framework for rapid response during emergencies.</p><p></p></div>",
            "pub_date": "2025-02-05 23:55:28",
            "link": "https://www.business-standard.com/india-news/madhya-pradesh-looks-to-become-drone-manufacturing-hub-with-new-policy-125020501517_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501517"
        },
        {
            "title": "Secy Group on Asset Monetisation to meet on Thursday; to discuss NMP 2.0",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAhead of a formal rollout of the second edition of the National Monetisation Pipeline (NMP 2.0) valued at Rs 10 trillion, the Core Group of Secretaries on Asset Monetisation (CGAM), chaired by Cabinet Secretary TV Somanathan, will meet on Thursday to discuss final progress on the first phase of NMP, while ministries fine-tune their plans for the second phase.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe CGAM, comprising relevant infrastructure secretaries, undertakes periodic reviews to monitor the progress of transactions and resolve structural issues, if any, for undertaking projects in all the sectors covered under the NMP.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Building on the success of the first Asset Monetisation Plan announced in 2021, the second plan for 2025-30 will be launched to plough back capital of Rs 10 lakh crore (10 trillion) into new projects. Regulatory and fiscal measures will be fine-tuned to support the plan,” finance minister Nirmala Sitharaman said in her budget speech on February 1.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<em>Business Standard</em> had reported in October that the government had to tweak its monetisation targets in the final year of the first pipeline – FY25 – to Rs 1.9 trillion to get close to its original four-year target of Rs 6 trillion.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSo far, highways, coal, and mines have been the best-performing sectors for the government in monetisation, achieving nearly Rs 2.7 trillion in monetisation proceeds by the end of FY24.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRailways has been among the worst performers in terms of achieving the target. At the time of its inception, the national transporter was expected to contribute a fourth of the total monetisation proceeds, with Rs 1.52 trillion from trains, stations, and terminals.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt the end of FY24, the Ministry of Railways had monetised assets worth Rs 20,417 crore over the past three financial years, achieving 30 per cent of its revised target – much lower than its initial target.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe national transporter was given a target of Rs 17,000 crore in the current financial year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tQueries sent to Niti Aayog remained unanswered at the time of publishing.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 23:55:27",
            "link": "https://www.business-standard.com/economy/news/secy-group-on-asset-monetisation-to-meet-on-thursday-to-discuss-nmp-2-0-125020501677_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501677"
        }
    ]
}