{
    "data": [
        {
            "title": "WPL 2025: Ashleigh Gardner replaces Mooney as Gujarat Giants' captain",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><div>\r\n\tAfter finishing at the bottom of the table in the first two editions of the Women’s Premier League, Gujarat Giants aim to change their fate in the third edition of the tournament, i.e. WPL 2025. The Gujarat-based franchise on Wednesday announced a change in leadership, with Aussie all-rounder Ashleigh Gardner named captain for the upcoming season. Gardner will take over the reins from her fellow Australian Beth Mooney, who led the team during the 2024 edition of the WPL.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGujarat Giants will be hopeful of starting their season on a high when they take on Smriti Mandhana-led defending champions Royal Challengers Bengaluru in the opening match of WPL 2025 on Friday, February 14, at Kotambi Stadium in Vadodara.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Gardner’s experience</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tA crucial member of the Australian national team, Gardner made her debut in 2017 and has since played 95 T20Is, amassing over 1,400 runs and taking 78 wickets with her off-spin. She has won the prestigious Belinda Clark Award and played a key role in Australia’s gold-winning performance at the 2022 Commonwealth Games. She was also named Player of the Tournament in the 2023 T20 World Cup in South Africa.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHaving been part of Gujarat Giants since the start of the WPL, Gardner has contributed significantly with both bat and ball, scoring 324 runs and picking up 17 wickets.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/cricket/news/wpl-2025-full-schedule-timing-ist-format-venues-and-live-streaming-125020400911_1.html\" target=\"_blank\">WPL 2025: Full schedule, timing (IST), format, venues and live streaming</a></strong></div></div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Gardner on being appointed Gujarat Giants skipper</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tExpressing her excitement about the new role, Gardner stated that it was a privilege to be named captain and that she had enjoyed being part of the team. She looked forward to working with a mix of young and experienced players and hoped to make the fans proud with their performances.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Coach Klinger confident in Gardner’s leadership</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tGujarat Giants’ head coach Michael Klinger described Gardner as a fierce competitor with strong tactical acumen. He noted that her leadership qualities, game awareness, and ability to inspire teammates made her the ideal choice for captaincy. Klinger also acknowledged Mooney’s contributions as a leader and stated that her focus would now be on wicketkeeping and opening the batting.<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/cricket/champions-trophy\" target=\"_blank\"><strong>Check latest news on ICC Champions Trophy 2025 here</strong></a></div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Gujarat Giants owner's take on new captain</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tSanjay Adesara, chief business officer of Adani Sportsline, expressed confidence in Gardner’s leadership. He highlighted her dedication and skill as key factors behind her appointment and believed that under her captaincy, Gujarat Giants would deliver a strong performance in WPL 2025.</div></div>",
            "pub_date": "2025-02-05 16:25:27",
            "link": "https://www.business-standard.com/cricket/news/wpl-2025-ashleigh-gardner-replaces-mooney-as-gujarat-giants-captain-125020500745_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500745"
        },
        {
            "title": "When will Rafale M fly from Indian Navy carriers? We may now know the date",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Indian Navy could receive the first of the 26 Rafale Marine (Rafale M) aircraft carrier-based naval combat aircraft by May 2028 at the latest, with <em>ThePrint</em> reporting on Tuesday that India and France are likely to sign the €7 billion ($7.6 billion or Rs 63,000 crore) deal in April 2025, under a government-to-government contract, during French Defence Minister Sébastien Lecornu's visit to India. The report added that both sides have completed negotiations for the deal.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSources within the defence and security establishment informed the news portal that Prime Minister Narendra Modi is scheduled to visit France from February 10-12 to co-chair an Artificial Intelligence (AI) Summit. During the visit, he is also expected to hold bilateral discussions with French President Emmanuel Macron, where both nations may formally announce the deal.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, sources informed the news portal that the deal is expected to be signed only after the Parliament Budget session concludes. While the initial plan was to finalise the agreement within the current financial year, the timeline may be extended due to the ongoing Parliament session.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/india-likely-to-seal-navy-rafale-jet-deal-next-month-why-it-s-just-in-time-124120200548_1.html\" target=\"_blank\">India likely to seal navy Rafale jet deal next month: Why it's just in time</a></strong></div>\n</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhy is India buying the Rafale M?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Rafale M acquisition will enable the Indian Navy to operate these aircraft from its two aircraft carriers, INS Vikrant and INS Vikramaditya. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCurrently, both carriers are equipped with the Russian-made Mikoyan MiG-29K fighter aircraft.<small class=\"brtagPara\"> </small>\n<div></div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\t\tWatch | Twin carrier operations by the <a href=\"https://twitter.com/indiannavy?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">@indiannavy</a><small class=\"brtagPara\"> </small> After successful debut of INS Vikrant &amp; INS Vikramaditya together at <a href=\"https://twitter.com/hashtag/MILAN2024?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#MILAN2024</a>, the duo made a pit stop at the Western Seaboard for <a href=\"https://twitter.com/hashtag/CommandersConference?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#CommandersConference</a><small class=\"brtagPara\"> </small> Such complex operations are testament to India's growing maritime power. <a href=\"https://t.co/PtSXPbnOjv\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/PtSXPbnOjv</a></p>\r\n\t\t— Ministry of Defence, Government of India (@SpokespersonMoD) <a href=\"https://twitter.com/SpokespersonMoD/status/1767709921183936540?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">March 13, 2024</a></blockquote></div>\n<!-- --> <!-- --> <!-- -->\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndia selected the Rafale M over the American Boeing F/A-18 Super Hornet for its naval fleet. A key advantage of this choice is the commonality with the Indian Air Force's (IAF's) Rafale jets, which is expected to reduce costs related to spares and maintenance.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFrance completed the delivery of all 36 Rafale jets to the IAF in December 2022. India had ordered the combat aircraft in a Rs 59,000-crore government-to-government deal in September 2016.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/no-indian-radar-astra-missile-on-navy-s-rafale-m-jets-here-s-what-we-know-124093000356_1.html\" target=\"_blank\">No Indian radar, Astra missile on Navy's Rafale-M jets? Here's what we know</a></strong></div></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhen will the Indian Navy get its first Rafale M?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs per <em>ThePrint</em> report, France would be contractually required to deliver the first Rafale M aircraft within 37 months from the deal's signing. With the agreement likely to be finalised in April 2025, this means the Indian Navy can expect the first Rafale M to be delivered by May 2028. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe contract is also expected to include a provision requiring Dassault Aviation to demonstrate a modified Rafale M with the Indian Navy’s requested changes within 18 months. While sources did not specify the exact modifications, they indicated that the changes are aimed at ensuring optimal performance from Indian aircraft carriers.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Rafale M development follows a report from the same portal indicating that the Indian Navy has dropped plans to operate three aircraft carriers simultaneously and is instead prioritising the construction of a second indigenous aircraft carrier to eventually replace INS Vikramaditya. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to that report, the government does not support the Navy's position on maintaining a three-carrier fleet, which would have ensured that at least two carriers remained operational at all times, even if one was undergoing refits. Instead, the government is reportedly pushing for a greater focus on submarines, including nuclear-powered attack vessels, rather than expanding the aircraft carrier fleet.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/india-decides-it-will-not-operate-a-third-aircraft-carrier-here-is-why-125020400853_1.html\" target=\"_blank\">India decides it will not operate a third aircraft carrier. Here is why</a></strong></div></div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhat are the capabilities of the Indian Navy's Rafale M jets?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe IAF variant and the Navy’s Rafale M have approximately 80 per cent common components.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The Air Force single-seat Rafale C, the Air Force two-seat Rafale B, and the Navy single-seat Rafale M feature maximum airframe and equipment commonality, and very similar mission capabilities,\" says Dassault Aviation, the aircraft's manufacturer. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAll Rafale variants belong to the 4+ generation of fighter aircraft, incorporating advanced avionics and select capabilities typically found in fifth-generation jets.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, the Rafale M aircraft being acquired for the Indian Navy under the latest deal features key distinctions from the IAF variant.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Rafale M is a single-seat, multi-role fighter capable of executing deep strikes, air defence, and reconnaissance missions. Similar to the IAF variant, Dassault Aviation describes the Rafale M as an \"omnirole aircraft\", meaning it can engage in air-to-air and air-to-ground combat simultaneously.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDesigned for aircraft carrier operations, the Rafale M includes several modifications that differentiate it from the IAF variant:</div>\n<small class=\"brtag\"> </small>\n<ul>\n<li>\r\n\t\tReinforced undercarriage and landing gear to withstand the impact of carrier landings.</li>\n<li>\r\n\t\tTail hook system for arrested landings on a carrier deck.</li>\n<li>\r\n\t\tJump strut nosewheel that extends during short takeoffs, including catapult launches.</li>\n<li>\r\n\t\tBuilt-in ladder for cockpit access from the carrier deck.</li>\n<li>\r\n\t\tCarrier-based landing system for precision landings.</li>\n<li>\r\n\t\tFoldable wings to accommodate storage constraints on aircraft carriers.</li>\n<li>\r\n\t\tThese structural reinforcements make the Rafale M slightly heavier than the IAF variant.</li>\n</ul>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBoth the IAF Rafale and the latest standard of the Rafale M feature:</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<ul>\n<li>\r\n\t\tThales RBE2 active electronically scanned array (AESA) radar, with the Rafale M's version optimised for maritime operations.</li>\n<li>\r\n\t\tThales SPECTRA internal electronic warfare system, also fine-tuned for naval operations.</li>\n</ul>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBoth variants share a common weapons package, including:</div>\n<small class=\"brtag\"> </small>\n<ul>\n<li>\r\n\t\tMeteor long-range air-to-air missile (A2A)</li>\n<li>\r\n\t\tMICA A2A missile</li>\n<li>\r\n\t\tHAMMER air-to-surface stand-off weapon</li>\n<li>\r\n\t\tSCALP long-range stand-off missile</li>\n<li>\r\n\t\tAM39 EXOCET anti-ship missile</li>\n<li>\r\n\t\tLaser-guided bombs</li>\n</ul>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThese features make the Rafale M a formidable naval fighter, ensuring seamless integration with India's carrier-based operations while maintaining compatibility with IAF Rafales for streamlined logistics and maintenance.<small class=\"brtagPara\"> </small>\n<div></div><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\">\n<p dir=\"ltr\" lang=\"en\">\n<a href=\"https://twitter.com/hashtag/PeoplesChoice?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#PeoplesChoice</a><small class=\"brtagPara\"> </small> The winner of our poll, with 53% of the votes, is the Rafale!<small class=\"brtag\"> </small> So here goes <a href=\"https://twitter.com/hashtag/RafaleRavivaar?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#RafaleRavivaar</a>. <a href=\"https://t.co/QEZGSMDEGC\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/QEZGSMDEGC</a></p>\r\n\t\t— Indian Air Force (@IAF_MCC) <a href=\"https://twitter.com/IAF_MCC/status/1611920635520864256?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">January 8, 2023</a></blockquote></div>\n<!-- --> <!-- --> </div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 16:25:27",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/when-will-rafale-m-fly-from-indian-navy-carriers-we-may-now-know-the-date-125020500746_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500746"
        },
        {
            "title": "Bombay HC to hear Volkswagen's plea against $1.4 bn tax notice on Feb 17",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe Bombay High Court on Wednesday said it would hear on February 17 a plea filed by Skoda Auto Volkswagen India challenging the tax demand of $1.4 billion by Indian customs authorities.</p>\n<p>\r\n\tThe Volkswagen group, currently led in the country by Skoda Auto Volkswagen India, has been accused of deliberately misleading customs authorities through its mode of import of parts as individual units rather than as a component of a 'completely knocked down' (CKD) unit, which attracts higher import duty.</p>\n<p>\r\n\tThe automobile company last month filed a petition in the HC, challenging a show-cause notice issued by the authorities in September 2024 under the Customs Act.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tOn Wednesday, the company's counsels mentioned the plea before a division bench of Justices B P Colabawalla and Firdosh Pooniwalla, seeking urgent hearing.</p>\n<p>\r\n\tThe high court agreed to hear the plea on February 17.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe notice alleged that the company misclassified its imports of Audi, Skoda and Volkswagen cars as \"individual parts\" instead of \"completely knocked down\" (CKD) units, thereby paying significantly lower customs duties.</p>\n<p>\r\n\tThe CKD units attract a 30-35 per cent duty, but Volkswagen declared its imports as separate components in different shipments and paid only 5-15 per cent in duties, it said.</p>\n<p>\r\n\tThe VW group, through its various brands, including Audi, VW, and Skoda, has sold a variety of models, which have been imported as CKD units and assembled in India.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tSome of the models include Octavia, Superb, Kodiaq, Passat, Jetta and Tiguan.</p>\n<p>\r\n\tIn 2019, Volkswagen Group India received regulatory and statutory approvals to merge its three passenger car subsidiaries in the country into one entity -- Skoda Auto Volkswagen India -- in order to work more efficiently at all levels to gain significant market shares for Volkswagen and Skoda by 2025.</p>\n<p>\r\n\tIn July 2018, the Volkswagen Group announced investments of around 1 billion euros as part of the India 2.0 project.</p><p></p></div>",
            "pub_date": "2025-02-05 16:20:32",
            "link": "https://www.business-standard.com/companies/news/bombay-hc-to-hear-volkswagen-s-plea-against-1-4-bn-tax-notice-on-feb-17-125020500731_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500731"
        },
        {
            "title": "WPL 2025: Ashleigh Gardner replaces Mooney as Gujarat Giants' captain",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><div>\r\n\tAfter finishing at the bottom of the table in the first two editions of the Women’s Premier League, Gujarat Giants aim to change their fate in the third edition of the tournament, i.e. WPL 2025. The Gujarat-based franchise on Wednesday announced a change in leadership, with Aussie all-rounder Ashleigh Gardner named captain for the upcoming season. Gardner will take over the reins from her fellow Australian Beth Mooney, who led the team during the 2024 edition of the WPL.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGujarat Giants will be hopeful of starting their season on a high when they take on Smriti Mandhana-led defending champions Royal Challengers Bengaluru in the opening match of WPL 2025 on Friday, February 14, at Kotambi Stadium in Vadodara.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Gardner’s experience</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tA crucial member of the Australian national team, Gardner made her debut in 2017 and has since played 95 T20Is, amassing over 1,400 runs and taking 78 wickets with her off-spin. She has won the prestigious Belinda Clark Award and played a key role in Australia’s gold-winning performance at the 2022 Commonwealth Games. She was also named Player of the Tournament in the 2023 T20 World Cup in South Africa.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHaving been part of Gujarat Giants since the start of the WPL, Gardner has contributed significantly with both bat and ball, scoring 324 runs and picking up 17 wickets.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/cricket/news/wpl-2025-full-schedule-timing-ist-format-venues-and-live-streaming-125020400911_1.html\" target=\"_blank\">WPL 2025: Full schedule, timing (IST), format, venues and live streaming</a></strong></div></div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Gardner on being appointed Gujarat Giants skipper</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tExpressing her excitement about the new role, Gardner stated that it was a privilege to be named captain and that she had enjoyed being part of the team. She looked forward to working with a mix of young and experienced players and hoped to make the fans proud with their performances.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Coach Klinger confident in Gardner’s leadership</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tGujarat Giants’ head coach Michael Klinger described Gardner as a fierce competitor with strong tactical acumen. He noted that her leadership qualities, game awareness, and ability to inspire teammates made her the ideal choice for captaincy. Klinger also acknowledged Mooney’s contributions as a leader and stated that her focus would now be on wicketkeeping and opening the batting.<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/cricket/champions-trophy\" target=\"_blank\"><strong>Check latest news on ICC Champions Trophy 2025 here</strong></a></div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Gujarat Giants owner's take on new captain</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tSanjay Adesara, chief business officer of Adani Sportsline, expressed confidence in Gardner’s leadership. He highlighted her dedication and skill as key factors behind her appointment and believed that under her captaincy, Gujarat Giants would deliver a strong performance in WPL 2025.</div></div>",
            "pub_date": "2025-02-05 16:20:30",
            "link": "https://www.business-standard.com/cricket/news/wpl-2025-ashleigh-gardner-replaces-mooney-as-gujarat-giants-captain-125020500745_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500745"
        },
        {
            "title": "Zomato appoints two chiefs of staff after receiving 18,000 applications",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAfter a widely publicised search for a chief of staff, Zomato founder and chief executive officer (CEO) Deepinder Goyal announced that the company has appointed two people for the role. They were selected from over 18,000 applications.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a post on X, Goyal said Zomato received over 18,000 applications, of which 150 were shortlisted and interviewed. The company extended offers to 30 candidates, and 12 have joined so far.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Following a rigorous selection process, 30 outstanding candidates received offers, and 18 have already joined Zomato and its group companies, including Blinkit, in high-impact roles. These individuals are being competitively compensated for the value they bring, and importantly, no one has paid anything to work with the company,” he said.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe selected candidates include startup founders who bootstrapped businesses from their dorm rooms, engineers who rebuilt entire tech stacks over a weekend, operators who scaled businesses from chaos, and a few exceptional young minds fresh out of college—individuals whom Zomato believes will lead the company into the future.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhat sets them apart is a long-term mindset, Goyal said. “They weren’t optimising for short-term outcomes but for compounding impact—the most misunderstood mathematical miracle. Finding people who truly get this is rare, and I’m grateful we did.”</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFour of the 18 people who have already joined work directly with Goyal, including the two appointed as chiefs of staff.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“And we’re not done. With 18,000+ applications, we’re still carefully sifting through this amazing talent pool. This isn’t just a one-time hiring sprint—it’s a long-term investment in the people who will build the future with us. We’ll keep reaching out to the right folks, slowly but surely,” he added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn November last year, Goyal had posted a job description for the chief of staff position on X, stating that applicants would need to contribute Rs 20 lakh to Zomato’s charitable initiative, Feeding India. Many on social media criticised this as a marketing gimmick.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHe had also claimed that the candidate would gain \"10 times more learning than a two-year degree from a top management school\" and that the salary would commence only from the second year.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 16:15:28",
            "link": "https://www.business-standard.com/companies/news/zomato-appoints-two-chiefs-of-staff-after-receiving-18-000-applications-125020500737_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500737"
        },
        {
            "title": "1 person dead, 5 wounded in shooting at Ohio cosmetics warehouse",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tOne person has died and five others were wounded in a shooting Tuesday night at a cosmetics warehouse in Ohio, officials said.</p>\n<p>\r\n\tThe victims have been transported to hospitals and the suspect is no longer believed to be at the building, said Josh Poland, a spokesperson for the city of New Albany.</p>\n<p>\r\n\tNew Albany Police Chief Greg Jones described the shooting just before 11 pm as a targeted type of attack and said officials don't believe the suspect poses a general threat to the public.</p>\n<p>\r\n\tWe have a person of interest and we're looking to locate them and bring them into custody,\" he said during a press conference. A firearm was found at the scene.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe shooting happened at the warehouse for a company that makes products including cosmetics and toiletries. Police did not immediately provide a motive for the shooting or the conditions of those wounded.</p>\n<p>\r\n\tAbout 150 people were evacuated to a neighbouring building, according to Jones.</p><p></p></div>",
            "pub_date": "2025-02-05 16:15:28",
            "link": "https://www.business-standard.com/world-news/1-person-dead-5-wounded-in-shooting-at-ohio-cosmetics-warehouse-125020500719_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500719"
        },
        {
            "title": "Lupin surges 8% in 2 days on USFDA nod for generic HIC drug",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Lupin share price</strong> gained 4 per cent to trade at Rs 2,201.65 per share on the BSE in Wednesday’s intraday trade, in an otherwise subdued market. In the past two days, Lupin stock has surged 8 per cent after the pharmaceutical company received tentative approval from the US Food and Drug Administration (USFDA) to market generic HIV combination therapy (HIC) drugs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe drugs include Darunavir, Cobicistat, Emtricitabine, and Tenofovir Alafenamide tablets, 800 mg/150 mg/200 mg/10 mg. The company, which is the exclusive first-to-file for this product, will manufacture the drug at its Nagpur facility in India, Lupin said in a stock exchange filing.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt 12:54 PM, <a href=\"https://www.business-standard.com/markets/lupin-ltd-share-price-3026.html\">Lupin share price</a> was trading 3 per cent higher at Rs 2,179.95, as compared to 0.3 per cent rise in the BSE Sensex. The stock had hit a 52-week high of Rs 2,403.45 on January 2, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLupin specialises in pharmaceutical products, including branded and generic formulations, complex generics, biotechnology products, and active pharmaceutical ingredients. The company enjoys a strong position in India and the US across multiple therapy areas, including respiratory, cardiovascular, anti-diabetic, anti-infective, gastrointestinal, central nervous system, and women's health.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLupin Q3 results 2025 date and time</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tThe board of directors of Lupin is scheduled to meet on February 11, 2025 to consider and approve unaudited financial results of the company for the quarter and nine-months ended December 31, 2024 and other business matters.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLupin has demonstrated remarkable improvement in its margin trajectory, with its medium-term margin guidance of 23-24 per cent being conservative in analysts' view. Analysts expect the earnings upgrade cycle to continue and expect Lupin to deliver 25.5 per cent margin in FY26 on the back of a strong near-term US pipeline.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnalysts at Emkay Global Financial Services, in their coverage initiation report in October 2024, said they expect Lupin to deliver ~25.5 per cent margin in FY26, primarily on the back of a strong near-term US pipeline (including gJynarque). The brokerage firm expects Lupin to be the only player in gJynarque for the entirety of FY26, and the product to remain a meaningful contributor even in FY27. Lupin now has everything going in its favor – broad-based growth across markets, margin improvement, balance sheet strength, and an improving regulatory compliance record.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"While Lupin is expected to launch gJynarque in April 2025 and has a 180-day exclusivity, it is likely to be the only player in gJynarque for entire FY26. While we acknowledge that key products in Lupin's pipeline—including gPred Forte (launched), Glucagon, gRisperdal Consta, gRevlimid, Liraglutide, Ranibizumab, gDulera, and Pegfilgrastim—might not individually be big-ticket opportunities, we expect these products collectively to be meaningful and to offset the expected decline in gProAir and Mirabegron in FY26 and in gJynarque later in FY27. Note, Lupin has seen a sharp uptick in approvals in the last 18 months, aided by the reversal of OAI against key facilities,\" the brokerage firm said with a 'buy' rating on Lupin and a share price target of Rs 2,750 per share.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtagPara\"> </small></div>",
            "pub_date": "2025-02-05 16:10:27",
            "link": "https://www.business-standard.com/markets/news/lupin-surges-8-in-2-days-on-usfda-nod-for-generic-hic-drug-125020500704_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500704"
        },
        {
            "title": "Zomato appoints two chiefs of staff after receiving 18,000 applications",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAfter a widely publicised search for a chief of staff, Zomato founder and chief executive officer (CEO) Deepinder Goyal announced that the company has appointed two people for the role. They were selected from over 18,000 applications.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a post on X, Goyal said Zomato received over 18,000 applications, of which 150 were shortlisted and interviewed. The company extended offers to 30 candidates, and 12 have joined so far.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Following a rigorous selection process, 30 outstanding candidates received offers, and 18 have already joined Zomato and its group companies, including Blinkit, in high-impact roles. These individuals are being competitively compensated for the value they bring, and importantly, no one has paid anything to work with the company,” he said.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe selected candidates include startup founders who bootstrapped businesses from their dorm rooms, engineers who rebuilt entire tech stacks over a weekend, operators who scaled businesses from chaos, and a few exceptional young minds fresh out of college—individuals whom Zomato believes will lead the company into the future.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhat sets them apart is a long-term mindset, Goyal said. “They weren’t optimising for short-term outcomes but for compounding impact—the most misunderstood mathematical miracle. Finding people who truly get this is rare, and I’m grateful we did.”</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFour of the 18 people who have already joined work directly with Goyal, including the two appointed as chiefs of staff.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“And we’re not done. With 18,000+ applications, we’re still carefully sifting through this amazing talent pool. This isn’t just a one-time hiring sprint—it’s a long-term investment in the people who will build the future with us. We’ll keep reaching out to the right folks, slowly but surely,” he added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn November last year, Goyal had posted a job description for the chief of staff position on X, stating that applicants would need to contribute Rs 20 lakh to Zomato’s charitable initiative, Feeding India. Many on social media criticised this as a marketing gimmick.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHe had also claimed that the candidate would gain \"10 times more learning than a two-year degree from a top management school\" and that the salary would commence only from the second year.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 16:10:27",
            "link": "https://www.business-standard.com/companies/news/zomato-appoints-two-chiefs-of-staff-after-receiving-18-000-applications-125020500737_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500737"
        },
        {
            "title": "India need to manage Jasprit Bumrah's workload smartly: Vernon Philander",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><p>\r\n\tFormer South Africa fast bowler Vernon Philander says Jasprit Bumrah has set high standards for pacers across the world but India will need to manage his workload smartly to keep him injury free.</p>\n<p>\r\n\tWith a loaded international calendar, Philander feels Bumrah should be utilised tactfully.</p>\n<p>\r\n\t\"I think he (Bumrah) has really set the standard high. His skill set, the ability to shift his pace up and down, I think he has just been wonderful for the game. Overall, if you look at the amount of games that India plays, obviously over the calendar year, that load is quite massive,\" Philander said in a select media interaction on the sidelines of SA20 here.<small class=\"brtagPara\"> </small>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/schedule\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 full schedule, match timings (IST) here</strong></a></p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"I think it's more about how the Indian management manage him. I would say, you look at a guy like Jasprit Bumrah, and you want him to be playing all the key series, all the key tournaments. So they have to manage his workload in between tournaments,\" said the cricketer-turned-commentator.</p>\n<p>\r\n\tHe suggested that India should avoid the temptation of involving Bumrah in every series.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\t\"With IPL coming up, you want a player like him to be available for most games but how do you manage him throughout the IPL season? So I would say you perhaps want to look at playing him in all the main features and give other bowlers an opportunity in less important matches,\" said Philander, who has taken 224 wickets in 64 Tests for South Africa.</p><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"But again, it's such a tough chat to have, because as a bowler, you want to go out there, you know, there's records to be broken, so you want to keep playing,\" he said.</p>\n<p>\r\n\tSpeaking about bowler's workload in general, Philander said it will be a massive talking point ahead of the Champions Trophy.</p>\n<p>\r\n\t\"I think also from a bowling load management point of view fitness trainers and physios will have to guide the conversation in terms of what's allowed for a particular player.</p>\n<p>\r\n\t\"With leagues popping up everywhere and you only have X amount of balls in your body, and you want to make sure that you deliver those balls at the right time, at the right competition. If you look at Champions Trophy coming up, I think that will be a massive talking point as well,\" he said.<small class=\"brtagPara\"> </small>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy\" target=\"_blank\"><strong>Check latest news on ICC Champions Trophy 2025 here</strong></a><small class=\"brtagPara\"> </small><small class=\"brtag\"> </small>\r\n\tHe also wants to see Bumrah playing in the SA20 along with Suryakumar Yadav and Virat Kohli in future.</p><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"I think Suryakumar would be right up there. Jasprit, without a shadow of doubt as his skill set on these kinds of wickets would be phenomenal to watch in action. And then I think you want to see a guy like Kohli who has obviously built a massive name for himself over the last decade or so,\" he said.</p>\n<p>\r\n\tDinesh Karthik became the first Indian player to be a part of SA20 and Philander feels that young players will learn a lot from his IPL experience.</p>\n<p>\r\n\t\"It's great to have him (Karthik) over here. I think also, for the first time, Robin Uthappa also joined us for a brief commentary. The youngsters would learn a great deal from them having been a part of the IPL for a number of years, \" he said.</p><div id=\"between_article_content_10-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"I think a lot of these youngsters like Lhuan Dre Pretorious might play in one of the IPL teams. They will learn a great deal and would have had great insight up front from a guy like Dinesh Karthik, being in the same changing room,\" he added.</p>\n<p>\r\n\tAsked about his predictions for the top four teams in the Champions Trophy to be held in Pakistan and UAE from Feb 19, he picked India, South Africa, Australia and England.<small class=\"brtagPara\"> </small>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/points-table\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 points table here</strong></a></p>\n<p>\r\n\t\"I think India is a big contender as we are playing in the sub-continent. Australia is always there in big events. I think South Africa has got a lot of confidence from the last T20 WC and number four could be England,\" he said.</p><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tHe also credited SA20 for the resurgence of the game in South Africa in the last 2-3 years.</p>\n<p>\r\n\t\"I think Greame Smith (league commissioner) and his team have done a wonderful job. The match-up between bat and ball has been a lot closer. A couple of youngsters that really put up their hands this year. It was massively needed in South Africa to have a T20 league, to give the guys the exposure as talent was always there,\" he said.</p>\n<p>\r\n\t\"To make the World Test Championship Final was a massive boost for South Africa. Let's not forget, South Africa played in the T20 World Cup final.</p><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 16:05:29",
            "link": "https://www.business-standard.com/cricket/champions-trophy/india-need-to-manage-jasprit-bumrah-s-workload-smartly-vernon-philander-125020500243_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500243"
        },
        {
            "title": "Lupin surges 8% in 2 days on USFDA nod for generic HIC drug",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Lupin share price</strong> gained 4 per cent to trade at Rs 2,201.65 per share on the BSE in Wednesday’s intraday trade, in an otherwise subdued market. In the past two days, Lupin stock has surged 8 per cent after the pharmaceutical company received tentative approval from the US Food and Drug Administration (USFDA) to market generic HIV combination therapy (HIC) drugs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe drugs include Darunavir, Cobicistat, Emtricitabine, and Tenofovir Alafenamide tablets, 800 mg/150 mg/200 mg/10 mg. The company, which is the exclusive first-to-file for this product, will manufacture the drug at its Nagpur facility in India, Lupin said in a stock exchange filing.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt 12:54 PM, <a href=\"https://www.business-standard.com/markets/lupin-ltd-share-price-3026.html\">Lupin share price</a> was trading 3 per cent higher at Rs 2,179.95, as compared to 0.3 per cent rise in the BSE Sensex. The stock had hit a 52-week high of Rs 2,403.45 on January 2, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLupin specialises in pharmaceutical products, including branded and generic formulations, complex generics, biotechnology products, and active pharmaceutical ingredients. The company enjoys a strong position in India and the US across multiple therapy areas, including respiratory, cardiovascular, anti-diabetic, anti-infective, gastrointestinal, central nervous system, and women's health.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLupin Q3 results 2025 date and time</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tThe board of directors of Lupin is scheduled to meet on February 11, 2025 to consider and approve unaudited financial results of the company for the quarter and nine-months ended December 31, 2024 and other business matters.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLupin has demonstrated remarkable improvement in its margin trajectory, with its medium-term margin guidance of 23-24 per cent being conservative in analysts' view. Analysts expect the earnings upgrade cycle to continue and expect Lupin to deliver 25.5 per cent margin in FY26 on the back of a strong near-term US pipeline.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnalysts at Emkay Global Financial Services, in their coverage initiation report in October 2024, said they expect Lupin to deliver ~25.5 per cent margin in FY26, primarily on the back of a strong near-term US pipeline (including gJynarque). The brokerage firm expects Lupin to be the only player in gJynarque for the entirety of FY26, and the product to remain a meaningful contributor even in FY27. Lupin now has everything going in its favor – broad-based growth across markets, margin improvement, balance sheet strength, and an improving regulatory compliance record.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"While Lupin is expected to launch gJynarque in April 2025 and has a 180-day exclusivity, it is likely to be the only player in gJynarque for entire FY26. While we acknowledge that key products in Lupin's pipeline—including gPred Forte (launched), Glucagon, gRisperdal Consta, gRevlimid, Liraglutide, Ranibizumab, gDulera, and Pegfilgrastim—might not individually be big-ticket opportunities, we expect these products collectively to be meaningful and to offset the expected decline in gProAir and Mirabegron in FY26 and in gJynarque later in FY27. Note, Lupin has seen a sharp uptick in approvals in the last 18 months, aided by the reversal of OAI against key facilities,\" the brokerage firm said with a 'buy' rating on Lupin and a share price target of Rs 2,750 per share.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtagPara\"> </small></div>",
            "pub_date": "2025-02-05 16:05:27",
            "link": "https://www.business-standard.com/markets/news/lupin-surges-8-in-2-days-on-usfda-nod-for-generic-hic-drug-125020500704_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500704"
        }
    ]
}