{
    "data": [
        {
            "title": "Life Insurance Corporation gets GST demand notice of Rs 105.42 cr",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tLife Insurance Corporation of India (LIC) on Wednesday said it has received a demand notice of about Rs 105.42 crore for short payment of Goods and Services Tax (GST) for seven financial years.</p>\n<p>\r\n\tThe company has received a communication/demand order for interest and penalty for several states on February 5, LIC said in a regulatory filing.</p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/industry/banking/jammu-and-kashmir-bank-receives-gst-notice-of-over-rs-16-000-crore-125020501541_1.html\" target=\"_blank\">Jammu and Kashmir Bank receives GST notice of over Rs 16,000 crore</a></strong></div>\n<p>\r\n\tThe order is appealable before the Commissioner (Appeals), Lucknow, it said.</p>\n<p>\r\n\tThe demand notice pertains to seven financial years between 2017-18 and 2023-24, it said.</p>\n<p>\r\n\tThe financial impact of the demand is to the extent of the GST, interest and penalty. There is no material impact on financials, operations or other activities of the corporation, it said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 23:45:27",
            "link": "https://www.business-standard.com/companies/news/life-insurance-corporation-gets-gst-demand-notice-of-rs-105-42-cr-125020501575_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501575"
        },
        {
            "title": "A year on, clearing charges still a bone of contention between NSE, BSE",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\n<em>(This report has been updated)</em>\n<hr/>\n<small class=\"brtag\"> </small>\r\n\tThe National Stock Exchange (NSE) and the BSE are yet to find some common ground on the disagreement over the clearing and settlement charges which has stretched for more than a year. The NSE stated in its latest financial statements that its wholly-owned subsidiary NSE Clearing (NCL) was in deficit of Rs 177 crore in the minimum liquid assets required under the norms laid down by the Securities and Exchange Board of India (Sebi). The NCL added that the deficit was mostly on the account of pending dues from rival BSE that amount to</div></div>",
            "pub_date": "2025-02-05 23:45:26",
            "link": "https://www.business-standard.com/markets/news/a-year-on-clearing-charges-still-a-bone-of-contention-between-nse-bse-125020501534_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501534"
        },
        {
            "title": "Public sector general insurance employee union oppose 100% FDI move",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<div>\r\n\t\tA union representing employees of public sector general insurance companies has issued a statement criticising the introduction of 100 per cent foreign direct investment (FDI) in the insurance sector and amendments to insurance laws.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tJoint forum of Unions &amp; Associations of Officers &amp; Employees (JFTU) said in a statement, “The proposed introduction of 100% FDI in the insurance sector and other amendments to insurance laws by the central government, were also discussed. The house condemned such moves which are derogatory to all stakeholders in this strategic sector. These proposals shall be derogatory not only to the interest of (Public Sector General Insurance Companies) PSGICs and their employees but also to the economy and insuring the public of our country.”</div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe union also discussed other demands of employees including wage revision which has been pending since August 1, 2022, desired improvements to NPS at 14 per cent, increase in family pension. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 23:40:28",
            "link": "https://www.business-standard.com/markets/news/public-sector-general-insurance-employee-union-oppose-100-fdi-move-125020501626_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501626"
        },
        {
            "title": "FinMin seeks proposals for 2nd supplementary demands for grants for FY25",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe finance ministry has sought expenditure proposals for the second and final batch of supplementary demands for grants for FY25 from various ministries to be tabled in the ongoing Budget session.</p>\n<p>\r\n\tAccording to an office memorandum, ministries are required to submit their supplementary proposals by February 12.</p>\n<p>\r\n\tThe cases that would be eligible to be incorporated under such demands include those where advances from the Contingency Fund have been granted.</p>\n<p>\r\n\tBesides, payments against court decree would be included as well as cases where the finance ministry has specifically advised to propose the supplementary demand in the ongoing Budget session, it said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe proposals for supplementary demand for grants may be projected within Revised Estimate 2024-25 ceiling after a thorough and objective assessment of additional requirement of funds, the memorandum dated February 3 said.</p>\n<p>\r\n\t\"While processing proposals for supplementary grants, the grant controlling authority must invariably identify savings within the grant so that the infructuous or inflated supplementary demands are weeded out and the eventuality of surrender after obtaining the supplementary grant is avoided,\" it said.</p><p></p></div>",
            "pub_date": "2025-02-05 23:40:27",
            "link": "https://www.business-standard.com/finance/news/finmin-seeks-proposals-for-2nd-supplementary-demands-for-grants-for-fy25-125020501520_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501520"
        },
        {
            "title": "First batch of illegal Indian immigrants from US: 25 women and 12 minors",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tA US military C-17 aircraft carrying 104 illegal Indian immigrants arrived at Sri Guru Ram Das Jee International Airport, Amritsar, on Wednesday under tight security. Of the deportees, the group comprised 25 women and 12 minors, with the youngest deportee being just four years old. Nearly 48 of them are below the age of 25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis marks the first large-scale deportation of Indians from the US under the second term of President Donald Trump.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe highest numbers of illegal Indian migrants hailed from Haryana (30) and Gujarat (30), followed by Punjab (30). The remaining included individuals from Maharashtra (3), Uttar Pradesh (2), and Chandigarh (2). </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe special deportation flight, which took off from San Antonio, Texas, on Tuesday, was accompanied by 45 US officials overseeing the process and 11 crew members.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA senior Punjab government official confirmed that most deportees from the state belonged to Gurdaspur, Amritsar, Tarn Taran, Jalandhar, Nawanshahr, Patiala, Mohali, and Sangrur. Some had illegally entered the US, while others overstayed their visas.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tPM Modi’s visit to US</h2>\n<div>\r\n\tThis deportation coincides with Prime Minister Narendra Modi’s upcoming visit to Washington next week, his first since Donald Trump secured a second term as US President. Last month, External Affairs Minister S Jaishankar assured US Secretary of State Marco Rubio that India was open to the “legitimate return” of its undocumented nationals, pending verification.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPresident Trump had earlier stated, “For the first time in history, we are locating and loading illegal aliens into military aircraft and flying them back to the places from which they came.” His administration has intensified its crackdown on illegal immigration, significantly impacting Indian migrants, particularly from Punjab.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tConcerns over deportation</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPunjab’s NRI Affairs Minister Kuldeep Singh Dhaliwal criticised the move, arguing that these individuals had contributed to the US economy and should have been granted permanent residency instead of being expelled.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to the Pew Research Center, approximately 7,25,000 illegal Indian immigrants reside in the US, making them the third-largest group of unauthorised migrants after those from Mexico and El Salvador. Many from Punjab reportedly took the perilous ‘donkey route’—an illegal migration pathway involving multiple countries — by paying lakhs of rupees to human traffickers. </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith Trump’s administration tightening immigration policies, more such deportations are expected in the coming months, further affecting the Indian diaspora in the US.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em><strong>[With inputs from agencies]</strong></em></div></div>",
            "pub_date": "2025-02-05 23:35:25",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/first-batch-of-illegal-indian-immigrants-from-us-25-women-and-12-minors-125020501352_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501352"
        },
        {
            "title": "2 suspected GBS cases from Delhi NCR region admitted in Jaipur",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tTwo suspected cases of Guillain-Barré Syndrome (GBS) have been found in the Delhi National Capital Region (NCR), according to sources.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Union health ministry has not confirmed this development.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, official sources indicate that one case each from Haryana’s Gurugram and Uttar Pradesh has been admitted to Jaipur’s Sawai Man Singh (SMS) Hospital.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis comes after one of the prominent hospitals in Gurugram claimed to have reported a suspected case of GBS this week.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGBS is a rare neurological disorder that occurs when the body’s immune system attacks its own peripheral nervous system, leading to weakness, tingling, and sometimes paralysis.<small class=\"brtagPara\"> </small>\n<div>\r\n\t\tThe disease has been in the news recently, with Maharashtra witnessing a sudden rise in GBS cases since January this year. The state, so far, has reported 170 suspected cases of auto-immune disease, of which 132 have been diagnosed as confirmed GBS cases. </div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe state also has reported five suspected deaths due to the GBS.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe disease has been in the news recently, with Maharashtra witnessing a sudden rise in GBS cases since January this year. The state has so far reported 166 suspected cases of the autoimmune disease, and five deaths due to GBS.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSeveral suspected cases have also been reported from Assam and Tamil Nadu.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Monday, Union Health Minister JP Nadda undertook a review meeting to check the status of GBS in Maharashtra, asking the state to work in coordination with the Centre to explore the possible causes of the outbreak and prevent recurrences in the future.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile assuring the state government of all support in the management of the disease, Nadda emphasised that the situation is contained and under continuous monitoring.<small class=\"brtagPara\"> </small>\n<div>\r\n\t\tThe Maharashtra government has also appealed to all private medical practitioners to notify any GBS patient of the respective public health authorities.</div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to the World Health Organisation (WHO), while the cause of GBS is not fully understood, most cases follow an infection with a virus or bacteria, leading the immune system to attack the body itself.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Infection with the bacteria Campylobacter jejuni, which causes gastroenteritis (including symptoms of nausea, vomiting, and diarrhoea), is one of the most common risk factors for GBS,” the world health body has stated on its website.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 23:35:25",
            "link": "https://www.business-standard.com/health/2-suspected-gbs-cases-from-delhi-ncr-region-admitted-in-jaipur-125020501642_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501642"
        },
        {
            "title": "NPCI chief advocates for stronger legal systems to deter cyber frauds",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tA strong legal framework coupled with adequate customer awareness is needed to deter growing financial cyber frauds and prevent people from engaging in such crime, said Dilip Asbe, managing director and chief executive officer (CEO), National Payments Corporation of India (NPCI).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSpeaking at the Bharat Fintech Summit in Mumbai, he said that economic incentivisation was required to expand the base of customers using India’s real-time payments system Unified Payments Interface (UPI). Currently, over 450 million users utilise digital payment methods such as UPI for retail payments.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The legal system also must be evolved to ensure that these activities are penalised at the appropriate level. We see that 95 per cent frauds are consumer initiated frauds, investment-related frauds. It is important to make citizens aware about these at a large scale,” Asbe said. His comments come at a time when digital payments frauds have continued to drain the wallets of users.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndians have lost Rs 485 crore to UPI-related frauds in 632,000 reported incidents until September in the ongoing financial year (FY25), according to data from the Ministry of Finance. Since 2022-23, UPI-related frauds have accounted for a cumulative loss of Rs 2,145 crore across 2.7 million reported incidents. In 2023-24 (FY24) alone, 1.34 million fraud cases were reported, amounting to losses of Rs 1,087 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe rise in UPI-related frauds coincides with the growth in the number of users and the total transactions processed on the real-time payments system. In 2024 alone, the NPCI recorded over 172 billion transactions on the real-time payments system.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We have the potential to process 100-150 billion transactions (every month). How do we grow now? If you want to bring in the 300-400 million people who are not digitally savvy onto the digital platform, there has to be some incentivisation,” Asbe said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCurrently, there is no merchant discount rate (MDR) on UPI payments. MDR refers to a fee that merchants pay to payment processing companies for processing a transaction. Debit transactions made on UPI continue to remain free and banks along with fintechs bear the costs of processing these payments. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Union Budget 2025 too was muted on digital payment subsidies that trickle down to banks and financial technology (fintech) firms. The government slashed the financial year 2026 (FY26) outlay for promoting peer-to-merchant (P2M) UPI transactions and RuPay debit card payments.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Centre allocated just Rs 437 crore in the Budget for the promotion of these types of transactions. This was a 78 per cent cut from the final outlay of Rs 2,000 crore allocated for FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAsbe elucidated that investments in technology and consumer education awareness were a continuous process. “The use of tech can identify the early trends in terms of future potential risk. How do you continuously remain vigilant and make over and above investments which are required to ensure that the trust in the payment system is protected?” he asked. </div>\n<small class=\"brtagPara\"> </small></div>",
            "pub_date": "2025-02-05 23:30:35",
            "link": "https://www.business-standard.com/finance/news/npci-chief-advocates-for-stronger-legal-systems-to-deter-cyber-frauds-125020501570_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501570"
        },
        {
            "title": "Kerala secures Rs 2,424 cr World Bank loan to strengthen healthcare system",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe Kerala government on Wednesday approved the Kerala Health System Improvement Programme by availing a loan of Rs 2,424.28 crore from the World Bank.</p>\n<p>\r\n\tThe state Cabinet meeting chaired by Chief Minister Pinarayi Vijayan, which granted approval, decided to implement the project under the Programme for Results (P for R) model.</p>\n<p>\r\n\tAccording to a CMO release, the main objective of the programme is to ensure an excellent standard of living and life expectancy while helping the people of the state build a life free from preventable diseases, accidents, and premature deaths.</p>\n<p>\r\n\t\"All interventions under the programme will focus on ensuring the welfare of the poor. The project aims to establish resilient healthcare systems that provide value-based healthcare while addressing the state's evolving demographic and epidemiological challenges,\" it said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe government said the project will also enhance coordination between various state departments to effectively respond to emerging threats, including climate change, and improve the efficiency of healthcare delivery systems in Kerala.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tKey objectives include developing a comprehensive ecosystem to prevent non-communicable diseases, strengthening healthcare infrastructure, adopting better approaches to tackle climate-related health risks, and effectively responding to emerging health threats.</p>\n<p>\r\n\tAdditionally, the project seeks to reinforce emergency and trauma care services by creating an efficient 24x7 emergency response network, including ambulances and a trauma registry, the release said.</p>\n<p>\r\n\tIt further said in elderly care, the project will integrate local self-government institutions to address existing and emerging challenges by reimagining healthcare systems, enhancing human resource capabilities, increasing resource allocation, universalising digital health applications, and expanding public health funding.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tSpecial emphasis will be given on providing efficient healthcare services to those below the poverty line, the CMO said.</p><p></p></div>",
            "pub_date": "2025-02-05 23:30:34",
            "link": "https://www.business-standard.com/india-news/kerala-secures-rs-2-424-cr-world-bank-loan-to-strengthen-healthcare-system-125020501576_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501576"
        },
        {
            "title": "2 suspected GBS cases from Delhi NCR region admitted in Jaipur",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tTwo suspected cases of Guillain-Barré Syndrome (GBS) have been found in the Delhi National Capital Region (NCR), according to sources.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Union health ministry has not confirmed this development.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, official sources indicate that one case each from Haryana’s Gurugram and Uttar Pradesh has been admitted to Jaipur’s Sawai Man Singh (SMS) Hospital.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis comes after one of the prominent hospitals in Gurugram claimed to have reported a suspected case of GBS this week.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGBS is a rare neurological disorder that occurs when the body’s immune system attacks its own peripheral nervous system, leading to weakness, tingling, and sometimes paralysis.<small class=\"brtagPara\"> </small>\n<div>\r\n\t\tThe disease has been in the news recently, with Maharashtra witnessing a sudden rise in GBS cases since January this year. The state, so far, has reported 170 suspected cases of auto-immune disease, of which 132 have been diagnosed as confirmed GBS cases. </div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe state also has reported five suspected deaths due to the GBS.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe disease has been in the news recently, with Maharashtra witnessing a sudden rise in GBS cases since January this year. The state has so far reported 166 suspected cases of the autoimmune disease, and five deaths due to GBS.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSeveral suspected cases have also been reported from Assam and Tamil Nadu.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Monday, Union Health Minister JP Nadda undertook a review meeting to check the status of GBS in Maharashtra, asking the state to work in coordination with the Centre to explore the possible causes of the outbreak and prevent recurrences in the future.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile assuring the state government of all support in the management of the disease, Nadda emphasised that the situation is contained and under continuous monitoring.<small class=\"brtagPara\"> </small>\n<div>\r\n\t\tThe Maharashtra government has also appealed to all private medical practitioners to notify any GBS patient of the respective public health authorities.</div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to the World Health Organisation (WHO), while the cause of GBS is not fully understood, most cases follow an infection with a virus or bacteria, leading the immune system to attack the body itself.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Infection with the bacteria Campylobacter jejuni, which causes gastroenteritis (including symptoms of nausea, vomiting, and diarrhoea), is one of the most common risk factors for GBS,” the world health body has stated on its website.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 23:25:31",
            "link": "https://www.business-standard.com/health/2-suspected-gbs-cases-from-delhi-ncr-region-admitted-in-jaipur-125020501642_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501642"
        },
        {
            "title": "Make OpenAI affordable for developers: Top Indian startup chiefs to Altman",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<div>\r\n\t\tMake OpenAI models affordable for developers and introduce India-specific pricing. This was the message from top Indian startup founders to OpenAI chief executive Sam Altman on Wednesday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tAltman gave a ringing endorsement to Artificial Intelligence momentum in India and billed it as an important market for new-age technology.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tAltman, along with chief product officer Kevin Weil, and vice-president of engineering, Srinivas Narayanan, met a select group of Artificial Intelligence-driven startup founders, venture capitalists, developers, and students in multiple closed-door sessions on Wednesday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tIndian startup leaders such as Aloke Bajpai, the group chief executive officer of travel planning platform Ixigo, Vijay Shekhar Sharma, the CEO of Paytm, Kunal Bahl, the co-founder of Snapdeal, Raghav Verma, the co-founder of Chaayos, Gaurav Munjal, the CEO of ed-tech platform Unacademy, and Aakrit Vaish, the CEO of Haptik attended these meetings and closed-door sessions.</div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tPeak XV managing director Rajan Anandan and filmmaker Shekhar Kapur also attended the meetings.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\"Many suggested that there is a need for India-specific pricing. Google, Microsoft and others also have different pricing. It is important for OpenAI to think on these lines as the global pricing may not work in the Indian context,\" said a founder who attended the session.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThese sessions were focused on understanding the Indian user perspective and preferences, the issues they were facing while using the various application programming interfaces (APIs) developed by OpenAI, and the pricing of these APIs, among others, people who attended these sessions said.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\"Acknowledgment that pricing is high currently and for mass scale adoption, it would need to come down dramatically. Possibly more updates on that in the future,\" posted Kunal Behl, co-founder Sanpdeal on X.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThey acknowledged that India is their second-largest market and recognised the need to enhance support for Indic languages. They demonstrated how every new model launched has improved in accuracy and showcased notable advancements in Indian languages like Hindi, Marathi, Bengali, Kannada, Telugu, Punjabi, Malayalam, and others.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“It was an engaging meeting where we had a candid discussion about how companies in India are leveraging OpenAI’s technology and the challenges we face. They were also keen to understand our expectations from them and how their roadmap is shaping up. The team was highly forthcoming, openly sharing insights into their near-term plans,” Aloke Bajpai, Group CEO, ixigo told Business Standard.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe top leadership of OpenAI was also open to discussing the pricing of the APIs and how that can be made more accessible to Indian users, another startup founder said, asking not to be named.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t “We spoke about a lot of the people who are using these products from OpenAI and the kind of applications that are being made on top of their foundation model. It was a very engaging conversation with them,” a third person who attended the meetings said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe OpenAI team also apprised the developers and startup executives of the improved accuracy of their models in Indian languages such as Hindi, Marathi, Bengali, Kannada, Telugu, Punjabi, Malayalam, and others, one of the meeting attendees said.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe leadership also talked about making the models open-sourced at some point in the future without giving much details, a startup founder said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“More than making it open source, we will have to see what the USP (unique selling point), the price point and compute (of the model) is. In India, it is no longer a question of whether you can build a model but it is a question of whether you can build that model for a billion people,” PayTM's Vijay Shekhar Sharma said.</div>\n<small class=\"brtag\"> </small>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 23:25:30",
            "link": "https://www.business-standard.com/technology/tech-news/make-openai-affordable-for-developers-top-indian-startup-chiefs-to-altman-125020501622_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501622"
        }
    ]
}