{
    "data": [
        {
            "title": "NAPA urges Punjab govt to set up fund for rehabilitation of deported youths",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe North American Punjabi Association (NAPA) on Wednesday urged the Punjab government to establish a rehabilitation fund to support young boys and girls being deported from the United States.</p>\n<p>\r\n\tIn a statement, NAPA Executive Director Satnam Singh Chahal said lack of support and resources for these returnees could lead to severe social and economic challenges for the state.</p>\n<p>\r\n\tHe warned the Punjab government that negligence in addressing this growing crisis would only create more problems for the state, exacerbating unemployment, mental health issues and potential involvement in illegal activities.</p>\n<p>\r\n\tThis comes amid reports that a US military plane carrying 205 illegal immigrants hailing from Punjab and neighbouring states is likely to land at the Amritsar airport on Wednesday afternoon.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Many of these young individuals leave their homes with dreams of a better future but find themselves deported due to immigration challenges. They return with shattered hopes, financial distress, and psychological trauma.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\t\"It is the government's responsibility to ensure their proper rehabilitation and reintegration into society,\" Chahal said.</p>\n<p>\r\n\tHe urged the state government to allocate funds for skill development programmes, employment opportunities and mental health counselling to help these individuals rebuild their lives.</p>\n<p>\r\n\tHe also urged policymakers to engage with organisations like NAPA to create comprehensive strategies to address the issue effectively.</p>\n<p>\r\n\t\"This is not just an individual problem but a societal one,\" Chahal said.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"If we fail to act now, the consequences will be dire, not just for the youth but for Punjab's social fabric and economy as a whole,\" he said.</p>\n<p>\r\n\tAfter Donald Trump assumed office as the US President last month, the country's law enforcement agencies have launched a crackdown against illegal immigrants.</p>\n<p>\r\n\tMany people from Punjab, who entered the US through \"donkey routes\" or other illegal means by spending lakhs of rupees, are now facing deportation.</p><p></p></div>",
            "pub_date": "2025-02-05 14:15:28",
            "link": "https://www.business-standard.com/india-news/napa-urges-punjab-govt-to-set-up-fund-for-rehabilitation-of-deported-youths-125020500233_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500233"
        },
        {
            "title": "Public is in mood for change: EAM after casting his vote for Delhi polls",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tExternal Affairs Minister S Jaishankar and his wife, Kyoko Jaishankar, cast their vote at a polling booth in Delhi's NDMC School of Science and Humanities, Tughlaq Crescent for the Delhi assembly polls.</p>\n<p>\r\n\tAfter casting his vote, Jaishankar said, \"I have been an early voter...I think the public is in a mood for change.\"</p>\n<p>\r\n\tUnion Minister Hardeep Singh Puri, along with his wife Lakshmi Puri, also cast their vote for the Delhi assembly election at Mount Carmel School in Anand Niketan.</p>\n<p>\r\n\tAfter casting his vote in the Assembly poll, Union Minister Hardeep Singh Puri asked Delhi residents to restore Delhi, which, according to him, has been devastated by 'AAP-da' (AAP) in the last so many years.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tPolling for 70 assembly seats began on Wednesday morning in Delhi, as voters cast their ballots for the 8th Assembly amid tight security.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tVoting commenced at 7.00 am and will continue till 6.00 pm, officials said.</p>\n<p>\r\n\tHotly contested constituencies include New Delhi, Jangpura, Kalkaji, Okhla, Mustafabad, Bijwasan, Kasturba Nagar, Greater Kailash, and Patparganj, among others.</p>\n<p>\r\n\tAAP, which currently holds more than 60 seats in the 70-seat assembly, seeks re-election based on its previous terms' achievements.</p>\n<p>\r\n\tThe New Delhi seat sees a high-profile three-way contest with former Delhi CM Arvind Kejriwal (AAP), BJP's Parvesh Verma, and Congress's Sandeep Dikshit (son of former CM Sheila Dikshit). Jangpura sees a contest between AAP's Manish Sisodia, Congress's Farhad Suri, and BJP's Tarvinder Singh Marwah.</p>\n<p>\r\n\tA total of 699 candidates is in the electoral fray on the 70 assembly constituency seats of the national capital.</p>\n<p>\r\n\tDelhi has 1,561,400 registered voters, including 837,617 males, 723,656 females, and 1,267 third-gender voters. The electorate also includes 239,905 first-time voters aged 18-19, 109,368 elderly voters aged 85 and above, and 79,885 persons with disabilities.</p><p></p></div>",
            "pub_date": "2025-02-05 14:15:28",
            "link": "https://www.business-standard.com/elections/delhi-elections/public-is-in-mood-for-change-eam-after-casting-his-vote-for-delhi-polls-125020500231_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500231"
        },
        {
            "title": "Jubilant Food, Devyani: Will Budget-led consumption boost pop their stocks?",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>Budget 2025 is set to boost spending owing to higher disposable income, especially in the hands of the middle-class, given the sharp reduction in personal income taxes.<small class=\"brtagPara\"> </small> Finance minister Nirmala Sitharaman has proposed to exempt income up to Rs 12 lakh from taxation from the upcoming financial year onwards. The earlier exemption limit stood at Rs 7 lakh.<small class=\"brtagPara\"> </small> This would mean, that those earning about Rs 1 lakh a month no longer pay income tax, and also that those earning at higher levels pay less thanks to updated tax slabs. This will then turn into greater household consumption demand and ideally into private-sector investment and growth. <a href=\"https://www.business-standard.com/opinion/editorial/betting-on-the-middle-class-budget-fuels-growth-with-consumption-boost-125020101819_1.html\" target=\"_blank\"><strong>READ BS Editorial</strong></a><small class=\"brtagPara\"> </small> Among consumption related sectors, apart from FMCG, consumer durables, travel &amp; hospitality, fashion, auto and real-estate; companies in the fast-food servicing business or also more prominently known as Quick Service Restaurants (QSRs) are also likely to see higher footfalls given the increasing disposable income.<small class=\"brtagPara\"> </small> As such stocks of Jubilant Foodworks which operates Domino's, Westlife Foodworld, which operates McDonald's, and Restaurant Brands Asia have been in focus, and rallied up to 21 per cent in the last three trading sessions.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/budget-2025-impact-consumption-related-stocks-likely-to-see-further-gains-125020200451_1.html?1738733613\" target=\"_blank\">Budget 2025 impact: Consumption-related stocks likely to see further gains</a></strong><small class=\"brtagPara\"> </small> Westlife Foodworld led the rally, with a 21 per cent gain on the bourses followed by Sapphire Foods and Devyani International - up 10.2 per cent and 8.5 per cent, respectively. Restaurant Brands Asia (RBA) and Jubilant Foodworks gained 6 per cent and 3 per cent, respectively. In comparison, the NSE Nifty 50 index advanced 1 per cent in the same period.<small class=\"brtagPara\"> </small> Going ahead, here a trading strategy in QSR stocks based on the technical charts.<small class=\"brtagPara\"> </small> <strong>Jubilant Foodworks</strong><small class=\"brtag\"> </small> Current Price: Rs 727<small class=\"brtag\"> </small> Upside Potential: 12.8%<small class=\"brtag\"> </small> Support: Rs 697; Rs 665<small class=\"brtag\"> </small> Resistance: Rs 745; Rs 757; Rs 782; Rs 802<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/markets/jubilant-foodworks-ltd-share-price-14548.html\" target=\"_blank\">Jubilant Foodworks stock</a> is seen trading with a positive bias across time-frames, as the stock holds above the key moving averages. The short-term bias for the stock is likely to remain upbeat as long as the stock holds above Rs 697; below which the medium-term support for the stock stands at Rs 665. <a href=\"https://bsmedia.business-standard.com/_media/bs/data/general-file-upload/2025-02/JUBLFOOD_050225.jpg\" target=\"_blank\"><strong>CLICK HERE FOR THE CHART</strong></a><small class=\"brtagPara\"> </small> On the upside, the stock faces near resistance around Rs 745; break and sustained trade above the same can trigger a rally towards can potentially trigger a rally towards Rs 820. Interim resistance for the stock are placed at Rs 757, Rs 782 and Rs 802 levels.<small class=\"brtagPara\"> </small> <strong>Westlife Foodworld</strong><small class=\"brtag\"> </small> Current Price: Rs 857<small class=\"brtag\"> </small> Upside Potential: 12.6%<small class=\"brtag\"> </small> Support: Rs 849; Rs 827<small class=\"brtag\"> </small> Resistance: Rs 915<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/markets/westlife-foodworld-ltd-share-price-1543.html\" target=\"_blank\">Westlife Foodworld stock</a> is likely to trade on an upbeat note as long as the stock trades above Rs 849. On the upside, the stock seems on course to test Rs 965, with interim resistance seen at Rs 915. In case of a dip, the stock is expected to find support around Rs 827 levels. <a href=\"https://bsmedia.business-standard.com/_media/bs/data/general-file-upload/2025-02/WESTLIFE_050225.jpg\" target=\"_blank\"><strong>CLICK HERE FOR THE CHART</strong></a><small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/dlf-lodha-5-real-estate-shares-that-can-gain-upto-16-ahead-of-rbi-policy-125020400410_1.html?1738733531\" target=\"_blank\">5 real-estate shares that can gain up to 16% ahead of RBI Policy</a></strong><small class=\"brtagPara\"> </small> <strong>Restaurant Brands Asia (RBA)</strong><small class=\"brtag\"> </small> Current Price: Rs 79.20<small class=\"brtag\"> </small> Upside Potential: 9.9%<small class=\"brtag\"> </small> Support: Rs 76<small class=\"brtag\"> </small> Resistance: Rs 79.60; Rs 81.50; Rs 83<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/markets/restaurant-brands-asia-ltd-share-price-72552.html\" target=\"_blank\">RBA stock</a> is seen rebounding from oversold zone. The stock had tumbled by nearly 35 per cent in the preceding four months. At present, the stock is seen testing a minor resistance on the daily scale at Rs 79.60, above which the stock can potentially extend the pullback towards Rs 87 levels. Interim resistance for the stock can be anticipated at Rs 81.50 and Rs 83. Short-term bias is likely to remain positive as long as stock holds above Rs 76. <a href=\"https://bsmedia.business-standard.com/_media/bs/data/general-file-upload/2025-02/RBA_050225.jpg\" target=\"_blank\"><strong>CLICK HERE FOR THE CHART</strong></a><small class=\"brtagPara\"> </small> <strong>Sapphire Foods India</strong><small class=\"brtag\"> </small> Current Price: Rs 321<small class=\"brtag\"> </small> Upside Potential: 15.3%<small class=\"brtag\"> </small> Support: Rs 311; Rs 295<small class=\"brtag\"> </small> Resistance: Rs 330; Rs 340<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/markets/sapphire-foods-india-ltd-share-price-72573.html\" target=\"_blank\">Sapphire Foods India</a> is seen trading with a favourable bias on the medium-term charts, with the stock finding support around its 100-WMA (Weekly Moving Average) in times of crisis since October 2023. Last week, too, the stock tested the support around the 100-WMA, which now stands at Rs 295 and then bounced back. On the upside, the stock can potentially rally to Rs 370; with interim resistance placed at Rs 330 and Rs 340 levels. Near support for the stock is seen at Rs 311. <a href=\"https://bsmedia.business-standard.com/_media/bs/data/general-file-upload/2025-02/SAPPHIRE_050225.jpg\" target=\"_blank\"><strong>CLICK HERE FOR THE CHART</strong></a><small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/nifty-may-target-24-300-post-budget-trump-tariff-rbi-policy-key-triggers-125020101053_1.html?1738733531\" target=\"_blank\">Nifty may target 24,300 post Budget; Trump tariff, RBI policy key triggers</a></strong><small class=\"brtagPara\"> </small> <strong>Devyani International</strong><small class=\"brtag\"> </small> Current Price: Rs 183.5<small class=\"brtag\"> </small> Upside Potential: 13.9%<small class=\"brtag\"> </small> Support: Rs 177; Rs 171<small class=\"brtag\"> </small> Resistance: Rs 187; Rs 195<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/markets/devyani-international-ltd-share-price-24609.html\" target=\"_blank\">Devyani International</a> rallied nearly 24 per cent from its January low of Rs 157 to a high of Rs 194 on the Budget day. The stock, at present, is seen testing resistance around the super trend line on the daily scale at Rs 187; above which the key hurdle stands at Rs 195. The stock will need to break the same to rally towards Rs 209. Support on the downside is visible at Rs 177 and Rs 171 levels. <strong><a href=\"https://bsmedia.business-standard.com/_media/bs/data/general-file-upload/2025-02/DEVYANI_050225.jpg\" target=\"_blank\">CLICK HERE FOR THE CHART</a></strong><small class=\"brtagPara\"> </small> <small class=\"brtag\"> </small><br/></div>",
            "pub_date": "2025-02-05 14:10:29",
            "link": "https://www.business-standard.com/markets/news/jubilant-food-devyani-will-budget-led-consumption-boost-pop-their-stocks-125020500450_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500450"
        },
        {
            "title": "Chamunda Electricals IPO Day 2; check subscription data, GMP, other details",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Chamunda Electricals IPO Day 2:</strong> Chamunda Electricals’ initial public offering (IPO) has seen an overwhelming response from investors, with subscriptions reaching 23.29 times as of 11:12 PM on Wednesday, February 5, 2025, according to data from the National Stock Exchange (NSE). Rs 14.60 crore SME IPO, launched on Tuesday, February 4, is priced between Rs 47-50 per share, with a minimum lot size of 3,000 shares.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/markets/ipo/chamunda-electrical-ltd-ipo-94038\" target=\"_blank\">Chamunda Electricals IPO</a> consists of a fresh issue of 29,19,000 equity shares. Retail investors are required to invest a minimum of Rs 1,50,000 for one lot (3,000 shares), while high-net-worth individuals (HNIs) must bid for at least two lots (6,000 shares), amounting to Rs 3,00,000.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tStrong demand for the IPO is reflected in the grey market, where Chamunda Electricals’ unlisted shares are trading at approximately Rs 63 apiece. This represents a grey market premium (GMP) of Rs 13 or 26 per cent over the upper price band, according to sources tracking unofficial trading activity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe public offering will remain open for bidding until Thursday, February 6, 2025. Following that, the basis of allotment is expected to be finalised on Friday, February 7, 2025, with successful bidders receiving shares in their demat accounts by Monday, February 10, 2025. Chamunda Electricals shares are slated to list on the NSE SME platform tentatively on Tuesday, February 11, 2025.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAhead of its public issue, the company raised Rs 4.11 crore from anchor investors in a bidding process completed on February 3, 2025. Kfin Technologies serves as the registrar for the IPO, while GYR Capital Advisors is the book-running lead manager.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to its Red Herring Prospectus (RHP), Chamunda Electricals intends to allocate IPO proceeds for capital expenditure, including acquiring new testing kits and equipment, meeting working capital requirements, repaying term loans and cash credit, funding general corporate purposes, and covering issue-related expenses.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company specialises in operating and maintaining substations up to 66 KV, testing and commissioning electrical substations up to 220 KV, and managing a 1.5 MW solar power generation park. Its services also include erecting Extra High Voltage (EHV) class equipment, structures, earthing, control cable works, and other associated services for substations up to 220 KV (D Class).<span style=\"white-space:pre\"> </span></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 14:10:28",
            "link": "https://www.business-standard.com/markets/news/chamunda-electricals-ipo-day-2-check-subscription-data-gmp-other-details-125020500446_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500446"
        },
        {
            "title": "Champions Trophy 2025: Injury woes continue to mount trouble for Aussies",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><div>\r\n\tOne of the favourites to win the <a href=\"https://www.business-standard.com/cricket/champions-trophy\" target=\"_blank\"><strong>2025 ICC Champions Trophy</strong></a> and the reigning ODI world champion, Australia are having a less-than-ideal time on their road to the tournament. After Mitchell Marsh, who was part of Australia’s initially announced squad for the ICC event, was ruled out due to injury, Australian coach Andrew McDonald told the media on Wednesday that their regular skipper, Pat Cummins, is still not match-fit and is highly unlikely to return in time to lead the team in the Champions Trophy. McDonald said that either Steve Smith or Travis Head could be named ODI skipper in Cummins' absence.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tApart from Cummins, pacer Josh Hazlewood is also still recovering from a previous injury.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Smith and Head in the captaincy race</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tMcDonald revealed that discussions have been ongoing regarding the leadership role in Cummins' absence. He noted that both Smith and Head are under consideration, with Smith having already showcased his captaincy abilities in Test cricket and one-day internationals.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"They're the two obvious choices,\" McDonald stated, adding that conversations with them have been taking place alongside Cummins while finalising the Champions Trophy squad.<small class=\"brtagPara\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/schedule\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 full schedule, match timings (IST) here</strong></a></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Hazlewood also in doubt</strong><small class=\"brtag\"> </small></div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tAustralia could also be without Josh Hazlewood, who is battling a hip issue. McDonald confirmed that the selectors are awaiting medical updates in the coming days before making a final decision. Hazlewood recently recovered from side and calf injuries that ruled him out of multiple Tests against India and the Test tour of Sri Lanka.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Replacement for Marsh</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tAll-rounder Mitchell Marsh was ruled out of the Champions Trophy due to a back injury few days back, and  is unlikely to feature in the remainder of the domestic season as well. However, there is still a possibility he could participate in the IPL for Lucknow Super Giants.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAustralia have not yet named a replacement for Marsh. However, McDonald hinted that Beau Webster is in contention due to his ability as a seam-bowling all-rounder.<small class=\"brtagPara\"> <span style=\"font-size:12px\"> </span></small></div>\n<div>\n<strong>Abbott and Johnson in the mix</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tWith Cummins and Hazlewood doubtful, Sean Abbott is expected to return to the ODI squad after missing the final Champions Trophy selection due to form. Additionally, left-arm quick Spencer Johnson is set to fly to Sri Lanka as a backup option.<small class=\"brtagPara\"> </small>\n<div>\n<div>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/points-table\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 points table here</strong></a></div>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/points-table\" target=\"_blank\"><small class=\"brtag\"> </small></a></div>\n<small class=\"brtag\"> </small></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 14:05:26",
            "link": "https://www.business-standard.com/cricket/champions-trophy/champions-trophy-injury-woes-continue-to-mount-trouble-for-the-aussies-125020500374_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500374"
        },
        {
            "title": "MTNL share price hits 20% upper circuit on heavy volumes; up 28% in 2 days",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tMahanagar Telephone Nigam Limited share price (MTNL share price) was locked in the 20-per cent upper circuit, at Rs 57.16 per share, on the BSE today. The rise in MTNL share in Wednesday's intraday trade came was led by heavy volumes. In the last two day, the stock of the state-owned telecom cellular and fixed line services provider has surged 28 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTill 09:43 AM, average trading volume on the counter had jumped over three fold with a combined 21.17 million equity shares, representing 3.4 per cent of total equity of <a href=\"https://www.business-standard.com/markets/mahanagar-telephone-nigam-ltd-share-price-2293.html\" target=\"_blank\">MTNL</a>, having changed hands on the NSE and BSE.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<h3>\r\n\tMTNL share price news</h3>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFinance Minister Nirmala Sitharaman, while presenting Union Budget 2025, on February 1, announced a new scheme to provide broadband connectivity to all government secondary schools and health centres.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Broadband connectivity will be added to all government secondary schools and primary healthcare centres in rural areas under the 'Bharat Net' project,\" the finance minister had said while presenting Budget 2025 in the Parliament.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, news reports suggest that the Government will likely allow MTNL and BSNL to monetise their assets.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to a report by Hindi business news channel, CNBC Awaaz, Centre has cleared decks to monetise non-core properties worth Rs 16,000-crore. A Group of Ministers has also waived off various charges and fees on these properties.<small class=\"brtagPara\"> </small>\n<strong>READ: </strong><a href=\"https://www.business-standard.com/markets/news/titagarh-rail-systems-shares-surge-7-on-new-business-plans-details-here-125020500359_1.html?1738734803\" target=\"_blank\">Titagarh Rail Systems shares surge 7% on new business plans; details here</a></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBusiness Standard, however, could not verify these reports.</div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tMTNL share price history</h3>\n<div>\r\n\tThe stock price of MTNL hit a low of Rs 41.40 on January 28, 2025, and has corrected 59 per cent from its 52-week high level of Rs 101.88, touched on July 29, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn December 17, 2024, CARE Ratings had upgraded long-term debt instruments (bonds issue) of MTNL to 'CARE AAA', and simultaneously removed the 'Rating Watch with Negative Implications' and assigned a 'Stable' outlook.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"This rating action follows sustained track record of timely fund infusion by Government of India (GoI) in accordance with the stipulated T-structure payment mechanism (SPM), besides comprehensive understanding of the escrow account’s operational management maintained with Bank of India for servicing Sovereign Guarantee (SG) backed bonds,\" the rating agency said in its rationale.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe outlook for MTNL, thus, is expected to be stable, backed by the expectation of consistent support to be extended by the Government of India. Furthermore, operating in a strategically important sector and support mechanisms such as sovereign guarantees shall ensure timely servicing of the obligations providing stability to credit enhanced ratings.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMNTL enjoys a 'Navratna Status' that gives greater autonomy to central public sector enterprises (CPSEs) in their investment and capital expenditure (capex) decisions. Such a status also aims at facilitating expansion of its operations in domestic and global markets, CARE Ratings said.<small class=\"brtagPara\"> </small>\n<strong>READ: <a href=\"https://www.business-standard.com/markets/news/tata-power-gains-3-post-q3-analysts-split-on-outlook-should-you-buy-125020500362_1.html?1738734803\" target=\"_blank\">Tata Power gains 3% post Q3: Analysts split on outlook; should you 'Buy'?</a></strong></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn October 2019, considering MTNL's legacy and strategic importance, GoI announced a revival plan for MTNL and BSNL and continued to support the company’s funding requirements through issuance of LoC. To make public sector units (PSUs) financially viable, the Union Cabinet approved a second revival plan for BSNL and MTNL (the telcos) amounting to Rs 1.64 trillion on July 27, 2022. Revival plan is aimed at upgrading services, rolling out 4G services, augmenting the telecom network, and de-stressing balance sheets.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs BSNL is handling MTNL's operations, fund infusion per revival package has taken place in BSNL, which is managing combined capex for the telcos. Progress on monetisation of MTNL’s certain identified land assets has also been slow, which has since been transferred from the Department of Investment and Public Asset Management (DIPAM) to the Department of Public Enterprise (DPE), CARE Ratings said.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 14:05:25",
            "link": "https://www.business-standard.com/markets/news/mtnl-zooms-20-on-heavy-volumes-surges-28-in-2-days-125020500268_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500268"
        },
        {
            "title": "Champions Trophy 2025: Injury woes continue to mount trouble for Aussies",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><div>\r\n\tOne of the favourites to win the <a href=\"https://www.business-standard.com/cricket/champions-trophy\" target=\"_blank\"><strong>2025 ICC Champions Trophy</strong></a> and the reigning ODI world champion, Australia are having a less-than-ideal time on their road to the tournament. After Mitchell Marsh, who was part of Australia’s initially announced squad for the ICC event, was ruled out due to injury, Australian coach Andrew McDonald told the media on Wednesday that their regular skipper, Pat Cummins, is still not match-fit and is highly unlikely to return in time to lead the team in the Champions Trophy. McDonald said that either Steve Smith or Travis Head could be named ODI skipper in Cummins' absence.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tApart from Cummins, pacer Josh Hazlewood is also still recovering from a previous injury.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Smith and Head in the captaincy race</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tMcDonald revealed that discussions have been ongoing regarding the leadership role in Cummins' absence. He noted that both Smith and Head are under consideration, with Smith having already showcased his captaincy abilities in Test cricket and one-day internationals.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"They're the two obvious choices,\" McDonald stated, adding that conversations with them have been taking place alongside Cummins while finalising the Champions Trophy squad.<small class=\"brtagPara\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/schedule\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 full schedule, match timings (IST) here</strong></a></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Hazlewood also in doubt</strong><small class=\"brtag\"> </small></div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tAustralia could also be without Josh Hazlewood, who is battling a hip issue. McDonald confirmed that the selectors are awaiting medical updates in the coming days before making a final decision. Hazlewood recently recovered from side and calf injuries that ruled him out of multiple Tests against India and the Test tour of Sri Lanka.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Replacement for Marsh</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tAll-rounder Mitchell Marsh was ruled out of the Champions Trophy due to a back injury few days back, and  is unlikely to feature in the remainder of the domestic season as well. However, there is still a possibility he could participate in the IPL for Lucknow Super Giants.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAustralia have not yet named a replacement for Marsh. However, McDonald hinted that Beau Webster is in contention due to his ability as a seam-bowling all-rounder.<small class=\"brtagPara\"> <span style=\"font-size:12px\"> </span></small></div>\n<div>\n<strong>Abbott and Johnson in the mix</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tWith Cummins and Hazlewood doubtful, Sean Abbott is expected to return to the ODI squad after missing the final Champions Trophy selection due to form. Additionally, left-arm quick Spencer Johnson is set to fly to Sri Lanka as a backup option.<small class=\"brtagPara\"> </small>\n<div>\n<div>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/points-table\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 points table here</strong></a></div>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/points-table\" target=\"_blank\"><small class=\"brtag\"> </small></a></div>\n<small class=\"brtag\"> </small></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 14:00:35",
            "link": "https://www.business-standard.com/cricket/champions-trophy/champions-trophy-injury-woes-continue-to-mount-trouble-for-the-aussies-125020500374_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500374"
        },
        {
            "title": "MTNL share price hits 20% upper circuit on heavy volumes; up 28% in 2 days",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tMahanagar Telephone Nigam Limited share price (MTNL share price) was locked in the 20-per cent upper circuit, at Rs 57.16 per share, on the BSE today. The rise in MTNL share in Wednesday's intraday trade came was led by heavy volumes. In the last two day, the stock of the state-owned telecom cellular and fixed line services provider has surged 28 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTill 09:43 AM, average trading volume on the counter had jumped over three fold with a combined 21.17 million equity shares, representing 3.4 per cent of total equity of <a href=\"https://www.business-standard.com/markets/mahanagar-telephone-nigam-ltd-share-price-2293.html\" target=\"_blank\">MTNL</a>, having changed hands on the NSE and BSE.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<h3>\r\n\tMTNL share price news</h3>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFinance Minister Nirmala Sitharaman, while presenting Union Budget 2025, on February 1, announced a new scheme to provide broadband connectivity to all government secondary schools and health centres.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Broadband connectivity will be added to all government secondary schools and primary healthcare centres in rural areas under the 'Bharat Net' project,\" the finance minister had said while presenting Budget 2025 in the Parliament.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, news reports suggest that the Government will likely allow MTNL and BSNL to monetise their assets.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to a report by Hindi business news channel, CNBC Awaaz, Centre has cleared decks to monetise non-core properties worth Rs 16,000-crore. A Group of Ministers has also waived off various charges and fees on these properties.<small class=\"brtagPara\"> </small>\n<strong>READ: </strong><a href=\"https://www.business-standard.com/markets/news/titagarh-rail-systems-shares-surge-7-on-new-business-plans-details-here-125020500359_1.html?1738734803\" target=\"_blank\">Titagarh Rail Systems shares surge 7% on new business plans; details here</a></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBusiness Standard, however, could not verify these reports.</div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tMTNL share price history</h3>\n<div>\r\n\tThe stock price of MTNL hit a low of Rs 41.40 on January 28, 2025, and has corrected 59 per cent from its 52-week high level of Rs 101.88, touched on July 29, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn December 17, 2024, CARE Ratings had upgraded long-term debt instruments (bonds issue) of MTNL to 'CARE AAA', and simultaneously removed the 'Rating Watch with Negative Implications' and assigned a 'Stable' outlook.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"This rating action follows sustained track record of timely fund infusion by Government of India (GoI) in accordance with the stipulated T-structure payment mechanism (SPM), besides comprehensive understanding of the escrow account’s operational management maintained with Bank of India for servicing Sovereign Guarantee (SG) backed bonds,\" the rating agency said in its rationale.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe outlook for MTNL, thus, is expected to be stable, backed by the expectation of consistent support to be extended by the Government of India. Furthermore, operating in a strategically important sector and support mechanisms such as sovereign guarantees shall ensure timely servicing of the obligations providing stability to credit enhanced ratings.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMNTL enjoys a 'Navratna Status' that gives greater autonomy to central public sector enterprises (CPSEs) in their investment and capital expenditure (capex) decisions. Such a status also aims at facilitating expansion of its operations in domestic and global markets, CARE Ratings said.<small class=\"brtagPara\"> </small>\n<strong>READ: <a href=\"https://www.business-standard.com/markets/news/tata-power-gains-3-post-q3-analysts-split-on-outlook-should-you-buy-125020500362_1.html?1738734803\" target=\"_blank\">Tata Power gains 3% post Q3: Analysts split on outlook; should you 'Buy'?</a></strong></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn October 2019, considering MTNL's legacy and strategic importance, GoI announced a revival plan for MTNL and BSNL and continued to support the company’s funding requirements through issuance of LoC. To make public sector units (PSUs) financially viable, the Union Cabinet approved a second revival plan for BSNL and MTNL (the telcos) amounting to Rs 1.64 trillion on July 27, 2022. Revival plan is aimed at upgrading services, rolling out 4G services, augmenting the telecom network, and de-stressing balance sheets.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs BSNL is handling MTNL's operations, fund infusion per revival package has taken place in BSNL, which is managing combined capex for the telcos. Progress on monetisation of MTNL’s certain identified land assets has also been slow, which has since been transferred from the Department of Investment and Public Asset Management (DIPAM) to the Department of Public Enterprise (DPE), CARE Ratings said.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 14:00:33",
            "link": "https://www.business-standard.com/markets/news/mtnl-zooms-20-on-heavy-volumes-surges-28-in-2-days-125020500268_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500268"
        },
        {
            "title": "J&K Police detain over 500 after retired soldier's killing in Kulgam attack",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tA day after suspected militants killed a retired soldier and injured his wife and niece in south Kashmir, Jammu and Kashmir Police detained more than 500 individuals across the Kashmir Valley.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMany of those arrested are relatives of Kashmiri militants residing in Pakistan and Pakistan-occupied Kashmir (PoK), The Indian Express reported.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe news report quoted a senior police officer as saying that there have been large-scale arrests across the Valley, and the number exceeds 500.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe officer added that such measures are meant to send a clear message to militants operating from across the border that such attacks will not be tolerated.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tAttack on retired soldier’s family</h3>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Monday, unidentified gunmen targetted retired soldier Manzoor Ahmad Wagay, his wife, and her niece in Behibagh village, Kulgam. Wagay, 45, succumbed to gunshot wounds to his abdomen, while the two women were injured in their legs and are receiving medical treatment.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA police source described the assault as a significant provocation, noting that the militants have crossed a red line by targetting the family of a soldier.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis marks the first instance of militants targeting civilians in Kashmir this year. In response, J&amp;K Chief Minister Omar Abdullah and Lieutenant Governor Manoj Sinha have denounced the attack.  </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“I am deeply saddened by the tragic killing of ex-serviceman Manzoor Ahmad Wagay. My heartfelt condolences to his family, and prayers for the swift recovery of his injured wife and niece. Such heinous violence has no place in our society and must be condemned in the strongest terms,” Abdullah stated in a post on X.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUnprecedented detentions of militants’ relatives</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile police have previously seized the properties of Pakistan-based Kashmiri militants, this is the first instance where their relatives have been detained in such large numbers. This move reflects the authorities' commitment to curbing militant activities and maintaining security in the region, the news report said.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<em>(With agency inputs)</em></div></div>",
            "pub_date": "2025-02-05 13:55:24",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/j-k-police-detain-over-500-after-retired-soldier-s-killing-in-kulgam-attack-125020500420_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500420"
        },
        {
            "title": "Capital market-related stocks in focus; MOFSL, KFintech soar upto 12% today",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tShares of <strong>capital market-related companies </strong>rallied up to 12 per cent on the National Stock Exchange (NSE) in Wednesday's intraday, amid heavy volumes on value buying. In comparison, the Nifty 50 today was up 0.14 per cent at 23,733.65 at 10:50 AM.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMotilal Oswal Financial Services (MOFSL), KFin Technologies (KFintech), 360 One Wam, Nuvama Wealth Management, Computer Age Management Services(CAMS), Angel One, Anand Rathi Wealth, and Central Depository Services (India) were up in the range of 3 per cent to 12 per cent. These stocks had corrected up to 40 per cent from their respective 52-week highs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGiven the low penetration of financial savings and the rising mutual fund folios, as well as demat accounts, analysts expect the growth trajectory of these market intermediaries to continue in the coming years. On the other side, broking industry will also see further consolidation in the hands of the larger players due to many reasons, including increasing compliance costs and norms. Hence, analysts believe the full-service brokerage houses benefit from this consolidation.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/markets/news/here-s-why-stock-broking-firm-angel-one-share-price-gained-6-in-trade-125020500291_1.html\" target=\"_blank\">Here's why stock broking firm Angel One share price gained 6% in trade</a></strong></div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFY26 Budget, meanwhile, marked a decisive change by offering tax breaks to individuals in the income class earning Rs 12 lakh annually. This will incentivise more people to adopt the new tax regime over old tax regime and thus, tax saving value proposition reduces materially for customers. For capital market players, higher disposable incomes could support systematic investment plan (SIP), future &amp; options (F&amp;O) and cash volumes, analysts at Elara Capital said.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe cut in income taxes, boost to global capability centers in tier II cities, scheme for procurement of pulses and higher interest exemption for senior citizens may stabilise the portfolios of MFI/NBFCs – through repayment of existing liabilities and/or demand for higher loans as disposable incomes rise, the brokerage firm said.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmong individual stocks, MOFSL share price zoomed 12 per cent to Rs 720.55 amid heavy volumes. In the last two days, the market price of MOFSL stock has rallied 15 per cent. Prior to that, it had tanked 41 per cent from its 52-week high level of Rs 1,063.40, touched on October 18, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMOFSL believes that the cumulative household savings, which was $14 trillion in the last quarter centurys will rise to nearly $126 trillion in the next 25 years. Importantly, there will be a higher share of financial savings, allocation to equities, exposure to alternates and greater concentration of wealth.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis, the brokerage firm believes, is really the mega trend that is driving multiple businesses of the Motilal Oswal group, whether it's the asset management business, wealth management business, private wealth business, alternate assets or capital markets.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tShares of KFintech, on the other hand, rallied 9 per cent to Rs 1,201, surging 13 per cent in two days. The stock had corrected 35 per cent from its 52-week high level of Rs 1,640, hit on December 30, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tKFintech is the only investor and issuer solutions provider in India that offers services to asset managers such as mutual funds, alternative investment funds, wealth managers and pension as well as corporate issuers and is one of the three operating central record keeping agencies for the National Pension System in India.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 13:55:24",
            "link": "https://www.business-standard.com/markets/news/capital-market-related-stocks-in-focus-mofsl-kfintech-soar-upto-12-today-125020500397_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500397"
        }
    ]
}