{
    "data": [
        {
            "title": "Eris Life soars 13% on strong Q3 revenue; Co reduces debt ahead of guidance",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Eris Lifesciences share price</strong> moved higher by 13 per cent to Rs 1,386 on the BSE in Wednesday's intraday trade, in an otherwise subdued market, after the company reported healthy <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">December quarter (Q3) results</a>.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/markets/eris-lifesciences-ltd-share-price-66197.html\" target=\"_blank\">Eris Life</a> reported a strong revenue growth of 49.6 per cent year-on-year (Y-o-Y) in Q3FY25, aided by integration of Swiss Parenteral and synergies from Biocon's portfolio. The pharmaceutical company guided for net debt of Rs 2,100 crore/1,750 crore by FY25/H1FY26 as against Rs 3,000 crore as of FY24.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, the board of directors of Eris is scheduled to meet on Friday, February 07, 2025, to consider the declaration of interim dividend for the financial year 2024-25. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"In the event of the declaration of interim dividend as aforesaid, the proposed record date for the purpose of determining the members eligible for receiving the said <a href=\"https://www.business-standard.com/topic/interim-dividend\" target=\"_blank\">interim dividend</a> shall be Monday, February 10, 2025,\" Eris said in an exchange filing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt 11:46 AM, Eris Life share price was quoting 11 per cent higher at Rs 1,363.35, as compared to 0.22 per cent decline in the BSE Sensex. The stock had hit a record high of Rs 1,593 on December 11, 2024. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn Q3FY25, Eris reported 42.6 per cent Y-o-Y growth in earnings before interest, tax, depreciation and amortisation (Ebitda) at Rs 250 crore. Margins, however, contracted to 34.4 per cent from 36.1 per cent.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Y-o-Y impact on gross margins was largely on account of change in product and business mix due to integration of new businesses. Depreciation and finance charges came in higher due to consolidation of new businesses. Resultant profit after tax came in at Rs 87 crore, down 14.3 per cent Y-o-Y.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEris Life has opted for an inorganic route to diversify and scale up its existing portfolio. This has been implemented without diluting margins. Analysts at PL Capital, thus, expect margins to sustain at over 35 per cent as revenue scales up from recent acquisitions, which are currently operating at sub-optimal profitability. </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The company has multiple growth levers such as broad-based offerings in the derma segment, opportunities in the cardiometabolic market with patent expirations and benefits of operating leverage, as revenue scales up from these acquisitions,\" the brokerage firm said in its result update report. It maintained its 'buy' rating on Eris Life stock with a revised target price of Rs 1,450 per share.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEris Lifesciences is engaged in the manufacture and marketing of pharmaceutical products. The company holds a dominant position in key specialty areas such as Diabetologists, Cardiologists, Neurologists, Gynecologists, Dermatologists and Consulting Physicians. The company derives 40 per cent of Branded Formulations revenue from seven emerging specialties of Dermatology, Insulins, Women’s Health, CNS, Oncology, Critical Care and Nephrology, giving us significant headroom for disruptive growth in these segments.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The acquisition of Swiss Parenterals and Biocon's domestic branded formulations business will provide a strong launch platform to make deeper inroads in the Indian Injectables market. A number of major molecules will lose exclusivity in the cardio metabolic segment in the next 3-5 years. On the back of its established position in this market, Eris is well positioned to leverage these opportunities as has been demonstrated over the last 3 years with Top-5 market positions in several molecules,\" the company said in its Annual Report.</div></div>",
            "pub_date": "2025-02-05 15:00:40",
            "link": "https://www.business-standard.com/markets/news/eris-soars-13-on-strong-q3-revenue-debt-reduction-ahead-of-guidance-125020500546_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500546"
        },
        {
            "title": "Iran praises US cuts on foreign aid funding, looks forward to nuclear talks",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tIran's government seems to be welcoming some recent decisions by the United States even though they happen to come from a man Iranian operatives have allegedly been plotting to assassinate.</p>\n<p>\r\n\tPresident Donald Trump's moves to freeze spending on foreign aid and overhaul, maybe even end, the US Agency for International Development have been lauded in Iranian state media.</p>\n<p>\r\n\tThe reports say the decisions will halt funding for opponents of the country's Shiite theocracy pro-democracy activists and others supported through programmes as part of US government's efforts to help democracy worldwide.</p>\n<p>\r\n\tAt the same time, Iranian officials appear to be signalling that they are waiting for a message from Trump on whether he wants to negotiate over Tehran's rapidly advancing nuclear programme. At stake are potentially billions of dollars withheld from Iran through crushing sanctions and the future of a programme on the precipice of enriching weapons-grade uranium.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAnd even when signing an executive order to reimpose his maximum pressure on Iran on Tuesday, Trump suggested he wanted to deal with Tehran.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tMeanwhile, ordinary Iranians worry what all this could mean for them.</p>\n<p>\r\n\tIt encourages hard-liners inside Iran to continue repressions because they feel the US would have less capability in supporting Iranian people who seek freedom, said Maryam Faraji, a 27-year-old waitress in a coffee shop in northern Tehran.</p>\n<h3>\r\n\tIranian media say Trump's cuts could stop the opposition in Iran</h3>\n<p>\r\n\tThe state-run IRNA news agency said that cutting the budget of foreign-based opposition could affect the sphere of relations between Tehran and Washington.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tNewspapers, like the conservative Hamshhari daily, described Iran's opposition as counterrevolutionaries who had been celebrating\" Trump's election as heralding the \"last days of life of the Islamic Republic.</p>\n<p>\r\n\tThey then \"suddenly faced the surprise of cut funding from their employer, the newspaper crowed.</p>\n<p>\r\n\tEven the reformist newspaper Hammihan compared it to a cold shower for opponents of Iran's theocracy abroad, an idea also expressed by the Foreign Ministry.</p>\n<p>\r\n\tThose financial resources are not charity donations,\" Esmail Bagahei, Iran's Foreign Ministry spokesman, said during a briefing with reporters on Monday. They are wages paid in exchange for services.\"<small class=\"brtagPara\"> </small>\r\n\t\"This is a clear sign of America's interventionist policy particularly during the Biden administration, which tried to pressure Iran and meddle in its domestic affairs through financial aid, Bagahei added.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIt remains unclear how funding for Iranian activists and opposition figures would be affected by the USAID decision.</p>\n<p>\r\n\tThe lion's share of money for civil society in Iran has come through the U.S. State Department's Near East Regional Democracy fund, known by the acronym NERD, which grew as an American response to the Green Movement protests in 2009.</p>\n<p>\r\n\tIn 2024, the Biden administration requested $65 million for NERD after over $600 million had been appropriated by Congress for the fund, according to the Congressional Research Service. That money and other funding had gone in the past toward training journalists and activists on how to report on human rights abuses, funding access to the internet amid government shutdowns and other issues.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe State Department did not respond to a request for comment over the NERD funding and its future. American officials for years have kept the awardees of NERD grants secret due to what they describe as the risk activists face from Iran, particularly after Iranian intelligence officers have allegedly targeted in kidnapping or assassination plots, US prosecutors say.</p>\n<h3>\r\n\tIran repeatedly hints it's ready to talk to Trump</h3>\n<p>\r\n\tIran also noticed that the US avoided direct criticism of the Islamic Republic during a review by the United Nations Human Rights Council meeting in Geneva last week. For those in Iran's government, there's anticipation this could mean that Trump is willing to negotiate, something he repeatedly brought up in his election campaign as a possibility.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tEven Iran's Supreme Leader Ayatollah Ali Khamenei, who has final say on all state matters, in a speech in September opened the door to talks with the US, saying there is no harm in engaging with the enemy. More recently, he tempered that, warning that sinister plots could still be concealed behind diplomatic smiles.</p>\n<p>\r\n\tWe must be careful about who we are dealing with, who we are negotiating with, and who we are speaking to,\" Khamenei said last week.</p>\n<p>\r\n\tWhile Bagahei, the Foreign Ministry spokesman, acknowledged Iran hasn't seen any green light yet for talks, Iran is trying to do everything it can to signal it wants them.</p><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe country's reformist President Masoud Pezeshkian, who campaigned on outreach to the West, urged officials on Monday to listen to dissent from the Iranian people and avoid further crackdowns like those that followed the 2022 death of Mahsa Amini.</p>\n<p>\r\n\tThe enemies are hoping that by stirring up disputes within the country, they will throw people into the streets and then ride the wave of protests themselves,\" Pezeshkian said.</p>\n<p>\r\n\tAs he signed the executive order on Iran on Tuesday, Trump warned the country would be obliterated if he was assassinated by Tehran. But he still left the door open for talks.</p><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tI'm going to sign it, but hopefully we're not going to have to use it very much, he said from the Oval Office. We will see whether or not we can arrange or work out a deal with Iran.</p>\n<p>\r\n\tWe don't want to be tough on Iran. We don't want to be tough on anybody,\" Trump added. \"But they just can't have a nuclear bomb.</p>\n<p>\r\n\tHowever, factions within Iran's theocracy are still likely to oppose talks, whether out of their own self interest or over anger that Trump ordered the 2020 drone strike that killed Gen. Qassem Soleimani, the country's top general and a revered figure.</p><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThat killing fueled Iranian calls for Trump's assassination and alleged plots against him. In November, the Justice Department disclosed an Iranian murder-for-hire plot to kill Trump. While Iran denied being involved, Tehran has a history of plotting the killing of opponents abroad.</p>\n<p>\r\n\t\"This will not have any impact on the factions that oppose talks with the U.S. but maybe some moderates find it as an excuse to say that Trump is taking some steps, Iranian political analyst Ahmad Zeiabadi said.</p>\n<p>\r\n\tFor now though, much of this can seem as conjecture and theorising to many of Iran's over 80 million people who continue to struggle in the grips of the country's ailing economy.</p><div id=\"between_article_content_10-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tTehran taxi driver Gholanhossein Akbari, 27, insisted Iranians like him never benefitted from US support of Iran's pro-democracy activists abroad.</p>\n<p>\r\n\t\"We did not see any result from the funds the US paid to foreign-based Iranian activists who only make comments in the media, Akbari said.</p><p></p></div>",
            "pub_date": "2025-02-05 15:00:39",
            "link": "https://www.business-standard.com/world-news/iran-praises-us-cuts-on-foreign-aid-funding-looks-forward-to-nuclear-talks-125020500344_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500344"
        },
        {
            "title": "India key market for AI, must be among leaders of AI revolution: Sam Altman",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tOpenAI CEO Sam Altman on Wednesday said that the country is important for Artificial Intelligence and OpenAI, and added that India - with its full stack model - should be among the leaders of the AI revolution.</p>\n<p>\r\n\tAltman, during a fireside chat with IT Minister Ashwini Vaishnaw, said OpenAI tripled its users here in the last year. He gave a ringing endorsement to India's efforts in building on AI at all levels of the stack, chips, models and \"the incredible applications\".</p>\n<p>\r\n\t\"India is an incredibly important market for AI in general, for OpenAI in particular, it's our second biggest market. Tripled users here in the last year, but mostly seeing what people in India are building with AI at all levels of the stack, chips, models, you know, all of the incredible applications,\" Altman, who is on a whirlwind India tour, said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAltman advocated India to go all out in its AI play. \"I think India should be one of the leaders of the AI revolution. But it's really quite amazing to see what the country has done... embraced the technology and is building the entire stack of things on top of it,\" Altman said.</p>\n<p>\r\n\tAsked about his advice, as India looks to have a global voice in AI and take a leadership position, Altman said \"it seems to me like it's working\". Altman's bullish view on India's AI efforts is a telling statement given that he had faced a backlash in 2023, when he had expressed doubts about powerful AI models emerging outside of the United State.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tDuring the fireside chat on Wednesday, IT Minister Vaishnaw said that innovation can come from anywhere in the world \"why shouldn't it come from India\".</p>\n<p>\r\n\tAltman's visit, his second one in two years, comes at an interesting juncture when OpenAI's (and indeed the western world's) dominance in artificial intelligence has abruptly been challenged by Chinese upstart DeepSeek, which turned heads with its low-cost AI model R1, built at less than $6 million and guzzling a fraction of compute power when compared to popular models like ChatGPT.</p>\n<p>\r\n\tDeepseek overtook ChatGPT as the top-ranked free app on Apple's App Store, as the US tech industry -- that has long-justified injecting billions of dollars into AI investments -- watched in sheer disbelief last week.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAI chipmaker and Wall Street superstar Nvidia shed $590 billion in market capitalisation last Monday, suffering the single greatest one-day value wipeout of any firm in history.</p>\n<p>\r\n\tAhead of Altman's visit, a 2023 video of him -- where he had expressed doubts about powerful AI models emerging outside of the United States -- has also resurfaced.</p>\n<p>\r\n\tThe US has been accelerating its AI efforts and just last month, President Donald Trump announced up to $500 billion private sector investment to fund artificial intelligence infrastructure.</p>\n<p>\r\n\tThe new company, Stargate, which is being created in partnership with Oracle, SoftBank and Microsoft-backed Open AI, would add to tech companies' large investments in US data centres, huge buildings full of servers that provide massive computing power.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tOn Monday, Japanese technology giant SoftBank Group and OpenAI stepped up their AI partnership with a 50:50 held company -- SB OpenAI Japan.</p>\n<p>\r\n\tAltman's visit also assumes significance as OpenAI is facing legal hurdles in India, including cases involving claims of copyright breaches. OpenAI has, however, reportedly maintained it only uses publicly available data and has argued that Indian courts have no jurisdiction to hear the matter.</p>\n<p>\r\n\tWith the global tech landscape becoming increasingly dynamic and complex, India is fortifying its sovereign interests with its own AI model.</p>\n<p>\r\n\tLast week, India outlined global AI ambitions with plans to build its own 'foundational model' that could take on the might of ChatGPT, DeepSeek R1, and others, as it lined up \"most affordable\" common compute facility powered by 18,693 GPUs to be used by startups and researchers, for creating Artificial Intelligence applications, and new algorithms.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIT Minister Ashwini Vaishnaw announced that India is all set to launch its own safe and secure indigenous AI model at an affordable cost. He said compared to global models costing $2.5-3 per hour of usage, India's AI Model will cost less than Rs 100 per hour ($1.16 per hour) after 40 per cent government subsidy.</p>\n<p>\r\n\tThe minister had exuded confidence that India will build a foundational model that is world class, and that it will be able to compete with best models across the globe.</p><p></p></div>",
            "pub_date": "2025-02-05 14:55:27",
            "link": "https://www.business-standard.com/technology/tech-news/india-important-market-for-ai-openai-should-be-among-leaders-of-ai-revolution-ceo-sam-altman-125020500480_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500480"
        },
        {
            "title": "Nykaa Q3 preview: PAT likely to zoom 178% QoQ, revenue 21%, say analysts",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Nykaa Q3 results preview: </strong><a href=\"https://www.business-standard.com/markets/fsn-e-commerce-ventures-ltd-share-price-75803.html\" target=\"_blank\">FSN E-Commerce Ventures</a>, parent of online beauty and fashion brand Nykaa, is all set to release its third quarter ended December 31, 2024, results on Monday, February 10, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBrokerages tracked by Business Standard estimate the revenue of Nykaa to grow 26.9 per cent year-on-year (Y-o-Y), on average, to Rs 2,270.26 crore as compared to Rs 1,788.8 crore a year ago. On a quarter-on-quarter (Q-o-Q) basis, revenue is forecasted to increase 21 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNykaa's adjusted profit after tax (PAT) for the quarter that ended December 31, 2024, is estimated to zoom 81.9 per cent to Rs 33.66 crore, on average, as compared to Rs 18.5 crore a year ago. On a quarterly basis, the adjusted PAT is expected to jump 178.18 per cent.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnalysts and investors will keep an eye on management's commentary fashion segment, unwinding on working capital and competitive landscape shift.</div>\n<h3>\r\n\tHere's how brokerages expect Nykaa to fare in Q3:</h3>\n<div>\n<strong>HDFC Securities:</strong> Analysts believe Nykaa's beauty and personal care (BPC)/ Fashion revenue in gross merchandise value (GMV) is likely to clock 44.9 per cent/6.9 per cent Y-o-Y growth respectively.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIts BPC's average order value (AOV) is likely to be healthy at Rs 2,100. Further, BPC/Fashion annual unique transacting customers (AUTC) are expected to grow 40.7 per cent/13.8 per cent Y-o-Y and BPC/Fashion orders are expected to rise 44.2 per cent/15.5 per cent Y-o-Y.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe brokerage expects overall Earnings before interest, tax, depreciation and amortisation (Ebitda) margin at 6.2 per cent in Q3FY25 as against 5.5 per cent a year ago. Overall Ebitda is estimated at Rs 140 crore as compared to Rs 98.8 crore a year ago.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Nuvama Institutional Equities: </strong>The brokerage expects 31 per cent/20 per cent Y-o-Y growth in BPC/Fashion GMV. Overall, revenue is likely to increase 27 per cent Y-o-Y to Rs 2,271.8 crore as compared to Rs 1,788.8 crore. A slight improvement in Ebitda margin is likely at 5.6 per cent in Q3FY25 as compared to 5.5 per cent in Q2.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOverall, Ebitda for Q3 is pegged at Rs 127.2 crore as compared to Rs 98.8 crore a year ago.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JM Financial: </strong>In its Q3FY25 revenue update, the company reported low-thirties Y-o-Y growth in the BPC segment while highlighting that electronic business-to-business (eB2B) now accounts for 8 per cent of BPC GMV. The brokerage reckons core BPC to grow Y-o-Y in the range of 27-29 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Such feisty growth, despite the narrative of quick commerce likely hindering Nykaa, goes a long way in confirming that quick commerce solves for a different use case and revalidates that BPC rise in quick commerce is unlikely to come at the cost of Nykaa,\" JM Financial said.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOverall revenue for the quarter under review is expected at Rs 2,279.6 crore as compared to 1,788.8 crore a year ago. JM Financial's channel checks suggested that Nykaa Fashion, despite reporting muted growth, is still gaining market share.</div></div>",
            "pub_date": "2025-02-05 14:55:27",
            "link": "https://www.business-standard.com/markets/news/nykaa-q3-preview-pat-likely-to-zoom-178-qoq-revenue-21-say-analysts-125020500251_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500251"
        },
        {
            "title": "Gold consumption in India to cool in 2025 as prices soar, says WGC",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tIndia's gold consumption in 2025 is set to moderate from last year's nine-year peak, as a rally in prices to a record high is seen dampening jewellery demand, even as investment demand rises, the World Gold Council (WGC) said on Wednesday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDemand for gold could stand between 700 metric tonnes and 800 metric tonnes, compared to last year's 802.8 tonnes, which was the highest since 2015, Sachin Jain, CEO of WGC's Indian operations, told Reuters.<small class=\"brtag\"> </small></div>\n<div>\r\n\tHistorically, rising gold prices first affect jewellery customers, and if prices keep rising and remain volatile this year, jewellery demand will be impacted, Jain said.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tDomestic gold prices hit a record high of Rs 84,399 ($968.62) per 10 grams on Wednesday. They have risen 10 per cent so far in 2025 after rising more than 21 per cent in 2024.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/commodities/gold-demand-up-1-in-2024-to-remain-supported-by-economic-uncertainty-wgc-125020500551_1.html\" target=\"_blank\">Gold demand up 1% in 2024, to remain supported by economic uncertainty: WGC</a></strong></div>\n</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\t\"Households that buy jewellery have a set budget, and when they purchase jewellery, their budget does not increase at the same rate as the rise in gold prices,\" Jain said.<small class=\"brtag\"> </small></div>\n<div>\r\n\tHowever, the soaring gold prices, leading to effectively higher returns, are boosting investment demand, which will rise further in 2025 after surging 29 per cent in 2024 to an 11-year high of 239.4 tonnes, he said.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tJewellery accounts for nearly 70 per cent of India's total gold demand, while investment demand makes up the rest.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"It is anticipated that the trend of robust gold investment demand will continue, with retail investors showing growing interest in gold ETFs, digital gold, and coins and bars,\" Jain said.<small class=\"brtag\"> </small></div>\n<div>\n<div>\n<i>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</i></div>\n<small class=\"brtag\"> </small>\n</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 14:50:30",
            "link": "https://www.business-standard.com/markets/commodities/gold-consumption-in-india-to-cool-in-2025-as-prices-soar-says-wgc-125020500563_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500563"
        },
        {
            "title": "Eris Life soars 13% on strong Q3 revenue; Co reduces debt ahead of guidance",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Eris Lifesciences share price</strong> moved higher by 13 per cent to Rs 1,386 on the BSE in Wednesday's intraday trade, in an otherwise subdued market, after the company reported healthy December quarter (Q3) results.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEris Life reported a strong revenue growth of 49.6 per cent year-on-year (Y-o-Y) in Q3FY25, aided by integration of Swiss Parenteral and synergies from Biocon's portfolio. The pharmaceutical company guided for net debt of Rs 2,100 crore/1,750 crore by FY25/H1FY26 as against Rs 3,000 crore as of FY24.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, the board of directors of Eris is scheduled to meet on Friday, February 07, 2025, to consider the declaration of interim dividend for the financial year 2024-25. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"In the event of the declaration of interim dividend as aforesaid, the proposed record date for the purpose of determining the members eligible for receiving the said interim dividend shall be Monday, February 10, 2025,\" Eris said in an exchange filing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt 11:46 AM, Eris Life share price was quoting 11 per cent higher at Rs 1,363.35, as compared to 0.22 per cent decline in the BSE Sensex. The stock had hit a record high of Rs 1,593 on December 11, 2024. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn Q3FY25, Eris reported 42.6 per cent Y-o-Y growth in earnings before interest, tax, depreciation and amortisation (Ebitda) at Rs 250 crore. Margins, however, contracted to 34.4 per cent from 36.1 per cent.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Y-o-Y impact on gross margins was largely on account of change in product and business mix due to integration of new businesses. Depreciation and finance charges came in higher due to consolidation of new businesses. Resultant profit after tax came in at Rs 87 crore, down 14.3 per cent Y-o-Y.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEris Life has opted for an inorganic route to diversify and scale up its existing portfolio. This has been implemented without diluting margins. Analysts at PL Capital, thus, expect margins to sustain at over 35 per cent as revenue scales up from recent acquisitions, which are currently operating at sub-optimal profitability. </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The company has multiple growth levers such as broad-based offerings in the derma segment, opportunities in the cardiometabolic market with patent expirations and benefits of operating leverage, as revenue scales up from these acquisitions,\" the brokerage firm said in its result update report. It maintained its 'buy' rating on Eris Life stock with a revised target price of Rs 1,450 per share.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEris Lifesciences is engaged in the manufacture and marketing of pharmaceutical products. The company holds a dominant position in key specialty areas such as Diabetologists, Cardiologists, Neurologists, Gynecologists, Dermatologists and Consulting Physicians. The company derives 40 per cent of Branded Formulations revenue from seven emerging specialties of Dermatology, Insulins, Women’s Health, CNS, Oncology, Critical Care and Nephrology, giving us significant headroom for disruptive growth in these segments.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The acquisition of Swiss Parenterals and Biocon's domestic branded formulations business will provide a strong launch platform to make deeper inroads in the Indian Injectables market. A number of major molecules will lose exclusivity in the cardio metabolic segment in the next 3-5 years. On the back of its established position in this market, Eris is well positioned to leverage these opportunities as has been demonstrated over the last 3 years with Top-5 market positions in several molecules,\" the company said in its Annual Report.</div></div>",
            "pub_date": "2025-02-05 14:50:29",
            "link": "https://www.business-standard.com/markets/news/eris-soars-13-on-strong-q3-revenue-debt-reduction-ahead-of-guidance-125020500546_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500546"
        },
        {
            "title": "Is Ford reconsidering its India re-entry? Decision delayed till late summer",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFord’s much-anticipated return to the Indian market has hit a roadblock, with the US auto giant reportedly delaying its final decision until late summer. The company was initially expected to unveil its detailed India strategy by January, but is now taking a step back to reassess its plans.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to a report in the Times of India, sources familiar with the matter said that Ford’s board discussed the issue last month and opted against making any immediate announcements. \"The company is using this time to rethink its India strategy,\" a source revealed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA Ford spokesperson reiterated the company’s commitment to utilising its Chennai manufacturing plant for global markets. “(We are) committed to utilising the manufacturing capabilities in Chennai to serve global markets and are thankful to the govt of Tamil Nadu for its continued support as we advance our plans. Further details regarding the type of manufacturing, timelines and other specifics will be shared in due course and we have nothing additional to share at this time.\"</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhy is Ford rethinking its India re-entry?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSeveral factors are behind Ford’s hesitation. The current political climate in the US prioritises domestic manufacturing, potentially making foreign investments less attractive. Additionally, Ford would need to invest significantly to refurbish its Maraimalainagar facility, which has been idle since the company's exit from India in 2021.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndustry experts estimate that converting the Chennai plant for electric vehicle (EV) production could cost anywhere between $100 million to $300 million, as major structural changes, including new welding and assembly lines, would be required.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhy Ford exited India in 2021?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFord’s retreat from India in 2021 marked the end of a decades-long struggle. Despite launching popular models like the EcoSport, Figo, and Endeavour, the automaker failed to compete with market leaders such as Maruti Suzuki, Hyundai, Tata Motors, and Kia, which dominated with their budget-friendly, fuel-efficient models.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith $2 billion in accumulated losses and a market share of less than 2 per cent, Ford found it increasingly difficult to sustain operations. The collapse of its joint venture with Mahindra &amp; Mahindra in 2020 further complicated its position, leaving the company without a local partner to help navigate the price-sensitive Indian market.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile Ford ceased domestic production, it continued to support existing customers through spare parts and service networks, and it still exports vehicles from India.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tFord’s EV bet: A new opportunity?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFord's potential return could be centered around electric vehicles. The company has been in talks with the Tamil Nadu government about repurposing its Chennai facility for EV production aimed at global exports. If the plan materialises, Ford could position India as a key player in its global EV strategy.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tReports suggest the initiative could generate up to 5,000 new jobs, complementing the 12,000 already employed in Tamil Nadu’s auto sector. This move aligns with India's push to become a global EV manufacturing hub and attract foreign investment.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAlthough Ford has not provided a definitive timeline or details on specific EV models, its reconsideration of the Indian market reflects the country’s growing prominence in the global EV landscape. Whether Ford takes the plunge or steps away once again remains to be seen—perhaps not until late summer.</div></div>",
            "pub_date": "2025-02-05 14:45:27",
            "link": "https://www.business-standard.com/industry/auto/ford-india-reentry-decision-delayed-till-late-summer-125020500545_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500545"
        },
        {
            "title": "Trump to sign executive order, ban trans female athletes from competing",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tPresident Donald Trump will sign an executive order on Wednesday designed to prevent people who were biologically assigned male at birth from participating in women's or girls' sporting events.</p>\n<p>\r\n\tThe order, which Trump is expected to sign at an afternoon ceremony, marks another aggressive shift by the president's second administration in the way the federal government deals with transgender people and their rights.</p>\n<p>\r\n\tThe president put out a sweeping order on his first day in office last month that called for the federal government to define sex as only male or female and for that to be reflected on official documents such as passports and in policies such as federal prison assignments.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tTrump found during the campaign that his pledge to keep men out of women's sports resonated beyond the usual party lines. More than half the voters surveyed by AP VoteCast said support for transgender rights in government and society has gone too far.</p>\n<p>\r\n\tHe leaned into the rhetoric before the election, pledging to get rid of the transgender insanity, though his campaign offered little in the way of details.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tWednesday's order which coincides with National Girls and Women in Sports Day will involve how his administration will interpret Title IX, the law best known for its role in pursuing gender equity in athletics and preventing sexual harassment on campuses.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThis executive order restores fairness, upholds Title IX's original intent, and defends the rights of female athletes who have worked their whole lives to compete at the highest levels, said US Rep. Nancy Mace, a Republican from South Carolina.</p>\n<p>\r\n\tEvery administration has the authority to issue its own interpretations of the landmark legislation. The last two presidential administrations including Trump's first offer a glimpse at the push-pull involved.</p>\n<p>\r\n\tBetsy DeVos, the education secretary during Trump's first term, issued a Title IX policy in 2020 that narrowed the definition of sexual harassment and required colleges to investigate claims only if they're reported to certain officials.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe Biden administration rolled back that policy last April with one of its own that stipulated the rights of LGBTQ+ students would be protected by federal law and provided new safeguards for victims of campus sexual assault. The policy stopped short of explicitly addressing transgender athletes. Still, more than a half-dozen Republican-led states immediately challenged the new rule in court.</p>\n<p>\r\n\tAll Trump has to say is, We are going to read the regulation traditionally,' said Doriane Lambelet Coleman, a professor at Duke Law School.</p>\n<p>\r\n\tHow this order could affect the transgender athlete population a number that is incredibly difficult to pin down is uncertain.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe Associated Press reported in 2021 that in many cases, the states introducing a ban on transgender athletes could not cite instances where their participation was an issue. When Utah state legislators overrode a veto by Gov. Spencer Cox in 2022, the state had only one transgender girl playing in K-12 sports who would be affected by the ban. It did not regulate participation for transgender boys.</p>\n<p>\r\n\tThis is a solution looking for a problem, Cheryl Cooky, a professor at Purdue University who studies the intersection of gender, sports, media and culture, told the AP after Trump was elected.</p>\n<p>\r\n\tYet the actual number of transgender athletes seems to be almost immaterial. Any case of a transgender female athlete competing or even believed to be competing draws outsized attention, from Lia Thomas swimming for the University of Pennsylvania to the recently completed season of the San Jose State volleyball team.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 14:45:27",
            "link": "https://www.business-standard.com/world-news/trump-to-sign-executive-order-ban-trans-female-athletes-from-competing-125020500343_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500343"
        },
        {
            "title": "Nissan-Honda merger on the brink as growing disagreements threaten deal",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tNissan is considering ending its <a href=\"https://www.business-standard.com/topic/mergers-and-acquisitions\" target=\"_blank\">merger discussions</a> with Honda, news agency Reuters reported. The company's board members are expected to meet soon to deliberate on the next steps regarding the potential partnership.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIf called off, the decision would cast doubt on a deal that could have formed the world's third-largest automaker by sales. It also raises concerns about Nissan’s ability to navigate its ongoing financial and operational challenges without external support.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNews of the possible breakdown in talks had a positive impact on both companies' stock prices. On Wednesday, Honda’s shares rose over 2 per cent, while Nissan’s gained 1.6  per cent , contrasting with a slight dip in the broader Nikkei 225 index.  </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<h3>\r\n\tMerger talks faced growing differences  </h3>\n<div>\r\n\tHonda and Nissan, Japan's second- and third-largest automakers, respectively, announced last year that they were exploring a merger amid intensifying competition from China's BYD and emerging electric vehicle manufacturers. However, discussions have reportedly been strained by increasing disagreements, the news report said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNissan’s board is now set to review the situation following Honda’s suggestion that Nissan operate as its subsidiary — a move that deviates from the initial terms of their discussions, one source revealed.  </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h3>\r\n\tHonda’s concerns over Nissan’s turnaround  </h3>\n<div>\r\n\tWith a market value nearly five times greater than Nissan’s, Honda has expressed concerns about its smaller rival’s progress in executing its turnaround strategy, a source noted.  </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEarlier, Japan's Asahi Shimbun reported that the merger was at risk of falling apart.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNissan has faced significant challenges in adapting to the shift toward electric vehicles, struggling to recover from years of turmoil following the arrest of former Chairman Carlos Ghosn in 2018.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCompounding these difficulties, the company also faces potential trade disruptions, particularly from proposed US tariffs under former President Donald Trump. Analysts believe such tariffs could impact Nissan more severely than Honda or Toyota, given its reliance on production in Mexico.  </div>\n<h3>\r\n\tRenault's stance on the merger  </h3>\n<div>\r\n\tRenault, Nissan’s long-time alliance partner, had previously indicated openness to a potential deal with Honda. The French automaker holds a 36 per cent stake in Nissan, including 18.7 per cent through a French trust.  </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 14:40:28",
            "link": "https://www.business-standard.com/companies/news/nissan-honda-merger-talks-end-disagreements-125020500491_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500491"
        },
        {
            "title": "Is Ford reconsidering its India re-entry? Decision delayed till late summer",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFord’s much-anticipated return to the Indian market has hit a roadblock, with the US auto giant reportedly delaying its final decision until late summer. The company was initially expected to unveil its detailed India strategy by January, but is now taking a step back to reassess its plans.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to a report in the Times of India, sources familiar with the matter said that Ford’s board discussed the issue last month and opted against making any immediate announcements. \"The company is using this time to rethink its India strategy,\" a source revealed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA Ford spokesperson reiterated the company’s commitment to utilising its Chennai manufacturing plant for global markets. “(We are) committed to utilising the manufacturing capabilities in Chennai to serve global markets and are thankful to the govt of Tamil Nadu for its continued support as we advance our plans. Further details regarding the type of manufacturing, timelines and other specifics will be shared in due course and we have nothing additional to share at this time.\"</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhy is Ford rethinking its India re-entry?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSeveral factors are behind Ford’s hesitation. The current political climate in the US prioritises domestic manufacturing, potentially making foreign investments less attractive. Additionally, Ford would need to invest significantly to refurbish its Maraimalainagar facility, which has been idle since the company's exit from India in 2021.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndustry experts estimate that converting the Chennai plant for electric vehicle (EV) production could cost anywhere between $100 million to $300 million, as major structural changes, including new welding and assembly lines, would be required.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhy Ford exited India in 2021?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFord’s retreat from India in 2021 marked the end of a decades-long struggle. Despite launching popular models like the EcoSport, Figo, and Endeavour, the automaker failed to compete with market leaders such as Maruti Suzuki, Hyundai, Tata Motors, and Kia, which dominated with their budget-friendly, fuel-efficient models.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith $2 billion in accumulated losses and a market share of less than 2 per cent, Ford found it increasingly difficult to sustain operations. The collapse of its joint venture with Mahindra &amp; Mahindra in 2020 further complicated its position, leaving the company without a local partner to help navigate the price-sensitive Indian market.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile Ford ceased domestic production, it continued to support existing customers through spare parts and service networks, and it still exports vehicles from India.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tFord’s EV bet: A new opportunity?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFord's potential return could be centered around electric vehicles. The company has been in talks with the Tamil Nadu government about repurposing its Chennai facility for EV production aimed at global exports. If the plan materialises, Ford could position India as a key player in its global EV strategy.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tReports suggest the initiative could generate up to 5,000 new jobs, complementing the 12,000 already employed in Tamil Nadu’s auto sector. This move aligns with India's push to become a global EV manufacturing hub and attract foreign investment.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAlthough Ford has not provided a definitive timeline or details on specific EV models, its reconsideration of the Indian market reflects the country’s growing prominence in the global EV landscape. Whether Ford takes the plunge or steps away once again remains to be seen—perhaps not until late summer.</div></div>",
            "pub_date": "2025-02-05 14:40:27",
            "link": "https://www.business-standard.com/industry/auto/ford-india-reentry-decision-delayed-till-late-summer-125020500545_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500545"
        }
    ]
}