{
    "data": [
        {
            "title": "PM Narendra Modi may push for global guidelines on AI at Paris Summit",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tPrime Minister Narendra Modi may call upon nations to frame global guidelines for artificial intelligence (AI), in line with his pitch for an international framework for digital technologies, officials said. Modi and other global leaders will discuss the growing challenges and opportunities for AI in governance at the Action Summit to be held in Paris on February 10–11.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA push by India to adopt standards for AI in telecommunications led to the International Telecommunication Union adopting a resolution supporting the same last year. The fast pace of AI technology may necessitate the same for other sectors, officials said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCo-chairing the event with India, the French government aims to use the event as a platform for collectively establishing scientific foundations, solutions, and standards for more sustainable AI, working for collective progress and in the public interest. It builds on the advances made at the Bletchley Park Summit in November 2023 and the Seoul Summit in May 2024 and will draw on the expertise of a steering committee bringing together some 30 countries and international institutions to ensure inclusive and diverse contributions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe participants will seek to achieve three major objectives: providing access to independent, safe, and reliable AI to a wide range of users; developing AI that is more environmentally friendly; and ensuring global governance of artificial intelligence that is both effective and inclusive.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe government wants the AI Summit to also give it an early start in becoming part of any global body setting policies for the emerging technology, an official said.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"AI is a domain that is fast expanding, while its use cases are evolving. At a time when many nations are trying to enter the AI race, India cannot afford to be left out of global policymaking on AI,\" a Telecom Ministry official said.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Onwards to Washington DC</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tModi will be flying to Washington DC to hold talks with US President Donald Trump straight after his engagements in Paris, US news agencies reported late on Monday, citing White House sources. The Ministry of External Affairs is yet to officially confirm the same.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe first in-person meeting between the leaders during Trump's second stint as president is set to focus heavily on trade and tariffs. New Delhi is in a wait-and-watch mode as US President Donald Trump has imposed a 25 per cent tariff on imports from Canada and Mexico and a 10 per cent levy on Chinese imports. Set to take effect from Tuesday, the tariffs on America's neighbours have been postponed by a month, while clarity is awaited on China.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEven though Trump has repeatedly labelled India a high-tariff nation, he has yet to take action against New Delhi.</div></div>",
            "pub_date": "2025-02-04 22:00:34",
            "link": "https://www.business-standard.com/india-news/pm-narendra-modi-may-push-for-global-guidelines-on-ai-at-paris-summit-125020401523_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401523"
        },
        {
            "title": "Sebi tightens algo trading rules to plug gaps, boost investor protection",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Securities and Exchange Board of India (Sebi) has mandated the empanelment of algorithmic (algo) trading providers with stock exchanges and defined rules for using application programming interfaces (APIs). These new regulations aim to address regulatory gaps and enhance investor protection.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAlgo trading is already prevalent in the Indian market among both institutional and retail investors. However, the existing regulations had several loopholes, posing risks to investors.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Brokers’ Industry Standards Forum will formulate implementation standards before April 1, 2025, with the new norms becoming effective from August 1. Industry players said the new framework will make algos more accessible to a broader section of investors in a more transparent manner.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile algo providers will not be directly regulated by Sebi, the new guardrails will be implemented through exchanges, which will supervise algo trading and specify the criteria for empanelment.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBrokers will only be able to onboard algo trading providers that are empanelled with the exchanges. They will also need to obtain exchange approval and address grievances and monitor prohibited activities.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUnder the new norms, open APIs will not be permitted. Access will be granted only through a unique vendor client to ensure identification and traceability.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInvestors who develop their own algos will need to register with the exchange through their broker if they exceed the specified order-per-second threshold. These investors will be allowed to permit usage of their algos by immediate family members.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAdditionally, “blackbox algos” — those that do not disclose their underlying logic — will need to register as Research Analysts with the market regulator. Any changes to the logic will require re-registration and maintenance of a detailed research report.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Algo orders shall be tagged with a unique identifier provided by the exchange to establish an audit trail. Brokers must seek exchange approval for any modifications to approved algos,” noted Sebi.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAlgo trading involves executing trades based on pre-programmed instructions linked to variables such as price movement and volumes. These tools use logic to automatically buy or sell securities based on their programming.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe exchanges will issue standard operating procedures (SOPs) for testing algos and will monitor the behaviour of all algo orders. Brokers have been directed to conduct due diligence before onboarding algo providers.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Algo providers and brokers may share subscription charges and brokerage collected from clients. However, they must make complete and prominent disclosures of all charges to clients and ensure no conflict of interest arises,” said Sebi.</div></div>",
            "pub_date": "2025-02-04 22:00:33",
            "link": "https://www.business-standard.com/markets/news/sebi-tightens-algo-trading-rules-to-plug-gaps-boost-investor-protection-125020401407_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401407"
        },
        {
            "title": "Budget 2025 tax cuts to boost demand and consumption: Rating agencies",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Union Budget 2026 will boost growth over the next few years by increasing domestic demand through tax cuts for households, S&amp;P Global ratings said on Tuesday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P expects India will hit its deficit targets despite revenue loss from lifting the threshold for minimum taxable income and slower economic growth.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn its report on the Budget, Moody’s Ratings said the foregone revenue due to tax cuts would slow the pace of the country’s fiscal consolidation, even as total spending declines as a share of gross domestic product (GDP). It noted that tax measures will bolster middle-class spending power and consumption.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFitch Ratings said the Budget would be broadly neutral for growth and continued to project real GDP expansion of 6.4 per cent in FY25 and 6.5 per cent in FY26. Tax cuts, Fitch Ratings said, may provide a modest consumption boost.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P said the slower growth in capital investments for FY26 does not suggest a deterioration in the quality of government spending. “India’s Union Budget remains in line with our expectation of gradual fiscal consolidation… We believe bottlenecks in executing infrastructure projects will ease as supply chain pressures lessen and general elections are over,” S&amp;P Global Ratings said in a press statement.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P said the Budget allocation for capital expenditure is 3.1 per cent of GDP, unchanged from last financial year and is an increase of 10 per cent year-on-year in absolute terms.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe central government has lowered its fiscal deficit estimate for FY25 to 4.8 per cent of GDP from 4.9 per cent while budgeting a fiscal deficit of 4.4 per cent of GDP for FY26.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P has projected that, combined with central government deficits that may trend down to 4.2 per cent of GDP by FY28, the general government fiscal deficit could gradually decrease to 6.8 per cent of GDP from 7.8 per cent in FY25.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P also said the upgrade trigger for its sovereign ratings rests on a meaningful narrowing of India’s fiscal deficits, such that the net change in its general government debt falls below 7 per cent of GDP on a structural basis. “But a lower debt-to-GDP ratio for India would not necessarily lead to an improved debt burden score. This is due to the country’s very high ratio of government interest servicing to revenue,” S&amp;P said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNoting that fiscal deficit projections seemed realistic, Fitch Ratings said there was a risk of modest slippage in revenue collection targets amid a recent moderation in economic growth. “We expect government capex to remain relatively high, but overall, the fiscal deficit reduction is likely to be slightly contractionary,” Fitch Ratings said.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHighlighting that the Budget promotes private and state investments in infrastructure and energy transition, Moody's Ratings said the boost to spending due to rising disposable income would benefit makers of two-wheelers, passenger vehicles and white goods, and ride-hailing service providers.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The latest budget signals a slowing pace of fiscal consolidation, as the government seeks to provide firmer support for economic growth amid a dampened macroeconomic backdrop compared to recent years. Still, we expect the government is within reach of its near-term deficit target of 4.5 per cent by FY26,” Moody’s Ratings said.</div></div>",
            "pub_date": "2025-02-04 21:55:29",
            "link": "https://www.business-standard.com/budget/news/budget-2025-tax-cuts-to-boost-demand-and-consumption-rating-agencies-125020401353_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401353"
        },
        {
            "title": "AI will completely transform offline universities, says Sanjeev Sanyal",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tSanjeev Sanyal, a member of the Economic Advisory Council to the Prime Minister (EAC-PM), on Tuesday said artificial intelligence (AI) will completely transform how offline universities operate.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSpeaking on the theme \"The Potential and Peril of AI in Education\" at the ASU+GSV &amp; Emeritus Summit here, Sanyal said the current higher education system is outdated and that expensive college education may become obsolete, as the same lecture can be taught anywhere at no incremental cost. He added that university education, in its current form, is a 20th-century creation.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The way we give out education in the lecture format, which is still the dominant format of education, especially for the higher end of high school and certainly for most universities, is outdated. I personally cannot see how we do not have to completely restructure this,\" he said.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSanyal stated that universities need to focus on creating new knowledge through research and development (R&amp;D). \"Universities will increasingly focus on finding new frontiers of knowledge. Interestingly, their competitors will not be other universities but private or government R&amp;D labs and other spheres that enable new knowledge creation,\" he said. He also suggested that universities could evolve into innovation or startup hubs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAcknowledging that some disciplines may be exceptions, he said, \"We cannot teach surgery in this particular (AI) format, and there must be other subjects as well. But for a very large part of the education system, you can now essentially automate.\" He elaborated that AI can facilitate personalised learning based on an individual's level of understanding and pace.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDiscussing the perils of AI, he cautioned that in subjects like humanities, there is potential for monoculture, leading to the perpetuation of ideological or preconceived notions.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHe also emphasised that AI technology may struggle to create new areas of knowledge that require non-standardised ways of thinking. \"The way AI exists today, it is essentially mining information in various ways. So, if I came up with a completely radical new way of thinking about something, AI would definitely mark me down,\" he explained.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 21:55:29",
            "link": "https://www.business-standard.com/education/news/ai-will-completely-transform-offline-universities-says-sanjeev-sanyal-125020401505_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401505"
        },
        {
            "title": "Domestic demand to boost growth post income tax cuts in Budget 2025: S&P",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tS&amp;P Global Ratings on Tuesday said the Budget for 2025-26 will boost India's growth over the next few years via domestic demand through income tax cuts and the country will achieve the targeted 4.4 per cent fiscal deficit despite hiking I-T rebate.</p>\n<p>\r\n\tS&amp;P said India's union Budget is in line with its expectation of gradual fiscal consolidation and that undergirds the positive outlook on India's sovereign ratings BBB-'. The deficit targets are also consistent with S&amp;P's projections.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/no-immediate-upgrade-of-india-s-sovereign-rating-moody-s-after-budget-2025-125020101228_1.html\" target=\"_blank\">No immediate upgrade of India's sovereign rating: Moody's after Budget 2025</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\t\"We believe India will hit its deficit targets despite revenue loss from lifting the threshold for minimum taxable income and slower economic growth. Support will stem from continued large dividends from the central bank and potential capital underspending,\" S&amp;P said in a statement.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe fiscal 2026 budget will boost growth over the next few years via domestic demand through tax cuts for households, it added.</p>\n<p>\r\n\t\"We anticipate consumer spending and public investments will maintain real GDP growth at 6.7 per cent in fiscal 2025 and 6.8 per cent in fiscal 2026. These growth rates continue to place India above sovereign peers at similar income levels and should continue to support fiscal revenue increase despite the income tax cuts,\" S&amp;P said.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tIn its post-budget comments, Fitch Ratings said the government's clarification of medium-term debt reduction targets, if adhered to, could improve India's credit profile over time.<small class=\"brtag\"> </small></p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/economy/news/india-s-pace-of-debt-reduction-remains-gradual-says-fitch-ratings-125020301095_1.html\" target=\"_blank\">India's pace of debt reduction remains gradual, says Fitch Ratings</a></strong></div>\n<p>\r\n\tFitch rates India at THE lowest investment grade BBB-' with a stable outlook.</p>\n<p>\r\n\tThe government aims to maintain central government debt on a gradual downward trend, reaching close to 50 per cent of GDP by FY'31, roughly 7 percentage points lower than in FY'25.</p>\n<p>\r\n\tThe focus on a medium-term debt target should give greater flexibility to manage fiscal deficits, depending on economic conditions, Fitch said, adding the FY'26 Budget outlines credible path for medium-term debt reduction.</p>\n<p>\r\n\t\"We view the government's clarification of medium-term debt reduction targets as a positive development that, if adhered to, could improve the credit profile over time,\" Fitch Ratings said in a statement.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tFitch estimates real GDP to grow 6.4 per cent in current fiscal and 6.5 per cent in the next.</p>\n<p>\r\n\t\"Tax cuts may provide a modest consumption boost, and we expect government capex to remain relatively high, but overall, the fiscal deficit reduction is likely to be slightly contractionary,\" Fitch said.</p>\n<p>\r\n\tThe budget's income tax cuts will make it harder to raise the revenue/GDP ratio, which is also low, and it is unclear how sustainable the revenue support from central bank dividends will be.</p>\n<p>\r\n\tThe tax cuts could lift companies' growth expectations and investment intentions if these succeed in accelerating consumption.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"The policy approach of boosting investment through deregulation, as signalled in the budget, is also likely to be positive for the investment outlook, which is an important factor for India's medium-term growth potential. However, the scale of these effects remains unclear and will depend partly on the government's implementation of relevant policies,\" Fitch said.</p><p></p></div>",
            "pub_date": "2025-02-04 21:50:29",
            "link": "https://www.business-standard.com/budget/news/domestic-demand-to-boost-growth-post-income-tax-cuts-in-budget-2025-s-p-125020401391_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401391"
        },
        {
            "title": "Budget 2025 tax cuts to boost demand and consumption: Rating agencies",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Union Budget 2026 will boost growth over the next few years by increasing domestic demand through tax cuts for households, S&amp;P Global ratings said on Tuesday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P expects India will hit its deficit targets despite revenue loss from lifting the threshold for minimum taxable income and slower economic growth.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn its report on the Budget, Moody’s Ratings said the foregone revenue due to tax cuts would slow the pace of the country’s fiscal consolidation, even as total spending declines as a share of gross domestic product (GDP). It noted that tax measures will bolster middle-class spending power and consumption.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFitch Ratings said the Budget would be broadly neutral for growth and continued to project real GDP expansion of 6.4 per cent in FY25 and 6.5 per cent in FY26. Tax cuts, Fitch Ratings said, may provide a modest consumption boost.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P said the slower growth in capital investments for FY26 does not suggest a deterioration in the quality of government spending. “India’s Union Budget remains in line with our expectation of gradual fiscal consolidation… We believe bottlenecks in executing infrastructure projects will ease as supply chain pressures lessen and general elections are over,” S&amp;P Global Ratings said in a press statement.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P said the Budget allocation for capital expenditure is 3.1 per cent of GDP, unchanged from last financial year and is an increase of 10 per cent year-on-year in absolute terms.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe central government has lowered its fiscal deficit estimate for FY25 to 4.8 per cent of GDP from 4.9 per cent while budgeting a fiscal deficit of 4.4 per cent of GDP for FY26.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P has projected that, combined with central government deficits that may trend down to 4.2 per cent of GDP by FY28, the general government fiscal deficit could gradually decrease to 6.8 per cent of GDP from 7.8 per cent in FY25.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P also said the upgrade trigger for its sovereign ratings rests on a meaningful narrowing of India’s fiscal deficits, such that the net change in its general government debt falls below 7 per cent of GDP on a structural basis. “But a lower debt-to-GDP ratio for India would not necessarily lead to an improved debt burden score. This is due to the country’s very high ratio of government interest servicing to revenue,” S&amp;P said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNoting that fiscal deficit projections seemed realistic, Fitch Ratings said there was a risk of modest slippage in revenue collection targets amid a recent moderation in economic growth. “We expect government capex to remain relatively high, but overall, the fiscal deficit reduction is likely to be slightly contractionary,” Fitch Ratings said.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHighlighting that the Budget promotes private and state investments in infrastructure and energy transition, Moody's Ratings said the boost to spending due to rising disposable income would benefit makers of two-wheelers, passenger vehicles and white goods, and ride-hailing service providers.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The latest budget signals a slowing pace of fiscal consolidation, as the government seeks to provide firmer support for economic growth amid a dampened macroeconomic backdrop compared to recent years. Still, we expect the government is within reach of its near-term deficit target of 4.5 per cent by FY26,” Moody’s Ratings said.</div></div>",
            "pub_date": "2025-02-04 21:50:28",
            "link": "https://www.business-standard.com/budget/news/budget-2025-tax-cuts-to-boost-demand-and-consumption-rating-agencies-125020401353_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401353"
        },
        {
            "title": "Ujjivan SFB applies for a universal banking licence to expand offerings",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tUjjivan Small Finance Bank (SFB) on Tuesday said it has submitted an application to the Reserve Bank of India (RBI) seeking a universal banking licence to strengthen its offerings and its position in the sector.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Bengaluru-based lender is the second SFB after AU SFB to apply for a universal banking licence under the voluntary transition route.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The Bank has consistently demonstrated strong financial performance and a commitment to financial inclusion, serving a diverse customer base across the country. Securing the universal banking licence, if approved, will strengthen Ujjivan’s efforts to provide holistic financial services to its customers and empower all aspiring Indians with a wider range of banking solutions,” said Sanjeev Nautiyal, MD &amp; CEO, Ujjivan SFB.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUjjivan SFB, which started operations in February 2017, has about 9.3 million customers through its 753 branches spread across 26 states and union territories in the country. As of December 31, 2024, its gross loan book stands at Rs 30,466 crore, and its deposits stand at Rs 34,494 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The diversification of the loan book has seen accelerated results, with the secured segment contributing 39 per cent to the overall loan book,” the bank said in a statement.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to RBI norms, to be eligible for conversion into a universal bank, these banks must have a minimum net worth of Rs 1,000 crore, hold scheduled status, and have a satisfactory track record of at least five years. Additionally, they must maintain a gross non-performing asset (NPA) ratio of 3 per cent or less and a net NPA ratio of 1 per cent or less over the past two financial years. Additionally, the norms say only listed small finance banks will qualify.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, these must also have reported a net profit in the past two financial years and meet the prescribed capital adequacy norms. The RBI also requires these SFBs to provide a detailed rationale for their conversion into a universal bank, with preference given to those with a diversified loan portfolio.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, Bengaluru-based Jana Small Finance Bank is also harboring ambitions of transitioning into a universal bank. The bank has made additional or accelerated provisions to keep its gross and net non-performing assets (NPA) within the regulatory requirement of 3 per cent and 1 per cent respectively.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 21:45:31",
            "link": "https://www.business-standard.com/industry/banking/ujjivan-sfb-applies-for-a-universal-banking-licence-to-expand-offerings-125020401318_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401318"
        },
        {
            "title": "Gold loan portfolio of banks jumps 71.3% to Rs 1.72 trillion till Dec 2024",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe gold loan portfolio of banks rose by 71.3 per cent year-on-year (Y-o-Y) till December 2024 to Rs 1.72 trillion, compared to 17 per cent growth a year ago, on the back of rising gold prices and a slowdown in unsecured loans following an increase in risk weights last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Over the last year, gold loan growth has sharply increased, with a 68 per cent rise from March 2024 to December 2024 (9M FY25), while gold prices increased by around 21 per cent during this time,” said Ajit Velonie, senior director, Crisil Ratings.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“There has also been a partial slowdown in unsecured loan growth due to stricter regulations. The growth in gold loans has coincided with this period. Personal loans grew by only 5–6 per cent, compared to 16.5 per cent the previous year. The slower growth in unsecured loans has likely led borrowers to turn to gold loans as an alternative, though the impact is smaller compared to the overall slower growth in personal loans,” Velonie added.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn November 2023, the Reserve Bank of India (RBI) increased risk weights for unsecured loans by 24 percentage points to 125 per cent. There has been a significant slowdown in the unsecured loan segment due to the tightening of norms.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe other personal loans segment, comprising unsecured credit, showed 9.7 per cent Y-o-Y growth in December 2024, compared to 20.8 per cent in December 2023. Credit card loans also saw a moderation in growth, at 15.6 per cent in December 2024, down from 32.6 per cent a year ago.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBank credit growth in the retail loan segment, including housing, vehicle, credit card, and personal loans, dropped to 14.9 per cent Y-o-Y in December 2024, down from 17.6 per cent in December 2023.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGold loan prices increased by 20.4 per cent to Rs 75,857 per 10 grams in December 2024, from Rs 62,993 per 10 grams in the year-ago period.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Factors contributing to the rise in gold loans include rising gold prices, as the value of loans taken against jewellery also increases amid the rise in gold prices. People with gold jewellery are also borrowing more, refinancing their loans as the value of gold increases,” said Kirti Timmanagoudar, head of strategy and co-lending, IIFL Finance.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The crackdown on unsecured lending and stress in the microfinance institution (MFI) space might also be contributing factors. It is likely a cumulative effect of these elements rather than one factor being responsible,” Timmanagoudar added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to RBI data, since May 2024, one bank has changed the classification of a category of agricultural loans into \"Loans against gold jewellery\" under the retail segment. The lender has stopped extending loans against gold in metropolitan branches for agricultural purposes and has placed them under retail loans.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Loans previously classified as agricultural are now being treated as gold loans. This reclassification might explain the slower growth in agricultural loans, which have only grown by 8 per cent compared to previous years,” Timmanagoudar said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGold loan financiers said gold loans have emerged as a preferred option for customers' short-term requirements.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The slowdown in the supply of unsecured lending might give an impetus, but gold loans have been witnessing an upward trajectory due to their own features. Today, they are widely accepted and a popular choice among customers, especially for short-term requirements, acting as a vital financial inclusion tool,” said Shaji Varghese, chief executive officer, Muthoot FinCorp.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe December edition of the financial stability report (FSR) of the RBI observed a rapid increase in gold loan disbursals during the period ending September 2024 compared to the same period last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTo address the non-adherence to prudential guidelines by supervised entities (SEs) in granting loans against the pledge of gold ornaments and jewellery, the RBI has advised SEs to comprehensively review their policies, identify gaps, and implement corrective measures within a specified timeframe.</div></div>",
            "pub_date": "2025-02-04 21:45:30",
            "link": "https://www.business-standard.com/industry/banking/gold-loan-portfolio-of-banks-jumps-71-3-to-rs-1-72-trillion-till-dec-2024-125020401498_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401498"
        },
        {
            "title": "Updated I-T return: Ensure accuracy as revisions are not permitted",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFinance Minister Nirmala Sitharaman has proposed extending the deadline for filing updated income tax returns (ITRs) from two to four years.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“In the financial year 2024–25, a person can file an updated return for assessment years 2022–23 and 2023–24. The Finance Bill 2025 proposes to extend this deadline to 48 months from the end of the relevant financial year,” says Naveen Wadhwa, deputy general manager, Taxmann.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What is an updated return?</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tAn updated return, filed under Section 139(8A), allows taxpayers to amend missed or incorrect income declarations. It can be filed if they failed to file a return despite exceeding the threshold, omitted income, or overstated losses or refunds.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“A taxpayer liable to pay higher taxes for earlier assessment years can rectify the situation by filing an updated return and paying the additional tax,” says Vivek Jalan, partner, Tax Connect Advisory Services LLP.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIf you wrongly declared long-term capital gains at 12.5 per cent instead of applying the slab rate or carried forward excess losses, an updated return can be used to correct these mistakes.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWadhwa informs that an updated return gives taxpayers more time by allowing them to file a return after deadlines for belated and revised returns have passed.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Conditions attached</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tOnly those with additional tax to pay can file an updated return.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The updated return should effectively increase the tax flow to the government,” says Anshul Khemuka, partner, Khaitan &amp; Co.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn updated return cannot be filed in certain circumstances.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“It cannot be filed if it is a return of loss, if the total tax liability gets reduced, or if the refund increases due to the filing of the updated return. Adjustment of additional losses against income is also not allowed,” says Akhil Chandna, partner, global people solutions leader, Grant Thornton Bharat.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis avenue also closes once a special audit or assessment has begun.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“If a search or survey proceeding has been initiated, or a reassessment proceeding is pending, or there is a proceeding under the Black Money Act, the Prevention of Money Laundering Act, or the Benami Act,” says Khemuka.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe option is also unavailable if the assessing officer has relevant information under the Double Taxation Avoidance Agreement (DTAA) or the Tax Information Exchange Agreement (TIEA).</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Compliance benefit</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tFiling an updated return allows taxpayers to rectify errors voluntarily and comply with tax laws.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“If the tax office discovers a gap in compliance, they could initiate audit proceedings, which could lead to penalties,” says Khemuka.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFiling an updated return also mitigates the risk of an additional tax burden.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“If you file an updated return in the second year, you would pay 50 per cent more on additional tax and interest. But if the department detects undisclosed income, you could end up paying a penalty as high as 200 per cent,” says Jalan.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn updated return also helps avoid prosecution under Section 276CC, according to Wadhwa.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tITRs have become essential for obtaining government contracts and visas.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Someone who has not filed a return but needs one can file an updated return,” says Jalan.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Costs involved</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tTaxpayers filing updated returns must pay an additional tax liability of between 25 and 70 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This additional tax liability would have been avoided if the taxpayer had filed their ITR correctly and within the specified timeline. Adjusting for losses or increasing the loss claim is also not possible through an updated return. A higher tax refund cannot be obtained through this route,” says Chandna.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFiling an updated return may draw scrutiny.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“There is a chance of your tax return being picked up for assessment, just to see if the positions adopted in the revised return have any bearing on past tax positions,” says Khemuka.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Precautions to exercise</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tBefore filing an updated return, make sure you are eligible to file one. Also, confirm that deadlines for belated or revised returns have expired. Use this option solely to correct issues you are permitted to.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe updated return must accurately reflect changes to income and deductions.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Once filed, it cannot be revised or rectified,” says Jalan.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWadhwa warns that significant changes could attract queries. He advises retaining supporting documents, such as bank statements and investment proofs, to deal with scrutiny. Khemuka advises against frequent use of this option.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFinally, Chandna urges taxpayers to file by December rather than waiting until the last moment.</div></div>",
            "pub_date": "2025-02-04 21:40:27",
            "link": "https://www.business-standard.com/finance/personal-finance/updated-i-t-return-ensure-accuracy-as-revisions-are-not-permitted-125020401466_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401466"
        },
        {
            "title": "VC investors take leading role in guiding startups through AI disruption",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAs artificial intelligence (AI) becomes a central driver of innovation, venture capital (VC) investors are stepping up to help portfolio companies navigate the complexities of AI adoption. From advising on strategic integrations to connecting with top-tier AI talent, VCs are offering more than just capital; they are providing the guidance and resources needed to harness AI’s full potential.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tExperts said the rapid rise of AI tools like ChatGPT, DeepSeek, and Qwen 2.5 has left many startups scrambling to keep up as the pace of disruption accelerates.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“AI is evolving at such an unprecedented pace—what was relevant yesterday may be outdated tomorrow. Given this rapid evolution, the best strategy is to focus on what will remain constant: the need for adaptability,” said Preeti Sampat, partner, Eximius Ventures, a leading VC firm that backs companies across fintech, software-as-a-service (SaaS), frontier tech, and consumer tech.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSampat said most Indian software companies operate in the application layer rather than the infrastructure layer, unlike China, which has made significant strides in foundational AI models like DeepSeek and Qwen. To stay ahead, she said Indian companies must design flexible architectures that can seamlessly integrate multiple AI models as technology advances.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This is particularly critical now, as the cost of AI is decreasing, making intelligent software development more accessible,” said Sampat. “By maintaining adaptability and focusing on customer needs, application-layer companies can capitalise on these advancements.”</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhen asked how Eximius is supporting its portfolio companies in adopting an AI strategy, Sampat pointed out that it is about enhancing existing software solutions by layering AI capabilities on top to improve functionality. The other aspect is developing AI-native modules, which can be built in a modular fashion. These modules can vary in automation levels, ranging from fully automated to human-in-the-loop systems.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The key is to identify where AI can provide the most value and implement it strategically, ensuring that it enhances efficiency, automation, and user experience in a meaningful way,” said Sampat.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFor instance, one of Eximius’ portfolio companies, DecoverAI, is transforming the legal tech space by automating legal service providers (LSPs) in the litigation sector, a trillion-dollar market. DecoverAI focuses on litigation support, making legal workflows more efficient through AI-driven copilots and autonomous agents. Initially, they built copilots to assist lawyers in case preparation and real-time courtroom support. However, with the rise of AI agents, they are now incorporating autonomous workflows that can handle certain tasks independently.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This balance between AI-assisted and AI-driven automation not only enhances efficiency but also reduces costs, making DecoverAI a standout player in legal AI,” said Sampat.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAI adoption must be strategic</div>\n<div>\r\n\tAnil Joshi, managing partner at Unicorn India Ventures, believes AI may not be applicable as it is to all businesses. However, he said Unicorn India actively evaluates the potential impact of AI on respective businesses and accordingly advises companies on their AI goals.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis includes firms using AI for internal operations to gain an edge over competitors. The other goal is making product offerings AI-compatible so that customers can benefit from cutting-edge solutions.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOne of Unicorn India’s portfolio firms, Genrobotic, recently worked on a robo-arm leveraging AI. It is helping eliminate risks to humans in difficult tasks while improving productivity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJoshi said having an AI strategy is crucial, as it involves engaging quality resources for building AI solutions, which is expensive. He also stressed the importance of continuously monitoring and evaluating AI’s impact. Otherwise, companies may end up spending excessive man-hours and resources on solutions that lack practical use cases.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Timely intervention will certainly help companies build the right solutions needed by customers,” said Joshi. “We strongly encourage companies to build in-house AI capabilities or intellectual property. It will certainly help in keeping pace with changes in the tech space.”</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAI specialists: A necessity or an option?</div>\n<div>\r\n\tSonal Saldanha, vice president for investments at 3one4, said his firm insists that companies experiment with and embrace new AI tools with urgency—not just for marketing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Because we’re seeing so many real-world examples of impact,” said Saldanha.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t3one4 counts fresh meat and seafood delivery startup Licious, shared electric vehicle mobility company Yulu, and Ayurvedic consumer products firm Kapiva among its portfolio companies.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs far as building AI-enabled products is concerned, Saldanha said teams at various companies already have too much on their plates. Using closed-source foundational model APIs (application programming interfaces) is often the easiest way to get started. Moving to self-hosting open-source models, which provide more flexibility but require greater technical expertise, can be adopted later in the product’s life cycle.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“When it comes to consuming AI products internally, again, the best product wins. Building and maintaining a home-grown implementation of something is often not worth the effort at startups, where focus is especially important,” said Saldanha.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, Saldanha does not buy into the notion that companies need ‘AI specialists’ to succeed. He believes it is as simple as hiring smart engineers who are willing to tinker and learn practical tooling, at least in the beginning. Later, more specialists can be recruited to solve specific growth-related problems.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHelping startups integrate AI</div>\n<div>\r\n\tGowri Shankar Nagarajan, associate partner at Antler India, said his firm provides advisory support to enable portfolio companies to adopt AI.</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We have a bunch of AI practitioners who are available to any founder to brainstorm how they should think about using AI and the right tech stack for AI,” said Shankar.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAntler is also actively working with major tech companies to give startups access to AI tools to experiment before setting up a full-fledged product roadmap.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGenerative AI (GenAI) has the potential to add a cumulative $1.2–1.5 trillion to India’s gross domestic product (GDP) over the next seven years, according to a report by EY. The report, titled AIdea of India: Generative AI’s Potential to Accelerate India’s Digital Transformation, states that in 2029-30 alone, GenAI could contribute an additional $359–438 billion to India’s GDP.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 21:40:26",
            "link": "https://www.business-standard.com/companies/start-ups/vc-investors-take-leading-role-in-guiding-startups-through-ai-disruption-125020401454_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401454"
        }
    ]
}