{
    "data": [
        {
            "title": "Tata Communications, CoRover.ai partner for sovereign AI solutions in India",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tTata Communications has tied up with CoRover.ai to provide sovereign artificial intelligence (AI) solutions to Indian enterprises and government bodies, the two companies said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBoth companies will work on citizen-centric applications, digital public infrastructure, and scalable e-governance solutions for both public and private enterprises.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"As India pursues its Digital India vision, Tata Communications’ expertise in sovereign cloud infrastructure and platform, along with CoRover.ai’s industry-first conversational AI capabilities, will be a major stride in building a robust AI ecosystem that’s tailored not only to meet current demands but also to anticipate future needs,\" said Neelakantan Venkataraman, vice president and global head of cloud and edge business at Tata Communications.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe joint venture will focus on generative AI solutions in text, voice, and video. All data, the companies said, will be stored in India and processed by locally trained models.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Our collaboration with Tata Communications will redefine how Indian enterprises and government institutions harness AI’s potential while retaining control over data and operations within the country,\" said Ankush Sabharwal, founder and chief executive officer of CoRover.ai.</div></div>",
            "pub_date": "2025-02-04 22:35:26",
            "link": "https://www.business-standard.com/companies/news/tata-communications-corover-ai-partner-for-sovereign-ai-solutions-in-india-125020401568_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401568"
        },
        {
            "title": "PM Narendra Modi may push for global guidelines on AI at Paris Summit",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tPrime Minister (PM) Narendra Modi is likely to call upon nations to frame global guidelines for Artificial Intelligence (AI), in line with his pitch for an international framework for digital technologies, officials said on Tuesday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tModi and other global leaders will discuss the growing challenges and opportunities for AI in governance at the Action Summit to be held in Paris on February 10–11.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA push by India to adopt standards for AI in telecommunications led to the International Telecommunication Union adopting a resolution supporting the same last year. The rapid pace of AI technology may necessitate the same for other sectors, officials said.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCo-chairing the event with India, the French government aims to use the event as a platform for collectively establishing scientific foundations, solutions, and standards for more sustainable AI, working for collective progress and in the public interest.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt builds on the advances made at the Bletchley Park Summit in November 2023 and the Seoul Summit in May 2024 and will draw on the expertise of a steering committee bringing together some 30 countries and international institutions to ensure inclusive and diverse contributions.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe participants will seek to achieve three major objectives: providing access to independent, safe, and reliable AI to a wide range of users; developing AI that is more environmentally friendly; and ensuring global governance of Artificial Intelligence that is effective and inclusive.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe government wants the AI Summit to also give it an early start in becoming part of any global body setting policies for the emerging technology, an official said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"AI is a domain that is fast expanding, while its use cases are evolving. At a time when many nations are trying to enter the AI race, India cannot afford to be left out of global policymaking on AI,\" a telecom ministry official said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tModi will be flying to Washington DC to hold talks with US President Donald Trump after his engagements in Paris, US news agencies reported on Monday, citing White House sources. The Ministry of External Affairs is yet to officially confirm Modi’s itinerary.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe first in-person meeting between the leaders during Trump's second stint as President is set to focus on trade and tariffs.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 22:35:26",
            "link": "https://www.business-standard.com/india-news/pm-narendra-modi-may-push-for-global-guidelines-on-ai-at-paris-summit-125020401523_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401523"
        },
        {
            "title": "Sam Altman's Asia trip looks like a dash to garner support for Stargate",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tOpenAI’s chief executive officer Sam Altman is scheduled to meet Indian Prime Minister Narendra Modi, Union electronics and information technology minister Ashwini Vaishnaw, and other high-ranking officials on his second visit to India.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe OpenAI founder is also scheduled to address the developer ecosystem and venture capitalists during his short stay in the country, a person aware of the development said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPeak XV managing director Rajan Anandan, along with executives from venture capital firms, will also be meeting Altman, sources told <em>Business Standard.</em></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAltman, who is on a whirlwind tour of several countries, including Germany, Japan, South Korea, and the United Arab Emirates, is likely to land in India late on Tuesday night.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWednesday, February 5, will mark Altman’s second visit to India in two years. He was previously in India in June 2023. The current visit is seen by many as a rush to counter the impact of DeepSeek's achievement. The Chinese firm has demonstrated that foundational models can be built at a fraction of the cost of what OpenAI has managed.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn January 4, OpenAI announced that it would develop AI products for South Korea with chat app operator Kakao. This will be its second major alliance with an Asian player. Earlier this year, OpenAI, along with SoftBank, announced the Stargate programme.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Stargate programme was announced by US President Donald Trump. This programme plans to invest $500 billion to build AI infrastructure in the US. OpenAI, SoftBank, Oracle, and MGX are the initial investors, with $100 billion already committed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring his earlier visit to India in June 2023, Altman courted controversy when he said that companies across the world, including in India, could try to build a product like ChatGPT or a company like OpenAI but would fail.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"It's totally impossible to rival us in training these core models, and we'll advise you not to even attempt it. But it's your responsibility to try anyway. I genuinely believe in both those aspects. I reckon it's quite a futile pursuit,\" Altman had said at an event.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing backlash over his comments, Altman later clarified that his remarks had been taken out of context.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"This is really taken out of context! The question was about competing with us with $10 million, which I really do think is not going to work. But I still said try! However, I think it’s the wrong question,\" Altman said in a tweet.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a second tweet, he also stated that he had \"no doubt\" that Indian startups could achieve what had never been done before and contribute something new to the world.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 22:30:34",
            "link": "https://www.business-standard.com/technology/tech-news/sam-altman-s-asia-trip-looks-like-a-dash-to-garner-support-for-stargate-125020401547_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401547"
        },
        {
            "title": "On poll eve, Kejriwal meets EC, alleges voter intimidation by Delhi Police",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tAAP national convenor Arvind Kejriwal, along with Delhi Chief Minister Atishi, met the Election Commission (EC) on Tuesday and raised concerns over alleged intimidation tactics being used in the national capital ahead of the assembly polls.</p>\n<p>\r\n\tTalking to the media after the meeting, Kejriwal, accompanied by party leader Raghav Chadha, accused the BJP and Delhi Police of engaging in hooliganism to create an atmosphere of fear among voters.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/elections/delhi-elections/delhi-polls-adr-flags-non-compliance-of-norms-by-candidates-parties-125020401168_1.html\" target=\"_blank\">Delhi polls: ADR flags non-compliance of norms by candidates, parties</a></strong></div>\n<p>\r\n\tWe told the EC how Delhi Police is being misused for violence and intimidation. Many people are scared, and it is possible that they may not come out to vote due to fear, he said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe former chief minister also alleged that attempts were being made to suppress voter turnout, particularly among slum dwellers.</p>\n<p>\r\n\tThere are reports that people's fingers are being marked with black ink in an attempt to disenfranchise them, and that money and threats are being used to influence voters. We raised these concerns with the EC, Kejriwal said.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tHe thanked the EC for granting them a meeting despite the silence period and said that officials have assured them of a free and fair election. The EC has assured us that they will take necessary steps to prevent any such wrongdoing.</p>\n<p>\r\n\tDelhi goes to polls on February 5 and the results will be declared on February 8.</p>\n<p>\r\n\tChief Minister Atishi accused the BJP of engaging in \"hooliganism\" and alleged that the EC and Delhi Police are shielding saffron party workers, while targeting AAP leaders and members.</p>\n<p>\r\n\tAtishi, who is contesting from the Kalkaji constituency, claimed at a press conference here that democracy in India was now in the hands of Chief Election Commissioner Rajiv Kumar and the country is watching \"if it survives in the national capital\".</p>\n<p>\r\n\t\"The BJP is openly engaging in hooliganism. But instead of taking action against them, Delhi Police is protecting them, while the Election Commission is filing cases against those who are raising complaints,\" she alleged.</p>\n<p>\r\n\tThe chief minister accused BJP candidate Ramesh Bidhuri, who is contesting the polls against Atishi, and his family members of engaging in \"hooliganism\" in Kalkaji, and alleged no action had been taken against them.</p>\n<p>\r\n\t\"The people of Delhi are watching everything. On one side, there is a party that wants to stop free welfare schemes and is engaging in violence. On the other, the AAP is working so that every household saves Rs 25,000 per month,\" she asserted.</p>\n<p>\r\n\tAtishi's remarks came hours after Delhi Police registered an FIR against her for allegedly violating the Model Code of Conduct (MCC) and obstructing a public servant from discharging his duty.</p>\n<p>\r\n\tPolice officials said she and a group of 50-70 supporters with 10 vehicles were found blocking Fateh Singh Marg, violating Model Code of Conduct. When instructed to vacate the area, she allegedly obstructed a police officer from carrying out his duty.</p>\n<p>\r\n\tA police official claimed an AAP worker slapped a head constable.</p>\n<p>\r\n\tIn response, Atishi took to X, accusing the EC of bias. \"BJP candidate Ramesh Bidhuri and his family members are openly engaging in hooliganism, yet no action is taken against them. Instead, a case has been filed against me,\" she wrote.</p>\n<p>\r\n\tEarlier, Kejriwal also posted on X in Hindi, stating that \"the Election Commission has filed a police case against the Delhi CM after she complained about open hooliganism.\"<small class=\"brtagPara\"> </small>\r\n\t\"So now, this is the official stand of the Delhi Police and the Election Commission-their job' is to indulge in hooliganism against the Aam Aadmi Party, protect the hooliganism of the BJP, and distribute liquor, money, and goods. If anyone tries to stop them from doing this work', a case will be filed against them for obstructing the work' of the police and the Election Commission, he said.</p><p></p></div>",
            "pub_date": "2025-02-04 22:30:34",
            "link": "https://www.business-standard.com/elections/delhi-elections/on-poll-eve-kejriwal-meets-ec-alleges-voter-intimidation-by-delhi-police-125020401531_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401531"
        },
        {
            "title": "Sam Altman's Asia trip looks like a dash to garner support for Stargate",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tOpenAI’s chief executive officer Sam Altman is scheduled to meet Indian Prime Minister Narendra Modi, Union electronics and information technology minister Ashwini Vaishnaw, and other high-ranking officials on his second visit to India.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe OpenAI founder is also scheduled to address the developer ecosystem and venture capitalists during his short stay in the country, a person aware of the development said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPeak XV managing director Rajan Anandan, along with executives from venture capital firms, will also be meeting Altman, sources told <em>Business Standard.</em></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAltman, who is on a whirlwind tour of several countries, including Germany, Japan, South Korea, and the United Arab Emirates, is likely to land in India late on Tuesday night.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWednesday, February 5, will mark Altman’s second visit to India in two years. He was previously in India in June 2023. The current visit is seen by many as a rush to counter the impact of DeepSeek's achievement. The Chinese firm has demonstrated that foundational models can be built at a fraction of the cost of what OpenAI has managed.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn January 4, OpenAI announced that it would develop AI products for South Korea with chat app operator Kakao. This will be its second major alliance with an Asian player. Earlier this year, OpenAI, along with SoftBank, announced the Stargate programme.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Stargate programme was announced by US President Donald Trump. This programme plans to invest $500 billion to build AI infrastructure in the US. OpenAI, SoftBank, Oracle, and MGX are the initial investors, with $100 billion already committed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring his earlier visit to India in June 2023, Altman courted controversy when he said that companies across the world, including in India, could try to build a product like ChatGPT or a company like OpenAI but would fail.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"It's totally impossible to rival us in training these core models, and we'll advise you not to even attempt it. But it's your responsibility to try anyway. I genuinely believe in both those aspects. I reckon it's quite a futile pursuit,\" Altman had said at an event.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing backlash over his comments, Altman later clarified that his remarks had been taken out of context.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"This is really taken out of context! The question was about competing with us with $10 million, which I really do think is not going to work. But I still said try! However, I think it’s the wrong question,\" Altman said in a tweet.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a second tweet, he also stated that he had \"no doubt\" that Indian startups could achieve what had never been done before and contribute something new to the world.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 22:25:28",
            "link": "https://www.business-standard.com/technology/tech-news/sam-altman-s-asia-trip-looks-like-a-dash-to-garner-support-for-stargate-125020401547_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401547"
        },
        {
            "title": "On poll eve, Kejriwal meets EC, alleges voter intimidation by Delhi Police",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tAAP national convenor Arvind Kejriwal, along with Delhi Chief Minister Atishi, met the Election Commission (EC) on Tuesday and raised concerns over alleged intimidation tactics being used in the national capital ahead of the assembly polls.</p>\n<p>\r\n\tTalking to the media after the meeting, Kejriwal, accompanied by party leader Raghav Chadha, accused the BJP and Delhi Police of engaging in hooliganism to create an atmosphere of fear among voters.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/elections/delhi-elections/delhi-polls-adr-flags-non-compliance-of-norms-by-candidates-parties-125020401168_1.html\" target=\"_blank\">Delhi polls: ADR flags non-compliance of norms by candidates, parties</a></strong></div>\n<p>\r\n\tWe told the EC how Delhi Police is being misused for violence and intimidation. Many people are scared, and it is possible that they may not come out to vote due to fear, he said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe former chief minister also alleged that attempts were being made to suppress voter turnout, particularly among slum dwellers.</p>\n<p>\r\n\tThere are reports that people's fingers are being marked with black ink in an attempt to disenfranchise them, and that money and threats are being used to influence voters. We raised these concerns with the EC, Kejriwal said.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tHe thanked the EC for granting them a meeting despite the silence period and said that officials have assured them of a free and fair election. The EC has assured us that they will take necessary steps to prevent any such wrongdoing.</p>\n<p>\r\n\tDelhi goes to polls on February 5 and the results will be declared on February 8.</p>\n<p>\r\n\tChief Minister Atishi accused the BJP of engaging in \"hooliganism\" and alleged that the EC and Delhi Police are shielding saffron party workers, while targeting AAP leaders and members.</p>\n<p>\r\n\tAtishi, who is contesting from the Kalkaji constituency, claimed at a press conference here that democracy in India was now in the hands of Chief Election Commissioner Rajiv Kumar and the country is watching \"if it survives in the national capital\".</p>\n<p>\r\n\t\"The BJP is openly engaging in hooliganism. But instead of taking action against them, Delhi Police is protecting them, while the Election Commission is filing cases against those who are raising complaints,\" she alleged.</p>\n<p>\r\n\tThe chief minister accused BJP candidate Ramesh Bidhuri, who is contesting the polls against Atishi, and his family members of engaging in \"hooliganism\" in Kalkaji, and alleged no action had been taken against them.</p>\n<p>\r\n\t\"The people of Delhi are watching everything. On one side, there is a party that wants to stop free welfare schemes and is engaging in violence. On the other, the AAP is working so that every household saves Rs 25,000 per month,\" she asserted.</p>\n<p>\r\n\tAtishi's remarks came hours after Delhi Police registered an FIR against her for allegedly violating the Model Code of Conduct (MCC) and obstructing a public servant from discharging his duty.</p>\n<p>\r\n\tPolice officials said she and a group of 50-70 supporters with 10 vehicles were found blocking Fateh Singh Marg, violating Model Code of Conduct. When instructed to vacate the area, she allegedly obstructed a police officer from carrying out his duty.</p>\n<p>\r\n\tA police official claimed an AAP worker slapped a head constable.</p>\n<p>\r\n\tIn response, Atishi took to X, accusing the EC of bias. \"BJP candidate Ramesh Bidhuri and his family members are openly engaging in hooliganism, yet no action is taken against them. Instead, a case has been filed against me,\" she wrote.</p>\n<p>\r\n\tEarlier, Kejriwal also posted on X in Hindi, stating that \"the Election Commission has filed a police case against the Delhi CM after she complained about open hooliganism.\"<small class=\"brtagPara\"> </small>\r\n\t\"So now, this is the official stand of the Delhi Police and the Election Commission-their job' is to indulge in hooliganism against the Aam Aadmi Party, protect the hooliganism of the BJP, and distribute liquor, money, and goods. If anyone tries to stop them from doing this work', a case will be filed against them for obstructing the work' of the police and the Election Commission, he said.</p><p></p></div>",
            "pub_date": "2025-02-04 22:25:27",
            "link": "https://www.business-standard.com/elections/delhi-elections/on-poll-eve-kejriwal-meets-ec-alleges-voter-intimidation-by-delhi-police-125020401531_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401531"
        },
        {
            "title": "ITC Hotels removed from Sensex; Dr Agarwal slips on stock market debut",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tITC Hotels was removed from the benchmark Sensex and other BSE indices on Tuesday. The company, which was spun off from ITC, was temporarily included in the Sensex and a few other indices to enable passive funds to rebalance their portfolios.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tITC Hotels began trading separately on January 29. “As ITC Hotels did not hit the lower circuit till the cut-off time, the company will be dropped from all the BSE indices effective prior to the open of trading on Wednesday,” BSE said in a notice.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tShares of the luxury hotel operator last closed at Rs 165, down 4.2 per cent, with over Rs 700 crore worth of shares changing hands. Index trackers had to sell shares worth over Rs 400 crore on account of the stock’s Sensex exclusion. Another Rs 700 crore worth of selling is anticipated when ITC Hotels is removed from NSE Nifty.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Dr Agarwal slips on debut</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDr Agarwal’s Health Care, an eye-care firm, had a lacklustre stock market debut, with its shares ending marginally below its initial public offering (IPO) price.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAfter hitting a high of Rs 413 and a low of Rs 370, the stock ended at Rs 401.6 compared to its issue price of Rs 402. The company’s Rs 3,027-crore IPO had managed to scrape through on the back of bids from institutional investors.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe high-net-worth individual (HNI) and retail quotas of the IPO remained unsubscribed at around 40 per cent each. Dr Agarwal’s Rs 3,027-crore IPO consisted of a Rs 300-crore fresh fundraise. At the last close, the company was valued at Rs 12,684 crore.<small class=\"brtagPara\"> </small>\n<div>\n<strong>NSE's Q3 topline dips 3.5% sequentially</strong></div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe National Stock Exchange (NSE) on Tuesday reported a 3.5 per cent sequential decline in consolidated revenues to Rs 4,349 crore for the quarter ended December 2024 as new restrictions on index derivatives impacted trading volumes.<small class=\"brtagPara\"> </small>\r\n\t\tConsequently, transaction charges also fell by 4 per cent sequentially. The bourse, however, reported a 94 per cent year-on-year (YoY) increase in consolidated net profit to Rs 3,834 crore.<small class=\"brtagPara\"> </small>\r\n\t\tThis significant jump was primarily due to a Rs 1,155-crore exceptional gain from the sale of its stake in Protean e-Gov Technologies. On a year-on-year (YoY) basis revenues were a 23 per cent. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 22:20:29",
            "link": "https://www.business-standard.com/markets/news/itc-hotels-removed-from-sensex-dr-agarwal-slips-on-stock-market-debut-125020401354_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401354"
        },
        {
            "title": "Sam Altman's Asia trip looks like a dash to garner support for Stargate",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tOpenAI’s chief executive officer Sam Altman is scheduled to meet Indian Prime Minister Narendra Modi, Union electronics and information technology minister Ashwini Vaishnaw, and other high-ranking officials on his second visit to India.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe OpenAI founder is also scheduled to address the developer ecosystem and venture capitalists during his short stay in the country, a person aware of the development said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPeak XV managing director Rajan Anandan, along with executives from venture capital firms, will also be meeting Altman, sources told <em>Business Standard.</em></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAltman, who is on a whirlwind tour of several countries, including Germany, Japan, South Korea, and the United Arab Emirates, is likely to land in India late on Tuesday night.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWednesday, February 5, will mark Altman’s second visit to India in two years. He was previously in India in June 2023. The current visit is seen by many as a rush to counter the impact of DeepSeek's achievement. The Chinese firm has demonstrated that foundational models can be built at a fraction of the cost of what OpenAI has managed.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn January 4, OpenAI announced that it would develop AI products for South Korea with chat app operator Kakao. This will be its second major alliance with an Asian player. Earlier this year, OpenAI, along with SoftBank, announced the Stargate programme.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Stargate programme was announced by US President Donald Trump. This programme plans to invest $500 billion to build AI infrastructure in the US. OpenAI, SoftBank, Oracle, and MGX are the initial investors, with $100 billion already committed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring his earlier visit to India in June 2023, Altman courted controversy when he said that companies across the world, including in India, could try to build a product like ChatGPT or a company like OpenAI but would fail.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"It's totally impossible to rival us in training these core models, and we'll advise you not to even attempt it. But it's your responsibility to try anyway. I genuinely believe in both those aspects. I reckon it's quite a futile pursuit,\" Altman had said at an event.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing backlash over his comments, Altman later clarified that his remarks had been taken out of context.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"This is really taken out of context! The question was about competing with us with $10 million, which I really do think is not going to work. But I still said try! However, I think it’s the wrong question,\" Altman said in a tweet.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a second tweet, he also stated that he had \"no doubt\" that Indian startups could achieve what had never been done before and contribute something new to the world.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 22:20:29",
            "link": "https://www.business-standard.com/technology/tech-news/sam-altman-s-asia-trip-looks-like-a-dash-to-garner-support-for-stargate-125020401547_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401547"
        },
        {
            "title": "Sebi penalises DB Realty, 7 others for misrepresenting financial statements",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tCapital markets regulator Sebi on Tuesday slapped fines totalling Rs 25 lakh on eight entities, including DB Realty, its promoters and other officials, for violations related to financial misstatements and non-disclosures.</p>\n<p>\r\n\tThe regulator imposed a fine of Rs 5 lakh each on DB Realty Ltd (now known as Valor Estate), Vinod Kumar Goenka (Promoter and Chairperson-MD of DB Realty), and Shahid Balwa Usman (promoter and MD), according to a Sebi order.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/markets/news/sebi-tightens-algo-trading-rules-to-plug-gaps-boost-investor-protection-125020401407_1.html\" target=\"_blank\">Sebi tightens algo trading rules to plug gaps, boost investor protection</a></strong></div>\n<p>\r\n\tSebi also levied a penalty of Rs 2 lakh each on Asif Yusuf Balwa, Jayvardhan Vinod Goenka, Salim Balwa Usman, Sunita Goenka and Nabil Yusuf Patel.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIn the final order, Sebi stated that DB Realty failed to comply with accounting standards in preparation and presentation of the financial statements in respect of guarantee given to Bank of India (BOI) on behalf of loan availed by PBPL which has resulted in the violation of the listing agreement/disclosure rules.</p>\n<p>\r\n\t\"I find that event-based disclosures in respect of classification as NPA, invocation of guarantee, symbolic possession of properties, issuance of recall notices etc, are all material information which should have been appropriately disclosed,\" Sebi's Chief General Manager G Ramar said in the final order.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tSebi noted that Vinod Goenka and Shahid Balwa Usman were signatories to financial statements as well as signed the CEO/CFO Certification as required under the norms (for FYs 2013-14 and 2014-15) and disclosure rules (for FY 2016-17 to FY 2020-21).</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tBoth of them failed to include the material information in the postal ballot notice in respect of the guarantee and security provided for the loan and misrepresented in the postal ballot notice that the borrower company was fulfilling its obligations of repayment of the loan, Sebi said.</p>\n<p>\r\n\tFurther, Vinod and Shahid failed to disclose material events/information to stock exchanges viz., receipt of notice under section 13(2) of SARFAESI Act 2002, invoking guarantee, symbolic possession of company's properties by Bank of India and receipt of recall notice from the bank, it added.</p>\n<p>\r\n\tSebi also observed that Asif Balwa was also a part of promoter group and was one of the personal guarantor to the loan taken by PBPL.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tFurther, he (Asif Yusuf Balwa) was a signatory to financial statements as well as signed the CEO/CFO Certification as required under the rules for FY 2017-18 to FY 2020-21.</p>\n<p>\r\n\tIn view of the non-compliances with Indian Accounting Standards (Ind AS 109) in preparation and presentation of the financial statements, the certification was false and misleading, thereby flouting rules, the order said.</p>\n<p>\r\n\tJayvardhan Vinod Goenka, Salim Balwa Usman, Sunita Goenka and Nabil Yusuf Patel being the non-executive and non-independent directors for FY 2013-14 and 2014-15 also violated the rules.</p>\n<p>\r\n\tThe order came after the Sebi received complaints in December 2020 alleging that Pune Buildtech Pvt Ltd (PBPL) took a Rs 225 crore loan from Bank of India in 2013 with a corporate guarantee from DB Realty Ltd (DBRL) and personal guarantees from Vinod Kumar Goenka, Shahid Balwa, and Asif Yusuf Balwa.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe complainant had also claimed the loan was misused to clear dues of other group firms instead of its intended purpose and by June 2020, the outstanding amount, including interest, had risen to around Rs 516 crore.</p>\n<p>\r\n\tPBPL is a wholly-owned subsidiary of Marine Drive Hospitality &amp; Realty Pvt Ltd (formerly known as DB Hospitality).</p>\n<p>\r\n\tThereafter, the regulator commenced an investigation into the matter for the period between April 2013 to March 2021 to ascertain the possible contravention of regulatory rules.</p><p></p></div>",
            "pub_date": "2025-02-04 22:15:28",
            "link": "https://www.business-standard.com/companies/news/sebi-penalises-db-realty-7-others-for-misrepresenting-financial-statements-125020401482_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401482"
        },
        {
            "title": "ITC Hotels removed from Sensex; Dr Agarwal slips on stock market debut",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tITC Hotels was removed from the benchmark Sensex and other BSE indices on Tuesday. The company, which was spun off from ITC, was temporarily included in the Sensex and a few other indices to enable passive funds to rebalance their portfolios.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tITC Hotels began trading separately on January 29. “As ITC Hotels did not hit the lower circuit till the cut-off time, the company will be dropped from all the BSE indices effective prior to the open of trading on Wednesday,” BSE said in a notice.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tShares of the luxury hotel operator last closed at Rs 165, down 4.2 per cent, with over Rs 700 crore worth of shares changing hands. Index trackers had to sell shares worth over Rs 400 crore on account of the stock’s Sensex exclusion. Another Rs 700 crore worth of selling is anticipated when ITC Hotels is removed from NSE Nifty.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Dr Agarwal slips on debut</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDr Agarwal’s Health Care, an eye-care firm, had a lacklustre stock market debut, with its shares ending marginally below its initial public offering (IPO) price.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAfter hitting a high of Rs 413 and a low of Rs 370, the stock ended at Rs 401.6 compared to its issue price of Rs 402. The company’s Rs 3,027-crore IPO had managed to scrape through on the back of bids from institutional investors.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe high-net-worth individual (HNI) and retail quotas of the IPO remained unsubscribed at around 40 per cent each. Dr Agarwal’s Rs 3,027-crore IPO consisted of a Rs 300-crore fresh fundraise. At the last close, the company was valued at Rs 12,684 crore.<small class=\"brtagPara\"> </small>\n<div>\n<strong>NSE's Q3 topline dips 3.5% sequentially</strong></div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe National Stock Exchange (NSE) on Tuesday reported a 3.5 per cent sequential decline in consolidated revenues to Rs 4,349 crore for the quarter ended December 2024 as new restrictions on index derivatives impacted trading volumes.<small class=\"brtagPara\"> </small>\r\n\t\tConsequently, transaction charges also fell by 4 per cent sequentially. The bourse, however, reported a 94 per cent year-on-year (YoY) increase in consolidated net profit to Rs 3,834 crore.<small class=\"brtagPara\"> </small>\r\n\t\tThis significant jump was primarily due to a Rs 1,155-crore exceptional gain from the sale of its stake in Protean e-Gov Technologies. On a year-on-year (YoY) basis revenues were a 23 per cent. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 22:15:27",
            "link": "https://www.business-standard.com/markets/news/itc-hotels-removed-from-sensex-dr-agarwal-slips-on-stock-market-debut-125020401354_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401354"
        }
    ]
}