{
    "data": [
        {
            "title": "President Trump's tariff plan risks upending trade, stoking food inflation",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Ilena Peng, Kim Chipman and Michael Hirtzer</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tPresident Donald Trump’s plans to impose tariffs on some of the US’s largest agricultural trade partners next month threaten to upend markets and unleash food-price inflation.<small class=\"brtag\"> </small></div>\n<div>\r\n\tMexico, Canada and China account for about half of all American agriculture exports, and the US has become increasingly reliant on its two neighbours for fruit and vegetables. Tariffs along with any retaliatory measures will curb overseas sales and increase energy and fertiliser costs for farmers. All of that will likely mean higher prices for consumers at grocery stores. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump has set general levies of 25 per cent on Canada and Mexico, though agreements were reached on Monday to delay those by a month, while a tariff of 10 per cent is set for Chinese goods. Whether or not the tariffs end up being implemented, and exactly how the other countries might retaliate, will be key to what happens to commodity prices.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“These tariffs will only make it harder for American families to put food on the table and for American farmers and ranchers to sell their products,” said Minnesota Senator Amy Klobuchar, a Democrat and member of the Senate Agriculture Committee. “Farmers and ranchers want an even playing field, not handouts necessitated by another Trump trade war.”<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/world-news/donald-trump-s-tariff-reversal-feeds-reputation-as-paper-tiger-on-trade-125020400119_1.html\" target=\"_blank\">Donald Trump's tariff reversal feeds reputation as paper tiger on trade</a></strong></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWe break down the markets that are vulnerable to disruption. </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Fruit and vegetables</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tMexico and Canada accounted for nearly 90 per cent of US fresh vegetable imports by value in 2023, and more than half of fresh fruit shipments, according to the US Department of Agriculture.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMexico is now the biggest source of US farm imports, shipping tomatoes, fresh berries and other vegetables. The country is a particularly big source of avocados, supplying more than 90 per cent of what Americans eat. Canada, meanwhile, ships apples, mushrooms and potatoes.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Corn and pork</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tMexico ranks as the biggest buyer of US corn and pork and any counter measures could hurt America’s biggest crop as well as meat companies such as Tyson Foods Inc. and Smithfield Foods Inc.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We’ve been preparing for this,” Tyson’s Chief Executive Officer Donnie King said during a conference call on Monday. “We’ll leverage our global expertise to identify the best markets for our products.”</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tStill, Mexico may find it hard to replace American corn. The Latin American nation imported almost 19 million metric tonnes last year. Both Mexico and Canada are also key importers of US dairy products.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Soybeans and Canola oil</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tSoybeans were the poster child for the last trade war with China, with the world’s biggest buyer shrinking US purchases by 79 per cent in the first two years of the first Trump administration. A repeat of those actions could hurt farmers.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTariffs also mean American biofuels, food and consumer-product makers may need to pay more for oilseed crop products used in everything from shampoo and salad dressing to renewable diesel and sustainable aviation fuel. The US accounted for more than 90 per cent of Canada’s canola oil exports in 2023, according to the USDA.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Fertilisers</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tThe US is highly dependent on potash from Canada, importing roughly 85 per cent of what it needs. The Fertilizer Institute and US Senator Chuck Grassley, an Iowa Republican, have already urged Trump to exempt Canadian product from tariffs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn exemption is especially important ahead of spring planting of grains that are relied on for global food supply chains, Fertilizer Institute Chief Executive Officer Corey Rosenbusch said in a statement.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Tariff costs are passed on to the end-user,” said Alexis Maxwell, a Bloomberg Intelligence analyst. US farmers will likely pay $60 to $80 more per short ton for potash and ammonia fertilizers this year, she added.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Lumber</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMore than 70 per cent of US imports of softwood lumber and gypsum, used in drywall, come from Canada and Mexico respectively, and “consumers end up paying for the tariffs in the form of higher home prices,” Carl Harris, chairman of the Washington-based National Association of Homebuilders, said in a statement.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCanada is the biggest foreign supplier of lumber to its southern neighbor, accounting for as much as 30 per cent of supplies. The new US tariffs will likely be in addition to existing duties, which were hiked to 14.5 per cent last summer, according to Dustin Jalbert, senior economist at commodity pricing agency Fastmarkets.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 11:40:28",
            "link": "https://www.business-standard.com/world-news/president-trump-s-tariff-plan-risks-upending-trade-stoking-food-inflation-125020400127_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400127"
        },
        {
            "title": "Salaried individuals earning between Rs 12-24 lakh will pay 25-31% less tax",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFinance Minister Nirmala Sitharaman has proposed a revised new tax regime that aims to reduce the tax burden by 25 per cent to 100 per cent for incomes up to Rs 24 lakh.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Understanding the Revised Tax Slabs: Key Changes for the Financial Year 2025-26</strong></div>\n<div>\r\n\tIn the upcoming financial year, the government has introduced revised tax slabs, offering a more streamlined approach to individual taxation. Here's a breakdown of the key changes to the tax slabs:<small class=\"brtag\"> </small>\n<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"TAXCHANFWD\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"TAXCHANFWD\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/04/full/1738639316-7604.png\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Key Highlights:</strong></div>\n<ul>\n<li>\n<strong>Relief for the Middle-Class:</strong> The threshold for lower tax rates has been extended to Rs 4 lakh (up from Rs 3 lakh previously), allowing individuals with earnings between Rs 3-4 lakh to benefit from zero tax.</li>\n<li>\n<strong>Rate Reduction</strong>: Those in the Rs 20-24 lakh income bracket will now pay a reduced tax rate of 25%, compared to the earlier 30% rate.</li>\n<li>\n<strong>Unchanged High-Income Slabs:</strong> The tax rates for higher income earners above Rs 24 lakh remain unchanged at 30%.</li>\n<li>\r\n\t\tThe revised tax slabs provide relief for middle-income taxpayers, especially those earning in the Rs 4-24 lakh range, while maintaining the existing structure for those with very high income. </li>\n</ul>\n<div>\n<strong>Who benefits the most? </strong></div>\n<div>\r\n\tAccording to an analysis by Value Research, the following are the key beneficiaries:</div>\n<ul>\n<li>\r\n\t\tTaxpayers earning below Rs 12 lakh (or Rs 12.75 lakh for salaried individuals) will now pay zero tax due to the revised tax structure and standard deductions.</li>\n<li>\r\n\t\tThose earning between Rs 12 lakh and Rs 24 lakh (or Rs 24.75 lakh for salaried individuals) will pay 25-31 per cent less tax .</li>\n<li>\r\n\t\tIndividuals with an annual income of above Rs 24 lakh will save Rs 1.1 lakh in taxes under the proposed regime.</li>\n<li class=\"brtag\">\n<p>\r\n\t\t\t </p></li></ul><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<strong>Value Research has estimated tax saving across different income levels:</strong><small class=\"brtag\"> </small>\n<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"relitaxcslf\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"relitaxcslf\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/04/full/1738639540-9931.png?im=Resize=(640,480)\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span></div>\n<small class=\"brtagPara\"> </small>\n<div>\n<strong>Biggest takeaway?</strong></div>\n<div>\r\n\t\t\"The revised new tax regime presents a significant tax relief for a large segment of taxpayers. With zero tax liability for those earning below Rs 12 lakh and substantial tax savings of up to Rs 1.1 lakh for high earners, the proposed changes encourage individuals to opt for the simplified structure. If you fall within the affected income range, consider assessing your tax planning strategy to maximise savings under the new structure,\" said Value Research in a note.<small class=\"brtagPara\"> </small>\n<div>\n<strong>Other key changes:</strong></div>\n<div>\r\n\t\t\tLimit of Total Income for Rebate u/s 87A has been increased from Rs. 7,00,000/- to Rs. 12,00,000/- under new regime and in consequently the Limit of Rebate enhanced from Rs. 25,000/- to Rs.60,000/- (except for income taxed at special rates).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\tUnder the new tax regime, Section 87A tax rebate will not available on any special rate income (such as S. 111A, 112 etc). Whereas, for the old tax regime, Section 87A tax rebate is still available on special rate income like STCG covered in Section 111A,LTCG covered in Section 112. Section 87A Rebate was never available on long term capital gain on equity (covered in Section 112A) under both regimes and no changes are made in the budget for the same.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\tLimit of TDS on interest for senior citizens increased from Rs. 50,000/- to Rs. 1,00,000/- which will provide greater financial relief to retirees. Further, Limit on Rent enhanced from Rs. 2,40,000/- to Rs.6,00,000/- benefitting small tax payers earning rental income.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\tTime limit to file updated return increased from 2 to 4 Years which will allow taxpayers correcting errors or omissions or allows to file ITR if they have not filed ITR.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\tPeriod of Registration of smaller trusts has been increased from 5 to 10 Years on the condition that Total income without giving tax benefit does not exceed Rs. 5 Crore during preceding 2 years.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t As per NPS Vatsalaya scheme Started from 18th September 2024, parents/guardian can open account for minor child future benefit. It is now proposed to provide deduction u/s 80CCD(1B) of Rs.50,000 for contribution made to NPS Vatsalya Account which will be similar to deduction available as per current provisions for employer contribution to NPS available under new old regime.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\tProvision of higher TDS rate will be applicable only in case PAN is not available and accordingly, provision of higher TDS on payment to non-filers (of return of income)</div>\n<div>\r\n\t\t\tis removed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\tThe TCS threshold on remittances under the Liberalized Remittance Scheme (LRS) has been raised from Rs 7 lakh to Rs 10 lakh and no TCS will be applicable on goods but TDS on sale goods will continue to apply. TCS on education loans up to Rs 10 lakh (from specified financial institutions) will be removed.</div>\n</div>\n</div>\n<strong><small class=\"brtag\"> </small></strong><p></p></div>",
            "pub_date": "2025-02-04 11:40:28",
            "link": "https://www.business-standard.com/finance/personal-finance/salaried-individuals-earning-between-rs-12-24-lakh-will-pay-25-31-less-tax-125020400121_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400121"
        },
        {
            "title": "Salesforce to cut 1,000 roles while hiring salespeople for AI products",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Brody Ford</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tSalesforce Inc. is cutting jobs as its latest fiscal year gets underway, according to a person familiar with the matter, even as the company simultaneously hires workers to sell new artificial intelligence products.<small class=\"brtag\"> </small></div>\n<div>\r\n\tMore than 1,000 roles will be affected, according to the person, who asked not to be identified because the information is private. Displaced workers will be able to apply for other jobs internally, the person added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA representative of San Francisco-based Salesforce declined to comment. It couldn’t be determined which divisions the reductions were focused in. Salesforce had nearly 73,000 workers as of January 2024, when that fiscal year ended.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTechnology companies have grown more accustomed to regular job reductions after a massive wave of layoffs at the start of 2023. So far this year, Amazon.com Inc., Microsoft Corp. and Meta Platforms Inc. have all moved to trim their corporate workforces.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSalesforce, the leading maker of customer management software, has embarked on a hiring spree for salespeople focused on the company’s new AI agent products. But it’s also been keeping a closer eye on maintaining profit margins after pressure from activist investors in 2023. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Just because we have a hit new product doesn’t mean that we ignore the commitments we’ve made internally and externally as we think about scaling this business,” Chief Operating Officer Brian Millham said when asked about the company’s profit-focus during an event hosted by Barclays Plc in December. “We’re looking across the entire company to say, ‘Where can we get more efficiencies? How can we continue to get fuel for the work that we’re doing to go invest in scale going forward?”</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSalesforce is expected to report fourth-quarter earnings around the end of February.</div></div>",
            "pub_date": "2025-02-04 11:35:26",
            "link": "https://www.business-standard.com/world-news/salesforce-to-cut-1-000-roles-while-hiring-salespeople-for-ai-products-125020400123_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400123"
        },
        {
            "title": "President Trump's tariff plan risks upending trade, stoking food inflation",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Ilena Peng, Kim Chipman and Michael Hirtzer</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tPresident Donald Trump’s plans to impose tariffs on some of the US’s largest agricultural trade partners next month threaten to upend markets and unleash food-price inflation.<small class=\"brtag\"> </small></div>\n<div>\r\n\tMexico, Canada and China account for about half of all American agriculture exports, and the US has become increasingly reliant on its two neighbours for fruit and vegetables. Tariffs along with any retaliatory measures will curb overseas sales and increase energy and fertiliser costs for farmers. All of that will likely mean higher prices for consumers at grocery stores. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump has set general levies of 25 per cent on Canada and Mexico, though agreements were reached on Monday to delay those by a month, while a tariff of 10 per cent is set for Chinese goods. Whether or not the tariffs end up being implemented, and exactly how the other countries might retaliate, will be key to what happens to commodity prices.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“These tariffs will only make it harder for American families to put food on the table and for American farmers and ranchers to sell their products,” said Minnesota Senator Amy Klobuchar, a Democrat and member of the Senate Agriculture Committee. “Farmers and ranchers want an even playing field, not handouts necessitated by another Trump trade war.”<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/world-news/donald-trump-s-tariff-reversal-feeds-reputation-as-paper-tiger-on-trade-125020400119_1.html\" target=\"_blank\">Donald Trump's tariff reversal feeds reputation as paper tiger on trade</a></strong></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWe break down the markets that are vulnerable to disruption. </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Fruit and vegetables</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tMexico and Canada accounted for nearly 90 per cent of US fresh vegetable imports by value in 2023, and more than half of fresh fruit shipments, according to the US Department of Agriculture.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMexico is now the biggest source of US farm imports, shipping tomatoes, fresh berries and other vegetables. The country is a particularly big source of avocados, supplying more than 90 per cent of what Americans eat. Canada, meanwhile, ships apples, mushrooms and potatoes.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Corn and pork</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tMexico ranks as the biggest buyer of US corn and pork and any counter measures could hurt America’s biggest crop as well as meat companies such as Tyson Foods Inc. and Smithfield Foods Inc.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We’ve been preparing for this,” Tyson’s Chief Executive Officer Donnie King said during a conference call on Monday. “We’ll leverage our global expertise to identify the best markets for our products.”</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tStill, Mexico may find it hard to replace American corn. The Latin American nation imported almost 19 million metric tonnes last year. Both Mexico and Canada are also key importers of US dairy products.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Soybeans and Canola oil</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tSoybeans were the poster child for the last trade war with China, with the world’s biggest buyer shrinking US purchases by 79 per cent in the first two years of the first Trump administration. A repeat of those actions could hurt farmers.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTariffs also mean American biofuels, food and consumer-product makers may need to pay more for oilseed crop products used in everything from shampoo and salad dressing to renewable diesel and sustainable aviation fuel. The US accounted for more than 90 per cent of Canada’s canola oil exports in 2023, according to the USDA.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Fertilisers</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tThe US is highly dependent on potash from Canada, importing roughly 85 per cent of what it needs. The Fertilizer Institute and US Senator Chuck Grassley, an Iowa Republican, have already urged Trump to exempt Canadian product from tariffs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn exemption is especially important ahead of spring planting of grains that are relied on for global food supply chains, Fertilizer Institute Chief Executive Officer Corey Rosenbusch said in a statement.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Tariff costs are passed on to the end-user,” said Alexis Maxwell, a Bloomberg Intelligence analyst. US farmers will likely pay $60 to $80 more per short ton for potash and ammonia fertilizers this year, she added.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Lumber</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMore than 70 per cent of US imports of softwood lumber and gypsum, used in drywall, come from Canada and Mexico respectively, and “consumers end up paying for the tariffs in the form of higher home prices,” Carl Harris, chairman of the Washington-based National Association of Homebuilders, said in a statement.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCanada is the biggest foreign supplier of lumber to its southern neighbor, accounting for as much as 30 per cent of supplies. The new US tariffs will likely be in addition to existing duties, which were hiked to 14.5 per cent last summer, according to Dustin Jalbert, senior economist at commodity pricing agency Fastmarkets.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 11:35:25",
            "link": "https://www.business-standard.com/world-news/president-trump-s-tariff-plan-risks-upending-trade-stoking-food-inflation-125020400127_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400127"
        },
        {
            "title": "Dividend stocks: Shree Cement, Coromandel, 7 others to remain in focus",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Dividend stocks:</strong> Shares of Coromandel International, GTV Engineering, Indian Metals &amp; Ferro Alloys, Dr Lal PathLabs, Manba Finance, MAS Financial Services, Shree Cement, SMC Global Securities, and Sona BLW Precision Forgings are set to remain in focus during today's trading session on account of their <a href=\"https://www.business-standard.com/topic/interim-dividend\" target=\"_blank\">interim dividend</a> announcements. Notably, shares of all these companies are slated to turn ex-dividend tomorrow, February 5, 2025, according to BSE data.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmong them, <a href=\"https://www.business-standard.com/markets/shree-cement-ltd-share-price-508.html\" target=\"_blank\">Shree Cement</a> has announced the highest dividend of Rs 50 per share for its shareholders. The company has set the record date as January 5, 2025, to ascertain shareholder’s eligibility for this dividend.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, Coromandel International, Indian Metals &amp; Ferro Alloys, and GTV Engineering have announced interim dividends of Rs 6, Rs 5, and Rs 0.50 per share, respectively. All three companies have also set the record date as January 5, 2025, for the payout.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDr Lal PathLabs, Manba Finance, and MAS Financial Services have declared interim dividends of Rs 6, Rs 0.25, and Rs 1 per share, respectively. These companies have also set the record date as January 5, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, SMC Global Securities, and Sona BLW Precision Forgings have announced interim dividends of Rs 1.20 and Rs 1.60 per share, respectively, with their record date set for January 5, 2025.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBesides these, Aarti Drugs, Aurionpro Solutions, Emami, KPIT Technologies, LT Foods, Orient Electric, and SRF will remain in focus today as they turn ex-dividend. Meanwhile, Redtape is set to gain attention as it turns ex-bonus today.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNotably, the ex-date and record date are key markers for determining shareholder eligibility for dividend rewards. The ex-date marks the day a stock begins trading without dividend entitlement. To qualify for dividend benefits, investors must hold the stock before this date. The list of eligible shareholders is finalized based on records maintained at the close of the record date.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 11:30:31",
            "link": "https://www.business-standard.com/markets/news/dividend-stocks-shree-cement-coromandel-7-others-to-remain-in-focus-125020400117_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400117"
        },
        {
            "title": "Salesforce to cut 1,000 roles while hiring salespeople for AI products",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Brody Ford</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tSalesforce Inc. is cutting jobs as its latest fiscal year gets underway, according to a person familiar with the matter, even as the company simultaneously hires workers to sell new artificial intelligence products.<small class=\"brtag\"> </small></div>\n<div>\r\n\tMore than 1,000 roles will be affected, according to the person, who asked not to be identified because the information is private. Displaced workers will be able to apply for other jobs internally, the person added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA representative of San Francisco-based Salesforce declined to comment. It couldn’t be determined which divisions the reductions were focused in. Salesforce had nearly 73,000 workers as of January 2024, when that fiscal year ended.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTechnology companies have grown more accustomed to regular job reductions after a massive wave of layoffs at the start of 2023. So far this year, Amazon.com Inc., Microsoft Corp. and Meta Platforms Inc. have all moved to trim their corporate workforces.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSalesforce, the leading maker of customer management software, has embarked on a hiring spree for salespeople focused on the company’s new AI agent products. But it’s also been keeping a closer eye on maintaining profit margins after pressure from activist investors in 2023. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Just because we have a hit new product doesn’t mean that we ignore the commitments we’ve made internally and externally as we think about scaling this business,” Chief Operating Officer Brian Millham said when asked about the company’s profit-focus during an event hosted by Barclays Plc in December. “We’re looking across the entire company to say, ‘Where can we get more efficiencies? How can we continue to get fuel for the work that we’re doing to go invest in scale going forward?”</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSalesforce is expected to report fourth-quarter earnings around the end of February.</div></div>",
            "pub_date": "2025-02-04 11:30:30",
            "link": "https://www.business-standard.com/world-news/salesforce-to-cut-1-000-roles-while-hiring-salespeople-for-ai-products-125020400123_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400123"
        },
        {
            "title": "Dividend stocks: Shree Cement, Coromandel, 7 others to remain in focus",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Dividend stocks:</strong> Shares of Coromandel International, GTV Engineering, Indian Metals &amp; Ferro Alloys, Dr Lal PathLabs, Manba Finance, MAS Financial Services, Shree Cement, SMC Global Securities, and Sona BLW Precision Forgings are set to remain in focus during today's trading session on account of their <a href=\"https://www.business-standard.com/topic/interim-dividend\" target=\"_blank\">interim dividend</a> announcements. Notably, shares of all these companies are slated to turn ex-dividend tomorrow, February 5, 2025, according to BSE data.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmong them, <a href=\"https://www.business-standard.com/markets/shree-cement-ltd-share-price-508.html\" target=\"_blank\">Shree Cement</a> has announced the highest dividend of Rs 50 per share for its shareholders. The company has set the record date as January 5, 2025, to ascertain shareholder’s eligibility for this dividend.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, Coromandel International, Indian Metals &amp; Ferro Alloys, and GTV Engineering have announced interim dividends of Rs 6, Rs 5, and Rs 0.50 per share, respectively. All three companies have also set the record date as January 5, 2025, for the payout.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDr Lal PathLabs, Manba Finance, and MAS Financial Services have declared interim dividends of Rs 6, Rs 0.25, and Rs 1 per share, respectively. These companies have also set the record date as January 5, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, SMC Global Securities, and Sona BLW Precision Forgings have announced interim dividends of Rs 1.20 and Rs 1.60 per share, respectively, with their record date set for January 5, 2025.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBesides these, Aarti Drugs, Aurionpro Solutions, Emami, KPIT Technologies, LT Foods, Orient Electric, and SRF will remain in focus today as they turn ex-dividend. Meanwhile, Redtape is set to gain attention as it turns ex-bonus today.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNotably, the ex-date and record date are key markers for determining shareholder eligibility for dividend rewards. The ex-date marks the day a stock begins trading without dividend entitlement. To qualify for dividend benefits, investors must hold the stock before this date. The list of eligible shareholders is finalized based on records maintained at the close of the record date.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 11:25:27",
            "link": "https://www.business-standard.com/markets/news/dividend-stocks-shree-cement-coromandel-7-others-to-remain-in-focus-125020400117_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400117"
        },
        {
            "title": "Salesforce to cut 1,000 roles while hiring salespeople for AI products",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Brody Ford</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tSalesforce Inc. is cutting jobs as its latest fiscal year gets underway, according to a person familiar with the matter, even as the company simultaneously hires workers to sell new artificial intelligence products.<small class=\"brtag\"> </small></div>\n<div>\r\n\tMore than 1,000 roles will be affected, according to the person, who asked not to be identified because the information is private. Displaced workers will be able to apply for other jobs internally, the person added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA representative of San Francisco-based Salesforce declined to comment. It couldn’t be determined which divisions the reductions were focused in. Salesforce had nearly 73,000 workers as of January 2024, when that fiscal year ended.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTechnology companies have grown more accustomed to regular job reductions after a massive wave of layoffs at the start of 2023. So far this year, Amazon.com Inc., Microsoft Corp. and Meta Platforms Inc. have all moved to trim their corporate workforces.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSalesforce, the leading maker of customer management software, has embarked on a hiring spree for salespeople focused on the company’s new AI agent products. But it’s also been keeping a closer eye on maintaining profit margins after pressure from activist investors in 2023. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Just because we have a hit new product doesn’t mean that we ignore the commitments we’ve made internally and externally as we think about scaling this business,” Chief Operating Officer Brian Millham said when asked about the company’s profit-focus during an event hosted by Barclays Plc in December. “We’re looking across the entire company to say, ‘Where can we get more efficiencies? How can we continue to get fuel for the work that we’re doing to go invest in scale going forward?”</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSalesforce is expected to report fourth-quarter earnings around the end of February.</div></div>",
            "pub_date": "2025-02-04 11:25:26",
            "link": "https://www.business-standard.com/world-news/salesforce-to-cut-1-000-roles-while-hiring-salespeople-for-ai-products-125020400123_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400123"
        },
        {
            "title": "US starts deporting illegal migrants to India amid Trump's border crackdown",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Trump administration has started deporting Indian migrants who entered the US illegally, according to a report by Reuters. A US military C-17 aircraft had departed for India with migrants aboard but would not arrive for at least 24 hours, the report quoted an official as saying.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUS President Donald Trump has increasingly turned to the military to help carry out his immigration agenda, including sending additional troops to the US-Mexico border, using military aircraft to deport migrants and opening military bases to house them.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump has consistently advocated for the removal of illegal immigrants from the United States, citing concerns over national security, economic impact, and the rule of law. He argues that illegal immigration poses threats to public safety and burdens the nation's resources.<small class=\"brtagPara\"> </small>\r\n\tSoon after Trump's inauguration last month, the Indian government agreed to take back all its citizens residing illegally in the US, according to a report in Bloomberg. The report said that the two countries together identified around 18,000 illegal Indian migrants in the US to be sent back home.<small class=\"brtagPara\"> </small>\r\n\tSo far, US military aircraft have flown migrants to Guatemala, Peru and Honduras.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-04 11:20:31",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/us-deporting-illegal-indian-migrants-donald-trump-border-crackdown-125020400118_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400118"
        },
        {
            "title": "Donald Trump's tariff reversal feeds reputation as paper tiger on trade",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Josh Wingrove and Jenny Leonard</strong><small class=\"brtagPara\"> </small>\r\n\tPresident Donald Trump pledged hundreds of billions in tariffs to remake the global economy and target even his closest neighbours.<small class=\"brtag\"> </small></div>\n<div>\r\n\tBut so far, it’s been more Art of the Deal than a revolution.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump on Monday shelved plans for wide-ranging tariffs on Canada and Mexico, after doing the same for Colombia the prior week. In each case, Trump relented despite countries promising only modest changes on border security and immigration.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump and his allies have held up those concessions as vindication of his approach. But the US president’s willingness - at least for now - to hold off tariffs has underscored doubts over whether Trump, who famously obsesses over market performance, might once again prove a paper tiger on his more fiery trade threats. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump could always reverse course again and press for more extreme measures, or impose the tariffs in a bid to offset the projected cost of some of his domestic agenda. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBut the deferrals are only likely to feed the US president’s growing reputation for stopping short of his bombast when it comes to trade, using the levies as a negotiating ploy. Even after Trump announced he was pushing ahead with his tariffs over the weekend, the slide in markets was contained as analysts predicted concessions that would limit their impact.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tStill, uncertainty swirls: Trump did not announce a pause on China tariffs, which have more support in his party, ahead of a planned phone call with President Xi Jinping later this week. He’s also pledged levies on the EU and key sectors. And Trump emphasised that the Mexican and Canadian pauses are only for a month, raising the prospect he could snap back the levies if he doesn’t see the outcomes he wants.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnd Trump’s moves, even if not fully implemented, have come with costs. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump’s threats and the prospect of them becoming real dropped US stocks and the currencies of his targets, including the Canadian dollar, Mexican peso, euro, and South African rand. Each of those recovered as Trump delayed his Mexican threat, then his Canadian one. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile in world capitals, leaders are taking stock of how to respond to the White House. Much of Canada’s Liberal Party leadership campaign to replace Prime Minister Justin Trudeau has centered on how to take on Trump. And internationally minded businesses across the closest of US allies have been forced for weeks into reviewing their own supply chains.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Familiar concessions</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tIt all leaves unclear whether Trump is all bark on tariffs or whether he still aims to shift the US back toward an era a century ago when import levies were the chief source of revenue.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump said he’d take part in ongoing talks toward a deal with Mexico, and conditioned a further Canada reprieve on whether they can reach a “final economic deal.” And he’s still threatening a host of other tariffs, including on the EU.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAllies of the president touted the concessions from Mexico — a deployment of 10,000 National Guard members to prevent drug trafficking and further talks on security and trade — as proof of Trump’s negotiating prowess. </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBut they struck a familiar tone. Mexico agreed to dispatch 10,000 troops to its own southern border under President Joe Biden’s administration in 2021, and also dispatched several thousand troops to its southern border in 2019 amid similar pressure from Trump over migration. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCanada made a similar announcement — saying that “nearly 10,000 frontline personnel are and will be working on protecting the border” and pledging a handful of new measures, like C$200 million to fight organised crime and naming a fentanyl czar. Trump also praised a C$1.3 billion announcement Trudeau has previously made.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrudeau’s government scrambled to put together a border plan two months ago, after Trump first threatened tariffs over migration and fentanyl flows. Officials also repeatedly pointed out there is no evidence the border is a significant problem on these issues.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBut as time passed with no deal, Canadian officials grew frustrated at the lack of information about what Trump was looking for, and raised doubts that fentanyl was his true motivation.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We’ve shown them and said that we’ll do what’s necessary to deal with this,” said Finance Minister Dominic LeBlanc in a television interview Sunday. “But I wonder if that’s the actual pretext, or if there’s another policy objective that they’re pursuing.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Mexico about-face is virtually identical to Trump’s move in his first term, when he declared a national economic emergency and announced tariffs would go into effect in 2019 — and increase 5 per cent every month until Mexico take actions to address the illegal migration crisis.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe standoff between Trump and his Mexican counterpart took about a week until the president on June 7, 2019, announced in a social media post that he had “reached a signed agreement with Mexico” and tariffs scheduled to be implemented were “indefinitely suspended.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Just like in 2019, Mexico came to the table in advance of those tariffs going into effect with commitments that sufficiently addressed the president’s concerns,” said Kelly Ann Shaw, a partner at Hogan Lovells who served as Trump’s deputy economic council director during his first term.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt also mirrors his move last month to threaten tariffs on Colombia in a dispute over deportation flights, only to back off when the Latin American nation’s leader said he would pick up migrants with his own government plane rather than have them fly shackled on US military planes.</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump’s Saturday announcement that he would press ahead with 25% tariffs on Canada and Mexico, two of the largest US trading partners, shook markets. Equities slumped while oil rose and the US dollar strengthened amid fears the duties would kick off a wider trade war. Canada and Mexico each threatened retaliatory measures if Trump followed through. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump has threatened a range of other tariffs, though it’s not clear which, if any, he actually intends to implement. Those include duties on sectors like pharmaceuticals, chips, steel, aluminum, and copper; tariffs on the European Union; and a potential across-the-board global tariff that Trump has said should be “much bigger” than 2.5 per cent.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe president has long spoke about his desire to use tariffs more aggressively to fill government coffers, as he looks to cut taxes elsewhere, and get even with countries he perceives as ripping off the US. His decision to pause the Canada and Mexico tariffs leaves those goals unfulfilled for now.</div></div>",
            "pub_date": "2025-02-04 11:20:31",
            "link": "https://www.business-standard.com/world-news/donald-trump-s-tariff-reversal-feeds-reputation-as-paper-tiger-on-trade-125020400119_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400119"
        }
    ]
}