{
    "data": [
        {
            "title": "Ujjivan SFB applies for a universal banking licence to expand offerings",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tUjjivan Small Finance Bank (SFB) on Tuesday said it has submitted an application to the Reserve Bank of India (RBI) seeking a universal banking licence to strengthen its offerings and its position in the sector.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Bengaluru-based lender is the second SFB after AU SFB to apply for a universal banking licence under the voluntary transition route.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The Bank has consistently demonstrated strong financial performance and a commitment to financial inclusion, serving a diverse customer base across the country. Securing the universal banking licence, if approved, will strengthen Ujjivan’s efforts to provide holistic financial services to its customers and empower all aspiring Indians with a wider range of banking solutions,” said Sanjeev Nautiyal, MD &amp; CEO, Ujjivan SFB.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUjjivan SFB, which started operations in February 2017, has about 9.3 million customers through its 753 branches spread across 26 states and union territories in the country. As of December 31, 2024, its gross loan book stands at Rs 30,466 crore, and its deposits stand at Rs 34,494 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The diversification of the loan book has seen accelerated results, with the secured segment contributing 39 per cent to the overall loan book,” the bank said in a statement.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to RBI norms, to be eligible for conversion into a universal bank, these banks must have a minimum net worth of Rs 1,000 crore, hold scheduled status, and have a satisfactory track record of at least five years. Additionally, they must maintain a gross non-performing asset (NPA) ratio of 3 per cent or less and a net NPA ratio of 1 per cent or less over the past two financial years. Additionally, the norms say only listed small finance banks will qualify.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, these must also have reported a net profit in the past two financial years and meet the prescribed capital adequacy norms. The RBI also requires these SFBs to provide a detailed rationale for their conversion into a universal bank, with preference given to those with a diversified loan portfolio.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, Bengaluru-based Jana Small Finance Bank is also harboring ambitions of transitioning into a universal bank. The bank has made additional or accelerated provisions to keep its gross and net non-performing assets (NPA) within the regulatory requirement of 3 per cent and 1 per cent respectively.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 21:45:31",
            "link": "https://www.business-standard.com/industry/banking/ujjivan-sfb-applies-for-a-universal-banking-licence-to-expand-offerings-125020401318_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401318"
        },
        {
            "title": "Gold loan portfolio of banks jumps 71.3% to Rs 1.72 trillion till Dec 2024",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe gold loan portfolio of banks rose by 71.3 per cent year-on-year (Y-o-Y) till December 2024 to Rs 1.72 trillion, compared to 17 per cent growth a year ago, on the back of rising gold prices and a slowdown in unsecured loans following an increase in risk weights last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Over the last year, gold loan growth has sharply increased, with a 68 per cent rise from March 2024 to December 2024 (9M FY25), while gold prices increased by around 21 per cent during this time,” said Ajit Velonie, senior director, Crisil Ratings.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“There has also been a partial slowdown in unsecured loan growth due to stricter regulations. The growth in gold loans has coincided with this period. Personal loans grew by only 5–6 per cent, compared to 16.5 per cent the previous year. The slower growth in unsecured loans has likely led borrowers to turn to gold loans as an alternative, though the impact is smaller compared to the overall slower growth in personal loans,” Velonie added.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn November 2023, the Reserve Bank of India (RBI) increased risk weights for unsecured loans by 24 percentage points to 125 per cent. There has been a significant slowdown in the unsecured loan segment due to the tightening of norms.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe other personal loans segment, comprising unsecured credit, showed 9.7 per cent Y-o-Y growth in December 2024, compared to 20.8 per cent in December 2023. Credit card loans also saw a moderation in growth, at 15.6 per cent in December 2024, down from 32.6 per cent a year ago.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBank credit growth in the retail loan segment, including housing, vehicle, credit card, and personal loans, dropped to 14.9 per cent Y-o-Y in December 2024, down from 17.6 per cent in December 2023.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGold loan prices increased by 20.4 per cent to Rs 75,857 per 10 grams in December 2024, from Rs 62,993 per 10 grams in the year-ago period.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Factors contributing to the rise in gold loans include rising gold prices, as the value of loans taken against jewellery also increases amid the rise in gold prices. People with gold jewellery are also borrowing more, refinancing their loans as the value of gold increases,” said Kirti Timmanagoudar, head of strategy and co-lending, IIFL Finance.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The crackdown on unsecured lending and stress in the microfinance institution (MFI) space might also be contributing factors. It is likely a cumulative effect of these elements rather than one factor being responsible,” Timmanagoudar added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to RBI data, since May 2024, one bank has changed the classification of a category of agricultural loans into \"Loans against gold jewellery\" under the retail segment. The lender has stopped extending loans against gold in metropolitan branches for agricultural purposes and has placed them under retail loans.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Loans previously classified as agricultural are now being treated as gold loans. This reclassification might explain the slower growth in agricultural loans, which have only grown by 8 per cent compared to previous years,” Timmanagoudar said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGold loan financiers said gold loans have emerged as a preferred option for customers' short-term requirements.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The slowdown in the supply of unsecured lending might give an impetus, but gold loans have been witnessing an upward trajectory due to their own features. Today, they are widely accepted and a popular choice among customers, especially for short-term requirements, acting as a vital financial inclusion tool,” said Shaji Varghese, chief executive officer, Muthoot FinCorp.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe December edition of the financial stability report (FSR) of the RBI observed a rapid increase in gold loan disbursals during the period ending September 2024 compared to the same period last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTo address the non-adherence to prudential guidelines by supervised entities (SEs) in granting loans against the pledge of gold ornaments and jewellery, the RBI has advised SEs to comprehensively review their policies, identify gaps, and implement corrective measures within a specified timeframe.</div></div>",
            "pub_date": "2025-02-04 21:45:30",
            "link": "https://www.business-standard.com/industry/banking/gold-loan-portfolio-of-banks-jumps-71-3-to-rs-1-72-trillion-till-dec-2024-125020401498_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401498"
        },
        {
            "title": "Updated I-T return: Ensure accuracy as revisions are not permitted",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFinance Minister Nirmala Sitharaman has proposed extending the deadline for filing updated income tax returns (ITRs) from two to four years.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“In the financial year 2024–25, a person can file an updated return for assessment years 2022–23 and 2023–24. The Finance Bill 2025 proposes to extend this deadline to 48 months from the end of the relevant financial year,” says Naveen Wadhwa, deputy general manager, Taxmann.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What is an updated return?</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tAn updated return, filed under Section 139(8A), allows taxpayers to amend missed or incorrect income declarations. It can be filed if they failed to file a return despite exceeding the threshold, omitted income, or overstated losses or refunds.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“A taxpayer liable to pay higher taxes for earlier assessment years can rectify the situation by filing an updated return and paying the additional tax,” says Vivek Jalan, partner, Tax Connect Advisory Services LLP.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIf you wrongly declared long-term capital gains at 12.5 per cent instead of applying the slab rate or carried forward excess losses, an updated return can be used to correct these mistakes.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWadhwa informs that an updated return gives taxpayers more time by allowing them to file a return after deadlines for belated and revised returns have passed.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Conditions attached</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tOnly those with additional tax to pay can file an updated return.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The updated return should effectively increase the tax flow to the government,” says Anshul Khemuka, partner, Khaitan &amp; Co.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn updated return cannot be filed in certain circumstances.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“It cannot be filed if it is a return of loss, if the total tax liability gets reduced, or if the refund increases due to the filing of the updated return. Adjustment of additional losses against income is also not allowed,” says Akhil Chandna, partner, global people solutions leader, Grant Thornton Bharat.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis avenue also closes once a special audit or assessment has begun.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“If a search or survey proceeding has been initiated, or a reassessment proceeding is pending, or there is a proceeding under the Black Money Act, the Prevention of Money Laundering Act, or the Benami Act,” says Khemuka.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe option is also unavailable if the assessing officer has relevant information under the Double Taxation Avoidance Agreement (DTAA) or the Tax Information Exchange Agreement (TIEA).</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Compliance benefit</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tFiling an updated return allows taxpayers to rectify errors voluntarily and comply with tax laws.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“If the tax office discovers a gap in compliance, they could initiate audit proceedings, which could lead to penalties,” says Khemuka.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFiling an updated return also mitigates the risk of an additional tax burden.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“If you file an updated return in the second year, you would pay 50 per cent more on additional tax and interest. But if the department detects undisclosed income, you could end up paying a penalty as high as 200 per cent,” says Jalan.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn updated return also helps avoid prosecution under Section 276CC, according to Wadhwa.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tITRs have become essential for obtaining government contracts and visas.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Someone who has not filed a return but needs one can file an updated return,” says Jalan.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Costs involved</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tTaxpayers filing updated returns must pay an additional tax liability of between 25 and 70 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This additional tax liability would have been avoided if the taxpayer had filed their ITR correctly and within the specified timeline. Adjusting for losses or increasing the loss claim is also not possible through an updated return. A higher tax refund cannot be obtained through this route,” says Chandna.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFiling an updated return may draw scrutiny.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“There is a chance of your tax return being picked up for assessment, just to see if the positions adopted in the revised return have any bearing on past tax positions,” says Khemuka.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Precautions to exercise</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tBefore filing an updated return, make sure you are eligible to file one. Also, confirm that deadlines for belated or revised returns have expired. Use this option solely to correct issues you are permitted to.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe updated return must accurately reflect changes to income and deductions.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Once filed, it cannot be revised or rectified,” says Jalan.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWadhwa warns that significant changes could attract queries. He advises retaining supporting documents, such as bank statements and investment proofs, to deal with scrutiny. Khemuka advises against frequent use of this option.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFinally, Chandna urges taxpayers to file by December rather than waiting until the last moment.</div></div>",
            "pub_date": "2025-02-04 21:40:27",
            "link": "https://www.business-standard.com/finance/personal-finance/updated-i-t-return-ensure-accuracy-as-revisions-are-not-permitted-125020401466_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401466"
        },
        {
            "title": "VC investors take leading role in guiding startups through AI disruption",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAs artificial intelligence (AI) becomes a central driver of innovation, venture capital (VC) investors are stepping up to help portfolio companies navigate the complexities of AI adoption. From advising on strategic integrations to connecting with top-tier AI talent, VCs are offering more than just capital; they are providing the guidance and resources needed to harness AI’s full potential.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tExperts said the rapid rise of AI tools like ChatGPT, DeepSeek, and Qwen 2.5 has left many startups scrambling to keep up as the pace of disruption accelerates.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“AI is evolving at such an unprecedented pace—what was relevant yesterday may be outdated tomorrow. Given this rapid evolution, the best strategy is to focus on what will remain constant: the need for adaptability,” said Preeti Sampat, partner, Eximius Ventures, a leading VC firm that backs companies across fintech, software-as-a-service (SaaS), frontier tech, and consumer tech.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSampat said most Indian software companies operate in the application layer rather than the infrastructure layer, unlike China, which has made significant strides in foundational AI models like DeepSeek and Qwen. To stay ahead, she said Indian companies must design flexible architectures that can seamlessly integrate multiple AI models as technology advances.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This is particularly critical now, as the cost of AI is decreasing, making intelligent software development more accessible,” said Sampat. “By maintaining adaptability and focusing on customer needs, application-layer companies can capitalise on these advancements.”</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhen asked how Eximius is supporting its portfolio companies in adopting an AI strategy, Sampat pointed out that it is about enhancing existing software solutions by layering AI capabilities on top to improve functionality. The other aspect is developing AI-native modules, which can be built in a modular fashion. These modules can vary in automation levels, ranging from fully automated to human-in-the-loop systems.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The key is to identify where AI can provide the most value and implement it strategically, ensuring that it enhances efficiency, automation, and user experience in a meaningful way,” said Sampat.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFor instance, one of Eximius’ portfolio companies, DecoverAI, is transforming the legal tech space by automating legal service providers (LSPs) in the litigation sector, a trillion-dollar market. DecoverAI focuses on litigation support, making legal workflows more efficient through AI-driven copilots and autonomous agents. Initially, they built copilots to assist lawyers in case preparation and real-time courtroom support. However, with the rise of AI agents, they are now incorporating autonomous workflows that can handle certain tasks independently.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This balance between AI-assisted and AI-driven automation not only enhances efficiency but also reduces costs, making DecoverAI a standout player in legal AI,” said Sampat.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAI adoption must be strategic</div>\n<div>\r\n\tAnil Joshi, managing partner at Unicorn India Ventures, believes AI may not be applicable as it is to all businesses. However, he said Unicorn India actively evaluates the potential impact of AI on respective businesses and accordingly advises companies on their AI goals.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis includes firms using AI for internal operations to gain an edge over competitors. The other goal is making product offerings AI-compatible so that customers can benefit from cutting-edge solutions.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOne of Unicorn India’s portfolio firms, Genrobotic, recently worked on a robo-arm leveraging AI. It is helping eliminate risks to humans in difficult tasks while improving productivity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJoshi said having an AI strategy is crucial, as it involves engaging quality resources for building AI solutions, which is expensive. He also stressed the importance of continuously monitoring and evaluating AI’s impact. Otherwise, companies may end up spending excessive man-hours and resources on solutions that lack practical use cases.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Timely intervention will certainly help companies build the right solutions needed by customers,” said Joshi. “We strongly encourage companies to build in-house AI capabilities or intellectual property. It will certainly help in keeping pace with changes in the tech space.”</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAI specialists: A necessity or an option?</div>\n<div>\r\n\tSonal Saldanha, vice president for investments at 3one4, said his firm insists that companies experiment with and embrace new AI tools with urgency—not just for marketing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Because we’re seeing so many real-world examples of impact,” said Saldanha.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t3one4 counts fresh meat and seafood delivery startup Licious, shared electric vehicle mobility company Yulu, and Ayurvedic consumer products firm Kapiva among its portfolio companies.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs far as building AI-enabled products is concerned, Saldanha said teams at various companies already have too much on their plates. Using closed-source foundational model APIs (application programming interfaces) is often the easiest way to get started. Moving to self-hosting open-source models, which provide more flexibility but require greater technical expertise, can be adopted later in the product’s life cycle.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“When it comes to consuming AI products internally, again, the best product wins. Building and maintaining a home-grown implementation of something is often not worth the effort at startups, where focus is especially important,” said Saldanha.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, Saldanha does not buy into the notion that companies need ‘AI specialists’ to succeed. He believes it is as simple as hiring smart engineers who are willing to tinker and learn practical tooling, at least in the beginning. Later, more specialists can be recruited to solve specific growth-related problems.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHelping startups integrate AI</div>\n<div>\r\n\tGowri Shankar Nagarajan, associate partner at Antler India, said his firm provides advisory support to enable portfolio companies to adopt AI.</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We have a bunch of AI practitioners who are available to any founder to brainstorm how they should think about using AI and the right tech stack for AI,” said Shankar.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAntler is also actively working with major tech companies to give startups access to AI tools to experiment before setting up a full-fledged product roadmap.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGenerative AI (GenAI) has the potential to add a cumulative $1.2–1.5 trillion to India’s gross domestic product (GDP) over the next seven years, according to a report by EY. The report, titled AIdea of India: Generative AI’s Potential to Accelerate India’s Digital Transformation, states that in 2029-30 alone, GenAI could contribute an additional $359–438 billion to India’s GDP.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 21:40:26",
            "link": "https://www.business-standard.com/companies/start-ups/vc-investors-take-leading-role-in-guiding-startups-through-ai-disruption-125020401454_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401454"
        },
        {
            "title": "Delhi HC refuses relief to Rashmi Saluja in Religare reappointment matter",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Delhi High Court (HC) on Friday denied relief to Rashmi Saluja, executive chairperson of Religare Enterprises (REL), in her plea against a resolution seeking to replace her with a new director at the upcoming annual general meeting (AGM) on February 7.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja, who is set to retire by rotation, argued that her appointment was for a fixed term of five years, ending in 2028. However, the court noted that while she was appointed in 2023 for a five-year term, the board meeting and AGM minutes explicitly stipulated retirement by rotation.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJustice Purushaindra Kumar Kaurav observed, \"This clearly indicates that the understanding of the plaintiff that she is liable to retire is not something that was introduced for the first time in 2025... It is evident that the plaintiff has failed to establish a prima facie case in her favour.\"</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe court further emphasised that every shareholder has the right, subject to statutory procedures, to participate in the company's affairs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The participation is essentially to uphold the principle of corporate democracy. Shareholders must be allowed to regulate and determine the affairs of the company through general meetings, which serve as the primary forum for decision-making within a corporate entity,\" the court stated.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Delhi HC's decision clears the way for the AGM and the voting on the appointment of a new director to replace Saluja.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHer plea was opposed by four independent directors of the company and the Burman family, the largest shareholder in REL, who have launched an open offer to acquire an additional 26 per cent stake. The open offer, which closes on Friday, has so far received bids for only 1,668 shares.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja has offered herself for reappointment, and the outcome of the voting will be known at the AGM. The AGM, originally scheduled for December, was delayed due to legal proceedings before the Madhya Pradesh High Court. A plea filed by a non-shareholder was later dismissed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThree leading proxy firms—Stakeholders Empowerment Services, Institutional Investor Advisory Services, and InGovern Research—have recommended an 'against' vote on the resolution pertaining to Saluja's reappointment, citing concerns over corporate governance, employee stock ownership plans (ESOPs), and higher remuneration.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRefuting these concerns, REL described the reports as 'orchestrated and motivated' and questioned the timing of the advisory firms' reports. The company stated that matters regarding compensation practices and ESOPs were sub judice and that any attempt to influence public opinion through 'misleading analysis' was unethical.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 21:35:31",
            "link": "https://www.business-standard.com/companies/news/delhi-hc-refuses-relief-to-rashmi-saluja-in-religare-reappointment-matter-125020401469_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401469"
        },
        {
            "title": "Updated I-T return: Ensure accuracy as revisions are not permitted",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFinance Minister Nirmala Sitharaman has proposed extending the deadline for filing updated income tax returns (ITRs) from two to four years.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“In the financial year 2024–25, a person can file an updated return for assessment years 2022–23 and 2023–24. The Finance Bill 2025 proposes to extend this deadline to 48 months from the end of the relevant financial year,” says Naveen Wadhwa, deputy general manager, Taxmann.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What is an updated return?</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tAn updated return, filed under Section 139(8A), allows taxpayers to amend missed or incorrect income declarations. It can be filed if they failed to file a return despite exceeding the threshold, omitted income, or overstated losses or refunds.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“A taxpayer liable to pay higher taxes for earlier assessment years can rectify the situation by filing an updated return and paying the additional tax,” says Vivek Jalan, partner, Tax Connect Advisory Services LLP.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIf you wrongly declared long-term capital gains at 12.5 per cent instead of applying the slab rate or carried forward excess losses, an updated return can be used to correct these mistakes.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWadhwa informs that an updated return gives taxpayers more time by allowing them to file a return after deadlines for belated and revised returns have passed.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Conditions attached</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tOnly those with additional tax to pay can file an updated return.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The updated return should effectively increase the tax flow to the government,” says Anshul Khemuka, partner, Khaitan &amp; Co.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn updated return cannot be filed in certain circumstances.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“It cannot be filed if it is a return of loss, if the total tax liability gets reduced, or if the refund increases due to the filing of the updated return. Adjustment of additional losses against income is also not allowed,” says Akhil Chandna, partner, global people solutions leader, Grant Thornton Bharat.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis avenue also closes once a special audit or assessment has begun.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“If a search or survey proceeding has been initiated, or a reassessment proceeding is pending, or there is a proceeding under the Black Money Act, the Prevention of Money Laundering Act, or the Benami Act,” says Khemuka.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe option is also unavailable if the assessing officer has relevant information under the Double Taxation Avoidance Agreement (DTAA) or the Tax Information Exchange Agreement (TIEA).</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Compliance benefit</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tFiling an updated return allows taxpayers to rectify errors voluntarily and comply with tax laws.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“If the tax office discovers a gap in compliance, they could initiate audit proceedings, which could lead to penalties,” says Khemuka.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFiling an updated return also mitigates the risk of an additional tax burden.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“If you file an updated return in the second year, you would pay 50 per cent more on additional tax and interest. But if the department detects undisclosed income, you could end up paying a penalty as high as 200 per cent,” says Jalan.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn updated return also helps avoid prosecution under Section 276CC, according to Wadhwa.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tITRs have become essential for obtaining government contracts and visas.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Someone who has not filed a return but needs one can file an updated return,” says Jalan.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Costs involved</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tTaxpayers filing updated returns must pay an additional tax liability of between 25 and 70 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This additional tax liability would have been avoided if the taxpayer had filed their ITR correctly and within the specified timeline. Adjusting for losses or increasing the loss claim is also not possible through an updated return. A higher tax refund cannot be obtained through this route,” says Chandna.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFiling an updated return may draw scrutiny.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“There is a chance of your tax return being picked up for assessment, just to see if the positions adopted in the revised return have any bearing on past tax positions,” says Khemuka.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Precautions to exercise</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tBefore filing an updated return, make sure you are eligible to file one. Also, confirm that deadlines for belated or revised returns have expired. Use this option solely to correct issues you are permitted to.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe updated return must accurately reflect changes to income and deductions.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Once filed, it cannot be revised or rectified,” says Jalan.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWadhwa warns that significant changes could attract queries. He advises retaining supporting documents, such as bank statements and investment proofs, to deal with scrutiny. Khemuka advises against frequent use of this option.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFinally, Chandna urges taxpayers to file by December rather than waiting until the last moment.</div></div>",
            "pub_date": "2025-02-04 21:35:31",
            "link": "https://www.business-standard.com/finance/personal-finance/updated-i-t-return-ensure-accuracy-as-revisions-are-not-permitted-125020401466_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401466"
        },
        {
            "title": "Delhi HC refuses relief to Rashmi Saluja in Religare reappointment matter",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Delhi High Court (HC) on Friday denied relief to Rashmi Saluja, executive chairperson of Religare Enterprises (REL), in her plea against a resolution seeking to replace her with a new director at the upcoming annual general meeting (AGM) on February 7.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja, who is set to retire by rotation, argued that her appointment was for a fixed term of five years, ending in 2028. However, the court noted that while she was appointed in 2023 for a five-year term, the board meeting and AGM minutes explicitly stipulated retirement by rotation.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJustice Purushaindra Kumar Kaurav observed, \"This clearly indicates that the understanding of the plaintiff that she is liable to retire is not something that was introduced for the first time in 2025... It is evident that the plaintiff has failed to establish a prima facie case in her favour.\"</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe court further emphasised that every shareholder has the right, subject to statutory procedures, to participate in the company's affairs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The participation is essentially to uphold the principle of corporate democracy. Shareholders must be allowed to regulate and determine the affairs of the company through general meetings, which serve as the primary forum for decision-making within a corporate entity,\" the court stated.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Delhi HC's decision clears the way for the AGM and the voting on the appointment of a new director to replace Saluja.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHer plea was opposed by four independent directors of the company and the Burman family, the largest shareholder in REL, who have launched an open offer to acquire an additional 26 per cent stake. The open offer, which closes on Friday, has so far received bids for only 1,668 shares.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja has offered herself for reappointment, and the outcome of the voting will be known at the AGM. The AGM, originally scheduled for December, was delayed due to legal proceedings before the Madhya Pradesh High Court. A plea filed by a non-shareholder was later dismissed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThree leading proxy firms—Stakeholders Empowerment Services, Institutional Investor Advisory Services, and InGovern Research—have recommended an 'against' vote on the resolution pertaining to Saluja's reappointment, citing concerns over corporate governance, employee stock ownership plans (ESOPs), and higher remuneration.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRefuting these concerns, REL described the reports as 'orchestrated and motivated' and questioned the timing of the advisory firms' reports. The company stated that matters regarding compensation practices and ESOPs were sub judice and that any attempt to influence public opinion through 'misleading analysis' was unethical.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 21:30:32",
            "link": "https://www.business-standard.com/companies/news/delhi-hc-refuses-relief-to-rashmi-saluja-in-religare-reappointment-matter-125020401469_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401469"
        },
        {
            "title": "Delhi polls: ADR flags non-compliance of norms by candidates, parties",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tOut of 118 candidates with criminal record contesting the Delhi Assembly polls, 24 candidates (20 per cent) did not have their records disclosed or justified by their respective parties, poll rights body ADR said on Tuesday.</p>\n<p>\r\n\tA total of 699 candidates are contesting the upcoming assembly polls in Delhi.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/technology/tech-news/delhi-elections-2025-how-to-search-and-download-voter-slip-on-mobile-phone-125020401228_1.html\" target=\"_blank\">Delhi elections 2025: How to search and download voter slip on mobile phone</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tThe Association for Democratic Reforms (ADR) has released a detailed analysis of the Delhi Assembly elections 2025. The report, based on Format C7 data, revealed that many political parties failed to disclose reasons for selecting candidates with pending criminal cases as directed by the Supreme Court.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tOut of 699 candidates contesting the elections, 118 have declared criminal cases against themselves and among them, 71 candidates face serious criminal charges, including corruption, rioting and violent offenses.</p>\n<p>\r\n\tWhile 94 candidates' criminal records were published as mandated, 24 candidates (20 per cent) did not have their records disclosed or justified by their respective parties.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe Supreme Court had mandated that political parties provide valid reasons for fielding such candidates beyond just their \"winnability\" at the polls.</p>\n<p>\r\n\tHowever, most parties continue to offer vague or repetitive justifications.</p>\n<p>\r\n\tThe analysis covered 22 political parties that fielded candidates with criminal cases.</p>\n<p>\r\n\tThe major parties such as the Aam Aadmi Party (AAP), Congress and Bharatiya Janata Party (BJP) published Format C7 for most of their candidates.</p>\n<p>\r\n\tHowever, the smaller parties, including the Peoples Party of India (Democratic) and Bhartiya Rashtrawadi Party, failed to comply.</p>\n<p>\r\n\tSome parties engaged in questionable practices such as providing identical justifications for multiple candidates or claiming cases were \"politically motivated\" without substantial evidence.</p>\n<p>\r\n\tThe AIMIM and the National Loktantrik Party also copied responses across different candidates, the ADR said.</p>\n<p>\r\n\tAmong the candidates with the highest number of criminal cases are Amanatullah Khan (AAP) with 19 cases, Arvind Kejriwal (AAP) with 15 cases and Mohd. Tahir Hussain (AIMIM) with 11 cases, including 38 serious charges.</p>\n<p>\r\n\tThe political parties justified their selection by citing their political experience, popularity and claims that cases against them were filed due to political vendetta.</p>\n<p>\r\n\tHowever, these explanations often lacked substantive reasoning on why cleaner candidates were not considered, the ADR said.</p>\n<p>\r\n\tThe ADR report also underscores the strong nexus between muscle power, money and politics.</p>\n<p>\r\n\tOut of the 118 candidates with criminal backgrounds, 84 (71 per cent) are crorepatis and the top three candidates with the highest declared assets, despite having criminal cases, include Manjinder Singh Sirsa (BJP) with Rs 248 crore, Gurcharan Singh (Congress) with Rs 130 crore and Parvesh Sahib Singh (BJP) with Rs 115 crore.</p>\n<p>\r\n\tThe ADR has proposed several urgent reforms to curb the criminalization of politics. These include strict action against non-compliant political parties, fast-tracking criminal cases against politicians, banning candidates with serious charges and imposing financial penalties for non-disclosure.</p>\n<p>\r\n\tThe elections to the 70-member Delhi Assembly will be held on February 5 and the votes will be counted on February 8.</p><p></p></div>",
            "pub_date": "2025-02-04 21:30:31",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-polls-adr-flags-non-compliance-of-norms-by-candidates-parties-125020401168_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401168"
        },
        {
            "title": "100% FDI in insurance sector to woo more foreign players: Moody's",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tIncreasing foreign investment limit in the insurance sector to 100 per cent from 74 per cent is likely to attract more global players in the growing Indian insurance market, Moody's Ratings said on Tuesday.</p>\n<p>\r\n\tAdditionally, strong premium growth is expected to boost profitability of the sector.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/budget-2025-100-fdi-insurance-penetration-density-lower-premiums-125020200472_1.html\" target=\"_blank\">Budget 2025: How 100% FDI will benefit the Indian insurance industry</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tCurrently, many foreign insurers are present in the country through joint ventures and could seek to increase their ownership stakes in their Indian affiliates following this change in regulation.</p>\n<p>\r\n\t\"We view foreign investment as credit positive because it increases product innovation. The presence of foreign stakeholders also brings benefits in the areas of capital adequacy, financial flexibility and governance standards,\" Moody's Ratings said in a statement.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tPresenting Budget 2025-26, Finance Minister Nirmala Sitharaman proposed to raise the foreign investment limit to 100 per cent from 74 per cent in the insurance sector as part of new-generation financial sector reforms.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tMoreover, Moody's believes that the reduction in personal income tax will have positive trickle-down effects for the insurance sector.</p>\n<p>\r\n\t\"Increased levels of disposable income in the middle-class segment, the insurance sector's largest target market, bodes particularly well for health insurance, given increasing awareness around well-being and protection in the post-COVID era,\" it added.</p>\n<p>\r\n\tThese changes will further boost the Indian insurance industry's growth prospects, which are already favourable.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIn the budget, Sitharaman announced an increase in the personal income tax threshold below which taxpayers owe no tax to Rs 12 lakh, from Rs 7 lakh, as well as a rejig in tax brackets that would help those earning higher than that save up to Rs 1.1 lakh.</p>\n<p>\r\n\tMoody's said that strong economic growth supports average household incomes and increasing demand as a result of consumers' increasing risk awareness and the steady digitalization of the Indian economy, which facilitates the distribution and sale of insurance products.</p>\n<p>\r\n\tIndian insurers' total premium revenue rose 16 per cent to Rs 9.2 trillion in the first eight months of fiscal 2024-25, driven by a 21 per cent increase in health insurance and an 18 per cent increase in new business written in the life sector. This marked an acceleration from fiscal 2023-24, when premiums were up 8 per cent year-on-year to Rs 11.2 lakh crore.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tOn fiscal consolidation, Moody's said the budget signalled \"a slowing pace of fiscal consolidation as focus shifts to reinforcing growth\".</p>\n<p>\r\n\tThe planned cuts to personal income tax rates will bolster middle-class spending power and consumption, which is credit positive for many corporates and the financial sector.</p>\n<p>\r\n\tHowever, the resulting foregone revenue will slow the pace of the country's fiscal consolidation even as total spending declines as a share of GDP. Moreover, the proportion of spending allocated to debt servicing continues to increase.</p>\n<p>\r\n\tThe Finance Minister pegged the fiscal deficit for FY25 at 4.8 per cent of GDP and 4.4 per cent for FY26.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-04 21:25:26",
            "link": "https://www.business-standard.com/budget/news/100-fdi-in-insurance-sector-to-woo-more-foreign-players-moody-s-125020401138_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401138"
        },
        {
            "title": "Infibeam Avenues Q3 FY25 results: Net profit up 42.6% at Rs 62.4 cr",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tDigital payments firm Infibeam Avenues on Tuesday reported a consolidated net profit of Rs 62.4 crore in the third quarter of financial year 2025 (Q3 FY25), a 42.6 per cent increase from Rs 43.75 crore the same time last year. Sequentially, net profit grew 41.6 per cent from Rs 44 crore in Q2 FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRevenue from operations grew 18 per cent to Rs 1,070.3 crore, compared to Rs 907.1 crore in Q3 FY24. Sequentially, such revenue grew 5.3 per cent from Rs 1,016.6 crore in Q2 FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInfibeam operates the payment aggregator CCAvenue which earns revenue from payments and e-commerce. The payments business added Rs 1,010.2 crore to revenue in Q3 FY25, up 17.2 per cent from Rs 858.2 crore in Q3 FY24. E-commerce expanded 23 per cent: From Rs 48.8 crore in Q3 FY24 to Rs 60.1 crore in Q3 FY25.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Gandhinagar-based company’s expenditure increased 18 per cent to Rs 1,013.4 crore in Q3 FY25, from Rs 857.9 crore the same time the year before. Sequentially, expenditure grew 5.8 per cent from Rs 957.1 crore in Q2FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company’s strategic partnerships with banks, fintech firms and regulators “paved the way for hyper‐growth in our payments business”. “Our take rate [the amount of money a business makes from a transaction] improved significantly to 11.1 bps [basis points] in Q3 FY25, reflecting a 32 per cent year-on-year increase and driving profitability,” said Vishwas Patel, Joint Managing Director (MD), Infibeam Avenues.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInfibeam will over quarters launch RediffPay and RediffOne to expand the consumer-facing digital offering of Rediff, the news website it acquired in August.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“With Rediff.com now part of our ecosystem, we anticipate further enhancement in our financial performance and digital offerings,” said Vishal Mehta, chairman and MD of Infibeam.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 21:25:26",
            "link": "https://www.business-standard.com/companies/news/infibeam-avenues-q3-fy25-results-net-profit-up-42-6-at-rs-62-4-crore-125020401250_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401250"
        }
    ]
}