{
    "data": [
        {
            "title": "Elon Musk's 'buyout' offer accepted by more than 20,000 US federal workers",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Gregory Korte</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMore than 20,000 employees — about 1 per cent of the federal workforce — have signed up for an offer to quit their jobs in exchange for a deferred resignation deal that would have taxpayers continue to pay their salaries through the end of September.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBut those numbers are increasing every day, according to an official familiar with the data, and the Trump administration expects a spike in resignations as employees near Thursday’s deadline to accept the offer.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPresident Donald Trump and his efficiency czar, Tesla Inc. and SpaceX CEO Elon Musk, hopes that the offer could cull as much as 10 per cent of the federal workforce. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThat target could be difficult to meet. There are nearly 2.3 million civilian federal employees, but perhaps half of those — including civilian defense and intelligence employees, postal workers, law enforcement personnel and certain other sensitive positions — are ineligible for the offer.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThose 20,000 employees could also include many people who were already planning to retire in the coming months. An average of 62,000 federal workers have retired each year over the past decade, according to data provided by the US Office of Personnel Management. Some 298,000 employees will become eligible for retirement within the next two years.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnd federal employee unions have urged members to be skeptical of the offers, which they said were not guaranteed. The National Treasury Employees Union said the program was “designed to entice or scare you into resigning,” and the American Federation of Government Employees said the intent was “to turn the federal government into a toxic environment where workers cannot stay even if they want to.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs a result, the Office of Personnel Management has given increasingly detailed guidance on the offer, and put its key terms in writing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOPM’s acting director and top lawyer also defended the legality of the plan in a memo to agencies Tuesday, assuring employees that any signed departure agreement was “binding on the government.”</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Were the government to backtrack on its commitments, an employee would be entitled to request a rescission of his or her resignation,” OPM Acting Director Charles Ezell wrote.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThough colloquially known as a “buyout,” the deferred resignation plan is structured differently than those often found in the private sector. Employees have until Thursday to accept and could leave their jobs by the end of February. They’re free to take other jobs as long as they don’t conflict with their continued federal employment. They also have to agree not to sue the government.</div></div>",
            "pub_date": "2025-02-05 11:20:27",
            "link": "https://www.business-standard.com/world-news/elon-musk-s-buyout-offer-accepted-by-more-than-20-000-us-federal-workers-125020500114_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500114"
        },
        {
            "title": "Trump, Musk demand termination of federal office leases through GSA",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tOne of the next moves in President Donald Trump and Elon Musk's sweeping effort to fire government employees and curtail operations is using the agency that manages thousands of federal employee worksites around the country to cut down on office space.</p>\n<p>\r\n\tLast week, regional managers for the General Services Administration, or GSA, received a message from the agency's Washington headquarters to begin terminating leases on all of the roughly 7,500 federal offices nationwide, according to an email shared with The Associated Press by a GSA employee.</p>\n<p>\r\n\tThe order seems to contradict Trump's own return-to-office mandate for federal employees, adding confusion to what was already a scramble by the GSA to find workspace, internet connections and office building security credentials for employees who had been working remotely for years.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tBut it may reflect the Trump administration's belief that it won't need as many offices due to its efforts to fire employees or encourage them to resign.</p>\n<p>\r\n\tHere's what to know about the GSA and how Trump's Republican administration is using it in its pursuit of changes with other federal agencies:</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h3>\r\n\tWhat is the General Services Administration?</h3>\n<p>\r\n\tAn independent agency, the GSA in essence acts like the federal government's real estate broker, managing federal property for various agencies. President Harry S Truman established the GSA in 1949, streamlining administrative duties of procuring workplaces for federal employees that had to that point been handled by a variety of entities.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tInitially, in the wake of World War II, the GSA was tasked with disposing of war surplus goods and stockpiling strategic supplies for use in wartime. These days, it handles the acquisition of workplaces for more than 1 million federal civilian workers, oversees preservation of hundreds of historic buildings and manages government purchases from commercial vendors.</p>\n<p>\r\n\tAs of last fall, the GSA owned and leased more than 363 million square feet of space in 8,397 buildings in more than 2,200 communities nationwide, according to the agency's website. Those properties include courthouses, post offices and data processing centres.</p>\n<h3>\r\n\tWhat does Trump want the GSA to do?</h3>\n<p>\r\n\tMusk and his Department of Government Efficiency have homed in on the GSA.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAn email sent last week from GSA headquarters in Washington instructed regional managers to begin terminating leases on roughly 7,500 federal offices nationwide.</p>\n<p>\r\n\tLease terminations are the clear priority at this time, according to a Jan 29 email from a senior GSA manager, a copy of which was provided to the AP by a GSA employee.</p>\n<p>\r\n\tIn a follow-up meeting, GSA regional managers were told the goal is to terminate as many as 300 leases per day, according to the employee, who spoke on the condition of anonymity for fear of retaliation.</p>\n<h3>\r\n\tWho is leading Trump's moves concerning the GSA?</h3>\n<p>\r\n\tAccording to the employee who spoke to the AP, the initiative is being led by Nicole Hollander, who has been embedded in the GSA's headquarters in recent days.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tOn her LinkedIn profile, Hollander describes herself as an X employee with a background in real estate, in the Washington area. Hollander's X account which shows that she joined in March 2015 but where posts date only to September 2023 is full of posts related to X's real estate acquisitions, as well as information about auctions of items from Twitter's former offices after Musk purchased the platform.</p>\n<p>\r\n\tTrump has ordered the GSA to make sure it promotes beautiful federal civic architecture as the president dislikes styles that are less traditional.</p>\n<h3>\r\n\tHas Trump had a dustup with the GSA before?</h3>\n<p>\r\n\tYes. During the transition period following his November win, Trump declined to sign an agreement with the GSA that would have given his team access to secure government offices and email accounts. That refusal came in part because it would have required that the then-president-elect limit contributions to $5,000 and reveal who was donating to his transition effort.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIn late November, nearly two months past the deadline, Trump did reach an agreement with President Joe Biden's White House to allow transition staff to coordinate with the existing federal workforce before taking office on Jan 20.</p><p></p></div>",
            "pub_date": "2025-02-05 11:20:25",
            "link": "https://www.business-standard.com/world-news/trump-musk-demand-termination-of-federal-office-leases-through-gsa-125020500024_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500024"
        },
        {
            "title": "Dividend, Stock-split: Sun Pharma, Ksolves, 5 others to go ex-date tomorrow",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tShares of Container Corporation of India, India Motor Parts &amp; Accessories, IRB Infrastructure Developers, Sharda Cropchem, Sun Pharmaceutical Industries, Triveni Turbine, and Ksolves India are set to remain in focus during today's trading session on account of their corporate announcements, such as dividends or <a href=\"https://www.business-standard.com/article/pf/what-is-a-stock-split-111042600064_1.html\" target=\"_blank\">stock splits</a>.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBSE data shows that Container Corporation of India, India Motor Parts &amp; Accessories, IRB Infrastructure Developers, Sharda Cropchem, Sun Pharmaceutical Industries, and Triveni Turbine will trade ex-dividend tomorrow, Thursday, February 6, 2025, whereas Ksolves India is set to trade ex-date for its stock-split announcement.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmong these companies, <a href=\"https://www.business-standard.com/markets/sun-pharmaceuticals-industries-ltd-share-price-4325.html\" target=\"_blank\">Sun Pharmaceutical Industries</a> has announced the highest interim dividend of Rs 10.50 per share for its shareholders. This is followed by India Motor Parts &amp; Accessories, which has announced an interim dividend of Rs 10 per share. Both companies have set February 6, 2025, as the record date to ascertain shareholders' eligibility for the interim dividends.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/markets/container-corporation-of-india-ltd-share-price-12607.html\" target=\"_blank\">Container Corporation of India</a> and <a href=\"https://www.business-standard.com/markets/irb-infrastructure-developers-ltd-share-price-28365.html\" target=\"_blank\">IRB Infrastructure Developers</a> have announced interim dividends of Rs 4.25, Rs 0.10, and Rs 3 per share, respectively. These companies have also set February 6, 2025, as the record date for the interim dividend payout.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, Triveni Turbine, and Sharda Cropchem have announced interim dividends of Rs 2 and Rs 3 per share, respectively. Both companies have set February 6, 2025, as the record date to determine shareholders' eligibility for the interim dividends.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, <a href=\"https://www.business-standard.com/markets/ksolves-india-ltd-share-price-74805.html\" target=\"_blank\">Ksolves India</a> has announced a sub-division (stock split) of its existing equity shares, where one equity share of Rs 10 face value will be split into two equity shares of Rs 5 each. The company has fixed Thursday, February 6, 2025, as the record date to determine shareholders’ entitlement for the stock split.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBesides these, Coromandel International, GTV Engineering, Indian Metals &amp; Ferro Alloys, Dr. Lal PathLabs, Manba Finance, MAS Financial Services, Shree Cement, SMC Global Securities, and Sona BLW Precision Forgings will be in focus as they trade ex-dividend today.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe ex-date marks the point when a stock begins trading without the entitlement to dividends or stock splits. To qualify for these benefits, investors must own the stock before the ex-date. Beneficiaries of these corporate actions are finalized based on the list of shareholders recorded at the end of the record date.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 11:15:30",
            "link": "https://www.business-standard.com/markets/news/dividend-stock-split-sun-pharma-ksolves-5-others-to-go-ex-date-tomorrow-125020500100_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500100"
        },
        {
            "title": "LIVE: Tulsi Gabbard clears Senate panel vote for nomination as director of National Intelligence",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFormer United States Representative Tulsi Gabbard has cleared the Senate Intelligence Committee vote for her nomination to become the next Director of National Intelligence (DNI), putting her one step closer to confirmation by the full Senate, as reported by The Hill. The vote was a close call, passing 9-8 along party lines. \"The Intelligence Committee just voted for Tulsi Gabbard's nomination to be the Director of National Intelligence favourably to the full United States Senate. We look forward to her confirmation and working with her to keep America safe,\" Senate Intelligence Committee Chair Tom Cotton (R-Ark.) told reporters.</div>\n<div>\r\n\tThe vote came just hours after Senator Todd Young (R-Ind.), a key swing vote, announced that he would support Gabbard.<small class=\"brtagPara\"> </small> President Donald Trump announced Tuesday that the United States will withdraw from the top UN human rights body and will not resume funding for the UN agency helping Palestinian refugees. The US left the Geneva-based Human Rights Council last year, and it stopped funding the agency assisting Palestinian refugees, known as UNRWA, after Israel accused it of harboring Hamas militants who participated in the surprise October 7, 2023, attacks in southern Israel, which UNRWA denies. Trump's announcement came on the day he met with visiting Israeli Prime Minister Benjamin Netanyahu, whose country has long accused both the rights body and UNRWA of bias against Israel and antisemitism. Trump's executive orders also call for a review of American involvement in the Paris-based UN Educational, Scientific and Cultural Organization, known as Unesco, and a review of US funding for the United Nations in light of the wild disparities in levels of funding among different countries.<small class=\"brtagPara\"> </small> Maharashtra Chief Minister Devendra Fadnavis on Tuesday dismissed claims of not shifting to the official CM residence in south Mumbai due to superstition, and said he would move in after his daughter's board exams get over. His clarification comes hours after Shiv Sena (UBT) MP Sanjay Raut said that buffaloes sacrificed in Guwahati during Eknath Shinde's visit to the Kamakhya temple were buried on the premises of 'Varsha', the official residence of the chief minister, so that the CM's post should not go to anybody else other than Shinde. Ridiculing the claims, Fadnavis said, \"These absurd rumours do not even deserve a response from someone at my level.\" Deputy Chief Minister Eknath Shinde, who currently resides at Varsha, also commented on the controversy, saying, \"Those making these claims probably have more experience in such matters.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 11:15:29",
            "link": "https://www.business-standard.com/india-news/live-tulsi-gabbard-clears-senate-panel-vote-for-nomination-as-director-of-national-intelligence-125020500105_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500105"
        },
        {
            "title": "US will 'take over' the Gaza strip, own it and develop it, says Trump",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>US President <a href=\"https://www.business-standard.com/about/who-is-donald-trump\" target=\"_blank\">Donald Trump</a> said on Tuesday that the US would “take over” and “own” the Gaza strip, pledging to rebuild and develop it. Speaking at a joint press conference with Israeli Prime Minister <a href=\"https://www.business-standard.com/about/who-is-benjamin-netanyahu\" target=\"_blank\">Benjamin Netanyahu</a>, Trump stated \"The US will take over the Gaza Strip, and we will do a job with it too.\" \"We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site.\"<small class=\"brtagPara\"> </small>\n<h2>\n<strong>Economic development and long-term control</strong></h2>\n<h2>\n<small class=\"brtagPara\"> </small></h2>\r\nTrump further said \"We're going to take over that piece, we're going to develop it, create thousands and thousands of jobs, and it'll be something that the entire Middle East can be very proud of.\" Trump said he envisioned the US taking a “long-term ownership position” over the Gaza strip, but did not clarify under what authority the US could assume control. When asked about the legality of such a move, he did not respond directly.<small class=\"brtagPara\"> </small>\n<h2>\n<strong>Criticism of Biden and regional strategy</strong></h2>\n<small class=\"brtagPara\"> </small> Trump criticised former President Joe Biden, claiming his administration had shown incompetence in the Middle East. He said “nobody did anything for four years” in the Middle East except demonstrate incompetence.\"<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/world-news/trump-sees-long-term-us-ownership-of-gaza-doesn-t-dismiss-using-military-125020500055_1.html\" target=\"_blank\">Trump sees 'long-term' US ownership of Gaza, doesn't dismiss using military</a></strong><small class=\"brtagPara\"> </small> Earlier Trump reiterated his call for Arab nations, including Jordan and Egypt, to take in Gazans saying Palestinians there had no alternative but to abandon the Gaza strip. This time, he advocated for the permanent resettlement of Palestinians. Trump said that he might be reconsidering an independent Palestine as part of a two-state solution to the decades-long Israel-Palestinian conflict.\r\n<h2>\n<small class=\"brtagPara\"> </small></h2>\n<h2>\n<strong>Talks with Netanyahu on security and diplomacy</strong></h2>\n<small class=\"brtagPara\"> </small> Netanyahu’s visit to Washington comes two weeks into Trump’s second term. The leaders discussed eliminating Hamas, restoring peace “to a troubled region\", and maintaining the Gaza ceasefire.<small class=\"brtagPara\"> </small> Netanyahu, when asked about the US taking over Gaza, said, “I think it’s something that could change history.” “And I think it’s really worth pursuing this avenue.\"<small class=\"brtagPara\"> </small> <em>(With agency inputs)</em><br/></div>",
            "pub_date": "2025-02-05 11:10:32",
            "link": "https://www.business-standard.com/world-news/us-will-take-over-the-gaza-strip-own-it-and-develop-it-says-trump-125020500088_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500088"
        },
        {
            "title": "FBI agents sue over justice dept's effort to ID those probing Trump cases",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tFBI agents who participated in investigations related to President Donald Trump have sued over Justice Department efforts to develop a list of employees involved in those inquiries that they fear could be a precursor to mass firings.</p>\n<p>\r\n\tThe class-action complaint, filed Tuesday in federal court in Washington, seeks an immediate halt to the Justice Development's plans to compile a list of investigators who participated in probes of the Jan 6, 2021 riot at the US Capitol as well as Trump's hoarding of classified documents at his Mar-a-Lago estate.</p>\n<p>\r\n\tThe lawsuit notes that Trump on the campaign trail \"repeatedly stated that he would personify the vengeance' or the retribution, for those whom he called \"political hostages, for their actions during the Jan 6 attack.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe agents contend the very act of compiling lists of persons who worked on matters that upset Donald Trump is retaliatory in nature, intended to intimidate FBI agents and other personnel and to discourage them from reporting any future malfeasance and by Donald Trump and his agents.</p>\n<p>\r\n\tThe complaint also cites the Justice Department's firing last week of prosecutors on special counsel Jack Smith's team as proof that the effort to compile the list is rooted in a desire for retribution.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tDonald Trump has made repeated public pronouncements of his intent to exact revenge upon persons he perceives to be disloyal to him by simply executing their duties in investigating acts incited by him and persons loyal to him, the complaint says.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tWhatever the Trump administration believes about Plaintiffs' political affiliation, it clearly believes that persons who were involved in the investigation and prosecution of Jan 6 and Mar-a-Lago cases are insufficiently politically affiliated with Donald Trump to be entitled to retain their employment, it says.</p>\n<p>\r\n\tA Justice Department spokesman did not immediately return a message seeking comment.</p><p></p></div>",
            "pub_date": "2025-02-05 11:10:32",
            "link": "https://www.business-standard.com/world-news/fbi-agents-sue-over-justice-dept-s-effort-to-id-those-probing-trump-cases-125020500020_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500020"
        },
        {
            "title": "Donald Trump's proposed tariffs risk $29,000 rise in US home building costs",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Ilena Peng</strong></div>\n<small class=\"brtagPara\"> </small>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPresident Donald Trump’s tariff plans threaten to raise US home construction costs, making it even more difficult for Americans already facing a tight housing market.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump’s proposed 25 per cent tariffs on goods from Canada and Mexico, which have been delayed until at least March, along with a 10 per cent levy now in effect on products from China, could make building a typical home as much as $29,000 pricier, said David Belman, a second-generation homebuilder in Wisconsin.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA large portion of that increase — as much as $14,000 — would come from the tariff on Canada, said Belman, whose supplier receives 80 per cent of its lumber from the country. Canada, which is the US’s biggest foreign lumber supplier, has already been dealing with higher duties on its shipments that started last summer.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, tariffs on Mexico may raise costs for other materials like gypsum used in drywall, and China supplies fixtures like appliances and countertops, Belman said. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The hard part is it hurts the beginning buyer, the first-time homebuyer,” Belman said. “That’s going to reduce housing affordability, and that’s obviously something we as builders are all concerned with.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHousing inflation has remained stubbornly high month after month amid a national shortage, becoming a major issue for voters in the recent election. Higher interest rates have further pressured construction. While increases in housing prices have recently showed signs of cooling, some of Trump’s proposals including tariffs could further threaten affordability.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe inflationary risk is at odds with an executive order Trump issued on his first day in office to lower housing prices, according to the National Association of Home Builders. More than 70 per cent of US softwood lumber and gypsum imports come from Canada and Mexico, respectively, the Washington-based group said. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Tariffs on lumber and other building materials increase the cost of construction and discourage new development, and consumers end up paying for the tariffs in the form of higher home prices,” NAHB Chairman Carl Harris said in a statement. The trade association has sought an exemption for building materials.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTo be sure, lumber is one of many construction inputs. Zoltan van Heyningen, the executive director of the US Lumber Coalition, said in a Monday press release that the cost of lumber makes up about 1.3 per cent of the total cost of an average new home, and “doesn’t move the needle” on overall prices.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe idea that existing “duties or President Trump’s tariffs on unfairly traded Canadian lumber imports would cause lumber prices to dramatically increase home prices is nonsensical,” van Heyningen said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump, who has used tariff threats as a negotiation tool, on Monday agreed to delay levies against Mexico and Canada for one month. Companies across borders, though, are already reacting.<small class=\"brtagPara\"> </small>\n<div>\r\n\t\tSome Canadian lumber mills have told customers that they will raise prices by 25 per cent if tariffs are put in place, according to Russ Taylor, a forestry consultant based in British Columbia. That has US companies holding back on purchasing, hoping for short-lived tariffs or other distribution channels, said Crystal Gauvin, a senior economist at Forest Economic Advisors.</div></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tCurrent lumber inventories may only last one to two months, even with demand still weak and the US not yet in its peak building season, said Dustin Jalbert, senior economist at commodity pricing agency Fastmarkets.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“It’s not going to take long for prices to have to start moving higher here to keep the supply chain stocked,” Jalbert said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tLumber futures in Chicago slumped 4.6 per cent Tuesday on news of tariff delays, erasing gains from the previous two sessions. Shares in Canadian lumber producers have slid since November as potential tariffs add further pressure on an industry already struggling amid higher US duties. West Fraser Timber Co. ended lower in Toronto on Tuesday, while Canfor Corp. and Interfor Corp. rose.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tTrump said at the World Economic Forum last month that the US doesn’t “need their lumber because we have our own forests.” </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThose are largely concentrated in the US South, which has already been expanding production in recent years, and in the Pacific Northwest, said Rajan Parajuli, an associate professor of forest economics and policy at North Carolina State University. But timber harvesting is costly, and the current US supply chain is limited. Shipments from Europe, meanwhile, are too small to offset a loss in Canadian supplies, he said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“I don’t think overnight or even in a month, even a year, we can replace Canadian lumber coming to the US,” Parajuli said. </div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 11:05:27",
            "link": "https://www.business-standard.com/world-news/donald-trump-s-proposed-tariffs-risk-29-000-rise-in-us-home-building-costs-125020500099_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500099"
        },
        {
            "title": "US will 'take over' the Gaza strip, own it and develop it, says Trump",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>US President <a href=\"https://www.business-standard.com/about/who-is-donald-trump\" target=\"_blank\">Donald Trump</a> said on Tuesday that the US would “take over” and “own” the Gaza strip, pledging to rebuild and develop it. Speaking at a joint press conference with Israeli Prime Minister <a href=\"https://www.business-standard.com/about/who-is-benjamin-netanyahu\" target=\"_blank\">Benjamin Netanyahu</a>, Trump stated \"The US will take over the Gaza Strip, and we will do a job with it too.\" \"We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site.\"<small class=\"brtagPara\"> </small>\n<h2>\n<strong>Economic development and long-term control</strong></h2>\n<h2>\n<small class=\"brtagPara\"> </small></h2>\r\nTrump further said \"We're going to take over that piece, we're going to develop it, create thousands and thousands of jobs, and it'll be something that the entire Middle East can be very proud of.\" Trump said he envisioned the US taking a “long-term ownership position” over the Gaza strip, but did not clarify under what authority the US could assume control. When asked about the legality of such a move, he did not respond directly.<small class=\"brtagPara\"> </small>\n<h2>\n<strong>Criticism of Biden and regional strategy</strong></h2>\n<small class=\"brtagPara\"> </small> Trump criticised former President Joe Biden, claiming his administration had shown incompetence in the Middle East. He said “nobody did anything for four years” in the Middle East except demonstrate incompetence.\"<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/world-news/trump-sees-long-term-us-ownership-of-gaza-doesn-t-dismiss-using-military-125020500055_1.html\" target=\"_blank\">Trump sees 'long-term' US ownership of Gaza, doesn't dismiss using military</a></strong><small class=\"brtagPara\"> </small> Earlier Trump reiterated his call for Arab nations, including Jordan and Egypt, to take in Gazans saying Palestinians there had no alternative but to abandon the Gaza strip. This time, he advocated for the permanent resettlement of Palestinians. Trump said that he might be reconsidering an independent Palestine as part of a two-state solution to the decades-long Israel-Palestinian conflict.\r\n<h2>\n<small class=\"brtagPara\"> </small></h2>\n<h2>\n<strong>Talks with Netanyahu on security and diplomacy</strong></h2>\n<small class=\"brtagPara\"> </small> Netanyahu’s visit to Washington comes two weeks into Trump’s second term. The leaders discussed eliminating Hamas, restoring peace “to a troubled region\", and maintaining the Gaza ceasefire.<small class=\"brtagPara\"> </small> Netanyahu, when asked about the US taking over Gaza, said, “I think it’s something that could change history.” “And I think it’s really worth pursuing this avenue.\"<small class=\"brtagPara\"> </small> <em>(With agency inputs)</em><br/></div>",
            "pub_date": "2025-02-05 11:05:26",
            "link": "https://www.business-standard.com/world-news/us-will-take-over-the-gaza-strip-own-it-and-develop-it-says-trump-125020500088_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500088"
        },
        {
            "title": "Xi Jinping's careful reply to Trump tariffs shows China has more to lose",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Bloomberg News</strong></div>\n<small class=\"brtagPara\"> </small>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe first volleys in the latest US-China trade war made clear that Xi Jinping is taking a more cautious approach than during Donald Trump’s first term.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAfter the US leader gave a last-minute reprieve to both Canada and Mexico, his 10 per cent tariffs on China took effect after midnight Washington time on Tuesday. Within seconds, Beijing announced additional tariffs on roughly 80 products to take effect on Feb. 10, launched an antitrust investigation into Google, tightened export controls on critical minerals, and added two US companies to its blacklist of unreliable entities.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe swift but calculated retaliation signaled that Beijing had learned a lesson from its first trade fight with Trump, when China retaliated with tariffs on par or close to what the US imposed. This time Xi only put tariffs on $14 billion worth of American products, a sliver of what Trump targeted, while taking other measures that showed off China’s ability to inflict further pain on US companies if needed.<small class=\"brtag\"> </small>\n<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"charts\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"charts\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/05/full/1738723607-2606.png?im=Resize=(640,480)\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span></div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe shift reflects both Xi’s success at diversifying imports away from the US since Trump’s first term, as well as China’s more precarious economic situation. The Chinese leader has been relying on manufacturing and overseas sales to keep growth ticking along as he moves to burst a property bubble, all while dealing with increased deflationary pressure.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tChina is being restrained because it “has more to lose,” due to its huge trade imbalance with the US, according to Larry Hu, head of China economics at Macquarie Group Ltd. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“A full-blown tariff war is not in China’s interest,” he added. “Instead, China is likely to respond to tariffs mainly through domestic stimulus.”</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe Chinese leader’s cautious reply avoided roiling markets, which have been whipsawed in the past week by Trump’s tariff twists and turns. The Hang Seng China Enterprises Index of Chinese stocks listed in Hong Kong rebounded to gain 3.5 per cent on Tuesday, while the offshore yuan was little changed after paring earlier losses.</div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\t\tChina’s Retaliation:</h3>\n<div></div><div><blockquote class=\"blockquoteBG styleQ1\" style=\"background-color:#FFF5EB;padding:8px;overflow:hidden\">\n<ul>\n<li>\r\n\t\t\t\tENTITY LIST: Calvin Klein owner PVH Corp. and US gene sequencing company Illumina Inc.</li>\n<li>\r\n\t\t\t\tEXPORT CONTROLS: Tungsten and other critical metals used in electronic, aviation and defense industries</li>\n<li>\r\n\t\t\t\t10 per cent TARIFFS: Goods including tractors and functional vehicles</li>\n<li>\r\n\t\t\t\t15 per cent TARIFFS: Goods including coal and liquefied natural gas</li>\n<li>\r\n\t\t\t\tANTITRUST PROBE: Google</li>\n</ul>\n</blockquote></div>\n<div>\r\n\t\tThe question now is whether leaders of the world’s biggest economies can quickly reach an agreement. Trump said on Monday he will seek a deal with China, and said talks would take place shortly. He tamped that down on Tuesday after the tariffs came into effect, saying there’s no rush to speak with Xi and a call would take place at the appropriate time.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tTalks between the two leaders would offer a first glimpse of Trump’s priorities this time around. The US president has alternated tough talk on China with more dovish statements, laying out the potential contours of an agreement.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tTrump wants more balanced trade and ordered an agreement he signed in 2020, known as the Phase One deal, to be reevaluated, suggesting tariff talks with China could yet drag out for months. But he’s also seeking Xi’s help in swiftly stopping Russia’s war in Ukraine, and is pushing for China to split ownership of video app TikTok with a US company within a ticking 75-day deadline. <small class=\"brtagPara\"> </small>\n<div>\r\n\t\t\tIn a sign that a deal is front of mind, Trump wrote on his Truth Social platform hours before the US tariffs took effect that there was “great interest” in TikTok, adding a deal would “be wonderful for China.”</div></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\tTrump has previously said that Microsoft Corp. is in talks to acquire the US arm of ByteDance Ltd.’s TikTok, while Chinese officials favor a sale to the president’s billionaire adviser Elon Musk, Bloomberg News has previously reported. A deal would rescue the China-owned app from a US ban, but could put its prized algorithm in foreign hands.<small class=\"brtagPara\"> </small>\n<div>\r\n\t\t\t\tChinese officials enter talks with less bargaining room. The Asian manufacturing powerhouse exports over three times more goods to the US than it buys, according to data from China’s Customs General Administration, meaning it has fewer goods to tariff.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tSome of Beijing’s warning shots were purely symbolic, underscoring that more limited room for maneuvering. China honed its regulatory sights on Google, even though Alphabet Inc.’s search services have been unavailable in the country since 2010. There are other companies such as Musk’s electric vehicle giant Tesla Inc. and smartphone giant Apple Inc., however, that still have massive business interests in the world’s No. 2 economy.</div></div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tChinese regulators are also considering launching a probe into Intel Corp., the Financial Times reported Tuesday, citing two people familiar with the matter. Intel didn’t immediately respond to a request for comment.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\tThe shape of any future deal will hinge on what concessions China might agree to make, said Helen Qiao, chief economist for greater China for Bank of America Global Research. <small class=\"brtagPara\"> </small>\n<div>\r\n\t\t\t\t\tChina’s options range from promises to buy more American oil and gas and keeping the yuan stable to delivering on the Phase One deal, she said. “It’s probably going to be a combination of those measures that would probably help repair the relationship.” </div></div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\t\tChina’s influence over the Panama Canal — where a Hong Kong company has two of the five ports adjacent to the waterway — is a wild card that Trump could press Xi on, according to Chang Shu, chief Asia economist for Bloomberg Economics. His administration has already threatened to take back the canal if Panama doesn’t reduce China’s sway.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\t\t“China could twist the arm of CK Hutchison Holdings Ltd. to reduce its operations there,” she said, noting that was a “remote” possibility.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\t\tFor now, Beijing is striking a balancing act between looking strong while not upping the ante, according to Josef Gregory Mahoney, a professor of international relations at Shanghai’s East China Normal University. </div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t\t\t\t“We might be seeing two giants sizing each up and testing each other’s resolve while also playing to their domestic audiences before shaking hands,” he added. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 11:00:35",
            "link": "https://www.business-standard.com/world-news/xi-jinping-s-careful-reply-to-trump-tariffs-shows-china-has-more-to-lose-125020500097_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500097"
        },
        {
            "title": "US will 'take over' the Gaza strip, own it and develop it, says Trump",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>US President <a href=\"https://www.business-standard.com/about/who-is-donald-trump\" target=\"_blank\">Donald Trump</a> said on Tuesday that the US would “take over” and “own” the Gaza strip, pledging to rebuild and develop it. Speaking at a joint press conference with Israeli Prime Minister <a href=\"https://www.business-standard.com/about/who-is-benjamin-netanyahu\" target=\"_blank\">Benjamin Netanyahu</a>, Trump stated \"The US will take over the Gaza Strip, and we will do a job with it too.\" \"We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site.\"<small class=\"brtagPara\"> </small>\n<h2>\n<strong>Economic development and long-term control</strong></h2>\n<h2>\n<small class=\"brtagPara\"> </small></h2>\r\nTrump further said \"We're going to take over that piece, we're going to develop it, create thousands and thousands of jobs, and it'll be something that the entire Middle East can be very proud of.\" Trump said he envisioned the US taking a “long-term ownership position” over the Gaza strip, but did not clarify under what authority the US could assume control. When asked about the legality of such a move, he did not respond directly.<small class=\"brtagPara\"> </small>\n<h2>\n<strong>Criticism of Biden and regional strategy</strong></h2>\n<small class=\"brtagPara\"> </small> Trump criticised former President Joe Biden, claiming his administration had shown incompetence in the Middle East. He said “nobody did anything for four years” in the Middle East except demonstrate incompetence.\"<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: <a href=\"https://www.business-standard.com/world-news/trump-sees-long-term-us-ownership-of-gaza-doesn-t-dismiss-using-military-125020500055_1.html\" target=\"_blank\">Trump sees 'long-term' US ownership of Gaza, doesn't dismiss using military</a></strong><small class=\"brtagPara\"> </small> Earlier Trump reiterated his call for Arab nations, including Jordan and Egypt, to take in Gazans saying Palestinians there had no alternative but to abandon the Gaza strip. This time, he advocated for the permanent resettlement of Palestinians. Trump said that he might be reconsidering an independent Palestine as part of a two-state solution to the decades-long Israel-Palestinian conflict.\r\n<h2>\n<small class=\"brtagPara\"> </small></h2>\n<h2>\n<strong>Talks with Netanyahu on security and diplomacy</strong></h2>\n<small class=\"brtagPara\"> </small> Netanyahu’s visit to Washington comes two weeks into Trump’s second term. The leaders discussed eliminating Hamas, restoring peace “to a troubled region\", and maintaining the Gaza ceasefire.<small class=\"brtagPara\"> </small> Netanyahu, when asked about the US taking over Gaza, said, “I think it’s something that could change history.” “And I think it’s really worth pursuing this avenue.\"<small class=\"brtagPara\"> </small> <em>(With agency inputs)</em><br/></div>",
            "pub_date": "2025-02-05 11:00:34",
            "link": "https://www.business-standard.com/world-news/us-will-take-over-the-gaza-strip-own-it-and-develop-it-says-trump-125020500088_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500088"
        }
    ]
}