{
    "data": [
        {
            "title": "Dabur reduces strategic review cycle to 3 years amidst FMCG slowdown",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tHome-grown FMCG major Dabur has lowered the time of its strategic vision cycle from four years to three years aiming to create a more agile organisation amid a slowdown in the FMCG space and volatile geopolitical landscape.</p>\n<p>\r\n\tIt has engaged consulting firm McKinsey &amp; Co to refine and align its strategies for the next three years in line with the evolving dynamics, its CEO Mohit Malhotra said in an earnings call.</p>\n<p>\r\n\t\"This exercise has already begun, and we plan to conclude the same by the end of the fiscal year. This will enable us to capture emerging opportunities and navigate the future with sharper and more focused vision,\" he said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tDabur has four-year vision plans and is currently in the seventh vision cycle.</p>\n<p>\r\n\t\"Earlier we used to have a four-year vision cycle... We feel that in this volatile and heavy-headwind macroeconomic environment and FMCG not doing so well as a sector... we require a validation of our strategies through an external consultant,\" he said.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tMalhorta further said that by truncating a vision period from four years to three years, strategies can be taped up, fine-tuned, aligned, and quickly recalibrated.</p>\n<p>\r\n\t\"Four years becomes a longish period and therefore we have truncated it to three years, and it's also in line with the best practice in the industry which is also around three years,\" he said.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tMcKinsey in the vision exercise will do all the numbers, category reviews and validate all the strategies of the company, including Chyawanprash and beverages, etc.</p>\n<p>\r\n\t\"So, they will focus on that along with defining the numbers in the milestones for the next three years, and this vision exercise will dovetail into the next year budgeting cycle also for us,\" he said, adding \"at the moment, we have not linked them to our target achievement. But that is something that we will contemplate after this exercise is over.\"<small class=\"brtagPara\"> </small>\r\n\tMalhotra further noted that the external consultant will debate and question all businesses which are non-performing or even performing, which have got a right to win for Dabur.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Anything which does not have a right to win, they will be questioned and there will be a debate happening between the management and them to retain or to size down or to reduce investments... So, it will be a very strategic exercise that we are doing,\" he said.</p>\n<p>\r\n\tDabur India has reported an increase of 1.85 per cent in consolidated net profit to Rs 515.82 crore in the December quarter and its revenue from operations was up 3 per cent to Rs 3,355.25 crore in the October-December quarter.</p>\n<p>\r\n\tDabur India owns brands such as - Dabur Amla, Dabur Vatika, Dabur Chyawanprash, Dabur Honey, Honitus, Pudin Hara and Dabur Lal Tail and juice brand Real.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-04 16:30:32",
            "link": "https://www.business-standard.com/companies/news/dabur-reduces-strategic-review-cycle-to-3-years-amidst-fmcg-slowdown-125020400611_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400611"
        },
        {
            "title": "Live in Canada? How you can pay India bills directly with Canadian dollars",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tBeacon, a company redefining financial services for immigrants in Canada, has launched a new feature – India Bill Pay – allowing NRIs to directly pay bills in India using Canadian dollars from their Beacon Money account. This new service, which is now available for download on Google and iOS, marks the first of its kind and is designed specifically for the immigrant community in collaboration with Bharat Connect (BBPS) and YES BANK in India. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe India Bill Pay feature enables seamless payments to over 21,000 Indian billers, such as utilities, loans, school fees, and more. This development is expected to address long-standing pain points faced by NRIs who often struggle with paying bills in India, either for themselves or their families, due to the complexity of international payments.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTraditionally, NRIs have been limited in their ability to access India's banking systems from abroad. To pay bills in India, they often rely on maintaining NRI bank accounts or turning to family and friends for help – solutions that are inconvenient, costly, and often come with emotional strain. Beacon’s India Bill Pay service aims to eliminate these challenges by providing a one-stop, seamless platform for direct bill payments using foreign currency.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>The unique benefits of Beacon’s India Bill Pay are:</strong></div>\n<strong><small class=\"brtag\"> </small></strong>\n<ul>\n<li>\r\n\t\t100% digital KYC and onboarding process that can be completed within 10 minutes to start paying Indian bills</li>\n<li>\r\n\t\tUsers can pay over 21,000 Indian billers such as utilities, student and home loans, school fees, and hospital charges and more directly using Canadian dollars</li>\n<li>\r\n\t\tBeacon India Bill Pay can auto-fetch bill due amount and send bill reminders for hassle-free payments.</li>\n<li>\r\n\t\t100% secure and compliant with Reserve Bank of India policies, Beacon’s integration with Bharat Connect and YES BANK’s robust infrastructure ensures efficient and secure payment settlements</li>\n</ul>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPowered by YES BANK, the service ensures smooth payment processing for Indian billers under the Rupee Drawing Arrangement (RDA), a framework regulated by the Reserve Bank of India (RBI). This system facilitates structured and compliant fund transfers from overseas to India, efficiently converting foreign currency payments into Indian rupees and settling them with Indian beneficiaries, including billers on the Bharat Connect network. </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tConceptualized by the RBI, Bharat Connect provides technology solutions that simplify collections and settlements of bill payments for millions of customers and businesses across India. It ensures convenience, end-to-end encryption for security, and strict adherence to RBI regulations, connecting billers, payment providers, and customers seamlessly.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\" Leveraging the Bharat Connect model and the RDA framework, we are bridging the gap between Indian and international financial ecosystems, simplifying the process for NRIs to manage their obligations back home,\" said Ajay Rajan, Country Head – Government, Multinational and International Business, Transaction Banking and Knowledge Units, YES BANK.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNoopur Chaturvedi, CEO of NBBL, shared her excitement about the partnership: “We are pleased to partner with Beacon to extend the convenience of Bharat Connect (BBPS) to users in Canada. This collaboration reflects our commitment to offering a seamless, convenient, and reliable platform for bill payments, ensuring Indians abroad can easily manage essential services back home.”</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith the launch of India Bill Pay, Beacon marks a significant milestone in cross-border financial services. </div>\n<small class=\"brtagPara\"> </small> <small class=\"brtagPara\"> </small> <small class=\"brtagPara\"> </small> <small class=\"brtagPara\"> </small> <small class=\"brtagPara\"> </small> <small class=\"brtagPara\"> </small> <small class=\"brtagPara\"> </small></div>",
            "pub_date": "2025-02-04 16:30:31",
            "link": "https://www.business-standard.com/finance/personal-finance/live-in-canada-how-you-can-pay-india-bills-directly-with-canadian-dollars-125020400673_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400673"
        },
        {
            "title": "Nifty seen clearing first roadblock; next stop at 23,800? Key levels here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>The NSE Nifty 50 index has surged over 1 per cent in intra-day deals on Tuesday, and is now seen quoting above its super trend line on the daily scale for the first time since December 19, 2024. A close above 23,604, shall qualify as a positive breakout for the Nifty on the daily scale.<small class=\"brtagPara\"> </small> At the high point of the day so far, at 23,659, the Nifty gained 3.8 per cent from its recent low of 22,787. That apart, the Nifty 50 is seen quoting above its 20-DMA (Daily Moving Average) for the fourth straight trading session.<small class=\"brtagPara\"> </small> Technically, the Nifty is now seen clearing its first key hurdle as the index attempts a pullback from its record high of 26,277. The Nifty 50 had shed 13.3 per cent or almost 3,500 points from the peak in the last four months.<small class=\"brtagPara\"> </small> Amid the attempted recovery, the Nifty can potentially attempt a rebound towards 24,250 levels. The next key hurdle for the Nifty is placed around 23,780 levels, above which resistance can be expected around 24,020 and 24,150 levels. CLICK HERE FOR THE CHART<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/nifty-may-target-24-300-post-budget-trump-tariff-rbi-policy-key-triggers-125020101053_1.html?1738656589\" target=\"_blank\">Nifty may target 24,300 post Budget; Trump tariff, RBI policy key triggers</a></strong><small class=\"brtagPara\"> </small> The near-term bias for the Nifty is likely to remain upbeat as long as the index holds above 23,500 levels; below which the key support for the index stands at the 20-DMA (Daily Moving Average) at 23,250.<small class=\"brtagPara\"> </small> The BSE Sensex, meanwhile, is seen quoting around 78,150 levels. The BSE benchmark has gained nearly 2,900 points from its recent low at 75,267.<small class=\"brtagPara\"> </small> The quarterly Fibonacci chart suggests that sustained trade above 78,150, shall pave the way for a likely rally towards 80,000-mark, above which a test of 81,150 seems likely. Interim resistance for the Sensex can be expected around 78,635 and 79,335 levels.  In case of a dip, the BSE Sensex may seek support around 77,500 levels.<small class=\"brtagPara\"> </small><br/></div>",
            "pub_date": "2025-02-04 16:25:28",
            "link": "https://www.business-standard.com/markets/news/nifty-seen-clearing-first-roadblock-next-stop-at-23-800-key-levels-here-125020400643_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400643"
        },
        {
            "title": "Will injured Rajasthan captain Samson be available for start of IPL 2025?",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div><div>\r\n\tThe misery of India’s wicketkeeper-batter Sanju Samson does not seem to be ending anytime soon. After struggling with the bat during the T20 series against England, he is now likely to be away from cricketing action for five to six weeks after picking up a fracture in his index finger during the fifth T20 International against England in Mumbai on Sunday.<small class=\"brtagPara\"> </small> Samson received a nasty blow from English pacer—and his Rajasthan Royals teammate—Jofra Archer’s delivery but was able to continue playing after some medical attention. His presence on the field made fans believe the blow was not of a serious nature.<small class=\"brtagPara\"> </small> However, the latest media reports suggest otherwise.<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/cricket/champions-trophy/schedule\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 full schedule, match timings (IST) here</strong></a></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Ruled out of Ranji Trophy quarterfinals</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tSamson has already returned to Thiruvananthapuram and will undergo rehabilitation at the National Cricket Academy (NCA) before resuming training. According to reports, Samson’s injury would require at least five to six weeks of recovery before he could resume proper net sessions. Given this timeline, he would be unavailable for Kerala’s Ranji Trophy quarterfinal against J&amp;K in Pune from February 8-12.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Return in IPL 2025?</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tSamson’s comeback would most likely happen during the IPL, where he will once again captain Rajasthan Royals in IPL 2025.<small class=\"brtagPara\"> </small> The reports further revealed that his return to competitive cricket would depend on clearance from the NCA after completing rehabilitation, and if the timeline extends beyond initial estimates, he could also miss the early stages of IPL 2025.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/cricket/news/india-vs-england-odis-full-list-of-series-results-for-ind-vs-eng-125020400424_1.html\" target=\"_blank\">India vs England ODIs: Full list of series results for IND vs ENG</a></strong></div></div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small> <small class=\"brtagPara\"> </small>\n<div>\n<strong>The injury incident</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tSamson, who endured a disappointing series against England, sustained the injury when a third delivery from Archer, bowled at nearly 150 kmph, struck his right index finger. Despite the painful blow, he managed to hit a six and a four but later experienced severe swelling in the dugout. Medical scans later confirmed the fracture.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Underwhelming series</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tAfter a spectacular run against Bangladesh and South Africa, where he smashed three centuries in seven games, Samson struggled in the England series, managing just 51 runs in five matches. His highest score was 26 in the opening match at Eden Gardens.</div><div id=\"between_article_content_10-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Rajasthan Royals skipper faced repeated difficulties against short-pitched deliveries from Archer, Mark Wood, and Saqib Mahmood, often losing his wicket early during the Powerplay.<small class=\"brtagPara\"> </small>\n<strong>Ashwin on Samson's struggle</strong><small class=\"brtagPara\"> </small>\r\n\tFormer India spinner R Ashwin expressed concern over Sanju Samson’s form, stating that if the batter continues to struggle, his mind may begin to play tricks, leading to self-doubt and difficulty adapting. Ashwin also advised Suryakumar Yadav, who is also out of form, to adjust his approach. He mentioned that while form slumps can happen in one or two games, when a batter is being attacked in a specific way, a different approach should be adopted to counter it.<small class=\"brtagPara\"> </small>\n<small class=\"brtagPara\"> </small>\n<small class=\"brtagPara\"> </small>\n<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/cricket/champions-trophy\" target=\"_blank\"><strong>Check latest news on ICC Champions Trophy 2025 here</strong></a><small class=\"brtag\"> </small>\n<small class=\"brtagPara\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/points-table\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 points table here</strong></a></div></div><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/points-table\" target=\"_blank\"><small class=\"brtag\"> </small></a>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 16:25:28",
            "link": "https://www.business-standard.com/cricket/ipl/will-injured-rajasthan-captain-samson-be-available-for-start-of-ipl-2025-125020400446_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400446"
        },
        {
            "title": "RBI seen cutting rates for first time since May 2020, suggests poll",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tIndia's central bank is widely expected to cut interest rates for the first time in nearly five years in Governor Sanjay Malhotra's first monetary policy review on Friday, aiming to boost economic growth which is seen falling to a four-year low.</p>\n<p>\r\n\tOver 70 per cent of respondents, 45 of 62, in a Jan. 22-30 Reuters poll forecast the RBI would cut its key repo rate by 25 basis points to 6.25 per cet at the conclusion of its Feb. 5-7 meeting, while others expect it will keep rates unchanged, mostly because of above-target inflation.</p>\n<p>\r\n\tThe monetary policy review follows closely on the heels of the federal budget, where the government slashed personal tax rates to boost spending and spur growth.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"With the finance ministry still keeping the overall fiscal deficit in check, there is scope for the RBI to do more to boost the economy,\" said Shilan Shah, deputy chief emerging markets economist at Capital Economics.</p>\n<p>\r\n\t\"This strengthens our conviction that the Bank - under new leadership - will begin easing monetary policy at the conclusion of its MPC meeting on Friday,\" he added.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe government said it is likely to post a full-year fiscal deficit of 4.8% of GDP in the current year ending March and expects to improve its finances, targeting a fiscal deficit of 4.4 per cent in 2025-26.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe Indian economy is seen expanding by 6.3 per cent-6.8 per cent in the coming fiscal year after likely growing 6.4 per cent this year, its weakest in four years and sharply below the 8.2 per cent pace in fiscal 2024.</p>\n<p>\r\n\tDespite the slowdown in growth, inflation has stayed above the central bank's medium-term target of 4% for most of the past year, while the rupee has been steadily weakening, despite substantial dollar selling intervention from the RBI.</p>\n<p>\r\n\tWhile core inflation, seen as a better measure of demand driven price pressures, has been below 4 per cent, some economists believe the central bank may still need to focus on bringing down headline inflation.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"With the budget ring-fencing growth risks, the monetary policy committee could concentrate on inflation management, while taking into account external spillovers,\" said Vivek Kumar, an economist with QuantEco Research who doesn't expect a cut on Friday but expects a total 50 bps easing in H1 FY26.</p>\n<p>\r\n\t\"The RBI, meanwhile, could enhance liquidity support further as the existing liquidity deficit dilutes the MPC's 'neutral' policy stance,\" he added.</p>\n<p>\r\n\tThe RBI announced a host of measures in late January which together would infuse Rs 1.5 trillion ($17.22 billion) into the banking system, but investors are hopeful of more steps including another a cash reserve ratio reduction on Friday. </p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t </p><p></p></div>",
            "pub_date": "2025-02-04 16:20:33",
            "link": "https://www.business-standard.com/finance/news/rbi-seen-cutting-rates-for-first-time-since-may-2020-suggests-poll-125020400602_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400602"
        },
        {
            "title": "Nifty seen clearing first roadblock; next stop at 23,800? Key levels here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>The NSE Nifty 50 index has surged over 1 per cent in intra-day deals on Tuesday, and is now seen quoting above its super trend line on the daily scale for the first time since December 19, 2024. A close above 23,604, shall qualify as a positive breakout for the Nifty on the daily scale.<small class=\"brtagPara\"> </small> At the high point of the day so far, at 23,659, the Nifty gained 3.8 per cent from its recent low of 22,787. That apart, the Nifty 50 is seen quoting above its 20-DMA (Daily Moving Average) for the fourth straight trading session.<small class=\"brtagPara\"> </small> Technically, the Nifty is now seen clearing its first key hurdle as the index attempts a pullback from its record high of 26,277. The Nifty 50 had shed 13.3 per cent or almost 3,500 points from the peak in the last four months.<small class=\"brtagPara\"> </small> Amid the attempted recovery, the Nifty can potentially attempt a rebound towards 24,250 levels. The next key hurdle for the Nifty is placed around 23,780 levels, above which resistance can be expected around 24,020 and 24,150 levels. CLICK HERE FOR THE CHART<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/nifty-may-target-24-300-post-budget-trump-tariff-rbi-policy-key-triggers-125020101053_1.html?1738656589\" target=\"_blank\">Nifty may target 24,300 post Budget; Trump tariff, RBI policy key triggers</a></strong><small class=\"brtagPara\"> </small> The near-term bias for the Nifty is likely to remain upbeat as long as the index holds above 23,500 levels; below which the key support for the index stands at the 20-DMA (Daily Moving Average) at 23,250.<small class=\"brtagPara\"> </small> The BSE Sensex, meanwhile, is seen quoting around 78,150 levels. The BSE benchmark has gained nearly 2,900 points from its recent low at 75,267.<small class=\"brtagPara\"> </small> The quarterly Fibonacci chart suggests that sustained trade above 78,150, shall pave the way for a likely rally towards 80,000-mark, above which a test of 81,150 seems likely. Interim resistance for the Sensex can be expected around 78,635 and 79,335 levels.  In case of a dip, the BSE Sensex may seek support around 77,500 levels.<small class=\"brtagPara\"> </small><br/></div>",
            "pub_date": "2025-02-04 16:20:32",
            "link": "https://www.business-standard.com/markets/news/nifty-seen-clearing-first-roadblock-next-stop-at-23-800-key-levels-here-125020400643_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400643"
        },
        {
            "title": "Upcoming IPO: Indogulf Cropsciences secures green light from Sebi; details",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tCrop protection products, plant nutrients, and biologicals manufacturing company Indogulf Cropsciences is all set to go public as the company has received final observation from the capital markets regulator, <a href=\"https://www.business-standard.com/about/what-is-sebi\" target=\"_blank\">Securities and Exchange Board of India (SEBI)</a>, to raise funds through an <a href=\"https://www.business-standard.com/about/what-is-ipo\" target=\"_blank\">initial public offering (IPO)</a>.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndogulf Cropsciences had filed its IPO papers with SEBI on September 25, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/markets/ipo/indogulf-cropsciences-ltd-ipo-89824\" target=\"_blank\">Indogulf Cropsciences IPO</a> comprises a fresh issue of up to Rs 200 crore, and an offer for sale (OFS) with shareholders divesting up to 38,54,840 equity shares of face value Rs 10 apiece. The OFS consists of up to 15,40,960 equity shares by Om Prakash Aggarwal (HUF) and up to 23,13,880 equity shares by Sanjay Aggarwal (HUF). \"The price band and the minimum bid lot will be decided by our company in consultation with the BRLM,\" Indogulf Cropsciences said in its DRHP.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe equity shares offered through the IPO are proposed to be listed on the BSE and NSE.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBigshare Services serves as the registrar to the offer. Systematix Corporate Services is the sole book-running lead manager for the public offering.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The company, in consultation with the book-running lead managers, may consider a pre-IPO placement of specified securities, which shall not exceed 20 per cent of the size of the fresh issue. If such a placement is completed, the fresh issue size will be reduced,\" said the company in its Draft Red Herring Prospectus (DRHP).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company will not receive any proceeds from the OFS. According to the DRHP, the selling shareholders will be entitled to their respective portion of the proceeds from the Offer for Sale after deducting their proportion of offer expenses and relevant taxes thereon.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndogulf Cropsciences, however, intends to utilise the proceeds from the fresh issue for funding working capital requirements, and for repayment/prepayment, in full or in part, of certain outstanding borrowings availed by them. The company will further use the proceeds for capital expenditure, including setting up an in-house dry flowable (DF) plant at Barwasni, Sonipat, Haryana, as well as for general corporate purposes.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndogulf Cropsciences is engaged in the business of manufacturing crop protection products, plant nutrients, and biologicals in India. It is also one of the first indigenous manufacturers of Pyrazosulfuron Ethyl technical (Source: CareEdge Report), which commenced production in 2018. Indogulf Cropsciences began its operations in 1993 and primarily operates under three business verticals: crop protection, plant nutrients, and biologicals, catering to retail and institutional customers focused on improving crop yield.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 16:15:29",
            "link": "https://www.business-standard.com/markets/news/upcoming-ipo-indogulf-cropsciences-secures-green-light-from-sebi-details-125020400606_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400606"
        },
        {
            "title": "EC hits back at AAP: We are three-member body, not run by one person",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tAmid allegations levelled by the Aam Aadmi Party that the Election Commission is being run by CEC Rajiv Kumar, the poll panel on Tuesday hit back saying it is a three-member body which has collectively noted \"repeated deliberate pressure tactics\" to malign the poll authority in Delhi polls.</p>\n<p>\r\n\tIt said an impression is being created that the EC is a single member body.</p>\n<p>\r\n\tIn a post on X, the EC said it has decided to have constitutional restraint, absorbing such outbursts with sagacity, stoically and not to be swayed by such insinuations.<small class=\"brtag\"> </small></p>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\tThe 3-member Commission collectively noted repeated deliberate pressure tactics to malign ECI in Delhi Elections,as if it is a single member body &amp; decided to have constitutional restraint, absorbing such outbursts with sagacity, stoically &amp; not to be swayed by such insinuations</p>\r\n\t— Election Commission of India (@ECISVEEP) <a href=\"https://twitter.com/ECISVEEP/status/1886668777791635682?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 4, 2025</a></blockquote></div>\n<p>\r\n\tTop AAP leaders, including its convenor Arvind Karjiwal, have claimed that the EC has been ignoring the BJP's alleged violations of poll code.</p>\n<p>\r\n\tKejriwal had alleged that Kumar is not taking action against the BJP to bag a post-retirement assignment.</p>\n<p>\r\n\tKumar demits office on February 18 on attaining the age of 65 years.</p>\n<p>\r\n\tGyanesh Kumar and Sukhbir Singh Sandhu are the other election commissioners.</p>\n<p>\r\n\t\"The 3-member Commission collectively noted repeated deliberate pressure tactics to malign ECI in Delhi Elections,as if it is a single member body &amp; decided to have constitutional restraint, absorbing such outbursts with sagacity, stoically &amp; not to be swayed by such insinuations,\" the poll authority said in a rare reaction.</p>\n<p>\r\n\tDelhi goes to polls on Wednesday where AAP seeks to retain power and BJP trying to form the next government.</p></div>",
            "pub_date": "2025-02-04 16:15:28",
            "link": "https://www.business-standard.com/elections/delhi-elections/ec-hits-back-at-aap-we-are-three-member-body-not-run-by-one-person-125020400593_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400593"
        },
        {
            "title": "HFCL shares down 3% after posting Q3 results; PAT down 10%; revenue 2%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tHFCL shares slipped 3.2 per cent on Tuesday, logging an intraday low at Rs 98.25 per share on BSE. The selling pressure in the stock came after the company posted its Q3 results.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAround 12:59 PM, HFCL share price was down 1.51 per cent at Rs 100.01 per share on BSE. In comparison, the BSE Sensex was up 1.17 per cent at 78,091.81. The market capitalisation of the company stood at Rs 14,501.75 crore. The 52-week high of the stock was at Rs 171 per share and the 52-week low was at Rs 81.25 per share. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company released its Q3 results on Monday after market hours. HFCL reported 10 per cent decline in net profit to Rs 74 crore as compared to Rs 82.24 crore a year ago. The company's revenue for the quarter under review declined 2 per cent at Rs 1,011.95 crore as compared to Rs 1,032.31 crore a year ago. <small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/companies/results/hfcl-q3-results-pat-dips-11-95-to-rs-72-58-cr-revenue-at-rs-1-011-95-cr-125020301194_1.html\" target=\"_blank\">HFCL Q3 results: PAT dips 11.95% to Rs 72.58 cr, revenue at Rs 1,011.95 cr</a></strong></div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Despite a dynamic and challenging market environment, HFCL has demonstrated resilience with a stable quarterly performance. Our unwavering commitment to innovation and strategic growth continues to drive us forward. The recent BharatNet order wins are a testament to our expertise in strengthening India’s digital infrastructure, reinforcing our position as a trusted technology partner in the Country’s broadband revolution\" said Mahendra Nahata, managing director, HFCL.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNahata added: As we move ahead, HFCL remains focused on expanding its technological capabilities, fostering innovation, and delivering value to our stakeholders. We are confident that our strategic initiatives will create long-term sustainable growth and strengthen our leadership in the industry.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHFCL is a technology company specialising in creating digital networks for telcos, enterprises, and governments. Over the years, HFCL has emerged as a trusted partner offering sustainable high tech solutions with a commitment to provide the latest technology products to its customers. The company’s in-house reserach and development (R&amp;D) centers located at Gurgaon, Bengaluru and Hyderabad along with invested R&amp;D houses and other R&amp;D collaborators at different locations in India and abroad, innovate a futuristic range of technology products and solutions. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the past one year, HFCL shares have gained 3.3 per cent against Sensex's rise of 7.6 per cent. </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 16:10:28",
            "link": "https://www.business-standard.com/markets/news/hfcl-shares-down-3-after-company-posts-q3-results-pat-down-125020400638_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400638"
        },
        {
            "title": "Subhash Ghai buys Rs 24 cr flat in same building as Sonakshi Sinha's sale",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tBollywood director Subhash Ghai along with his wife Mukta Ghai has bought an apartment in Bandra West, Mumbai, for Rs 24 crore, according to property registration documents reviewed by Square Yards on the website of Inspector General of Registration (IGR) https://igrmaharashtra.gov.in. The transaction was registered in February 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe property bought by Ghai along with his wife is located in 81 Aureate, a project by MJ Shah Group, spread across 4.48 acres and featuring 4 BHK apartments. As per the IGR property registration documents reviewed by Square Yards, the apartment has a carpet area of 4,364 sq. ft. (405.42 sq. m.) and a built-up area of 486.69 sq. m. (~5,239 sq. ft.). It also includes three car parking spaces. The transaction incurred a stamp duty payment of Rs 1.44 crore and registration charges of Rs 30,000.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn January, actress Sonakshi Sinha sold her apartment in the same project for Rs 22.5 crore, noted Square Yards. As per the registration documents, the actress brought this apartment in March 2020 for around Rs 14 crore and sold it in January this year for Rs 22.50 crore. With this, Sinha earned a profit of around 61 per cent after the deal was finalised. According to the IGR documents reviewed by Square Yards, the apartment features a carpet area of 391.2 sq. m. (approximately 4,211 sq. ft.) and a built-up area of 430.32 sq. m. (around 4,632 sq. ft.), along with three designated parking spaces. The transaction involved a stamp duty of Rs 1.35 crore and registration fees of Rs 30,000.  Notably, Sinha owns one more apartment in 81 Aureate, as per IGR property registration records.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to Square Yards Project Data Intelligence, eight transactions amounting to a gross transaction value of Rs 76 crore were registered with IGR in 81 Aureate between February 2024 and January 2025. Currently, the average resale property price for a 4BHK in the project stands at Rs 51,636 per sq.ft. while the average monthly asking rent is Rs 8.5 lakh.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBandra’s proximity to Bandra Kurla Complex (BKC), Mumbai’s key commercial hub, makes it an attractive residential option for corporate executives and business owners seeking minimal commute times. Connectivity is a major advantage, with the Western Express Highway, Bandra-Worli Sea Link, international airport, and the upcoming metro enhancing accessibility. Bollywood stars such as Suniel Shetty, Ranveer Singh, and Deepika Padukone, Sonakshi Sinha along with sports personalities like KL Rahul and Athiya Shetty, also own properties in this neighbourhood.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSubhash Ghai is an Indian film director, producer, actor, lyricist, music director, and screenwriter known for his work in Hindi cinema. He has directed and produced several films across different genres. His notable works include Kalicharan (1976), Vishwanath (1978), Karz (1980), Hero (1983), Vidhaata (1982), Meri Jung (1985), Karma (1986), Ram Lakhan (1989), Saudagar (1991), Khalnayak (1993), Pardes (1997), and Taal (1999). His films are known for their storytelling, music, and character-driven narratives.</div></div>",
            "pub_date": "2025-02-04 16:10:28",
            "link": "https://www.business-standard.com/finance/personal-finance/bollywood-director-subhash-ghai-wife-buy-rs-24-crore-flat-in-bandra-west-125020400626_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400626"
        }
    ]
}