{
    "data": [
        {
            "title": "MoSPI to conduct migration survey from July 2026, seeks public views",
            "id": 125111302090,
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tIn a first of its kind survey on migration in nearly two decades, India's official statistical machinery is looking to gauge whether the mobility has led to an improvement in the lives of its citizens or are they mulling to move back to their previous residence.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe survey by the Ministry of Statistics and Programme Implementation will probe whether migration led to a change in income for a migrant or did it result in improvement with respect to housing, education, healthcare, basic amenities or savings. Moreover, it will also find if the migration resulted in improved peace and stability for</div></div>",
            "link": "https://www.business-standard.com/india-news/mospi-to-conduct-migration-survey-from-july-2026-seeks-public-views-125111302090_1.html",
            "image": "",
            "pub_date": "2025-11-13 15:18:29",
            "source": "business-standard",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bad loans in unsecured retail credit to peak in FY26, says S&P Global",
            "id": 125111301506,
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe bad loan formation in unsecured retail loans - personal and microfinance - in India will peak in the current financial year (FY26), showing the effect of stricter risk management practices, S&amp;P Global Ratings said on Thursday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt also flagged that global uncertainty could affect corporate capex, excluding infrastructure, and thus hurt loan growth in India. Corporate borrowing has gained momentum, but uncertain external conditions may delay private capital expenditure-related growth, it added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile India's low US trade exposure reduces tariff risks, second-order impacts such as trade redirection to India could hit a few sectors such as steel and chemicals, the rating agency warned.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe agency in its Global Banks Country-By-Country Outlook said pockets of stress have emerged in some retail segments, namely unsecured personal loans and microfinance loans, which have grown rapidly and are contributing to incremental nonperforming loans (NPLs). Stress for small and midsize enterprises (SMEs), and the commercial vehicle segment has led to a rise in early-stage delinquencies.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We believe underwriting standards for secured retail loans are healthy, and delinquencies in this segment remain manageable. Likewise, tightening regulations and stricter guardrails in microfinance should contain asset quality strains. India's sound growth prospects and falling interest rates will also support banks' asset quality,” it said.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn 2023, Reserve Bank of India (RBI) hiked the risk weights on unsecured credit, to control a sharp rise in unsecured loans. Later, the banking regulator eased the norms in 2024. The microfinance industry bodies - MFIN and Sa-dhan - have also capped the number of lenders per borrower to limit a rise in household leverage of low-income borrowers.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn bank credit offtake, S&amp;P Global said, “We expect loan growth to remain at 11-12 per cent in FY26, similar to financial year 2025 levels, with retail loans expanding the fastest.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe overall credit has grown by 11.5 per cent year-on-year (Y-o-Y) basis as of October 17, 2025 (similar to 11.5 per cent a year ago) and deposit grew by 9.5 per cent Y-o-Y (slower than 11.7 per cent a year ago), according to the RBI data.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGrowth prospects for the Indian economy remain good. India's infrastructure spending and private consumption will support robust economic growth. “We see good prospects for the economy over the next couple of years,” it added. Rating agency has pegged growth in India's Gross Domestic Product (GDP) at 6.5-7.0 per cent annually in the FY26-28 period.</div></div>",
            "link": "https://www.business-standard.com/industry/news/bad-loans-unsecured-credit-peak-fy26-sp-global-125111301506_1.html",
            "image": "",
            "pub_date": "2025-11-13 11:37:25",
            "source": "business-standard",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Air India's losses 'dragged' down net profit in H1: Singapore Airlines",
            "id": 125111302095,
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tAir India’s losses as well as lower interest income were two key reasons that “dragged” down the net profit of Singapore Airlines (SIA) Group by 67.8 per cent year-on-year (Y-o-Y) in the first half of 2025-26 (FY26), the Singaporean carrier stated on Thursday.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe SIA Group — which holds a 25.1 per cent stake in the Air India Group — reported a net loss of $239 million in H1 of FY26 as compared to $742 million in the same period of the last financial year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Despite the ongoing challenges, the SIA Group remains committed to working with its partner Tata</div></div>",
            "link": "https://www.business-standard.com/companies/news/air-india-s-losses-dragged-down-net-profit-in-h1-singapore-airlines-125111302095_1.html",
            "image": "",
            "pub_date": "2025-11-13 15:20:35",
            "source": "business-standard",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India's PVC resin imports contain carcinogens up to 5 times safety limits",
            "id": 125111302079,
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div style=\"text-align:justify\">\r\n\tIndia faces a significant public health risk from poor-quality polyvinyl chloride or PVC resin imported largely from China for irrigation projects, as it contains carcinogenic compounds at levels up to five times higher than global safety limits, a report by the Centre for Domestic Economy Policy Research (C-DEP.in) said on Thursday.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tIndia’s micro-irrigation projects — largely under Pradhan Mantri Krishi Sinchai Yojana, currently estimated at over 9.68 million hectares — rely heavily on PVC pipes, which now constitute over 50 per cent of PVC demand, Dr Jaijit Bhattacharya, president of C-DEP, said in a letter addressed to agriculture secretary Devesh Chaturvedi a few days back.</div><span style=\"display:block;height:1px\"> </span>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tThe report, meanwhile launched at IIT Delhi, revealed that imported PVC resin contains high levels of residual vinyl chloride monomer (RVCM), classified as a Category 1A carcinogen by the International Agency for Research on Cancer.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tPVC currently accounts for nearly 30 per cent of India’s economy, with widespread use in water, sanitation, irrigation, healthcare, construction and infrastructure sectors.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tThe government’s proposed Quality Control Order (QCO) on PVC resin, first notified in August 2024, has been deferred three times and is now scheduled for enforcement in December 2025, the report said.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\t“The Modi government has been championing the Zero Defect, Zero Effect by adopting Quality Control Order. Such a policy step by the government is strengthening consumer safety and industrial standards while promoting exports from India that are dependable and of high quality,” Bhattacharya said.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/industry/news/india-s-warehousing-sector-sees-absorption-rebound-on-demand-resurgence-125111302031_1.html\" target=\"_blank\">India's warehousing sector sees absorption rebound on demand resurgence</a></strong></div></div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tSpeaking at the report launch, Anil Sharma of the Swadeshi Jagran Manch said: “Quality Control Orders should not be limited to finished goods alone, it is equally or more important to cover raw materials, as the quality of a final product is only as strong as the materials that go into it,” according to a statement.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tThe C-DEP research indicates that over 39 overseas players have already procured the required BIS certification to export to India, making BIS-certified capacity 3.4 times the current domestic demand for PVC. Full enforcement of the standard, therefore, would not disrupt supply, the report states.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tCountries such as the United States, European Union and Thailand regulate RVCM levels in PVC resin within a stringent range of 0.5 parts per million (ppm) to 3 ppm, ensuring safety in water and food-contact applications.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tIndia, however, does not yet have a binding national limit on RVCM, which has allowed imports of PVC resin from China with concentrations reported between 5 ppm and 10 ppm.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\t“The Swadeshi Jagran Manch is committed to achieving a self-reliant India. We are focused on prioritising the protection of domestic industries and actively encouraging the use of indigenous products,” Sharma added.</div>\n<small class=\"brtag\"> </small></div>",
            "link": "https://www.business-standard.com/industry/news/india-s-pvc-resin-imports-contain-carcinogens-up-to-5-times-safety-limits-125111302079_1.html",
            "image": "",
            "pub_date": "2025-11-13 15:13:27",
            "source": "business-standard",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tech Wrap Nov 13: OnePlus 15 launched, iQOO 15 pre-booking, OpenAI GPT 5.1",
            "id": 125111302068,
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<a href=\"https://mybs.in/2ercxQ7\" rel=\"nofollow\" target=\"_blank\"><strong>OnePlus 15 launched in India with Snapdragon 8 Elite Gen 5, 7300mAh battery</strong></a></div>\n<div>\n<small class=\"brtag\"> </small> China’s OnePlus has introduced its latest flagship smartphone, the OnePlus 15, in India. It becomes the first device in the country to feature Qualcomm’s new Snapdragon 8 Elite Gen 5 chipset. The phone sports a triple 50MP rear camera setup powered by OnePlus’ in-house DetailMax Engine, marking a departure from the Hasselblad-tuned cameras seen on earlier models. It runs on Android 16-based OxygenOS 16 out of the box.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://mybs.in/2ercxC0\" rel=\"nofollow\" target=\"_blank\"><strong>iQOO 15 pre-booking starts Nov 20: Check exclusive offers, expected specs</strong></a></div>\n<div>\n<small class=\"brtag\"> </small> iQOO has announced that pre-bookings for its upcoming flagship, the iQOO 15, will open on November 20. Customers who pre-book will get a 12-month extended warranty and a complimentary pair of iQOO TWS 1e earbuds. The smartphone is set to launch in India on November 26. The iQOO 15 will be powered by Qualcomm’s Snapdragon 8 Elite Gen 5 processor and come with a Samsung 2K M14 OLED display.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://mybs.in/2ercx36\" rel=\"nofollow\" target=\"_blank\"><strong>OpenAI updates ChatGPT with GPT 5.1 models, new personalities</strong></a></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtag\"> </small> OpenAI has unveiled its new GPT-5.1 AI models, introducing two variants — GPT-5.1 Instant and GPT-5.1 Thinking. According to the company, the latest models offer improved capabilities and more personality. GPT-5.1 Instant is described as “warmer” and more conversational, while GPT-5.1 Thinking is designed for advanced reasoning tasks.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://mybs.in/2ercx5f\" rel=\"nofollow\" target=\"_blank\"><strong>Krafton releases BGMI 4.1 update: Check new theme, modes, characters</strong></a></div>\n<div>\n<small class=\"brtag\"> </small> Krafton India has rolled out the BGMI 4.1 update — the final update of the year — bringing new seasonal and regional additions to the popular battle royale title. The update introduces a winter theme called Frosty Funland, featuring a new Penguin Town POI (point of interest), an India-exclusive horror NPC named Anamika (the Haunted Indian Bride), and the return of Metro Royale with full season progression. It also includes new vehicles, gear, a Porsche supercar, and themed tactical items for the Erangel map.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://mybs.in/2ercxEx\" rel=\"nofollow\" target=\"_blank\"><strong>OPPO Find X9 and X9 Pro to launch in India on Nov 18: Check specifications</strong></a></div>\n<div>\n<small class=\"brtag\"> </small> Chinese smartphone manufacturer OPPO is set to launch the next generation of its Find X lineup in India on November 18. Ahead of the launch, the company has listed the specifications of both smartphones on its official website. The Find X9 series — which includes the Find X9 and Find X9 Pro — will feature the MediaTek Dimensity 9500 processor and up to 16GB of LPDDR5X RAM. The brand has not yet disclosed the pricing details for the Indian market.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://mybs.in/2ercx7R\" rel=\"nofollow\" target=\"_blank\"><strong>Google updates Gemini Live to be more expressive and natural</strong></a></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small> Google has begun rolling out a new update for its Gemini Live interface that makes voice interactions more natural and expressive. As detailed in the company’s blog, the update refines how Gemini interprets tone, rhythm, and emotion in speech. It also adds tools for more engaging conversations, allowing users to adjust Gemini’s response speed, practise new languages, prepare for discussions, generate story ideas, and even switch between accents. The update is currently rolling out on Android and iOS.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong><a href=\"https://mybs.in/2ercx35\" rel=\"nofollow\" target=\"_blank\">Google app gets Pinterest-like 'Images' tab: Check what's new, availability</a></strong></div>\n<div>\n<small class=\"brtag\"> </small> Google is introducing a new “Images” tab within the Google app, designed to help users explore and organise visual content based on their interests. According to Google’s blog, the feature makes visual discovery more intuitive — whether users are planning trips, redecorating, or choosing outfits. It aims to assist people who may not know exactly what to search for but can recognise what they’re looking for when they see it.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://mybs.in/2ercxFo\" rel=\"nofollow\" target=\"_blank\"><strong>Apple releases iOS 26.2 dev beta 2 for iPhones: What's new, how to update</strong></a></div>\n<div>\n<small class=\"brtag\"> </small> Apple has released the second developer beta of iOS 26.2 for iPhones, introducing several minor yet useful improvements across apps and system settings. As per MacRumors, iOS 26.2 developer beta 2 brings updates to the Games app, CarPlay, and Measure, along with smoother menu transitions and refined interface animations. These tweaks aim to improve usability and provide a more polished experience ahead of the public release.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://mybs.in/2ercx8p\" rel=\"nofollow\" target=\"_blank\"><strong>Samsung Galaxy Z TriFold may launch on December 5: What to expect</strong></a></div>\n<div>\n<small class=\"brtag\"> </small> Samsung is reportedly preparing to unveil its first tri-fold smartphone in early December. According to a report from 9to5Google, citing South Korean publication Chosun Daily, the Samsung Galaxy Z TriFold is expected to debut on December 5. As with previous premium launches, the company is likely to hold a dedicated event to showcase the new device.<small class=\"brtagPara\"> </small>\n<div>\n<a href=\"https://mybs.in/2ercxHN\" rel=\"nofollow\" target=\"_blank\"><strong>Valve unveils new Steam Machine, Frame VR headset and more arriving in 2026</strong></a></div></div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small>\r\n\t\tValve, the parent company of Steam, has announced three new hardware devices — the Steam Machine, Steam Frame, and Steam Controller — set to launch in Spring 2026. The Steam Machine is a hybrid PC-console device, the Steam Frame is a wireless VR headset with two controllers and a 6GHz adapter for dedicated streaming, and the Steam Controller resembles popular gamepads from Sony and Microsoft.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://mybs.in/2ercx5a\" rel=\"nofollow\" target=\"_blank\"><strong>Sandisk launches 'world's smallest' 1TB Type-C flash drive</strong></a></div>\n<div>\n<small class=\"brtag\"> </small> Sandisk has introduced a new ultra-compact USB-C flash drive named the Sandisk Extreme Fit. Marketed as a “plug-and-stay” storage option, it is small enough to remain connected to laptops without obstruction. The company claims it to be the world’s smallest 1TB USB-C flash drive, also available in 64GB, 128GB, 256GB, and 512GB variants.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://mybs.in/2ercx6i\" rel=\"nofollow\" target=\"_blank\"><strong>China tightens control on AI-generated content: What the new law says</strong></a></div>\n<div>\n<small class=\"brtag\"> </small> In response to the growing spread of fake AI-generated content, China is updating its internet safety regulations, effective January next year, according to Nikkei Asia. Initially designed to strengthen telecommunications infrastructure security, the revised law now covers AI risk management and safety supervision. The amendments were approved by the Standing Committee of the National People's Congress on October 28.</div></div>",
            "link": "https://www.business-standard.com/technology/tech-news/tech-wrap-nov-13-oneplus-15-launch-specs-iqoo-15-pre-booking-new-openai-gpt-5-1-125111302068_1.html",
            "image": "",
            "pub_date": "2025-11-13 15:13:12",
            "source": "business-standard",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Govt releases draft Seeds Bill 2025, draws flak over farmers' compensation",
            "id": 125111301629,
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Centre on Thursday released the draft Seeds Bill of 2025 that proposes to replace the decades-old Seeds Act of 1966 and the Seeds (Control) Order of 1983.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Bill proposes to set up a centralised accreditation system for granting of licences, doing away with the current provision of individual states doing the same. It focusses on traceability, entrusts the responsibility of price control to the central government, and also deregulates the power of Indian Council of Agricultural Research (ICAR) and State Agriculture Universities (SAUs) to approve variety trials.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt also proposed stiff penalties ranging from three years imprisonment to fine of ₹30 lakh for major offences, and calls for mandatory registration of all new varieties while granting deemed registration to existing ones. The licensing system of dealers has been removed.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBut, according to some critics, the draft that favours price regulation only in “emergent situation”, is silent when it comes to compensation for farmers in the event of underperformance of seeds.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to them, the draft Bill also does not have adequate legal safeguards of laws such as the Environment Protection Act (EPA) to prevent transgenic seeds from being imported and sold in India.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe draft, which is open for public comments till December 11, is the first major amendment to the burgeoning seeds sector in India in the last several years.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn official statement said that the draft Seeds Bill seeks to regulate the quality of seeds and planting materials available in the market, ensure farmers’ access to high-quality seeds at affordable rates, curb the sale of spurious and poor-quality seeds, and protect farmers from losses. It also proposes to decriminalise minor offences, thereby promoting “ease of doing business” and reducing compliance burden.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, some critics said the draft Seeds Bill does not have adequate provisions to protect the rights of seed-producing farmers (contract farmers who produce seed for companies) since all seed producers are mandatorily registered as per this statutory framework.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“At first glance, it appears that one big sticking point has been addressed, which is that the Seeds Act itself will regulate and take up price control. However, it has been limited to ‘emergent situations’ and not for all varieties of seeds registered under the proposed Act. However, the Bill continues to be anti-farmer in two ways — one, it is not having any provision for compensating farmers who incur losses due to spurious, substandard or misbranded seeds. This is quite concerning. Another is that it does not have any provisions to protect the interests of seed-producing farmers, those who work under contractual systems for seed industry players. They are often underpaid and exploited by seed companies. We will press for provisions that protect interests of both seed-producing farmers and seed-consuming farmers,” said Kavitha Kuruganti, convenor of Alliance for Sustainable and Holistic Agriculture (ASHA), a pan-Indian alliance of more than 400 organisations that have come together to secure India's “Food, Farmers, and Freedom”.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tShe said one big drawback of the draft is that while it stressed regulation of quality through pre-emptive penalties, but absence of provision of compensation to farmers in the event of underperformance or loss due to substandard seeds is simply not acceptable.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe overriding powers of the central government also needs to be understood clearly as it would mean that several state legislations become subservient to the central Act, Kavitha said.<small class=\"brtagPara\"> </small>\r\n\tMeanwhile, Ajai Rana, chairman, Federation of Seed Industry of India, and CEO and MD, Savannah Seeds, while welcoming the draft, said in a statement that initial reading indicates, particularly, a recognition system for research-based companies and enhancing ease of doing business. These measures will further streamline the sector while ensuring strong safeguards against serious violations. FSII is examining the draft in detail and will officially submit its comments by the deadline given.</div></div>",
            "link": "https://www.business-standard.com/industry/agriculture/govt-releases-draft-seeds-bill-2025-draws-flak-over-farmers-compensation-125111301629_1.html",
            "image": "",
            "pub_date": "2025-11-13 12:26:28",
            "source": "business-standard",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thomas Cook India eyes 50 million leisure travellers over next five years",
            "id": 125111302042,
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div style=\"text-align:justify\">\r\n\tWith rising disposable income among Indians, recent Goods and Services Tax (<a href=\"https://www.business-standard.com/about/what-is-goods-and-services-tax\" target=\"_blank\">GST</a>) reforms, and travel becoming a frequent habit throughout the year, travel firm Thomas Cook India anticipates a stronger travel-led momentum next year, catering to about 50 million leisure travellers over the next five years.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\t“People are now looking at travel as a necessity rather than a comfort,” Mahesh Iyer, managing director (MD) and chief executive officer (CEO), told Business Standard. “We had about 30 million travellers from India across all (travel) segments, of which 40 to 42 per cent were leisure travellers. That is about 12 million or 13 million (travellers). This number is going to be close to about 50 million over the next five years.”</div><span style=\"display:block;height:1px\"> </span>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tThis comes after 2025 faced several moments affecting the travel sentiments of people, starting from the continued effect of geopolitical issues between India and Pakistan in April, the Air India crash in Ahmedabad, Qatar bombings, and the impact of US tariffs and visas. On top of this, adverse weather conditions and the extended monsoon period in India, with the most recent incident being a blast near the Red Fort in Delhi, impacted the industry.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\n<strong>How did Thomas Cook India’s travel segments perform in Q2?</strong></div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tOverall, in the travel services segment, the company saw a seven per cent increase in sales for leisure travel in Q2 year-on-year (Y-o-Y), as per its earnings release. In the MICE (meetings, incentives, conferences and exhibitions) segment, its sales rose by two per cent in the July–September quarter Y-o-Y. Meanwhile, the corporate travel segment saw an increase of 27 per cent in turnover Y-o-Y in Q2, the release stated.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\t“While from a numbers perspective, our quarter looks a little muted, this has been a resilient quarter for us despite the headwinds and the challenges that we’ve seen across all lines of business. We expect that with all that has happened in the economy with the GST reforms and the improving consumer sentiment, we expect the principal spending to improve in the next quarter,” he noted.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tThomas Cook India’s net profit rose by 2.4 per cent to Rs 66.4 crore for the second quarter of 2025–26 (Q2FY26) on a Y-o-Y basis. The company’s revenue from operations rose by 3.5 per cent to Rs 2,073.8 crore in the July–September quarter compared with the same quarter last year.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\n<strong>What is driving Thomas Cook India’s expansion in resorts and holiday offerings?</strong></div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tFor the company, extended monsoons resulted in lower occupancies in its resorts under Sterling Holidays near forest areas. However, the company added seven new resorts in the July–September quarter. By the end of FY26, Iyer added that Thomas Cook India plans to have around 75 to 76 resorts and then scale it up to 100 resorts. Currently, it has 66 resorts. After the acquisition of Nature Trails Resorts (catering to adventure-related travel), which was a part of Sterling Holidays, the company has signed three new resorts, taking the total to six resorts in this portfolio.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tIts other income jumped by 48.6 per cent to Rs 64.5 crore in Q2FY26 on a Y-o-Y basis. Thomas Cook India’s Pbidt (profit before interest, depreciation and tax) rose by 2.8 per cent to Rs 172.7 crore for the quarter ended on September 30 Y-o-Y.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\n<strong>How is the forex and digital travel planning business shaping up?</strong></div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tIyer added that despite the RBI’s LRS data, the company’s revenue in the foreign exchange (forex) segment has been steady, with it expanding its recent partnership with Blinkit for the distribution of borderless forex cards to seven cities. In this segment, its holiday sales jumped by 13 per cent Y-o-Y in Q2, while the overseas education segment grew by 9 per cent in the quarter.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\t“We’re also seeing a clear shift towards technology-driven travel planning. We have built AI tools to help customers plan itineraries seamlessly, supported by video chat or consultant assistance. Currently, we have 22 to 23 per cent digital penetration, and we expect this to grow as customers become more comfortable with AI travel planning,” said Iyer.</div></div>",
            "link": "https://www.business-standard.com/industry/news/thomas-cook-india-50-million-leisure-travellers-forecast-125111302042_1.html",
            "image": "",
            "pub_date": "2025-11-13 14:57:44",
            "source": "business-standard",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DHL Group to invest €1 bn in India over CY26-30 for logistics expansion",
            "id": 125111301707,
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tGlobal logistics giant DHL Group will invest 1 billion euros across its business units in India between 2026 and 2030, citing the country’s favourable policies, rapid economic growth, and rising competitiveness.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTobias Meyer, chief executive officer of DHL Group, said a sizeable portion of the investment will go towards expanding the group’s warehousing footprint in India. “This is all part of our global strategy. We have refined this strategy over many years. We have four ‘bottom lines’, as we call them: we aim to be the employer of choice, the provider of choice, the investment of choice, and the green</div></div>",
            "link": "https://www.business-standard.com/industry/news/dhl-group-investment-plan-india-eur-1bn-cy26-30-125111301707_1.html",
            "image": "",
            "pub_date": "2025-11-13 13:00:37",
            "source": "business-standard",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Billionaire Ranjan Pai's Manipal Group eyes Byju's parent in insolvency bid",
            "id": 125111301911,
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tManipal Education and Medical Group (MEMG), led by billionaire Ranjan Pai, has submitted an expression of interest (EOI) to join the insolvency process of Think &amp; Learn Pvt. Ltd. (TLPL), the parent company of troubled edtech firm Byju’s.<small class=\"brtag\"> </small></div>\n<div>\r\n\tAccording to documents filed with the resolution professional (RP), MEMG India has sought to be included in the list of prospective resolution applicants (PRAs) and expressed its intent to examine the company’s financial and operational details for the purpose of evaluating a potential resolution plan. This is the second submission of EOI by MEMG after the time for such submission was extended</div></div>",
            "link": "https://www.business-standard.com/companies/news/billionaire-ranjan-pai-s-manipal-group-eyes-byju-s-parent-in-insolvency-bid-125111301911_1.html",
            "image": "",
            "pub_date": "2025-11-13 13:46:44",
            "source": "business-standard",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eicher Motors Q2 results: Profit up 24%, posts record festive sales",
            "id": 125111302063,
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div style=\"text-align:justify\">\r\n\tEicher Motors on Thursday posted that its consolidated net profit surged 24 per cent year-on-year (Y-o-Y) to Rs 1,369 crore during the second quarter of 2025-26 (Q2 FY26), driven by robust festive demand, GST rationalisation and new launches.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tThe company also clocked its highest quarterly revenue from operations at Rs 6,171 crore, up 45 per cent, supported by robust growth across both Royal Enfield and VE Commercial Vehicles (VECV).</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tDuring the quarter, Royal Enfield recorded its highest-ever quarterly motorcycle sales at 327,067 units, up 45 per cent Y-o-Y.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tSequentially, the net profit increased by 13 per cent, and the revenue from operations was also up 22 per cent in the second quarter of FY26.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tDuring an audio press conference after the release of results, B Govindarajan, managing director (MD) of Eicher Motors and chief executive officer (CEO) of Royal Enfield, said: “We have witnessed the best-ever festive season, achieving record sales of 249,000 units. The Government of India’s GST reform has further enhanced accessibility for motorcycles under 350cc, as reflected in the strong customer demand.”</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tVinod Aggarwal, MD and CEO of VECV and vice-chairman of Eicher Motors, said: “VECV delivered a solid performance in Q2 FY26, registering our best-ever second quarter in terms of truck and bus deliveries. Eicher retained its position as the market leader in light and medium-duty trucks. We continue to make steady progress in the heavy-duty trucks segment, recording our best-ever second quarter deliveries. GST rationalisation has had a positive impact on consumer confidence and consumption and will, in turn, support demand for commercial vehicles in the coming period.”</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tWhile the company believes that the recent GST reduction on motorcycles below 350cc has significantly boosted demand, the GST increase on models above 350cc has dampened momentum in that segment. This divergence could influence long-term portfolio strategy, with manufacturers likely to focus more on sub-350cc motorcycles in the domestic market if the current tax structure continues, said Govindarjan.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tThe company believes such a shift could limit India’s ability to build scale and maintain its global leadership in the 450cc and 650cc categories. Govindarajan emphasised that a uniform GST rate of 18 per cent across all motorcycle segments would not only sustain demand but also encourage greater investment and research and development (R&amp;D), enabling Indian two-wheeler makers to develop and export higher-capacity motorcycles competitively on the global stage.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tHe said that Eicher Motors, along with other two-wheeler manufacturers, is engaging with the government through industry body Siam to seek a uniform GST rate across all motorcycle categories.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\t“We are representing to government agencies to have a lower GST for 450cc and 650cc models as well. This will help increase domestic numbers, achieve scale, and strengthen India’s position in global markets,” he explained.</div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tGoing ahead, Royal Enfield remains confident about sustaining its growth momentum. “Our festive demand continues to hold up even in November. Based on inquiries, bookings and website interest, we are confident of growth in the next quarter,” Govindarajan said.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div style=\"text-align:justify\">\r\n\t </div>\n<div style=\"text-align:justify\">\r\n\tThe results were announced during market hours. Eicher’s stock marginally fell by 0.7 per cent, ending the day’s trade at Rs 6,830.8 apiece on BSE.</div></div>",
            "link": "https://www.business-standard.com/companies/news/eicher-motors-q2-results-profit-up-24-posts-record-festive-sales-125111302063_1.html",
            "image": "",
            "pub_date": "2025-11-13 15:01:02",
            "source": "business-standard",
            "kind": 1,
            "language": "en"
        }
    ]
}