{
    "data": [
        {
            "title": "Swiggy Q3 preview: Analysts expect loss to widen QoQ, revenue may rise 10%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFood delivery platform Swiggy is all set to release its <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">third quarter (Q3) results</a> for financial year 2024-25 (FY25) on Wednesday, February 5, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBrokerages tracked by Business Standard estimate the Q3 revenue of Swiggy to grow 9.9 per cent quarter-on-quarter (Q-o-Q), on an average, to Rs 3,962.85 crore as compared to Rs 3,602.95 crore in Q2FY25. The stock was listed on bourses on November 13, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, <a href=\"https://www.business-standard.com/markets/swiggy-ltd-share-price-68148.html\" target=\"_blank\">Swiggy</a> is expected to widen its net loss Q-o-Q in Q3FY25 to Rs 704.05 crore, on average, as compared to a loss of Rs 623 crore in Q2FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnalysts and investors will keep an eye on Instamart’s gross order value (GOV) and average order value (AOV) growth, dark store additions, and margins.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/news/swiggy-shares-fall-below-issue-price-stock-plunges-28-thus-far-in-january-125012800490_1.html\" target=\"_blank\">Swiggy shares fall below issue price; stock plunges 28% thus far in January</a></strong></div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h3>\r\n\tHere's how brokerages expect Swiggy to fare in Q3:</h3>\n<div>\n<strong>Motilal Oswal: </strong>The GOV for food delivery/quick commerce (FD/QC) businesses is likely to achieve 20 per cent/100 per cent year-on-year (Y-o-Y) growth, with take rates of 22 per cent/14 per cent, respectively, driving overall revenue growth of 8 per cent Q-o-Q in Q3FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA take rate is the percentage of revenue that a platform takes as a commission from each transaction facilitated on its platform.<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: </strong><a href=\"https://www.business-standard.com/markets/news/britannia-s-q3-pat-likely-to-slip-5-yoy-margins-may-contract-analysts-125020400527_1.html\" target=\"_blank\"><strong>Britannia's Q3 PAT likely to slip 5% YoY; margins may contract: Analysts</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMotilal Oswal pegs Swiggy's Q3 revenue at Rs 3,891 crore as compared to Rs 3,604.4 crore in Q2.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, analysts at Motilal Oswal anticipate food delivery's adjusted Ebitda, as a percentage of GOV, to improve 20 basis points (bps) Q-o-Q to 1.8 per cent. Instamart is projected to report a -2.2 per cent contribution margin and a -10 per cent adjusted Ebitda margin in Q3.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JM Financial:</strong> Analysts at JM Financial forecast sequential GOV growth of 3.5 per cent as compared to 19.3 per cent Y-o-Y in the food delivery business. They expect take-rates to expand to 22.3 per cent in Q3FY25 as compared to 21.9 per cent in Q2FY25. Adjusted Ebitda margin (as per cent of GOV) expansion is likely to be 40 bps sequentially.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe brokerage expects consolidated adjusted Ebitda in Q3 at Rs 431.2 crore as compared to Rs 340.3 crore in Q2. The consolidated adjusted Ebitda margin is likely at -10.7 per cent as compared to -9.5 per cent in Q2.<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/itc-q3-preview-cigarette-volume-may-remain-resilient-fmcg-biz-to-grow-6-125020400495_1.html\" target=\"_blank\">ITC Q3 preview: Cigarette volume may remain resilient; FMCG biz to grow 6%</a></strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFor Instamart, they expect sequential GOV growth of 18.2 per cent led by a robust increase of 13 per cent in order volumes. Take rates are likely to improve to 14.9 per cent in Q3 from 14.5 per cent in Q2. They see contribution margin at -3.6 per cent (as per cent of GOV) as against -1.9 per cent in Q2.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt a consolidated level, reported Ebitda/PAT are anticipated to be at a loss of Rs 673 crore/ Rs 708 crore, respectively, as against a loss of Rs 554 crore/Rs 623 crore in Q2.</div></div>",
            "pub_date": "2025-02-04 17:10:36",
            "link": "https://www.business-standard.com/markets/news/swiggy-q3-preview-analysts-expect-loss-to-widen-qoq-revenue-may-rise-10-125020400348_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400348"
        },
        {
            "title": "Six injured in attack in Israel-occupied West Bank; assailant killed",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tAt least six people were injured in a shooting attack at a checkpoint in the Israeli-occupied West Bank early Tuesday morning, according to the Israeli military and area hospitals.</p>\n<p>\r\n\tThe Israeli military said an attacker fired at soldiers at a checkpoint in the village of Tayasir, which is in the northern West Bank. In a tense exchange, soldiers returned fire and the attacker was killed, the military added.</p>\n<p>\r\n\tIsraeli hospitals said they had received a total of six people injured in the shooting attack. Israeli media reported the injured are soldiers and at least two of them were critically injured.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tHamas and the smaller Islamic Jihad militant group praised the attack but neither claimed responsibility for it.</p>\n<p>\r\n\tIsrael has carried out an extensive operation in nearby Jenin over the past weeks to clamp down on what Israel said is militant activity in the city, as soldiers and armored bulldozers have caused widespread damage and destroyed scores of homes.</p>\n<p>\r\n\tPalestinian health officials have not released a total death toll, but say Israeli fire has killed at least 20 Palestinians since the start of the raid.</p>\n<p>\r\n\tThe West Bank has seen a surge in violence since Hamas' Oct. 7, 2023, attack out of the Gaza Strip ignited the war there.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-04 17:10:34",
            "link": "https://www.business-standard.com/world-news/six-injured-in-attack-in-israel-occupied-west-bank-assailant-killed-125020400722_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400722"
        },
        {
            "title": "Asian Paints Q3 results: Profit drops 23% to ₹1,110 crore, revenue down 6%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<a href=\"https://www.business-standard.com/markets/asian-paints-ltd-share-price-34.html\" target=\"_blank\">Asian Paints</a> on Tuesday reported a 23.3 per cent drop in consolidated net profit to ₹1,110.48 crore for the <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">third quarter (Q3)</a> of the financial year 2024-25 (FY25), from ₹1,447.72 crore reported during the same period last year. Sequentially, however, profit rose nearly 60 per cent from ₹694.64 crore.<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: </strong><a href=\"https://www.business-standard.com/companies/results/mobikwik-q3-result-fy25-loss-widens-to-rs-55-2-cr-on-higher-lending-costs-125020400725_1.html?1738659761\" target=\"_blank\"><strong>MobiKwik Q3 result: FY25 loss widens to Rs 55.2 cr on higher lending costs</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tConsolidated revenue from operations also dropped marginally by 6 per cent to Rs 8,549.44 crore year-on-year from Rs 9,103.09 crore. Sequentially, revenue went up by 6.5 per cent from ₹8,027.54 crore.</div></div>",
            "pub_date": "2025-02-04 17:05:26",
            "link": "https://www.business-standard.com/companies/results/asian-paints-q3-fy25-company-results-profit-share-revenue-125020400720_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400720"
        },
        {
            "title": "MobiKwik Q3 result: FY25 loss widens to Rs 55.2 cr on higher lending costs",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFintech firm MobiKwik reported a consolidated loss of Rs 55.2 crore in the third quarter of financial year 2025 (Q3FY25) after posting a profit of Rs 5.27 crore in Q3FY24. The company’s loss widened sequentially from Rs 3.59 crore in Q2FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Gurugram-based company’s revenue from operations grew 17.7 per cent year-on-year (Y-o-Y) from Rs 228.93 crore in Q3FY24 to Rs 269.47 crore in Q3FY25. However, it declined sequentially by 7.3 per cent from Rs 290.64 crore in Q2FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe firm’s contribution margin remained muted in Q3FY25, declining from Rs 87.2 crore in Q3FY24 to Rs 73 crore in Q3FY25.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company attributed the decline to lower financial services revenue and higher lending costs due to the transition to new default loss guarantee (DLG) contracts. It said a larger portion of such costs is incurred in the initial period of a contract.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tExpenses for the fintech firm grew 43.8 per cent Y-o-Y from Rs 220.55 crore in Q3FY24 to Rs 317.14 crore in Q3FY25. Sequentially, expenses increased 10.55 per cent from Rs 286.86 crore in Q2FY25.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA major portion of the company’s expenses in Q3FY25 included payment gateway costs, which accounted for over 45 per cent of the total expenses at Rs 143.70 crore.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRevenue from financial services declined 53 per cent from Rs 155 crore in Q3FY24 to Rs 73 crore in Q3FY25. The company added that new financial products would support revenue from financial services distribution.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe firm said its small-ticket-size lending product ZIP was being scaled down due to \"lower appetite from lending partners for lower ticket-sized credit products.\"</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt added that the focus would remain on the larger-tenure ZIP EMI product for high-quality customers, in line with the lending partner strategy.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRevenue from payments more than doubled to Rs 196.5 crore in Q3FY25, up from Rs 73.9 crore in Q3FY24.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt present, the company has a registered user base of 172 million customers and 4.5 million merchants. It added 5 million new customers and 1,10,000 merchants in Q3FY25.</div>\n<small class=\"brtagPara\"> </small></div>",
            "pub_date": "2025-02-04 17:05:26",
            "link": "https://www.business-standard.com/companies/results/mobikwik-q3-result-fy25-loss-widens-to-rs-55-2-cr-on-higher-lending-costs-125020400725_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400725"
        },
        {
            "title": "Manappuram Finance rallies 5% on heavy volumes; hits over 4-month high",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tShares of Manappuram Finance hit an over 4-month high at Rs 205, as they rallied 5 per cent on the BSE in Tuesday’s intra-day trade amid heavy volumes. The stock of the non banking finance company (NBFC) was quoting at its highest level since September 27, 2024. A combined 8.78 million equity shares changed hands on the NSE and BSE till 01:55 PM.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the past three weeks, it has surged 20 per cent. In the past one month, Manappuram Finance has outperformed the market by surging 15 per cent, as compared to 0.5 per cent rise in the BSE Sensex.  </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe outperformance in the stock came after the Reserve Bank of India (RBI) on January 8 informed that the Central Bank lifted restrictions imposed on Manappuram Finance arm Asirvad Micro Finance.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"We are pleased to inform you that the Reserve Bank of India, vide its letter dated January 8, 2025, has lifted the restrictions imposed on Asirvad Micro Finance Limited with respect to sanction or disbursal of loans with immediate effect,\" the filing read. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“…having satisfied itself based on companies’ submissions, and in view of their adoption of revamped processes, systems, and the companies’ commitment to ensuring adherence to the regulatory guidelines on an ongoing basis, especially for ensuring fairness in the loan pricing, the RBI has decided to lift the afore-mentioned restrictions placed on both, Asirvad Micro Finance and DMI Finance, with immediate effect”, RBI said in a statement.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe revocation of this ban is a positive development, especially considering it occurred in less than three months, which is significantly shorter than initial base case assumption of six months. This may have been possible due to the constructive efforts made by Asirvad to work with the regulator to have the ban lifted. Additionally, given that the microfinance institution (MFI) sector itself is going through a state of turmoil, Motilal Oswal Financial Services believe the regulator has shown empathy toward the four lenders (including Asirvad) who were previously served business bans.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFor Manappuram Finance, the gold loan growth will continue to remain healthy, driven by demand-side tailwinds due to the poor availability of short-term personal and MFI loans. However, we foresee risks of spread compression in its gold loan business, as the company has started focusing on slightly higher ticket size gold loans, the brokerage firm said.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, on January 29, 2025, Smallcap World Fund, Inc acquired an additional 2.4 million equity shares or 0.28 per cent stake in Manappuram Finance through open market deals. Post acquisition, Smallcap World Fund, Inc holding in the company increased to 5.03 per cent from 4.75 per cent, according to stock exchange disclosure.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tManappuram Finance is a NBFC in India, primarily known for its gold loan business. It offers a range of financial services including gold loans, personal loans, microfinance, business loans, insurance, and foreign exchange services. The company provides quick loans against gold jewelry, catering to individuals and businesses in need of immediate liquidity without requiring extensive documentation. Manappuram is also involved in the retail sale of gold coins and bullion.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tManappuram Finance will look to continue its growth journey in the core gold and secured non-gold portfolios. The management indicated that repayments from the Vehicle/MSME/Housing portfolio are expected to improve from Q4FY25 onwards, with green shoots visible in early Q3FY25. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnalysts at Axis Securities expect Manappuram’s RoA to be capped at 4.3 per cent over FY25-26E factoring in higher credit costs, lower NIMs and increased Opex given aggressive collection efforts, before improving to ~4.6 per cent by FY27 as conditions normalise. The company will look to maintain MFI AUM growth between 15-20 per cent with the primary focus being on credit quality and credit discipline.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 17:00:39",
            "link": "https://www.business-standard.com/markets/news/manappuram-finance-rallies-5-on-heavy-volumes-hits-over-4-month-high-125020400696_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400696"
        },
        {
            "title": "Asian Paints Q3 results: Profit drops 23% to ₹1,110 crore, revenue down 6%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAsian Paints on Tuesday reported a 23.3 per cent drop in consolidated net profit to ₹1,110.48 crore for the third quarter (Q3) of the financial year 2024-25 (FY25), from ₹1,447.72 crore reported during the same period last year. Sequentially, however, profit rose nearly 60 per cent from ₹694.64 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tConsolidated revenue from operations also dropped marginally by 6 per cent to Rs 8,549.44 crore year-on-year from Rs 9,103.09 crore. Sequentially, revenue went up by 6.5 per cent from ₹8,027.54 crore.</div></div>",
            "pub_date": "2025-02-04 17:00:37",
            "link": "https://www.business-standard.com/companies/results/asian-paints-q3-fy25-company-results-profit-share-revenue-125020400720_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400720"
        },
        {
            "title": "Activist alleges Rs 88 cr 'scam' in agriculture dept under Dhananjay Munde",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tActivist Anjali Damania on Tuesday alleged a Rs 88 crore 'scam' in the agriculture department when NCP leader Dhananjay Munde held the portfolio in the previous Mahayuti coalition government in Maharashtra.</p>\n<p>\r\n\tDespite the Union government's 2016 directive to transfer money directly to farmers' bank accounts under Direct Benefit Transfer (DBT), the agriculture department purchased equipment and fertilisers for distribution to farmers at inflated rates, she claimed.</p>\n<p>\r\n\tReaction from Munde's office to the allegations was awaited. The NCP leader, now minister for Food and Civil Supplies, is already under fire over the arrest of his aide Walmik Karad in an extortion case related to the murder of sarpanch Santosh Deshmukh in Beed district.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tShiv Sena minister Sanjay Shirsat told reporters that Chief Minister Devendra Fadnavis will \"certainly take notice\" of the allegations and order an inquiry. Speaking at a press conference here, Damania presented documents related to the alleged scam.</p>\n<p>\r\n\t\"These documents are proof of how a minister siphoned off farmers' money and violated laws. As per the government resolution (GR) on DBT, all scheme-related funds were to be transferred directly to farmers' bank accounts, except for certain government entities such as Mahabeej, KVK, and MAIDC, which produce their own goods. However, this rule was disregarded,\" Damania claimed. She referred to a GR dated September 12, 2018, which listed 62 components under DBT.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tWhile the CM had the power to add new components to the DBT list, the existing components could not be removed without approval of a committee of the chief secretary, finance secretary and planning secretary, Damania said.</p>\n<p>\r\n\tJust before the Model Code of Conduct for the Lok Sabha elections came into effect, the state government issued a new GR on March 12, 2024, appointing agriculture commissioner as controlling officer for purchasing agricultural inputs, she said. Then agriculture commissioner Pravin Gedam raised concerns on March 15, 2024, stating that implementation of a purchase-based scheme was wrong, the activist claimed. Gedam pointed out that as the items being procured were not produced by Mahabeej or MAIDC, the funds should have been disbursed through DBT to farmers instead of purchasing these items, she said.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tGedam told Munde about these irregularities, but the minister advised the Director and Deputy Secretary of the Agriculture Department to proceed with the purchases, Damania alleged. Gedam's comment was not available immediately.</p>\n<p>\r\n\tOn March 15, Munde allegedly sought permission from then deputy chief minister and finance minister Ajit Pawar to issue tenders. Pawar, who heads the Nationalist Congress Party, approved the request, Damania claimed. Then Chief Minister Eknath Shinde approved the removal of certain components from the DBT list, despite not having the authority, she alleged.</p>\n<p>\r\n\tThe agriculture department under Munde was guilty of major financial irregularities in the procurement of five items, namely, nano urea, nano DAP, battery sprayers, metaldehyde, and cotton bags, the activist said. Nano urea and nano DAP, produced by IFFCO, were purchased at inflated rates. While a 500-millilitre bottle of nano urea was available for Rs 92 in the market, the agriculture department allegedly issued a tender to purchase it for Rs 220 per bottle. A total of 19,68,408 bottles were procured. Similarly, nano DAP, priced at Rs 269 per bottle in the market, was purchased for Rs 590 per bottle, Damania claimed. Battery sprayers, available in the market for Rs 2,496 apiece, were procured for Rs 3,425, she alleged.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tDamania had earlier levelled allegations against Munde regarding his alleged financial links to Walmik Karad. Opposition in Maharashtra has been demanding the minister's resignation since Karad's arrest last month.</p>\n<p>\r\n\t\"The Chief Minister (Devendra Fadnavis) will certainly take notice of the evidence provided by Damania and conduct enquiry and take action. But seeking Munde's resignation is a matter for (the consideration of) deputy CM Ajit Pawar who heads the NCP,\" said Shiv Sena leader and Social Justice Minister Sanjay Shirsat while speaking to reporters.</p><p></p></div>",
            "pub_date": "2025-02-04 16:55:28",
            "link": "https://www.business-standard.com/india-news/activist-alleges-rs-88-cr-scam-in-agriculture-dept-under-dhananjay-munde-125020400648_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400648"
        },
        {
            "title": "Delhi Assembly elections: When and where to watch exit poll results live?",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe intense campaign for the <a href=\"https://www.business-standard.com/topic/delhi-assembly-elections\" target=\"_blank\">Delhi Assembly elections</a> concluded on Monday evening, shifting focus to the polling day on February 5. The national capital is likely to witness a three-way contest among the ruling Aam Aadmi Party (AAP), the Bharatiya Janata Party (BJP), and the Congress.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tVoting on all 70 constituencies will take place in a single phase on February 5. Polling stations across all constituencies will open at 7 am and close at 6:30 pm. Exit polls, which provide early indications of voter trends, will be released after that.</div>\n<h3>\r\n\tDelhi polls: What are exit polls?</h3>\n<div>\r\n\tExit polls involve surveying voters immediately after they leave polling stations to gauge election outcomes. While they offer insights into possible results, they are not always accurate.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSeveral factors, such as sample selection, margin of error, and the honesty of respondents, influence their reliability. Despite these challenges, exit polls play a key role in shaping post-election discussions.  </div>\n<h3>\r\n\tDelhi elections 2025: When will exit poll results be announced?</h3>\n<div>\r\n\tThe Election Commission has imposed restrictions on the publication of exit polls until 6:30 pm on February 5. The results of any such polls will be made public only after this period.  </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The Commission notifies the period between 7.00 am to 6.30 pm on 05.02.2025 (Wednesday) as the period during which conducting and publishing or publicising exit poll by means of the print or electronic media or dissemination in any other manner whatsoever, the result of any exit poll in connection with the aforesaid General and bye elections, shall be prohibited,\" the Election Commission stated in a notice issued on February 3.  </div>\n<h3>\r\n\tDelhi Assembly polls: Who are the major pollsters?</h3>\n<div>\r\n\tSeveral media organisations conduct exit polls in collaboration with research agencies. Some of the prominent pollsters include:  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t- Axis My India  </div>\n<div>\r\n\t- CVoter  </div>\n<div>\r\n\t- IPSOS  </div>\n<div>\r\n\t- Jan Ki Baat  </div>\n<div>\r\n\t- Today's Chanakya  </div>\n<h3>\r\n\tDelhi elections 2025: Key constituencies and candidates</h3>\n<div>\r\n\tSome constituencies in Delhi are drawing attention due to the participation of prominent leaders.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>New Delhi constituency:</strong> AAP patron Arvind Kejriwal, BJP’s Parvesh Verma, and Congress candidate Sandeep Dixit, son of former Chief Minister Sheila Dixit, will compete for this high-profile seat.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Patparganj seat:</strong> AAP’s new entrant Avadh Ojha is contesting against BJP’s Ravinder Singh Negi, while Anil Chaudhary represents Congress.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rohini seat:</strong> In this key North-West Delhi constituency, AAP’s Pradeep Mittal is up against BJP’s sitting MLA Vijender Gupta.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Kalkaji seat:</strong> A three-way contest is expected between incumbent Delhi Chief Minister Atishi Kapoor (AAP), former BJP MP Ramesh Bidhuri, and Congress leader Alka Lamba.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Jangpura constituency:</strong> BJP’s Sardar Tarvinder Singh Marwah is set to challenge AAP’s Manish Sisodia, with Congress fielding Farhad Suri.  </div>\n<h3>\r\n\tDelhi elections 2025: A three-way battle  </h3>\n<div>\r\n\tThe 70-seat Delhi Assembly elections are crucial for AAP, which is aiming for a third consecutive term. Meanwhile, the BJP, riding high on recent victories in Haryana and Maharashtra, is looking to gain ground.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Congress, a part of the INDIA bloc along with AAP at the national level, is also vying to revive its influence in the capital, where it once dominated the political landscape.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith 699 candidates in the fray across 70 constituencies, the elections will serve as a referendum on AAP’s governance, while also shaping the future of BJP and Congress in Delhi for the next five years. The results on February 8 will determine whether AAP retains power or if BJP and Congress manage to stage a comeback.  </div>\n<h3>\r\n\tDelhi Assembly elections 2020  </h3>\n<div>\r\n\tIn the 2020 Assembly elections, the AAP secured a decisive victory, winning 62 out of 70 seats. The BJP, its closest rival, won only eight seats, while the Congress failed to win any.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAAP’s dominance was even more pronounced in 2015 when it won 67 seats, leaving BJP with just three and Congress with none.  </div>\n<h3>\r\n\tHow accurate were the exit polls in the 2020 Delhi elections?</h3>\n<div>\r\n\tDuring the 2020 elections, exit polls overwhelmingly predicted an AAP victory, with most forecasts giving the party over 50 seats.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndia Today-Axis My India projected the highest range for AAP at 59-68 seats. Meanwhile, Jan Ki Baat, NewsX-Neta, and India News Nation estimated 55 seats for AAP.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTimes Now was one of the few polls to predict a slightly closer contest, giving AAP 47 seats and BJP 23.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUltimately, the actual results closely aligned with the predictions, as AAP won 62 seats and BJP secured eight. Notably, exit polls in 2020 were more accurate compared to 2015, when predictions had significantly underestimated AAP’s landslide victory.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFor live updates and thorough coverage of exit polls, please visit <a href=\"https://www.business-standard.com\"><em>Business Standard</em></a>.</div></div>",
            "pub_date": "2025-02-04 16:55:27",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-assembly-elections-2025-exit-polls-date-time-live-aap-bjp-congress-125020400640_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400640"
        },
        {
            "title": "Delhi HC issues notice to CM Atishi on BJP leader's plea in defamation case",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe Delhi High Court on Tuesday issued notice to Delhi Chief Minister Atishi on a BJP leader's plea against the rejection of a defamation case against her over her allegations that BJP attempted to poach AAP MLAs.</p>\n<p>\r\n\t\"Issue notice to the respondent,\" said Justice Vikas Mahajan.</p>\n<p>\r\n\tThe counsel for the complainant Praveen Shankar Kapoor argued the revisional court exceeded the scope of its jurisdiction while rejecting his defamation complaint and quashing the summons issued by a magisterial court to the AAP leader to stand trial.</p>\n<p>\r\n\tHe objected to the court \"justifying\" Atishi's conduct by terming her a whistleblower and sought a direction to stay the observations.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAccording to the complaint by the former media head and spokesperson of the Delhi BJP unit, Atishi levelled baseless allegations in a press conference held on January 27 and later on April 2, 2024 against BJP by saying that it was approaching AAP's MLAs and offering them bribes to the tune of Rs 20-25 crore for switching sides.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tAtishi however moved the special judge by filing a revision petition to challenge the summons issued to her by a magisterial court.</p>\n<p>\r\n\tThe complaint had also arrayed former chief minister Arvind Kejriwal as an accused in the complaint, however, the magisterial court did not find sufficient grounds to proceed against him in the order passed on May 28, 2024.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe matter would be heard next by the high court in April. <small class=\"brtagPara\"> </small>\r\n\tOn January 28, Special Judge Vishal Gogne held that the allegations made by Atishiconstituted the exercise of the right to freedom of speech concerning political corruption and not defamation.</p>\n<p>\r\n\tThe special judge said that the pre-summoning evidence did not present adequate grounds to summon Atishi as an accused.<small class=\"brtagPara\"> </small></p><p></p></div>",
            "pub_date": "2025-02-04 16:50:25",
            "link": "https://www.business-standard.com/india-news/delhi-hc-issues-notice-to-cm-atishi-on-bjp-leader-s-plea-in-defamation-case-125020400636_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400636"
        },
        {
            "title": "Hero MotoCorp Q3 Preview: Net profit may climb up to Rs 1,130 crore YoY",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Hero MotoCorp Q3 Preview: </strong>Motorcycle and scooter maker Hero MotoCorp will announce its December quarter of financial year 2025 <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">(Q3FY25) results</a> on February 6, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHero MotoCorp is expected to report a steady performance for Q3FY25, with revenue growth driven by higher average selling prices (ASPs) rather than volume growth, analysts said. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThey also predict a slight increase in revenues across various forecasts, ranging from 3 per cent to 5 per cent year-on-year (Y-o-Y), supported by a richer product mix and the ramp-up of 125cc motorcycles. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMargins are likely to see a modest decline or slight improvement, with Ebitda and net profit growing by around 4 per cent to 5 per cent. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tKey factors to watch will include demand trends, new product launches, and the performance of different motorcycle segments, particularly the 125cc and premium offerings.<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/swiggy-q3-preview-analysts-expect-loss-to-widen-qoq-revenue-may-rise-10-125020400348_1.html\" target=\"_blank\">Swiggy Q3 preview: Analysts expect loss to widen QoQ, revenue may rise 10%</a></strong></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the bourses, at 1:50 PM, <a href=\"https://www.business-standard.com/markets/hero-motocorp-ltd-share-price-237.html\" target=\"_blank\">Hero MotoCorp share price</a> was trading 1.13 per cent lower at Rs 4,237.70. In comparison, BSE Sensex was trading 1.53 per cent higher at 78,366.85 levels.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em><strong>Given this, here’s what top brokerages expect from Hero MotoCorp in Q3 results:</strong></em></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Nomura </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNomura analysts estimate a 5 per cent Y-o-Y increase in revenue for Hero MotoCorp, with volumes remaining flat and a 5 per cent Y-o-Y rise in average selling prices (ASP). Margins are expected to decline by approximately 50bps Q-o-Q to 14 per cent. Thus, analysts predict a revenue of Rs 10,246.6 crore (up 5 per cent Y-o-Y), an Ebitda of Rs 1,434 crore (up 5 per cent Y-o-Y), and a net profit of Rs 1,117 crore (up 4 per cent Y-o-Y).</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Kotak Institutional Equities </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tKotak Institutional Equities expects a 3 per cent Y-o-Y revenue growth in 3QFY25, supported by stable volumes and a 2-3 per cent increase in ASPs due to a richer product mix, including higher sales of premium motorcycles and the Xtreme 125. Ebitda margin is projected to improve by 20bps Y-o-Y to 14.2 per cent. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThus, analysts predict a revenue of Rs 9,977.7 crore (up 2.6 per cent Y-o-Y); adjusted net profit at Rs 1,099.7 crore (up 2.5 per cent Y-o-Y), and Ebitda at Rs 1417.7 crore (up 4.1 per cent Y-o-Y).<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: </strong><a href=\"https://www.business-standard.com/markets/news/britannia-s-q3-pat-likely-to-slip-5-yoy-margins-may-contract-analysts-125020400527_1.html\" target=\"_blank\"><strong>Britannia's Q3 PAT likely to slip 5% YoY; margins may contract: Analysts</strong></a></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Nuvama </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnalysts at Nuvama expect revenue growth to be driven by higher realizations, with Ebitda margin staying flat. They highlight that demand trends and the timeline for new launches will be key factors to monitor. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNuvama forecasts a revenue of Rs 10,160.3 crore (up 4 per cent Y-o-Y), an Ebitda of Rs 1,421.6 crore (up 4 per cent Y-o-Y), and a PAT of Rs 1,129.5 crore (up 5 per cent Y-o-Y).</div></div>",
            "pub_date": "2025-02-04 16:50:25",
            "link": "https://www.business-standard.com/markets/news/hero-motocorp-q3-preview-net-profit-may-climb-up-to-rs-1-130-crore-yoy-125020400683_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400683"
        }
    ]
}