{
    "data": [
        {
            "title": "The upside of Trump's disruptions: A push for better alternatives",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tA 78-year-old man living in a white building is sending shockwaves through his own country as well as the rest of the world. In just over a fortnight since assuming office as US President, Donald Trump is packing off illegal migrants by the thousand every day, has scrapped affirmative action programmes in federal institutions, withdrawn from the Paris Climate Accord and the World Health Organization, suspended aid to developing countries, sacked thousands of federal employees, and imposed massive tariffs on trade partners (Canada and Mexico) and rivals (China). And this is just the beginning.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndia will come on his radar</div></div>",
            "pub_date": "2025-02-05 00:45:29",
            "link": "https://www.business-standard.com/opinion/columns/the-upside-of-trump-s-disruptions-a-push-for-better-alternatives-125020401652_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401652"
        },
        {
            "title": "PepsiCo records double-digit organic revenue growth in India in 2024",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tPepsiCo saw double-digit organic revenue growth in India in 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe US-headquartered food and beverage giant gained market share in the savoury snacks category in India, alongside China, Brazil, Australia, South Africa, Poland, Colombia, Guatemala, and Pakistan.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the beverages category too, the maker of 7UP held or gained share in the UK, Germany, Brazil, Australia, South Korea, India, Thailand, Poland, Pakistan, Saudi Arabia, and Vietnam in 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Our $37 billion international business (which represented approximately 40 per cent of total PepsiCo net revenue and core division operating profit in 2024) delivered 6 per cent organic revenue growth in 2024, or 9 per cent organic revenue growth on a two-year compounded basis,” PepsiCo said in its prepared management remarks after announcing its results.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndia posted a double-digit volume growth in both the convenient foods category and the beverages category.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn its outlook for 2025, the company said it will undertake initiatives to expand channel diversification and international presence to help stimulate growth.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPepsiCo offers brands like Lay’s, Kurkure, Doritos, and Quaker Oats in foods and Pepsi, Mountain Dew, and Tropicana in its beverages portfolio.</div></div>",
            "pub_date": "2025-02-05 00:45:29",
            "link": "https://www.business-standard.com/companies/news/pepsico-records-double-digit-organic-revenue-growth-in-india-in-2024-125020401653_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401653"
        },
        {
            "title": "Over 85 mn treatments availed under Ayushman Bharat-PMJAY: Govt tells RS",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tOver 8.5 crore treatments have been availed by the beneficiaries under Ayushman Bharat - Pradhan Mantri Jan Arogya Yojana (AB-PMJAY) till January 31, 2025, Union Health Minister J P Nadda told the Rajya Sabha on Tuesday.</p>\n<p>\r\n\tOut of this, approximately 42 million treatments were undertaken in government hospitals and 43 million in private, Nadda said while responding to a question.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/india-news/haryana-hospitals-ayushman-bharat-reimbursement-indian-medical-association-125012700535_1.html\" target=\"_blank\">600 Haryana hospitals to halt Ayushman Bharat services over payment delay</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tAll states and UTs across the country have on-boarded the scheme except for West Bengal and NCT of Delhi.</p>\n<p>\r\n\tThe AB-PMJAY is a flagship scheme of the government which provides health cover of Rs 5 lakh per family annually for secondary and tertiary care hospitalisation to approximately 55 crore beneficiaries corresponding to 12.37 crore families constituting economically vulnerable bottom 40 per cent of India's population.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tRecently, the scheme has been expanded to cover 6 crore senior citizens, 70 years and above, belonging to 4.5 crore families irrespective of their socio-economic status under AB-PMJAY with Vay Vandana card, Nadda said.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tUnder the scheme, in-patient healthcare services are delivered through public and private empanelled hospitals at secondary and tertiary level.</p>\n<p>\r\n\tThe scheme is implemented across the country through a three-tier model -- National Health Authority (NHA), State Health Agencies (SHAs) and District Implementation Units (DIUs) at national, state and district levels respectively.</p>\n<p>\r\n\tFor effective implementation of the scheme at state level, state governments have set up SHAs, the minister said.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThis entity is the nodal agency responsible for the implementation of AB-PMJAY in the State and is headed by a Chief Executive Officer. The CEO, SHA, is appointed by the state government.</p>\n<p>\r\n\tThe SHA can hire additional staff or an insurance company or an Implementation Support Agency (ISA) to perform required tasks for implementation of the scheme. The states and UTs have been provided with the flexibility to implement the scheme in the operational model best suited to the local conditions, Nadda said.</p>\n<p>\r\n\tAccordingly, AB-PMJAY is implemented in trust mode, insurance mode and mixed (Hybrid) mode, he said.</p>\n<p>\r\n\tCurrently, 25 states and UTs are implementing the scheme in trust mode, 7 in insurance mode and 2 states in hybrid mode, the minister said.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe AB-PMJAY currently provides free healthcare access up to Rs. 5 lakh per family per year for secondary and tertiary care hospitalization in 27 different medical specialties, he said.</p>\n<p>\r\n\tExpansion in treatment is done by inclusion of new procedures, empanelment of new hospitals, inclusion of new beneficiaries and other improvements as per requirements from time to time.</p><p></p></div>",
            "pub_date": "2025-02-05 00:40:30",
            "link": "https://www.business-standard.com/health/over-85-mn-treatments-availed-under-ayushman-bharat-pmjay-govt-tells-rs-125020401394_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401394"
        },
        {
            "title": "Increasing threshold: Ensuring more people contribute to income tax",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tThe decision, announced in the Union Budget, to change income-tax slabs and rebates such that no tax will be due on an income of ₹12 lakh and below has been widely welcomed. While the change in tax slabs and rates also means that those with higher taxes will have their burden reduced, the highlight is the fact that those earning ₹1 lakh a month in regular income — a little more for salaried workers, thanks to the standard deduction of ₹75,000 a year — will no longer be required to pay income tax. The government has presented this as a</div></div>",
            "pub_date": "2025-02-05 00:40:29",
            "link": "https://www.business-standard.com/opinion/editorial/increasing-threshold-ensuring-more-people-contribute-to-income-tax-125020401693_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401693"
        },
        {
            "title": "Becoming Bangalore: Roopa Pai's book explores the city's history, culture",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<div>\n<strong>Becoming Bangalore: Stories that Shaped a Hometown</strong></div>\n<div>\n<strong>Author: </strong>Roopa Pai</div>\n<div>\n<strong>Publisher: </strong>Hachette India</div>\n<div>\n<strong>Pages: </strong>310</div>\n<div>\n<strong>Price:</strong> ₹599</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\r\n\tAfter 12 years of living in various cities across the world, third-generation Bangalorean Roopa Pai returned to her beloved city in 2004 as a “sort of outsider.” “My laid-back city had exploded, embraced capitalism with a vengeance and made space for the tens of thousands of dreamers newly arrived at her gates,” she recalls. Over the next two decades, Ms Pai explored her hometown, leading children and adults on heritage walks around the city and state, as part of her work with BangaloreWalks, the city’s first heritage walks company that she co-founded with her husband.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a sense, she rediscovered her city by researching its history, walking its neighbourhoods, exploring its restaurants and cafes, and meeting its people. Filled with historical anecdotes and insightful observations, the essays in this collection are an outcome of this, capturing the unique essence of Bengaluru, and its evolution from being a small 16th-century settlement on a hill to the global metropolis that it is today.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOne of the first things that strikes visitors about Bengaluru is its pleasant climate through most of the year. Despite the traffic, the heart of the city has two large public parks, both of which are over 150 years old. In 1760, Hyder Ali set up Lalbagh, a botanical garden that continues to be a popular spot in the city. Then, British army officer Sir Mark Cubbon founded the Agri-horticultural Society in 1839 and Sir Richard Hieram Sankey designed Cubbon Park. Further, John Cameron, known as the father of horticulture in Karnataka, introduced apple cultivation to the city in 1887.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThrough the ages, rulers and administrators brought in expert gardeners, botanists and administrators to grow several varieties of flowers, fruit and vegetables. Not only did they plant native flora, they also imported exotic species from around the world, many of which still thrive over the centuries. In fact, it was German horticultural legend Hermann Krumbiege’s idea of “serial blossoming” that has ensured that there are always trees in bloom on Bengaluru’s streets, no matter what the season. “To this day, despite untrammelled growth and urbanisation, the city remains defiantly verdant,” writes Ms Pai.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe book brings to light several interesting facts and trivia, such as the fact that Bengaluru became one of the first cities in India and Asia to receive electric light in 1905. In 2023, the almost century-old palatial Russell Market was restored, in time for Ugadi, which marks the spring season, and is celebrated annually as New Year’s Day, in Bengaluru. “A one-stop shop for flowers, exotic ‘English’ fruits and vegetables, meat and fish to serve British homes and kitchens,” it was conceived by T B Russell, the municipal commissioner at the time. Merchant-philanthropist Sir Ismail Sait has a hospital, street and one of the city’s best-known mosques named after him, all located in the Fraser Town neighbourhood. Sait went on to establish a successful store, The English Warehouse, on St Mark’s Road, selling all kinds of goods imported from England.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPossibly two of Bengaluru’s most famous citizens are its homegrown infotech pioneer N R Narayana Murthy and his wife, bestselling-author Sudha Murty. Ms Pai dedicates a chapter to them, narrating their love story. “There is something very Bengalurean about the fact that it was books that brought the two together,” she writes. Ms Pai goes on to explain how libraries, book launches, author talks, book clubs and bookstores are all such an intrinsic part of the city’s culture. With a steady decline in reading habits across the country, it’s heartening to learn that in Bengaluru, both large chains and even independent bookstores, such as Atta Galatta, Champaca, Bahuroopi, Ankita Pustaka, Harivu Books, Lightroom and Funky Rainbow, continue to blossom.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMs Pai dedicates an entire chapter to the many sporting legends that have emerged from the city over the years, such as Rohan Bopanna, Rahul Dravid, Anil Kumble, Mahesh Bhupathi and Prakash Padukone. She also points out that Bengaluru has more Olympic-sized pools than any other Indian city. No surprise then that many of the country’s 28 Olympians, including Nisha Millet, Shikha Tandon and Rehan Poncha are natives of the city. “Bengalurean engagement with sport, whether as players, audiences, patrons, coaches, enablers, or administrators, continues to grow, aided in large part by its beloved champion sportspersons, who invest time, money and talent in their own training centres of sporting excellence across the city,” she writes.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAlong the way, Ms Pai also salutes other well-known personalities who hail from the city, such as Udipi Ramachandra Rao, Sir Mirza Ismail and Dr Rajkumar. During the course of the book, she also pays tribute to various iconic institutions in the city, such as the M Chinnaswamy Stadium, the Kanteerava Stadium, the Indian Space Research Organisation, National Aerospace Laboratories, Hindustan Aeronautics Limited, the Indian Institute of Science and the UR Rao Satellite Centre.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tKnown today as a hub for pubs, cafes and restaurants, the first outlet of Cafe Coffee Day too opened in Bengaluru in 1996. “Years later, CCD would be hailed as the pioneer of Bangalore’s booming cafe society,” writes Ms Pai. However, few people probably know that Koshy’s or Parade Cafe, founded way back in 1952, was the city’s original Indian-owned cafe. Ms Pai also discusses Bengaluru’s homegrown newspaper  <em>Deccan Herald</em>,  which was founded in 1948, relating her special relationship with the daily where she got her first byline at the age of 17. In other essays, she talks about the rising trend of board game cafes in the city, the Bangalore Press and the vibrant Bangalore Literature Festival.</div>\n<div>\n<small class=\"brtag\"> </small>\n<hr/>\n</div>\n<div>\n<em>The reviewer is a freelance writer based in New Delhi</em></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 00:35:27",
            "link": "https://www.business-standard.com/book/becoming-bangalore-roopa-pai-s-book-explores-the-city-s-history-culture-125020401640_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401640"
        },
        {
            "title": "Looking beyond Budget to fund defence: Need for ambitious restructuring",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tThe second Budget of the Modi government’s third term allocated ₹6.81 trillion to defence, marking a 9.5 per cent increase from the ₹6.21 trillion allocated in the July 2024-25 Budget. However, with an allocation of  ₹4.88 trillion, revenue expenditure—covering salaries, pensions, maintenance, repairs, and infrastructure—constitutes 71.75 per cent of the total defence budget.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe impact of the latest Budget indicates that the pension bill, which is covered under the head of revenue expenditure, witnessed a 13.8 per cent increase from ₹1.41 trillion in 2024-25 to ₹1.60 trillion in 2025-26. Pensions have generally exceeded 20 per cent or more of the</div></div>",
            "pub_date": "2025-02-05 00:35:27",
            "link": "https://www.business-standard.com/opinion/columns/looking-beyond-budget-to-fund-defence-need-for-ambitious-restructuring-125020401646_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401646"
        },
        {
            "title": "PM Narendra Modi takes 'urban naxal' jibe at Rahul Gandhi in Lok Sabha",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAlluding to Leader of Opposition Rahul Gandhi’s recent comments that the Congress was fighting not just the Sangh Parivar but the Indian State itself, Prime Minister Narendra Modi on Tuesday told the Lok Sabha that some people were openly speaking the language of urban naxals.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWithout naming the Congress leader, the PM said those who “declare war” against the Indian State have a poor understanding of the Constitution and the country’s unity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn over a 90-minute reply to the discussion on the Motion of Thanks to the President’s address, and with Delhi scheduled to vote to elect its new Assembly on Wednesday, the PM detailed his government’s schemes over the past 10 years, such as Ayushman Bharat and constructing 40 million houses, that have helped the poor and middle class save money. The ruling Aam Aadmi Party (AAP)’s campaign in Delhi has centred on how its schemes will help save up the poor and middle class families up to Rs 25,000 per month.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe PM said the current term of his government was only its third. “We have to achieve greater goals of modern and strong India. We will continue to work for many more years to realise the dream of Viksit Bharat by 2047,” Modi said. The PM said his government’s steps, including identifying non-existent beneficiaries, prevented wasteful expenditure that helped the treasury. In a reference to the controversy over the official bungalow constructed for the Delhi chief minister, Modi said the money saved was used for the welfare of the people, not to build “Sheeshmahal”.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to the Prime Minister’s Office, the PM will visit the Maha Kumbh Mela in Prayagraj on Wednesday and at around 11 am, he will take a holy dip at the Sangam.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile he did not name them directly, the PM’s speech was peppered with scathing attacks on first PM Jawaharlal Nehru’s foreign policy, urging people to read ‘JFK’s Forgotten Crises’ (a book by author Bruce Riedel published in 2015) and the “corruption” that marred Rajiv Gandhi’s tenure. Referring to Rajiv Gandhi’s tenure, Modi spoke of him as someone who did not understand the ground reality of the country and the challenges that its poor faced. He ridiculed Rajiv’s repeated references to preparing the country for the 21st Century while failing to deliver on the people’s needs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn his speech on Monday, Rahul Gandhi had spoken of how the Rajiv Gandhi-led government prepared for the computer revolution of the late 1980s, unlike the present government that, he said, has failed to prepare the country for the current technological transformation.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn further reference to the AAP and Kejriwal, the PM said “some parties are like ‘AAP-da’ (calamitous) for the future of the youth” as they promise various kinds of doles at the type of elections but never fulfil them. He said the Bharatiya Janata Party (BJP)-led National Democratic Alliance secured historic wins in Maharashtra and Haryana and delivered on its promises, such as filling government vacancies.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe PM detailed his government’s measures for the poor, farmers, youth, and women, and for the Scheduled Castes, Scheduled Tribes, and Other Backward Classes. He spoke of the Budget’s focus on creating jobs by supporting the micro, small and medium enterprises (MSME) sector, and the tax exemption announced in the budget, which has meant that the salaried class will have to pay no tax for income up to Rs 12.75 lakh.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWithout naming the Gandhi family, the PM bemoaned the “insult” to President Droupadi Murmu. In another reference to three members of the Gandhi family currently in Parliament, Modi asked whether three members of an SC or an ST family were MPs in Parliament. Currently, Rahul Gandhi and Priyanka Gandhi Vadra are MPs in the Lok Sabha and their mother, Sonia Gandhi, is an MP in the Rajya Sabha. The PM said those who entertain themselves by indulging in photo sessions done in huts of the poor will find the talk about the poor in Parliament boring. “Those who walk around with pockets in the Constitution, do they know how they forced Muslim women to live in hardship. We brought in the triple talaq law to give rights to them,” Modi said.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCriticising Rahul Gandhi’s comments made at the inauguration of the Congress’ headquarters in the national capital on December 28, Modi said: “Today some people are openly speaking the language of urban naxals. The things that urban naxals say (are being said). These people who speak the language of urban naxals, who declare war against the Indian State, can neither understand the Constitution nor about the country's unity.” At that occasion, Rahul Gandhi had said: “We are now fighting the BJP, the RSS and the Indian State itself”.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe PM said his government did not give false slogans, but delivered real development to people. “Till five decades, slogans of garibi hatao were heard and now 250 million poor have come out of poverty,\" he said.</div>\n<small class=\"brtagPara\"> </small>\n<div>\r\n\tLater, after the LS was adjourned for the day, Congress MP Priyanka Gandhi Vadra said the PM has lost his connection with the people and their needs. Congress MP Shashi Tharoor termed it an election speech.</div></div>",
            "pub_date": "2025-02-05 00:30:34",
            "link": "https://www.business-standard.com/politics/pm-narendra-modi-takes-urban-naxal-jibe-at-rahul-gandhi-in-lok-sabha-125020401707_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401707"
        },
        {
            "title": "Delhi HC refuses relief to Rashmi Saluja in Religare reappointment matter",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Delhi High Court (HC) on Friday denied relief to Rashmi Saluja, executive chairperson of Religare Enterprises (REL), in her plea against a resolution seeking to replace her with a new director at the upcoming annual general meeting (AGM) on February 7.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja, who is set to retire by rotation, argued that her appointment was for a fixed term of five years, ending 2028.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, the court noted that while she was appointed in 2023 for a five-year term, the board meeting and AGM minutes explicitly stipulated retirement by rotation.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJustice Purushaindra Kumar Kaurav said, “This clearly indicates that the understanding of the plaintiff that she is liable to retire is not something that was introduced for the first time in 2025...It is evident that the plaintiff has failed to establish a prima facie case in her favour.”</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe court further emphasised that every shareholder has the right, subject to statutory procedures, to participate in the company's affairs. “The participation is essentially to uphold the principle of corporate democracy. Shareholders must be allowed to regulate and determine the affairs of the company through general meetings, which serve as the primary forum for decision-making within a corporate entity,” the court stated.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe HC's decision clears the way for the AGM and the voting on the appointment of a new director to replace Saluja.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHer plea was opposed by four independent directors of the company and the Burman family, the largest shareholder in REL that launched an open offer to acquire an additional 26 per cent stake. The open offer, which closes on Friday, has so far received bids for only 1,668 shares.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja has offered herself for reappointment, and the outcome of the voting will be known at the AGM. The AGM, originally scheduled for December, was delayed due to legal proceedings before the Madhya Pradesh High Court. A plea filed by a non-shareholder was later dismissed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn another plea, the Delhi HC refused interim relief to minority shareholder Sapna Govind Rao who had contended that Burmans open offer undervalued the company. However, the court has directed Securities and Exchange Board of India (Sebi) to decide fast on the application for exemption filed by US entrepreneur Danny Gaekwad</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThree leading proxy firms — Stakeholders Empowerment Services, Institutional Investor Advisory Services, and InGovern Research — have recommended an 'against' vote on the resolution pertaining to Saluja's reappointment. They cited concerns over corporate governance, ESOPs, and higher remuneration.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRefuting these concerns, REL described the reports as “orchestrated and motivated” and questioned the timing of the advisory firms' reports.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company stated that matters regarding compensation practices and ESOPs were sub-judice and that any attempt to influence public opinion through “misleading analysis” was unethical.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 00:30:34",
            "link": "https://www.business-standard.com/companies/news/delhi-hc-refuses-relief-to-rashmi-saluja-in-religare-reappointment-matter-125020401469_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401469"
        },
        {
            "title": "Calcutta civil court lifts gag order on publication of 'The Dirty Dozen'",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Calcutta Alipore Civil Court has lifted its ad interim order against the circulation and publication of the book titled The Dirty Dozen.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn its order dated January 30, the court stated that the plaintiffs, including Electrosteel Casting Limited, a company registered under the Companies Act, are not “entitled to get the injunction as prayed for.” The plaintiffs had sought to halt the circulation and publication of the book, authored by business journalist Sundaresha Subramanian, who is the defendant in the case. The order does not name the defendant but identifies him as a business journalist, newsroom leader, and the author of the book.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe court ruled that the plaintiffs had “failed to establish at this prima facie stage that an actionable wrong has been committed and that the plaintiff has suffered irreparable loss and injury.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe book, published by Pan Macmillan India, another defendant in the case, examines the rise and fall of India’s 12 largest corporate defaulters.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPreviously, on July 10, 2024, the court had restrained the publishing and circulation of the book until August 8, 2024. This order has now been vacated.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The petition under Order 39, Rule 4 of the CPC is allowed on contest, and the order of ad interim injunction so allowed by this court stands vacated,” the court order stated.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 00:25:27",
            "link": "https://www.business-standard.com/india-news/calcutta-civil-court-lifts-gag-order-on-publication-of-the-dirty-dozen-125020401716_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401716"
        },
        {
            "title": "Ola founder Bhavish Aggarwal to invest Rs 2,000 crore in AI firm Krutrim",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tOla founder Bhavish Aggarwal on Tuesday announced an investment of Rs 2,000 crore in his artificial intelligence (AI) firm, Krutrim, with a commitment to invest an additional Rs 10,000 crore by next year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurthermore, he announced the launch of KritrimAI lab and said that India’s first AI unicorn has released its work to the open-source community, while publishing several technical reports. This move follows DeepSeek’s recent decision to open-source its own generative AI (GenAI) model.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith this latest investment, Krutrim has raised close to $280 million. This includes the Rs 2,000 crore (approximately $230 million), and the $50 million secured from Matrix Partners India in early 2024. According to sources, the latest funds were raised through a mix of equity and debt. The company declined to comment on the specifics of the fundraising.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn India's GenAI ecosystem, Sarvam AI is the only other player to have secured funding, raising $41 million in 2023 in a round led by Lightspeed, with participation from Peak XV Partners and Khosla Ventures. Hanooman, another firm developing small language models (SLMs), has also been exploring funding opportunities.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t In a X post, Aggarwal said: “We’ve been working on AI for a year; today we’re releasing our work to the open source community and also publishing a bunch of technical reports. Our focus is on developing AI for India -- to make AI better on Indian languages, data scarcity, cultural context, etc.”</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHe further noted that Krutrim has deployed India’s first GB200 system in partnership with Nvidia, which will be operational by March. “…and we will make it the largest supercomputer in India by end of year,” stated the founder of Ola Electric and Ola Mobility.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a separate post on January 31, Aggarwal noted that Krutrim is utilising the DeepSeek model. “India can’t be left behind in AI. @Krutrim has accelerated efforts to develop world-class AI… Our cloud now has DeepSeek models live, hosted on Indian servers. Pricing lowest in the world,” he wrote. He added that thousands of developers have already accessed DeepSeek models hosted on Krutrim’s cloud.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTuesday’s announcement of the AI lab is a milestone for Krutrim, marking the first time the company has shared its models with the open-source community. Until now, Krutrim had not disclosed details about its GenAI models.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmong the models released to the open-source community are Krutrim 2 and Krutrim 1, both large language models (LLMs). “While Krutrim 1 (India’s first LLM) was launched on January 24, it was a basic 7B model. We’re launching Krutrim 2 today as a much improved model,” said Aggarwal. The company claims that Krutrim 2 is a best-in-class LLM for Indic languages.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Krutrim-2 is a 12 billion parameters dense transformer model, built on the Mistral-NeMo architecture. Our team ensured that Krutrim-2 received comprehensive training on a rich dataset encompassing English, Indic languages (hundreds of billions of tokens), code snippets, mathematical concepts, literary works, and high quality synthetically generated content. It is natively multilingual (English and 22 Indian languages) and supports a context window of 128K tokens,” said the firm’s blog.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tKrutrim also introduced Chitrarth 1, a vision-language model built on Krutrim 1, capable of interpreting images and documents. Additionally, the firm unveiled Dhwani 1, a speech-language model designed for tasks such as speech translation, and announced Vyakhyarth 1, an art Indic Embedding model for use cases like search and retrieval-augmented generation (RAG).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAggarwal further announced the development of benchmarks to assess Indian LLM performance. “Since there was no global benchmark for Indic performance, we’ve developed ‘BharatBench,’” he said. This evaluation tool is designed to assess AI models’ effectiveness in Indian languages and cultural contexts.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhether BharatBench will gain acceptance among other Indian AI developers remains to be seen. Krutrim argued that existing benchmarks in English and Chinese, such as MMLU, ARC, and TruthfulQA, fail to capture India's linguistic and cultural nuances. \"There is a specific need for a benchmark that addresses the diversity of India,” explained the startup.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 00:25:27",
            "link": "https://www.business-standard.com/companies/news/ola-founder-bhavish-aggarwal-to-invest-rs-2-000-crore-in-ai-firm-krutrim-125020400838_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400838"
        }
    ]
}