{
    "data": [
        {
            "title": "SA20 playoffs full schedule, match time (IST), venue, live streaming",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><div>\r\n\tThe third season of South Africa’s franchise-based T20 league, <a href=\"https://www.business-standard.com/cricket/south-africa-tour-of-england-2025-129306\" target=\"_blank\">SA20 2025</a>, has entered its final stage. After 25 days of league-stage matches, the playoff stage will kick off with Qualifier 1 between MI Cape Town and Paarl Royals at St George’s Park in Gqeberha on Tuesday, February 4. MI Cape Town, who topped the points table with 35 points in 10 games, will be the favourites in the match against the second-placed Paarl Royals, who finished their league stage with 28 points. However, one of the two losses MI suffered in the group stage came against the Royals, meaning MI will not be taking this match lightly.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe winner of Qualifier 1 will qualify for the final, while the losing team will have to play the winner of the eliminator between defending champions Sunrisers Eastern Cape and Joburg Super Kings on Thursday in Qualifier 2.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>SA20 2025 playoffs: Qualified teams</strong></div>\n<ul>\n<li>\r\n\t\tMI Cape Town</li>\n<li>\r\n\t\tPaarl Royals</li>\n<li>\r\n\t\tSunrisers Eastern Cape</li>\n<li>\r\n\t\tJoburg Super Kings</li>\n</ul>\n<div>\n<strong>SA20 2025 playoffs venues</strong></div>\n<ul>\n<li>\r\n\t\tGqeberha (Qualifier 1)</li>\n<li>\r\n\t\tCenturion (Eliminator and Qualifier 2)</li>\n<li>\r\n\t\tJohannesburg (Final)</li>\n</ul>\n<div>\n<strong>SA20 2025 playoffs: Full schedule</strong><small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:675px\" width=\"674\"><colgroup><col/><col/><col/><col/><col/></colgroup><tbody><tr height=\"20\"><td height=\"20\" style=\"height:20px;width:87px;text-align:center\">\n<strong>Date</strong></td><td style=\"width:285px;text-align:center\">\n<strong>Match</strong></td><td style=\"width:155px;text-align:center\">\n<strong>Venue</strong></td><td style=\"width:84px;text-align:center\">\n<strong>Match Type</strong></td><td style=\"width:64px;text-align:center\">\n<strong>Time (IST)</strong></td></tr><tr height=\"20\"><td height=\"20\" style=\"height:20px;text-align:center\">\r\n\t\t\t\t\tFeb 04, Tue</td><td style=\"text-align:center\">\r\n\t\t\t\t\tPaarl Royals vs MI Cape Town</td><td style=\"text-align:center\">\r\n\t\t\t\t\tSt George's Park, Gqeberha</td><td style=\"text-align:center\">\r\n\t\t\t\t\tQualifier 1</td><td style=\"text-align:center\">\r\n\t\t\t\t\t09:00 PM</td></tr><tr height=\"20\"><td height=\"20\" style=\"height:20px;text-align:center\">\r\n\t\t\t\t\tFeb 05, Wed</td><td style=\"text-align:center\">\r\n\t\t\t\t\tSunrisers Eastern Cape vs Joburg Super Kings</td><td style=\"text-align:center\">\r\n\t\t\t\t\tSuperSport Park, Centurion</td><td style=\"text-align:center\">\r\n\t\t\t\t\tEliminator</td><td style=\"text-align:center\">\r\n\t\t\t\t\t09:00 PM</td></tr><tr height=\"20\"><td height=\"20\" style=\"height:20px;text-align:center\">\r\n\t\t\t\t\tFeb 06, Thu</td><td style=\"text-align:center\">\r\n\t\t\t\t\tTBC vs TBC</td><td style=\"text-align:center\">\r\n\t\t\t\t\tSuperSport Park, Centurion</td><td style=\"text-align:center\">\r\n\t\t\t\t\tQualifier 2</td><td style=\"text-align:center\">\r\n\t\t\t\t\t09:00 PM</td></tr><tr height=\"20\"><td height=\"20\" style=\"height:20px;text-align:center\">\r\n\t\t\t\t\tFeb 08, Sat</td><td style=\"text-align:center\">\r\n\t\t\t\t\tTBC vs TBC</td><td style=\"text-align:center\">\r\n\t\t\t\t\tThe Wanderers Stadium, Johannesburg</td><td style=\"text-align:center\">\r\n\t\t\t\t\tFinal</td><td style=\"text-align:center\">\r\n\t\t\t\t\t09:00 PM</td></tr></tbody></table>\n</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/cricket/news/south-africa-s-sa20-confirms-official-window-for-next-three-seasons-125020301529_1.html\" target=\"_blank\">South Africa's SA20 confirms official window for next three seasons</a></strong></div>\n</div>\n<div>\n<strong>SA20 2025 playoffs: Squads of all qualified teams</strong><small class=\"brtag\"> </small></div>\n<div>\n<strong>MI Cape Town: </strong>Sediqullah Atal, Connor Esterhuizen, Colin Ingram (c), Delano Potgieter, Chris Benjamin (wk), George Linde, Dewald Brevis, Thomas Kaber, Dane Piedt, Tristan Luus, Matthew Potts, Rassie van der Dussen, Ryan Rickelton, Reeza Hendricks, Corbin Bosch, Rashid Khan, Azmatullah Omarzai, Trent Boult, Kagiso Rabada, Nuwan Thushara</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Paarl Royals: </strong>Lhuan-dre Pretorius (wk), Mitchell Owen, Rubin Hermann, Mitchell van Buuren, Dewan Marais, Dunith Wellalage, Andile Phehlukwayo, Bjorn Fortuin (c), Mujeeb Ur Rahman, Eshan Malinga, Lungi Ngidi, Sam Hain, Keith Dudgeon, Dinesh Karthik, Dayyaan Galiem, Kwena Maphaka, David Miller, Codi Yusuf, Nqabayomzi Peter</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sunrisers Eastern Cape: </strong>Zak Crawley, David Bedingham, Tom Abell, Aiden Markram (c), Tristan Stubbs (wk), Jordan Hermann, Marco Jansen, Liam Dawson, Beyers Swanepoel, Ottneil Baartman, Richard Gleeson, Roelof van der Merwe, Craig Overton, Patrick Kruger, Okuhle Cele, Andile Simelane, Daniel Smith, Caleb Seleka, Simon Harmer</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Joburg Super Kings:</strong> Faf du Plessis (c), Devon Conway, Wihan Lubbe, Jonny Bairstow (wk), Moeen Ali, Donovan Ferreira, Evan Jones, Hardus Viljoen, Imran Tahir, Lutho Sipamla, Matheesha Pathirana, Leus du Plooy, Maheesh Theekshana, Doug Bracewell, David Wiese, Beuran Hendricks, Sibonelo Makhanya, Tabraiz Shamsi, Gerald Coetzee, JP King</div>\n<h2>\r\n\tSA20 2025 playoffs: Live streaming and telecast details</h2>\n<div>\n<strong>When will the playoff matches of SA20 2025 begin?</strong><small class=\"brtag\"> </small></div><div id=\"between_article_content_10-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tThe playoffs of SA20 2025 will begin with Qualifier 1 between MI Cape Town and Paarl Royals on Tuesday, February 4.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Who will play in the eliminator of SA20 2025?</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tTwo-time defending champions Sunrisers Eastern Cape will take on Joburg Super Kings in the eliminator of SA20 2025 on Wednesday, February 5.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>When is Qualifier 2 of SA20 2025?</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tQualifier 2 of SA20 2025 will be played between the losing team of Qualifier 1 and the winning team of the eliminator on Thursday, February 6.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>When is the final of SA20 2025?</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tThe final of SA20 2025 between the winners of Qualifier 1 and Qualifier 2 will be played on Saturday, February 8.</div><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Where to watch the live telecast of SA20 2025 playoff matches in India?</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tThe live telecast of the SA20 2025 playoff matches will be available on Star Sports Network in India.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Where to watch the live streaming of SA20 2025 playoff matches in India?</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tThe live streaming of the SA20 2025 playoff matches will be available on the Disney+ Hotstar app and website in India.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 17:25:31",
            "link": "https://www.business-standard.com/cricket/news/sa20-playoffs-full-schedule-match-time-ist-venue-live-streaming-125020400743_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400743"
        },
        {
            "title": "Why Sensex surged 1,250 pts today despite a trade war brewing in the US?",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Stock Market Rally: </strong>Benchmark indices in India climbed on Tuesday, February 4, a couple of days after the presentation of Budget 2025-26, and amid a brewing trade war in North America as President Donald Trump sets the ground for negotitations with major US trading partners. </div>\n<div>\n<small class=\"brtagPara\"> </small>\r\n\tIn the domestic market, the 30-stock <a href=\"https://www.business-standard.com/topic/bse-sensex\" target=\"_blank\">BSE Sensex</a> had climbed around 1,237 points, or 1.6 per cent, to hit an intra-day high of 78,424.26. Similarly, the NSE Nifty50 climbed 351.5 points, or 1.5 per cent, to an intra-day high of 23,712.60 from the previous close. </div>\n<div>\n<small class=\"brtag\"> </small> At 2:48 PM, the BSE Sensex was was trading at 78,394, higher by 1,207.37 points, or 1.56 per cent, while the Nifty 50 was at 23,719.85, ahead by 358.80 points, or 1.54 per cent.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small> Among the narrow market indices, the Nifty Oil &amp; Gas index was the strongest gainer, rising 2.32 per cent, followed by the Nifty PSU Bank index that was higher by 2.17 per cent.</div>\n<div>\n<small class=\"brtag\"> </small> Other notable heavyweigh indices, including Nifty Bank, Financial Services, Metal, Pharma, and Healthcare were also trading with gains of over 1 per cent, while the Nifty FMCG and Nifty Consumer Durables indices were trading lower by 0.32 per cent and 0.25 per cent, respectively.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtag\"> </small> In the broader markets, the BSE MidCap index had gained 0.92 per cent, and the BSE SmallCap was higher by 0.82 per cent.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small> According to market experts, the markets climbed on Tuesday on the back of a number of factors, primary among them were the announcements made in the budget and the postponement of the tariffs announced by President Donald Trump on Canada, and Mexico, even as China retaliated with its own tariffs on US goods imports.</div>\n<div>\n<small class=\"brtagPara\"> </small>\n<strong>Budget Boost</strong></div>\n<div>\n<small class=\"brtag\"> </small> Independent market analyst, Ambareesh Baliga said the overall budget is not bad, but people are disappointed with no growth in infra spends. \"You look at the absolute figure, that figure itself is decently large, and last  year, we could not even execute it in the infra side of things,\" he said.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small> Along similar lines, Gaurang Shah, head investment strategist of Geojit Financial Services, said it takes a few days to understand the budget. </div>\n<div>\n<small class=\"brtag\"> </small> \"It takes the two days to understand the budget, so there is nothing new. It was a knee-jerk reaction on Saturday; it was a knee-jerk reaction yesterday,\" he said.</div>\n<div>\n<small class=\"brtag\"> </small> Shah added that the capex allocation is better than what it was last time. \"You should see improvements coming in the markets,\" Shah added.</div>\n<div>\n<small class=\"brtagPara\"> </small>\r\n\tThat apart, Baliga highlighted that the changes in income tax regime announced in the budget were sentimentally positive.<small class=\"brtagPara\"> </small> \"Sentimentally that's an upside, no doubt. At least some part of that will come into consumption. You can't say 100 per cent will come into consumption, because there are other things. People may utilise that money to invest to invest, they may even put that money in the FDs, or they may use that to pay off the EMIs,\" Baliga said.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtagPara\"> </small>\n<strong>Trump's Tariff Tantrums</strong></div>\n<div>\n<small class=\"brtag\"> </small> About the risk emanating from Trump's tariff regime, Baliga said, \"When Trump announced the tariffs, it had an effect. But now what we are seeing is that it is more of a negotiation trick. The whole thing has been postponed to some extent because of the negotitations which will happen now; whether it is Mexico, Canada or even China. Because of which, we are seeing this bounce back\".</div>\n<div>\n<small class=\"brtag\"> </small> Meanwhile, Shah also credited the upside in the markets today to the tariffs imposed by the US on Mexico and Canada being postponed by a month.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small> \"Today we have an added advantage: understanding the budget more clearly, and tariffs on Mexico and Canada have been pushed back by one month. Hence the market (climbed),\" he said.</div></div>",
            "pub_date": "2025-02-04 17:25:29",
            "link": "https://www.business-standard.com/markets/news/why-sensex-surged-1-250-pts-today-despite-a-trade-war-brewing-in-the-us-125020400742_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400742"
        },
        {
            "title": "Chamunda Electricals IPO takes off; subscription soars 10x, GMP hits 22%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe initial public offering (IPO) of Chamunda Electricals, which opened for public subscription today, has received an overwhelming response from investors so far. The Rs 14.60 crore offering, available at a price band of Rs 47-50 per share with a lot size of 3,000 shares, has been oversubscribed by 10 times as of 2:30 PM on Tuesday, February 4, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe strong demand for this SME IPO is also reflected in the grey market, where the company's shares are commanding a strong premium. Sources tracking grey market activities revealed that Chamunda Electricals unlisted shares were trading at around Rs 61 apiece, indicating a grey market premium (GMP) of Rs 11 or 22 per cent over the upper end of the IPO price band.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChamunda Electricals IPO comprises a fresh issue of 29,19,000 equity shares and will remain open for public subscription until Thursday, February 6, 2025. Investors can bid for a minimum of 3,000 shares and in multiples thereof. A retail investor requires a minimum of Rs 1,50,000 to bid for one lot (3,000 shares), whereas high-net-worth individuals (HNIs) need to bid for at least two lots (6,000 shares), amounting to Rs 3,00,000.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe basis of allotment for Chamunda Electricals IPO shares is tentatively scheduled to be finalised on Friday, February 7, 2025. Successful allottees will receive their shares by Monday, February 10, 2025.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tShares of Chamunda Electricals are expected to be listed on the NSE SME platform tentatively by Tuesday, February 11, 2025.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAhead of the public issue, Chamunda Electricals announced that it had raised Rs 4.11 crore from anchor investors through a bidding process that concluded on February 3, 2025. Kfin Technologies is the registrar for the issue, while GYR Capital Advisors is acting as the book-running lead manager.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to its Red Herring Prospectus (RHP), the company plans to utilise the IPO proceeds for capital expenditure, including the purchase of new testing kits and equipment, funding working capital requirements, repayment of term loans and cash credit, general corporate purposes, and issue-related expenses.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChamunda Electricals is engaged in providing specialized services, including the operation and maintenance of substations up to 66 KV, testing and commissioning of electrical substations up to 220 KV, and managing a 1.5 MW solar power generation park. The company’s scope of work also includes the erection of Extra High Voltage (EHV) class equipment, structures, earthing, control cable works, and other associated services for substations up to 220 KV (D Class).</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 17:20:26",
            "link": "https://www.business-standard.com/markets/news/chamunda-electricals-ipo-takes-off-subscription-soars-10x-gmp-hits-22-125020400759_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400759"
        },
        {
            "title": "Microfin ordinance sent to K'taka Guv, gives up to 10 yr jail for violation",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tAimed at protecting borrowers from harassment by microfinance institutions (MFIs), the Karnataka government has drafted an ordinance, with penal provisions, including a jail term up to ten years, and fine as high as Rs five lakh for violation.</p>\n<p>\r\n\tConfirming this, State Home Minister G Parameshwara on Tuesday said, the Karnataka Micro Finance (Prevention of Coercive Actions) Ordinance 2025 has been sent to Governor Thaawarchand Gehlot for his assent.</p>\n<p>\r\n\t\"It was three years (in initial draft), now we have increased it. Fine has also been increased to five lakh. This is to ensure that the heat of the law is felt (by violators). If a law is made with perfunctoriness just like that, such incidents won't stop. Hence, the fine (amount) and imprisonment (period) has been increased, so that it in a way, becomes a deterrent,\" Parameshwara said, responding to a question about punishment being increased to ten years imprisonment.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tSpeaking to reporters here, he said, \"The Governor was out of town, and once he is back he may give an assent after looking at it.\"<small class=\"brtagPara\"> </small>\r\n\tThe government decided on promulgating the ordinance, in response to a spate of suicides and multiple complaints from various parts of the state against predatory loan recovery methods by microfinance firms.</p>\n<p>\r\n\tResponding to a question, the home minister said, after the first draft of the ordinance was prepared, it was discussed in the government about MFI going to court against it, and the chief minister had instructed the Law department to take all the necessary precautions in this regard.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"This caused a slight delay. Now keeping everything in mind, a draft has now been prepared...,\" he added.</p><p></p></div>",
            "pub_date": "2025-02-04 17:20:25",
            "link": "https://www.business-standard.com/india-news/microfin-ordinance-sent-to-k-taka-guv-gives-up-to-10-yr-jail-for-violation-125020400652_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400652"
        },
        {
            "title": "SMPP, Brigade Hotel among 8 companies to get Sebi nod to float IPOs",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tAs many as eight firms including defence equipment manufacturer SMPP, Brigade Hotel and PVC blend-based building material maker Kumar Arch Tech have received Sebi's go ahead to raise over Rs 6,500 crore through initial public offerings (IPOs).</p>\n<p>\r\n\tOther companies that have received Sebi's approval include Solarworld Energy Solutions, Indogulf Cropsciences, Globe Civil Projects, and Prostarm Info Systems, an update with the markets regulator showed on Tuesday.</p>\n<p>\r\n\tTogether, these firms aim to raise more than Rs 6,500 crore.</p>\n<p>\r\n\tSebi received preliminary IPO documents from these firms between October and November, and issued its observations during January 28-31, the update showed.</p>\n<p>\r\n\tIn Sebi's parlance, obtaining the observations means its go ahead to float the public issue.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tMeanwhile, auto component maker Viney Corporation withdrew its draft IPO papers on January 27 without giving a reason. The preliminary documents were filed in October.</p>\n<p>\r\n\tAs for SMPP Ltd, its Rs 4,000-crore IPO includes a fresh issue of equity shares worth up to Rs 580 crore and an offer-for-sale (OFS) of shares worth up to Rs 3,420 crore by promoter Shiv Chand Kansal, according to the draft papers. At present, Kansal holds a 50 per cent stake in the company.</p>\n<p>\r\n\tProceeds from the fresh issue will be utilised primarily for capital expenditure of Rs 437.04 crore, which includes constructing buildings, land development, and procuring plant and machinery for a planned ammunition manufacturing facility through an investment in a subsidiary. The remaining amount will be allocated for general corporate purposes.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tBrigade Hotel Ventures is looking to raise Rs 900 crore through a fresh issue of equity shares.</p>\n<p>\r\n\tProceeds from the issue to the tune of Rs 481 crore will go towards payment of debt, Rs 412 crore will be allocated to the company and Rs 69 crore to its material subsidiary, SRP Prosperita Hotel Ventures Ltd.</p>\n<p>\r\n\tAdditionally, Rs 107.52 crore will be used to purchase an undivided share of land from the promoter, BEL, and the remaining funds will support acquisitions, other strategic initiatives, and general corporate purposes.</p>\n<p>\r\n\tKumar Arch Tech's IPO is a mix of fresh issuance of shares worth Rs 240 crore, and an OFS of Rs 500 crore by promoters.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tProceeds from the fresh issue to the tune of Rs 182.09 crore will be used for investment in subsidiary Taylias Industry Pvt Ltd for financing its capital expenditure requirements for the greenfield project.</p>\n<p>\r\n\tSolarworld Energy Solutions IPO consisted of a fresh issuance of equity shares worth Rs 550 crore and an OFS of Rs 50 crore.</p>\n<p>\r\n\tIndogulf Cropsciences is aiming to raise Rs 200 crore through fresh issues of shares. Besides, there will be an OFS of up to 38.55 lakh equity shares by selling shareholders. If the placement is completed, the fresh issue size will be reduced.</p>\n<p>\r\n\tThe Delhi-based company plans to use proceeds from the fresh issue to support working capital requirements, payment of debt, setting up an in-house dry flowable plant at Barwasni in Haryana; and for general corporate purposes.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe IPO of Globe Civil Projects is entirely a fresh issue of 1.9 crore equity shares with no OFS component. The company would utilise the IPO proceeds for funding working capital requirements, purchase of equipment, and for general corporate purposes.</p>\n<p>\r\n\tPower solutions products manufacturing company Prostarm Info Systems' IPO will be an entirely fresh issue of 1.6 crore equity shares.</p>\n<p>\r\n\tThe Maharashtra-based company plans to utilise funds for working capital requirements, repaying debt, acquisition of further stake of subsidiary to make it a wholly-owned subsidiary, inorganic growth, and general corporate purposes.</p>\n<p>\r\n\tShares of these firms are proposed to be listed on the BSE and NSE.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-04 17:15:32",
            "link": "https://www.business-standard.com/markets/ipo/smpp-brigade-hotel-among-8-companies-to-get-sebi-nod-to-float-ipos-125020400651_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400651"
        },
        {
            "title": "Preview: Will SBI Q3 profit rise or fall? Provisions hold key, say analysts",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>SBI Q3 preview:</strong> The largest government-owned bank, State Bank of India (SBI), is expected to report a strong set of <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">results for the October-December quarter (Q3)</a> of the current financial year 2024-25 (FY25).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to analysts, the public sector bank (PSB) is estimated to report a double digit net profit growth on the back of healthy loan book expansion and stable asset quality.</div>\n<h2>\r\n\tSBI Q3 results date and time</h2>\n<div>\r\n\tState Bank of India (SBI) is scheduled to report its Q3 results on Thursday, February 6.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"This is to inform you that a meeting of the Central Board of the Bank will be held on Thursday, February 6, 2025, at Mumbai, inter-alia, to consider the financial results of the Bank for the quarter ended 31.12.2024,\" SBI said in a stock exchange filing on January 16, 2025.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, SBI's Q3 Analyst Meet will be conducted on February 6, 2025, at 5.00 PM post Q3FY25 results at State Bank Bhavan Auditorium, it added.<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/itc-q3-preview-cigarette-volume-may-remain-resilient-fmcg-biz-to-grow-6-125020400495_1.html\" target=\"_blank\">ITC Q3 preview: Cigarette volume may remain resilient; FMCG biz to grow 6%</a></strong><small class=\"brtagPara\"> </small> Ahead of SBI Q3 results, <a href=\"https://www.business-standard.com/markets/state-bank-of-india-share-price-1375.html\" target=\"_blank\"><strong>SBI share price</strong></a> was trading 1.9 per cent higher on Tuesday, February 4, 2025. Thus far in 2025, SBI share price has slipped 4.2 per cent on the BSE as against 1.2 per cent decline in the benchmark Sensex index. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tSBI Q3 results expectations:</h2>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tNomura</h3>\n<div>\r\n\tGlobal brokerage Nomura expects SBI to report a solid growth of 86 per cent year-on-year (Y-o-Y) in net profit. It pegs SBI Q3 net profit at Rs 17,010 crore as against Q3FY24 net profit of Rs 9,160 crore. On a sequential basis, Nomura expects Q3 net profit to decline 7 per cent from Rs 18,330 crore.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOperationally, the brokerage expects SBI's net interest income (NII) to grow 7 per cent Y-o-Y to Rs 42,560 crore from Rs 39,820 crore and 2 per cent Q-o-Q from Rs 41,620 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPre-provision operating profit (PPOP), too, is expected to surge 30 per cent Y-o-Y to Rs 26,450 crore as against Rs 20,340-crore PPOP in Q3FY24. In Q2FY25, PPOP was Rs 29,290 crore.<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/britannia-s-q3-pat-likely-to-slip-5-yoy-margins-may-contract-analysts-125020400527_1.html\" target=\"_blank\">Britannia's Q3 PAT likely to slip 5% YoY; margins may contract: Analysts</a> </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"We expect SBI's Q3 deposit growth to be soft, rising 9 per cent Y-o-Y/1 per cent Q-o-Q to Rs 51.94 trillion. Loan growth, however, is projected to be healthy at 14 per cent Y-o-Y/4 per cent Q-o-Q to Rs 40.11 trillion. We expect net interest margin (NIM) to decline 10bps Y-o-Y/2bps Q-o-Q to 3.1 per cent, aided by re-pricing of MCLR loans. Credit cost are expected to remain under control at 0.4 per cent,:\" Nomura said in its Q3 results preview report.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tCiti Research</h3>\n<div>\r\n\tCiti Research estimates domestic advances growth to align with system average growth, at 13 per cent Y-o-Y/3 per cent Q-o-Q, to Rs 39.75 trillion. The bank's focus towards more secured products may continue in Q3FY25, it added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBesides, it expects SBI's Q3 deposit book to stand at Rs 52.48 trillion, up 10 per cent Y-o-Y/3 per cent Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tComfortable loan-to-deposit ratio (LDR) may allow its deposit growth to lag advances growth, Citi noted.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Post contraction of 8bps in domestic NIM in Q2FY25, we expect SBI Q3 NIM to be broadly stable during the quarter (as MCLR hike benefit over past 6 months may reflect in Q3). However, a fall in global benchmark rates may put some pressure on overseas NIMs,\" the research note said.<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: </strong><a href=\"https://www.business-standard.com/markets/news/hero-motocorp-q3-preview-net-profit-may-climb-up-to-rs-1-130-crore-yoy-125020400683_1.html\" target=\"_blank\"><strong>Hero MotoCorp Q3 Preview: Net profit may climb up to Rs 1,130 crore YoY</strong></a></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt pegs NII at Rs 42,725 crore (up 7 per cent Y-o-Y/3 per cent Q-o-Q); PPOP at Rs 25,786 crore (up 17 per cent Y-o-Y/down 12 per cent Q-o-Q); net profit at Rs 15,097 crore (up 65 per cent Y-o-Y/down 18 per cent Q-o-Q).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNIM is seen at 3 per cent, down 8bps Y-o-Y/3bps Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the asset quality front, Citi Research expects slippages to be contained, along with resolution and pull-back of SMA-1/2.</div>\n<div>\r\n\tTrends in slippages from unsecured personal loans (Xpress Credit) will be key.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCiti Research analysts anticipate SBI to drive further cost-to-income (C/I) ratio efficiency by shoring up income and improving productivity.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tPrabhudas Lilladher</h3>\n<div>\r\n\tThe brokerage has the most cautious estimate for SBI Q3 2025 results. It expects SBI Q3 profit to rise just 7 per cent Y-o-Y to Rs 15,463.2 crore. This would be lower by 15.6 per cent Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tQ3 NII growth, too, is seen muted at 7.5 per cent Y-o-Y/2.8 per cent Qo-Q at Rs 42,795.2 crore. Q3 PPOP, on the other hand, is anticipated at Rs 25,627.3 crore, up 26 per cent Y-o-Y/down 12.5 per cent Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tProvisions, Prabhudas Lilladher analysts said, are expected to increase by 5 per cent Q-o-Q/588 per cent Y-o-Y to Rs 4,731 crore, leading to a fall in PAT. Asset quality, in terms of gross non-performing asset (GNPA) ratio, is expected to worsen by 7 bps Q-o-Q to 2.06 per cent, while credit cost is expected to increase by 1bps to 0.48 per cent.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tNuvama Institutional Equities</h3>\n<div>\r\n\tThis brokerage, too, has subdued NII estimates for SBI Q3 results. It expects SBI Q3 NII at Rs 42,120 crore, up around 6 per cent Y-o-Y and 1.2 per cent Q-o-Q.<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: </strong><a href=\"https://www.business-standard.com/markets/news/swiggy-q3-preview-analysts-expect-loss-to-widen-qoq-revenue-may-rise-10-125020400348_1.html\" target=\"_blank\"><strong>Swiggy Q3 preview: Analysts expect loss to widen QoQ, revenue may rise 10%</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIncluding Trading Gains of Rs 3,000 crore (up 20 per cent Y-o-Y/down 35.4 per cent Q-o-Q), Other Income of Rs 9,830 crore (up 9.8 per cent Y-o-Y/down 7.5 per cent Q-o-Q), and Non-interest Income of Rs 12,830 crore (up 12 per cent Y-o-Y/down 16 per cent Q-o-Q), Total Revenue is projected at Rs 54,950 crore (up 7.2 per cent Y-o-Y/down 3.4 per cent Q-o-Q).</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNuvama estimates SBI Q3 PPOP to come at Rs 27,590 crore (up 109 per cent Y-o-Y/down 6 per cent Q-o-Q), and net profit at Rs 17,090 crore (up 86.5 per cent Y-o-Y/down 6.8 per cent Q-o-Q).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis brokerage, also, expects provisions to surge 554 per cent Y-o-Y/flat Q-o-Q at Rs 4,500 crore.</div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tMotilal Oswal Financial Services</h3>\n<div>\r\n\tMOFSL forecasts SBI's provisions to remain elevated in Q3FY25, at Rs 5,160 crore, limiting net profit growth at 77 per cent Y-o-Y at Rs 16,240 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt expects cost ratios to be slightly higher in the quarter, but asset quality may remain contained. GNPA ratio, MOFSL said, may improve to 2.04 per cent from 2.13 per cent. NNPA ratio, meanwhile, is seen at 0.5 per cent vs 0.53 per cent Q-o-Q.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNIM is expected to be flat. </div></div>",
            "pub_date": "2025-02-04 17:15:31",
            "link": "https://www.business-standard.com/markets/news/preview-will-sbi-q3-profit-rise-or-fall-provisions-hold-key-say-analysts-125020400731_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400731"
        },
        {
            "title": "Swiggy Q3 preview: Analysts expect loss to widen QoQ, revenue may rise 10%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFood delivery platform Swiggy is all set to release its <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">third quarter (Q3) results</a> for financial year 2024-25 (FY25) on Wednesday, February 5, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBrokerages tracked by Business Standard estimate the Q3 revenue of Swiggy to grow 9.9 per cent quarter-on-quarter (Q-o-Q), on an average, to Rs 3,962.85 crore as compared to Rs 3,602.95 crore in Q2FY25. The stock was listed on bourses on November 13, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, <a href=\"https://www.business-standard.com/markets/swiggy-ltd-share-price-68148.html\" target=\"_blank\">Swiggy</a> is expected to widen its net loss Q-o-Q in Q3FY25 to Rs 704.05 crore, on average, as compared to a loss of Rs 623 crore in Q2FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnalysts and investors will keep an eye on Instamart’s gross order value (GOV) and average order value (AOV) growth, dark store additions, and margins.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/news/swiggy-shares-fall-below-issue-price-stock-plunges-28-thus-far-in-january-125012800490_1.html\" target=\"_blank\">Swiggy shares fall below issue price; stock plunges 28% thus far in January</a></strong></div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h3>\r\n\tHere's how brokerages expect Swiggy to fare in Q3:</h3>\n<div>\n<strong>Motilal Oswal: </strong>The GOV for food delivery/quick commerce (FD/QC) businesses is likely to achieve 20 per cent/100 per cent year-on-year (Y-o-Y) growth, with take rates of 22 per cent/14 per cent, respectively, driving overall revenue growth of 8 per cent Q-o-Q in Q3FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA take rate is the percentage of revenue that a platform takes as a commission from each transaction facilitated on its platform.<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: </strong><a href=\"https://www.business-standard.com/markets/news/britannia-s-q3-pat-likely-to-slip-5-yoy-margins-may-contract-analysts-125020400527_1.html\" target=\"_blank\"><strong>Britannia's Q3 PAT likely to slip 5% YoY; margins may contract: Analysts</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMotilal Oswal pegs Swiggy's Q3 revenue at Rs 3,891 crore as compared to Rs 3,604.4 crore in Q2.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, analysts at Motilal Oswal anticipate food delivery's adjusted Ebitda, as a percentage of GOV, to improve 20 basis points (bps) Q-o-Q to 1.8 per cent. Instamart is projected to report a -2.2 per cent contribution margin and a -10 per cent adjusted Ebitda margin in Q3.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JM Financial:</strong> Analysts at JM Financial forecast sequential GOV growth of 3.5 per cent as compared to 19.3 per cent Y-o-Y in the food delivery business. They expect take-rates to expand to 22.3 per cent in Q3FY25 as compared to 21.9 per cent in Q2FY25. Adjusted Ebitda margin (as per cent of GOV) expansion is likely to be 40 bps sequentially.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe brokerage expects consolidated adjusted Ebitda in Q3 at Rs 431.2 crore as compared to Rs 340.3 crore in Q2. The consolidated adjusted Ebitda margin is likely at -10.7 per cent as compared to -9.5 per cent in Q2.<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/itc-q3-preview-cigarette-volume-may-remain-resilient-fmcg-biz-to-grow-6-125020400495_1.html\" target=\"_blank\">ITC Q3 preview: Cigarette volume may remain resilient; FMCG biz to grow 6%</a></strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFor Instamart, they expect sequential GOV growth of 18.2 per cent led by a robust increase of 13 per cent in order volumes. Take rates are likely to improve to 14.9 per cent in Q3 from 14.5 per cent in Q2. They see contribution margin at -3.6 per cent (as per cent of GOV) as against -1.9 per cent in Q2.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt a consolidated level, reported Ebitda/PAT are anticipated to be at a loss of Rs 673 crore/ Rs 708 crore, respectively, as against a loss of Rs 554 crore/Rs 623 crore in Q2.</div></div>",
            "pub_date": "2025-02-04 17:10:36",
            "link": "https://www.business-standard.com/markets/news/swiggy-q3-preview-analysts-expect-loss-to-widen-qoq-revenue-may-rise-10-125020400348_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400348"
        },
        {
            "title": "Six injured in attack in Israel-occupied West Bank; assailant killed",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tAt least six people were injured in a shooting attack at a checkpoint in the Israeli-occupied West Bank early Tuesday morning, according to the Israeli military and area hospitals.</p>\n<p>\r\n\tThe Israeli military said an attacker fired at soldiers at a checkpoint in the village of Tayasir, which is in the northern West Bank. In a tense exchange, soldiers returned fire and the attacker was killed, the military added.</p>\n<p>\r\n\tIsraeli hospitals said they had received a total of six people injured in the shooting attack. Israeli media reported the injured are soldiers and at least two of them were critically injured.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tHamas and the smaller Islamic Jihad militant group praised the attack but neither claimed responsibility for it.</p>\n<p>\r\n\tIsrael has carried out an extensive operation in nearby Jenin over the past weeks to clamp down on what Israel said is militant activity in the city, as soldiers and armored bulldozers have caused widespread damage and destroyed scores of homes.</p>\n<p>\r\n\tPalestinian health officials have not released a total death toll, but say Israeli fire has killed at least 20 Palestinians since the start of the raid.</p>\n<p>\r\n\tThe West Bank has seen a surge in violence since Hamas' Oct. 7, 2023, attack out of the Gaza Strip ignited the war there.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-04 17:10:34",
            "link": "https://www.business-standard.com/world-news/six-injured-in-attack-in-israel-occupied-west-bank-assailant-killed-125020400722_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400722"
        },
        {
            "title": "Asian Paints Q3 results: Profit drops 23% to ₹1,110 crore, revenue down 6%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<a href=\"https://www.business-standard.com/markets/asian-paints-ltd-share-price-34.html\" target=\"_blank\">Asian Paints</a> on Tuesday reported a 23.3 per cent drop in consolidated net profit to ₹1,110.48 crore for the <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">third quarter (Q3)</a> of the financial year 2024-25 (FY25), from ₹1,447.72 crore reported during the same period last year. Sequentially, however, profit rose nearly 60 per cent from ₹694.64 crore.<small class=\"brtagPara\"> </small>\n<strong>ALSO READ: </strong><a href=\"https://www.business-standard.com/companies/results/mobikwik-q3-result-fy25-loss-widens-to-rs-55-2-cr-on-higher-lending-costs-125020400725_1.html?1738659761\" target=\"_blank\"><strong>MobiKwik Q3 result: FY25 loss widens to Rs 55.2 cr on higher lending costs</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tConsolidated revenue from operations also dropped marginally by 6 per cent to Rs 8,549.44 crore year-on-year from Rs 9,103.09 crore. Sequentially, revenue went up by 6.5 per cent from ₹8,027.54 crore.</div></div>",
            "pub_date": "2025-02-04 17:05:26",
            "link": "https://www.business-standard.com/companies/results/asian-paints-q3-fy25-company-results-profit-share-revenue-125020400720_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400720"
        },
        {
            "title": "MobiKwik Q3 result: FY25 loss widens to Rs 55.2 cr on higher lending costs",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFintech firm MobiKwik reported a consolidated loss of Rs 55.2 crore in the third quarter of financial year 2025 (Q3FY25) after posting a profit of Rs 5.27 crore in Q3FY24. The company’s loss widened sequentially from Rs 3.59 crore in Q2FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Gurugram-based company’s revenue from operations grew 17.7 per cent year-on-year (Y-o-Y) from Rs 228.93 crore in Q3FY24 to Rs 269.47 crore in Q3FY25. However, it declined sequentially by 7.3 per cent from Rs 290.64 crore in Q2FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe firm’s contribution margin remained muted in Q3FY25, declining from Rs 87.2 crore in Q3FY24 to Rs 73 crore in Q3FY25.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company attributed the decline to lower financial services revenue and higher lending costs due to the transition to new default loss guarantee (DLG) contracts. It said a larger portion of such costs is incurred in the initial period of a contract.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tExpenses for the fintech firm grew 43.8 per cent Y-o-Y from Rs 220.55 crore in Q3FY24 to Rs 317.14 crore in Q3FY25. Sequentially, expenses increased 10.55 per cent from Rs 286.86 crore in Q2FY25.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA major portion of the company’s expenses in Q3FY25 included payment gateway costs, which accounted for over 45 per cent of the total expenses at Rs 143.70 crore.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRevenue from financial services declined 53 per cent from Rs 155 crore in Q3FY24 to Rs 73 crore in Q3FY25. The company added that new financial products would support revenue from financial services distribution.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe firm said its small-ticket-size lending product ZIP was being scaled down due to \"lower appetite from lending partners for lower ticket-sized credit products.\"</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt added that the focus would remain on the larger-tenure ZIP EMI product for high-quality customers, in line with the lending partner strategy.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRevenue from payments more than doubled to Rs 196.5 crore in Q3FY25, up from Rs 73.9 crore in Q3FY24.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt present, the company has a registered user base of 172 million customers and 4.5 million merchants. It added 5 million new customers and 1,10,000 merchants in Q3FY25.</div>\n<small class=\"brtagPara\"> </small></div>",
            "pub_date": "2025-02-04 17:05:26",
            "link": "https://www.business-standard.com/companies/results/mobikwik-q3-result-fy25-loss-widens-to-rs-55-2-cr-on-higher-lending-costs-125020400725_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400725"
        }
    ]
}