{
    "data": [
        {
            "title": "Stocks to Watch, Feb 5: Swiggy, Tata Power, NLC India, Global Health, RVNL",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Stocks to watch on Wednesday, February 5, 2025:</strong> <a href=\"https://www.business-standard.com/markets/news/stock-market-live-updates-feb-5-nse-bse-nifty-today-pmi-trump-china-fii-ipo-swiggy-q3-delhi-polls-125020500077_1.html\" target=\"_blank\">Indian bourses are poised for a positive start</a>, indicated GIFT Nifty futures. The GIFT Nifty futures quoted at 23,840 level, 55 points higher than Nifty50 futures. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Tuesday, the key benchmarks settled in the positive zone with the <a href=\"https://www.business-standard.com/markets/news/why-sensex-surged-1-250-pts-today-despite-a-trade-war-brewing-in-the-us-125020400742_1.html\" target=\"_blank\">BSE Sensex</a> closing at 78,583.81, up 1,397 or 1.81 per cent while the Nifty50 settled at 23,739.25, rising 378 points or 1.62 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em>Meanwhile, for Wednesday, below are some buzzing stocks to keep tabs on:</em></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Stocks to Watch:</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Earnings today: </strong>Reliance Power, Zydus Lifesciences, Abbott India, Cummins India, Gujarat Gas, Welspun Corp, Info Edge (India), Swiggy, Matrimony.com, H.G. Infra Engineering, Aarti Pharmalabs, Eveready Industries India, Piccadily Agro Industries, Exicom Tele-Systems, Sagility India, Inventurus Knowledge Solutions, Zinka Logistics Solutions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtag\"> </small> <strong>Listing today:</strong> Dr Agarwal's Health Care Limited IPO will list on the BSE, NSE today.<small class=\"brtag\"> </small></div>\n<div>\n<strong>Tata Power: </strong><a href=\"https://www.business-standard.com/companies/results/tata-power-q3-results-net-profit-rises-8-2-to-rs-1-031-cr-revenue-up-5-125020400954_1.html\" target=\"_blank\">Q3 consolidated net profit surged</a> to Rs 1,030 crore, up from Rs 953 crore Y-o-Y. Revenue climbed to Rs 15,400 crore, compared to Rs 14,651 crore. Ebitda jumped to Rs 3,352 crore, rising from Rs 2,417 crore, while Ebitda margin improved significantly to 21.78 per cent from 16.50 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Lemon Tree Hotels: </strong>Q3 consolidated net profit surged to Rs 62.5 crore, a sharp rise from Rs 35.4 crore year-on-year (Y-o-Y) and Rs 29.6 crore sequentially. Revenue climbed to Rs 360 crore, up from Rs 289 crore Y-o-Y. Ebitda jumped to Rs 184 crore from Rs 142 crore, while Ebitda margin expanded to 51.86 per cent from 48.80 per cent.  </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Metropolis Healthcare:</strong> Q3 consolidated net profit improved to Rs 31.4 crore, compared to Rs 27.15 crore in the previous year. Revenue climbed to Rs 323 crore, up from Rs 290 crore. Ebitda stood at Rs 72 crore, higher than Rs 64.8 crore, while Ebitda margin remained stable at 22.31 per cent, marginally up from 22.28 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Happiest Minds Technologies: </strong>Q3 consolidated net profit stood at Rs 50.1 crore, compared to Rs 49.5 crore in the previous quarter. Revenue increased to Rs 530 crore from Rs 521 crore. EBIT came in at Rs 72.9 crore, rising from Rs 68.7 crore, with EBIT margin improving to 13.74 per cent from 13.17 per cent.  </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sun Pharma: </strong>Philogen has completed patient enrollment for the Phase III Fibrosarc trial in soft tissue sarcoma.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Whirlpool of India:</strong> Q3 consolidated net profit jumped to Rs 44 crore, compared to Rs 28 crore Y-o-Y. Revenue expanded to Rs 1,700 crore, rising from Rs 1,526 crore. Ebitda grew to Rs 69.3 crore, against Rs 62.7 crore, while Ebitda margin stood at 4.06 per cent, slightly lower than 4.08 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>India Glycols:</strong> Q3 consolidated net profit climbed to Rs 56.8 crore, up from Rs 41.63 crore in the corresponding period last year. Revenue rose to Rs 2,424 crore, compared to Rs 2,119 crore. Ebitda increased to Rs 129 crore, up from Rs 107 crore, with Ebitda margin improving slightly to 5.32 per cent from 5.05 per cent.  </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Global Health:</strong> Q3 consolidated net profit stood at Rs 143 crore, compared to Rs 123 crore in the prior year. Revenue increased to Rs 943 crore, rising from Rs 836 crore. Ebitda at Rs 238 crore, up from Rs 216 crore, while Ebitda margin was 25.21 per cent, slightly lower than 25.82 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Aditya Birla Capital: </strong>Tax demand revised to Rs 184 crore following a rectification order.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Niva Bupa Health Insurance:</strong> Q3 net profit soared to Rs 13.2 crore, significantly higher than Rs 4.6 crore a year earlier. Net premium written increased to Rs 1,150 crore, compared to Rs 1,120 crore. Gross Non-Performing Assets (GNPA) improved to 0.86 per cent, down from 1.05 per cent in the previous quarter.  </div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Indian Energy Exchange (IEX):</strong> January traded volume stood at 10,910 MU, marking a 16 per cent increase Y-o-Y. The average DAM price was Rs 4.43/unit, reflecting a 24 per cent decline from the previous year.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Alkem Laboratories: </strong>Introduced Kojiglo Serum in India to address facial hyperpigmentation.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>NLC India: </strong>Secured its third commercial coal mine – New Patrapara South in Angul. The mine has a total geological reserve of 720.87 million tonnes.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JG Chemicals:</strong> Q3 consolidated net profit at Rs 16.97 crore, up from Rs 10.2 crore. Revenue surged to Rs 209 crore, compared to Rs 160 crore. Ebitda improved to Rs 23.1 crore, against Rs 14.8 crore, while Ebitda margin expanded to 11.05 per cent, compared to 9.16 per cent.  </div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Interarch Building Products: </strong>Q3 standalone net profit amounted to Rs 28.2 crore, increasing from Rs 22 crore Y-o-Y. Revenue rose to Rs 364 crore, against Rs 316 crore in the previous year. Ebitda reached Rs 35.1 crore, up from Rs 27.5 crore, with Ebitda margin at 9.66 per cent, improving from 8.70 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Azad Engineering: </strong>Q3 standalone net profit reached Rs 24.3 crore, advancing from Rs 16.8 crore a year ago. Revenue surged to Rs 119 crore, compared to Rs 89.2 crore. Ebitda expanded to Rs 42.6 crore, rising from Rs 32.8 crore, while Ebitda margin stood at 35.92 per cent, slightly lower than 36.77 per cent.  </div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Prism Johnson: </strong>Approved the sale of a portion of its industrial premises at a tile plant to JSW Steel, valued at Rs 165 crore.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>RVNL: </strong>Received a Letter of Acceptance for a Rs 404 crore project.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>TTK Healthcare: </strong>Issued a 90-day stop-work order by USAID, with financial implications yet to be assessed. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 10:40:29",
            "link": "https://www.business-standard.com/markets/news/stocks-to-watch-feb-5-swiggy-tata-power-nlc-india-global-health-rvnl-125020500083_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500083"
        },
        {
            "title": "US will 'take over' the Gaza strip, 'own it' and 'develop it', says Trump",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>US President Donald Trump said on Tuesday that the United States would “take over” and “own” the Gaza strip, pledging to rebuild and develop it. Speaking at a joint press conference with Israeli Prime Minister Benjamin Netanyahu, Trump stated \"The US will take over the Gaza Strip, and we will do a job with it too,\" \"We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site.\"<small class=\"brtagPara\"> </small>\n<strong>Economic development and long-term control</strong><small class=\"brtagPara\"> </small>\r\nTrump further said \"We're going to take over that piece, we're going to develop it, create thousands and thousands of jobs, and it'll be something that the entire Middle East can be very proud of. Trump said he envisioned the US taking a “long-term ownership position” over the Gaza strip but did not clarify under what authority the US could assume control. When asked about the legality of such a move, he did not respond directly.<small class=\"brtagPara\"> </small>\n<strong>Criticism of Biden and regional strategy</strong><small class=\"brtagPara\"> </small>\r\nTrump criticised former President Joe Biden, claiming his administration had shown incompetence in the Middle East. He said “nobody did anything for four years” in the Middle East except demonstrate incompetence.\"<small class=\"brtagPara\"> </small>\r\nEarlier Trump reiterated his call for Arab nations, including Jordan and Egypt, to take in Gazans saying Palestinians there had no alternative but to abandon the Gaza strip. This time, he advocated for the permanent resettlement of Palestinians. Trump said that he might be reconsidering an independent Palestine as part of a two-state solution to the decades-long Israel-Palestinian conflict.<small class=\"brtagPara\"> </small>\n<strong>Talks with Netanyahu on security and diplomacy</strong><small class=\"brtagPara\"> </small>\r\nNetanyahu’s visit to Washington comes two weeks into Trump’s second term. The leaders discussed eliminating Hamas, restoring peace “to a troubled region\", and maintaining the Gaza ceasefire.<small class=\"brtagPara\"> </small>\r\nNetanyahu, when asked about the US taking over Gaza, said, “I think it’s something that could change history.” “And I think it’s really worth pursuing this avenue.<small class=\"brtagPara\"> </small>\n<em>(With agency inputs)</em><br/></div>",
            "pub_date": "2025-02-05 10:40:28",
            "link": "https://www.business-standard.com/world-news/us-will-take-over-the-gaza-strip-own-it-and-develop-it-says-trump-125020500088_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500088"
        },
        {
            "title": "Families sue over Trump's order to halt funds for gender-affirming care",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tA group of families with transgender children filed a lawsuit Tuesday over President Donald Trump's executive order to halt federal support for gender-affirming health care for transgender people under age 19.</p>\n<p>\r\n\tPFLAG, a national group for family of LGBTQ+ people; and GLMA, a doctors organisation, are also plaintiffs in the court challenge in US District Court in Baltimore.</p>\n<p>\r\n\tIt comes one week after Trump signed an order calling for the federal government to stop funding the medical care through federal government-run health insurance programs including Medicaid and TRICARE.</p>\n<p>\r\n\tKristen Chapman, the mother of one of the plaintiffs in the case, said her family moved to Richmond, Virginia, from Tennessee in 2023 because of a ban on gender-affirming care in their home state. Her 17-year-old daughter, Willow, had an initial appointment scheduled for last week with a new provider who would accept Medicaid. But Trump signed his order the day before and the hospital said it could not provide care.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tI thought Virginia would be a safe place for me and my daughter, Kristen Chapman said in a statement. \"Instead, I am heartbroken, tired, and scared.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe ACLU and Lambda Legal, who are representing the plaintiffs, want a judge to put the order on hold.</p>\n<p>\r\n\tSome health providers immediately paused providing the coverage while they assess how the order affects them. New York Attorney General Letitia James, who has repeatedly battled Trump in court, told hospitals in her state Monday that it would violate the law to stop offering gender-affirming care to people under 19.</p>\n<p>\r\n\tTrump's approach on transgender policy represents an abrupt change from the Biden administration, which sought to explicitly extend civil rights protections to transgender people.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tTrump has used strong language, asserting in the order on gender-affirming care that \"medical professionals are maiming and sterilising a growing number of impressionable children under the radical and false claim that adults can change a child's sex.</p>\n<p>\r\n\tAlex Sheldon, executive director of GLMA, the doctors group in the legal challenge, said there are established medical standards for caring for transgender youth. Now, an extreme political agenda is trying to overrule that expertise, putting young people and their providers in danger,\" Sheldon said in a statement. \"We are confident that the law, science, and history are on our side.</p>\n<p>\r\n\tIn addition to the order on health care access, Trump has also signed orders that narrowly define the sexes as unchangeable, open the door to banning transgender people from military service and set up new rules about how schools can teach about gender.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tLegal challenges have already been filed on the military order and a plan to move transgender women in federal prisons to men's facilities. Others are expected to be filed, just as there have been challenges to a variety of Trump's policies.</p>\n<p>\r\n\tResearchers have found that fewer than 1 in 1,000 adolescents receive the care, which includes treatments such as puberty blockers, hormone treatments and surgeries though surgery is rare for children.</p>\n<p>\r\n\tAs transgender people have gained visibility and acceptance in some ways, there's been vehement pushback. At least 26 states have passed laws to restrict or ban the care for minors. The US Supreme Court heard arguments last year but has not yet ruled on whether Tennessee's ban on the care is constitutional.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 10:35:26",
            "link": "https://www.business-standard.com/world-news/families-sue-over-trump-s-order-to-halt-funds-for-gender-affirming-care-125020500019_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500019"
        },
        {
            "title": "Stocks to Watch, Feb 5: Swiggy, Tata Power, NLC India, Global Health, RVNL",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Stocks to watch on Wednesday, February 5, 2025:</strong> <a href=\"https://www.business-standard.com/markets/news/stock-market-live-updates-feb-5-nse-bse-nifty-today-pmi-trump-china-fii-ipo-swiggy-q3-delhi-polls-125020500077_1.html\" target=\"_blank\">Indian bourses are poised for a positive start</a>, indicated GIFT Nifty futures. The GIFT Nifty futures quoted at 23,840 level, 55 points higher than Nifty50 futures. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Tuesday, the key benchmarks settled in the positive zone with the <a href=\"https://www.business-standard.com/markets/news/why-sensex-surged-1-250-pts-today-despite-a-trade-war-brewing-in-the-us-125020400742_1.html\" target=\"_blank\">BSE Sensex</a> closing at 78,583.81, up 1,397 or 1.81 per cent while the Nifty50 settled at 23,739.25, rising 378 points or 1.62 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em>Meanwhile, for Wednesday, below are some buzzing stocks to keep tabs on:</em></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Stocks to Watch:</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Earnings today: </strong>Reliance Power, Zydus Lifesciences, Abbott India, Cummins India, Gujarat Gas, Welspun Corp, Info Edge (India), Swiggy, Matrimony.com, H.G. Infra Engineering, Aarti Pharmalabs, Eveready Industries India, Piccadily Agro Industries, Exicom Tele-Systems, Sagility India, Inventurus Knowledge Solutions, Zinka Logistics Solutions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtag\"> </small> <strong>Listing today:</strong> Dr Agarwal's Health Care Limited IPO will list on the BSE, NSE today.<small class=\"brtag\"> </small></div>\n<div>\n<strong>Tata Power: </strong><a href=\"https://www.business-standard.com/companies/results/tata-power-q3-results-net-profit-rises-8-2-to-rs-1-031-cr-revenue-up-5-125020400954_1.html\" target=\"_blank\">Q3 consolidated net profit surged</a> to Rs 1,030 crore, up from Rs 953 crore Y-o-Y. Revenue climbed to Rs 15,400 crore, compared to Rs 14,651 crore. Ebitda jumped to Rs 3,352 crore, rising from Rs 2,417 crore, while Ebitda margin improved significantly to 21.78 per cent from 16.50 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Lemon Tree Hotels: </strong>Q3 consolidated net profit surged to Rs 62.5 crore, a sharp rise from Rs 35.4 crore year-on-year (Y-o-Y) and Rs 29.6 crore sequentially. Revenue climbed to Rs 360 crore, up from Rs 289 crore Y-o-Y. Ebitda jumped to Rs 184 crore from Rs 142 crore, while Ebitda margin expanded to 51.86 per cent from 48.80 per cent.  </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Metropolis Healthcare:</strong> Q3 consolidated net profit improved to Rs 31.4 crore, compared to Rs 27.15 crore in the previous year. Revenue climbed to Rs 323 crore, up from Rs 290 crore. Ebitda stood at Rs 72 crore, higher than Rs 64.8 crore, while Ebitda margin remained stable at 22.31 per cent, marginally up from 22.28 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Happiest Minds Technologies: </strong>Q3 consolidated net profit stood at Rs 50.1 crore, compared to Rs 49.5 crore in the previous quarter. Revenue increased to Rs 530 crore from Rs 521 crore. EBIT came in at Rs 72.9 crore, rising from Rs 68.7 crore, with EBIT margin improving to 13.74 per cent from 13.17 per cent.  </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sun Pharma: </strong>Philogen has completed patient enrollment for the Phase III Fibrosarc trial in soft tissue sarcoma.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Whirlpool of India:</strong> Q3 consolidated net profit jumped to Rs 44 crore, compared to Rs 28 crore Y-o-Y. Revenue expanded to Rs 1,700 crore, rising from Rs 1,526 crore. Ebitda grew to Rs 69.3 crore, against Rs 62.7 crore, while Ebitda margin stood at 4.06 per cent, slightly lower than 4.08 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>India Glycols:</strong> Q3 consolidated net profit climbed to Rs 56.8 crore, up from Rs 41.63 crore in the corresponding period last year. Revenue rose to Rs 2,424 crore, compared to Rs 2,119 crore. Ebitda increased to Rs 129 crore, up from Rs 107 crore, with Ebitda margin improving slightly to 5.32 per cent from 5.05 per cent.  </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Global Health:</strong> Q3 consolidated net profit stood at Rs 143 crore, compared to Rs 123 crore in the prior year. Revenue increased to Rs 943 crore, rising from Rs 836 crore. Ebitda at Rs 238 crore, up from Rs 216 crore, while Ebitda margin was 25.21 per cent, slightly lower than 25.82 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Aditya Birla Capital: </strong>Tax demand revised to Rs 184 crore following a rectification order.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Niva Bupa Health Insurance:</strong> Q3 net profit soared to Rs 13.2 crore, significantly higher than Rs 4.6 crore a year earlier. Net premium written increased to Rs 1,150 crore, compared to Rs 1,120 crore. Gross Non-Performing Assets (GNPA) improved to 0.86 per cent, down from 1.05 per cent in the previous quarter.  </div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Indian Energy Exchange (IEX):</strong> January traded volume stood at 10,910 MU, marking a 16 per cent increase Y-o-Y. The average DAM price was Rs 4.43/unit, reflecting a 24 per cent decline from the previous year.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Alkem Laboratories: </strong>Introduced Kojiglo Serum in India to address facial hyperpigmentation.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>NLC India: </strong>Secured its third commercial coal mine – New Patrapara South in Angul. The mine has a total geological reserve of 720.87 million tonnes.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JG Chemicals:</strong> Q3 consolidated net profit at Rs 16.97 crore, up from Rs 10.2 crore. Revenue surged to Rs 209 crore, compared to Rs 160 crore. Ebitda improved to Rs 23.1 crore, against Rs 14.8 crore, while Ebitda margin expanded to 11.05 per cent, compared to 9.16 per cent.  </div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Interarch Building Products: </strong>Q3 standalone net profit amounted to Rs 28.2 crore, increasing from Rs 22 crore Y-o-Y. Revenue rose to Rs 364 crore, against Rs 316 crore in the previous year. Ebitda reached Rs 35.1 crore, up from Rs 27.5 crore, with Ebitda margin at 9.66 per cent, improving from 8.70 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Azad Engineering: </strong>Q3 standalone net profit reached Rs 24.3 crore, advancing from Rs 16.8 crore a year ago. Revenue surged to Rs 119 crore, compared to Rs 89.2 crore. Ebitda expanded to Rs 42.6 crore, rising from Rs 32.8 crore, while Ebitda margin stood at 35.92 per cent, slightly lower than 36.77 per cent.  </div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Prism Johnson: </strong>Approved the sale of a portion of its industrial premises at a tile plant to JSW Steel, valued at Rs 165 crore.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>RVNL: </strong>Received a Letter of Acceptance for a Rs 404 crore project.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>TTK Healthcare: </strong>Issued a 90-day stop-work order by USAID, with financial implications yet to be assessed. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 10:35:26",
            "link": "https://www.business-standard.com/markets/news/stocks-to-watch-feb-5-swiggy-tata-power-nlc-india-global-health-rvnl-125020500083_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500083"
        },
        {
            "title": "Elon Musk faces long court battle over feud with OpenAI CEO Sam Altman",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Malathi Nayak</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tElon Musk’s move to immediately block Sam Altman from restructuring OpenAI faltered in federal court, with a judge saying she was reluctant to issue such an order in a case pitting “billionaires versus billionaires.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe world’s richest person presented his request in filings as an emergency, telling the court the startup he helped found a decade ago needs to be stopped from carrying out what he’s described as a quest by Altman and Microsoft Corp. to dominate the generative artificial intelligence industry.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUS District Judge Yvonne Gonzalez Rogers told Musk’s attorney at the outset of a three-hour hearing Tuesday in Oakland, California, that she rarely issues injunctions in disputes that are bound to take many months to play out. She added that she isn’t inclined to freeze OpenAI’s plans for that long. Rogers called Musk’s argument that he faces “irreparable harm” a “stretch.” Musk didn’t attend the hearing.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile Rogers issued no formal order, she said she’ll probably let Musk take OpenAI to trial — and require him to testify — over at least some of his claims. He alleges that the startup betrayed its charitable mission and acted anticompetitively after he left its board in 2018 and it received $13 billion in funding from Microsoft. Attorneys said the case may not be ready for trial until late 2026 or 2027.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe injunction Musk asked for would freeze OpenAI’s transformation to a more conventional, public benefit for-profit company, just as it’s in talks to raise as much as $40 billion in a funding round led by SoftBank Group Corp. The ChatGPT maker has said shifting from a non-profit charity to a commercial business is critical to securing the vast amount of funding it needs to fulfill its mission of creating artificial general intelligence — or AGI — that will benefit humanity. </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOpenAI has argued that Musk’s claims are without merit and amount to harassment. As the months-long feud escalated, OpenAI publicized a slew of emails and messages indicating the billionaire originally supported a more traditional corporate structure for the startup. </div>\n<h3>\r\n\tMusk’s Startup</h3>\n<div>\r\n\tIf Rogers rejects the injunction, it be might be harder for Musk’s own xAI startup — which has attained a valuation of $50 billion since he launched it in 2023 — to catch up to OpenAI’s considerable lead in raising capital, which is critical to developing more advanced AI.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMusk’s attorney, Marc Toberoff, argued the injunction is needed to “preserve the status quo,” in light of “serial self-dealing” by OpenAI’s board, which he alleged is controlled by Altman. He also cited Microsoft’s dominant position in the AI market and concerns raised by the US Federal Trade Commission over the software giant’s relationship with the startup.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOpenAI and Microsoft’s attorneys countered that an injunction would be “drastic” as Musk hasn’t shown any evidence to prove wrongdoing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRogers asked whether an injunction is necessary in light of the FTC’s activity as a regulator — and questioned whether monetary damages alone would be enough for Musk.</div>\n<h3>\r\n\t$45 Million</h3>\n<div>\r\n\tThe judge remarked that Musk was now “running the government” while trying to compete in the AI industry. She also said it’s “interesting” that Musk gave $45 million to OpenAI on a “handshake” with no written agreement over how that money would be used.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe judge described the case as “murky” because Musk didn’t include his AI startup as a plaintiff in the case, even though its interests are clearly involved.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“My job is to make sure my is to make sure that I’m not creating a playing field that’s unleveled,” Rogers said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the lawsuit Musk filed in August, he alleged that OpenAI has violated antitrust laws by making its investors agree not to fund rivals, and also by having overlapping board members with Microsoft, including billionaire Reid Hoffman and an executive at the software giant. </div>\n<h3>\r\n\tBiden Administration</h3>\n<div>\r\n\tMusk garnered support in January from the Biden administration when the Justice Department and FTC said in a court filing that overlapping board directors can harm competition.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHoffman and Microsoft executive Dee Templeton have defended their conduct as legal, but Rogers said the overlapping directors are problematic.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Neither of them have any business being on that board. Period,” the judge said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe judge seemed less sympathetic to the claim by Toberoff, Musk’s attorney, that the “fund no competitor” condition in OpenAI’s investment deals hurts rivals.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“How can I say as matter of law, there’s a restraint on trade when your client has raised $11 billion” for xAI? Rogers said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe case is Musk v. Altman, 4:24-cv-04722, US District Court, Northern District of California (Oakland).</div></div>",
            "pub_date": "2025-02-05 10:30:30",
            "link": "https://www.business-standard.com/world-news/elon-musk-faces-long-court-battle-over-feud-with-openai-ceo-sam-altman-125020500082_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500082"
        },
        {
            "title": "Stocks to Watch, Feb 5: Swiggy, Tata Power, NLC India, Global Health, RVNL",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Stocks to watch on Wednesday, February 5, 2025:</strong> Indian bourses are poised for a positive start, indicated GIFT Nifty futures. The GIFT Nifty futures quoted at 23,840 level, 55 points higher than Nifty50 futures. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Tuesday, the key benchmarks settled in the positive zone with the BSE Sensex closing at 78,583.81, up 1,397 or 1.81 per cent while the Nifty50 settled at 23,739.25, rising 378 points or 1.62 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em>Meanwhile, for Wednesday, below are some buzzing stocks to keep tabs on:</em></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Stocks to Watch:</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Earnings today: </strong>Reliance Power, Zydus Lifesciences, Abbott India, Cummins India, Gujarat Gas, Welspun Corp, Info Edge (India), Swiggy, Matrimony.com, H.G. Infra Engineering, Aarti Pharmalabs, Eveready Industries India, Piccadily Agro Industries, Exicom Tele-Systems, Sagility India, Inventurus Knowledge Solutions, Zinka Logistics Solutions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtag\"> </small>\n<strong>Listing today:</strong> Dr Agarwal's Health Care Limited IPO will list on the BSE, NSE today.<small class=\"brtag\"> </small></div>\n<div>\n<strong>Tata Power: </strong>Q3 consolidated net profit surged to Rs 1,030 crore, up from Rs 953 crore Y-o-Y. Revenue climbed to Rs 15,400 crore, compared to Rs 14,651 crore. Ebitda jumped to Rs 3,352 crore, rising from Rs 2,417 crore, while Ebitda margin improved significantly to 21.78 per cent from 16.50 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Lemon Tree Hotels: </strong>Q3 consolidated net profit surged to Rs 62.5 crore, a sharp rise from Rs 35.4 crore year-on-year (Y-o-Y) and Rs 29.6 crore sequentially. Revenue climbed to Rs 360 crore, up from Rs 289 crore Y-o-Y. Ebitda jumped to Rs 184 crore from Rs 142 crore, while Ebitda margin expanded to 51.86 per cent from 48.80 per cent.  </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Metropolis Healthcare:</strong> Q3 consolidated net profit improved to Rs 31.4 crore, compared to Rs 27.15 crore in the previous year. Revenue climbed to Rs 323 crore, up from Rs 290 crore. Ebitda stood at Rs 72 crore, higher than Rs 64.8 crore, while Ebitda margin remained stable at 22.31 per cent, marginally up from 22.28 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Happiest Minds Technologies: </strong>Q3 consolidated net profit stood at Rs 50.1 crore, compared to Rs 49.5 crore in the previous quarter. Revenue increased to Rs 530 crore from Rs 521 crore. EBIT came in at Rs 72.9 crore, rising from Rs 68.7 crore, with EBIT margin improving to 13.74 per cent from 13.17 per cent.  </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sun Pharma: </strong>Philogen has completed patient enrollment for the Phase III Fibrosarc trial in soft tissue sarcoma.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Whirlpool of India:</strong> Q3 consolidated net profit jumped to Rs 44 crore, compared to Rs 28 crore Y-o-Y. Revenue expanded to Rs 1,700 crore, rising from Rs 1,526 crore. Ebitda grew to Rs 69.3 crore, against Rs 62.7 crore, while Ebitda margin stood at 4.06 per cent, slightly lower than 4.08 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>India Glycols:</strong> Q3 consolidated net profit climbed to Rs 56.8 crore, up from Rs 41.63 crore in the corresponding period last year. Revenue rose to Rs 2,424 crore, compared to Rs 2,119 crore. Ebitda increased to Rs 129 crore, up from Rs 107 crore, with Ebitda margin improving slightly to 5.32 per cent from 5.05 per cent.  </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Global Health:</strong> Q3 consolidated net profit stood at Rs 143 crore, compared to Rs 123 crore in the prior year. Revenue increased to Rs 943 crore, rising from Rs 836 crore. Ebitda at Rs 238 crore, up from Rs 216 crore, while Ebitda margin was 25.21 per cent, slightly lower than 25.82 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Aditya Birla Capital: </strong>Tax demand revised to Rs 184 crore following a rectification order.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Niva Bupa Health Insurance:</strong> Q3 net profit soared to Rs 13.2 crore, significantly higher than Rs 4.6 crore a year earlier. Net premium written increased to Rs 1,150 crore, compared to Rs 1,120 crore. Gross Non-Performing Assets (GNPA) improved to 0.86 per cent, down from 1.05 per cent in the previous quarter.  </div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Indian Energy Exchange (IEX):</strong> January traded volume stood at 10,910 MU, marking a 16 per cent increase Y-o-Y. The average DAM price was Rs 4.43/unit, reflecting a 24 per cent decline from the previous year.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Alkem Laboratories: </strong>Introduced Kojiglo Serum in India to address facial hyperpigmentation.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>NLC India: </strong>Secured its third commercial coal mine – New Patrapara South in Angul. The mine has a total geological reserve of 720.87 million tonnes.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>JG Chemicals:</strong> Q3 consolidated net profit at Rs 16.97 crore, up from Rs 10.2 crore. Revenue surged to Rs 209 crore, compared to Rs 160 crore. Ebitda improved to Rs 23.1 crore, against Rs 14.8 crore, while Ebitda margin expanded to 11.05 per cent, compared to 9.16 per cent.  </div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Interarch Building Products: </strong>Q3 standalone net profit amounted to Rs 28.2 crore, increasing from Rs 22 crore Y-o-Y. Revenue rose to Rs 364 crore, against Rs 316 crore in the previous year. Ebitda reached Rs 35.1 crore, up from Rs 27.5 crore, with Ebitda margin at 9.66 per cent, improving from 8.70 per cent.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Azad Engineering: </strong>Q3 standalone net profit reached Rs 24.3 crore, advancing from Rs 16.8 crore a year ago. Revenue surged to Rs 119 crore, compared to Rs 89.2 crore. Ebitda expanded to Rs 42.6 crore, rising from Rs 32.8 crore, while Ebitda margin stood at 35.92 per cent, slightly lower than 36.77 per cent.  </div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Prism Johnson: </strong>Approved the sale of a portion of its industrial premises at a tile plant to JSW Steel, valued at Rs 165 crore.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>RVNL: </strong>Received a Letter of Acceptance for a Rs 404 crore project.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>TTK Healthcare: </strong>Issued a 90-day stop-work order by USAID, with financial implications yet to be assessed. </div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 10:30:30",
            "link": "https://www.business-standard.com/markets/news/stocks-to-watch-feb-5-swiggy-tata-power-nlc-india-global-health-rvnl-125020500083_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500083"
        },
        {
            "title": "Stampede in Mahakumbh caused by officials' negligence: Yati Narsinghanand",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tYati Narsinghanand Giri, the Peethadheeshwar of Shiv Shakti Dham Dasna and Mahamandaleshwar of Shri Panchdashnam Juna Akhara, on Tuesday blamed official negligence for the Mauni Amavasya stampede at the Prayagraj Maha Kumbh.</p>\n<p>\r\n\tHe said he has written a letter in blood to Uttar Pradesh Chief Minister Yogi Adityanath under the banner of Shri Panchdashnam Juna Akhara.</p>\n<p>\r\n\tIn the letter, he wrote, \"The inhumane behaviour of your shameless, corrupt and insensitive officials towards Hindus on Mauni Amavasya has compelled me to write this letter.\"<small class=\"brtagPara\"> </small>\r\n\tHe further said, \"This horrific massacre (the Mauni Amavasya incident) is not my primary concern. My real concern is the great catastrophe that is rapidly approaching the Hindu society. To prevent this catastrophe, Hindus chose Narendra Modi as India's prime minister and you as Uttar Pradesh's chief minister. Out of this same fear, a large section of Hindus today wants to see you as India's prime minister.\"<small class=\"brtagPara\"> </small>\r\n\tNarsinghanand warned that \"this catastrophe has already taken the form of a rapidly-growing population of Islamist jihadists, posing a severe threat to the Hindu society. You are seen as the shining sun of Sanatan Dharma, deeply revered in the hearts of most Hindus. The majority of Hindus view you as their only protector\".</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tHe also criticised the state government's firearm-licensing policy, saying, \"Your government's firearm licence policy is helping these elements achieve their objectives. While previous governments freely distributed gun licences to their workers and voters, in the last seven-and-a-half years of your tenure, Hindus -- ?who gave you a massive mandate -- have barely received any firearm licences.\"<small class=\"brtagPara\"> </small>\r\n\tNarsinghanand urged Adityanath to revise the gun-licence policy, saying, \"Hindus need firearm licences now solely to protect their women and wealth when necessary. Therefore, I appeal to you to change your firearm policy and grant licences to every Hindu so that they can protect their sisters and daughters.\"<small class=\"brtagPara\"> </small>\r\n\tAt least 30 pilgrims died and 60 were injured after the pre-dawn stampede at Sangam on January 29 on the occasion of Mauni Amavasya, with police saying overcrowding led to the incident.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAdityanath has hinted at a conspiracy behind the incident and the government has ordered a judicial probe.</p><p></p></div>",
            "pub_date": "2025-02-05 10:25:26",
            "link": "https://www.business-standard.com/india-news/stampede-in-mahakumbh-caused-by-officials-negligence-yati-narsinghanand-125020500018_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500018"
        },
        {
            "title": "AAP's Satyendra Jain files defamation case against BJP leader Karnail Singh",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe AAP leader and former Delhi Minister <a href=\"https://www.business-standard.com/about/who-is-satyendar-jain\" target=\"_blank\">Satyendra Jain</a> has moved a defamation complaint against Karnail Singh, the BJP candidate against him from Shakoor Basti in assembly polls. Jain alleged that Singh made a defamatory statement against him during an interview on a news channel on January 19.</p>\n<p>\r\n\tIt is alleged by Jain that Karnail Singh made the statement that the <a href=\"https://www.business-standard.com/india-news/decoding-the-ed-understanding-its-history-powers-and-criticism-123112200730_1.html\" target=\"_blank\">Enforcement Directorate (ED)</a> recovered 37 Kg of gold from his house and he has 1100 Acres of land in his name.<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/elections/delhi-elections/delhi-assembly-election-2025-voting-live-updates-5-feb-bjp-aap-congress-delhi-vidhan-sabha-polling-percentage-125020500062_1.html\" target=\"_blank\"><strong>DELHI ELECTIONS 2025 VOTING DAY LIVE</strong></a></p>\n<p>\r\n\tThe Rouse Avenue court is to hear the defamation complaint on February 6.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe plea has been moved through advocate Rajat Bhardwaj. The plea further stated that Singh made a statement that Jain had made his wealth through corruption and the money was supposed to be spent on the public.</p>\n<p>\r\n\tIt is further alleged that Singh made a false statement that a huge gold was recovered from Jain's house and he is 'Bhoo Mafia', and will go to jail again.</p>\n<p>\r\n\tIt is also alleged that Singh defamed the complainant by calling him corrupt and fraud. It is also alleged that several other malicious and defamatory allegations were levelled against the complainant.</p>\n<p>\r\n\tDelhi will go to polls on February 5 and counting of votes will be done on February 8.</p><p></p></div>",
            "pub_date": "2025-02-05 10:25:25",
            "link": "https://www.business-standard.com/elections/delhi-elections/aap-s-satyendra-jain-files-defamation-case-against-bjp-leader-karnail-singh-125020401845_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401845"
        },
        {
            "title": "Markets Today: Services PMI; MPC; Trump-China news; Swiggy, Titan Q3; IPO",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Stock Markets Today, February 5, 2025: </strong>The Reserve Bank of India’s (RBI) <a href=\"https://www.business-standard.com/finance/news/rbi-mpc-2025-time-dates-when-and-where-to-watch-guv-sanjay-malhotra-live-125020400781_1.html\" target=\"_blank\">Monetary Policy Committee (MPC) meeting</a>, India Service PMI, strong global market trends, China's response to Trump tariffs, and <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">ongoing Q3 earnings</a> are expected to influence the benchmark indices, Sensex and Nifty, today.</div>\n<div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tAt 6:33 AM, GIFT Nifty futures were up 71 points at 23,856, signaling a higher start for Indian markets.</div>\n</div>\n<div>\r\n\tIn the <a href=\"https://www.business-standard.com/markets/news/markets-log-biggest-jump-in-a-month-sensex-ends-1-397-points-higher-125020401571_1.html\" target=\"_blank\">previous session</a>, the Sensex closed at 78,583.81, up 1,397.07 points (1.81 per cent), while the Nifty ended at 23,739.25, up 387.20 points (1.62 per cent), after foreign institutional investors (FIIs) purchased shares worth Rs 809.23 crore on February 4.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tDomestic institutional investors (DIIs), meanwhile, offloaded shares worth Rs 430.70 crore.<small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<small class=\"brtag\"> </small> <strong>Also Read: </strong><a href=\"https://www.business-standard.com/economy/news/us-china-trade-war-may-open-new-opportunities-for-indian-exporters-125020401443_1.html\" target=\"_blank\">US-China trade war may open new opportunities for Indian exporters</a></div>\n<small class=\"brtag\"> </small>\n<div>\n<div>\n<strong>Domestic cues</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe RBI's MPC will begin its last monetary policy meeting for the ongoing financial year today, February 5. The markets are discounting the Committee, headed by newly appointed Governor Sanjay Malhotra, to deliver its <a href=\"https://www.business-standard.com/economy/news/all-eyes-on-rbi-governor-sanjay-malhotra-as-mpc-meeting-begins-on-wednesday-125020401645_1.html\" target=\"_blank\">first repo rate cut in nearly five years</a> when it concludes its meeting on Friday, February 7, 2025.</div>\n<small class=\"brtag\"> </small></div>\n<div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tMarket participants are awaiting earnings reports from companies like <a href=\"https://www.business-standard.com/markets/news/swiggy-q3-preview-analysts-expect-loss-to-widen-qoq-revenue-may-rise-10-125020400348_1.html\" target=\"_blank\">Swiggy</a>, Zydus Life, and Cummins among others. The market will also react to results from <a href=\"https://www.business-standard.com/companies/news/titan-net-profit-largely-flat-in-q3-fy25-due-to-cut-in-customs-duty-125020401422_1.html\" target=\"_blank\">Titan</a>, <a href=\"https://www.business-standard.com/companies/news/tata-power-q3fy25-results-net-profit-rises-8-to-rs-1-030-7-crore-125020401517_1.html\" target=\"_blank\">Tata Power</a>, Whirlpool, and Religare Enterprises, among several others.</div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Also Read: </strong><a href=\"https://www.business-standard.com/markets/news/itc-hotels-removed-from-sensex-dr-agarwal-slips-on-stock-market-debut-125020401354_1.html\" target=\"_blank\">ITC Hotels removed from Sensex; Dr Agarwal slips on stock market debut</a></div>\n<div>\n<small class=\"brtagPara\"> </small>\n<div>\n<small class=\"brtag\"> </small> <strong>Sebi and other market news</strong></div>\n</div>\n<div>\n<small class=\"brtag\"> </small> The Securities and Exchange Board of India (Sebi) has <a href=\"https://www.business-standard.com/markets/news/sebi-tightens-algo-trading-rules-to-plug-gaps-boost-investor-protection-125020401407_1.html\" target=\"_blank\">introduced new regulations requiring algorithmic trading</a> providers to be empaneled with stock exchanges and establishing rules for using application programming interfaces (APIs). These changes aim to close regulatory gaps and improve investor protection.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAlthough benchmark indices have dropped over 10 per cent from their highs, <a href=\"https://www.business-standard.com/markets/news/two-thirds-of-sectoral-indices-still-a-premium-to-10-yr-averages-125020400946_1.html\" target=\"_blank\">two-thirds of sectoral indices are still trading at a premium</a> compared to their 10-year average price-to-earnings (P/E) multiples, according to Motilal Oswal's report.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Also Read:</strong> <a href=\"https://www.business-standard.com/markets/news/pce-facility-success-depends-on-investor-appetite-market-reforms-125020401573_1.html\" target=\"_blank\">PCE facility success depends on investor appetite, market reforms</a><small class=\"brtag\"> </small></div>\n<div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tAdditionally, the <a href=\"https://www.business-standard.com/markets/stock-market-news/diis-close-india-inc-ownership-gap-with-foreign-portfolio-investors-125020401430_1.html\" target=\"_blank\">gap in ownership between foreign portfolio investors</a> (FPIs) and domestic institutional investors (DIIs) has narrowed to a record low of 33 basis points (bps) by December 2024, the smallest since 2009.</div>\n</div>\n<div>\n<div>\n<small class=\"brtag\"> </small> Investors also await Services PMI final figures for January.<small class=\"brtagPara\"> </small> Notably, over 1.5 crore <a href=\"https://www.business-standard.com/elections/delhi-elections/delhi-assembly-election-2025-voting-live-updates-5-feb-bjp-aap-congress-delhi-vidhan-sabha-polling-percentage-125020500062_1.html\" target=\"_blank\">voters in Delhi will cast their votes</a> today, to elect the next government. The ruling Aam Aadmi Party (AAP) is aiming for a third consecutive term, while the Bharatiya Janata Party (BJP) and Congress are hoping for a comeback in the national capital.</div></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>IPO market</strong><small class=\"brtag\"> </small></div>\n<div>\n<small class=\"brtag\"> </small> Amwill Healthcare IPO (SME) and Ken Enterprises IPO (SME) will open for subscription. <a href=\"https://www.business-standard.com/markets/ipo/chamunda-electrical-ltd-ipo-94038\" target=\"_blank\">Chamunda Electricals IPO</a> (SME) will enter Day 2.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Commodity market </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGold prices hit an all-time high on Tuesday as investors flocked to the safe-haven asset following China's retaliation with tariffs on the US Spot gold increased 1.1 per cent to $2,843.06 per ounce. US gold futures rose 0.6 per cent to $2,873.70.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, US oil prices rebounded from earlier losses after a US official confirmed President Trump’s plan to intensify the ‘maximum pressure’ campaign on Iran, aiming to reduce Iranian oil exports to zero. US WTI crude dropped 0.63 per cent to $72.70. Global Brent crude futures edged up 0.32 per cent, to $76.20.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Global cues</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGlobal markets showed positive momentum as Asia-Pacific markets rose on Wednesday, following an uptick in US stocks. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWall Street overcame concerns surrounding Trump's tariffs and China's retaliation. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChina resumes trading after the Lunar New Year holidays today. Investors will eye Chinese markets especially after the government imposed tariffs on US imports in response to US duties on Chinese exports.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLater in the day, China is expected to release its Caixin Services PMI figures for January, offering insights into the country's services activity. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLast checked, Nikkei was up 0.25 per cent, while the Topix index rose 0.50 per cent. Kospi jumped 1.07 percent. ASX 200 was up 0.76 per cent.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, in the US, all three major indexes rose overnight amid global trade developments. Nasdaq rose 1.35 per cent, while the S&amp;P 500 climbed 0.72 per cent. Dow Jones settled 0.30 per cent higher.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInvestors now await January Services PMI final for UK and US, coupled with US trade data, which is expected later in the day.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em><strong>Here's how analysts are assessing today's (February 5) trading session:</strong></em></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Shrikant Chouhan, head of equity research at Kotak Securities</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFor traders now, 23,600/78100 and 23,500/77800 would be the key support zones, while 23,800/78700-23,850/78900 could act as key resistance areas for the bulls.</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rupak De, senior technical analyst at LKP Securities</strong></div>\n<div>\n<small class=\"brtag\"> </small> In the short-term, the index may move toward 24,050 and higher, while support levels are placed at 23,500 and 23,250.</div></div>",
            "pub_date": "2025-02-05 10:20:28",
            "link": "https://www.business-standard.com/markets/news/markets-today-services-pmi-mpc-trump-china-news-swiggy-titan-q3-ipo-125020500073_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500073"
        },
        {
            "title": "Recovery work resumes at site of plane collision near Washington DC",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tCrews worked Tuesday to try to recover the plane's cockpit and the rest of the remains of the 67 people who died in last week's midair collision between a passenger jet and Army helicopter near the nation's capital.</p>\n<p>\r\n\tThey said their work might depend upon the wind and tidal conditions in the Potomac River, where the aircraft crashed last Wednesday night after colliding as the American Airlines flight was about to land at nearby Ronald Reagan National Airport. All 67 people on both aircraft were killed.</p>\n<p>\r\n\tBy midday, they were working to raise another large piece of the plane. The National Transportation Safety Board said it didn't plan to provide further updates from the scene.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAuthorities have recovered and identified the remains of all the 67 people and have said they are confident they will find all of the victims. They are focusing first on the jet and hope to recover the Black Hawk helicopter later this week.</p>\n<p>\r\n\tCol Francis B Pera of the Army Corps of Engineers said salvage crews on Monday were able to pull one of the two jet engines from the river, along with large pieces of the plane's exterior. They were also working to recover a wing of the plane, which had flown out of Wichita, Kansas.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tSixty passengers and four crew were on the American Airlines flight, including figure skaters returning from the 2025 US Figure Skating Championships in Wichita.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe Black Hawk helicopter was on a training mission. Army Staff Sgt Ryan Austin O'Hara, 28, of Lilburn, Georgia; Chief Warrant Officer 2 Andrew Loyd Eaves, 39, of Great Mills, Maryland; and Capt Rebecca M Lobach, of Durham, North Carolina, were aboard.</p>\n<p>\r\n\tFederal investigators are trying to piece together the events that led to the collision. Full investigations typically take a year or more, but investigators hope to have a preliminary report within 30 days.</p>\n<p>\r\n\tWednesday's crash was the deadliest in the US since Nov 12, 2001, when a jet slammed into a New York City neighbourhood just after takeoff, killing all 260 people on board and five on the ground.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 10:20:28",
            "link": "https://www.business-standard.com/world-news/recovery-work-resumes-at-site-of-plane-collision-near-washington-dc-125020500002_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500002"
        }
    ]
}