{
    "data": [
        {
            "title": "We hope 50% of our portfolio companies will go public in 5 yrs: Michael Moe",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\n<strong>Michael Moe</strong>, founding partner and chief executive officer, GSV Ventures, expects half the firm’s portfolio companies in India to go public in five years. GSV Ventures has invested in Indian edtech players such as PhysicsWallah, Emeritus, AdmitKard, Apna, and Bright Champs. In an interview with <em>Udisha Srivastav</em> on the sidelines of the ASU + GSV &amp; Emeritus summit, he talks of India’s edtech sector and the impact of artificial intelligence (AI). Edited excerpts:</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Edtech in India has faced the brunt of high valuation. What trends do you foresee in fundraising in 2025?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe edtech sector in India — and globally</div></div>",
            "pub_date": "2025-02-04 23:05:29",
            "link": "https://www.business-standard.com/companies/interviews/we-hope-50-of-our-portfolio-companies-will-go-public-in-5-yrs-michael-moe-125020401417_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401417"
        },
        {
            "title": "Delhi HC refuses relief to Rashmi Saluja in Religare reappointment matter",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Delhi High Court (HC) on Friday denied relief to Rashmi Saluja, executive chairperson of Religare Enterprises (REL), in her plea against a resolution seeking to replace her with a new director at the upcoming annual general meeting (AGM) on February 7.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja, who is set to retire by rotation, argued that her appointment was for a fixed term of five years, ending 2028.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, the court noted that while she was appointed in 2023 for a five-year term, the board meeting and AGM minutes explicitly stipulated retirement by rotation.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJustice Purushaindra Kumar Kaurav said, “This clearly indicates that the understanding of the plaintiff that she is liable to retire is not something that was introduced for the first time in 2025...It is evident that the plaintiff has failed to establish a prima facie case in her favour.”</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe court further emphasised that every shareholder has the right, subject to statutory procedures, to participate in the company's affairs. “The participation is essentially to uphold the principle of corporate democracy. Shareholders must be allowed to regulate and determine the affairs of the company through general meetings, which serve as the primary forum for decision-making within a corporate entity,” the court stated.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe HC's decision clears the way for the AGM and the voting on the appointment of a new director to replace Saluja.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHer plea was opposed by four independent directors of the company and the Burman family, the largest shareholder in REL that launched an open offer to acquire an additional 26 per cent stake. The open offer, which closes on Friday, has so far received bids for only 1,668 shares.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja has offered herself for reappointment, and the outcome of the voting will be known at the AGM. The AGM, originally scheduled for December, was delayed due to legal proceedings before the Madhya Pradesh High Court. A plea filed by a non-shareholder was later dismissed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThree leading proxy firms — Stakeholders Empowerment Services, Institutional Investor Advisory Services, and InGovern Research — have recommended an 'against' vote on the resolution pertaining to Saluja's reappointment. They cited concerns over corporate governance, ESOPs, and higher remuneration.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRefuting these concerns, REL described the reports as “orchestrated and motivated” and questioned the timing of the advisory firms' reports.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company stated that matters regarding compensation practices and ESOPs were sub-judice and that any attempt to influence public opinion through “misleading analysis” was unethical.</div></div>",
            "pub_date": "2025-02-04 23:05:27",
            "link": "https://www.business-standard.com/companies/news/delhi-hc-refuses-relief-to-rashmi-saluja-in-religare-reappointment-matter-125020401469_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401469"
        },
        {
            "title": "Gati Shakti masterplan: Detailed norms soon on data access to pvt sector",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tInstead of giving access to the Gati Shakti national masterplan portal, the government may provide data and information based on queries raised by the private sector.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Department for Promotion of Industry and Internal Trade (DPIIT) will soon spell out the data-sharing norms of the Gati Shakti national masterplan with the private sector, Secretary Amardeep Singh Bhatia said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA number of options are being explored, and need-based information sharing could be one of the most ‘secure’ ways to share data. A final call is, however, yet to be made.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCurrently, only state and central government ministries and departments can access</div></div>",
            "pub_date": "2025-02-04 23:00:39",
            "link": "https://www.business-standard.com/economy/news/gati-shakti-masterplan-detailed-norms-soon-on-data-access-to-pvt-sector-125020401546_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401546"
        },
        {
            "title": "Ola founder Bhavish Aggarwal to invest Rs 2,000 crore in AI firm Krutrim",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tOla founder Bhavish Aggarwal today announced investment of Rs 2,000 crore in its artificial intelligence (AI) firm Krutrim. He also committed an investment of Rs 10,000 crore by next year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith this investment, the first AI unicorn in India has managed to have raise investments of close to $280 million. Along with the Rs 2,000 crore (around $230 million) and the $50 million the firm raised from Matrix Partners India in early 2024. According to sources, the Rs 2,000 crore have been raised via equity and debt. The company did not respond to the query of fund raise.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe only other player in the Indian AI ecosystem to raise funds is Sarvam AI, which raised $41 million in 2023, which was led by Lightspeed along with participation from Peak XV Partners and Khosla Venture. Hanooman, the other player which is also building SMLs, had plans to raise funds.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe founder of Ola Electric and Ola Mobility also announced KritrimAI lab. More importantly, he also announced that the company is releasing Krutrim’s work to the open source community and also published a few of its technical reports. The announcement to open source its model comes at the back of DeepSeek’s announcement to open source its own model.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a X post, Aggarwal said: “We’ve been working on AI for a year, today we’re releasing our work to the open source community and also publishing a bunch of technical reports. Our focus is on developing AI for India - to make AI better on Indian languages, data scarcity, cultural context etc.”</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHe further added that they have deployed India’s first GB200 deployment in partnership with NVIDIA, and will be live by March, “…and we will make it the largest supercomputer in India by end of year,” he said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a X post on January 31, Aggarwal also said that Kritrim is also using the DeepSeek model. “India can’t be left behind in AI. @Krutrim has accelerated efforts to develop world class AI. As a first step, our cloud now has DeepSeek models live, hosted on Indian servers. Pricing lowest in the world,” he had posted on X. He also added that thousands of developers have already used DeepSeek models hosted on Kritrim cloud.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tToday’s announcement of AI labs is crucial for Krutrim, as for the first time the company is sharing its models with the open source community. So far the company has not shared details about its models.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSome of the models that Krutirm has released to the Open Source community include Krutrim 2 and Krutrim 1 LLMs. “While Krutrim 1 (India’s first LLM) was launched on Jan 24, it was a basic 7B model. We’re launching Krutrim 2 today as a much improved model,” said Aggarwal. The company claims that Krutrim 2 is a best-in-class LLM for Indic.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Krutrim-2 is a 12 billion parameters dense transformer model, built on the Mistral-NeMo architecture. Our team ensured that Krutrim-2 received comprehensive training on a rich dataset encompassing English, Indic languages (hundreds of billions of tokens), code snippets, mathematical concepts, literary works, and high quality synthetically generated content. It is natively multilingual (English and 22 Indian languages) and supports a context window of 128K tokens,” said the firm's blog.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company also released Chitrarth 1, vision language model built on top of Krutrim 1 capable of understanding images and documents.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThey also released the speech language model, Dhwani 1built on top of Krutrim 1 capable of tasks like Speech translations.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tKrutrim also announced Vyakhyarth 1, an art Indic Embedding model for use cases like Search and RAG.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAggarwal also added that in addition to these releases they have also developed benchmarks for Indian LLM performance. “Since there was no global benchmark for Indic performance, we’ve developed “BharatBench”…” he added. It is a special evaluation tool designed to test how well AI models understand and perform in Indian languages and cultural contexts.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhether these benchmarks’ will be accepted by other builders of AI models in India is debatable. “Existing benchmarks in English and Chinese, such as MMLU, ARC, TruthfulQA and others, do not adequately capture the unique linguistic and cultural nuances of India. There is a specific need for a benchmark that addresses the diversity of India,” explained Krutrim on the need for benchmarking Indic languages.</div></div>",
            "pub_date": "2025-02-04 23:00:39",
            "link": "https://www.business-standard.com/companies/news/ola-founder-bhavish-aggarwal-to-invest-rs-2-000-crore-in-ai-firm-krutrim-125020400838_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400838"
        },
        {
            "title": "Trai recommends opening up key 5G spectrum band for upcoming auctions",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe<strong><a href=\"https://www.business-standard.com/topic/telecom-regulatory-authority-of-india-trai\" target=\"_blank\"> Telecom Regulatory Authority of India </a></strong>(Trai) has recommended the auction of several 5G high-band or millimetre wave (mmWave) spectrum in upcoming spectrum auctions. On Tuesday, TRAI said spectrum in the 37-37.5 GHz and 37.5-40 GHz frequency ranges should be auctioned, while it has recommended against auctions for the 42.5-43.5 GHz frequency range.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe move is expected to find support from telecom service providers who have pushed for access to it. MmWave or spectrum bands above 24 gigahertz (GHz) are a valuable resource when targeting densely populated urban areas. The high band offers an opportunity for service providers to offer unprecedented peak rates, low latency, and high capacity.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTRAI has said telcos will have the option to pay for the spectrum upfront or in 20 equal annual instalments. While mmWave is limited due to signals not being able to travel as far as mid- and low-band signals—often travelling less than a mile and being more susceptible to interference from trees, buildings, and even glass—it offers significant benefits. If the signal remains unencumbered, users can achieve connection speeds between 1 Gbps and 3 Gbps or even higher.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe regulator has recommended that, in addition to access service providers, internet service providers and machine-to-machine service providers should also be permitted to participate in the auction.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTRAI had issued a consultation paper on the issue back in April last year. Subsequently, 12 stakeholders submitted comments, and four stakeholders furnished counter-comments. On Tuesday, it also released its recommendations on block sizes for the spectrum bands and the reserve prices for MHz in the 37-40 GHz band. The prices range from a high of Rs 76 lakh in the metro circle of Delhi to Rs 3 lakh in Jammu &amp; Kashmir and the North East.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, TRAI has pointed out that some bands cannot be opened up. \"Owing to the non-availability of the device ecosystem in the 42.5-43.5 GHz frequency range, it will be prudent that the frequency range 42.5-43.5 GHz is not put to auction in the forthcoming spectrum auction. DoT may send a separate reference for seeking the Authority’s recommendations for the 42.5-43.5 GHz frequency range for IMT at an appropriate time,\" TRAI said. Telcos had earlier pushed for opening up spectrum in this band.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile the 37-37.5 GHz band has been globally earmarked for broadband mobile use, the 37.5-40 GHz and 40-42.5 GHz bands have both mobile use and satellite gateway link uses. Similarly, while the 40-42.5 GHz band is only for satellite usage, the 42.5-43.5 GHz band has both usage types. While telcos have called for flexible use between terrestrial and satellite-based networks, arguing that there would be no interference, TRAI has not clarified its stance on the matter.</div></div>",
            "pub_date": "2025-02-04 22:55:28",
            "link": "https://www.business-standard.com/industry/news/trai-recommends-opening-up-key-5g-spectrum-band-for-upcoming-auctions-125020401599_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401599"
        },
        {
            "title": "From Boardroom buzz to global chants: Chandrika Tandon's Grammy journey",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tBorders and boundaries blurred as congratulations poured in for Indian-American vocalist Chandrika Krishnamoorthy Tandon, who won the Grammy for her album “Triveni” under the category for the Best New Age, Ambient, or Chant Album on Monday. In an email interview to <em>Business Standard</em>, Tandon said: \"It is surreal and exciting on many levels. Triveni was a collaborative experiment bringing ancient mantras in a global bed of music — and the fact that it succeeded is extremely gratifying.\" </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe 71-year-old business leader made history alongside South African flutist Wouter Kellerman and Japanese cellist Eru Matsumoto, triumphing over notable contenders like Anoushka Shankar and Ricky Kej. About her Indian-origin competitors, Tandon said: \"We had such fantastic fellow nominees in our category with awesome music — it was great to have the Indian roots reflected in full force.\" </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTandon began her professional career as a Citibank banker in Beirut during the Lebanese Civil War. As one of just eight women in her IIM-A batch, she later became the first Indian-American woman elected partner at McKinsey &amp; Company in the 1980s. In 1992, she founded the New York-based consultancy, Tandon Capital Associates.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSo, is the corporate world still an integral part of her life? <small class=\"brtag\"> </small></div>\n<div>\r\n\t\"Indeed it is,\" she said, \"but it is not only my corporate life but also my work in the US academic sphere as a Trustee of New York University (the largest private global university) and Chair of the NYU Tandon School of Engineering, and other organisations like the New York Academy of Sciences. Keeps both sides of the brain active and engaged.\" </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFrom Prime Minister Narendra Modi to business leaders like Kiran Mazumdar-Shaw and Harsh Goenka, as well as expatriate organisations such as India in New York, many extended their felicitations. “Congratulations to @chandrikatandon on winning the Grammy. We take great pride in her accomplishments as an entrepreneur, philanthropist, and, of course, musician! It is commendable how she has remained passionate about Indian culture and has worked to popularise it,” Modi posted on X, recalling his 2023 meeting with her in New York.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA trained vocalist in Carnatic and Hindustani classical music, Tandon was previously nominated for a Grammy in 2011 in the Contemporary World Music category for her debut album, “Soul Call”.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe older sister of former PepsiCo CEO Indra Nooyi, Tandon grew up in Chennai, attended Madras Christian College (MCC), and later earned a master’s degree from the Indian Institute of Management Ahmedabad. “This remarkable achievement reflects her exceptional talent and dedication to the arts,” MCC’s alumni association posted on X.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring an interview for CNBC’s The Brave Ones series, Tandon spoke about a pivotal moment in her career when, despite rapid business growth, she felt unfulfilled. “I started to think… ‘Is this what my life’s going to be? One deal after another?’” she recalled. In the same series, her daughter, Lita Tandon, shared that this turning point led her mother to fully embrace music and the things that brought her joy. </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInspired by her passion, Tandon produced her first album, “Soul Call”, as a gift for her father-in-law’s 90th birthday, featuring recordings of his favourite chants. The album later earned a Grammy nomination for Contemporary World Music in 2011.</div></div>",
            "pub_date": "2025-02-04 22:55:27",
            "link": "https://www.business-standard.com/entertainment/from-boardroom-buzz-to-global-chants-chandrika-tandon-s-grammy-journey-125020401578_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401578"
        },
        {
            "title": "US-China trade war may open new opportunities for Indian exporters",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<div>\r\n\t\tThe restart of a tariff war between the United States (US) and China may have a positive impact on Indian exporters, as observed from the previous trade war during US President <a href=\"https://www.business-standard.com/topic/donald-trump\" target=\"_blank\">Donald Trump</a>’s first term.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“When the trade war between the US and China took place last time, India was the fourth largest beneficiary of the trade diversion. Data shows that during the trade war (2017-19), there was a significant jump in exports to the US,” a senior government official said.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\tDays after taking over as President of the US, Trump on Saturday announced a 25 per cent tariff on imports from its top two trade partners and neighbouring nations — Canada and Mexico — and a 10 per cent levy on Chinese imports.</div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tWhile Canada and Mexico retaliated, on Monday, a 30-day suspension on US tariffs was announced after reaching an agreement with Trump.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\tHowever, China on Tuesday announced retaliation and said the country plans to impose higher tariffs on US imports.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\t\tTrump’s move is in line with its protectionist ‘America First Trade Policy’ that it plans to implement. The policy will include imposition of global ‘supplemental tariffs’ to tackle ‘unfair and unbalanced trade’.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tAn external revenue service (ERS) is also being set up to collect tariff, duties and other foreign-related revenues.</div>\n<div>\r\n\t\tHowever, the official warned that going ahead, India may not be completely ‘immune’ from additional tariffs from the US, considering Trump’s announcement of America’s latest policy stance.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\t\tExporters have also stated that the imposition of Customs duties by the US on imports from China provides huge export opportunities for them.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe tariffs would affect exports from China to the US as they would push up prices of their goods in the American market, making them less competitive.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\tOfficials said sectors such as electronics, pharmaceuticals, textiles, auto components and chemicals may see further export boost to the US due to the trade war between Washington and Beijing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tTrade between India and the US is robust and has been growing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tDuring the financial year 2023-24, the size of the bilateral merchandise trade between both the nations stood at nearly $120 billion. The trade balance has been in favour of India, with a surplus of $35.3 billion. The US is also India’s largest trade partner.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small></div>\n<small class=\"brtagPara\"> </small> <small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 22:50:31",
            "link": "https://www.business-standard.com/economy/news/us-china-trade-war-may-open-new-opportunities-for-indian-exporters-125020401443_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401443"
        },
        {
            "title": "GIC Re board of directors approves setting up wholly owned subsidiary in UK",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tGeneral Insurance Corporation of India (GIC Re)'s board of directors has approved the incorporation of a wholly owned subsidiary—GIC Re, India Service Company—in the United Kingdom.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe new company will be promoted by the corporation and incorporated as per applicable UK laws.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The approval from the Insurance Regulatory and Development Authority of India (Irdai) for the formation of the wholly owned subsidiary shall be sought before making the investment, and directives as per Foreign Exchange Management (Overseas Investment) Directions, 2022, shall be complied with,\" the company said in an exchange filing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company has no minimum capital requirement and can be set up with a capital of £1. The corporation will initially subscribe to the minimum capital as may be necessary, at face value.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCurrently, GIC Re's group includes subsidiary companies such as GIC Re South Africa, GIC Re Corporate Member, London, and GIC Perestrakhovanie LLC, Moscow.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt has branch offices in London and Kuala Lumpur. In April 2018, a syndicate fully capitalised by GIC Re became operational at Lloyd's of London. This syndicate is expected to scale up over the next few quarters towards achieving the medium-term management objective of a 60:40 (domestic: international) risk portfolio composition.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAdditionally, GIC Re has 100 per cent subsidiaries in South Africa, Russia, and the United Kingdom, along with associate companies in Bhutan, Singapore, and India. GIC Re transacts business across 137 countries.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe corporation reported a 6.8 per cent growth in net profit to Rs 1,621.35 crore in the quarter ended December 31, 2024, compared to the year-ago period, driven by narrowing underwriting losses and premium growth. The net premium rose by 18 per cent year on year (Y-o-Y) to Rs 9,281.03 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe underwriting loss of the company dropped to Rs 582.4 crore in the October-December period of FY25, compared to a loss of Rs 1,547.6 crore last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe combined ratio of the reinsurer dropped to 107.83 per cent in Q3 FY25 from 120.47 per cent in Q3 FY24. The solvency ratio increased to 352 per cent from 294 per cent in the year-ago period.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 22:50:30",
            "link": "https://www.business-standard.com/companies/news/gic-re-board-of-directors-approves-setting-up-wholly-owned-subsidiary-in-uk-125020401604_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401604"
        },
        {
            "title": "JB Chemicals Q3 results: Profit rises 21.6% to Rs 162 cr, revenue up 14%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tJB Chemicals and Pharmaceuticals posted a 21.64 per cent year-on-year (Y-o-Y) increase in net profit during Q3FY25, reaching Rs 162.4 crore, while revenue from operations increased by 14 per cent Y-o-Y to Rs 963.4 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSequentially, revenue declined by 3.71 per cent, with net profit also falling by 6.92 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCommenting on the results, Nikhil Chopra, chief executive officer and whole-time director of JB Pharma, stated, \"JB has delivered consistent growth over the last few years, enabled by our mix of businesses and markets—specifically our focus on India branded formulations, CDMO, and select international markets that play to our strengths, with limited revenues in countries that might present trade-related or economic volatility challenges.\"</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis quarter, the domestic formulations business was a key driver, achieving 22 per cent Y-o-Y growth with revenue of Rs 566 crore. The domestic market now accounts for 59 per cent of total revenue in 9M FY25, up from 55 per cent in 9M FY24.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGross margins stood at 67.1 per cent for Q3FY25 and 66.5 per cent for 9M FY25. Excluding the ophthalmology business, gross margins improved in both periods, driven by cost optimisation, a favourable product mix, and price growth.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOther expenditure as a percentage of sales decreased to 22.7 per cent in Q3FY25 from 23.2 per cent in Q3FY24.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFinance costs decreased significantly to Rs 3 crore from Rs 12 crore due to lower gross debt. The company had a net cash position of Rs 516 crore as of December 31, 2024, with gross debt at Rs 54 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInternational business revenue grew by 4 per cent to Rs 397 crore in Q3FY25 compared to Rs 383 crore in the same period last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe international formulations business experienced a 4 per cent decline in Q3FY25, with revenue of Rs 254 crore. While the South Africa business and branded generics export markets showed growth, revenue from the US and Russia businesses decreased Y-o-Y.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe CDMO business demonstrated strong growth, recording a 33 per cent increase in Q3FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe combined revenue from the domestic and CDMO businesses represented 70 per cent of the overall revenue for 9M FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe stock rose by 1.59 per cent to Rs 1,741.35 a piece on the BSE. The results were announced after market hours on Tuesday.</div></div>",
            "pub_date": "2025-02-04 22:45:31",
            "link": "https://www.business-standard.com/companies/news/jb-chemicals-q3-results-profit-rises-21-6-to-rs-162-cr-revenue-up-14-125020401590_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401590"
        },
        {
            "title": "Torrent Power Q3 results: PAT jumps 31% to Rs 489 cr on of higher revenues",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tTorrent Power on Tuesday posted a nearly 31 per cent rise in its consolidated net profit at Rs 489.33 crore compared to a year ago, mainly on the back of higher revenues due to increased sale of electricity from gas-based plants and gain from sale of non-current investments.</p>\n<p>\r\n\tThe company had a consolidated net profit of Rs 374.13 crore in the quarter ended December 2023, Torrent Power said in a statement.</p>\n<p>\r\n\tTotal income rose to Rs 6,671.25 crore in the reporting quarter from Rs 6,419.65 crore in the same period a year ago.</p>\n<p>\r\n\tThe board also approved an interim dividend for 2024-25 of Rs 14 per equity share (or at the rate of 140 per cent) on 50,39,03,543 equity shares of Rs 10 each.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe dividend will be remitted on or before March 06, 2025 to equity shareholders of the Company.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe record date for the dividend is Wednesday, February 12, 2025.</p>\n<p>\r\n\tThe company stated that the major reasons for higher profit is increase in contribution from gas-based power plants and gain on sale of non-current investments.</p>\n<p>\r\n\tTorrent Power, the Rs 27,183 crore integrated power utility of the Rs 41,000 crore Torrent Group, is one of the largest companies in the country's power sector with presence across the entire power value chain generation, transmission and distribution.</p><p></p></div>",
            "pub_date": "2025-02-04 22:45:29",
            "link": "https://www.business-standard.com/companies/results/torrent-power-q3-results-pat-jumps-31-to-rs-489-cr-on-of-higher-revenues-125020401471_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401471"
        }
    ]
}