{
    "data": [
        {
            "title": "Budget non-inflationary, focuses on fiscal prudence: Finance secy Pandey",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tFinance Secretary Tuhin Kanta Pandey on Tuesday said the government has taken measures to lower fiscal deficit and delivered a non-inflationary Budget, and hoped that the RBI's monetary policy will work in tandem with fiscal policy to support growth.</p>\n<p>\r\n\tHe also said that although rupee depreciation increases inflation on imported inputs, it also adds to export competitiveness.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/finance/news/india-to-assess-benefits-of-oecd-s-global-tax-deal-after-us-quits-fin-secy-125020400747_1.html\" target=\"_blank\">India to assess benefits of OECD's global tax deal after US quits: Fin secy</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tPandey said that the government has bettered its fiscal deficit projections for the current fiscal as well as the next. The fiscal deficit for FY'25 has been pegged lower at 4.8 per cent of GDP, lower than budgeted 4.9 per cent, while for FY'26 the deficit is projected to be 4.4 per cent, lower than what was given in the consolidation roadmap.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"It is very important to be very clear that we (government) have to remain within a certain fiscal regime. We have, to that extent, aided the monetary authorities to say that if they (RBI) have to do what they have to do, we are supportive. The fiscal policy and monetary policy need to work in tandem not at cross purposes,\" Pandey said.</p>\n<p>\r\n\tThe Secretary said the economy would reap a lot more benefits with monetary easing and keeping inflation under control.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\t\"Inflationary policies can really work only in the short-run in terms of pushing growth. If we have to have sustained growth, we need to have a good grip on inflation. That's the balancing that we need...,\" Pandey said at an Assocham post-Budget interaction.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe monetary policy committee (MPC) of the Reserve Bank of India (RBI) will begin its three-day meeting on February 5. The MPC will announce its policy decisions on February 7.</p>\n<p>\r\n\tTo a question on whether the Monetary Policy Committee will decide to cut policy rates, Pandey said \"I think it's a call that MPC will take. They are seized of the situation. They will take a call.\"<small class=\"brtagPara\"> </small>\r\n\tAsked if depreciating rupee could lead to a concern on the inflation front, he said: \"there are other factors that need to be taken into consideration by the RBI. Of course, the depreciation also brings to some extent imported inflation, but it also adds to export competitiveness to products\".</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tOn Monday, the rupee plunged 49 paise to close at an all-time low of 87.11 against the US dollar. The rupee recovered 3 paise to close at 87.08 (provisional) against US dollar on Tuesday, as the American currency index retreated from its elevated level after President Donald Trump agreed to pause tariffs on Mexico and Canada.</p>\n<p>\r\n\t\"Rupee is in a free-float system, external things are working. The RBI is watching, we are watching,\" Pandey said.</p>\n<p>\r\n\tWith the economic growth slowing to 4-year low of 6.4 per cent in current fiscal, as per NSO data, there is a growing clamour for a cut in benchmark policy rates.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tRetail inflation in December eased to 5.22 per cent, from 5.48 per cent in November, and remained within the RBI's tolerance band of 4 per cent (+/- 2 per cent).</p>\n<p>\r\n\tRBI has held policy rates steady at 6.5 per cent since February 2023 to control inflation.</p><p></p></div>",
            "pub_date": "2025-02-05 01:00:39",
            "link": "https://www.business-standard.com/budget/news/budget-non-inflationary-focuses-on-fiscal-prudence-finance-secy-pandey-125020401184_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401184"
        },
        {
            "title": "Chatroom: Surrender of erroneous drawback payment also attracts interest",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>We had exported certain goods for which we have received full payment. We have availed of duty drawbacks at the notified rates. Now, the buyer has raised some quality issues. He wants us to remit 5 per cent of the payment made or adjust 5 per cent in the value of the next shipment. Can we do so and if so, under what provisions?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPara C.22 of the RBI FED Master Direction no.16 dated 1st January 2016 (as amended) allows remittance of export claims where full payment is already realised. This provision requires surrender of proportionate export incentive.  A less messy way is to declare the full value in and allow a discount of 5% in your next shipment. That way, only the net value after deduction of the discount will flow into the EDPMS and the drawback claim will also be limited to the discounted value.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Due to some mistake at the Customs end we were paid drawback twice against the same shipment, something that we didn’t notice immediately.  Now, the Customs have discovered this mistake of double payment and asked us to surrender the drawback paid in excess, which we are quite ready to do. The trouble is they want interest from the date of payment till the date of surrender of the excess drawback. How can the Customs ask us to pay interest when the double payment was due to their fault and not ours?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSection 75A(2) of the Customs Act, 1962 says that ‘where any drawback has been paid to the claimant erroneously or it becomes otherwise recoverable under this Act or the rules made thereunder, the claimant shall, within a period of two months from the date of demand, pay in addition to the said amount of drawback, interest at the rate fixed under Section 28AA and the amount of interest shall be calculated for the period beginning from the date of payment of such drawback to the claimant till the date of recovery of such drawback’. So, you cannot avoid payment of interest @15 per cent p.a., the rate prescribed under notification no.33/2016-Cus dated 1st March 2016.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>We have sought a set-off of import payables and export receivables from our bank, who say that they cannot allow it because the imports and exports have taken place in different calendar years. We do not understand whether they are correct and how it matters whether the imports and exports took place in the same year or different years. We do not understand the way forward. Can you please guide us? </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCondition (g) at Para C.16 of the RBI FED Master Direction no.16/2015-16 dated 1st January 2016 (as amended) says that set-off shall be allowed between the export and import legs taking place during the same calendar year. In my opinion, this condition makes no sense and should be withdrawn. I suggest that you write to RBI seeking relaxation of this condition and get it forwarded by your bankers. You should get the relaxation without any hitch.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 01:00:38",
            "link": "https://www.business-standard.com/economy/news/chatroom-surrender-of-erroneous-drawback-payment-also-attracts-interest-125020401771_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401771"
        },
        {
            "title": "Cheetah 'Veera' gives birth to two cubs in MP's Kuno National Park",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tCheetah Veera gave birth to two cubs at Kuno National Park (KNP) in Madhya Pradesh's Sheopur district on Tuesday, Chief Minister Mohan Yadav said.</p>\n<p>\r\n\tWith these births, KNP is now home to 26 cheetahs, including 14 cubs.</p>\n<p>\r\n\tIn a post on X, Yadav said, \"Two cheetah cubs enter Madhya Pradesh's Jungle Book. I am happy to share that the number of cheetahs is continuously increasing in the state. Today, female cheetah Veera has given birth to two cubs.\"<small class=\"brtagPara\"> </small>\r\n\tHe congratulated the officers, doctors and field staff engaged in the cheetah project and said as a result of their tireless work, Madhya Pradesh is also known as the \"land of cheetahs\".</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe chief minister said with the increase in the cheetah population in the state, tourism in the state is getting a boost and opening new doors of employment.</p>\n<p>\r\n\t\"We are always ready for conservation, promotion and restoration of all wildlife along with cheetahs,\" he said.</p>\n<p>\r\n\tOn September 17, 2022, Prime Minister Narendra Modi released eight Namibian cheetahs five females and three males into enclosures at the KNP as part of the world's first intercontinental translocation of the big cats, seven decades after they became extinct in India due to hunting and habitat loss.</p><p></p></div>",
            "pub_date": "2025-02-05 00:55:28",
            "link": "https://www.business-standard.com/india-news/cheetah-veera-gives-birth-to-two-cubs-in-mp-s-kuno-national-park-125020401214_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401214"
        },
        {
            "title": "From Boardroom buzz to global chants: Chandrika Tandon's Grammy journey",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tBorders and boundaries blurred as congratulations poured in for Indian-American vocalist Chandrika Krishnamoorthy Tandon, who won the Grammy for her album “Triveni” under the category for the Best New Age, Ambient, or Chant Album on Monday. In an email interview to <em>Business Standard</em>, Tandon said: \"It is surreal and exciting on many levels. Triveni was a collaborative experiment bringing ancient mantras in a global bed of music — and the fact that it succeeded is extremely gratifying.\" </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe 71-year-old business leader made history alongside South African flutist Wouter Kellerman and Japanese cellist Eru Matsumoto, triumphing over notable contenders like Anoushka Shankar and Ricky Kej. About her Indian-origin competitors, Tandon said: \"We had such fantastic fellow nominees in our category with awesome music — it was great to have the Indian roots reflected in full force.\" </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTandon began her professional career as a Citibank banker in Beirut during the Lebanese Civil War. As one of just eight women in her IIM-A batch, she later became the first Indian-American woman elected partner at McKinsey &amp; Company in the 1980s. In 1992, she founded the New York-based consultancy, Tandon Capital Associates.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSo, is the corporate world still an integral part of her life? <small class=\"brtag\"> </small></div>\n<div>\r\n\t\"Indeed it is,\" she said, \"but it is not only my corporate life but also my work in the US academic sphere as a Trustee of New York University (the largest private global university) and Chair of the NYU Tandon School of Engineering, and other organisations like the New York Academy of Sciences. Keeps both sides of the brain active and engaged.\" </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFrom Prime Minister Narendra Modi to business leaders like Kiran Mazumdar-Shaw and Harsh Goenka, as well as expatriate organisations such as India in New York, many extended their felicitations. “Congratulations to @chandrikatandon on winning the Grammy. We take great pride in her accomplishments as an entrepreneur, philanthropist, and, of course, musician! It is commendable how she has remained passionate about Indian culture and has worked to popularise it,” Modi posted on X, recalling his 2023 meeting with her in New York.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA trained vocalist in Carnatic and Hindustani classical music, Tandon was previously nominated for a Grammy in 2011 in the Contemporary World Music category for her debut album, “Soul Call”.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe older sister of former PepsiCo CEO Indra Nooyi, Tandon grew up in Chennai, attended Madras Christian College (MCC), and later earned a master’s degree from the Indian Institute of Management Ahmedabad. “This remarkable achievement reflects her exceptional talent and dedication to the arts,” MCC’s alumni association posted on X.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring an interview for CNBC’s The Brave Ones series, Tandon spoke about a pivotal moment in her career when, despite rapid business growth, she felt unfulfilled. “I started to think… ‘Is this what my life’s going to be? One deal after another?’” she recalled. In the same series, her daughter, Lita Tandon, shared that this turning point led her mother to fully embrace music and the things that brought her joy. </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInspired by her passion, Tandon produced her first album, “Soul Call”, as a gift for her father-in-law’s 90th birthday, featuring recordings of his favourite chants. The album later earned a Grammy nomination for Contemporary World Music in 2011.<small class=\"brtagPara\"> </small></div></div>",
            "pub_date": "2025-02-05 00:55:27",
            "link": "https://www.business-standard.com/entertainment/from-boardroom-buzz-to-global-chants-chandrika-tandon-s-grammy-journey-125020401578_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401578"
        },
        {
            "title": "Cheetah 'Veera' gives birth to two cubs in MP's Kuno National Park",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tCheetah Veera gave birth to two cubs at Kuno National Park (KNP) in Madhya Pradesh's Sheopur district on Tuesday, Chief Minister Mohan Yadav said.</p>\n<p>\r\n\tWith these births, KNP is now home to 26 cheetahs, including 14 cubs.</p>\n<p>\r\n\tIn a post on X, Yadav said, \"Two cheetah cubs enter Madhya Pradesh's Jungle Book. I am happy to share that the number of cheetahs is continuously increasing in the state. Today, female cheetah Veera has given birth to two cubs.\"<small class=\"brtagPara\"> </small>\r\n\tHe congratulated the officers, doctors and field staff engaged in the cheetah project and said as a result of their tireless work, Madhya Pradesh is also known as the \"land of cheetahs\".</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe chief minister said with the increase in the cheetah population in the state, tourism in the state is getting a boost and opening new doors of employment.</p>\n<p>\r\n\t\"We are always ready for conservation, promotion and restoration of all wildlife along with cheetahs,\" he said.</p>\n<p>\r\n\tOn September 17, 2022, Prime Minister Narendra Modi released eight Namibian cheetahs five females and three males into enclosures at the KNP as part of the world's first intercontinental translocation of the big cats, seven decades after they became extinct in India due to hunting and habitat loss.</p><p></p></div>",
            "pub_date": "2025-02-05 00:50:30",
            "link": "https://www.business-standard.com/india-news/cheetah-veera-gives-birth-to-two-cubs-in-mp-s-kuno-national-park-125020401214_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401214"
        },
        {
            "title": "From Boardroom buzz to global chants: Chandrika Tandon's Grammy journey",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tBorders and boundaries blurred as congratulations poured in for Indian-American vocalist Chandrika Krishnamoorthy Tandon, who won the Grammy for her album “Triveni” under the category for the Best New Age, Ambient, or Chant Album on Monday. In an email interview to <em>Business Standard</em>, Tandon said: \"It is surreal and exciting on many levels. Triveni was a collaborative experiment bringing ancient mantras in a global bed of music — and the fact that it succeeded is extremely gratifying.\" </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe 71-year-old business leader made history alongside South African flutist Wouter Kellerman and Japanese cellist Eru Matsumoto, triumphing over notable contenders like Anoushka Shankar and Ricky Kej. About her Indian-origin competitors, Tandon said: \"We had such fantastic fellow nominees in our category with awesome music — it was great to have the Indian roots reflected in full force.\" </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTandon began her professional career as a Citibank banker in Beirut during the Lebanese Civil War. As one of just eight women in her IIM-A batch, she later became the first Indian-American woman elected partner at McKinsey &amp; Company in the 1980s. In 1992, she founded the New York-based consultancy, Tandon Capital Associates.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSo, is the corporate world still an integral part of her life? <small class=\"brtag\"> </small></div>\n<div>\r\n\t\"Indeed it is,\" she said, \"but it is not only my corporate life but also my work in the US academic sphere as a Trustee of New York University (the largest private global university) and Chair of the NYU Tandon School of Engineering, and other organisations like the New York Academy of Sciences. Keeps both sides of the brain active and engaged.\" </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFrom Prime Minister Narendra Modi to business leaders like Kiran Mazumdar-Shaw and Harsh Goenka, as well as expatriate organisations such as India in New York, many extended their felicitations. “Congratulations to @chandrikatandon on winning the Grammy. We take great pride in her accomplishments as an entrepreneur, philanthropist, and, of course, musician! It is commendable how she has remained passionate about Indian culture and has worked to popularise it,” Modi posted on X, recalling his 2023 meeting with her in New York.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA trained vocalist in Carnatic and Hindustani classical music, Tandon was previously nominated for a Grammy in 2011 in the Contemporary World Music category for her debut album, “Soul Call”.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe older sister of former PepsiCo CEO Indra Nooyi, Tandon grew up in Chennai, attended Madras Christian College (MCC), and later earned a master’s degree from the Indian Institute of Management Ahmedabad. “This remarkable achievement reflects her exceptional talent and dedication to the arts,” MCC’s alumni association posted on X.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring an interview for CNBC’s The Brave Ones series, Tandon spoke about a pivotal moment in her career when, despite rapid business growth, she felt unfulfilled. “I started to think… ‘Is this what my life’s going to be? One deal after another?’” she recalled. In the same series, her daughter, Lita Tandon, shared that this turning point led her mother to fully embrace music and the things that brought her joy. </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInspired by her passion, Tandon produced her first album, “Soul Call”, as a gift for her father-in-law’s 90th birthday, featuring recordings of his favourite chants. The album later earned a Grammy nomination for Contemporary World Music in 2011.<small class=\"brtagPara\"> </small></div></div>",
            "pub_date": "2025-02-05 00:50:30",
            "link": "https://www.business-standard.com/entertainment/from-boardroom-buzz-to-global-chants-chandrika-tandon-s-grammy-journey-125020401578_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401578"
        },
        {
            "title": "The upside of Trump's disruptions: A push for better alternatives",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tA 78-year-old man living in a white building is sending shockwaves through his own country as well as the rest of the world. In just over a fortnight since assuming office as US President, Donald Trump is packing off illegal migrants by the thousand every day, has scrapped affirmative action programmes in federal institutions, withdrawn from the Paris Climate Accord and the World Health Organization, suspended aid to developing countries, sacked thousands of federal employees, and imposed massive tariffs on trade partners (Canada and Mexico) and rivals (China). And this is just the beginning.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndia will come on his radar</div></div>",
            "pub_date": "2025-02-05 00:45:29",
            "link": "https://www.business-standard.com/opinion/columns/the-upside-of-trump-s-disruptions-a-push-for-better-alternatives-125020401652_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401652"
        },
        {
            "title": "PepsiCo records double-digit organic revenue growth in India in 2024",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tPepsiCo saw double-digit organic revenue growth in India in 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe US-headquartered food and beverage giant gained market share in the savoury snacks category in India, alongside China, Brazil, Australia, South Africa, Poland, Colombia, Guatemala, and Pakistan.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the beverages category too, the maker of 7UP held or gained share in the UK, Germany, Brazil, Australia, South Korea, India, Thailand, Poland, Pakistan, Saudi Arabia, and Vietnam in 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Our $37 billion international business (which represented approximately 40 per cent of total PepsiCo net revenue and core division operating profit in 2024) delivered 6 per cent organic revenue growth in 2024, or 9 per cent organic revenue growth on a two-year compounded basis,” PepsiCo said in its prepared management remarks after announcing its results.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndia posted a double-digit volume growth in both the convenient foods category and the beverages category.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn its outlook for 2025, the company said it will undertake initiatives to expand channel diversification and international presence to help stimulate growth.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPepsiCo offers brands like Lay’s, Kurkure, Doritos, and Quaker Oats in foods and Pepsi, Mountain Dew, and Tropicana in its beverages portfolio.</div></div>",
            "pub_date": "2025-02-05 00:45:29",
            "link": "https://www.business-standard.com/companies/news/pepsico-records-double-digit-organic-revenue-growth-in-india-in-2024-125020401653_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401653"
        },
        {
            "title": "Over 85 mn treatments availed under Ayushman Bharat-PMJAY: Govt tells RS",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tOver 8.5 crore treatments have been availed by the beneficiaries under Ayushman Bharat - Pradhan Mantri Jan Arogya Yojana (AB-PMJAY) till January 31, 2025, Union Health Minister J P Nadda told the Rajya Sabha on Tuesday.</p>\n<p>\r\n\tOut of this, approximately 42 million treatments were undertaken in government hospitals and 43 million in private, Nadda said while responding to a question.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/india-news/haryana-hospitals-ayushman-bharat-reimbursement-indian-medical-association-125012700535_1.html\" target=\"_blank\">600 Haryana hospitals to halt Ayushman Bharat services over payment delay</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tAll states and UTs across the country have on-boarded the scheme except for West Bengal and NCT of Delhi.</p>\n<p>\r\n\tThe AB-PMJAY is a flagship scheme of the government which provides health cover of Rs 5 lakh per family annually for secondary and tertiary care hospitalisation to approximately 55 crore beneficiaries corresponding to 12.37 crore families constituting economically vulnerable bottom 40 per cent of India's population.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tRecently, the scheme has been expanded to cover 6 crore senior citizens, 70 years and above, belonging to 4.5 crore families irrespective of their socio-economic status under AB-PMJAY with Vay Vandana card, Nadda said.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tUnder the scheme, in-patient healthcare services are delivered through public and private empanelled hospitals at secondary and tertiary level.</p>\n<p>\r\n\tThe scheme is implemented across the country through a three-tier model -- National Health Authority (NHA), State Health Agencies (SHAs) and District Implementation Units (DIUs) at national, state and district levels respectively.</p>\n<p>\r\n\tFor effective implementation of the scheme at state level, state governments have set up SHAs, the minister said.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThis entity is the nodal agency responsible for the implementation of AB-PMJAY in the State and is headed by a Chief Executive Officer. The CEO, SHA, is appointed by the state government.</p>\n<p>\r\n\tThe SHA can hire additional staff or an insurance company or an Implementation Support Agency (ISA) to perform required tasks for implementation of the scheme. The states and UTs have been provided with the flexibility to implement the scheme in the operational model best suited to the local conditions, Nadda said.</p>\n<p>\r\n\tAccordingly, AB-PMJAY is implemented in trust mode, insurance mode and mixed (Hybrid) mode, he said.</p>\n<p>\r\n\tCurrently, 25 states and UTs are implementing the scheme in trust mode, 7 in insurance mode and 2 states in hybrid mode, the minister said.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe AB-PMJAY currently provides free healthcare access up to Rs. 5 lakh per family per year for secondary and tertiary care hospitalization in 27 different medical specialties, he said.</p>\n<p>\r\n\tExpansion in treatment is done by inclusion of new procedures, empanelment of new hospitals, inclusion of new beneficiaries and other improvements as per requirements from time to time.</p><p></p></div>",
            "pub_date": "2025-02-05 00:40:30",
            "link": "https://www.business-standard.com/health/over-85-mn-treatments-availed-under-ayushman-bharat-pmjay-govt-tells-rs-125020401394_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401394"
        },
        {
            "title": "Increasing threshold: Ensuring more people contribute to income tax",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tThe decision, announced in the Union Budget, to change income-tax slabs and rebates such that no tax will be due on an income of ₹12 lakh and below has been widely welcomed. While the change in tax slabs and rates also means that those with higher taxes will have their burden reduced, the highlight is the fact that those earning ₹1 lakh a month in regular income — a little more for salaried workers, thanks to the standard deduction of ₹75,000 a year — will no longer be required to pay income tax. The government has presented this as a</div></div>",
            "pub_date": "2025-02-05 00:40:29",
            "link": "https://www.business-standard.com/opinion/editorial/increasing-threshold-ensuring-more-people-contribute-to-income-tax-125020401693_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401693"
        }
    ]
}