{
    "data": [
        {
            "title": "Finance ministry asks employees to avoid AI tools like ChatGPT, DeepSeek",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tIndia's finance ministry has asked its employees to avoid using AI tools including ChatGPT and DeepSeek for official purposes, citing risks posed to confidentiality of government documents and data, an internal department advisory showed.<small class=\"brtag\"> </small></div>\n<div>\r\n\tCountries like Australia and Italy have placed similar restrictions on the use of DeepSeek, citing data security risks.<small class=\"brtag\"> </small></div>\n<div>\r\n\tReports of the advisory surfaced on social media on Tuesday, ahead of a scheduled visit to India by OpenAI chief Sam Altman on Wednesday, when he is also due to meet the IT minister.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"It has been determined that AI tools and AI apps (such as ChatGPT, DeepSeek etc.) in the office computers and devices pose risks for confidentiality of (government) data and documents,\" said the advisory by the Indian finance ministry dated Jan. 29.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tRepresentatives for India's finance ministry, ChatGPT-parent OpenAI and DeepSeek did not immediately respond to requests for comment.<small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tThree finance ministry officials said the note was genuine and the note was issued internally this week.<small class=\"brtag\"> </small></div>\n<div>\r\n\tReuters could not immediately confirm whether similar directives have been issued for other Indian ministries.<small class=\"brtag\"> </small></div>\n<div>\r\n\tOpenAI is facing heat in India due to a high-profile copyright infringement battle with the country's top media houses, and has said in court filings that it does not have its servers in the country and Indian courts should not hear the matter.<small class=\"brtagPara\"> </small> <strong><em>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</em></strong></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 13:50:29",
            "link": "https://www.business-standard.com/india-news/finance-ministry-asks-employees-to-avoid-ai-tools-like-chatgpt-deepseek-125020500394_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500394"
        },
        {
            "title": "Tata Power gains 3% post Q3: Analysts split on outlook; should you 'Buy'?",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tTata Power share price surged 3.5 per cent at Rs 375 a piece on the BSE in Wednesday’s intraday trade after <a href=\"https://www.business-standard.com/markets/tata-power-company-ltd-share-price-554.html\" target=\"_blank\">Tata Power</a> reported a consolidated net profit of Rs 1,188 crore for the third quarter of the financial year 2024-25 (Q3FY25). </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company’s net profit grew a 10 per cent year-on-year (Y-o-Y) growth compared to Rs 1,076 crore in the same quarter last year. The company's consolidated revenue saw a 3 per cent increase, reaching Rs 15,793 crore, up from Rs 15,294 crore in the previous year. Meanwhile, earnings before interest, taxes, depreciation, and amortisation (Ebitda) rose 7 per cent to Rs 3,481 crore, compared to Rs 3,250 crore in the corresponding period.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to analysts at Nuvama Institutional Equites, adjusting for one-off in Q3FY25 and Q3FY24, <a href=\"https://www.business-standard.com/companies/results/tata-power-q3-results-net-profit-rises-8-2-to-rs-1-031-cr-revenue-up-5-125020400954_1.html\" target=\"_blank\">Tata Power's net profits</a> saw a 9 per cent Y-o-Y growth, falling short of their estimates. Meanwhile, the company’s renewable business PAT grew 60 per cent Y-o-Y  led by manufacturing income from the newly built 4.3GW solar module and cell plant. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the revenue front, however, the renewable energy (RE) segment fell 15 per cent Y-o-Y, but the transmission &amp; distribution segment rose 5 per cent Y-o-Y, while power generation revenues were largely flat on a Y-o-Y basis, analysts at Elara Capital noted. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We remain optimistic on Tata Power's long-term RE transition (65 per cent mix by FY28), solar manufacturing (50 per cent external by FY27) and optionality in solar rooftops, nuclear endeavours and potential UP Discom acquisition. While Tata Power is targeting 2.5x its FY24 PAT to Rs 100 billion by FY30, we fear most of this growth is back-ended with RE fully contributing by FY28,” Subhadip Mitra, Vikram Datwani, and CFA Vijay Bhasin Of Nuvama Institutional Equities said in a report.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe brokerage added that it finds risks outweighing rewards as the current market price of Tata Power stock more than bakes in these triggers, given its valuation of 23 times its FY26 price to earnings (PE) ratio. The brokerage retained its ‘Reduce’ call on the stock with a target of Rs 343 a piece.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInternational brokerage CLSA, maintained its 'Underperform' on company, with target of Rs 351 per share, according to reports. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the other hand, analysts at Elara Capital, stayed with their ‘Buy’ call on the stock but a reduced target of Rs 488 due to slower-than-anticipated capacity addition in the renewable energy segment. </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, the brokerage believes that Tata Power stands to benefit from power transmission capex, power distribution reforms and green investments. As the company aims to increase its renewable energy capacity to 15GW by FY27 and has capex plans of Rs 84,200 crore in FY24-27. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn similar lines, those at JM Financial also said that the company’s capex plans will boost the company’s growth throughout segments. The brokerage estimates Tata Power to report 2024-27 revenue and Ebitda CAGR of 9 per cent and  17 per cent, respectively,  maintaining ‘Buy’ with a target of Rs 456. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAxis Capital also gave a “Buy” call on the stock with an unchanged target of Rs 462 per share.<small class=\"brtagPara\"> </small> At 10:52 AM; the stock price of the company was up 2.03 per cent at Rs 369.50 per share, against the <a href=\"https://www.business-standard.com/markets/sp-bse-sensex-share-price-20558.html\" target=\"_blank\">BSE Sensex's</a> fall of 0.03 per cent at 78,562.95 level.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 13:50:29",
            "link": "https://www.business-standard.com/markets/news/tata-power-gains-3-post-q3-analysts-split-on-outlook-should-you-buy-125020500362_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500362"
        },
        {
            "title": "Not just an election but 'Dharam Yuddh': Atishi seeks vote in Delhi polls",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tDelhi Chief Minister and AAP candidate Atishi on Wednesday urged the voters to cast their ballot in the assembly polls that are underway in the national capital.</p>\n<p>\r\n\tIn a post on X, Atishi asserted that the Delhi election is not just an election, but a \"Dharam Yuddh\".</p>\n<p>\r\n\t\"Today's election in Delhi is not just an election, it is a Dharam Yuddh (religious war). This is a battle between good and evil. It's a battle between work and hooliganism. I appeal to all the people of Delhi to cast their vote. Vote for work, vote for goodness. Truth will prevail,\" she said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAAP national convenor Arvind Kejriwal also appealed to the voters to come out in large numbers.</p>\n<p>\r\n\t\"Dear Delhiites, today is the day to vote. Your vote is not just a button; it is the foundation of your children's bright future. It is an opportunity to provide good schools, excellent hospitals and a respectable life to every family. Today we have to defeat the politics of lies, hatred and fear and make truth, development and honesty win. Vote yourself and also inspire your family, friends and neighbours,\" Kejriwal said.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tPolling for 70 assembly seats began on Wednesday morning in Delhi, as voters cast their ballots for the 8th Assembly amid tight security. Voting commenced at 7.00 am and will continue till 6.00 pm, officials said.</p>\n<p>\r\n\tHotly contested constituencies include New Delhi and Jangpura. AAP, which currently holds more than 60 seats in the 70-seat assembly, seeks re-election based on its previous terms' achievements.</p>\n<p>\r\n\tThe New Delhi seat sees a high-profile three-way contest with former Delhi CM Arvind Kejriwal (AAP), BJP's Parvesh Verma, and Congress's Sandeep Dikshit (son of former CM Sheila Dikshit).</p>\n<p>\r\n\tJangpura sees a contest between AAP's Manish Sisodia, Congress's Farhad Suri, and BJP's Tarvinder Singh Marwah.</p>\n<p>\r\n\tA total of 699 candidates is in the electoral fray on the 70 assembly constituency seats of the national capital.</p>\n<p>\r\n\tDelhi has 1,56,14,000 registered voters, including 83,76,173 males, 72,36,560 females, and 1,267 third-gender voters. The electorate also includes 2,39,905 first-time voters aged 18-19, 1,09,368 elderly voters aged 85 and above, and 79,885 persons with disabilities.</p><p></p></div>",
            "pub_date": "2025-02-05 13:45:28",
            "link": "https://www.business-standard.com/elections/delhi-elections/not-just-an-election-but-dharam-yuddh-atishi-seeks-vote-in-delhi-polls-125020500110_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500110"
        },
        {
            "title": "Finance ministry asks employees to avoid AI tools like ChatGPT, DeepSeek",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tIndia's finance ministry has asked its employees to avoid using AI tools including ChatGPT and DeepSeek for official purposes, citing risks posed to confidentiality of government documents and data, an internal department advisory showed.<small class=\"brtag\"> </small></div>\n<div>\r\n\tCountries like Australia and Italy have placed similar restrictions on the use of DeepSeek, citing data security risks.<small class=\"brtag\"> </small></div>\n<div>\r\n\tReports of the advisory surfaced on social media on Tuesday, ahead of a scheduled visit to India by OpenAI chief Sam Altman on Wednesday, when he is also due to meet the IT minister.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"It has been determined that AI tools and AI apps (such as ChatGPT, DeepSeek etc.) in the office computers and devices pose risks for confidentiality of (government) data and documents,\" said the advisory by the Indian finance ministry dated Jan. 29.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tRepresentatives for India's finance ministry, ChatGPT-parent OpenAI and DeepSeek did not immediately respond to requests for comment.<small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tThree finance ministry officials said the note was genuine and the note was issued internally this week.<small class=\"brtag\"> </small></div>\n<div>\r\n\tReuters could not immediately confirm whether similar directives have been issued for other Indian ministries.<small class=\"brtag\"> </small></div>\n<div>\r\n\tOpenAI is facing heat in India due to a high-profile copyright infringement battle with the country's top media houses, and has said in court filings that it does not have its servers in the country and Indian courts should not hear the matter.<small class=\"brtagPara\"> </small> <strong><em>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</em></strong></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 13:45:27",
            "link": "https://www.business-standard.com/india-news/finance-ministry-asks-employees-to-avoid-ai-tools-like-chatgpt-deepseek-125020500394_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500394"
        },
        {
            "title": "Indians justifiably outraged by poor air quality, says Bryan Johnson",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tAfter leaving a podcast with Zerodha Co-founder Nikhil Kamath early citing bad air quality, American entrepreneur and venture capitalist Bryan Johnson raised concerns over the health impacts of air pollution in India and said that \"Indians are justifiably outraged by the poor air quality they are exposed to daily.\"</p>\n<p>\r\n\tCiting a study, Johnson highlighted that prolonged exposure to PM2.5 pollutants can cause liver inflammation, fibrosis, blood fat imbalances, and genetic disruptions linked to cancer.</p>\n<p>\r\n\tSharing a post on X, he wrote, \"Indians are justifiably outraged by the poor air quality they are exposed to daily. It creates serious negative health effects.\"</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Below is a study showing how air pollution causes liver inflammation, fibrosis, blood fat imbalance, and liver protein markers associated with alcoholism, as well as gene dysregulation linked to cancer. There's no such thing as a safe level of PM2.5,\" the post added.</p>\n<p>\r\n\tNotably, Johnson on February 3 had said that while in India, he ended the podcast with Kamath early due to the bad air quality. He also said that the AQI inside the room was 130 and PM2.5 was 75 ug/m3, which was equal to smoking 3.4 cigarettes for 24 hours of exposure.</p>\n<p>\r\n\tSharing a post on X, he wrote, \"When in India, I did end this podcast early due to the bad air quality. @nikhilkamathcio was a gracious host and we were having a great time. The problem was that the room we were in circulated outside air which made the air purifier I'd brought with me ineffective. Inside, the AQI was 130 and PM2.5 was 75 ug/m3, which is equal to smoking 3.4 cigarettes for 24 hours of exposure. This was my third day in India and the air pollution had made my skin break out in rash and my eyes and throat burn.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 13:40:30",
            "link": "https://www.business-standard.com/india-news/indians-justifiably-outraged-by-poor-air-quality-says-bryan-johnson-125020500187_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500187"
        },
        {
            "title": "Delhi polls: Over 30K police personnel, 220 paramilitary companies deployed",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tDelhi is on high alert for the assembly polls on Wednesday with over 30,000 police personnel and 220 companies of paramilitary forces have been deployed across the national capital for peaceful elections.</p>\n<p>\r\n\tThe voting for the high-stakes Assembly elections began, with the Aam Aadmi Party eyeing a third straight term, banking on its governance record and welfare schemes, while the BJP and the Congress look at resurgence.</p>\n<p>\r\n\tThere are over 1.56 crore voters eligible to cast their ballots from 7 am onwards on Wednesday.</p>\n<p>\r\n\tVoting will be taking place across 13,766 polling stations in all the 70 Assembly constituencies to decide the fates of 699 candidates in a contest that could reshape the political landscape of the capital.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tNearly 3,000 polling booths have been identified as sensitive, and special security arrangements, including drone surveillance, Quick Reaction Team, Striking Team and one company of Central Armed Police Force (CAPF) have been deployed to maintain law and order.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\t\"All Delhi Police personnel are committed to ensuring free, fair, and peaceful elections. The pre-poll arrangements have already been done and all the senior staff of the Delhi Police are on the ground to ensure peaceful election,\" Special Commissioner of Police (SPNO Delhi Assembly Elections) Devesh Chandra Srivastva said.</p>\n<p>\r\n\tHe said that 220 companies of paramilitary forces out of which 150 companies of CAPF and 70 companies of 10 different states, along with over 30,000 police personnel, 9,000 Home Guards, and all the senior police officers of Delhi Police have been deployed.</p>\n<p>\r\n\tSrivastva said that robust security arrangements are in place across the national capital.</p>\n<p>\r\n\tHe said all the 65 border points that Delhi shares with Uttar Pradesh and Haryana have already been sealed and heavy deployment of security has been put in place.</p>\n<p>\r\n\tHe said that from January 7 to February 3, the Delhi Police has recorded 1,076 cases of alleged MCC violations and arrested or detained 34,250 people for it.</p>\n<p>\r\n\t\"These are cases lodged between January 7, when the Model Code of Conduct (MCC) came into force, and February 3 which was the last day of campaigning for the Delhi Assembly polls. Our teams have also confiscated 469 illegal firearms and 513 cartridges with 491 people arrested under the Arms Act,\" said the Special CP. Police have also seized 1,10,093 litres of liquor and 1,381 people were arrested for it. He said that due to strict vigil, police seized 196.602 kg of drugs worth over Rs 77.9 crore and more than 1,200 banned injections were also seized and arrested 177 people for it.</p><p></p></div>",
            "pub_date": "2025-02-05 13:40:29",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-polls-over-30k-police-personnel-220-paramilitary-companies-deployed-125020500084_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500084"
        },
        {
            "title": "Budget 2025: Where should investors park funds? EV, IT, tourism big themes",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFollowing the announcement of Budget 2025, smallcase Managers, Sebi registered research analysts and investment advisors have identified promising sectors for investment. The rise in capital expenditure (Capex) budget, projected to exceed $1.2 trillion by 2030, is set to benefit banks and infrastructure NBFCs. Additionally, sectors such as urban housing, insurance, and defense-related industries look favorable due to long-term policy support.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile consumption-driven companies are considered overvalued, consumer finance, electric vehicles (EVs), and tourism—particularly religious tourism—are emerging as compelling investment opportunities. Additionally, India’s growing IT market, fueled by AI advancements, presents substantial long-term growth potential.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Here are the key sectors selected for investment: </strong></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<ul>\n<li>\r\n\t\tCapex budget has risen 15% CAGR in the past 10 years, allocation until 2030 likely to exceed $1.2 trillion. Large capex investments likely to be beneficial for Banks and specialized infra NBFCs</li>\n<li>\r\n\t\tConsumer finance companies available at a more reasonable valuation</li>\n<li>\r\n\t\tEVs, Mobility, Tourism, and religious tourism provide interesting opportunities</li>\n<li>\r\n\t\tDeepSeek has expanded the market for IT, but near-term growth rates and valuations a concern</li>\n</ul>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Capex budget</strong></div>\n<div>\r\n\tWhile the showstopper in this budget was the zero income tax for those incurring Rs 12 lakh of salary, there was a lot of capex and infrastructure allocation which was not in the limelight. From 2014-15 where capex was 20% of the total budget, it has increased to 31% this year. Capex budget has been growing at nearly 15% CAGR over the last 10 years compared to the revenue budget which has grown at around 10% CAGR.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sectors in focus</strong></div>\n<div>\r\n\tSuch large capex investments are likely to be beneficial to Banks and specialized infrastructure NBFCs. Further, the focus on power sector “nudge” reforms, which encourage state discoms to focus on timely payments to generators, are likely to benefit the whole power ecosystem. Housing and Urbanization focus would benefit housing finance companies. Besides these, Defence, Railways, and Construction and Engineering and EPC companies would benefit to a large extent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tArvind Kothari, smallcase Manager and Founder of Niveshaay highlighted power, transformers, and clean energy sectors are attractive investment opportunities, especially with the government’s continued focus on energy transition, infrastructure development, and sustainability. The Budget’s increased allocation towards renewable energy, grid modernization, and EV infrastructure is set to drive robust growth in these areas. He also pointed out PLI schemes have significantly accelerated the growth of textile companies by enhancing manufacturing capabilities and promoting exports. The Budget’s focus on boosting domestic production, coupled with favorable policies, is expected to further strengthen this sector.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Consumption sector is a big winner</strong></div>\n<div>\r\n\tWhile consumption is likely to benefit, most of the consumption companies are extremely overvalued. smallcase managers believe that consumer finance companies could be a way to play this at a more reasonable valuation. Also, EVs and other means of mobility could provide interesting opportunities. Another sector which could be interesting due to the tax benefits and the budget focus on the sector is Tourism, especially, religious tourism.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSonam Srivastava, smallcase Manager, and Founder of Wright Research said, “Retail consumption remains a theme for investment. Trent, Zomato and Dixon Tech are available at attractive valuations currently. We also have a bias towards defensives, capital market focused companies, pharma and hospitals. Electronic manufacturing, Banks and IT sectors also look interesting at the current juncture.”</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>DeepSeek and IT sector</strong></div>\n<div>\r\n\tIT remains an interesting play with DeepSeek catalyzing an extraordinarily large TAM (total addressable market) for Indian IT services companies. With the cost of training new AI models being brought down to 1/30th to 1/50th of the earlier paradigm, this makes it possible for small and mid-sized companies and startups to develop new models and launch numerous products based on AI in the next 2-10 years. This enlarges the market for Indian IT services many fold. However, with some uncertainty on the near-term growth rates and valuations slightly high, IT remains potentially alpha-generating.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t “Toy industry is a $400 billion global market, with significant manufacturing happening in China. The budget has allocated funds for the toy manufacturing industry, which could lead to significant growth in the next 10-15 years. At a macro level, we need the economy to clock over 7.5-8% for long-term growth of the market and currency,\" said Ambareesh Baliga, veteran market expert and smallcase Manager.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDr. Vikas Gupta, smallcase Manager &amp; Founder of OmniScience Capital said, “The US Tariffs on China is a big opportunity for India. At a macro level, Trump favors a weak dollar to increase competitiveness of American exports. Add to that it is challenging for the RBI to cut rates given the fall in INR, the central bank may look at other ways to boost market liquidity given INR fall, largely the street is expecting a 25 bps rate cut by the RBI this week.\"</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 13:35:27",
            "link": "https://www.business-standard.com/finance/personal-finance/budget-2025-where-should-investors-park-funds-ev-it-tourism-big-themes-125020500365_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500365"
        },
        {
            "title": "IND vs ENG - One series does not define the form of whole team: Gill",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><p>\r\n\tIndia's vice-captain Shubman Gill on Tuesday defended their performance in the Test series loss in Australia, saying that one poor series does not define a team and that it is unfair to criticise a side after a rare bad outing.</p>\n<p>\r\n\tIndia suffered a 1-3 defeat in the five-match series in Australia, bringing to an end their decade-long dominance in the Border-Gavaskar Trophy.</p>\n<p>\r\n\tKey players such as Rohit Sharma, Virat Kohli, KL Rahul, Rishabh Pant, and Gill himself are now set to return for the three-match ODI series against England before heading to Dubai for the all-important <a href=\"https://www.business-standard.com/cricket/champions-trophy\" target=\"_blank\"><strong>ICC Champions Trophy</strong></a>.</p>\n<p>\r\n\t\"One series does not define the form of the whole team. There are a lot of players who, in the past, have performed consistently in a lot of series and tournaments,\" Gill told reporters here ahead of the first ODI against England.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Definitely, we did not play as per our expectations in the Australian series, but still we played some good cricket. We were unfortunate not to have (Jasprit) Bumrah on the last day and we would have won the match and the series would have been a draw and this talk wouldn't have happened.</p>\n<p>\r\n\t\"One match and one day doesn't define us, we won there twice before and earlier won a World Cup and then reached the final of a World Cup, so we should keep all those things in mind.\"<small class=\"brtagPara\"> </small>\r\n\tBefore the reverse in Australia, India were also whitewashed 3-0 by New Zealand at home, unprecedented in the country's cricket history.<small class=\"brtagPara\"> </small>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/points-table\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 points table here</strong></a><small class=\"brtagPara\"> </small>\n<a href=\"https://www.business-standard.com/cricket/champions-trophy/schedule\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 full schedule, match timings (IST) here</strong></a></p><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 13:35:26",
            "link": "https://www.business-standard.com/cricket/news/ind-vs-eng-one-series-does-not-define-the-form-of-whole-team-gill-125020401286_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401286"
        },
        {
            "title": "Lemon Tree shares gain 5% after posting Q3 results; check details here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tLemon Tree Hotels shares advanced 4.9 per cent on Wednesday, logging an intraday high at Rs 154.8 per share on BSE. The buying on the counter came after the company reported its Q3 numbers. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAround 10:36 AM, Lemon Tree share price was up 4.04 per cent at Rs 153.4 per share on BSE. In comparison, the BSE Sensex was down 0.08 per cent at 78,523.99. The market capitalisation of the company stood at Rs 12,073.84 crore. The 52-week high of the stock was at Rs 162.25 per share and the 52-week low was at Rs 112.3 per share. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company released its Q3 results on Tuesday after market hours. Lemon Tree in the quarter ended December 31, 2024, reported a 82 per cent rise in consolidated net profit to Rs 79.9 crore as compared to Rs 43.8 crore a year ago. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company's revenue for the third quarter stood at Rs 355.2 crore as compared to Rs 290.2 crore a year ago implying an increase of 25 per cent year-on-year (Y-o-Y).<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/news/weak-demand-weighs-on-asian-paints-q3-analysts-see-more-pain-in-near-term-125020500157_1.html\" target=\"_blank\">Weak demand weighs on Asian Paints Q3; analysts see more pain in near-term</a></strong></div>\n</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h3>\r\n\tLemon Tree Hotels management commentary</h3>\n<div>\r\n\tGoing forward, the management is confident in the company’s ability to sustain growth in the coming quarters by focusing on accelerated growth in management and franchised portfolio, with a proportionate increase in fee-based income and timely completion of renovation activities in the owned portfolio to further improve gross ARR and occupancy. </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe management noted added that the increased investment in renovation expenses will continue into FY26 until the entire portfolio of owned hotels has been fully renovated and refreshed. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPost this, renovation expenses will be close to 1.8 per cent of revenue on an ongoing basis. With demand growth expected to outpace supply in the next few years and increasing discretionary spending on branded hotels in India, Lemon Tree's increased investment in renovation will allow us to position Lemon Tree as the preferred brand in the mid-market segment, as per management. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the past one year, Lemon Tree shares have gained 5.3 per cent against Sensex's rise of 9.5 per cent. </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 13:30:35",
            "link": "https://www.business-standard.com/markets/news/lemon-tree-shares-gain-5-after-posting-q3-results-check-details-here-125020500364_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500364"
        },
        {
            "title": "Titagarh Rail Systems shares surge 7% on new business plans; details here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tShares of freight wagons and passenger coaches maker Titagarh Rail Systems climbed 6.90 per cent to hit the day's high of Rs 964.05 apiece on the BSE during intra-day trade on Wednesday, February 5, 2025. The northward movement in the company's share price came on the back of news that the company has announced a management reorganisation and strengthening, as well as plans to venture into new areas of growth.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/markets/titagarh-rail-systems-ltd-share-price-19939.html\" target=\"_blank\">Titagarh Rail Systems</a> has informed the exchanges about the formation of new verticals under the names Ship Building and Maritime Systems (SMS), and Safety and Signaling Systems (SSS).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"While Titagarh has already been in the shipbuilding and maritime business in the past and has designed, manufactured, and delivered several projects, including specialized ships such as a Fast Patrol Vessel for the Indian Coast Guard, a passenger ferry exported to Guyana (both through GRSE), and coastal research vessels 'Sagar Tara' and 'Sagar Anveshika,' along with many vessels for the Indian Navy,\" the company said in a release.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small> The comapny further said that, the SMS vertical of Titagarh would be headed by Saket Kandoi, who is the director of the company and was earlier the chief operating officer of the Freight Rail Systems division. He will now be the director and CEO of the Ship Building and Maritime Systems.</div>\n<div>\n<div>\n<small class=\"brtag\"> </small> \"Prithish Chowdhary, dy managing director of the company, apart from handing various corporate functions, will be responsible for developing the two new business verticals i.e. Shipbuilding and Maritime Systems (SMS) and Safety and Signalling Systems (SSS),\" it added. <small class=\"brtagPara\"> </small>\n<strong>READ: </strong><a href=\"https://www.business-standard.com/markets/news/rvnl-shares-gain-4-on-receiving-rs-404-cr-loa-from-east-coast-railway-125020500239_1.html?1738732292\" target=\"_blank\"><strong>RVNL shares gain 4% on receiving Rs 404-cr LoA from East Coast Railway</strong></a></div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTitagarh Rail Systems is a comprehensive mobility solutions provider with a strong presence in India and Italy. With state-of-the-art factories in both countries, the company is committed to meeting the diverse requirements of passenger and freight rolling stock. It specialises in crafting cutting-edge transportation solutions, including semi-high-speed trains, urban metros, passenger coaches, propulsion systems, and a wide array of wagons, including specialized ones.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe railway wagons maker's market capitalisation stands at Rs 1,082.10 crore on the BSE, as of February 5, 2025. The company is a constituent of the BSE 500 index.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTitagarh Rail Systems share price has dropped 32 per cent in the last six months, and 7 per cent in the last one year.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company's shares hit their 52-week high of Rs 1,896.50—which is also their all-time high—on June 27, 2024, while their 52-week low of Rs 782.10 was recorded on March 13, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt around 10:30 AM, Titagarh Rail Systems shares were trading at Rs 947.90, up 5.12 per cent from their previous close of Rs 901.75 on the NSE. A combined total of nearly 2 million shares of Titagarh Rail Systems, worth approximately Rs 184.16 crore, exchanged hands on the NSE and BSE.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, benchmark equity indices <a href=\"https://www.business-standard.com/markets/sp-bse-sensex-share-price-20558.html\" target=\"_blank\">BSE Sensex</a> and NSE Nifty50 were trading flat on Wednesday. The Sensex was at 78,513.38, down 70.43 points or 0.09 per cent, while the Nifty50, on the other hand, was trading 30.90 points or 0.13 per cent higher at around 23,770 levels.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 13:30:34",
            "link": "https://www.business-standard.com/markets/news/titagarh-rail-systems-shares-surge-7-on-new-business-plans-details-here-125020500359_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500359"
        }
    ]
}