{
    "data": [
        {
            "title": "M&M rallies 9% in 3 days on healthy outlook; market cap crosses Rs 4 trn",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tShares of Mahindra &amp; Mahindra (M&amp;M) hit a new high of Rs 3,270, gaining 3 per cent on the BSE in Tuesday’s intra-day trade on a healthy business outlook. The stock surpassed its previous high of Rs 3,237.60 touched on January 3, 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSince February 1, post Budget 2025-26, the stock of the automobile company has rallied 9 per cent. It is quoting higher for the eighth straight trading day, having surged 17 per cent during the same period. In comparison, the BSE Sensex was up 2.2 per cent during the period.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA sharp outperformance has seen the market capitalisation of M&amp;M cross the Rs 4-trillion mark. At 09:42 AM, with a market capitalisation of Rs 4.0 trillion, M&amp;M was trading 1.5 per cent higher at Rs 3,217.65 on the BSE.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tM&amp;M has a diversified business profile with its presence spread across various businesses, including farm equipment, auto, defence, information technology, financial services, mobility services, renewable energy, logistics, real estate, hospitality, steel trading, automotive components and maintaining parts for leading aerospace companies. However, farm equipment and auto businesses together are the key revenue and profitability drivers for it.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tM&amp;M continued with its outperformance in the domestic passenger vehicle (PV) space, with total sales growing 17.6 per cent year-on-year (YoY), to 50,659 units in January 2025. In the tractor segment, M&amp;M reported volumes of 27,557 units, up by 15 per cent YoY.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBacked by the positive sentiment in the farm sector and better terms of trade, the tractor segment is expected to report healthy volume prints with FY25E industry growth expected at high single digit, according to analysts.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBetter soil moisture levels due to the above normal southwest monsoon and high-water storage levels in major reservoirs have aided in an increase in Rabi sowing. Further, continued government support on various rural schemes and on Agri subsidies are positives that may boost tractor demand going forward, according to the management.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, the government has announced the biggest ever overhaul in personal income tax structure, thereby increasing the tax exempt income from Rs 7 lakh to Rs 12 lakh in the Union Budget 2025-26. This tax relief is expected to increase the disposable income, between the range of Rs 30,000 and 110,000, in the hands of taxpayers, thereby providing a big booster for the auto space given people will upgrade their standard of living by potentially buying new vehicles which can either be a 2-wheeler or PV, ICICI Securities said.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, a better outlook for the rural segment and the coming of Chaitra Navratri in March-end 2025 would support tractor sales in Q4FY25. Even though the domestic PV industry saw a moderation in growth, we have been arguing that M&amp;M would outperform the PV industry led by new launches and capacities, Mirae Asset Sharekhan said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHistorically, M&amp;M’s operating performance has largely depended on the tractor segment. However, the brokerage firm believes that the automobiles segment would substantially contribute to profitability in the coming period. Mirae Asset Sharekhan maintains 'Buy' rating on the stock with an SOTP-based revised price target of Rs 3,600, due to healthy traction in its PV segment, market leadership in the tractor segment, opportunity to grow in the farm machinery segment, and its roadmap to play in the electric vehicle (EV) space.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtagPara\"> </small></div>",
            "pub_date": "2025-02-04 13:15:28",
            "link": "https://www.business-standard.com/markets/news/m-m-rallies-9-in-3-days-on-healthy-outlook-market-cap-crosses-rs-4-trn-125020400224_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400224"
        },
        {
            "title": "Rail, defence: Analysts bet on select capex-related PSUs after Budget 2025",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>PSU stocks to buy, Budget 2025:</strong> Investors offloaded stocks of most public sector undertakings (PSUs) over the past two days after Union Budget 2025-26 fell short of pushing the growth pedal via the 'traditional' capital expenditure (capex) channels.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe <a href=\"https://www.business-standard.com/markets/nifty-pse-share-price-30186.html\" target=\"_blank\">Nifty PSE index</a> is among the top losers at the bourses, slipping 6.2 per cent in the last two days as against 0.6 per cent fall in the Nifty 50 during the period, data shows.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndia Budget 2025, which was tabled in the Parliament on Saturday, February 1, 2025, pegged the <a href=\"https://www.business-standard.com/budget/news/budget-2025-govt-sets-capex-target-of-rs-11-21-trillion-for-fy26-125020101487_1.html\" target=\"_blank\">budgeted estimate (BE) for capex</a> in financial year 2025-26 (FY26) at Rs 11.2 trillion. This is around 10.1 per cent higher than the revised capex estimate (RE) of Rs 10.18 trillion in the ongoing financial year FY25 and flat as against the budgeted estimate of Rs 11.11 trillion.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/budget/news/budget-s-focus-on-clean-energy-to-push-sector-growth-re-industry-125020300536_1.html\" target=\"_blank\">Budget's focus on clean energy to push sector growth: RE industry</a></strong></div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBudget 2025 fine print showed the Government has shifted its focus away from the 'traditional' capex drivers, such as railways, roads and transport, and defence services, to 'other sectors' with untapped potential and strategic importance.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs a strategy, analysts suggest investors to add 'diversified' infrastructure/industry-related stocks rather than betting on 'monoline' stocks.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The government, while delivering a consumption booster, hasn't shifted its focus away from capex. This time, sectors like power, renewables, ports, and airports – something that doesn't need much government financing support – has been the focus area. Thus, investors could use the recent correction in PSU stocks to buy diversified infrastructure/industrial companies,\" said Pawan Parakh, fund manager at Geojit Financial Services.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tBudget 2025: The fine print</h2>\n<div>\r\n\tThe FY26 BE for Defence Services stands at Rs 1,59,500 crore, up 13 per cent from the FY25 RE. The FY26 BE allocation towards Road transport and Highways is at Rs 2,72,500 crore, down 0.1 per cent from FY25 RE, while that for Railways is flat at Rs 2,52,000 crore versus the FY25 RE.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/opinion/columns/budget-2025-focus-on-domestic-consumption-amid-global-uncertainties-125020200805_1.html\" target=\"_blank\">Budget 2025: Focus on domestic consumption amid global uncertainties</a></strong></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the flipside, the FY26 BE allocation for the Housing &amp; Urban Affairs sector stands at Rs 42,100 crore, up around 48 per cent from the FY25 RE; Power sector saw a rise of 21.4 per cent in FY26 compared with the revised estimate of FY25; Fisheries, Jal Shakti, and Ports sectors' FY26 BE grew 157 per cent, 72 per cent, and 31 per cent year-on-year.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThat apart, in the run-up to the Budget, monthly capex data for December 2024 indicated that capital spending rose from 46 per cent of FY25 BE in November, 2024, to 62 per cent in December, 2024. This sharp pickup raised hopes of meeting the annual target of Rs 11.11 trillion in FY25. However, the downward revision in BE FY25 capex allocation has dented sentiment across related sectors.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tPSU stocks: What should investors do now?</h2>\n<div>\r\n\tGiven the backdrop, Anirudh Garg, partner and fund manager at Invasset PMS, said short-term headwinds, including policy execution risks and global macro uncertainties, could keep PSU stocks under pressure.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Investors should, thus, adopt a staggered approach, focusing on select PSUs with strong order books, robust cash flows, efficient capital allocation, and attractive valuations,\" he suggested.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmnish Aggarwal, director – institutional research, PL Capital, too, advised investors to adopt a stock-specific strategy.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Investors should remember that the Government has been adopting a policy to exceed budgetary allocations if the need arises. The overall capex should, thus, remain healthy and execution should improve in FY26. That said, as many of the PSU stocks had been re-rated massively in the past two-three years, room for re-rating was limited,\" he said.    </div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tElara Capital remains 'overweight' on new government capex themes such as maritime and ports over roads and railways.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWithin PSUs, it expects BHEL, Mishra Dhatu Nigam (Midhani), Cochin Shipyard, Garden Reach Shipbuilders, Mazagon Docks, Hindustan Aeronautics, Bharat Electronics, and Bharat Dynamics to do well. BEML, RNVL, RITES, and Ircon International, it said, could underperform in the backdrop of muted railway capex.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 13:15:27",
            "link": "https://www.business-standard.com/markets/news/rail-defence-analysts-bet-on-select-capex-related-psus-after-budget-2025-125020400265_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400265"
        },
        {
            "title": "Mexico's Prez Sheinbaum wins early praise for handling Trump on tariffs",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tMexican President Claudia Sheinbaum on Monday appeared to pass her biggest test yet on the world stage by winning breathing room from US President Donald Trump's threatened tariffs, which risked ramming a wrecking ball through Mexico's economy.<small class=\"brtag\"> </small></div>\n<div>\r\n\tSome politicians and analysts commended the Mexican leader's measured public tone and apparent ability to blunt Trump's charge after she reached an agreement with the US president to pause tariffs for a month as Mexico sends 10,000 troops to the border to stop the flow of drugs and migrants.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"President Sheinbaum played it well. Masterfully,\" Jorge Guajardo, a former Mexican ambassador to China and member of an opposition party, said on social media, adding that other world leaders \"will see in Sheinbaum how to do it well.\" \"Sheinbaum has taken a very cautious and strategic approach to the Trump administration,\" said Lila Abed, director of the Mexico Institute at the Wilson Center in Washington.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tAbed pointed to Mexico's ramped up fentanyl seizures in recent months, including its largest bust ever in December, as aiding Sheinbaum's negotiation efforts.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"She's been taking actions within her government to send a clear signal to the United States that it understands that fentanyl and organized crime are a top priority for the Trump administration,\" said Abed.<small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tCanadian Prime Minister Justin Trudeau - who unlike Sheinbaum had unveiled a list of targeted tariffs in retaliation for Trump's measures - also secured a 30-day pause on US tariffs on Monday afternoon.<small class=\"brtag\"> </small></div>\n<div>\r\n\tAbed called Monday's pause a \"temporary win\" for Sheinbaum, which will be \"dependent on her ability to produce immediate results on migration and on security.\"<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tThe 25 per cent tariffs, which Trump first threatened in November to demand Mexico and Canada stem the flow of fentanyl and illegal immigrants into the US, were among the first foreign policy obstacles for Sheinbaum, who took office in October as Mexico's first woman president and promised to keep a \"cool head\" during tariff talks.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"Sheinbaum, upon the announcement of the tariffs, kept a very measured tone,\" Mexican political scientist Denise Dresser said on Monday in a live event on X held by the Center for Strategic and International Studies, a think tank in Washington.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"We were bracing for impact,\" Dresser said, noting Mexico is not out of the woods yet and stands to be the \"main loser\" from tariffs.<small class=\"brtag\"> </small></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tSheinbaum's already broad popularity in Mexico has not suffered from her showdown with Trump. Her approval has ticked up three percentage points from November to January to reach 77 per cent approval, according to pollster Buendia &amp; Marquez.<small class=\"brtag\"> </small></div>\n<div>\r\n\tHer ability to rally to the defense of the North American free trade pact, which she once campaigned against as a student activist, also may have helped calm fears that she would fail to handle Trump as well as her mentor Andres Manuel Lopez Obrador.<small class=\"brtag\"> </small></div>\n<div>\r\n\tHe formed an unlikely bond with the US leader during his term.<small class=\"brtag\"> </small></div>\n<div>\r\n\tOn Saturday, Sheinbaum said her government would respond with retaliatory tariffs to Trump's order for sweeping tariffs on goods from Mexico, Canada and China, without providing details.<small class=\"brtag\"> </small></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tFor Sheinbaum's part, she \"kept her options open\" which \"seems to have played out beneficially for her,\" said Dresser, a frequent critic of Mexico's ruling Morena party.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe president's messaging around Mexican sovereignty and economic resilience in the face of the tariff threats has connected both with her electoral base but also with the private sector and some in the opposition, said Abed.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"She has been successful in her negotiation strategy. Her being cautious but at the same time strategic and proactive, in terms of trying to derail tariffs, is something that has been really welcome within Mexico,\" Abed said.<small class=\"brtag\"> </small></div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<div>\n<div>\n<i>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</i></div>\n</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 13:10:27",
            "link": "https://www.business-standard.com/world-news/mexico-s-prez-sheinbaum-wins-early-praise-for-handling-trump-on-tariffs-125020400260_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400260"
        },
        {
            "title": "Delhi Elections 2025: What's open, what's closed on polling day, Feb 5",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe <a href=\"https://www.business-standard.com/elections/delhi-elections\" target=\"_blank\">Delhi Assembly election</a> is scheduled for February 5, with results to be announced on February 8 by the Election Commission of India (ECI). To encourage maximum voter participation, several government and private offices across the city will remain closed, while essential services like the Delhi Metro and bus services will operate. Here is what will be open and closed on polling day:</div>\n<h2>\r\n\tGovernment offices and banks to remain shut</h2>\n<div>\r\n\tThe Delhi government has declared a public holiday on February 5, allowing employees to vote. Government offices and banks will be closed under Section 25 of the Negotiable Instruments Act, 1881, and Section 135-B of the Representation of the People Act, 1951.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<h2>\r\n\tEducational institutions and businesses</h2>\n<div>\r\n\tTo facilitate smooth polling, schools and colleges—both government and private—will be closed as many will serve as polling stations. Cinemas and theatres may also remain shut during polling hours to encourage voter turnout.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs per the Election Commission's guidelines, liquor stores and licensed establishments will remain closed from 6:00 PM on February 3 to 6:00 PM on February 5.<small class=\"brtagPara\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/elections/assembly-election/delhi-assembly-elections-live-updates-aap-arvind-kejriwal-bjp-congress-delhi-polls-time-date-when-125020400211_1.html\" target=\"_blank\">Delhi elections 2025 LIVE updates</a></div>\n</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h2>\r\n\tEssential services and transport to function</h2>\n<div>\r\n\tWhile several establishments will be shut, essential services will remain operational:</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTransport: Metro services will start at 4:00 AM on election day and run every 30 minutes until 6:00 AM, after which regular services will resume. DTC buses will also operate additional services on 35 routes.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHealthcare: Hospitals, pharmacies, and essential medical facilities will remain fully operational.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRetail: Shops, grocery markets, restaurants, and most retail and food businesses are expected to remain open.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tHaryana also declares paid leave</h2>\n<div>\r\n\tIn addition to Delhi, the Haryana government has declared a paid leave for employees to enable them to vote in the Delhi Assembly elections.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tDelhi prepares for polling day</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tVoters in Delhi will head to the polls to elect representatives for 70 assembly seats amid tight security. The Election Commission is making all necessary arrangements to ensure a smooth voting process and encourage a high voter turnout.</div></div>",
            "pub_date": "2025-02-04 13:10:27",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-elections-what-is-open-what-is-closed-schools-banks-offices-feb-5-125020400248_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400248"
        },
        {
            "title": "Mexico's Prez Sheinbaum wins early praise for handling Trump on tariffs",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tMexican President Claudia Sheinbaum on Monday appeared to pass her biggest test yet on the world stage by winning breathing room from US President Donald Trump's threatened tariffs, which risked ramming a wrecking ball through Mexico's economy.<small class=\"brtag\"> </small></div>\n<div>\r\n\tSome politicians and analysts commended the Mexican leader's measured public tone and apparent ability to blunt Trump's charge after she reached an agreement with the US president to pause tariffs for a month as Mexico sends 10,000 troops to the border to stop the flow of drugs and migrants.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"President Sheinbaum played it well. Masterfully,\" Jorge Guajardo, a former Mexican ambassador to China and member of an opposition party, said on social media, adding that other world leaders \"will see in Sheinbaum how to do it well.\" \"Sheinbaum has taken a very cautious and strategic approach to the Trump administration,\" said Lila Abed, director of the Mexico Institute at the Wilson Center in Washington.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tAbed pointed to Mexico's ramped up fentanyl seizures in recent months, including its largest bust ever in December, as aiding Sheinbaum's negotiation efforts.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"She's been taking actions within her government to send a clear signal to the United States that it understands that fentanyl and organized crime are a top priority for the Trump administration,\" said Abed.<small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tCanadian Prime Minister Justin Trudeau - who unlike Sheinbaum had unveiled a list of targeted tariffs in retaliation for Trump's measures - also secured a 30-day pause on US tariffs on Monday afternoon.<small class=\"brtag\"> </small></div>\n<div>\r\n\tAbed called Monday's pause a \"temporary win\" for Sheinbaum, which will be \"dependent on her ability to produce immediate results on migration and on security.\"<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tThe 25 per cent tariffs, which Trump first threatened in November to demand Mexico and Canada stem the flow of fentanyl and illegal immigrants into the US, were among the first foreign policy obstacles for Sheinbaum, who took office in October as Mexico's first woman president and promised to keep a \"cool head\" during tariff talks.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"Sheinbaum, upon the announcement of the tariffs, kept a very measured tone,\" Mexican political scientist Denise Dresser said on Monday in a live event on X held by the Center for Strategic and International Studies, a think tank in Washington.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"We were bracing for impact,\" Dresser said, noting Mexico is not out of the woods yet and stands to be the \"main loser\" from tariffs.<small class=\"brtag\"> </small></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tSheinbaum's already broad popularity in Mexico has not suffered from her showdown with Trump. Her approval has ticked up three percentage points from November to January to reach 77 per cent approval, according to pollster Buendia &amp; Marquez.<small class=\"brtag\"> </small></div>\n<div>\r\n\tHer ability to rally to the defense of the North American free trade pact, which she once campaigned against as a student activist, also may have helped calm fears that she would fail to handle Trump as well as her mentor Andres Manuel Lopez Obrador.<small class=\"brtag\"> </small></div>\n<div>\r\n\tHe formed an unlikely bond with the US leader during his term.<small class=\"brtag\"> </small></div>\n<div>\r\n\tOn Saturday, Sheinbaum said her government would respond with retaliatory tariffs to Trump's order for sweeping tariffs on goods from Mexico, Canada and China, without providing details.<small class=\"brtag\"> </small></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tFor Sheinbaum's part, she \"kept her options open\" which \"seems to have played out beneficially for her,\" said Dresser, a frequent critic of Mexico's ruling Morena party.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe president's messaging around Mexican sovereignty and economic resilience in the face of the tariff threats has connected both with her electoral base but also with the private sector and some in the opposition, said Abed.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"She has been successful in her negotiation strategy. Her being cautious but at the same time strategic and proactive, in terms of trying to derail tariffs, is something that has been really welcome within Mexico,\" Abed said.<small class=\"brtag\"> </small></div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<div>\n<div>\n<i>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</i></div>\n</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 13:05:24",
            "link": "https://www.business-standard.com/world-news/mexico-s-prez-sheinbaum-wins-early-praise-for-handling-trump-on-tariffs-125020400260_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400260"
        },
        {
            "title": "Delhi Elections 2025: What's open, what's closed on polling day, Feb 5",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe <a href=\"https://www.business-standard.com/elections/delhi-elections\" target=\"_blank\">Delhi Assembly election</a> is scheduled for February 5, with results to be announced on February 8 by the Election Commission of India (ECI). To encourage maximum voter participation, several government and private offices across the city will remain closed, while essential services like the Delhi Metro and bus services will operate. Here is what will be open and closed on polling day:</div>\n<h2>\r\n\tGovernment offices and banks to remain shut</h2>\n<div>\r\n\tThe Delhi government has declared a public holiday on February 5, allowing employees to vote. Government offices and banks will be closed under Section 25 of the Negotiable Instruments Act, 1881, and Section 135-B of the Representation of the People Act, 1951.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<h2>\r\n\tEducational institutions and businesses</h2>\n<div>\r\n\tTo facilitate smooth polling, schools and colleges—both government and private—will be closed as many will serve as polling stations. Cinemas and theatres may also remain shut during polling hours to encourage voter turnout.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs per the Election Commission's guidelines, liquor stores and licensed establishments will remain closed from 6:00 PM on February 3 to 6:00 PM on February 5.<small class=\"brtagPara\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/elections/assembly-election/delhi-assembly-elections-live-updates-aap-arvind-kejriwal-bjp-congress-delhi-polls-time-date-when-125020400211_1.html\" target=\"_blank\">Delhi elections 2025 LIVE updates</a></div>\n</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<h2>\r\n\tEssential services and transport to function</h2>\n<div>\r\n\tWhile several establishments will be shut, essential services will remain operational:</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTransport: Metro services will start at 4:00 AM on election day and run every 30 minutes until 6:00 AM, after which regular services will resume. DTC buses will also operate additional services on 35 routes.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHealthcare: Hospitals, pharmacies, and essential medical facilities will remain fully operational.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRetail: Shops, grocery markets, restaurants, and most retail and food businesses are expected to remain open.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tHaryana also declares paid leave</h2>\n<div>\r\n\tIn addition to Delhi, the Haryana government has declared a paid leave for employees to enable them to vote in the Delhi Assembly elections.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tDelhi prepares for polling day</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tVoters in Delhi will head to the polls to elect representatives for 70 assembly seats amid tight security. The Election Commission is making all necessary arrangements to ensure a smooth voting process and encourage a high voter turnout.</div></div>",
            "pub_date": "2025-02-04 13:05:23",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-elections-what-is-open-what-is-closed-schools-banks-offices-feb-5-125020400248_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400248"
        },
        {
            "title": "Galaxy S25 series: Samsung kicks off early deliveries ahead of Feb 7 sale",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tSamsung has started the early deliveries of the new Galaxy S25 series smartphones in India for customers who had pre-ordered the devices. Samsung started accepting pre-orders for the new flagship smartphones from January 23 and will continue to do so until February 6, ahead of the first sale date of February 7. Customers pre-ordering the Galaxy S25 series smartphones also get benefits up to Rs 21,000. </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Samsung Galaxy S25 Ultra: Price, variants and offers</strong></div>\n<ul>\n<li>\r\n\t\t12GB RAM + 256GB Storage: Rs 129,999</li>\n<li>\r\n\t\t12GB RAM + 512GB Storage: Rs 141,999</li>\n<li>\r\n\t\t12GB RAM + 1TB Storage: Rs 165,999</li>\n</ul>\n<div>\r\n\tColours: </div>\n<ul>\n<li>\r\n\t\t256GB and 512GB storage variants are available in Titanium Silverblue, Titanium Gray, Titanium Whitesilver, Titanium Black.</li>\n<li>\r\n\t\tThe 1TB storage variant only comes in Titanium Silverblue colourway.</li>\n<li>\r\n\t\tExclusive colours on Samsung's website: Titanium Jadegreen, Titanium Jetblack and Titanium Pinkgold.</li>\n</ul>\n<div>\r\n\tPre-order offers:</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSamsung is providing a storage upgrade option for customers pre-ordering the Galaxy S25 Ultra in the 256GB variant. This means that customers will be able to get a 12GB RAM + 512GB storage model at the price of the 12GB RAM + 256GB storage variant. Additionally, the company is offering an upgrade bonus of Rs 9,000 on trade-in deals. Those opting not to exchange their current smartphone for the Galaxy S25 Ultra can instead avail a cashback of Rs 7,000 while purchasing the device with a no-interest equated monthly instalment (EMI) plan of nine months.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/technology/tech-news/samsung-to-launch-128gb-storage-variant-of-galaxy-s25-in-india-report-125012900697_1.html\" target=\"_blank\">Samsung to launch 128GB storage variant of Galaxy S25 in India: Report</a></strong></div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\n<strong>Galaxy S25 Plus: Price and variants and offers</strong></div>\n<ul>\n<li>\r\n\t\t12GB RAM + 256GB Storage: Rs 99,999</li>\n<li>\r\n\t\t12GB RAM + 512GB Storage: Rs 111,999</li>\n</ul>\n<div>\r\n\tColours: Navy, Silver Shadow </div>\n<div>\r\n\tExclusive colours on Samsung’s website: Blueblack, Coralred and Pinkgold</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPre-order offers:</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs part of the pre-order offers, customers can avail the 12GB RAM + 512GB storage variant of the Galaxy S25 Plus at the price of the 12GB RAM + 256GB storage variant. There are also no-interest EMI plans of up to 24 months.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Galaxy S25: Price and variants and offers</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t12GB RAM + 256GB Storage: Rs 80,999</div>\n<div>\r\n\t12GB RAM + 512GB Storage: Rs 92,999</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tColours: Icyblue, Silver Shadow, Navy, Mint</div>\n<div>\r\n\tExclusive colours on Samsung’s website: Blueblack, Coralred and Pinkgold</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPre-order offers:</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSamsung announced that customers pre-ordering the Galaxy S25 can receive benefits of up to Rs 11,000 on trade-in deals. Alternatively, those purchasing the smartphone with a no-interest EMI plan of nine months can avail a cashback of Rs 7,000. No-interest EMI plans of up to 24 months are available for the Galaxy S25.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Samsung Galaxy S25 Ultra: Specifications</strong></div>\n<ul>\n<li>\r\n\t\tDisplay: 6.9-inch QHD+ Dynamic AMOLED 2X Display, 120Hz refresh rate (1-120Hz)</li>\n<li>\r\n\t\tProcessor: Qualcomm Snapdragon 8 Elite for Galaxy </li>\n<li>\r\n\t\tRAM: 12GB</li>\n<li>\r\n\t\tStorage: 256GB, 512GB, 1TB</li>\n<li>\r\n\t\tRear camera: 200MP primary (OIS), 50MP Ultra-wide, 50MP telephoto (5x), 10MP telephoto (3x zoom)</li>\n<li>\r\n\t\tFront camera: 12MP</li>\n<li>\r\n\t\tBattery: 5000mAh</li>\n<li>\r\n\t\tCharging: Up to 65 per cent charge in around 30 mins with 45W adapter, wireless charging support</li>\n<li>\r\n\t\tOS: Android 15-based One UI 7</li>\n<li>\r\n\t\tProtection: Corning Gorilla Armor 2, IP68</li>\n</ul>\n<div>\n<strong>Samsung Galaxy S25 Plus: Specifications</strong></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<ul>\n<li>\r\n\t\tDisplay: 6.7-inch QHD+ Dynamic AMOLED 2X Display, 120Hz refresh rate (1-120Hz)</li>\n<li>\r\n\t\tProcessor: Qualcomm Snapdragon 8 Elite for Galaxy </li>\n<li>\r\n\t\tRAM: 12GB</li>\n<li>\r\n\t\tStorage: 256GB, 512GB</li>\n<li>\r\n\t\tRear camera: 50MP primary (OIS), 12MP Ultra-wide, 10MP telephoto (3x zoom)</li>\n<li>\r\n\t\tFront camera: 12MP</li>\n<li>\r\n\t\tBattery: 4900mAh</li>\n<li>\r\n\t\tCharging: Up to 65 per cent charge in around 30 mins with 45W adapter, wireless charging support</li>\n<li>\r\n\t\tOS: Android 15-based One UI 7</li>\n<li>\r\n\t\tProtection: IP68</li>\n</ul>\n<div>\n<strong>Samsung Galaxy S25: Specifications</strong></div>\n<ul>\n<li>\r\n\t\tDisplay: 6.2-inch FHD+ Dynamic AMOLED 2X Display, 120Hz refresh rate (1-120Hz)</li>\n<li>\r\n\t\tProcessor: Qualcomm Snapdragon 8 Elite for Galaxy </li>\n<li>\r\n\t\tRAM: 12GB</li>\n<li>\r\n\t\tStorage: 256GB, 512GB</li>\n<li>\r\n\t\tRear camera: 50MP primary (OIS), 12MP Ultra-wide, 10MP telephoto (3x zoom)</li>\n<li>\r\n\t\tFront camera: 12MP</li>\n<li>\r\n\t\tBattery: 4000mAh</li>\n<li>\r\n\t\tCharging: Up to 50 per cent charge in around 30 mins with 25W adapter and 3A USB-C cable, wireless charging support</li>\n<li>\r\n\t\tOS: Android 15-based One UI 7</li>\n<li>\r\n\t\tProtection: IP68</li>\n</ul></div>",
            "pub_date": "2025-02-04 13:00:34",
            "link": "https://www.business-standard.com/technology/tech-news/galaxy-s25-series-samsung-kicks-off-early-deliveries-ahead-of-feb-7-sale-125020400246_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400246"
        },
        {
            "title": "Apple raises concerns over first porn app on iPhone under new EU rules",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tApple on Monday criticized a pornography app newly available on iPhones in the European Union, saying the bloc's digital policy was undermining consumer confidence in Apple.<small class=\"brtag\"> </small></div>\n<div>\r\n\tSince it first opened the App Store on iPhones in 2008, Apple has controlled what apps could be downloaded to the devices, with then-CEO Steve Jobs saying in 2010 that keeping porn off the iPhone was Apple's \"moral responsibility\" and one of the company's major motivations for acting as a gatekeeper.<small class=\"brtag\"> </small></div>\n<div>\r\n\tIn the EU, Apple's gatekeeper status changed with the 2022 adoption of the Digital Markets Act (DMA), which required Apple to allow alternative app stores. One of those stores, called AltStore, has begun distributing an app called Hot Tub, which describes itself as \"a private, secure, and elegant way to browse adult content.\"<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tIn a statement, Apple said it is \"deeply concerned about the safety risks that hardcore porn apps of this type create for EU users, especially kids. This app and others like it will undermine consumer trust and confidence in our ecosystem.\" AltStore said it had received backing from Epic Games, the creator of the \"Fortnite\" video game that pursued an antitrust complaint against Apple.<small class=\"brtagPara\"> </small> AltStore said it used that funding to pay fees that Apple charges to alternative app stores that are under investigation by the EU, according to media reports.<small class=\"brtag\"> </small></div>\n<div>\r\n\tAs part of its alternative app store process, Apple still requires apps to undergo a baseline review called \"notarization\" that checks for cybersecurity threats such as known malware but does not involve approving the app's content.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tAltStore said Hot Tub was notarized by Apple and in a post on X described that move as making the app \"the world's 1st Apple-approved porn app,\" raising Apple's ire.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"Contrary to the false statements made by the marketplace developer, we certainly do not approve of this app and would never offer it in our App Store,\" Apple said in a statement.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"The truth is that we are required by the European Commission to allow it to be distributed.\"<small class=\"brtag\"> </small></div>\n<div>\r\n\tAltStore said comments on X were in reference to Apple's notarization decision, and Hot Tub steered press inquiries to AltStore.<small class=\"brtag\"> </small></div>\n<div>\r\n\tIn a post on X, Epic Games Chief Executive Tim Sweeney said his firm has supported laws such as the DMA because \"when Apple are allowed to be the gatekeeper of competing apps and stores, they grossly misuse that power to disadvantage competition.\" He added that Epic's own app store in the EU, which rolled out last year, is not carrying the Hot Tub app and has never hosted porn apps.<small class=\"brtag\"> </small></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\n<div>\n<i>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</i></div>\n</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 13:00:34",
            "link": "https://www.business-standard.com/technology/tech-news/apple-raises-concern-over-first-porn-app-on-iphone-under-new-eu-rules-125020400252_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400252"
        },
        {
            "title": "Power Grid share price slips 4% on weak Q3 performance; details here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Power Grid share price: </strong>Power Grid announced a weak set of December quarter of financial year <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">(Q3FY25) results</a> on Monday, February 3, 2025, post-market hours. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing this, on Tuesday, <a href=\"https://www.business-standard.com/markets/power-grid-corporation-of-india-ltd-share-price-5455.html\" target=\"_blank\">Power Grid share price</a> slipped as much as 4.08 per cent to hit an intraday low of Rs 272.30. It was also the top loser on the BSE Sensex index.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, at 9:45 AM, Power Grid share was off day’s low, and was trading 1.88 per cent lower at Rs 278.55 per share. In comparison, BSE Sensex was trading 0.91 per cent higher at 77,890.78 levels.</div>\n<small class=\"brtag\"> </small>\n<div>\n<a href=\"https://www.business-standard.com/companies/results/power-grid-corp-q3-results-pat-dips-4-to-rs-3-682-cr-on-weak-demand-125020301166_1.html\" target=\"_blank\">Power Grid’s consolidated profit dropped</a> 4.1 per cent year-on-year (Y-o-Y) to Rs 3,861.6 crore in the December quarter of financial year 2025 (Q3FY25), from Rs 4,028.3 crore in the same quarter last year (Q3FY24).</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company’s revenue dropped 2.7 per cent Y-o-Y to Rs 11,233 crore in Q3FY25, from Rs 11,549.8 crore in Q3FY24. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt the operating front, earnings before interest, tax, depreciation and amortisation (Ebitda) tanked 6.6 per cent annually to Rs 9,538 crore in Q3FY25, from Rs 10,212.9 crore in Q3FY24. Subsequently, Ebitda margin squeezed 350 bps to 84.9 per cent in Q3FY25, from 88.4 per cent in Q3FY24. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company declared a second interim dividend of Rs 3.25 per share for FY25. February 7 has been fixed as the record date for the dividend.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAdditionally, the Board approved an investment of Rs 370 crore for the 400kV Vindhyachal PS – Sasan D/C Line at Hindalco Switchyard, scheduled for commissioning by December 2026.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDespite the weak Q3 show, ICICI Securities analysts said that the transmission opportunity over the next 5 years is major given the strong generation capacity addition programme and Power Grid will be one of the key beneficiaries. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTherefore, analysts at ICICI Securities said that they await the company’s guidance in terms of capacity addition over the next 3-5 years, and suggest using any major corrections to add the stock.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPower Grid primarily focuses on the transmission of electricity through its EHVAC/HVDC network. Additionally, the company has expanded into the telecom sector by utilising its extensive Pan-India transmission infrastructure, incorporating the installation of Optical Ground Wire (OPGW).</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLast checked, Power Grid market capitalisation stood at Rs 2,60,835 crore, according to BSE.</div></div>",
            "pub_date": "2025-02-04 12:55:29",
            "link": "https://www.business-standard.com/markets/news/power-grid-share-price-slips-4-on-weak-q3-performance-details-here-125020400242_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400242"
        },
        {
            "title": "18,000 Indians identified as illegal immigrants in US; 205 deported so far",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tA US military plane has deported 205 Indian migrants as part of President Donald Trump’s strict immigration policies. The C-17 aircraft departed from San Antonio, Texas, early on Tuesday morning, around 3 am IST.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump introduced military deportation flights last week under his emergency declaration on immigration.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"For the first time in history, we are locating and loading illegal aliens into military aircraft and flying them back to the places from which they came,\" Trump told reporters last month.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing a call with Prime Minister Narendra Modi, Trump said he expected India to cooperate. “He (Modi) will do what’s right when it comes to taking back illegal Indian immigrants from America,” he said.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndia and the US have identified around 18,000 Indian nationals in the US without legal status. In the 2023-24 period, the US Department of Homeland Security deported over 1,100 Indian nationals. Globally, 495 repatriation flights returned 160,000 individuals to 145 countries, including India.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe number of Indian migrants attempting to enter the US unlawfully has grown. In 2023-24, US officials recorded 90,415 attempts by Indian nationals to enter the country without authorisation, mostly via the northern border. Indians now make up around 3% of all unauthorised crossings, surpassing other Asian groups such as Filipinos, according to US Customs and Border Protection (CBP) data.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Why do Indians attempt illegal migration?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEconomic challenges and visa restrictions are major factors driving migration.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The lowest per capita income in the US is $48,110, in the state of Mississippi,” said Russell A Stamets, partner at Circle of Counsels. “The net national income for India is about 2.4% of that—around $1,161—and Bihar has the lowest per capita income at about $708, or around 1.5% of the poorest state in the US.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHe added, “There will always be people looking to better their life situation.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tVisa delays are another challenge.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Many Indians face restrictions and long delays in obtaining visas or green cards,” said Zeeshan Farooqui, partner at King Stubb &amp; Kasiva. “This drives some to explore alternative routes, often at great financial and personal risk.”</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Skilled migration still dominates</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDespite the rise in illegal migration, Indians remain the largest recipients of skilled worker visas in the US. By September 30, 2023, Indian nationals received about 78% of the 265,777 H-1B visas issued, totalling around 207,307. The H-1B visa programme plays a key role in US industries such as science, technology, engineering, and mathematics (STEM).</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Immigration and crime</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe role of immigrants in society has sparked debate. Last month, Bishop Mariann Edgar Budde of the National Cathedral in Washington urged Trump to reconsider his stance.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“In the name of our God, I ask you to have mercy upon the people in our country who are scared now,” she said.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The people...they are people who pick our crops, clean our office buildings, who labour in poultry and meat-packing plants, who wash our dishes after we eat in restaurants, and work the night shifts in hospitals,” she said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“They may not be citizens nor have proper documentation, but the vast majority of immigrants are not criminals. They pay taxes and are good neighbours. They are faithful members of our churches, synagogues, gurdwaras, mosques and temples.”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump, however, maintained his position, saying, “A large number of immigrants have come to the United States illegally and killed people.” He did not provide specific figures.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tStudies suggest immigration is not linked to increased crime.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Immigrants in the United States commit crimes at lower rates than the US-born population,” according to a report by Migration Policy.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tData from the National Bureau of Economic Research and state records from Texas indicate that most prosecutions of immigrants involve immigration law violations rather than violent or property crimes. Some experts suggest that fear of deportation discourages unauthorised immigrants from engaging in criminal activity.</div></div>",
            "pub_date": "2025-02-04 12:55:29",
            "link": "https://www.business-standard.com/finance/personal-finance/18-000-indians-identified-as-illegal-immigrants-in-us-205-deported-so-far-125020400247_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400247"
        }
    ]
}