{
    "data": [
        {
            "title": "Opening up high-band spectrum not enough for 5G, 6 GHz band needed: Telcos",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Telecom Regulatory Authority of India (Trai)'s decision to open up several 5G high-band or millimetre-wave (mmWave) spectrum will not compensate for the lack of 5G spectrum in mid-bands (1-6 GHz), telco officials believe.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe government needs to free up at least an additional 1,200 MHz of spectrum to allocate a total of 2 GHz of radio waves across the mid-band, especially in the 6 GHz band for mobile telephony, private sector telco officials told Business Standard under conditions of anonymity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn Tuesday, Trai recommended that spectrum in the 37-37.5 GHz and 37.5-40 GHz frequency ranges should be auctioned, while it has recommended against auctions for the 42.5-43.5 GHz frequency range. MmWave, or spectrum bands above 24 gigahertz (GHz), is a valuable resource when targeting densely populated urban areas. The high band offers an opportunity for service providers to offer unprecedented peak rates, low latency, and high capacity. But this is not enough, telcos believe.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"High bands like the 37.5 GHz band have certain targeted use cases for 5G. But their limitations include not being able to travel as far as mid and low-band signals and being more susceptible to interference. On a national level, access to the 6 GHz band is required for large-scale 5G coverage,\" a private sector telco official said. He pointed to a report by global mobile industry body GSM Association (GSMA), arguing that India can save as much as $10 billion annually in 5G network deployment through the use of the 6 GHz spectrum.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAn official at another telco echoed Jio's earlier submission to Trai that the entire 6 GHz band should be earmarked for telecom purposes so that around 300-400 megahertz is available to each telecom operator for the growth of 5G and the introduction of 6G services.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe 6 GHz band represents the largest block of unused spectrum and is being fought over by telcos and tech companies. The Cellular Operators Association of India (COAI), which counts Reliance Jio, Bharti Airtel, and Vodafone Idea among its members, has said only 720 MHz is available in the mid-band in India. India needs an additional 2 GHz of mid-band spectrum to meet the international standard of 'IMT-2020' user experience to ensure data rates of 100 megabits per second (mbps) on downlink and 50 mbps on uplink in densely populated cities, it recently said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, the Broadband India Forum (BIF), which represents tech majors like Google, Meta, and Microsoft and telecom equipment makers such as Ericsson, Cisco, and Huawei, has pushed for the 6 GHz band to be delicensed, thereby opening it up for Wi-Fi in India.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Global scenario</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tDepartment of Telecommunications (DoT) officials, however, indicate that no decision has been taken on opening up 6 GHz airwaves as yet. In December 2023, the International Telecommunication Union (ITU) set aside 6.425-7.125 GHz for licensed mobile operations. The decision was taken at the 10th World Radiocommunication Conference, held every three to four years to review and revise international agreements on the use of radio spectrum.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGlobally, the move by the United States to make the full 6 GHz band available for unlicensed use has created a trend in many countries, including Brazil and Saudi Arabia. On the other hand, China will use the entire 1,200 MHz in the 6 GHz band for 5G, while Europe has split the band, with the upper part considered for 5G and a new 500 MHz tranche available for Wi-Fi.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn 2023, Trai had recognised that the lower end of the 6 GHz spectrum band can be allocated for unlicensed use, such as Wi-Fi, while the upper end is licensed for IMT. It had said this would be in line with global precedents. It also noted that India has far less spectrum devoted to unlicensed use than other major economies.</div></div>",
            "pub_date": "2025-02-05 20:15:30",
            "link": "https://www.business-standard.com/industry/news/opening-up-high-band-spectrum-not-enough-for-5g-6-ghz-band-needed-telcos-125020501357_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501357"
        },
        {
            "title": "Delhi Assembly elections: When and where to watch exit poll results live?",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe intense campaign for the <a href=\"https://www.business-standard.com/topic/delhi-assembly-elections\" target=\"_blank\">Delhi Assembly elections</a> concluded on Monday evening, shifting focus to the polling day on February 5. The national capital is likely to witness a three-way contest among the ruling Aam Aadmi Party (AAP), the Bharatiya Janata Party (BJP), and the Congress.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tVoting on all 70 constituencies will take place in a single phase on February 5. Polling stations across all constituencies will open at 7 am and close at 6:30 pm. Exit polls, which provide early indications of voter trends, will be released after that.</div>\n<h3>\r\n\tDelhi polls: What are exit polls?</h3>\n<div>\r\n\tExit polls involve surveying voters immediately after they leave polling stations to gauge election outcomes. While they offer insights into possible results, they are not always accurate.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSeveral factors, such as sample selection, margin of error, and the honesty of respondents, influence their reliability. Despite these challenges, exit polls play a key role in shaping post-election discussions.  <small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/elections/delhi-elections/delhi-assembly-election-2025-voting-live-updates-5-feb-bjp-aap-congress-delhi-vidhan-sabha-polling-percentage-125020500062_1.html\" target=\"_blank\">Delhi Election LIVE</a></div>\n<h3>\r\n\tDelhi elections 2025: When will exit poll results be announced?</h3>\n<div>\r\n\tThe Election Commission has imposed restrictions on the publication of exit polls until 6:30 pm on February 5. The results of any such polls will be made public only after this period.  </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The Commission notifies the period between 7.00 am to 6.30 pm on 05.02.2025 (Wednesday) as the period during which conducting and publishing or publicising exit poll by means of the print or electronic media or dissemination in any other manner whatsoever, the result of any exit poll in connection with the aforesaid General and bye elections, shall be prohibited,\" the Election Commission stated in a notice issued on February 3.  <small class=\"brtagPara\"> </small>\n<strong><a href=\"https://www.business-standard.com/elections/delhi-elections/delhi-election-exit-poll-results-2025-live-updates-aap-bjp-congress-delhi-assembly-election-exit-polls-125020501064_1.html\">Delhi election exit polls Live</a></strong></div>\n<h3>\r\n\tDelhi Assembly polls: Who are the major pollsters?</h3>\n<div>\r\n\tSeveral media organisations conduct exit polls in collaboration with research agencies. Some of the prominent pollsters include:  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t- Axis My India  </div>\n<div>\r\n\t- CVoter  </div>\n<div>\r\n\t- IPSOS  </div>\n<div>\r\n\t- Jan Ki Baat  </div>\n<div>\r\n\t- Today's Chanakya  </div>\n<h3>\r\n\tDelhi elections 2025: Key constituencies and candidates</h3>\n<div>\r\n\tSome constituencies in Delhi are drawing attention due to the participation of prominent leaders.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>New Delhi constituency:</strong> AAP patron Arvind Kejriwal, BJP’s Parvesh Verma, and Congress candidate Sandeep Dixit, son of former Chief Minister Sheila Dixit, will compete for this high-profile seat.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Patparganj seat:</strong> AAP’s new entrant Avadh Ojha is contesting against BJP’s Ravinder Singh Negi, while Anil Chaudhary represents Congress.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rohini seat:</strong> In this key North-West Delhi constituency, AAP’s Pradeep Mittal is up against BJP’s sitting MLA Vijender Gupta.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Kalkaji seat:</strong> A three-way contest is expected between incumbent Delhi Chief Minister Atishi Kapoor (AAP), former BJP MP Ramesh Bidhuri, and Congress leader Alka Lamba.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Jangpura constituency:</strong> BJP’s Sardar Tarvinder Singh Marwah is set to challenge AAP’s Manish Sisodia, with Congress fielding Farhad Suri.  </div>\n<h3>\r\n\tDelhi elections 2025: A three-way battle  </h3>\n<div>\r\n\tThe 70-seat Delhi Assembly elections are crucial for AAP, which is aiming for a third consecutive term. Meanwhile, the BJP, riding high on recent victories in Haryana and Maharashtra, is looking to gain ground.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Congress, a part of the INDIA bloc along with AAP at the national level, is also vying to revive its influence in the capital, where it once dominated the political landscape.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith 699 candidates in the fray across 70 constituencies, the elections will serve as a referendum on AAP’s governance, while also shaping the future of BJP and Congress in Delhi for the next five years. The results on February 8 will determine whether AAP retains power or if BJP and Congress manage to stage a comeback.  </div>\n<h3>\r\n\tDelhi Assembly elections 2020  </h3>\n<div>\r\n\tIn the 2020 Assembly elections, the AAP secured a decisive victory, winning 62 out of 70 seats. The BJP, its closest rival, won only eight seats, while the Congress failed to win any.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAAP’s dominance was even more pronounced in 2015 when it won 67 seats, leaving BJP with just three and Congress with none.  </div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tDelhi Elections 2025: Were exit polls right In 2020?</h3>\n<div>\r\n\tDuring the 2020 elections, exit polls overwhelmingly predicted an AAP victory, with most forecasts giving the party over 50 seats.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndia Today-Axis My India projected the highest range for AAP at 59-68 seats. Meanwhile, Jan Ki Baat, NewsX-Neta, and India News Nation estimated 55 seats for AAP.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTimes Now was one of the few polls to predict a slightly closer contest, giving AAP 47 seats and BJP 23.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUltimately, the actual results closely aligned with the predictions, as AAP won 62 seats and BJP secured eight. Notably, exit polls in 2020 were more accurate compared to 2015, when predictions had significantly underestimated AAP’s landslide victory.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFor live updates and thorough coverage of exit polls, please visit <a href=\"https://www.business-standard.com\"><em>Business Standard</em></a>.</div></div>",
            "pub_date": "2025-02-05 20:15:29",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-assembly-elections-2025-exit-polls-date-time-live-aap-bjp-congress-125020400640_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400640"
        },
        {
            "title": "NaBFID extends Rs 2,000 crore loan to Blackstone-backed data centre",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe National Bank for Financing Infrastructure and Development (NaBFID) is extending a loan of just over Rs 2,000 crore to Gramercy Techpark Private Ltd, a data centre player, for the construction of a 120-megawatt (MW) facility at Mahape in Navi Mumbai. This will be the second such data centre by the Blackstone-backed entity in Navi Mumbai, where construction is expected to start in the middle of the current calendar year (2025).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA senior executive with a public sector lender said NaBFID, a government-owned infrastructure financier, has extended a loan (construction finance). Now, it is looking to bring on board other lenders by offloading part of its exposure.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe data centre company did not respond to queries from Business Standard.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs part of due diligence, the lender has assessed occupancy prospects, as they provide visibility on cash flows for upkeep and repayments. It has also considered power supply arrangements, the bank executive said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMany hyperscalers (large-capacity data centres) have term contracts with tenants, ensuring stable cash flows through rentals. According to CRISIL Ratings, data centres cater to the computing and storage infrastructure demand, which is driven by two primary factors. First, enterprises are rapidly shifting their businesses to digital platforms, including cloud services, a trend that has accelerated post-Covid-19 pandemic. Second, increased accessibility to high-speed data has led to a surge in internet usage, including social media, over-the-top (OTT) platforms, and digital payments.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn addition to the ongoing demand, the rapid advancement of generative artificial intelligence (GenAI), which requires higher computational power and lower latency than traditional cloud computing functions, will also provide a tailwind to data centre demand in India.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTypically, the debt-to-equity ratio for such data centre projects is about 80:20. These are capital-intensive projects involving a highly automated setup. Employment generation is minimal, with limited benefits for the surrounding ecosystem in terms of economic activity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to CRISIL, to meet the growing data centre demand, an investment of Rs 55,000-65,000 crore is required over the next three financial years, primarily towards land and building, power equipment, and cooling solutions. Data centre operators typically build infrastructure—land and buildings, which account for 25-30 per cent of overall capital expenditure—with the expectation of future tie-ups.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 20:10:29",
            "link": "https://www.business-standard.com/companies/news/nabfid-extends-rs-2-000-crore-loan-to-blackstone-backed-data-centre-125020501355_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501355"
        },
        {
            "title": "Drone battery tech co Dreamfly Innovations raises $1.4 mn in seed funding",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<div>\r\n\t\tDreamfly Innovations, which provides high power-density battery technology for drones, aviation, and aerospace, has raised $1.4 million (Rs 12 crore) in its seed funding round.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tIn a seed round, a startup raises funds to establish its business. The firm plans to use this fund to scale production capabilities, team expansion and research and development.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe funding round was led by Avaana Capital, with participation from Sunicon Ventures and a few other investors. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe global drone market is projected to reach $54 billion by 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“India stands to capture a substantial share, potentially reaching $4.2 billion and expanding to $23 billion by 2030,” said Kajal Shah, co-founder and chief executive officer of Dreamfly Innovations, while referring to an EY-FICCI report.</div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tShah said that India needs to ramp up its drone component manufacturing to cut import.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“The biggest challenge that India faces is the lack of a component ecosystem for drones due to which the domestic manufacturers have to depend on imported materials,” said Shah.</div>\n<small class=\"brtag\"> </small>\n<div>\n<div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/world-news/ukraine-drone-attack-forces-flight-suspensions-at-many-russian-airports-125020300165_1.html\" target=\"_blank\">Ukraine drone attack forces flight suspensions at many Russian airports</a></strong></div>\n</div>\n<small class=\"brtag\"> </small>\n</div>\n<div>\r\n\t\tDreamfly Innovations’ current customers span from Tata Advanced Systems (TASL) -- Tata Group’s strategic entity in the Aerospace industry, to Larsen &amp; Toubro Limited (L&amp;T).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tOther customers include General Aeronautics -- a drone technology company specialising in precision spraying and agriculture and Neosky India Ltd, a wholly-owned subsidiary of RattanIndia Enterprises Ltd. </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tFounded by Kajal Shah and Saurabh Markandeya in 2022, Dreamfly Innovations combines over a decade-long, dual domain expertise in providing clean energy and mobility solutions. Both Shah and Markandeya are two-time entrepreneurs and alumni of IIT Bombay and IISc respectively. With two patents filed, they are committed to pioneering fire-resistant and efficient thermal battery technologies.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tShah said as drones gain traction across sectors such as agriculture, geospatial mapping and logistics, the demand for reliable, high-performance batteries has surged. However, another issue is that drone OEMs (original equipment manufacturers) face significant challenges in adapting to evolving battery technologies, addressing limited lifespans, and resolving safety concerns.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“Dreamfly Innovations is poised to tackle these challenges with patented thermal battery case designs and advanced cell stack innovations, effectively tackling the core concerns of drone developers,” said Shah.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tSwapna Gupta, Partner at Avaana Capital, said the rise in electrification to combat climate crisis and eliminating fossil fuels in industries such as transportation and agriculture is leading to unprecedented battery demand.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\t“Dreamfly’s battery solutions which improve battery life and safety align perfectly with our fund’s ideology of building a low-emission pathway towards development of the drone ecosystem,” said Gupta.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 20:10:28",
            "link": "https://www.business-standard.com/companies/start-ups/drone-battery-tech-co-dreamfly-innovations-raises-1-4-mn-in-seed-funding-125020501163_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501163"
        },
        {
            "title": "Making all efforts to bring back Hasina from India: Bangladesh home adviser",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tBangladesh's interim government is making all efforts to bring back ousted prime minister Sheikh Hasina and others from India under the extradition treaty, Home Adviser Lt Gen (retd.) Md Jahangir Alam Chowdhury said on Wednesday.</p>\n<p>\r\n\tHasina, 77, has been living in India since August 5 last year when she fled Bangladesh following a massive student-led protest that toppled her Awami League's 16-year regime.</p>\n<p>\r\n\tBangladesh's International Crimes Tribunal (ICT) has issued arrest warrants for Hasina and several former Cabinet ministers, advisers, and military and civil officials for \"crimes against humanity and genocide\".</p>\n<p>\r\n\t\"We are trying to bring back those who are under trial on charges of crimes against humanity at the ICT,\" Chowdhury was quoted as saying by state-run BSS news agency.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tHe made the remarks while replying to a question on steps taken by the government to arrest over 100 accused against whom the ICT has issued arrest warrant.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tLast year, Dhaka sent a diplomatic note to New Delhi seeking the extradition of Hasina.</p>\n<p>\r\n\tThe Home Adviser said they are arresting those staying in the country while efforts are on to bring back others who are staying abroad.</p>\n<p>\r\n\t\"We're arresting those who are staying in the country. The main person (Hasina) is not in the country. How we would arrest them who are abroad?\" he said, adding that legal efforts are going on to bring them back.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tWhen asked about the progress of issuing red notices against them, police chief Baharul Alam said he hoped that Interpol would soon issue notice against the persons wanted by the ICT.</p>\n<p>\r\n\t\"As the red notice has been issued by the ICT, the host country is liable to arrest them, he said.</p>\n<p>\r\n\tThe interim government has already revoked the passports of Hasina and 96 others over their alleged involvement in enforced disappearances and the July killings.</p>\n<p>\r\n\tIn December, Bangladesh officially sought Hasina's repatriation to stand trial on charges of mass killings during the Anti-Discrimination Student's Movement dubbed as the July-August uprising.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tBangladesh's International Crimes Tribunal, originally formed to try the hardened collaborators of atrocities of Pakistani troops during its 1971 Liberation War, so far has issued two arrest warrants ordering authorities to arrest her and ensure her court appearance by February 12 as she was also accused of enforced disappearances during the past 16-year rule.</p>\n<p>\r\n\tMeanwhile, the High Court on Wednesday acquitted all 47 people convicted in a case filed over an attack on a train carrying Hasina, the then-leader of the opposition, in Ishwardi on September 23, 1994, the news agency reported.</p>\n<p>\r\n\tA bench of Justices Muhammad Mahbub Ul Islam and Md Hamidur Rahman pronounced the judgment after hearing the convicts' death references and jail appeals.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tTerming the lower court judgment inhuman, the High Court ordered the immediate release of the acquitted people.</p>\n<p>\r\n\tThe lower court had sentenced nine people to death, 25 people to life imprisonment and 13 others to 10 years in jail.</p>\n<p>\r\n\tHasina was travelling from Khulna to Syedpur via train when it was attacked with crude bombs and gunshots. Police filed a charge sheet against 52 Bangladesh Nationalist Party activists on April 4, 1997.</p><p></p></div>",
            "pub_date": "2025-02-05 20:05:26",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/making-all-efforts-to-bring-back-hasina-from-india-bangladesh-home-adviser-125020501121_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501121"
        },
        {
            "title": "'Trump may be interested in Indian firms signing contracts for US LNG'",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\n<strong>ANNE-SOPHIE CORBEAU</strong> is a global research scholar at the Center on Global Energy Policy at Columbia University’s School of International and Public Affairs. She has more than 20 years of experience in the energy industry and is the author of many publications on gas, LNG markets, Asia, China, India and Africa. Corbeau, in an email interview with <strong>S Dinakar</strong>, spoke about US President Donald Trump’s energy policy and its likely impact on India. Edited excerpts from an interview:</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>What would be the impact of China’s retaliatory tariffs on US energy imports (15 per cent on LNG and 10 per cent</strong></div></div>",
            "pub_date": "2025-02-05 20:05:26",
            "link": "https://www.business-standard.com/industry/news/trump-may-be-interested-in-indian-firms-signing-contracts-for-us-lng-125020501340_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501340"
        },
        {
            "title": "South Korea temporarily bans DeepSeek over security concerns: Reports",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tSouth Korea's industry ministry has temporarily banned employee access to Chinese artificial intelligence startup DeepSeek due to security concerns, a ministry official said on Wednesday, as the government urges caution on generative AI services.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe government issued a notice on Tuesday calling for ministries and agencies to exercise caution about using AI services including DeepSeek and ChatGPT at work, officials said.<small class=\"brtag\"> </small></div>\n<div>\r\n\tState-run Korea Hydro &amp; Nuclear Power said it had blocked use of AI services including DeepSeek earlier this month.</div>\n<div>\r\n\tThe temporary ban makes South Korea the latest government to warn about DeepSeek.<small class=\"brtag\"> </small></div>\n<div>\r\n\tLast month, Australian Treasurer Jim Chalmers called on Australians to be cautious when using the Chinese AI model while U.S. officials are also looking at DeepSeek's national security implications.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tSouth Korea's information privacy watchdog plans to ask DeepSeek about how the personal information of users is managed.<small class=\"brtag\"> </small></div>\n<div>\r\n\tChinese startup DeepSeek's launch of its latest AI models last month sent shockwaves through the tech world. The company says its models are on a par with or better than products developed in the United States and are produced at a fraction of the cost.<small class=\"brtag\"> </small></div>\n<div>\r\n\tTech giant Kakao Corp has told its employees to refrain from using DeepSeek due to security fears, a company spokesperson said on Wednesday, a day after the company announced its partnership with generative artificial intelligence heavyweight OpenAI.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tKorean tech companies are now being more careful about using generative AI. SK Hynix, a maker of AI chips, has restricted access to generative AI services, and allowed limited use when necessary, a spokesperson said.<small class=\"brtag\"> </small></div>\n<div>\r\n\tInternet giant Naver said it had asked employees not to use generative AI services that store data outside the company.<small class=\"brtagPara\"> </small>\n<b style=\"font-family:Arial, Helvetica, sans-serif;font-size:small\"><i>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</i></b></div></div>",
            "pub_date": "2025-02-05 20:00:35",
            "link": "https://www.business-standard.com/world-news/south-korea-temporarily-bans-deepseek-over-security-concerns-reports-125020501333_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501333"
        },
        {
            "title": "Making all efforts to bring back Hasina from India: Bangladesh home adviser",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tBangladesh's interim government is making all efforts to bring back ousted prime minister Sheikh Hasina and others from India under the extradition treaty, Home Adviser Lt Gen (retd.) Md Jahangir Alam Chowdhury said on Wednesday.</p>\n<p>\r\n\tHasina, 77, has been living in India since August 5 last year when she fled Bangladesh following a massive student-led protest that toppled her Awami League's 16-year regime.</p>\n<p>\r\n\tBangladesh's International Crimes Tribunal (ICT) has issued arrest warrants for Hasina and several former Cabinet ministers, advisers, and military and civil officials for \"crimes against humanity and genocide\".</p>\n<p>\r\n\t\"We are trying to bring back those who are under trial on charges of crimes against humanity at the ICT,\" Chowdhury was quoted as saying by state-run BSS news agency.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tHe made the remarks while replying to a question on steps taken by the government to arrest over 100 accused against whom the ICT has issued arrest warrant.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tLast year, Dhaka sent a diplomatic note to New Delhi seeking the extradition of Hasina.</p>\n<p>\r\n\tThe Home Adviser said they are arresting those staying in the country while efforts are on to bring back others who are staying abroad.</p>\n<p>\r\n\t\"We're arresting those who are staying in the country. The main person (Hasina) is not in the country. How we would arrest them who are abroad?\" he said, adding that legal efforts are going on to bring them back.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tWhen asked about the progress of issuing red notices against them, police chief Baharul Alam said he hoped that Interpol would soon issue notice against the persons wanted by the ICT.</p>\n<p>\r\n\t\"As the red notice has been issued by the ICT, the host country is liable to arrest them, he said.</p>\n<p>\r\n\tThe interim government has already revoked the passports of Hasina and 96 others over their alleged involvement in enforced disappearances and the July killings.</p>\n<p>\r\n\tIn December, Bangladesh officially sought Hasina's repatriation to stand trial on charges of mass killings during the Anti-Discrimination Student's Movement dubbed as the July-August uprising.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tBangladesh's International Crimes Tribunal, originally formed to try the hardened collaborators of atrocities of Pakistani troops during its 1971 Liberation War, so far has issued two arrest warrants ordering authorities to arrest her and ensure her court appearance by February 12 as she was also accused of enforced disappearances during the past 16-year rule.</p>\n<p>\r\n\tMeanwhile, the High Court on Wednesday acquitted all 47 people convicted in a case filed over an attack on a train carrying Hasina, the then-leader of the opposition, in Ishwardi on September 23, 1994, the news agency reported.</p>\n<p>\r\n\tA bench of Justices Muhammad Mahbub Ul Islam and Md Hamidur Rahman pronounced the judgment after hearing the convicts' death references and jail appeals.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tTerming the lower court judgment inhuman, the High Court ordered the immediate release of the acquitted people.</p>\n<p>\r\n\tThe lower court had sentenced nine people to death, 25 people to life imprisonment and 13 others to 10 years in jail.</p>\n<p>\r\n\tHasina was travelling from Khulna to Syedpur via train when it was attacked with crude bombs and gunshots. Police filed a charge sheet against 52 Bangladesh Nationalist Party activists on April 4, 1997.</p><p></p></div>",
            "pub_date": "2025-02-05 20:00:33",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/making-all-efforts-to-bring-back-hasina-from-india-bangladesh-home-adviser-125020501121_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501121"
        },
        {
            "title": "Sri Lanka vs Australia 2nd Test playing 11, live match time, streaming",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><div>\r\n\tSri Lanka and Australia will face off in the second Test of their two-match series, starting on Thursday (February 6) at the Galle International Stadium. Sri Lanka, reeling from a crushing defeat in the first Test, will be eager to rebound after their heaviest-ever Test loss. Australia dominated the opening game, winning by an innings and 242 runs, showcasing superiority in all aspects of the game.<small class=\"brtagPara\"> </small> With the series on the line, Australia will aim to maintain their momentum, while Sri Lanka will look to recover and make a strong statement in front of their home crowd.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA win in the second Test will further enhance their legacy and mark a rare series victory in South Asia, following their triumph in Pakistan in 2022. This would be their first series win in the subcontinent since their 2011 victory in Sri Lanka.<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/cricket/champions-trophy\"><strong>Check all latest updates Champions Trophy 2025 here</strong></a></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sri Lanka vs Australia 2nd Test: Playing 11</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sri Lanka playing 11 (probable): </strong>Dimuth Karunaratne, Oshada Fernando, Dinesh Chandimal, Angelo Mathews, Kamindu Mendis, Dhananjaya de Silva (c), Kusal Mendis (wk), Prabath Jayasuriya, Nishan Peiris, Jeffrey Vandersay, Asitha Fernando</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Australia playing 11 (probable):</strong> Usman Khawaja, Travis Head, Marnus Labuschagne, Steven Smith (c), Josh Inglis, Beau Webster, Alex Carey (wk), Mitchell Starc, Matthew Kuhnemann, Nathan Lyon, Todd Murphy</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sri Lanka vs Australia head-to-head in Tests</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe two teams have faced each other 34 times in Test cricket, with Australia winning 21 matches and Sri Lanka securing 5 victories. Eight of their encounters have ended in a draw. Australian spinner Nathan Lyon is nearing the milestone of 550 Test wickets, currently standing at 546 wickets at an average of 30.25. If he reaches this mark, he will become the second Australian spinner, after Shane Warne, to achieve such a feat.</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTotal matches played: 34</div>\n<div>\r\n\tSri Lanka won: 5</div>\n<div>\r\n\tAustralia won: 21</div>\n<div>\r\n\tDraw: 8<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/cricket/champions-trophy/champions-trophy-injury-woes-continue-to-mount-trouble-for-the-aussies-125020500374_1.html\">Champions Trophy 2025: Injury woes continue to mount trouble for Aussies</a></strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sri Lanka vs Australia Test series: Full squads</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sri Lanka squad:</strong> Dimuth Karunaratne, Pathum Nissanka, Dinesh Chandimal, Angelo Mathews, Kamindu Mendis, Dhananjaya de Silva (C), Kusal Mendis (wk), Ramesh Mendis, Prabath Jayasuriya, Jeffrey Vandersay, Asitha Fernando</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Australia squad:</strong> Usman Khawaja, Travis Head, Marnus Labuschagne, Steven Smith (C), Josh Inglis, Alex Carey (wk), Beau Webster, Cooper Connolly/Todd Murphy, Mitchell Starc, Matthew Kuhnemann, Nathan Lyon<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/cricket/champions-trophy/schedule\"><strong>Check Champions Trophy 2025 schedule here</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sri Lanka vs Australia 2nd Test live toss time, SL vs AUS live streaming and telecast details</strong></div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>When will the Sri Lanka vs Australia 2nd Test match take place?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Sri Lanka vs Australia 2nd Test match will take place on Thursday, February 6, at Galle International Stadium in Galle.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>At what time will the Sri Lanka vs Australia 2nd Test live toss take place on February 6?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe live toss for the Sri Lanka vs Australia 2nd Test will take place at 9:30 AM IST.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>At what time will the live match between Sri Lanka and Australia start on February 6?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Sri Lanka vs Australia 2nd Test will begin at 10:00 AM IST.</div><div id=\"between_article_content_10-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Which TV channels will live telecast the SL vs AUS 2nd Test match in India?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe live telecast of the 2nd Test match between Sri Lanka and Australia will be available on Sony Sports Network India.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>How to watch the live streaming of the Sri Lanka vs Australia 2nd Test in India?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe live streaming of the 2nd Test match between Sri Lanka and Australia will be available on the Sony LIV app and website in India.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 19:55:25",
            "link": "https://www.business-standard.com/cricket/news/sri-lanka-vs-australia-2nd-test-playing-11-live-match-time-streaming-125020501179_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501179"
        },
        {
            "title": "Swiggy Q3 results: Net loss widens to Rs 799 crore, GOV grows 38%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFood and grocery delivery firm Swiggy on Wednesday said its gross order value (GOV) grew 38 per cent year-on-year to Rs 12,165 crore. The company reported results today for the quarter and nine months ended December 31, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe consolidated adjusted Ebitda loss reduced by 2 per cent Y-o-Y to Rs 490 crore but rose Rs 149 crore quarter-on-quarter (Q-o-Q). The platform’s average MTU (monthly transacting users) increased 25.3 per cent Y-o-Y to reach 17.8 million, with nearly a third of all users utilising more than one service on the platform.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSriharsha Majety, managing director and group chief executive officer, Swiggy, said it continued to focus on creating segmented offerings for the consumer during the festive quarter, which it believes will open up more consumption occasions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn recent months, Majety said the firm introduced Bolt and Snacc (10-minute food delivery), expanded into new categories within quick-commerce, and plans to offer a greater assortment. The company also launched Swiggy Scenes, focused on restaurant event reservations, and introduced One BLCK, the premium tier of its Swiggy One subscription programme.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We delivered higher Y-o-Y growth across all three of our primary businesses during Q3, which accelerated B2C GOV growth to 38 per cent Y-o-Y,” said Majety. “The secular expansion in food delivery margins and cash flow generation is balanced by growth investments being made in quick-commerce, including dark store expansion and marketing, amidst high competitive intensity in the near term. With this thrust, Instamart added another 86 stores in January 2025 and has grown MTUs to 9 million (+2 million),” he said.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSwiggy’s food delivery business gross order value (GOV) grew 19.2 per cent Y-o-Y to Rs 7,436 crore. Adjusted Ebitda grew 63.7 per cent Q-o-Q to Rs 184 crore, delivering a 2.5 per cent margin, up from 0.3 per cent a year ago. The segment also added 2.4 million MTUs over the past year, driven by multiple industry-leading innovations. Bolt, a 10-minute restaurant food delivery service launched in October 2024, already accounts for 9 per cent of overall food deliveries.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSwiggy Instamart reported an 88 per cent Y-o-Y (15.5 per cent Q-o-Q) rise in GOV to Rs 3,907 crore. The average order value increased by 14 per cent Y-o-Y to Rs 534, driven by greater selection and increased consumer salience. Instamart added 96 new active stores during the quarter (+16 per cent Q-o-Q), driving up active dark store area to 2.45 million sq ft (+25 per cent Q-o-Q). Growth investments in quick-commerce led to a reduction in contribution margin from -1.9 per cent in Q2FY25 to -4.6 per cent in Q3FY25, as the company ramped up user activation and dark store expansion across geographies.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 19:55:24",
            "link": "https://www.business-standard.com/companies/start-ups/swiggy-q3-results-net-loss-widens-to-rs-799-crore-gov-grows-38-125020501320_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501320"
        }
    ]
}