{
    "data": [
        {
            "title": "What's OmniHuman-1, AI that transforms a single image into lifelike video?",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tImagine taking a single photo and transforming it into a fully animated video, where the subject moves naturally, speaks, and gestures in perfect sync with audio. That’s exactly what OmniHuman-1, the latest breakthrough from ByteDance, the parent company of TikTok, aims to achieve. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis AI framework is designed to generate lifelike human motion and speech from minimal input—just an image and an audio sample—solving a key challenge in AI-driven video creation. Previous models struggled with scaling movement data efficiently, often losing valuable motion patterns in the process. OmniHuman-1 advances the field by integrating multiple input sources simultaneously, including images, audio, body poses, and textual descriptions, ensuring more precise and fluid motion synthesis.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tTrained on 19,000 hrs video footage </h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTo build this system, ByteDance researchers trained it on 19,000 hours of video footage, allowing it to smoothly animate still frames into dynamic sequences that feel incredibly real. The AI first compresses movement data from its various inputs and then refines it by comparing its generated videos to real footage. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis two-step process enables OmniHuman-1 to produce highly accurate mouth movements, facial expressions, and body gestures, making the final output look natural and immersive. A demonstration of the technology features Nvidia CEO Jensen Huang appearing to sing, highlighting both the impressive realism and the potential risks associated with AI-generated deepfakes.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\t </h2>\n<div></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\tOmniHuman-1<small class=\"brtag\"> </small>\r\n\t\tGenerates extremely realistic human videos based on guiding audio, video or a single image. Results are mindblowing, especially the last one ???? <a href=\"https://t.co/s8Lwy6RL8k\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/s8Lwy6RL8k</a></p>\r\n\t— Gradio (@Gradio) <a href=\"https://twitter.com/Gradio/status/1886831499049136481?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 4, 2025</a></blockquote></div>\n<!-- --> <!-- --> <!-- -->Bring cartoon characters to life <small class=\"brtag\"> </small>\n<div>\r\n\tBeyond its ability to animate real people, OmniHuman-1 can also bring cartoon characters to life, offering new possibilities in animation, gaming, and digital avatar creation. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTheoretically, the model can generate videos of unlimited length, with current demonstrations ranging from five to 25 seconds, constrained only by available memory rather than the AI itself. </div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tAI-driven media on the rise</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis development comes shortly after ByteDance introduced INFP, another AI project specialising in animating facial expressions in conversations. Given the massive reach of TikTok and the widespread use of AI-powered tools in ByteDance’s video editing app, CapCut, OmniHuman-1 could soon revolutionise how AI-generated media is integrated into mainstream content creation.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tFuture of video AI</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWith ByteDance increasing focus on AI innovation in 2024, OmniHuman-1 represents a major leap forward in AI-driven video generation. As this technology advances, it raises important questions about its implications — whether for creative storytelling, entertainment, or the growing concerns around deepfakes and digital identity.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-05 17:35:24",
            "link": "https://www.business-standard.com/technology/tech-news/tiktok-ai-video-animation-omnihuman1-125020500901_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500901"
        },
        {
            "title": "Delhi polls: AAP-BJP clash outside Seelampur polling booth over fake voting",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tDelhi Assembly elections 2025: A clash broke out between the <a href=\"https://www.business-standard.com/about/what-is-aam-aadmi-party-aap\" target=\"_blank\">Aam Aadmi Party (AAP)</a> and <a href=\"https://www.business-standard.com/about/what-is-bharatiya-janata-party-bjp\" target=\"_blank\">Bharatiya Janata Party (BJP)</a> workers outside a polling booth in Seelampur during the <a href=\"https://www.business-standard.com/elections/delhi-elections/delhi-assembly-election-2025-voting-live-updates-5-feb-bjp-aap-congress-delhi-vidhan-sabha-polling-percentage-125020500062_1.html\" target=\"_blank\">Delhi Assembly polls</a> on Wednesday. The BJP had alleged fake voting, and the police had to intervene to maintain peace.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe BJP accused the AAP of enabling fake voting, alleging that women wearing burqas were seen casting fraudulent votes at several polling stations. BJP leaders claimed that these women voted multiple times, suggesting a deliberate effort to sway the election outcome. Party workers raised alarms about the fairness of the voting process, calling on the <a href=\"https://www.business-standard.com/about/what-is-election-commission-of-india\" target=\"_blank\">Election Commission</a> to look into these allegations and take appropriate action. They provided reports detailing several instances where such activities were reportedly observed.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\tVIDEO | Delhi Assembly Elections 2025: Uproar outside a polling booth in Seelampur as BJP alleges fake voting. Police jostle to maintain peace. <a href=\"https://twitter.com/hashtag/DelhiElections2025?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#DelhiElections2025</a> <a href=\"https://twitter.com/hashtag/DelhiElectionsWithPTI?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#DelhiElectionsWithPTI</a> <a href=\"https://t.co/ldxATD8N4k\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/ldxATD8N4k</a></p>\r\n\t— Press Trust of India (@PTI_News) <a href=\"https://twitter.com/PTI_News/status/1887054220047867913?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 5, 2025</a></blockquote></div>\n<!-- --> <!-- --> <!-- -->\n<div>\n<small class=\"brtag\"> </small> In response, the AAP dismissed the accusations, asserting that they were politically driven and intended to discredit the electoral process.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe situation unfolded after a voter reported that her vote had already been cast. Sabina Sadiq, Block Level Officer of Seelampur, said, “A woman voter who had come to vote was told that her vote had already been cast. At that moment, the voting was temporarily halted...”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing the incident, the Delhi Police said, “A PCR call was made by one 26-year-old Mohini, resident of Usmanpur, alleging that her vote had already been cast by someone else. The enquiry revealed that confusion arose due to a voter having a similar name, Munni Devi, aged 60 years having the same address. The 60-year-old woman was an earlier tenant at the same address. After verification, the Presiding Officer allowed both women to cast their vote.”<small class=\"brtag\"> </small></div>\n<div>\r\n\tAdditionally, police force has been deployed outside the polling booth in Seelampur.</div>\n<small class=\"brtag\"> </small>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\tVIDEO | Delhi Assembly Election 2025: Heavy police deployment outside a polling booth in Seelampur after BJP alleged fake votes being cast.<a href=\"https://twitter.com/hashtag/DelhiElectionsWithPTI?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#DelhiElectionsWithPTI</a><small class=\"brtag\"> </small> (Full video available on PTI Videos - <a href=\"https://t.co/n147TvrpG7\" rel=\"nofollow\" target=\"_blank\">https://t.co/n147TvrpG7</a>) <a href=\"https://t.co/AivjfUoPwb\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/AivjfUoPwb</a></p>\r\n\t— Press Trust of India (@PTI_News) <a href=\"https://twitter.com/PTI_News/status/1887045217616015496?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 5, 2025</a></blockquote></div>\n<!-- --> <!-- --> <!-- -->\n<h3>\r\n\tDelhi elections 2025</h3>\n<div>\r\n\tMeanwhile, voting across all 70 Assembly constituencies started at 7 am and will close at 6.30 pm. The national capital witnessed a voter turnout of 33.31 per cent by 1 pm, with the North-East district continuing to lead the polls.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGovernment offices and schools will remain closed on polling day, while some private offices may also shut or allow employees flexible working hours to facilitate voting.  <small class=\"brtag\"> </small></div>\n<div>\r\n\tDelhi has around 15.6 million registered voters, who will be able to vote at 13,766 polling stations. This includes 8.37 million male voters, 7.23 million female voters, and 1,267 third-gender voters.  </div>\n<div>\r\n\tTo ensure accessibility, 733 polling stations have been specifically set up for persons with disabilities. Security arrangements include 220 paramilitary companies, 19,000 home guards, and 35,626 Delhi Police personnel to maintain order during polling.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<em>[With agency inputs]</em></div></div>",
            "pub_date": "2025-02-05 17:35:23",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-elections-2025-seelampur-voting-row-125020500850_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500850"
        },
        {
            "title": "Singapore sees 21% rise in tourists; Indians, Chinese among top visitors",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tSingapore recorded a 21% increase in international visitor arrivals last year, reaching 16.5 million, the highest number since the Covid-19 pandemic, Singapore Tourism Board (STB) said in a statement on Tuesday. Indians were among the top travellers. The board expects the number to rise further in 2025.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tArrivals are forecast to be between 17 million and 18.5 million in 2025, bringing the country closer to its 2019 peak of 19.1 million visitors.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The consistent growth rates reflect an upward demand and the diversification of Singapore's appeal, attracting various types of travellers, from leisure to business and families to milestone travellers,\" said Markus Tan, regional director for India, Middle East, South Asia and Africa at the STB.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to STB data, the top three markets for visitor arrivals were:</div>\n<div>\n<strong>Mainland China:</strong> 3.08 million</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tIndonesia: 2.49 million</div>\n<div>\r\n\tIndia: 1.20 million</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOther markets, including Japan, Taiwan, the UK, and the US, also saw year-on-year growth.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Tourist spending set to reach record levels</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTourist spending in 2024 is expected to be at the higher end of the STB’s forecast of S$27.5 billion to S$29.0 billion ($20.3 billion to $21.4 billion). Visitors spent $22.4 billion over the first nine months of 2023. If the projection holds, it would surpass the pre-pandemic record of $27.7 billion in 2019.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMainland China, Indonesia, and India were the top sources of visitors last year, while travellers from mainland China, Indonesia, and Australia accounted for the highest spending, the STB said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChangi Airport’s international seat capacity exceeded 41 million, marking a 98% recovery compared to 2019 levels.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTan attributed the growth to Singapore’s 30-day mutual visa exemption with mainland China and improvements in air connectivity.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Why do Indian travellers eye Singapore?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn December 2024, Markus Tan and Renjie Wong, STB’s area director for India (Mumbai), South Asia, Middle East &amp; Africa, discussed the rising number of Indian visitors and upcoming tourism initiatives with Business Standard.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Singapore’s appeal to Indian travellers has been bolstered by strong connectivity and a wide range of experiences catering to different visitor preferences,\" said Tan.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Key factors include:</strong></div>\n<div>\n<strong>Air connectivity</strong>: Singapore has 17 direct air routes from major Indian cities such as Mumbai, Delhi, Chennai, and Bengaluru, as well as Tier 2 cities like Kolkata, Bhubaneswar, and Trivandrum. Around 280 weekly flights operate between the two countries.</div>\n<div>\n<strong>New attractions:</strong> Post-pandemic offerings such as the Museum of Ice Cream, with interactive exhibits like a banana split swing and a rainbow sprinkles pool, have drawn interest from various traveller demographics.</div>\n<div>\n<strong>Proximity:</strong> Flight times of 3.5 to 5 hours from most Indian cities make Singapore a convenient travel destination.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA packed calendar of events and concerts contributed to tourism growth, making Singapore an attractive destination year-round. Family-friendly attractions in various precincts helped drive visitor arrivals and spending across tourism and related industries.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe country also continued to host major MICE (Meetings, Incentives, Conferences, and Exhibitions) events, while the cruise sector saw highlights such as maiden calls and homeporting ships.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"We are optimistic about continuing this growth in 2025,\" said Tan.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhen asked about visa-free entry for Indian travellers, Tan said, \"Singapore already offers a streamlined visa process. Indian travellers can generally obtain visas within 3 to 5 business days through more than 100 authorised agents. Options include multi-entry visas valid for 30 days or up to a year.\"</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHe added that while global destinations are relaxing visa policies, Singapore continues to explore ways to improve accessibility, including e-visas and shorter processing times.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>India-Singapore relations in focus for 2025</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe year 2025 marks 60 years of diplomatic ties between India and Singapore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"To celebrate the deep cultural connections between the two countries, STB is launching a series of consumer and trade-facing initiatives, leveraging the increased visibility of Singapore in the Indian market to drive tourism marketing and business outcomes,\" Tan said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMelissa Ow, Chief Executive, Singapore Tourism Board (STB) said in a press release, \"As we look back at 2024, as well as our achievements over the last 60 years, tourism has contributed to the economy, reinforcing our international reputation and providing more lifestyle options for visitors and residents. Our Tourism 2040 roadmap will guide our efforts to drive the next phase of quality tourism growth for Singapore. This will ensure Singapore continues to thrive as a world-class destination that meets the needs of the evolving global traveller.”</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 17:30:34",
            "link": "https://www.business-standard.com/finance/personal-finance/singapore-sees-21-rise-in-tourists-indians-chinese-among-top-visitors-125020500895_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500895"
        },
        {
            "title": "Info Edge stock split news: naukri.com parent shares rise; key details",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<a href=\"https://www.business-standard.com/markets/info-edge-india-ltd-share-price-18844.html\" target=\"_blank\">Info Edge</a>, parent company of naukri.com, shares gained 2.4 per cent on Wednesday, logging an intraday high at Rs 7,889.55 per share on BSE. The stock gained after the company board approved stock split in 1:5 ratio.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAround 11:50 AM, Info Edge share price was up 2.05 per cent at Rs 7,861.85 per share on BSE. In comparison, the <a href=\"https://www.business-standard.com/markets/sp-bse-sensex-share-price-20558.html\" target=\"_blank\">BSE Sensex</a> was down 0.21 per cent at 78,417.49. The market capitalisation of the company stood at Rs 1,01,794.81 crore. The 52-week high of the stock was at Rs 9,194.95 per share and the 52-week low was at Rs 4,967.1 per share. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring a board meeting today, Info Edge's board approved <a href=\"https://www.business-standard.com/article/pf/what-is-a-stock-split-111042600064_1.html\" target=\"_blank\">stock split</a>. As per the filing, stock split will be of the existing 1 equity share having face value of Rs 10, into 5 equity shares having face value of Rs 2 each. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"We wish to inform you that the board of directors of the company at their meeting held today i.e., on Wednesday, February 5, 2025, considered and approved sub-division/split of the existing 1 (one) equity share of the Company having face value of Rs. 10/- (Rupees Ten only) each fully paid- up, into 5 (five) equity shares having face value of Rs. 2/- (Rupees Two only) each,\" the filing read. </div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe record date for share split will be decided after taking approval of the shareholders. The stock split will enhance the liquidity of company's equity shares and to encourage participation of retail investors by making equity shares of the company more affordable, as per the filing.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn January 30, 2025, the company had announced that its board will consider a stock split of the existing shares of the face value of Rs 10 each, fully paid-up. Other terms of the sub-division will be finalised in a board meeting on February 5.<small class=\"brtagPara\"> </small></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn its Q3 update, Info Edge said that its standalone billings during the quarter ended December 31, 2024, grew 15.8 per cent to Rs 668.3 crore year-on-year (Y-o-Y) as compared to Rs 576.9 crore in the corresponding quarter of the previous year.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the past one year, Info Edge shares have gained 43.8 per cent against Sensex's rise of 9.5 per cent. </div></div>",
            "pub_date": "2025-02-05 17:30:33",
            "link": "https://www.business-standard.com/markets/news/info-edge-stock-split-news-naukri-com-parent-shares-rise-key-details-125020500542_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500542"
        },
        {
            "title": "CM Mamata meets representatives of FICCI, CII, biz tycoons ahead of BGBS",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tWest Bengal Chief Minister Mamata Banerjee attended a meeting with representatives from FICCI, CII, and industry leaders on Wednesday, ahead of the 8th edition of the two-day Bengal Global Business Summit (BGBS), which begins this afternoon.</p>\n<p>\r\n\tThe two-day summit, set to take place from February 5 in Kolkata, is a key event for promoting investment in the state.</p>\n<p>\r\n\tBanerjee shared on Facebook, \"Our much-awaited Bengal Global Business Summit is having its preludes in the Special Meeting of the National Executive Committees of the Apex Chambers of Commerce and Industry, CII and FICCI. I joined them briefly to encourage investments in West Bengal from our national industry magnates. Bengal the destination!!.\"<small class=\"brtagPara\"> </small>\r\n\tThe chief minister on Tuesday night in a social media post had also mentioned that over 5,000 delegates, including representatives from 40 countries, have already started arriving in Kolkata.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAdditionally, 20 ambassadors and high commissioners are attending to represent their respective countries, while prominent Indian business leaders are coming together, often accompanied by their chambers, CII, FICCI, and ICC, she said.</p>\n<p>\r\n\tAccording to the Bengal Global Business Summit website, West Bengal has been among the fastest-growing states in terms of economic development, with the state's Gross State Domestic Product (GSDP) expected to reach Rs 18.79 lakh crore in 2024-25.</p><p></p></div>",
            "pub_date": "2025-02-05 17:25:27",
            "link": "https://www.business-standard.com/india-news/cm-mamata-meets-representatives-of-ficci-cii-biz-tycoons-ahead-of-bgbs-125020500776_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500776"
        },
        {
            "title": "Delhi polls: AAP-BJP clash outside Seelampur polling booth over fake voting",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tDelhi Assembly elections 2025: A clash broke out between the Aam Aadmi Party (AAP) and Bharatiya Janata Party (BJP) workers outside a polling booth in Seelampur during the Delhi Assembly polls on Wednesday. The BJP had alleged fake voting, and the police had to intervene to maintain peace.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe BJP accused the AAP of enabling fake voting, alleging that women wearing burqas were seen casting fraudulent votes at several polling stations. BJP leaders claimed that these women voted multiple times, suggesting a deliberate effort to sway the election outcome. Party workers raised alarms about the fairness of the voting process, calling on the Election Commission to look into these allegations and take appropriate action. They provided reports detailing several instances where such activities were reportedly observed.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\tVIDEO | Delhi Assembly Elections 2025: Uproar outside a polling booth in Seelampur as BJP alleges fake voting. Police jostle to maintain peace. <a href=\"https://twitter.com/hashtag/DelhiElections2025?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#DelhiElections2025</a> <a href=\"https://twitter.com/hashtag/DelhiElectionsWithPTI?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#DelhiElectionsWithPTI</a> <a href=\"https://t.co/ldxATD8N4k\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/ldxATD8N4k</a></p>\r\n\t— Press Trust of India (@PTI_News) <a href=\"https://twitter.com/PTI_News/status/1887054220047867913?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 5, 2025</a></blockquote></div>\n<!-- --> <!-- --> <!-- -->\n<div>\n<small class=\"brtag\"> </small> In response, the AAP dismissed the accusations, asserting that they were politically driven and intended to discredit the electoral process.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe situation unfolded after a voter reported that her vote had already been cast. Sabina Sadiq, Block Level Officer of Seelampur, said, “A woman voter who had come to vote was told that her vote had already been cast. At that moment, the voting was temporarily halted...”</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing the incident, the Delhi Police said, “A PCR call was made by one 26-year-old Mohini, resident of Usmanpur, alleging that her vote had already been cast by someone else. The enquiry revealed that confusion arose due to a voter having a similar name, Munni Devi, aged 60 years having the same address. The 60-year-old woman was an earlier tenant at the same address. After verification, the Presiding Officer allowed both women to cast their vote.”<small class=\"brtag\"> </small></div>\n<div>\r\n\tAdditionally, police force has been deployed outside the polling booth in Seelampur.</div>\n<small class=\"brtag\"> </small>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\tVIDEO | Delhi Assembly Election 2025: Heavy police deployment outside a polling booth in Seelampur after BJP alleged fake votes being cast.<a href=\"https://twitter.com/hashtag/DelhiElectionsWithPTI?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">#DelhiElectionsWithPTI</a><small class=\"brtag\"> </small> (Full video available on PTI Videos - <a href=\"https://t.co/n147TvrpG7\" rel=\"nofollow\" target=\"_blank\">https://t.co/n147TvrpG7</a>) <a href=\"https://t.co/AivjfUoPwb\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/AivjfUoPwb</a></p>\r\n\t— Press Trust of India (@PTI_News) <a href=\"https://twitter.com/PTI_News/status/1887045217616015496?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 5, 2025</a></blockquote></div>\n<!-- --> <!-- --> <!-- -->\n<h3>\r\n\tDelhi elections 2025</h3>\n<div>\r\n\tMeanwhile, voting across all 70 Assembly constituencies started at 7 am and will close at 6.30 pm. The national capital witnessed a voter turnout of 33.31 per cent by 1 pm, with the North-East district continuing to lead the polls.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGovernment offices and schools will remain closed on polling day, while some private offices may also shut or allow employees flexible working hours to facilitate voting.  <small class=\"brtag\"> </small></div>\n<div>\r\n\tDelhi has around 15.6 million registered voters, who will be able to vote at 13,766 polling stations. This includes 8.37 million male voters, 7.23 million female voters, and 1,267 third-gender voters.  </div>\n<div>\r\n\tTo ensure accessibility, 733 polling stations have been specifically set up for persons with disabilities. Security arrangements include 220 paramilitary companies, 19,000 home guards, and 35,626 Delhi Police personnel to maintain order during polling.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<em>[With agency inputs]</em></div></div>",
            "pub_date": "2025-02-05 17:25:27",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-elections-2025-seelampur-voting-row-125020500850_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500850"
        },
        {
            "title": "'Indians justifiably outraged': Bryan Johnson shares study on air quality",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tUS-based entrepreneur, Bryan Johnson, known for his work in anti-aging research, has once again drawn attention to India’s poor air quality. In a detailed post on X, Johnson referred to a study outlining the severe health risks associated with air pollution, including liver inflammation, fibrosis, blood fat imbalance, and gene dysregulation linked to cancer.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Indians are justifiably outraged by the poor air quality they are exposed to daily. It creates serious negative health effects. There’s no such thing as a safe level of PM2.5,” said Johnson.  </div>\n<small class=\"brtag\"> </small>\n<div>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\t\tIndians are justifiably outraged by the poor air quality they are exposed to daily. It creates serious negative health effects.<small class=\"brtagPara\"> </small> Below is a study showing how air pollution causes liver inflammation, fibrosis, blood fat imbalance, and liver protein markers associated with… <a href=\"https://t.co/SODON2KOh8\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/SODON2KOh8</a></p>\r\n\t\t— Bryan Johnson /dd (@bryan_johnson) <a href=\"https://twitter.com/bryan_johnson/status/1886866090967621844?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 4, 2025</a></blockquote></div>\n<!-- --> <!-- --> </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn another post on X, he said, “Improve the air quality in your home, apartment, office and gym by upgrading the air filter in the HVAC system.”</div>\n<small class=\"brtag\"> </small>\n<div>\n<div></div><div><blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\r\n\t\t\tImprove the air quality in your home, apartment, office and gym by upgrading the air filter in the HVAC system.<small class=\"brtagPara\"> </small> The higher the MERV filter, the better. Not all HVAC systems can handle the higher MERV filter so get the best one you can.<small class=\"brtagPara\"> </small> Try to have MERV 13 at a minimum. <a href=\"https://t.co/vruOv8NlKO\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/vruOv8NlKO</a></p>\r\n\t\t— Bryan Johnson /dd (@bryan_johnson) <a href=\"https://twitter.com/bryan_johnson/status/1886879502007173387?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">February 4, 2025</a></blockquote></div>\n<!-- --> <!-- --> </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis comes days after he made headlines for walking out of a podcast with Zerodha CEO Nikhil Kamath, citing pollution as the reason.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>‘No safe level of exposure'</strong></div>\n<div>\r\n\tThe study shared by Johnson involved exposing mice to low levels of PM2.5 pollutants from traffic emissions over 12 weeks. The particulate matter was collected from the sides of busy roads and introduced into the mice’s noses via a saline solution. The results showed that prolonged exposure led to liver inflammation, fibrosis, blood fat imbalance, and the presence of liver protein markers typically associated with alcoholism. It also indicated gene dysregulation linked to cancer.  <small class=\"brtagPara\"> </small>\n<strong>ALSO READ: </strong><a href=\"https://www.business-standard.com/social-viral/bryan-johnson-nikhil-kamath-podcast-air-pollution-mumbai-anti-ageing-125020400730_1.html\" target=\"_blank\"><strong>Why anti-ageing millionaire Bryan Johnson left Nikhil Kamath's podcast midway</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJohnson said that PM2.5 is particularly harmful as it penetrates deep into the lungs and enters circulation. He reiterated that there is no safe level of exposure and urged authorities to prioritise tackling air pollution, especially in heavily-polluted cities.  </div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe tech entrepreneur also shared practical ways to reduce exposure to poor air quality. His suggestions included monitoring PM2.5 levels, wearing an N95 mask, and using air recirculation mode in vehicles while travelling through polluted areas.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJohnson’s concerns about India’s air quality were previously highlighted during his visit in December last year when he abruptly left Nikhil Kamath’s ‘WTF’ podcast, despite the presence of air purifiers in the room and his use of an N95 mask. The interview was recorded in a luxury hotel in Mumbai’s Bandra area, where the AQI at the time was around 120.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile praising Kamath as a “gracious host”, Johnson said that the room was circulating outdoor air, rendering the purifier ineffective. He also criticised the extent to which air pollution has become normalised in India.  </div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>‘Pollution is deeply normalised in India’</strong></div>\n<div>\r\n\t“This was my third day in India, and the air pollution had caused my skin to break out in a rash, with my eyes and throat burning. Pollution is so deeply normalised that no one even notices it anymore, despite the well-documented health risks. People were outside running, and babies and small children were exposed from birth. No one wore a mask, which could significantly reduce exposure. It was baffling,” he wrote on X.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, Nikhil’s brother and Zerodha co-founder Nithin Kamath, who was also on the podcast with Johnson, has ignited a debate by suggesting that real estate prices should be tied to air quality. “So, shouldn’t property prices be linked to AQI? The higher the AQI, the lower the real estate prices should be. That means if an area has poor air quality, property prices and rents should be lower, and vice versa. After all, by living in such areas, you are accepting higher odds of respiratory ailments, cancer, etc,” Kamath wrote on LinkedIn.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 17:20:31",
            "link": "https://www.business-standard.com/india-news/bryan-johnson-india-air-pollution-wtf-podcast-nikhil-kamath-nithin-kamath-125020500815_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500815"
        },
        {
            "title": "BlackRock to hire 1,200 employees in India to expand AI and support hubs",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe world’s largest asset manager <a href=\"https://www.business-standard.com/topic/blackrock\" target=\"_blank\">BlackRock Inc</a> is set to expand its presence in India by hiring nearly 1,200 people across its support hubs in Mumbai and Gurugram, <em>Moneycontrol </em>reported on Wednesday. The new hires will increase BlackRock’s headcount in these cities by about a third, adding to the existing 3,500 employees.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tExpanding AI and data capabilities</h2>\n<div>\r\n\tBlackRock’s hiring drive is aimed at strengthening its <a href=\"https://www.business-standard.com/about/what-is-artificial-intelligence\" target=\"_blank\">artificial intelligence (AI)</a> capabilities and expanding its iHubs - its innovation and support centres that handle investment research, risk management, financial engineering, business operations, and data analytics. The company is particularly looking for engineers and data experts to support these functions.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe firm is also acquiring a global capabilities centre (GCC) in Bengaluru, which has around 1,500 employees, through its proposed purchase of data firm Preqin. This acquisition is expected to further bolster its technology and data-driven operations.</div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tBlackRock’s office expansion in Mumbai</h2>\n<div>\r\n\tTo accommodate its expanding workforce, BlackRock has leased additional office space in Mumbai’s Goregaon from Oberoi Realty Ltd. The deal, valued at nearly Rs 4 billion ($45.9 million), was first reported by <em>The Economic Times.</em></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tIndia’s growing role in global financial services</h2>\n<div>\r\n\tIndia has become a key hub for global financial firms, with multinational corporations expanding their operations beyond traditional back-office work to high-value services. The country's GCC market is projected to reach $110 billion by 2030, employing over 4.5 million people, according to Ernst &amp; Young. India already houses over 1,700 GCCs, accounting for 17 per cent of such centres globally, as highlighted in India's <a href=\"https://www.business-standard.com/budget\">Union Budget 2025</a>.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSeveral global banks and asset managers, including JPMorgan Chase, HSBC, Apollo Global Management, and Goldman Sachs, have significant GCC operations in India. Goldman Sachs, for instance, employs around 9,000 people across its Bengaluru and Hyderabad centres.</div></div>",
            "pub_date": "2025-02-05 17:20:30",
            "link": "https://www.business-standard.com/companies/news/blackrock-to-hire-1-200-employees-in-india-to-expand-ai-and-support-hubs-125020500836_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500836"
        },
        {
            "title": "More than 250 fall ill in Kolhapur village due to suspected food poisoning",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tMore than 250 persons fell ill due to suspected food poisoning after attending a village fair in western Maharashtra's Kolhapur district, police said on Wednesday.</p>\n<p>\r\n\tAbout 50 persons were undergoing treatment at hospital at Shirol at present and the condition of all of them was said to be stable, said an official of Kurundwad police station.</p>\n<p>\r\n\tA fair had been organised at Shivnakwadi village on Tuesday where 'kheer', a sweet preparation made from milk, was served as 'prasad', he said.</p>\n<p>\r\n\t\"People started complaining of diarrhoea, nausea and fever since today morning. So far, 255 people have fallen sick due to suspected food poisoning. Most of them are claiming that they had 'kheer' at the fair. But there were food stalls too,\" the police official said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tMore than 50 persons were undergoing treatment at the hospital and the rest were discharged, he said, adding that all the admitted patients were stable. \"Food samples from the fair have been sent to the forensic laboratory to ascertain if it was food poisoning,\" said the official.</p><p></p></div>",
            "pub_date": "2025-02-05 17:15:30",
            "link": "https://www.business-standard.com/india-news/more-than-250-fall-ill-in-kolhapur-village-due-to-suspected-food-poisoning-125020500762_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500762"
        },
        {
            "title": "NSE Clearing fails to meet liquidity norms; reports Rs 176.65 cr shortfall",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tNSE Clearing Ltd, the clearing house of the National Stock Exchange (NSE), has failed to meet the capital markets regulator Sebi's mandated liquidity requirements, citing the non-payment of dues by rival BSE as the primary reason for the shortfall.</p>\n<p>\r\n\tIn its December 2024 quarterly results, NSE Clearing, the exchange's unit responsible for clearing and settling its trades, reported a shortfall of Rs 176.65 crore in its minimum liquid assets.</p>\n<p>\r\n\tThe company informed Sebi in a letter dated January 9 that this deficit was primarily due to the non-receipt of Rs 312.37 crore in dues from BSE.</p>\n<p>\r\n\tAn NSE Clearing spokesperson said its auditors flagged the outstanding payment issue in their third-quarter financial review.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe outstanding amount pertains to \"interoperability arrangements\", the official said.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\t\"The company is yet to receive outstanding dues of over Rs 300 crore from BSE Ltd. NSE Clearing is communicating with BSE on this matter,\" the spokesperson added.</p>\n<p>\r\n\tThe Securities and Exchange Board of India (Sebi) has prescribed risk-based capital and net worth requirements for clearing corporations, which must maintain adequate liquid assets to ensure financial stability.</p>\n<p>\r\n\tThe regulator introduced a framework for interoperability among clearing corporations on June 1, 2019, to reduce trading costs.</p>\n<p>\r\n\tThis allows trading members to clear trades through a clearing firm of their choice rather than being restricted to the clearing corporation affiliated with the exchange where the trade was executed.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 17:15:29",
            "link": "https://www.business-standard.com/markets/news/nse-clearing-fails-to-meet-liquidity-norms-reports-rs-176-65-cr-shortfall-125020500754_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500754"
        }
    ]
}