{
    "data": [
        {
            "title": "Flipkart's chief product and technology officer Venugopal steps down",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tFlipkart’s chief product and technology officer Jeyandran Venugopal is stepping down after an eight-year stint, according to an internal note from CEO Kalyan Krishnamurthy.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHe has attributed the decision to “personal reasons”.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tVenugopal’s exit follows a series of senior-level departures from the Walmart-owned company last year, which has been attributed to a larger organisational restructuring.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHe was instrumental in revamping fashion retailer Myntra’s platform and improving customer experience and innovation during his initial years with the Flipkart Group</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Jey has built a strong technology leadership team and hired, mentored and groomed several senior technology leaders in the company,” Kalyan Krishnamurthy, chief executive officer at Flipkart Group, said in the note.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Jey and I will partner to ensure a smooth transition over the next three months. During that time, we will provide more details regarding the people and organisation restructuring and the backfill plans,” he said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tVenugopal has overseen several domains, including product management, engineering, design and user research and data science. He also managed IT, security, infrastructure, product operations as well as critical P&amp;L functions (ads, loyalty), platform growth, performance marketing and other strategic functions in the company.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHis position is expected to be taken over by current leaders within the organisation in the coming weeks, according to the sources.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-06 00:35:29",
            "link": "https://www.business-standard.com/companies/start-ups/flipkart-s-chief-product-and-technology-officer-venugopal-steps-down-125020501733_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501733"
        },
        {
            "title": "Sula Vineyards Q3 results: Net profit falls 35% to Rs 28.06 crore",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tIndia's biggest winemaker Sula Vineyards reported a 35 per cent fall in third-quarter profit on Wednesday, as demand took a hit from a slowdown in urban consumption.</p>\n<p>\r\n\tSula's consolidated net profit fell to Rs 28.06 crore ($3.2 million) in the quarter ending Dec. 31, from Rs 42.98 crore a year ago.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/markets/news/sula-vineyards-rises-4-after-posting-highest-revenue-in-q3fy25-details-125011500309_1.html\" target=\"_blank\">Sula Vineyards rises 4 per cent after posting highest revenue in Q3FY25; details</a></strong></div>\n<p>\r\n\tUrban consumption fell to a two-year low in November, as persistently high food inflation, subdued wage growth and erratic weather patterns led consumers to pull back discretionary spending. Sula gets about 90 per cent of its revenue from urban markets.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tSales were also impacted due to elections in the western state of Maharashtra, which is among Sula's key markets, during the quarter, the company said.</p>\n<p>\r\n\tThe winemaker's own brands segment, which contributes about 90 per cent of the total revenue, saw a marginal 1 per cent rise in revenue during the quarter.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tIts smaller wine tourism segment saw a 12 per cent increase in revenue.</p>\n<p>\r\n\tTotal revenue fell 0.4 per cent, while total expenses rose about 11.4 per cent from a year earlier.</p>\n<p>\r\n\tSula's core profit margin contracted to 24.8 per cent from 33.5 per cent a year ago.</p>\n<p>\r\n\t </p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-06 00:35:27",
            "link": "https://www.business-standard.com/companies/results/sula-vineyards-q3-results-net-profit-falls-35-to-rs-28-06-crore-125020501494_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501494"
        },
        {
            "title": "Driven by US stockpiling, Canada posts first trade surplus in 10 months",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tCanada in December posted its first trade surplus in 10 months as exports expanded faster than imports, led by a push by US businesses to build up inventory ahead of potential tariffs on Canada and generally strong US demand, data showed.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe December trade surplus was at C$708 million ($496 million), compared with a revised deficit of C$986 million the prior month, helped by an 4.9 per cent growth in exports, Statistics Canada reported on Wednesday.<small class=\"brtag\"> </small></div>\n<div>\r\n\tIncreased shipments of energy products, especially to the US, as well as higher crude oil prices and a partly weaker local currency spurred the surplus, Statscan said.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tImports grew by 2.3 per cent in December, a bit slower than the 2.8 per cent gain seen in November, it said.<small class=\"brtag\"> </small></div>\n<div>\r\n\tAnalysts polled by Reuters had forecast a surplus of C$750 million.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCanada's trade surplus with the US widened for the second month in a row, growing 5 per cent in December to C$11.3 billion, led primarily by greater exports of energy products and a higher price of crude oil.<small class=\"brtag\"> </small></div>\n<div>\r\n\tIts imports from the US fell 1.5 per cent in December.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"It's not a coincidence that we're seeing a solid uptrend since October,\" said Stuart Bergman, chief economist with Export Development Canada.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tStockpiling by US companies ahead of potential tariffs under President Donald Trump's administration and strong US consumer demand led to the rise in exports from Canada, he said.<small class=\"brtag\"> </small></div>\n<div>\r\n\tTrump, who earlier this week paused a plan to impose 25 per cent tariffs on almost all Canadian imports, has often expressed frustration about the US trade deficit with its neighbor north of the border.<small class=\"brtag\"> </small></div>\n<div>\r\n\tCanada followed suit by rolling back sweeping retaliatory tariffs against the US, its biggest trading partner.<small class=\"brtag\"> </small></div>\n<div>\r\n\tCanada's merchandise trade surplus with the US amounted to $102.3 billion for the year 2024, down from a surplus of $108.3 billion in 2023, the statistics agency said.<small class=\"brtag\"> </small></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tIf energy products are excluded, the 2024 deficit the US had with Canada swings to a surplus of roughly C$43 billion, Bergman said, citing data from the US Census Bureau.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe combined value of Canadian imports and exports of goods traded with the US surpassed the C$1 trillion mark for a third consecutive year, Statistics Canada said.<small class=\"brtag\"> </small></div>\n<div>\r\n\tLast year Canada sent 75.9 per cent of its total exports to the US and bought 62.2 per cent of its total imports from south of the border.<small class=\"brtag\"> </small></div>\n<div>\r\n\tExports to the US account for roughly 17.8 per cent of Canadian GDP and more than 2.4 million jobs in Canada.<small class=\"brtag\"> </small></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tThe Canadian dollar climbed 0.27 per cent to 1.4282 to the US dollar, or 70.02 US cents, on Wednesday. Yields on two-year government bonds were down 1.2 basis points to 2.613 per cent.<small class=\"brtag\"> </small></div>\n<div>\r\n\tTotal exports in December - rising for the third consecutive month - were driven by energy products which increased by 9.5 per cent, followed by metal and non-metallic mineral products which widened by 9.2 per cent.<small class=\"brtag\"> </small></div>\n<div>\r\n\tExcluding the US, Canada's trade deficit with the rest of the world expanded in December to C$10.6 billion from $9.2 billion in November.<small class=\"brtagPara\"> </small> <small class=\"brtagPara\"> </small>\n<div>\n<i>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</i></div></div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-06 00:30:35",
            "link": "https://www.business-standard.com/world-news/driven-by-us-stockpiling-canada-posts-first-trade-surplus-in-10-months-125020501725_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501725"
        },
        {
            "title": "Secy group on asset monetisation to meet on Thursday; to discuss NMP 2.0",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAhead of a formal rollout of the second edition of the National Monetisation Pipeline (NMP 2.0), valued at Rs 10 trillion, the Core Group of Secretaries on Asset Monetisation (CGAM), chaired by Cabinet secretary TV Somanathan, will meet on Thursday to discuss the final progress of the first phase of the NMP.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis comes as the Centre fine-tunes plans for the second one.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe CGAM, comprising relevant infra secretaries, undertakes periodic review to monitor the progress of transactions. It resolves structural issues, if any, for undertaking the projects in all the sectors covered under the NMP.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Building on the success of the first Asset Monetisation Plan announced in 2021, the second plan for 2025-30 will be launched to plough back capital of Rs 10 trillion in new projects. Regulatory and fiscal measures will be fine tuned to support the plan,” finance minister Nirmala Sitharaman said in her Budget speech on February 1.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBusiness Standard had reported in October that the government had to tweak its monetisation targets in the final year of the first pipeline – FY25 – to Rs 1.9 trillion to get close to its original four-year target of Rs 6 trillion.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSo far, highways, coal, and mines have been the brightest performers for the government in monetisation, achieving nearly Rs 2.7 trillion by the end of FY24.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRailways has been among the worst performers in terms of achieving the target.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring its inception, the national transporter was supposed to contribute a fourth of the total monetisation proceeds with Rs 1.52 trillion in monetisation from trains, stations, and terminals.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt the end of FY24, the Ministry of Railways had monetised assets worth Rs 20,417 crore over the past three financial years.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt achieved 30 per cent of its revised target – much lower than its initial target.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe railways was given a target of Rs 17,000 crore during the current financial year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tQueries sent to NITI Aayog remained unanswered till the time of going to press.</div></div>",
            "pub_date": "2025-02-06 00:30:35",
            "link": "https://www.business-standard.com/economy/news/secy-group-on-asset-monetisation-to-meet-on-thursday-to-discuss-nmp-2-0-125020501677_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501677"
        },
        {
            "title": "Delhi Assembly elections: Most exit polls give BJP clear edge over AAP",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tMost exit polls, barring two, on Wednesday predicted a victory for the Bharatiya Janata Party (BJP) and its allies over the ruling Aam Admi Party (AAP) in the Delhi Assembly polls, while the Congress was projected to make no significant gains from the last elections.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe remaining two exit polls, however, predicted a victory for AAP in the 70-member House.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe BJP last secured a majority in the Delhi Assembly in 1993. Delhi did not have an Assembly between 1956 to 1993.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe polling for the Delhi Assembly concluded on Wednesday evening, with a 58 per cent voter turnout, subject to revision, till the reports trickled in. The voter turnout in the 2020 Assembly polls stood at 62.55 per cent and 67.12 per cent, both of which were marked by a clean sweep by AAP.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOnly two exit polls, Mind Brink and Wee Preside, predicted a victory for the AAP. The rest, including People’s Insight, Matrize, PMarq, and Chanakya Strategies, said the BJP-led NDA was on course not just to better its 2013 performance, which was its best since 1993, but secure a majority.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe BJP contested 68 of the 70 seats, while one each was contested by its allies, the Janata Dal (United) and Lok Janshakti Party (Ram Vilas).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmong the exit polls that predicted a BJP victory, the People's Pulse showed the saffron party was likely to get 51 to 60 seats, while the AAP may get 10-19 seats. According to People's Insight exit poll, the NDA is likely to get 40 to 44 seats, AAP 25 to 29 seats, and the Congress barely opening its account.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe P-Marq exit poll predicted 39-49 seats for the BJP and its allies, 21-31 seats for AAP, and 0-1 for the Congress.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe JVC exit poll predicted that the BJP and its allies would get 39-45, the AAP 22-31 seats, and the Congress 0-2.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSimilarly, the Poll Diary predicted 42-50 seats for the BJP and allies, while giving the AAP 18-25 seats, 0-2 for the Congress and 0-1 for others.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChanakya Strategies exit poll said the BJP and allies are likely to get 39-44 seats, the AAP is likely to get 25-28, while Congress may get 2-3.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTwo surveys predicted AAP's victory - Wee Preside, which gave 46-52 seats for AAP, 18-23 for BJP, and 0-1 for Congress, and Mind Brink Media predicted 44-49 seats for AAP, 21-25 for BJP and 0-1 for the Congress.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMatrize exit poll predicted a close contest, giving the BJP-led NDA 35-40 seats, while the AAP was said to get 32 to 37 seats. The survey gave Congress 0-1 seats.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe DV Research exit polls predicted 26-34 seats for the AAP, and 36-44 for the BJP and allies, giving zero seats to the Congress.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the 70-member Delhi Assembly, 36 is the majority mark. The AAP currently has 62 MLAs, the BJP has eight, and the Congress none.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn 1993, the BJP won 49 of the 70 seats. It failed to cross the 25-seat mark in all subsequent elections barring 2013. In 2013, which resulted in a hung assembly, the BJP fell short of the majority mark but it emerged as the single-largest party with 31 seats. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe BJP’s vote share over the last decade in the Delhi Assembly polls has increased from 33.07 per cent in 2013 to 38.51 per cent in 2020. However, AAP secured a vote share of 54.34 per cent and 53.57 per cent in 2015 and 2020, respectively. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tExit polls predicted a couple of seats for the Congress, suggesting that its vote share could increase in this round of the Assembly polls. The Congress secured a poor vote share of 4.26 per cent in the 2020 Assembly polls, failing to win any seats.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-06 00:25:27",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-assembly-elections-most-exit-polls-give-bjp-clear-edge-over-aap-125020501683_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501683"
        },
        {
            "title": "Driven by US stockpiling, Canada posts first trade surplus in 10 months",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tCanada in December posted its first trade surplus in 10 months as exports expanded faster than imports, led by a push by US businesses to build up inventory ahead of potential tariffs on Canada and generally strong US demand, data showed.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe December trade surplus was at C$708 million ($496 million), compared with a revised deficit of C$986 million the prior month, helped by an 4.9 per cent growth in exports, Statistics Canada reported on Wednesday.<small class=\"brtag\"> </small></div>\n<div>\r\n\tIncreased shipments of energy products, especially to the US, as well as higher crude oil prices and a partly weaker local currency spurred the surplus, Statscan said.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tImports grew by 2.3 per cent in December, a bit slower than the 2.8 per cent gain seen in November, it said.<small class=\"brtag\"> </small></div>\n<div>\r\n\tAnalysts polled by Reuters had forecast a surplus of C$750 million.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCanada's trade surplus with the US widened for the second month in a row, growing 5 per cent in December to C$11.3 billion, led primarily by greater exports of energy products and a higher price of crude oil.<small class=\"brtag\"> </small></div>\n<div>\r\n\tIts imports from the US fell 1.5 per cent in December.<small class=\"brtag\"> </small></div>\n<div>\r\n\t\"It's not a coincidence that we're seeing a solid uptrend since October,\" said Stuart Bergman, chief economist with Export Development Canada.<small class=\"brtag\"> </small></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tStockpiling by US companies ahead of potential tariffs under President Donald Trump's administration and strong US consumer demand led to the rise in exports from Canada, he said.<small class=\"brtag\"> </small></div>\n<div>\r\n\tTrump, who earlier this week paused a plan to impose 25 per cent tariffs on almost all Canadian imports, has often expressed frustration about the US trade deficit with its neighbor north of the border.<small class=\"brtag\"> </small></div>\n<div>\r\n\tCanada followed suit by rolling back sweeping retaliatory tariffs against the US, its biggest trading partner.<small class=\"brtag\"> </small></div>\n<div>\r\n\tCanada's merchandise trade surplus with the US amounted to $102.3 billion for the year 2024, down from a surplus of $108.3 billion in 2023, the statistics agency said.<small class=\"brtag\"> </small></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tIf energy products are excluded, the 2024 deficit the US had with Canada swings to a surplus of roughly C$43 billion, Bergman said, citing data from the US Census Bureau.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe combined value of Canadian imports and exports of goods traded with the US surpassed the C$1 trillion mark for a third consecutive year, Statistics Canada said.<small class=\"brtag\"> </small></div>\n<div>\r\n\tLast year Canada sent 75.9 per cent of its total exports to the US and bought 62.2 per cent of its total imports from south of the border.<small class=\"brtag\"> </small></div>\n<div>\r\n\tExports to the US account for roughly 17.8 per cent of Canadian GDP and more than 2.4 million jobs in Canada.<small class=\"brtag\"> </small></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tThe Canadian dollar climbed 0.27 per cent to 1.4282 to the US dollar, or 70.02 US cents, on Wednesday. Yields on two-year government bonds were down 1.2 basis points to 2.613 per cent.<small class=\"brtag\"> </small></div>\n<div>\r\n\tTotal exports in December - rising for the third consecutive month - were driven by energy products which increased by 9.5 per cent, followed by metal and non-metallic mineral products which widened by 9.2 per cent.<small class=\"brtag\"> </small></div>\n<div>\r\n\tExcluding the US, Canada's trade deficit with the rest of the world expanded in December to C$10.6 billion from $9.2 billion in November.<small class=\"brtagPara\"> </small> <small class=\"brtagPara\"> </small>\n<div>\n<i>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</i></div></div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-06 00:25:27",
            "link": "https://www.business-standard.com/world-news/driven-by-us-stockpiling-canada-posts-first-trade-surplus-in-10-months-125020501725_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501725"
        },
        {
            "title": "Sajjan Jindal-led JSW plans airport foray with Andal airport in West Bengal",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tSajjan Jindal-led JSW group is looking to invest in West Bengal’s only greenfield airport project at Andal, in Paschim Bardhaman district.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This would be our first entry into the airport business,” JSW chairman Sajjan Jindal said on the sidelines of the 8th edition of Bengal Global Business Summit in Kolkata.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe foray would be through JSW Infrastructure, which would be buying a stake from private investors in Bengal Aerotropolis Projects Ltd (BAPL). The West Bengal government owns a 26 per cent stake in BAPL while Singapore’s Changi Airports has 33 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We want the government of West Bengal to remain and Changi to remain. The other partners will probably sell out,” Jindal said.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt’s not just the airport, Jindal is also interested in the Aerotropolis project.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We want to develop the whole Aerotropolis township and industrial park there. It’s a very exciting project. The catchment area is very big -- Durgapur, Asansol, Kharagpur, right up to Jharkhand,” he said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, there were certain issues with the land, which need to be resolved, he said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We want a clean slate,” Jindal said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDiscussions with Changi have already been held.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“They are very happy about it because they also want to move forward,” he said, adding that the group could then participate in projects across India.</div></div>",
            "pub_date": "2025-02-06 00:20:29",
            "link": "https://www.business-standard.com/industry/news/sajjan-jindal-led-jsw-plans-airport-foray-with-andal-airport-in-west-bengal-125020501705_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501705"
        },
        {
            "title": "Delhi Assembly elections: Most exit polls give BJP clear edge over AAP",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tMost exit polls, barring two, on Wednesday predicted a victory for the Bharatiya Janata Party (BJP) and its allies over the ruling Aam Admi Party (AAP) in the Delhi Assembly polls, while the Congress was projected to make no significant gains from the last elections.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe remaining two exit polls, however, predicted a victory for AAP in the 70-member House.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe BJP last secured a majority in the Delhi Assembly in 1993. Delhi did not have an Assembly between 1956 to 1993.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe polling for the Delhi Assembly concluded on Wednesday evening, with a 58 per cent voter turnout, subject to revision, till the reports trickled in. The voter turnout in the 2020 Assembly polls stood at 62.55 per cent and 67.12 per cent, both of which were marked by a clean sweep by AAP.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOnly two exit polls, Mind Brink and Wee Preside, predicted a victory for the AAP. The rest, including People’s Insight, Matrize, PMarq, and Chanakya Strategies, said the BJP-led NDA was on course not just to better its 2013 performance, which was its best since 1993, but secure a majority.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe BJP contested 68 of the 70 seats, while one each was contested by its allies, the Janata Dal (United) and Lok Janshakti Party (Ram Vilas).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAmong the exit polls that predicted a BJP victory, the People's Pulse showed the saffron party was likely to get 51 to 60 seats, while the AAP may get 10-19 seats. According to People's Insight exit poll, the NDA is likely to get 40 to 44 seats, AAP 25 to 29 seats, and the Congress barely opening its account.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe P-Marq exit poll predicted 39-49 seats for the BJP and its allies, 21-31 seats for AAP, and 0-1 for the Congress.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe JVC exit poll predicted that the BJP and its allies would get 39-45, the AAP 22-31 seats, and the Congress 0-2.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSimilarly, the Poll Diary predicted 42-50 seats for the BJP and allies, while giving the AAP 18-25 seats, 0-2 for the Congress and 0-1 for others.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChanakya Strategies exit poll said the BJP and allies are likely to get 39-44 seats, the AAP is likely to get 25-28, while Congress may get 2-3.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTwo surveys predicted AAP's victory - Wee Preside, which gave 46-52 seats for AAP, 18-23 for BJP, and 0-1 for Congress, and Mind Brink Media predicted 44-49 seats for AAP, 21-25 for BJP and 0-1 for the Congress.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMatrize exit poll predicted a close contest, giving the BJP-led NDA 35-40 seats, while the AAP was said to get 32 to 37 seats. The survey gave Congress 0-1 seats.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe DV Research exit polls predicted 26-34 seats for the AAP, and 36-44 for the BJP and allies, giving zero seats to the Congress.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the 70-member Delhi Assembly, 36 is the majority mark. The AAP currently has 62 MLAs, the BJP has eight, and the Congress none.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn 1993, the BJP won 49 of the 70 seats. It failed to cross the 25-seat mark in all subsequent elections barring 2013. In 2013, which resulted in a hung assembly, the BJP fell short of the majority mark but it emerged as the single-largest party with 31 seats. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe BJP’s vote share over the last decade in the Delhi Assembly polls has increased from 33.07 per cent in 2013 to 38.51 per cent in 2020. However, AAP secured a vote share of 54.34 per cent and 53.57 per cent in 2015 and 2020, respectively. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tExit polls predicted a couple of seats for the Congress, suggesting that its vote share could increase in this round of the Assembly polls. The Congress secured a poor vote share of 4.26 per cent in the 2020 Assembly polls, failing to win any seats.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-06 00:20:28",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-assembly-elections-most-exit-polls-give-bjp-clear-edge-over-aap-125020501683_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501683"
        },
        {
            "title": "Preview: Will SBI Q3 profit rise or fall? Provisions hold key, say analysts",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>SBI Q3 preview:</strong> The largest government-owned bank, State Bank of India (SBI), is expected to report a strong set of <a href=\"https://www.business-standard.com/topic/q3-results\" target=\"_blank\">results for the October-December quarter (Q3)</a> of the current financial year 2024-25 (FY25).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to analysts, the public sector bank (PSB) is estimated to report a double digit net profit growth on the back of healthy loan book expansion and stable asset quality.</div>\n<h2>\r\n\tSBI Q3 results date and time</h2>\n<div>\r\n\tState Bank of India (SBI) is scheduled to report its Q3 results on Thursday, February 6.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"This is to inform you that a meeting of the Central Board of the Bank will be held on Thursday, February 6, 2025, at Mumbai, inter-alia, to consider the financial results of the Bank for the quarter ended 31.12.2024,\" SBI said in a stock exchange filing on January 16, 2025.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFurther, SBI's Q3 Analyst Meet will be conducted on February 6, 2025, at 5.00 PM post Q3FY25 results at State Bank Bhavan Auditorium, it added.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/itc-q3-preview-cigarette-volume-may-remain-resilient-fmcg-biz-to-grow-6-125020400495_1.html\" target=\"_blank\">ITC Q3 preview: Cigarette volume may remain resilient; FMCG biz to grow 6%</a></strong><small class=\"brtagPara\"> </small> Ahead of SBI Q3 results, <a href=\"https://www.business-standard.com/markets/state-bank-of-india-share-price-1375.html\" target=\"_blank\"><strong>SBI share price</strong></a> was trading 1.9 per cent higher on Tuesday, February 4, 2025. Thus far in 2025, SBI share price has slipped 4.2 per cent on the BSE as against 1.2 per cent decline in the benchmark Sensex index. </div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tSBI Q3 results expectations:</h2>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tNomura</h3>\n<div>\r\n\tGlobal brokerage Nomura expects SBI to report a solid growth of 86 per cent year-on-year (Y-o-Y) in net profit. It pegs SBI Q3 net profit at Rs 17,010 crore as against Q3FY24 net profit of Rs 9,160 crore. On a sequential basis, Nomura expects Q3 net profit to decline 7 per cent from Rs 18,330 crore.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOperationally, the brokerage expects SBI's net interest income (NII) to grow 7 per cent Y-o-Y to Rs 42,560 crore from Rs 39,820 crore and 2 per cent Q-o-Q from Rs 41,620 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPre-provision operating profit (PPOP), too, is expected to surge 30 per cent Y-o-Y to Rs 26,450 crore as against Rs 20,340-crore PPOP in Q3FY24. In Q2FY25, PPOP was Rs 29,290 crore.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/britannia-s-q3-pat-likely-to-slip-5-yoy-margins-may-contract-analysts-125020400527_1.html\" target=\"_blank\">Britannia's Q3 PAT likely to slip 5% YoY; margins may contract: Analysts</a> </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"We expect SBI's Q3 deposit growth to be soft, rising 9 per cent Y-o-Y/1 per cent Q-o-Q to Rs 51.94 trillion. Loan growth, however, is projected to be healthy at 14 per cent Y-o-Y/4 per cent Q-o-Q to Rs 40.11 trillion. We expect net interest margin (NIM) to decline 10bps Y-o-Y/2bps Q-o-Q to 3.1 per cent, aided by re-pricing of MCLR loans. Credit cost are expected to remain under control at 0.4 per cent,:\" Nomura said in its Q3 results preview report.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tCiti Research</h3>\n<div>\r\n\tCiti Research estimates domestic advances growth to align with system average growth, at 13 per cent Y-o-Y/3 per cent Q-o-Q, to Rs 39.75 trillion. The bank's focus towards more secured products may continue in Q3FY25, it added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBesides, it expects SBI's Q3 deposit book to stand at Rs 52.48 trillion, up 10 per cent Y-o-Y/3 per cent Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tComfortable loan-to-deposit ratio (LDR) may allow its deposit growth to lag advances growth, Citi noted.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"Post contraction of 8bps in domestic NIM in Q2FY25, we expect SBI Q3 NIM to be broadly stable during the quarter (as MCLR hike benefit over past 6 months may reflect in Q3). However, a fall in global benchmark rates may put some pressure on overseas NIMs,\" the research note said.<small class=\"brtagPara\"> </small> <strong>ALSO READ: </strong><a href=\"https://www.business-standard.com/markets/news/hero-motocorp-q3-preview-net-profit-may-climb-up-to-rs-1-130-crore-yoy-125020400683_1.html\" target=\"_blank\"><strong>Hero MotoCorp Q3 Preview: Net profit may climb up to Rs 1,130 crore YoY</strong></a></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt pegs NII at Rs 42,725 crore (up 7 per cent Y-o-Y/3 per cent Q-o-Q); PPOP at Rs 25,786 crore (up 17 per cent Y-o-Y/down 12 per cent Q-o-Q); net profit at Rs 15,097 crore (up 65 per cent Y-o-Y/down 18 per cent Q-o-Q).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNIM is seen at 3 per cent, down 8bps Y-o-Y/3bps Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn the asset quality front, Citi Research expects slippages to be contained, along with resolution and pull-back of SMA-1/2.</div>\n<div>\r\n\tTrends in slippages from unsecured personal loans (Xpress Credit) will be key.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCiti Research analysts anticipate SBI to drive further cost-to-income (C/I) ratio efficiency by shoring up income and improving productivity.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tPrabhudas Lilladher</h3>\n<div>\r\n\tThe brokerage has the most cautious estimate for SBI Q3 2025 results. It expects SBI Q3 profit to rise just 7 per cent Y-o-Y to Rs 15,463.2 crore. This would be lower by 15.6 per cent Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tQ3 NII growth, too, is seen muted at 7.5 per cent Y-o-Y/2.8 per cent Qo-Q at Rs 42,795.2 crore. Q3 PPOP, on the other hand, is anticipated at Rs 25,627.3 crore, up 26 per cent Y-o-Y/down 12.5 per cent Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tProvisions, Prabhudas Lilladher analysts said, are expected to increase by 5 per cent Q-o-Q/588 per cent Y-o-Y to Rs 4,731 crore, leading to a fall in PAT. Asset quality, in terms of gross non-performing asset (GNPA) ratio, is expected to worsen by 7 bps Q-o-Q to 2.06 per cent, while credit cost is expected to increase by 1bps to 0.48 per cent.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tNuvama Institutional Equities</h3>\n<div>\r\n\tThis brokerage, too, has subdued NII estimates for SBI Q3 results. It expects SBI Q3 NII at Rs 42,120 crore, up around 6 per cent Y-o-Y and 1.2 per cent Q-o-Q.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIncluding Trading Gains of Rs 3,000 crore (up 20 per cent Y-o-Y/down 35.4 per cent Q-o-Q), Other Income of Rs 9,830 crore (up 9.8 per cent Y-o-Y/down 7.5 per cent Q-o-Q), and Non-interest Income of Rs 12,830 crore (up 12 per cent Y-o-Y/down 16 per cent Q-o-Q), Total Revenue is projected at Rs 54,950 crore (up 7.2 per cent Y-o-Y/down 3.4 per cent Q-o-Q).</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNuvama estimates SBI Q3 PPOP to come at Rs 27,590 crore (up 109 per cent Y-o-Y/down 6 per cent Q-o-Q), and net profit at Rs 17,090 crore (up 86.5 per cent Y-o-Y/down 6.8 per cent Q-o-Q).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis brokerage, also, expects provisions to surge 554 per cent Y-o-Y/flat Q-o-Q at Rs 4,500 crore.</div>\n<small class=\"brtag\"> </small>\n<h3>\r\n\tMotilal Oswal Financial Services</h3>\n<div>\r\n\tMOFSL forecasts SBI's provisions to remain elevated in Q3FY25, at Rs 5,160 crore, limiting net profit growth at 77 per cent Y-o-Y at Rs 16,240 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt expects cost ratios to be slightly higher in the quarter, but asset quality may remain contained. GNPA ratio, MOFSL said, may improve to 2.04 per cent from 2.13 per cent. NNPA ratio, meanwhile, is seen at 0.5 per cent vs 0.53 per cent Q-o-Q.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNIM is expected to be flat. </div></div>",
            "pub_date": "2025-02-06 00:15:30",
            "link": "https://www.business-standard.com/markets/news/preview-will-sbi-q3-profit-rise-or-fall-provisions-hold-key-say-analysts-125020400731_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400731"
        },
        {
            "title": "IDBI Bank could increase rates on non-callable deposits post LCR norms",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tIf the proposed liquidity coverage ratio (LCR) norms were to come into effect from April 1, private sector lender IDBI Bank would look at raising interest rates on non-callable deposits by 10–25 basis points, said a senior executive at the bank.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile banks have asked the Reserve Bank of India (RBI) to implement the LCR norms in a staggered manner, the RBI has so far not deferred the implementation date but has asked for more data from banks on their LCR status and the potential impact of implementing the norms from April 1.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn July 2024, the RBI proposed to impose an additional run-off factor of 5 per cent on both stable and less stable retail deposits that are enabled with internet and mobile banking facilities. Run-offs refer to withdrawals of deposits by individuals or businesses, which are not anticipated by banks.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to the proposed norms, stable retail deposits enabled with internet and mobile banking will have a 10 per cent run-off factor, while less stable deposits will have a 15 per cent run-off factor. Current norms mandate that banks maintain a 100 per cent liquidity coverage ratio (LCR).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis means the stock of high-quality liquid assets (HQLAs) should be at least equal to total net cash outflows. The LCR promotes the short-term resilience of banks to potential liquidity disruptions by ensuring that they have sufficient HQLAs to survive an acute stress scenario lasting 30 days.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAdditionally, the proposed norms state that Level 1 HQLAs in the form of government securities should be valued at an amount not greater than their current market value, adjusted for applicable haircuts in line with the margin requirements under the Liquidity Adjustment Facility (LAF) and Marginal Standing Facility (MSF).</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-06 00:15:28",
            "link": "https://www.business-standard.com/industry/banking/idbi-bank-could-increase-rates-on-non-callable-deposits-post-lcr-norms-125020501711_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020501711"
        }
    ]
}