{
    "data": [
        {
            "title": "Western liberal ideas in India a threat to our culture: Dattatreya Hosabale",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tWestern liberal ideas \"operating\" in India through various means and avenues are posing a threat to the country's cultural continuity, RSS general secretary Dattatreya Hosabale said on Wednesday, exhorting people to wake up and stall it.</p>\n<p>\r\n\tIt's a new method of colonisation in the name of liberalisation and globalisation by painting all cultural nationalities and civilisations in one colour and putting them in one framework, he said while addressing an event here.</p>\n<p>\r\n\tI may be saying very serious things... Once our new generation's mind is filled with these things, then one generation is lost. The cultural continuity will be lost, he said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIt's a very serious thing now which we all have to be aware of and see that they are stalled right there, Hosabale added.</p>\n<p>\r\n\tThe RSS general secretary was addressing an event organised to launch a book, Who is Raising Your Children: Breaking India With Youth Warriors', authored by Rajiv Malhotra and Vijaya Viswanathan.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe wokeism, which has been in here, is now in operation through various means and avenues and painting all cultural nationalities and civilisations in one colour, putting them in one framework and trying to create a new global order, he said.</p>\n<p>\r\n\tIf this is the agenda of the wokeist in the name of liberaisation and globalism, then it is time for us to wake up. I think that is their agenda. Rajiv ji and Vijaya ji have already warned us through this book, he said.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tHosabale said the country's social and cultural borders are \"porous now\". \"The army is taking care of our territorial borders. But we should be worried of the cultural borders...if they are not guarded well and cultural invasion takes place, it will create havoc.\"<small class=\"brtagPara\"> </small>\r\n\tHosabale said people of India have been open to other civilisations and ideas.</p>\n<p>\r\n\tWe want all truths to come to us. But, whether that which is coming in is bhadra' (good) or not, that is the whole question, he added.</p>\n<p>\r\n\tHosabale took note of the concerns raised in the book over importing of western model of education and ideas about sexuality and said, It's a matter of worry if the things which are entering into our homes, schools and into the mind of our new generation are healthy, value-based, civilizationally acceptable, and culturally robust.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThis book is a warning bell, he said.</p>\n<p>\r\n\tHe hoped that the new education policy brought by the Union government will be successful in its implementation in the country and in stalling the threats that have just been discussed by the two authors and what have been mentioned in their book.</p>\n<p>\r\n\tSpeaking on a chapter in the book dwelling upon Marxism, the RSS functionary said some years ago he attended a three-day workshop on \"liberation theology\" in Bengaluru and wondered that one can debate whether the Left is using the church or church is using the Left.</p>\n<p>\r\n\tParticularly in third world countries, both the church and Marxism are wonderful things for the people. The church wants to use the Marxist ideology and Marxist wants to use the church network and the funding. So the liberation theology thing came out. Piggybacking (each other), he told the gathering.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tSince both religion and poverty have been co-existing, Marxist found a wonderful field in African and Asian countries to peddle and push their liberation theology. Though the Leftists have found new funding masters and networks of Muslims, he added.</p><p></p></div>",
            "pub_date": "2025-02-05 09:50:27",
            "link": "https://www.business-standard.com/india-news/western-liberal-ideas-in-india-a-threat-to-our-culture-dattatreya-hosabale-125020401859_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401859"
        },
        {
            "title": "Markets Today: Services PMI; MPC; Trump-China news; Swiggy, Titan Q3; IPO",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Stock Markets Today, February 5, 2025: </strong>The Reserve Bank of India’s (RBI) Monetary Policy Committee (MPC) meeting, along with fresh foreign institutional investor (FII) buying, Service PMI, strong global market trends, China’s response to Trump tariffs, and ongoing Q3 earnings are expected to influence the benchmark indices, Sensex and Nifty, today.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAt 6:33 AM, GIFT Nifty futures were up 71 points at 23,856, signaling a higher start for Indian markets.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the <a href=\"https://www.business-standard.com/markets/news/markets-log-biggest-jump-in-a-month-sensex-ends-1-397-points-higher-125020401571_1.html\" target=\"_blank\">previous session</a>, the Sensex closed at 78,583.81, up 1,397.07 points (1.81 per cent), while the Nifty ended at 23,739.25, up 387.20 points (1.62 per cent), after foreign institutional investors (FIIs) purchased shares worth Rs 809.23 crore on February 4.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tDomestic institutional investors (DIIs), meanwhile, offloaded shares worth Rs 430.70 crore.</div>\n<div>\n<small class=\"brtag\"> </small>\n<strong>Also Read: </strong><a href=\"https://www.business-standard.com/economy/news/us-china-trade-war-may-open-new-opportunities-for-indian-exporters-125020401443_1.html\" target=\"_blank\">US-China trade war may open new opportunities for Indian exporters</a></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Domestic cues</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe RBI is expected to announce its <a href=\"https://www.business-standard.com/economy/news/all-eyes-on-rbi-governor-sanjay-malhotra-as-mpc-meeting-begins-on-wednesday-125020401645_1.html\" target=\"_blank\">first interest rate cut in nearly five years</a> during Governor Sanjay Malhotra’s first MPC meeting. The six-member committee, which will conclude its discussions on Friday, is expected to take action to boost slowing economic growth, projected to fall to a four-year low.</div>\n<div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tMarket participants are awaiting earnings reports from companies like <a href=\"https://www.business-standard.com/markets/news/swiggy-q3-preview-analysts-expect-loss-to-widen-qoq-revenue-may-rise-10-125020400348_1.html\" target=\"_blank\">Swiggy</a>, Zydus Life, and Cummins among others. The market will also react to results from <a href=\"https://www.business-standard.com/companies/news/titan-net-profit-largely-flat-in-q3-fy25-due-to-cut-in-customs-duty-125020401422_1.html\" target=\"_blank\">Titan</a>, <a href=\"https://www.business-standard.com/companies/news/tata-power-q3fy25-results-net-profit-rises-8-to-rs-1-030-7-crore-125020401517_1.html\" target=\"_blank\">Tata Power</a>, Whirlpool, and Religare Enterprises, among several others.</div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Also Read: </strong><a href=\"https://www.business-standard.com/markets/news/itc-hotels-removed-from-sensex-dr-agarwal-slips-on-stock-market-debut-125020401354_1.html\" target=\"_blank\">ITC Hotels removed from Sensex; Dr Agarwal slips on stock market debut</a></div>\n<div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Sebi and other market news</strong></div>\n</div>\n<div>\n<small class=\"brtag\"> </small>\r\n\tThe Securities and Exchange Board of India (Sebi) has <a href=\"https://www.business-standard.com/markets/news/sebi-tightens-algo-trading-rules-to-plug-gaps-boost-investor-protection-125020401407_1.html\" target=\"_blank\">introduced new regulations requiring algorithmic trading</a> providers to be empaneled with stock exchanges and establishing rules for using application programming interfaces (APIs). These changes aim to close regulatory gaps and improve investor protection.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAlthough benchmark indices have dropped over 10 per cent from their highs, <a href=\"https://www.business-standard.com/markets/news/two-thirds-of-sectoral-indices-still-a-premium-to-10-yr-averages-125020400946_1.html\" target=\"_blank\">two-thirds of sectoral indices are still trading at a premium</a> compared to their 10-year average price-to-earnings (P/E) multiples, according to Motilal Oswal's report.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Also Read:</strong> <a href=\"https://www.business-standard.com/markets/news/pce-facility-success-depends-on-investor-appetite-market-reforms-125020401573_1.html\" target=\"_blank\">PCE facility success depends on investor appetite, market reforms</a></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tAdditionally, the <a href=\"https://www.business-standard.com/markets/stock-market-news/diis-close-india-inc-ownership-gap-with-foreign-portfolio-investors-125020401430_1.html\" target=\"_blank\">gap in ownership between foreign portfolio investors</a> (FPIs) and domestic institutional investors (DIIs) has narrowed to a record low of 33 basis points (bps) by December 2024, the smallest since 2009.</div>\n</div>\n<div>\n<div>\n<small class=\"brtag\"> </small>\r\n\t\tInvestors also await Services PMI final figures for January.<small class=\"brtagPara\"> </small>\r\n\t\tNotably, over 1.5 crore voters in Delhi will cast their votes today, to elect the next government. The ruling Aam Aadmi Party (AAP) is aiming for a third consecutive term, while the Bharatiya Janata Party (BJP) and Congress are hoping for a comeback in the national capital.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>IPO market</strong></div>\n<div>\n<small class=\"brtag\"> </small>\r\n\t\tAmwill Healthcare IPO (SME) and Ken Enterprises IPO (SME) will open for subscription. Chamunda Electricals IPO (SME) will enter Day 2.</div></div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Commodity market </strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGold prices hit an all-time high on Tuesday as investors flocked to the safe-haven asset following China's retaliation with tariffs on the US Spot gold increased 1.1 per cent to $2,843.06 per ounce. US gold futures rose 0.6 per cent to $2,873.70.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, US oil prices rebounded from earlier losses after a US official confirmed President Trump’s plan to intensify the ‘maximum pressure’ campaign on Iran, aiming to reduce Iranian oil exports to zero. US WTI crude dropped 0.63 per cent to $72.70. Global Brent crude futures edged up 0.32 per cent, to $76.20.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Global cues</strong></div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGlobal markets showed positive momentum as Asia-Pacific markets rose on Wednesday, following an uptick in US stocks. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWall Street overcame concerns surrounding Trump's tariffs and China's retaliation. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChina resumes trading after the Lunar New Year holidays today. Investors will eye Chinese markets especially after the government imposed tariffs on US imports in response to US duties on Chinese exports.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLater in the day, China is expected to release its Caixin Services PMI figures for January, offering insights into the country's services activity. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tLast checked, Nikkei was up 0.25 per cent, while the Topix index rose 0.50 per cent. Kospi jumped 1.07 percent. ASX 200 was up 0.76 per cent.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMeanwhile, in the US, all three major indexes rose overnight amid global trade developments. Nasdaq rose 1.35 per cent, while the S&amp;P 500 climbed 0.72 per cent. Dow Jones settled 0.30 per cent higher.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInvestors now await January Services PMI final for UK and US, coupled with US trade data, which is expected later in the day.</div>\n<small class=\"brtag\"> </small>\n<div>\n<em><strong>Here's how analysts are assessing today's (February 5) trading session:</strong></em></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Shrikant Chouhan, head of equity research at Kotak Securities</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFor traders now, 23,600/78100 and 23,500/77800 would be the key support zones, while 23,800/78700-23,850/78900 could act as key resistance areas for the bulls.</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Rupak De, senior technical analyst at LKP Securities</strong></div>\n<div>\n<small class=\"brtag\"> </small>\r\n\tIn the short-term, the index may move toward 24,050 and higher, while support levels are placed at 23,500 and 23,250.</div></div>",
            "pub_date": "2025-02-05 09:50:27",
            "link": "https://www.business-standard.com/markets/news/markets-today-services-pmi-mpc-trump-china-news-swiggy-titan-q3-ipo-125020500073_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500073"
        },
        {
            "title": "Tulsi Gabbard clears Senate panel vote for nomination as director of NI",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tFormer United States Representative Tulsi Gabbard has cleared the Senate Intelligence Committee vote for her nomination to become the next Director of National Intelligence (DNI), putting her one step closer to confirmation by the full Senate, as reported by The Hill.</p>\n<p>\r\n\tThe vote was a close call, passing 9-8 along party lines.</p>\n<p>\r\n\t\"The Intelligence Committee just voted for Tulsi Gabbard's nomination to be the Director of National Intelligence favourably to the full United States Senate. We look forward to her confirmation and working with her to keep America safe,\" Senate Intelligence Committee Chair Tom Cotton (R-Ark.) told reporters after the closed-door vote, The Hill reported.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe vote came just hours after Senator Todd Young (R-Ind.), a key swing vote, announced that he would support Gabbard.</p>\n<p>\r\n\tThrough a series of posts on X, Young endorsed her nomination, saying, \"I appreciate Tulsi Gabbard's engagement with me on a variety of issues to ensure that our intelligence professionals will be supported and policymakers will receive unbiased information under her leadership.\"</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tHe further wrote, \"I have done what the Framers envisioned for senators to do: use the consultative process to seek firm commitments, in this case, commitments that will advance our national security, which is my top priority as a former Marine Corps intelligence officer.\"</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Having now secured these commitments, I will support Tulsi's nomination and look forward to working with her to protect our national security\" Young added.</p>\n<p>\r\n\tGabbard, who was nominated by US President Donald Trump for the post, is a former Army Reserve lieutenant colonel, Democratic congresswoman, and 2020 presidential candidate who switched to the Republican Party last year. She has, at times, referred to the tens of thousands of intelligence personnel she would oversee as members of the \"deep state.\"</p>\n<p>\r\n\tSenator Susan Collins (R-Maine) also voiced her support for Gabbard, further clearing her path to confirmation. Collins and Young had been seen as pivotal votes in the committee, as reported by The HIl.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 09:45:27",
            "link": "https://www.business-standard.com/world-news/tulsi-gabbard-clears-senate-committee-vote-paving-way-for-dni-confirmation-125020500038_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500038"
        },
        {
            "title": "Lack of chlorine detected in water supplied to GBS patients' houses in Pune",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tA survey of water quality conducted in and around Nanded village, the epicentre of Guillain-Barre Syndrome (GBS) in Pune city, has found that there was lack chlorine in the drinking water supplied to the households of 26 patients of this nerve disorder, officials said.</p>\n<p>\r\n\tOn Tuesday, three fresh cases of GBS were reported in the city, taking the overall tally to 166, they said.</p>\n<p>\r\n\tOfficials of the Rapid Response Team (RRT), formed to probe the outbreak of the GBS cases in Nanded and adjoining localities on Sinhagad Road area, there are a total of 77 GBS patients in Nanded. Of them, the households of 62 patients were visited to take the samples of the drinking water. The findings of the house-to-house survey about lack of chlorine in drinking water was discussed in the meeting of the RRT. Experts have now urged the water supply department of the Pune Municipal Corporation (PMC) to take immediate action to maintain chlorine level of 0.2 PPM (parts per million) in the household water supply to ensure public health safety. \"While water at the source (well) was found to be adequately purified with sufficient chlorine levels, zero chlorine was detected in households of out 26 patients out of 62,\" an RRT member said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe water supply department should take immediate action to maintain a minimum chlorine level of 0.2 ppm in household water supply, he said.</p>\n<p>\r\n\tLast week, Maharashtra Health Minister Prakash Abitkar had disclosed that 80 per cent of the suspected GBS cases in Pune have been reported from areas located around a mega well in Nanded. He had also noted that high number of cases in certain areas appeared to be linked to suspected water contamination. When contacted, Nandkishor Jagtap, head of the civic body's water supply department, said the water from the well (in Nanded, which supplies to four to five villages) is adequately purified with sufficient chlorine levels. \"The reasons for having zero level of chlorine level could be that the households must be sourcing water from other sources, such as private tankers or non-cleaning of overhead water tanks at the residential society or individual household,\" he said. There is another reason that if the water is stored in large quantities, the levels of chlorine could go volatile, the official said.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tJagtap said his department also collected some samples in which chlorine was not found in some samples and Escherichia coli or E-Coli bacteria was also found. \"After we found E coli in some of the water samples collected from the tankers, their operators have been issued notices and they have been instructed to use bleaching power solutions provided by the PMC to ensure that the bacteria is contained,\" he said. He added that some of the private water ATMs were seized after E coli was found in their samples. Meanwhile, Dr Radhakishan Pawar, deputy director of the state health department and chairman of the RRT, said the outbreak of GBS is subsiding now. \"There are around 165 cases, of which 77 are cluster cases which are from Nanded village area. Remaining cases are from other parts of Pune and other districts and they are not epidemiologically related to Nanded area. We consider these 77 cases in Nanded and adjoining areas as an outbreak as they are more than normal and accordingly, the investigations and sample collection of water, stool, poultry, food was going on,\" he said. A decline in the number of GBS cases has been observed now, he added.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"There was a peak around January 18 and 19 but now a decline has been recorded,\" he said. GBS is a rare condition that causes sudden numbness and muscle weakness, with symptoms including severe weakness in the limbs.</p><p></p></div>",
            "pub_date": "2025-02-05 09:45:27",
            "link": "https://www.business-standard.com/india-news/lack-of-chlorine-detected-in-water-supplied-to-gbs-patients-houses-in-pune-125020401848_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401848"
        },
        {
            "title": "Tulsi Gabbard clears Senate panel vote for nomination as director of NI",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tFormer United States Representative Tulsi Gabbard has cleared the Senate Intelligence Committee vote for her nomination to become the next Director of National Intelligence (DNI), putting her one step closer to confirmation by the full Senate, as reported by The Hill.</p>\n<p>\r\n\tThe vote was a close call, passing 9-8 along party lines.</p>\n<p>\r\n\t\"The Intelligence Committee just voted for Tulsi Gabbard's nomination to be the Director of National Intelligence favourably to the full United States Senate. We look forward to her confirmation and working with her to keep America safe,\" Senate Intelligence Committee Chair Tom Cotton (R-Ark.) told reporters after the closed-door vote, The Hill reported.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe vote came just hours after Senator Todd Young (R-Ind.), a key swing vote, announced that he would support Gabbard.</p>\n<p>\r\n\tThrough a series of posts on X, Young endorsed her nomination, saying, \"I appreciate Tulsi Gabbard's engagement with me on a variety of issues to ensure that our intelligence professionals will be supported and policymakers will receive unbiased information under her leadership.\"</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tHe further wrote, \"I have done what the Framers envisioned for senators to do: use the consultative process to seek firm commitments, in this case, commitments that will advance our national security, which is my top priority as a former Marine Corps intelligence officer.\"</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Having now secured these commitments, I will support Tulsi's nomination and look forward to working with her to protect our national security\" Young added.</p>\n<p>\r\n\tGabbard, who was nominated by US President Donald Trump for the post, is a former Army Reserve lieutenant colonel, Democratic congresswoman, and 2020 presidential candidate who switched to the Republican Party last year. She has, at times, referred to the tens of thousands of intelligence personnel she would oversee as members of the \"deep state.\"</p>\n<p>\r\n\tSenator Susan Collins (R-Maine) also voiced her support for Gabbard, further clearing her path to confirmation. Collins and Young had been seen as pivotal votes in the committee, as reported by The HIl.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 09:40:27",
            "link": "https://www.business-standard.com/world-news/tulsi-gabbard-clears-senate-committee-vote-paving-way-for-dni-confirmation-125020500038_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500038"
        },
        {
            "title": "Lack of chlorine detected in water supplied to GBS patients' houses in Pune",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tA survey of water quality conducted in and around Nanded village, the epicentre of Guillain-Barre Syndrome (GBS) in Pune city, has found that there was lack chlorine in the drinking water supplied to the households of 26 patients of this nerve disorder, officials said.</p>\n<p>\r\n\tOn Tuesday, three fresh cases of GBS were reported in the city, taking the overall tally to 166, they said.</p>\n<p>\r\n\tOfficials of the Rapid Response Team (RRT), formed to probe the outbreak of the GBS cases in Nanded and adjoining localities on Sinhagad Road area, there are a total of 77 GBS patients in Nanded. Of them, the households of 62 patients were visited to take the samples of the drinking water. The findings of the house-to-house survey about lack of chlorine in drinking water was discussed in the meeting of the RRT. Experts have now urged the water supply department of the Pune Municipal Corporation (PMC) to take immediate action to maintain chlorine level of 0.2 PPM (parts per million) in the household water supply to ensure public health safety. \"While water at the source (well) was found to be adequately purified with sufficient chlorine levels, zero chlorine was detected in households of out 26 patients out of 62,\" an RRT member said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe water supply department should take immediate action to maintain a minimum chlorine level of 0.2 ppm in household water supply, he said.</p>\n<p>\r\n\tLast week, Maharashtra Health Minister Prakash Abitkar had disclosed that 80 per cent of the suspected GBS cases in Pune have been reported from areas located around a mega well in Nanded. He had also noted that high number of cases in certain areas appeared to be linked to suspected water contamination. When contacted, Nandkishor Jagtap, head of the civic body's water supply department, said the water from the well (in Nanded, which supplies to four to five villages) is adequately purified with sufficient chlorine levels. \"The reasons for having zero level of chlorine level could be that the households must be sourcing water from other sources, such as private tankers or non-cleaning of overhead water tanks at the residential society or individual household,\" he said. There is another reason that if the water is stored in large quantities, the levels of chlorine could go volatile, the official said.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tJagtap said his department also collected some samples in which chlorine was not found in some samples and Escherichia coli or E-Coli bacteria was also found. \"After we found E coli in some of the water samples collected from the tankers, their operators have been issued notices and they have been instructed to use bleaching power solutions provided by the PMC to ensure that the bacteria is contained,\" he said. He added that some of the private water ATMs were seized after E coli was found in their samples. Meanwhile, Dr Radhakishan Pawar, deputy director of the state health department and chairman of the RRT, said the outbreak of GBS is subsiding now. \"There are around 165 cases, of which 77 are cluster cases which are from Nanded village area. Remaining cases are from other parts of Pune and other districts and they are not epidemiologically related to Nanded area. We consider these 77 cases in Nanded and adjoining areas as an outbreak as they are more than normal and accordingly, the investigations and sample collection of water, stool, poultry, food was going on,\" he said. A decline in the number of GBS cases has been observed now, he added.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"There was a peak around January 18 and 19 but now a decline has been recorded,\" he said. GBS is a rare condition that causes sudden numbness and muscle weakness, with symptoms including severe weakness in the limbs.</p><p></p></div>",
            "pub_date": "2025-02-05 09:40:26",
            "link": "https://www.business-standard.com/india-news/lack-of-chlorine-detected-in-water-supplied-to-gbs-patients-houses-in-pune-125020401848_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401848"
        },
        {
            "title": "Tulsi Gabbard clears Senate panel vote for nomination as director of NI",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tFormer United States Representative Tulsi Gabbard has cleared the Senate Intelligence Committee vote for her nomination to become the next Director of National Intelligence (DNI), putting her one step closer to confirmation by the full Senate, as reported by The Hill.</p>\n<p>\r\n\tThe vote was a close call, passing 9-8 along party lines.</p>\n<p>\r\n\t\"The Intelligence Committee just voted for Tulsi Gabbard's nomination to be the Director of National Intelligence favourably to the full United States Senate. We look forward to her confirmation and working with her to keep America safe,\" Senate Intelligence Committee Chair Tom Cotton (R-Ark.) told reporters after the closed-door vote, The Hill reported.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe vote came just hours after Senator Todd Young (R-Ind.), a key swing vote, announced that he would support Gabbard.</p>\n<p>\r\n\tThrough a series of posts on X, Young endorsed her nomination, saying, \"I appreciate Tulsi Gabbard's engagement with me on a variety of issues to ensure that our intelligence professionals will be supported and policymakers will receive unbiased information under her leadership.\"</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tHe further wrote, \"I have done what the Framers envisioned for senators to do: use the consultative process to seek firm commitments, in this case, commitments that will advance our national security, which is my top priority as a former Marine Corps intelligence officer.\"</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Having now secured these commitments, I will support Tulsi's nomination and look forward to working with her to protect our national security\" Young added.</p>\n<p>\r\n\tGabbard, who was nominated by US President Donald Trump for the post, is a former Army Reserve lieutenant colonel, Democratic congresswoman, and 2020 presidential candidate who switched to the Republican Party last year. She has, at times, referred to the tens of thousands of intelligence personnel she would oversee as members of the \"deep state.\"</p>\n<p>\r\n\tSenator Susan Collins (R-Maine) also voiced her support for Gabbard, further clearing her path to confirmation. Collins and Young had been seen as pivotal votes in the committee, as reported by The HIl.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 09:35:26",
            "link": "https://www.business-standard.com/world-news/tulsi-gabbard-clears-senate-committee-vote-paving-way-for-dni-confirmation-125020500038_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500038"
        },
        {
            "title": "Lack of chlorine detected in water supplied to GBS patients' houses in Pune",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tA survey of water quality conducted in and around Nanded village, the epicentre of Guillain-Barre Syndrome (GBS) in Pune city, has found that there was lack chlorine in the drinking water supplied to the households of 26 patients of this nerve disorder, officials said.</p>\n<p>\r\n\tOn Tuesday, three fresh cases of GBS were reported in the city, taking the overall tally to 166, they said.</p>\n<p>\r\n\tOfficials of the Rapid Response Team (RRT), formed to probe the outbreak of the GBS cases in Nanded and adjoining localities on Sinhagad Road area, there are a total of 77 GBS patients in Nanded. Of them, the households of 62 patients were visited to take the samples of the drinking water. The findings of the house-to-house survey about lack of chlorine in drinking water was discussed in the meeting of the RRT. Experts have now urged the water supply department of the Pune Municipal Corporation (PMC) to take immediate action to maintain chlorine level of 0.2 PPM (parts per million) in the household water supply to ensure public health safety. \"While water at the source (well) was found to be adequately purified with sufficient chlorine levels, zero chlorine was detected in households of out 26 patients out of 62,\" an RRT member said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe water supply department should take immediate action to maintain a minimum chlorine level of 0.2 ppm in household water supply, he said.</p>\n<p>\r\n\tLast week, Maharashtra Health Minister Prakash Abitkar had disclosed that 80 per cent of the suspected GBS cases in Pune have been reported from areas located around a mega well in Nanded. He had also noted that high number of cases in certain areas appeared to be linked to suspected water contamination. When contacted, Nandkishor Jagtap, head of the civic body's water supply department, said the water from the well (in Nanded, which supplies to four to five villages) is adequately purified with sufficient chlorine levels. \"The reasons for having zero level of chlorine level could be that the households must be sourcing water from other sources, such as private tankers or non-cleaning of overhead water tanks at the residential society or individual household,\" he said. There is another reason that if the water is stored in large quantities, the levels of chlorine could go volatile, the official said.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tJagtap said his department also collected some samples in which chlorine was not found in some samples and Escherichia coli or E-Coli bacteria was also found. \"After we found E coli in some of the water samples collected from the tankers, their operators have been issued notices and they have been instructed to use bleaching power solutions provided by the PMC to ensure that the bacteria is contained,\" he said. He added that some of the private water ATMs were seized after E coli was found in their samples. Meanwhile, Dr Radhakishan Pawar, deputy director of the state health department and chairman of the RRT, said the outbreak of GBS is subsiding now. \"There are around 165 cases, of which 77 are cluster cases which are from Nanded village area. Remaining cases are from other parts of Pune and other districts and they are not epidemiologically related to Nanded area. We consider these 77 cases in Nanded and adjoining areas as an outbreak as they are more than normal and accordingly, the investigations and sample collection of water, stool, poultry, food was going on,\" he said. A decline in the number of GBS cases has been observed now, he added.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"There was a peak around January 18 and 19 but now a decline has been recorded,\" he said. GBS is a rare condition that causes sudden numbness and muscle weakness, with symptoms including severe weakness in the limbs.</p><p></p></div>",
            "pub_date": "2025-02-05 09:35:25",
            "link": "https://www.business-standard.com/india-news/lack-of-chlorine-detected-in-water-supplied-to-gbs-patients-houses-in-pune-125020401848_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401848"
        },
        {
            "title": "Trump withdraws from UNHRC, announces halt to fund Palestinian refugees",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tPresident Donald Trump announced Tuesday that the United States will withdraw from the top UN human rights body and will not resume funding for the UN agency helping Palestinian refugees.</p>\n<p>\r\n\tThe US left the Geneva-based Human Rights Council last year, and it stopped funding the agency assisting Palestinian refugees, known as UNRWA, after Israel accused it of harboring Hamas militants who participated in the surprise October 7, 2023, attacks in southern Israel, which UNRWA denies.</p>\n<p>\r\n\tTrump's announcement came on the day he met with visiting Israeli Prime Minister Benjamin Netanyahu, whose country has long accused both the rights body and UNRWA of bias against Israel and antisemitism.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tTrump's executive orders also call for a review of American involvement in the Paris-based UN Educational, Scientific and Cultural Organization, known as Unesco, and a review of US funding for the United Nations in light of the wild disparities in levels of funding among different countries.</p>\n<p>\r\n\tThe United States, with the world's largest economy, pays 22 per cent of the UN's regular operating budget, with China the second-largest contributor.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tI've always felt that the UN has tremendous potential, Trump told reporters in the Oval Office. It's not living up to that potential right now. ... They've got to get their act together.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tHe said the UN needs to be fair to countries that deserve fairness, adding that there are some countries, which he didn't name, that are outliers, that are very bad and they're being almost preferred.</p>\n<p>\r\n\tBefore Trump's announcement, UN spokesman Stephane Dujarric reiterated the Human Rights Council's importance and UNRWA's work in delivering critical services to Palestinians.</p>\n<p>\r\n\tTrump also pulled the US out of the Human Rights Council in June 2018. His ambassador to the UN at the time, Nikki Haley, accused the council of chronic bias against Israel and pointed to what she said were human rights abusers among its members.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tPresident Joe Biden renewed support for the Human Rights Council, and the US won a seat on the 47-nation body in October 2021. But the Biden administration announced in late September that the United States would not seek a second consecutive term.</p>\n<p>\r\n\tTrump's order on Tuesday has little concrete effect because the United States is already not a council member, said council spokesperson Pascal Sim. But like all other UN member countries, the US automatically has informal observer status and will still have a seat in the council's ornate round chamber at the UN complex in Geneva.</p>\n<p>\r\n\tUNRWA was established by the UN General Assembly in 1949 to provide assistance for Palestinians who fled or were expelled from their homes before and during the 1948 Arab-Israeli war that followed Israel's establishment, as well as for their descendants. It provides aid, education, health care and other services to some 2.5 million Palestinians in Gaza, the occupied West Bank and East Jerusalem, as well as 3 million more in Syria, Jordan and Lebanon.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tBefore the Oct. 7 Hamas attacks, UNRWA ran schools for Gaza's 650,000 children as well as health facilities, and helped deliver humanitarian aid. It has continued to provide health care and been key to the delivery of food and other aid to Palestinians during the war.</p>\n<p>\r\n\tThe first Trump administration suspended funding to UNRWA in 2018, but Biden restored it. The U.S. had been the biggest donor to the agency, providing it with $343 million in 2022 and $422 million in 2023.</p>\n<p>\r\n\tFor years, Israel has accused UNRWA of anti-Israeli bias in its education materials, which the agency denies.</p>\n<p>\r\n\tIsrael alleged that 19 of UNRWA's 13,000 staff in Gaza participated in the Hamas attacks. They were terminated pending a UN investigation, which found nine may have been involved.</p><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIn response, 18 governments froze funding to the agency, but all have since restored support except the United States. Legislation ratifying the US decision halted any American funding to UNRWA until March 2025, and Trump's action Tuesday means it will not be restored.</p><p></p></div>",
            "pub_date": "2025-02-05 09:30:30",
            "link": "https://www.business-standard.com/world-news/trump-withdraws-from-unhrc-announces-halt-to-fund-palestinian-refugees-125020500056_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500056"
        },
        {
            "title": "Tulsi Gabbard clears Senate Committee vote paving way for DNI confirmation",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tFormer United States Representative Tulsi Gabbard has cleared the Senate Intelligence Committee vote for her nomination to become the next Director of National Intelligence (DNI), putting her one step closer to confirmation by the full Senate, as reported by The Hill.</p>\n<p>\r\n\tThe vote was a close call, passing 9-8 along party lines.</p>\n<p>\r\n\t\"The Intelligence Committee just voted for Tulsi Gabbard's nomination to be the Director of National Intelligence favourably to the full United States Senate. We look forward to her confirmation and working with her to keep America safe,\" Senate Intelligence Committee Chair Tom Cotton (R-Ark.) told reporters after the closed-door vote, The Hill reported.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe vote came just hours after Senator Todd Young (R-Ind.), a key swing vote, announced that he would support Gabbard.</p>\n<p>\r\n\tThrough a series of posts on X, Young endorsed her nomination, saying, \"I appreciate Tulsi Gabbard's engagement with me on a variety of issues to ensure that our intelligence professionals will be supported and policymakers will receive unbiased information under her leadership.\"</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tHe further wrote, \"I have done what the Framers envisioned for senators to do: use the consultative process to seek firm commitments, in this case, commitments that will advance our national security, which is my top priority as a former Marine Corps intelligence officer.\"</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"Having now secured these commitments, I will support Tulsi's nomination and look forward to working with her to protect our national security\" Young added.</p>\n<p>\r\n\tGabbard, who was nominated by US President Donald Trump for the post, is a former Army Reserve lieutenant colonel, Democratic congresswoman, and 2020 presidential candidate who switched to the Republican Party last year. She has, at times, referred to the tens of thousands of intelligence personnel she would oversee as members of the \"deep state.\"</p>\n<p>\r\n\tSenator Susan Collins (R-Maine) also voiced her support for Gabbard, further clearing her path to confirmation. Collins and Young had been seen as pivotal votes in the committee, as reported by The HIl.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-05 09:30:30",
            "link": "https://www.business-standard.com/world-news/tulsi-gabbard-clears-senate-committee-vote-paving-way-for-dni-confirmation-125020500038_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500038"
        }
    ]
}