{
    "data": [
        {
            "title": "Delhi HC refuses relief to Rashmi Saluja in Religare reappointment matter",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Delhi High Court (HC) on Friday denied relief to Rashmi Saluja, executive chairperson of Religare Enterprises (REL), in her plea against a resolution seeking to replace her with a new director at the upcoming annual general meeting (AGM) on February 7.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja, who is set to retire by rotation, argued that her appointment was for a fixed term of five years, ending in 2028. However, the court noted that while she was appointed in 2023 for a five-year term, the board meeting and AGM minutes explicitly stipulated retirement by rotation.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJustice Purushaindra Kumar Kaurav observed, \"This clearly indicates that the understanding of the plaintiff that she is liable to retire is not something that was introduced for the first time in 2025... It is evident that the plaintiff has failed to establish a prima facie case in her favour.\"</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe court further emphasised that every shareholder has the right, subject to statutory procedures, to participate in the company's affairs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"The participation is essentially to uphold the principle of corporate democracy. Shareholders must be allowed to regulate and determine the affairs of the company through general meetings, which serve as the primary forum for decision-making within a corporate entity,\" the court stated.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Delhi HC's decision clears the way for the AGM and the voting on the appointment of a new director to replace Saluja.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHer plea was opposed by four independent directors of the company and the Burman family, the largest shareholder in REL, who have launched an open offer to acquire an additional 26 per cent stake. The open offer, which closes on Friday, has so far received bids for only 1,668 shares.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSaluja has offered herself for reappointment, and the outcome of the voting will be known at the AGM. The AGM, originally scheduled for December, was delayed due to legal proceedings before the Madhya Pradesh High Court. A plea filed by a non-shareholder was later dismissed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThree leading proxy firms—Stakeholders Empowerment Services, Institutional Investor Advisory Services, and InGovern Research—have recommended an 'against' vote on the resolution pertaining to Saluja's reappointment, citing concerns over corporate governance, employee stock ownership plans (ESOPs), and higher remuneration.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRefuting these concerns, REL described the reports as 'orchestrated and motivated' and questioned the timing of the advisory firms' reports. The company stated that matters regarding compensation practices and ESOPs were sub judice and that any attempt to influence public opinion through 'misleading analysis' was unethical.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 21:30:32",
            "link": "https://www.business-standard.com/companies/news/delhi-hc-refuses-relief-to-rashmi-saluja-in-religare-reappointment-matter-125020401469_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401469"
        },
        {
            "title": "Delhi polls: ADR flags non-compliance of norms by candidates, parties",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tOut of 118 candidates with criminal record contesting the Delhi Assembly polls, 24 candidates (20 per cent) did not have their records disclosed or justified by their respective parties, poll rights body ADR said on Tuesday.</p>\n<p>\r\n\tA total of 699 candidates are contesting the upcoming assembly polls in Delhi.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/technology/tech-news/delhi-elections-2025-how-to-search-and-download-voter-slip-on-mobile-phone-125020401228_1.html\" target=\"_blank\">Delhi elections 2025: How to search and download voter slip on mobile phone</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tThe Association for Democratic Reforms (ADR) has released a detailed analysis of the Delhi Assembly elections 2025. The report, based on Format C7 data, revealed that many political parties failed to disclose reasons for selecting candidates with pending criminal cases as directed by the Supreme Court.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tOut of 699 candidates contesting the elections, 118 have declared criminal cases against themselves and among them, 71 candidates face serious criminal charges, including corruption, rioting and violent offenses.</p>\n<p>\r\n\tWhile 94 candidates' criminal records were published as mandated, 24 candidates (20 per cent) did not have their records disclosed or justified by their respective parties.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe Supreme Court had mandated that political parties provide valid reasons for fielding such candidates beyond just their \"winnability\" at the polls.</p>\n<p>\r\n\tHowever, most parties continue to offer vague or repetitive justifications.</p>\n<p>\r\n\tThe analysis covered 22 political parties that fielded candidates with criminal cases.</p>\n<p>\r\n\tThe major parties such as the Aam Aadmi Party (AAP), Congress and Bharatiya Janata Party (BJP) published Format C7 for most of their candidates.</p>\n<p>\r\n\tHowever, the smaller parties, including the Peoples Party of India (Democratic) and Bhartiya Rashtrawadi Party, failed to comply.</p>\n<p>\r\n\tSome parties engaged in questionable practices such as providing identical justifications for multiple candidates or claiming cases were \"politically motivated\" without substantial evidence.</p>\n<p>\r\n\tThe AIMIM and the National Loktantrik Party also copied responses across different candidates, the ADR said.</p>\n<p>\r\n\tAmong the candidates with the highest number of criminal cases are Amanatullah Khan (AAP) with 19 cases, Arvind Kejriwal (AAP) with 15 cases and Mohd. Tahir Hussain (AIMIM) with 11 cases, including 38 serious charges.</p>\n<p>\r\n\tThe political parties justified their selection by citing their political experience, popularity and claims that cases against them were filed due to political vendetta.</p>\n<p>\r\n\tHowever, these explanations often lacked substantive reasoning on why cleaner candidates were not considered, the ADR said.</p>\n<p>\r\n\tThe ADR report also underscores the strong nexus between muscle power, money and politics.</p>\n<p>\r\n\tOut of the 118 candidates with criminal backgrounds, 84 (71 per cent) are crorepatis and the top three candidates with the highest declared assets, despite having criminal cases, include Manjinder Singh Sirsa (BJP) with Rs 248 crore, Gurcharan Singh (Congress) with Rs 130 crore and Parvesh Sahib Singh (BJP) with Rs 115 crore.</p>\n<p>\r\n\tThe ADR has proposed several urgent reforms to curb the criminalization of politics. These include strict action against non-compliant political parties, fast-tracking criminal cases against politicians, banning candidates with serious charges and imposing financial penalties for non-disclosure.</p>\n<p>\r\n\tThe elections to the 70-member Delhi Assembly will be held on February 5 and the votes will be counted on February 8.</p><p></p></div>",
            "pub_date": "2025-02-04 21:30:31",
            "link": "https://www.business-standard.com/elections/delhi-elections/delhi-polls-adr-flags-non-compliance-of-norms-by-candidates-parties-125020401168_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401168"
        },
        {
            "title": "100% FDI in insurance sector to woo more foreign players: Moody's",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tIncreasing foreign investment limit in the insurance sector to 100 per cent from 74 per cent is likely to attract more global players in the growing Indian insurance market, Moody's Ratings said on Tuesday.</p>\n<p>\r\n\tAdditionally, strong premium growth is expected to boost profitability of the sector.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/budget-2025-100-fdi-insurance-penetration-density-lower-premiums-125020200472_1.html\" target=\"_blank\">Budget 2025: How 100% FDI will benefit the Indian insurance industry</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tCurrently, many foreign insurers are present in the country through joint ventures and could seek to increase their ownership stakes in their Indian affiliates following this change in regulation.</p>\n<p>\r\n\t\"We view foreign investment as credit positive because it increases product innovation. The presence of foreign stakeholders also brings benefits in the areas of capital adequacy, financial flexibility and governance standards,\" Moody's Ratings said in a statement.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tPresenting Budget 2025-26, Finance Minister Nirmala Sitharaman proposed to raise the foreign investment limit to 100 per cent from 74 per cent in the insurance sector as part of new-generation financial sector reforms.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tMoreover, Moody's believes that the reduction in personal income tax will have positive trickle-down effects for the insurance sector.</p>\n<p>\r\n\t\"Increased levels of disposable income in the middle-class segment, the insurance sector's largest target market, bodes particularly well for health insurance, given increasing awareness around well-being and protection in the post-COVID era,\" it added.</p>\n<p>\r\n\tThese changes will further boost the Indian insurance industry's growth prospects, which are already favourable.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIn the budget, Sitharaman announced an increase in the personal income tax threshold below which taxpayers owe no tax to Rs 12 lakh, from Rs 7 lakh, as well as a rejig in tax brackets that would help those earning higher than that save up to Rs 1.1 lakh.</p>\n<p>\r\n\tMoody's said that strong economic growth supports average household incomes and increasing demand as a result of consumers' increasing risk awareness and the steady digitalization of the Indian economy, which facilitates the distribution and sale of insurance products.</p>\n<p>\r\n\tIndian insurers' total premium revenue rose 16 per cent to Rs 9.2 trillion in the first eight months of fiscal 2024-25, driven by a 21 per cent increase in health insurance and an 18 per cent increase in new business written in the life sector. This marked an acceleration from fiscal 2023-24, when premiums were up 8 per cent year-on-year to Rs 11.2 lakh crore.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tOn fiscal consolidation, Moody's said the budget signalled \"a slowing pace of fiscal consolidation as focus shifts to reinforcing growth\".</p>\n<p>\r\n\tThe planned cuts to personal income tax rates will bolster middle-class spending power and consumption, which is credit positive for many corporates and the financial sector.</p>\n<p>\r\n\tHowever, the resulting foregone revenue will slow the pace of the country's fiscal consolidation even as total spending declines as a share of GDP. Moreover, the proportion of spending allocated to debt servicing continues to increase.</p>\n<p>\r\n\tThe Finance Minister pegged the fiscal deficit for FY25 at 4.8 per cent of GDP and 4.4 per cent for FY26.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-04 21:25:26",
            "link": "https://www.business-standard.com/budget/news/100-fdi-in-insurance-sector-to-woo-more-foreign-players-moody-s-125020401138_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401138"
        },
        {
            "title": "Infibeam Avenues Q3 FY25 results: Net profit up 42.6% at Rs 62.4 cr",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tDigital payments firm Infibeam Avenues on Tuesday reported a consolidated net profit of Rs 62.4 crore in the third quarter of financial year 2025 (Q3 FY25), a 42.6 per cent increase from Rs 43.75 crore the same time last year. Sequentially, net profit grew 41.6 per cent from Rs 44 crore in Q2 FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRevenue from operations grew 18 per cent to Rs 1,070.3 crore, compared to Rs 907.1 crore in Q3 FY24. Sequentially, such revenue grew 5.3 per cent from Rs 1,016.6 crore in Q2 FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInfibeam operates the payment aggregator CCAvenue which earns revenue from payments and e-commerce. The payments business added Rs 1,010.2 crore to revenue in Q3 FY25, up 17.2 per cent from Rs 858.2 crore in Q3 FY24. E-commerce expanded 23 per cent: From Rs 48.8 crore in Q3 FY24 to Rs 60.1 crore in Q3 FY25.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Gandhinagar-based company’s expenditure increased 18 per cent to Rs 1,013.4 crore in Q3 FY25, from Rs 857.9 crore the same time the year before. Sequentially, expenditure grew 5.8 per cent from Rs 957.1 crore in Q2FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company’s strategic partnerships with banks, fintech firms and regulators “paved the way for hyper‐growth in our payments business”. “Our take rate [the amount of money a business makes from a transaction] improved significantly to 11.1 bps [basis points] in Q3 FY25, reflecting a 32 per cent year-on-year increase and driving profitability,” said Vishwas Patel, Joint Managing Director (MD), Infibeam Avenues.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInfibeam will over quarters launch RediffPay and RediffOne to expand the consumer-facing digital offering of Rediff, the news website it acquired in August.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“With Rediff.com now part of our ecosystem, we anticipate further enhancement in our financial performance and digital offerings,” said Vishal Mehta, chairman and MD of Infibeam.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 21:25:26",
            "link": "https://www.business-standard.com/companies/news/infibeam-avenues-q3-fy25-results-net-profit-up-42-6-at-rs-62-4-crore-125020401250_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401250"
        },
        {
            "title": "100% FDI in insurance sector to woo more foreign players: Moody's",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tIncreasing foreign investment limit in the insurance sector to 100 per cent from 74 per cent is likely to attract more global players in the growing Indian insurance market, Moody's Ratings said on Tuesday.</p>\n<p>\r\n\tAdditionally, strong premium growth is expected to boost profitability of the sector.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/budget-2025-100-fdi-insurance-penetration-density-lower-premiums-125020200472_1.html\" target=\"_blank\">Budget 2025: How 100% FDI will benefit the Indian insurance industry</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tCurrently, many foreign insurers are present in the country through joint ventures and could seek to increase their ownership stakes in their Indian affiliates following this change in regulation.</p>\n<p>\r\n\t\"We view foreign investment as credit positive because it increases product innovation. The presence of foreign stakeholders also brings benefits in the areas of capital adequacy, financial flexibility and governance standards,\" Moody's Ratings said in a statement.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tPresenting Budget 2025-26, Finance Minister Nirmala Sitharaman proposed to raise the foreign investment limit to 100 per cent from 74 per cent in the insurance sector as part of new-generation financial sector reforms.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tMoreover, Moody's believes that the reduction in personal income tax will have positive trickle-down effects for the insurance sector.</p>\n<p>\r\n\t\"Increased levels of disposable income in the middle-class segment, the insurance sector's largest target market, bodes particularly well for health insurance, given increasing awareness around well-being and protection in the post-COVID era,\" it added.</p>\n<p>\r\n\tThese changes will further boost the Indian insurance industry's growth prospects, which are already favourable.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIn the budget, Sitharaman announced an increase in the personal income tax threshold below which taxpayers owe no tax to Rs 12 lakh, from Rs 7 lakh, as well as a rejig in tax brackets that would help those earning higher than that save up to Rs 1.1 lakh.</p>\n<p>\r\n\tMoody's said that strong economic growth supports average household incomes and increasing demand as a result of consumers' increasing risk awareness and the steady digitalization of the Indian economy, which facilitates the distribution and sale of insurance products.</p>\n<p>\r\n\tIndian insurers' total premium revenue rose 16 per cent to Rs 9.2 trillion in the first eight months of fiscal 2024-25, driven by a 21 per cent increase in health insurance and an 18 per cent increase in new business written in the life sector. This marked an acceleration from fiscal 2023-24, when premiums were up 8 per cent year-on-year to Rs 11.2 lakh crore.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tOn fiscal consolidation, Moody's said the budget signalled \"a slowing pace of fiscal consolidation as focus shifts to reinforcing growth\".</p>\n<p>\r\n\tThe planned cuts to personal income tax rates will bolster middle-class spending power and consumption, which is credit positive for many corporates and the financial sector.</p>\n<p>\r\n\tHowever, the resulting foregone revenue will slow the pace of the country's fiscal consolidation even as total spending declines as a share of GDP. Moreover, the proportion of spending allocated to debt servicing continues to increase.</p>\n<p>\r\n\tThe Finance Minister pegged the fiscal deficit for FY25 at 4.8 per cent of GDP and 4.4 per cent for FY26.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-04 21:20:30",
            "link": "https://www.business-standard.com/budget/news/100-fdi-in-insurance-sector-to-woo-more-foreign-players-moody-s-125020401138_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401138"
        },
        {
            "title": "Infibeam Avenues Q3 FY25 results: Net profit up 42.6% at Rs 62.4 cr",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tDigital payments firm Infibeam Avenues on Tuesday reported a consolidated net profit of Rs 62.4 crore in the third quarter of financial year 2025 (Q3 FY25), a 42.6 per cent increase from Rs 43.75 crore the same time last year. Sequentially, net profit grew 41.6 per cent from Rs 44 crore in Q2 FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRevenue from operations grew 18 per cent to Rs 1,070.3 crore, compared to Rs 907.1 crore in Q3 FY24. Sequentially, such revenue grew 5.3 per cent from Rs 1,016.6 crore in Q2 FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInfibeam operates the payment aggregator CCAvenue which earns revenue from payments and e-commerce. The payments business added Rs 1,010.2 crore to revenue in Q3 FY25, up 17.2 per cent from Rs 858.2 crore in Q3 FY24. E-commerce expanded 23 per cent: From Rs 48.8 crore in Q3 FY24 to Rs 60.1 crore in Q3 FY25.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Gandhinagar-based company’s expenditure increased 18 per cent to Rs 1,013.4 crore in Q3 FY25, from Rs 857.9 crore the same time the year before. Sequentially, expenditure grew 5.8 per cent from Rs 957.1 crore in Q2FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company’s strategic partnerships with banks, fintech firms and regulators “paved the way for hyper‐growth in our payments business”. “Our take rate [the amount of money a business makes from a transaction] improved significantly to 11.1 bps [basis points] in Q3 FY25, reflecting a 32 per cent year-on-year increase and driving profitability,” said Vishwas Patel, Joint Managing Director (MD), Infibeam Avenues.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInfibeam will over quarters launch RediffPay and RediffOne to expand the consumer-facing digital offering of Rediff, the news website it acquired in August.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“With Rediff.com now part of our ecosystem, we anticipate further enhancement in our financial performance and digital offerings,” said Vishal Mehta, chairman and MD of Infibeam.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 21:20:30",
            "link": "https://www.business-standard.com/companies/news/infibeam-avenues-q3-fy25-results-net-profit-up-42-6-at-rs-62-4-crore-125020401250_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401250"
        },
        {
            "title": "100% FDI in insurance sector to woo more foreign players: Moody's",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tIncreasing foreign investment limit in the insurance sector to 100 per cent from 74 per cent is likely to attract more global players in the growing Indian insurance market, Moody's Ratings said on Tuesday.</p>\n<p>\r\n\tAdditionally, strong premium growth is expected to boost profitability of the sector.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/budget-2025-100-fdi-insurance-penetration-density-lower-premiums-125020200472_1.html\" target=\"_blank\">Budget 2025: How 100% FDI will benefit the Indian insurance industry</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tCurrently, many foreign insurers are present in the country through joint ventures and could seek to increase their ownership stakes in their Indian affiliates following this change in regulation.</p>\n<p>\r\n\t\"We view foreign investment as credit positive because it increases product innovation. The presence of foreign stakeholders also brings benefits in the areas of capital adequacy, financial flexibility and governance standards,\" Moody's Ratings said in a statement.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tPresenting Budget 2025-26, Finance Minister Nirmala Sitharaman proposed to raise the foreign investment limit to 100 per cent from 74 per cent in the insurance sector as part of new-generation financial sector reforms.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tMoreover, Moody's believes that the reduction in personal income tax will have positive trickle-down effects for the insurance sector.</p>\n<p>\r\n\t\"Increased levels of disposable income in the middle-class segment, the insurance sector's largest target market, bodes particularly well for health insurance, given increasing awareness around well-being and protection in the post-COVID era,\" it added.</p>\n<p>\r\n\tThese changes will further boost the Indian insurance industry's growth prospects, which are already favourable.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tIn the budget, Sitharaman announced an increase in the personal income tax threshold below which taxpayers owe no tax to Rs 12 lakh, from Rs 7 lakh, as well as a rejig in tax brackets that would help those earning higher than that save up to Rs 1.1 lakh.</p>\n<p>\r\n\tMoody's said that strong economic growth supports average household incomes and increasing demand as a result of consumers' increasing risk awareness and the steady digitalization of the Indian economy, which facilitates the distribution and sale of insurance products.</p>\n<p>\r\n\tIndian insurers' total premium revenue rose 16 per cent to Rs 9.2 trillion in the first eight months of fiscal 2024-25, driven by a 21 per cent increase in health insurance and an 18 per cent increase in new business written in the life sector. This marked an acceleration from fiscal 2023-24, when premiums were up 8 per cent year-on-year to Rs 11.2 lakh crore.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tOn fiscal consolidation, Moody's said the budget signalled \"a slowing pace of fiscal consolidation as focus shifts to reinforcing growth\".</p>\n<p>\r\n\tThe planned cuts to personal income tax rates will bolster middle-class spending power and consumption, which is credit positive for many corporates and the financial sector.</p>\n<p>\r\n\tHowever, the resulting foregone revenue will slow the pace of the country's fiscal consolidation even as total spending declines as a share of GDP. Moreover, the proportion of spending allocated to debt servicing continues to increase.</p>\n<p>\r\n\tThe Finance Minister pegged the fiscal deficit for FY25 at 4.8 per cent of GDP and 4.4 per cent for FY26.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-04 21:15:29",
            "link": "https://www.business-standard.com/budget/news/100-fdi-in-insurance-sector-to-woo-more-foreign-players-moody-s-125020401138_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401138"
        },
        {
            "title": "Infibeam Avenues Q3 FY25 results: Net profit up 42.6% at Rs 62.4 cr",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tPayments firm Infibeam Avenues reported a consolidated net profit of Rs 62.4 crore in the third quarter of financial year 2025 (Q3 FY25), a 42.6 per cent year-on-year (Y-o-Y) increase from Rs 43.75 crore in Q3 FY24. Sequentially, net profit at the company grew by 41.6 per cent from Rs 44 crore in Q2 FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Gandhinagar-based firm’s revenue from operations grew by 18 per cent Y-o-Y from Rs 907.1 crore in Q3 FY24 to Rs 1,070.3 crore in Q3 FY25. Sequentially, revenue from operations grew marginally by 5.3 per cent from Rs 1,016.6 crore in Q2 FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tInfibeam Avenues, which operates the payment aggregator CCAvenue, has two major revenue segments: its payments business and e-commerce platform business.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe payments business is a major contributor to the company’s topline, adding Rs 1,010.2 crore to revenue in Q3 FY25, up 17.2 per cent from Rs 858.2 crore in Q3 FY24. Its e-commerce platform business expanded by 23 per cent from Rs 48.8 crore in Q3 FY24 to Rs 60.1 crore in Q3 FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe payments business includes the payment gateway business under the CCAvenue brand and payment infrastructure for banks and credit-related businesses. Meanwhile, the e-commerce platform business includes software and infrastructure frameworks that provide support for enterprises, such as advertising and infrastructure rental solutions.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tExpenses at the company grew in line with its revenue. In Q3 FY24, the payments company spent Rs 857.9 crore, which grew by 18 per cent to Rs 1,013.4 crore. On a quarter-on-quarter (Q-o-Q) basis, expenditure grew by 5.8 per cent from Rs 957.1 crore in Q2 FY25.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company said a key driver for growth in the quarter was its strategic partnerships with banks, fintech firms, and regulatory authorities, which collectively contributed to higher transaction volumes.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Strategic collaborations with banks, fintechs, and regulatory bodies have paved the way for hyper-growth in our payments business. Our take rate improved significantly to 11.1 basis points in Q3 FY25, reflecting a 32 per cent Y-o-Y increase, driving profitability,” said Vishwas Patel, joint managing director, Infibeam Avenues.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIt clocked Rs 2,240 crore in total payment volume (TPV) in Q3 FY25, a 24 per cent Y-o-Y increase.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring Q3 FY25, the company onboarded 1,80,978 new merchants. It added that the upcoming quarters will see the launch of RediffPay and RediffOne, expanding its consumer-facing digital offerings. Rediff is the firm’s subsidiary after Infibeam acquired a controlling stake in the news website in August last year.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“With Rediff.com now part of our ecosystem, we anticipate further enhancement in our financial performance and digital offerings,” said Vishal Mehta, chairman and managing director, Infibeam Avenues.</div></div>",
            "pub_date": "2025-02-04 21:15:28",
            "link": "https://www.business-standard.com/companies/news/infibeam-avenues-q3-fy25-results-net-profit-up-42-6-at-rs-62-4-crore-125020401250_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401250"
        },
        {
            "title": "JK Tyre and Industries Q3 FY25: Profit down 76.6%, revenue falls 0.3%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tJK Tyre and Industries posted a 76.6 per cent year-on-year (Y-o-Y) decline in its consolidated net profit to Rs 51.5 crore for Q3 FY25, while revenue from operations also fell by 0.38 per cent to Rs 3,673.6 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe decline in net profit was attributed to a rise in natural rubber prices.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSequentially, revenue from operations grew by 1.4 per cent, whereas profit after tax (PAT) fell by 61.8 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCommenting on the results, Raghupati Singhania, chairman and managing director (CMD), said, “JK Tyre witnessed healthy growth in the replacement market during the quarter. Rising raw material costs, particularly in natural rubber, impacted margins, which was to an extent addressed by certain price revisions and cost optimisation. Looking ahead, demand in the replacement market is promising, and the OEM sector is on a recovery path. Moreover, export markets offer new opportunities, given the rupee-dollar parity.”</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJK Tyre is focusing on the premiumisation of its product range across various segments, aiming to enhance profitability.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company’s subsidiaries, Cavendish Industries (CIL) and JK Tornel, Mexico, continued to contribute to overall revenues and profitability.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs part of its digital journey, JK Tyre has recently established a Digital &amp; Analytics Centre of Excellence (DnA COE). This initiative is expected to strengthen data-driven operational efficiencies and drive innovation.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAdditionally, JK Tyre has become the first tyre company in India to secure a sustainability-linked loan (SLL) from the International Finance Corporation (IFC).</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe stock fell by 0.88 per cent to Rs 313.55 apiece on the BSE. The results were announced after market hours on Tuesday.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-04 21:10:29",
            "link": "https://www.business-standard.com/companies/results/jk-tyre-and-industries-q3-fy25-profit-down-76-6-revenue-falls-0-3-125020401429_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401429"
        },
        {
            "title": "IND vs ENG: Gill confirms Varun Chakravarthy's addition to IND's ODI squad",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Indian cricket team, just two days before the start of a three-match ODI series against England, has made a significant change in its set-up, as the Men in Blue have decided to add in-form spinner Varun Chakravarthy to the squad for the ODI series. Speculation about Varun's possible inclusion had been circulating since Tuesday afternoon after he was seen with the Indian players during the practice session for the first ODI. However, India’s ODI vice-captain put an end to the rumours by confirming Varun’s inclusion in the ODI squad during a media interaction in the evening after the practice session.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Chakravarthy’s possible inclusion in Champions Trophy squad</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tWith the Champions Trophy squad finalisation deadline set for February 12, there is a possibility that Chakravarthy could replace one of the four specialist spinners. Reports suggest that either Kuldeep Yadav or Washington Sundar may make way for him, depending on his performance in the upcoming ODIs.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDespite being named Player of the Series after picking up 14 wickets in five T20Is against England, Chakravarthy was initially left out of both the ODI squad and the Champions Trophy team. However, his strong form has prompted the selectors to reconsider their decision.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/cricket/news/ind-vs-eng-odi-series-full-list-of-venues-and-india-s-win-loss-record-125020301140_1.html\" target=\"_blank\">IND vs ENG ODI series: Full list of venues and India's win-loss record</a></strong></div></div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Pressure on other spinners</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tCurrently, India has three finger spinners—two left-armers, Ravindra Jadeja and Axar Patel, and one right-arm off-spinner, Washington Sundar. Kuldeep Yadav remains the only wrist-spinner in the squad as he returns to international cricket following sports hernia surgery in October 2024.<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/cricket/champions-trophy\" target=\"_blank\"><strong>Check latest news on ICC Champions Trophy 2025 here</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tA media report also stated that since Chakravarthy does not play red-ball cricket, and with India’s domestic white-ball season concluded, his next assignment would be the Indian Premier League (IPL) in late March. Keeping him active with the ODI squad would allow him to maintain form and fitness.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Will Chakravarthy get an ODI spot?</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tAlthough he has been included in the squad, Chakravarthy has yet to be named in the playing XI for the three-match ODI series against England. A decision on his Champions Trophy inclusion will depend on discussions between the team management and the selection committee.<small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/cricket/champions-trophy/schedule\" target=\"_blank\"><strong>Check ICC Champions Trophy 2025 full schedule, match timings (IST) here</strong></a></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Improved performance and tactical advantage</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tChakravarthy has significantly improved since his 2021 T20 World Cup campaign, where he struggled on the flat Dubai pitches. Over time, he has worked on increasing over-spin to add more variety to his deliveries.</div><div id=\"between_article_content_10-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHis recent form suggests he could be a valuable asset, especially with India set to play all Champions Trophy league matches in Dubai. His impressive T20I series against England, where he finished as the leading wicket-taker with an average of 9.85, has raised his stock as a potential game-changer.</div></div>",
            "pub_date": "2025-02-04 21:10:28",
            "link": "https://www.business-standard.com/cricket/news/ind-vs-eng-gill-confirms-varun-chakravarthy-s-addition-to-ind-s-odi-squad-125020401418_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401418"
        }
    ]
}