{
    "data": [
        {
            "title": "PepsiCo records double-digit organic revenue growth in India in 2024",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tPepsiCo saw double-digit organic revenue growth in India in 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe US-headquartered food and beverage giant gained market share in the savoury snacks category in India, alongside China, Brazil, Australia, South Africa, Poland, Colombia, Guatemala, and Pakistan.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the beverages category too, the maker of 7UP held or gained share in the UK, Germany, Brazil, Australia, South Korea, India, Thailand, Poland, Pakistan, Saudi Arabia, and Vietnam in 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Our $37 billion international business (which represented approximately 40 per cent of total PepsiCo net revenue and core division operating profit in 2024) delivered 6 per cent organic revenue growth in 2024, or 9 per cent organic revenue growth on a two-year compounded basis,” PepsiCo said in its prepared management remarks after announcing its results.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIndia posted mid-single-digit volume growth in the convenient foods category while recording double-digit growth in the beverages category.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn its outlook for 2025, the company said it will undertake initiatives to expand channel diversification and international presence to help stimulate growth.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPepsiCo offers brands like Lay’s, Kurkure, Doritos, and Quaker Oats in foods and Pepsi, Mountain Dew, and Tropicana in its beverages portfolio.</div></div>",
            "pub_date": "2025-02-04 23:30:32",
            "link": "https://www.business-standard.com/companies/news/pepsico-records-double-digit-organic-revenue-growth-in-india-in-2024-125020401653_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401653"
        },
        {
            "title": "Fujifilm expects its instant camera business 'Instax' to grow 50% this FY",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tJapanese multinational conglomerate Fujifilm on Tuesday said its instant camera business Instax is expected to grow 50 per cent this fiscal on the back of robust performance seen in the first three quarters amid rising demand.</p>\n<p>\r\n\tFujifilm India, which earlier in the day announced the launch of its high-end hybrid instant camera 'instax WIDE Evo' in the presence of the company's brand ambassador and Bollywood actor Kartik Aaryan, here, also said that it is aiming to expand the retail network to 5,000 outlets by the end of March next year.</p>\n<p>\r\n\tThe premium edition of the latest instant camera priced at Rs 47,999 will be available at retail stores and online marketplace from February 20.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"The Indian economy is booming and population wise India is one of the youngest populations around the world. Coincidentally, the (Instax) product category is also such that it attracts younger Gen Zs and millennials. So, that makes it apt for Fujifilm as a brand to do a big business in India and that's what is happening over the period of last 3-4 years,\" Head of Instant Photo System (Instax) division at Fujifilm India Arun Babu told PTI.</p>\n<p>\r\n\tBesides Instax, Babu also heads the electronic imaging and optical devices division of the company.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tDescribing India as a very prominent market for Fujifilm, Babu said the Instax category has been growing drastically, almost giving a 50 per cent year-on-year-growth.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"In the first nine months of this financial year, we are almost at a 60 per cent growth in this particular category. So, we anticipate that similar kind of growth will continue.</p>\n<p>\r\n\t\"The category is expecting to wrap up the fiscal 2024-25 at 50 per cent, he said.</p>\n<p>\r\n\tPrior to mid-2021, he said, Instax category was predominantly led or handled by online channels only and there were a very few retail networks. Since then the company has added 3,000-plus retail outlets.</p>\n<p>\r\n\t\"We are also targeting to go further as we are aiming for over 5,000 retail outlets in the country (with additional 2,000) coming up by March next year,\" Babu said.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tEmphasising the need to have a brand ambassador for a product, he said apart from physical stores, the company deals with online platforms such as Amazon, Flipkart as well as quick commerce channels including Blinkit and Zepto, our own website, besides different other portals like Myntra and Nykaa.</p>\n<p>\r\n\t\"So, when you deal with such a big network, you need to have manpower, you need to have a big infrastructure, you need to have a big brand appeal to make customers walk into the stores,\" he said.</p>\n<p>\r\n\tFujifilm India had in June last year announced onboarding Bollywood diva Kriti Sanon and Aaryan as its brand ambassadors for its Instax business in India.</p><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div><p></p></div>",
            "pub_date": "2025-02-04 23:30:31",
            "link": "https://www.business-standard.com/companies/news/fujifilm-expects-its-instant-camera-business-instax-to-grow-50-this-fy-125020401606_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401606"
        },
        {
            "title": "Sam Altman's Asia trip looks like a rush to counter DeepSeek impact",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tOpenAI’s chief executive officer (CEO) Sam Altman is scheduled to meet Prime Minister Narendra Modi, Union Electronics and Information Technology Minister Ashwini Vaishnaw, and other high-ranking officials on his second visit to India in two years. He is likely to land in India late on Tuesday night.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe OpenAI founder is also scheduled to address the developer ecosystem and the venture capitalists during his short stay in the country, a person aware of the development said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPeakXV Managing Director Rajan Anandan as well as executives from venture capital (VC) firms will also be meeting Altman, sources told Business Standard.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAltman is on a whirlwind tour of several countries, including Germany, Japan, South Korea, and the UAE.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe OpenAI founder was in India in June of 2023. His current Asia visit is being seen by many as a rush to counter the impact of DeepSeek's achievement. The Chinese firm has shown the world that foundational models can be built at a fraction of the cost of what OpenAI has managed to do with.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn January 4, OpenAI announced that it will develop AI products for South Korea with chat app operators Kakao. This will be its second major alliance with an Asian player. Earlier this year, OpenAI along with SoftBank announced the Stargate program. This program is planning to invest $500 billion to build AI infrastructure in the US. OpenAI, SoftBank, Oracle, and MGX are the initial investors of $100 billion.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn his earlier visit to India, Altman had courted controversy when he said that companies across the world, including in India, could try to build a product like ChatGPT or a company like OpenAI but would fail.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“It's totally impossible to rival us in training these core models, and we'll advise you not to even attempt it. But it's your responsibility to try anyway. I genuinely believe in both those aspects. I reckon it's quite a futile pursuit,” Altman had then said at an event.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing backlash over his comments, Altman had later clarified that his comments had been taken out of context.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“this is really taken out of context! the question was about competing with us with $10 million, which i really do think is not going to work. but i still said try! however, i think it’s the wrong question,” Altman had said in a tweet.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a second tweet, he had also said that he had “no doubt” that Indian startups could do what had never been done before and contribute a new thing to the world.</div></div>",
            "pub_date": "2025-02-04 23:25:26",
            "link": "https://www.business-standard.com/technology/tech-news/sam-altman-s-asia-trip-looks-like-a-dash-to-garner-support-for-stargate-125020401547_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401547"
        },
        {
            "title": "Global Health Q3 results: Net profit up 16% at Rs 143 cr",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tGlobal Health, which operates hospitals under the Medanta brand, on Tuesday reported 16 per cent increase in its profit after tax to Rs 143 crore for the third quarter ended December 31, 2024, driven by higher patient volume.</p>\n<p>\r\n\tThe healthcare provider posted a profit after tax of Rs 123 crore in the October-December quarter of last fiscal.</p>\n<p>\r\n\tRevenue from operations rose to Rs 943 crore in the third quarter as compared with Rs 836 crore in the year-ago period, Global Health said in a regulatory filing.</p>\n<p>\r\n\t\"We have delivered a strong performance this quarter, driven by higher patient volumes and strong contributions from our developing hospitals,\" Pankaj Sahni, Group CEO and Director said.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe company said its board has approved the signing of the lease agreement to operate and manage a newly built 110-bed hospital in Ranchi.</p>\n<p>\r\n\t\"This expansion will further strengthen our capacity to meet the growing healthcare needs in the region while raising the standard of healthcare delivery,\" Sahni noted.</p>\n<p>\r\n\tShares of the company on Tuesday ended 0.48 per cent down at Rs 1,040.35 apiece on BSE.</p><p></p></div>",
            "pub_date": "2025-02-04 23:25:26",
            "link": "https://www.business-standard.com/companies/results/global-health-q3-results-net-profit-up-16-at-rs-143-cr-125020401633_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401633"
        },
        {
            "title": "Trai recommends opening up key 5G spectrum band for upcoming auctions",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<div>\r\n\t\tThe <strong><a href=\"https://www.business-standard.com/topic/telecom-regulatory-authority-of-india-trai\" target=\"_blank\">Telecom Regulatory Authority of India</a></strong> (Trai) has recommended the auction of several 5G high-band or millimetre wave (mmWave) spectrum in upcoming spectrum auctions.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tTrai on Tuesday said spectrum in the 37-37.5 GHz and 37.5-40 GHz frequency ranges should be auctioned, while it has recommended against auctions for the 42.5-43.5 GHz frequency range.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe move is expected to find support from telecom service providers who have pushed for access to it. MmWave or spectrum bands above 24 gigahertz (GHz) are a valuable resource when targeting densely populated urban areas. The high band offers an opportunity for service providers to offer unprecedented peak rates, low latency, and high capacity.</div></div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tTrai has said telecom players will have the option to pay for the spectrum upfront or in 20 equal annual instalments. While mmWave is limited due to signals not being able to travel as far as mid and low-band signals, they often travel less than a mile and are more susceptible to interference from things such as trees, buildings, and even glass. But the benefit of millimeter wave spectrum is if the signal is unencumbered, users can get connection speeds between 1 Gbps to 3 Gbps or even higher.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tThe regulator has recommended that in addition to the access service providers, internet and machine-to-machine service providers should also be permitted to participate in the auction.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tIn April last year, Trai had issued a consultation paper on the issue. Subsequently, 12 stakeholders have submitted comments, and four furnished counter-comments. On Tuesday, it released its recommendations on what the block sizes for the spectrum bands and the reserve prices for MHz in the 37-40 GHz band should be. This ranges from a high of Rs 76 lakh in the metro circle of Delhi, to Rs 3 lakh in J&amp;K and North East.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tHowever, Trai has pointed out some bands can’t be opened up. “Owing to the non-availability of the device ecosystem in 42.5-43.5 GHz frequency range, it will be prudent that the frequency range 42.5-43.5 GHz is not put to auction in the forthcoming spectrum auction. DoT may send a separate reference for seeking the authority’s recommendations for 42.5-43.5 GHz frequency range for IMT at an appropriate time,” Trai said. Telcos had earlier pushed for opening up spectrum in this band.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\tWhile the 37-37.5 GHz has been globally earmarked for broadband mobile use, the 37.5-40 GHz and 40-42.5 GHz bands have both mobile use and satellite gateway link uses. Similarly, while the 40-42.5 GHz band is only for satellite usage, the 42.5-43.5 GHz band has both usage. While telcos had called for flexible use between terrestrial and satellite-based networks, arguing there would be no interference, Trai hasn’t clarified its stance on the matter.</div>\n<div>\n<small class=\"brtagPara\"> </small></div></div>",
            "pub_date": "2025-02-04 23:20:28",
            "link": "https://www.business-standard.com/industry/news/trai-recommends-opening-up-key-5g-spectrum-band-for-upcoming-auctions-125020401599_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401599"
        },
        {
            "title": "Sam Altman's Asia trip looks like a rush to counter DeepSeek impact",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tOpenAI’s chief executive officer (CEO) Sam Altman is scheduled to meet Prime Minister Narendra Modi, Union Electronics and Information Technology Minister Ashwini Vaishnaw, and other high-ranking officials on his second visit to India in two years. He is likely to land in India late on Tuesday night.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe OpenAI founder is also scheduled to address the developer ecosystem and the venture capitalists during his short stay in the country, a person aware of the development said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPeakXV Managing Director Rajan Anandan as well as executives from venture capital (VC) firms will also be meeting Altman, sources told Business Standard.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAltman is on a whirlwind tour of several countries, including Germany, Japan, South Korea, and the UAE.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe OpenAI founder was in India in June of 2023. His current Asia visit is being seen by many as a rush to counter the impact of DeepSeek's achievement. The Chinese firm has shown the world that foundational models can be built at a fraction of the cost of what OpenAI has managed to do with.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn January 4, OpenAI announced that it will develop AI products for South Korea with chat app operators Kakao. This will be its second major alliance with an Asian player. Earlier this year, OpenAI along with SoftBank announced the Stargate program. This program is planning to invest $500 billion to build AI infrastructure in the US. OpenAI, SoftBank, Oracle, and MGX are the initial investors of $100 billion.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn his earlier visit to India, Altman had courted controversy when he said that companies across the world, including in India, could try to build a product like ChatGPT or a company like OpenAI but would fail.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“It's totally impossible to rival us in training these core models, and we'll advise you not to even attempt it. But it's your responsibility to try anyway. I genuinely believe in both those aspects. I reckon it's quite a futile pursuit,” Altman had then said at an event.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing backlash over his comments, Altman had later clarified that his comments had been taken out of context.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“this is really taken out of context! the question was about competing with us with $10 million, which i really do think is not going to work. but i still said try! however, i think it’s the wrong question,” Altman had said in a tweet.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a second tweet, he had also said that he had “no doubt” that Indian startups could do what had never been done before and contribute a new thing to the world.</div></div>",
            "pub_date": "2025-02-04 23:20:27",
            "link": "https://www.business-standard.com/technology/tech-news/sam-altman-s-asia-trip-looks-like-a-dash-to-garner-support-for-stargate-125020401547_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401547"
        },
        {
            "title": "VC investors take leading role in guiding startups through AI disruption",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tAs artificial intelligence (AI) becomes a central driver of innovation, venture capital (VC) investors are stepping up to help portfolio companies navigate the complexities of AI adoption. From advising on strategic integrations to connecting with top-tier AI talent, VCs are offering more than just capital; they are providing the guidance and resources needed to harness AI’s full potential.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tExperts said the rapid rise of AI tools like ChatGPT, DeepSeek, and Qwen 2.5 has left many startups scrambling to keep up as the pace of disruption accelerates.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“AI is evolving at such an unprecedented pace—what was relevant yesterday may be outdated tomorrow. Given this rapid evolution, the best strategy is to focus on what will remain constant: the need for adaptability,” said Preeti Sampat, partner, Eximius Ventures, a leading VC firm that backs companies across fintech, software-as-a-service (SaaS), frontier tech, and consumer tech.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSampat said most Indian software companies operate in the application layer rather than the infrastructure layer, unlike China, which has made significant strides in foundational AI models like DeepSeek and Qwen. To stay ahead, she said Indian companies must design flexible architectures that can seamlessly integrate multiple AI models as technology advances.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This is particularly critical now, as the cost of AI is decreasing, making intelligent software development more accessible,” said Sampat. “By maintaining adaptability and focusing on customer needs, application-layer companies can capitalise on these advancements.”</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhen asked how Eximius is supporting its portfolio companies in adopting an AI strategy, Sampat pointed out that it is about enhancing existing software solutions by layering AI capabilities on top to improve functionality. The other aspect is developing AI-native modules, which can be built in a modular fashion. These modules can vary in automation levels, ranging from fully automated to human-in-the-loop systems.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The key is to identify where AI can provide the most value and implement it strategically, ensuring that it enhances efficiency, automation, and user experience in a meaningful way,” said Sampat.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFor instance, one of Eximius’ portfolio companies, DecoverAI, is transforming the legal tech space by automating legal service providers (LSPs) in the litigation sector, a trillion-dollar market. DecoverAI focuses on litigation support, making legal workflows more efficient through AI-driven copilots and autonomous agents. Initially, they built copilots to assist lawyers in case preparation and real-time courtroom support. However, with the rise of AI agents, they are now incorporating autonomous workflows that can handle certain tasks independently.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“This balance between AI-assisted and AI-driven automation not only enhances efficiency but also reduces costs, making DecoverAI a standout player in legal AI,” said Sampat.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>AI adoption must be strategic</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAnil Joshi, managing partner at Unicorn India Ventures, believes AI may not be applicable as it is to all businesses. However, he said Unicorn India actively evaluates the potential impact of AI on respective businesses and accordingly advises companies on their AI goals.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis includes firms using AI for internal operations to gain an edge over competitors. The other goal is making product offerings AI-compatible so that customers can benefit from cutting-edge solutions.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOne of Unicorn India’s portfolio firms, Genrobotic, recently worked on a robo-arm leveraging AI. It is helping eliminate risks to humans in difficult tasks while improving productivity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tJoshi said having an AI strategy is crucial, as it involves engaging quality resources for building AI solutions, which is expensive. He also stressed the importance of continuously monitoring and evaluating AI’s impact. Otherwise, companies may end up spending excessive man-hours and resources on solutions that lack practical use cases.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Timely intervention will certainly help companies build the right solutions needed by customers,” said Joshi. “We strongly encourage companies to build in-house AI capabilities or intellectual property. It will certainly help in keeping pace with changes in the tech space.”</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>AI specialists: A necessity or an option?</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSonal Saldanha, vice president for investments at 3one4, said his firm insists that companies experiment with and embrace new AI tools with urgency—not just for marketing.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Because we’re seeing so many real-world examples of impact,” said Saldanha.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t3one4 counts fresh meat and seafood delivery startup Licious, shared electric vehicle mobility company Yulu, and Ayurvedic consumer products firm Kapiva among its portfolio companies.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAs far as building AI-enabled products is concerned, Saldanha said teams at various companies already have too much on their plates. Using closed-source foundational model APIs (application programming interfaces) is often the easiest way to get started. Moving to self-hosting open-source models, which provide more flexibility but require greater technical expertise, can be adopted later in the product’s life cycle.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“When it comes to consuming AI products internally, again, the best product wins. Building and maintaining a home-grown implementation of something is often not worth the effort at startups, where focus is especially important,” said Saldanha.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, Saldanha does not buy into the notion that companies need ‘AI specialists’ to succeed. He believes it is as simple as hiring smart engineers who are willing to tinker and learn practical tooling, at least in the beginning. Later, more specialists can be recruited to solve specific growth-related problems.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Helping startups integrate AI</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGowri Shankar Nagarajan, associate partner at Antler India, said his firm provides advisory support to enable portfolio companies to adopt AI.</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“We have a bunch of AI practitioners who are available to any founder to brainstorm how they should think about using AI and the right tech stack for AI,” said Shankar.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAntler is also actively working with major tech companies to give startups access to AI tools to experiment before setting up a full-fledged product roadmap.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGenerative AI (GenAI) has the potential to add a cumulative $1.2–1.5 trillion to India’s gross domestic product (GDP) over the next seven years, according to a report by EY. The report, titled AIdea of India: Generative AI’s Potential to Accelerate India’s Digital Transformation, states that in 2029-30 alone, GenAI could contribute an additional $359–438 billion to India’s GDP.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-04 23:15:33",
            "link": "https://www.business-standard.com/companies/start-ups/vc-investors-take-leading-role-in-guiding-startups-through-ai-disruption-125020401454_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401454"
        },
        {
            "title": "Sam Altman's Asia trip looks like a rush to counter DeepSeek impact",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tOpenAI’s chief executive officer Sam Altman is scheduled to meet Indian Prime Minister Narendra Modi, Union electronics and information technology minister Ashwini Vaishnaw, and other high-ranking officials on his second visit to India.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe OpenAI founder is also scheduled to address the developer ecosystem and venture capitalists during his short stay in the country, a person aware of the development said.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPeak XV managing director Rajan Anandan, along with executives from venture capital firms, will also be meeting Altman, sources told <em>Business Standard.</em></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAltman, who is on a whirlwind tour of several countries, including Germany, Japan, South Korea, and the United Arab Emirates, is likely to land in India late on Tuesday night.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWednesday, February 5, will mark Altman’s second visit to India in two years. He was previously in India in June 2023. The current visit is seen by many as a rush to counter the impact of DeepSeek's achievement. The Chinese firm has demonstrated that foundational models can be built at a fraction of the cost of what OpenAI has managed.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn January 4, OpenAI announced that it would develop AI products for South Korea with chat app operator Kakao. This will be its second major alliance with an Asian player. Earlier this year, OpenAI, along with SoftBank, announced the Stargate programme.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Stargate programme was announced by US President Donald Trump. This programme plans to invest $500 billion to build AI infrastructure in the US. OpenAI, SoftBank, Oracle, and MGX are the initial investors, with $100 billion already committed.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDuring his earlier visit to India in June 2023, Altman courted controversy when he said that companies across the world, including in India, could try to build a product like ChatGPT or a company like OpenAI but would fail.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"It's totally impossible to rival us in training these core models, and we'll advise you not to even attempt it. But it's your responsibility to try anyway. I genuinely believe in both those aspects. I reckon it's quite a futile pursuit,\" Altman had said at an event.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFollowing backlash over his comments, Altman later clarified that his remarks had been taken out of context.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t\"This is really taken out of context! The question was about competing with us with $10 million, which I really do think is not going to work. But I still said try! However, I think it’s the wrong question,\" Altman said in a tweet.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn a second tweet, he also stated that he had \"no doubt\" that Indian startups could achieve what had never been done before and contribute something new to the world.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 23:15:33",
            "link": "https://www.business-standard.com/technology/tech-news/sam-altman-s-asia-trip-looks-like-a-dash-to-garner-support-for-stargate-125020401547_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401547"
        },
        {
            "title": "Gold loan portfolio of banks jumps 71.3% to Rs 1.72 trillion till Dec 2024",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tGold loan portfolio of banks rose by 71.3 per cent year-on-year (Y-o-Y) till December of the current financial year (FY25) to Rs 1.72 trillion, compared to 17 per cent growth a year ago, on the back of rising prices of the yellow metal and slowdown in unsecured loan following increase in risk weights last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Over the last year, gold loan growth has sharply increased, with a 68 per cent rise from April 2024 to December 2024 (M9FY25), while gold prices increased by around 21 per cent during the time,” said Ajit Velonie, senior director, Crisil Ratings.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“There has also been a partial slowdown in unsecured loan growth due to stricter regulations. The growth in gold loans has coincided with this period. Personal loans grew by only 5-6 per cent, compared to 16.5 per cent in the previous year. The slower growth in unsecured loans has likely led borrowers to turn to gold loans as an alternative,” said Velonie.</div><span style=\"display:block;height:1px\"> </span>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn November 2023, the Reserve Bank of India (RBI) increased risk weight for unsecured loans by 25 percentage points to 125 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe personal loans segment showed 9.7 per cent growth in December 2024, compared to 20.8 per cent in December 2023. Credit card loans also saw moderation in growth at 15.6 per cent in December 2024, down from 32.6 per cent a year ago.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBank credit growth in the retail loan segment, including housing, vehicle, credit cards, and personal loans, dropped to 14.9 per cent Y-o-Y in December 2024, down from 17.6 per cent in December 2023.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe gold loan prices increased by 20.4 per cent to Rs 75,857 per 10 gram in December 2024 from Rs 62,993 per 10 gram in the year-ago period.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Factors contributing to the rise in gold loans include rising prices of the yellow metal, as the value of loans taken against jewellery also increases amid rise in gold prices. People with gold jewellery are also borrowing more to refinance their loans as the value of gold increases,” said Kirti Timmanagoudar, head of strategy and co-lending, IIFL Finance.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The crackdown on unsecured lending and stress in the MFI space might also be contributing factors. It is likely a cumulative effect of these elements, rather than one factor being responsible,” said Timmanagoudar.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording RBI data, since May 2024, one bank has changed the classification of agricultural loan into “Loans against gold jewellery” under the retail segment.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“Loans previously classified as agricultural are now being treated as gold loans. This reclassification might explain the slower growth in agricultural loans, which have only grown by 8 per cent compared to previous years,” Timmanagoudar added.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“The slowdown in supply of unsecured lending might give an impetus but gold loan has been witnessing an upward trajectory due to its own features. Today it is a popular choice among customers, especially for short-term requirements, and acts as a vital financial inclusion tool,” said Shaji Varghese, chief executive officer (CEO), Muthoot FinCorp.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe December edition of the financial stability report (FSR) of the RBI observed the rapid increase in gold loan disbursals during the period ending September 2024 compared to the same time period last year.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTo address the non-adherence to prudential guidelines by the supervised entities (SEs) in grant of loans against pledge of gold ornaments and jewellery, the RBI has advised SEs to comprehensively review their policies, identify gaps, and implement corrective measures within a specified timeframe.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 23:10:29",
            "link": "https://www.business-standard.com/industry/banking/gold-loan-portfolio-of-banks-jumps-71-3-to-rs-1-72-trillion-till-dec-2024-125020401498_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401498"
        },
        {
            "title": "Metropolis Healthcare Q3 results: Net profit soars 15%, revenue up 10%",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tIndia’s second-largest pathology laboratory chain, <strong><a href=\"https://www.business-standard.com/markets/metropolis-healthcare-ltd-share-price-65221.html\" target=\"_blank\">Metropolis Healthcare</a></strong>, posted a 15.5 per cent year-on-year (Y-o-Y) growth in its consolidated net profit at Rs 31.3 crore for Q3FY25, while revenue from operations grew by 10.8 per cent to Rs 322.7 crore.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe increase in net profit can be attributed to strong performance in domestic and emerging markets.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOn a sequential basis, the company’s revenue declined by 7.7 per cent, while PAT also fell by 32.5 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCommenting on the future plans, Ameera Shah, executive chairperson and whole-time director, Metropolis Healthcare, stated, “As part of our long-term strategy, we are expanding our presence in North India through a ‘string of pearls’ approach, focusing on acquiring high-performing B2C businesses that are leaders in their cities, with strong Ebitda, ROCE, and cash flows. This strategy will enhance our capabilities and deepen our footprint in the region, driving long-term value creation.”</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe B2C (business-to-consumer) segment’s revenue saw a 15 per cent Y-o-Y increase, fueled by a 5 per cent rise in patient volume and a 10 per cent jump in revenue per patient (RPP), supported by enhanced upselling and value delivery.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe B2B (business-to-business) segment saw a 10 per cent Y-o-Y growth, maintaining a double-digit expansion for the third consecutive quarter.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe firm’s wellness programme, TruHealth, saw revenue grow by 25 per cent Y-o-Y, with its contribution to the overall revenue mix rising from 14 per cent in Q3FY24 to 17 per cent in Q3FY25.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe specialty revenue stream expanded by 13 per cent Y-o-Y, driven by a focus on specialised, non-seasonal tests.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company’s stock fell by 1.28 per cent to Rs 1,735.30 apiece on the BSE. The results were announced after market hours on Tuesday.</div>\n<small class=\"brtag\"> </small></div>",
            "pub_date": "2025-02-04 23:10:28",
            "link": "https://www.business-standard.com/companies/news/metropolis-healthcare-q3-results-net-profit-soars-15-revenue-up-10-125020401630_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020401630"
        }
    ]
}