{
    "data": [
        {
            "title": "Force Motors shares zoom 10%; here's what is driving rally in stock",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tForce Motors shares jumped 10.3 per cent on Wednesday, logging an intraday high at Rs 7,057.95 per share on BSE. The demand for the stock came after the company released its January sales data. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAround 12:24 PM, <a href=\"https://www.business-standard.com/markets/force-motors-ltd-share-price-53.html\" target=\"_blank\">Force Motors</a> share price was up 5.84 per cent at Rs 6,767 per share on BSE. In comparison, the <a href=\"https://www.business-standard.com/markets/bse-sensex-indices-1001\" target=\"_blank\">BSE Sensex</a> was down 0.20 per cent at 78,424.08. The market capitalisation of the company stood at Rs 8,819.36 crore. The 52-week high of the stock was at Rs 10,272.65 per share and the 52-week low was at Rs 3,990.1 per share. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe company released its January update during market hours. The report showed Force Motors' January sale of small commercial vehicles (SCV), light commercial vehicles (LCV), utility vehicles (UV) and sports utility vehicles (SUV) increased 20.34 per cent at 3,597 units as compared to 2,989 units a year ago. </div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSCV, SUV, LCV and UV domestic sales in January 2025 increased 39.27 per cent to 3,493 units as compared to 2,508 units a year ago. However, company's SCV, SUV, LCV and UV export decreased 78.37 per cent to 104 units as compared to 481 units a year ago. Force Motors discontinued tractor business effective from March 31, 2024.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn December, Force Motors' SCV, SUV, LCV and UV domestic sales fell 8.06 per cent year-on-year (Y-o-Y) to 1,985 units in December from 2,159 units a year ago. However, it increased 14.3 per cent from November's sale of 1,736 units. The company's domestic sale of tractors stood at 15 units. <small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/markets/news/force-motors-share-price-rises-14-in-two-days-soars-94-in-one-year-125010300372_1.html\" target=\"_blank\">Force Motors share price rises 14% in two days; soars 94% in one year</a></strong></div></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAdditionally, its export of SCV, SUV, LCV and UV fell 84.35 per cent Y-o-Y to 51 units as compared to 326 units. All together, the company's total sales fell 18.07 per cent to 2,036 units against 2,485 a year ago. However, it rose 8 per cent from November's sale of 1,885 units.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBesides, on January 2, 2025, Force Motors bagged an order for the supply of 2,429 units of ambulances to the Medical Health and Family Welfare Department, Uttar Pradesh. In a regulatory filing, the company said the order is for supply of 2,429 units of BS-VI diesel ambulance to the department. The order is to be executed between December 2024 and March 2025, it said without disclosing the value of the order.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn the past one year, Force Motors shares have gained 57.2 per cent against Sensex's rise of 9.5 per cent. </div></div>",
            "pub_date": "2025-02-05 15:25:30",
            "link": "https://www.business-standard.com/markets/news/force-motors-shares-zoom-10-here-s-what-is-driving-rally-in-stock-125020500589_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500589"
        },
        {
            "title": "DMK flays Centre, UP govt for 'hiding' Mahakumbh stampede casualties",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe BJP government at the Centre is \"protecting\" the Uttar Pradesh government by hiding Mahakumbh stampede deaths and showing a flawed death toll, Tamil Nadu's ruling DMK alleged on Wednesday.</p>\n<p>\r\n\tAppropriate arrangements must have been made for the devotees taking part in that event if the BJP had 'real bhakthi.' However, it was not done. \"The BJP and its associates show their bhakthi only outside the temple and only in politics. That is why the kumbh fest was conducted in a negligent manner,\" DMK mouthpiece 'Murasoli' alleged in an editorial on February 5 adding the BJP government was responsibile for the tragic deaths.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tPointing to participation of crores of devotees in the festival, the \"unmanageable crowd\" and deaths rising gradually, the Dravidian party newspaper alleged \"restriction was imposed on news outlets\" to not report the increase in the number of deaths and accordingly, the news was withheld.</p>\n<p>\r\n\t\"Only after 17 hours, the Yogi government confirmed the number of deaths as 30,\" the DMK daily said adding the opposition parties were \"not allowed\" to raise question in this regard in the Parliament. \"The law of the Sanghis (RSS persons) is that nothing should be questioned if it was done by the BJP and if Yogis ruled.\"<small class=\"brtagPara\"> </small>\r\n\t\"Forty eight people have lost their lives at the Kumbhamela in Uttar Pradesh. Concealing such deaths and by showing false account, the Union BJP government is protecting the Uttar Pradesh government,\" the newspaper alleged, adding though the Uttar Pradesh government maintained 30 deaths, an English national daily reported 48 deaths after counting the bodies. An official even said that not all of the 30 died in the stampede; they had several diseases.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe DMK's Tamil daily also cited inputs from a news report on the festival, the crux of which was alleged confusion, chaos and improper event management (outsourcing of several services/tasks) causing misery to the devotees.</p><p></p></div>",
            "pub_date": "2025-02-05 15:25:28",
            "link": "https://www.business-standard.com/politics/dmk-flays-centre-up-govt-for-hiding-mahakumbh-stampede-casualties-125020500444_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500444"
        },
        {
            "title": "Govt's cash deficit eases after RBI takes aggressive liquidity measures",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Bhaskar Dutta</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe cash crunch plaguing India’s banking system has more than halved after the central bank took aggressive liquidity injection measures amid faltering economic growth.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDeficit liquidity, or the amount that lenders borrow from the Reserve Bank of India, stood at Rs 66,040 crore ($7.6 billion) as on Feb. 4, down from Rs 2.2 trillion on Jan. 30, according to a Bloomberg Economics index. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe cash injection has also led to a decline in the weighted average call rate, which represents banks’ overnight borrowing costs. The rate has dropped from a high of 6.88 per cent last month to align with the benchmark policy repurchase rate of 6.50 per cent. Local swaps have also eased, with the one-year rate falling by as much as 26bps below the RBI’s key rate. \r\n\t<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"Charts\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"Charts\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/05/full/1738739381-9542.png?im=Resize=(640,480)\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span></div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFactors including a pick-up in government spending at the start of the month have also helped shrink the cash shortage, which had risen to Rs 3 trillion late last month, the highest in at least 14 years. The central bank’s dollar sales to protect the rupee from volatility, tax outflows and larger cash withdrawals from banks had added to the tight liquidity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“There is a need for further liquidity infusion because the pressure on the rupee continues, which necessitates some amount of RBI intervention and that is a drag on liquidity,” said Sakshi Gupta, an economist at HDFC Bank. “As we move into March, there will be tax outflows again.”</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOf the $18 billion that the RBI plans to inject, it has so far pumped in a little more than $7 billion via open market bond purchases and a foreign-exchange swap. The central bank carried out the first tranche on Jan. 30.</div></div>",
            "pub_date": "2025-02-05 15:20:28",
            "link": "https://www.business-standard.com/economy/news/govt-s-cash-deficit-eases-after-rbi-takes-aggressive-liquidity-measures-125020500591_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500591"
        },
        {
            "title": "Bajaj Finance, UPL, IndusInd among overbought stocks as Nifty bounces back",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>The <a href=\"https://www.business-standard.com/markets/nse-nifty-indices-20559\" target=\"_blank\">NSE Nifty 50 index</a> has gained 4 per cent from its low of 22,787 in the last eight trading sessions. On Wednesday, the Nifty 50 index quoted on a flat note around 23,750 levels in a choppy trade. Meanwhile, the broader Nifty 500 index has rallied 5.3 per cent from its low of 20,758, and was seen quoting around 20,820 levels in today's session.<small class=\"brtagPara\"> </small> Technically, the Nifty 50 index was seen favourably placed above its short-term moving average and the super trend line on the daily scale. On the other hand, the Nifty 500 index was seen testing resistance around its super trend line on the daily scale at 23,820, a close above the same will strengthen the trend for the broader index.<small class=\"brtagPara\"> </small> The daily chart shows that the Nifty 500 index is likely to trade with a favourable bias as long as the index holds above 21,475. On the upside, the index can potentially rally to 22,700 levels, with interim resistance seen at 22,000 and 22,250.<small class=\"brtagPara\"> </small> Among individual stocks in the broader market, 65 out of the Nifty 500 stocks have gained over 10 per cent in the last eight days; with 5 surging more than 20 per cent. Beaten down <a href=\"https://www.business-standard.com/markets/kalyan-jewellers-india-ltd-share-price-42402.html\" target=\"_blank\">Kalyan Jewellers</a> tops the gainers chart with a 29 per cent gain. Syrma SGS Technology, Inox Wind, Westlife Foodworld, Phoenix Mills, DOMS Industries, Cholamandalam Investment and Finance Company, TVS Motor, Aptus Value Housing Finance, Aditya Birla Real Estate and UPL were the other major gainers - up over 18 per cent each.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/nifty-may-target-24-300-post-budget-trump-tariff-rbi-policy-key-triggers-125020101053_1.html?1738738548\" target=\"_blank\">Nifty may target 24,300 post Budget; Trump tariff, RBI policy key triggers</a></strong><small class=\"brtagPara\"> </small> Amid this recent pullback, select stocks are now seen trading in overbought territory on the basis of the RSI indicator. The 14-day RSI (Relative Strength Index) indicator is plotted on a scale of 0 - 100; a reading above 70 implies an overbought position; whereas, a reading below 30 implies oversold zone.<small class=\"brtagPara\"> </small> Just being overbought or oversold does not necessarily mean a likely change in director. The underlying index or stock can also consolidate or trade sideways for the RSI indicator to cool-down. However, analysts do caution on venturing into stocks that are overbought, as they may tend to fall sharper in case of adverse market reaction.<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/markets/news/jubilant-food-devyani-will-budget-led-consumption-boost-pop-their-stocks-125020500450_1.html?1738738548\" target=\"_blank\">Jubilant Food, Devyani: Will Budget-led consumption boost pop their stocks?</a></strong><small class=\"brtagPara\"> </small> <a href=\"https://www.business-standard.com/markets/upl-ltd-share-price-2461.html\" target=\"_blank\">UPL</a> and <a href=\"https://www.business-standard.com/markets/bajaj-finance-ltd-share-price-3722.html\" target=\"_blank\">Bajaj Finance</a> with a 14-day RSI reading above 78 are two leading stocks in the overbought zone among the Nifty 500. That apart, SRF, Maruti Suzuki, SBI Cards, IndusInd Bank and Navin Fluorine were some of the other prominent overbought stocks on the bourses.<small class=\"brtagPara\"> </small> Meanwhile, despite the broader market recovery select stocks continue to languish in oversold territory technically, meaning with a RSI reading below 30. These stocks are - JK Tyres, Rajesh Exports, Pfizer, Kaynes Technology, HEG, Carborundum Universal, Whirlpool of India, GR Infra Projects, BASF, Apar Industries and Bosch.<small class=\"brtagPara\"> </small>\n<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"overbought oversold stocks\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"overbought oversold stocks\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/05/full/1738739484-4272.jpg\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span>\n<div style=\"float:left;clear:both;font-style:italic;padding:10px 10px 10px 0px;width:620px\">\r\n\t\toverbought oversold stocks</div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtagPara\"> </small></div>",
            "pub_date": "2025-02-05 15:20:27",
            "link": "https://www.business-standard.com/markets/news/bajaj-finance-upl-indusind-among-overbought-stocks-as-nifty-bounces-back-125020500585_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500585"
        },
        {
            "title": "Gold strategy on February 5: Support at Rs 82,450; Resistance at Rs 85,000",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Gold: Extending its rally on weaker Dollar and softer US yields</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Performance</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBuoyed by weaker Dollar and softer US yields, spot gold extended its winning streak to the fourth straight day on February 4 as it hit a fresh record high of $2,845.51.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChina, in retaliation to Trump's 10 per cent tariffs, imposed tariffs on the US goods worth $14 billion. These goods include LNG, crude oil, farm equipment and natural gas. China also decided to control exports of critical commodities like tellurium, molybdenum, etc.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDespite the China-US tariff stand-off, risk appetite was healthy after postponement of tariffs on Canada and Mexico after agreements on border control and trade.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSpot gold posted its fifth consecutive weekly gain in the week ended January 31. It is up around 9 per cent YTD.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe metal was trading at $2,844 at the time of writing this report. The MCX April gold contract at Rs 83,746 was up around 0.56 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Data roundup</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe US JOLTs openings (December) data, released on Tuesday, showed that job openings fell to 7.6 million in December from 8.16 million in November, lowest since September, though hiring held at 3.4 per cent, still around the lowest in a decade, while quit rate was steady at 2 per cent. Factory orders (December) came in at -.9 per cent (forecast -0.8 per cent), whereas durable goods orders (December final) at -2.2 per cent matched the forecast.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P US Global manufacturing PMI (January final) came in at 51.2 (forecast 50.10) whereas the US ISM manufacturing (January) with a reading of 50.90 (forecast 50) shot back into the expansion zone for the first time after 26 straight months of contraction. ISM prices paid at 54.90 were hotter than the estimate of 54.2 as ISM employment showed expansion with its reading of 50.30 topping the forecast of 52. Even new orders topped the estimate.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Upcoming data</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tToday's US data include ADP employment change (January), trade balance (December), S&amp;P global US services PMI (January final) and ISM services Index (January).</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>US Dollar and yields</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe 10-year US yields continue to swing largely between 4.50 per cent and 4.60 per cent. The yields, at the time of writing this report, were at 4.52 per cent, down nearly 2 bps on the day, as bond rallied on lacklustre US JOLTs openings data. The two-year yields have been moving largely in the 4.20 per cent-4.30 per cent since mid-January. The yields at 4.21 per cent were down around 1 per cent on the day.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe US Dollar Index, after surging to 109.88 on February 3 on trade war concerns, the highest level since January 13, has eased below 108 as tariffs on Canada and Mexico have been delayed by at least a month. The Index at 107.99 was down nearly 1 per cent on the day.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>ETF</strong><small class=\"brtag\"> </small></div>\n<div>\r\n\tTotal known global gold ETF holdings as on February 3, stood at 83.44MOz -- the highest since January 21. Gold ETFs have recorded a net inflow of around 0.60 MOz YTD.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Outlook</strong><small class=\"brtagPara\"> </small>\r\n\tGold rally is being driven more by subdued yields and US Dollar Index rather than safe haven demand. The metal was sharply lower in the Asian session on Monday when the US Dollar Index rallied above 109 level as Trump imposed 25 per cent import duty on Canada and Mexico. There are not many concerns regarding the US-China tariff tiff. The US equities benchmark Indices of NASDAQ and S&amp;P 500, despite the DeepSeek induced turmoil episode, are within the striking distance of their all-time highs.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tMarkets think that China tariff issue will also be resolved/shelved at least temporarily. China’s tariff gambit is a calculated move as tariffs are levied on US goods worth merely $14 billion.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tGold may extend its rally further with Rs 85,000 as the next major target; however, it is looking expensive, so caution is warranted.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tToday’s US data, ISM services and ADP employment change, will be crucial for the metal.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSupport is at $2,800 (Rs 82,450)/$2779 (Rs 81,800). Resistance is at $2,850 (Rs 83,900)/$2,888 (Rs 85,000).</div>\n<small class=\"brtag\"> </small>\n<div>\n<em><strong>(Disclaimer: Praveen Singh is associate VP of fundamental currencies and commodities, Mirae Asset Sharekhan. Views expressed are his own.)</strong></em></div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 15:15:30",
            "link": "https://www.business-standard.com/markets/news/gold-strategy-on-february-5-support-at-rs-82-450-resistance-at-rs-85-000-125020500590_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500590"
        },
        {
            "title": "Govt's cash deficit eases after RBI takes aggressive liquidity measures",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>By Bhaskar Dutta</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe cash crunch plaguing India’s banking system has more than halved after the central bank took aggressive liquidity injection measures amid faltering economic growth.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tDeficit liquidity, or the amount that lenders borrow from the Reserve Bank of India, stood at Rs 66,040 crore ($7.6 billion) as on Feb. 4, down from Rs 2.2 trillion on Jan. 30, according to a Bloomberg Economics index. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe cash injection has also led to a decline in the weighted average call rate, which represents banks’ overnight borrowing costs. The rate has dropped from a high of 6.88 per cent last month to align with the benchmark policy repurchase rate of 6.50 per cent. Local swaps have also eased, with the one-year rate falling by as much as 26bps below the RBI’s key rate. \r\n\t<div style=\"float:left\">\n<span class=\"fixed-height-container\"><span style=\"box-sizing:border-box;display:block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:absolute;top:0;left:0;bottom:0;right:0\"><img alt=\"Charts\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style='position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;background-size:cover;background-position:0% 0%;filter:blur(20px);background-image:url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNk0AAAAC4AKhMfIC0AAAAASUVORK5CYII=\")'/><noscript><img alt=\"Charts\" class=\"zoomimg\" data-nimg=\"fill\" decoding=\"async\" loading=\"lazy\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/05/full/1738739381-9542.png?im=Resize=(640,480)\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/></noscript></span></span></div></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFactors including a pick-up in government spending at the start of the month have also helped shrink the cash shortage, which had risen to Rs 3 trillion late last month, the highest in at least 14 years. The central bank’s dollar sales to protect the rupee from volatility, tax outflows and larger cash withdrawals from banks had added to the tight liquidity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\t“There is a need for further liquidity infusion because the pressure on the rupee continues, which necessitates some amount of RBI intervention and that is a drag on liquidity,” said Sakshi Gupta, an economist at HDFC Bank. “As we move into March, there will be tax outflows again.”</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tOf the $18 billion that the RBI plans to inject, it has so far pumped in a little more than $7 billion via open market bond purchases and a foreign-exchange swap. The central bank carried out the first tranche on Jan. 30.</div></div>",
            "pub_date": "2025-02-05 15:15:29",
            "link": "https://www.business-standard.com/economy/news/govt-s-cash-deficit-eases-after-rbi-takes-aggressive-liquidity-measures-125020500591_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500591"
        },
        {
            "title": "Silver trading strategy: Check Support, Resistance, other key levels here",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\n<strong>Silver: At a three-month high as the US Dollar Index and yields ease</strong></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Performance</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSilver, at the time of writing this report, was trading at $32.37, up around 2.40 per cent on the day, as it extended its this year’s rally to a 3-month high level. The MCX March contract was at Rs 95,800, up around 1.60 per cent.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe metal rallied as the US Dollar Index and yields fell on disappointing US JOLTs openings data. Risk-on sentiments, on the US postponing tariff hikes on Mexican and Canadian imports also weighed on the US Dollar Index.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSilver was up around 2.2 per cent last week as it gained for the second consecutive week. It is up nearly 12 per cent YTD.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Data roundup</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe US JOLTs openings (December) data, released on Tuesday, showed that job openings fell to 7.6 million in December from 8.16 million in November, lowest since September, though hiring held at 3.4 per cent, still around the lowest in a decade, while quit rate was steady at 2 per cent. Factory orders (December) came in at -.9 per cent (forecast -0.8 per cent), whereas durable goods orders (December final) at -2.2 per cent matched the forecast.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tS&amp;P US Global manufacturing PMI (January final) came in at 51.2 (forecast 50.10) whereas the US ISM manufacturing (January) with a reading of 50.90 (forecast 50) shot back into the expansion zone for the first time after 26 straight months of contraction. ISM prices paid at 54.90 were hotter than the estimate of 54.2 as ISM employment showed expansion with its reading of 50.30 topping the forecast of 52. Even new orders topped the estimate.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Upcoming data</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tToday's US data include ADP employment change (January), trade balance (December), S&amp;P global US services PMI (January final) and ISM services Index (January).</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>US Dollar and yields</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe 10-year US yields continue to swing largely between 4.50 per cent and 4.60 per cent. The yields, at the time of writing this report, were at 4.52 per cent, down nearly 2 bps on the day, as bond rallied on lacklustre US JOLTs openings data. The two-year yields have been moving largely in the 4.20 per cent-4.30 per cent since mid-January. The yields at 4.21 per cent were down around 1 per cent on the day.</div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe US Dollar Index, after surging to 109.88 on February 3 on trade war concerns, the highest level since January 13, has eased below 108 as tariffs on Canada and Mexico have been delayed by at least a month. The Index was at 107.99, down nearly 1 per cent on the day.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tImpact of advancement in solar panel technology and Trump’s policies on silver demand:</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTrump’s executive orders put the nonbinding Biden’s directive that 50 per cent of all new passenger cars and light trucks sold in 20230 should be zero-emission vehicles. His clean energy rollbacks jeopardize a popular federal income tax credit of up to $7,500 for the purchase of electric and plug-in hybrid cars. He has frozen the disbursement of funds set aside to build new EV chargers</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tNew technologies reducing the need for busbars in solar panels may also impact silver demand from the solar panel industry. However, demand for silver from other industries like AI is expected to keep the demand for the metal buoyant.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>ETF and COMEX inventory</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTotal known global silver ETF holdings fell to 703.763 MOz on January 3, a fresh cycle low. The ETFs have recorded a net outflow of nearly 13 MOz this year. COMEX Silver inventory stood at 350.059MOz as on January 3, highest since October 2021.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Outlook</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tPrecious metals have continued to extend their sharp rallies this year on rate cut notions, subdued yields, inability of the US Dollar to rise on a consistent basis and occasional safe haven demand on tariff concerns and other economic uncertainties. Apart from rate cut expectations, subdued yields and Dollar have also played the major roles in this ongoing rally.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSilver may rise to $33.45/$33.50 level in this rally; however, traders need to be cautious ahead of US ISM services, ADP employment change and the US nonfarm payroll data, more so as the rally is looking somewhat overdone.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSupport is at $31.77 (Rs 94,000) /$31.11 (Rs 92,000). Resistance is $32.55 (Rs 96,300)/$33.45 (Rs 99,000).</div>\n<small class=\"brtag\"> </small>\n<div>\n<em><strong>(Disclaimer: Praveen Singh is associate VP of fundamental currencies and commodities, Mirae Asset Sharekhan. Views expressed are his own.)</strong></em></div></div>",
            "pub_date": "2025-02-05 15:10:34",
            "link": "https://www.business-standard.com/markets/news/silver-trading-strategy-check-support-resistance-other-key-levels-here-125020500588_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500588"
        },
        {
            "title": "Birthday boy Ronaldo proclaims himself 'best footballer in history'",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div>\r\n\tAs <a href=\"https://www.business-standard.com/topic/cristiano-ronaldo\" target=\"_blank\">Cristiano Ronaldo</a> celebrates his 40th birthday, he remains as confident and self-assured as ever, reflecting the mindset that has propelled him throughout his legendary career. The former Real Madrid star, now playing in Saudi Arabia, will celebrate his 40th on Wednesday, and he has no doubt in his mind about his place in football history.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Ronaldo on being the greatest</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn an interview with Spanish television channel La Sexta, Ronaldo boldly proclaimed, *\"I am the greatest scorer in history.\"* The Portuguese icon further emphasized his exceptional abilities, saying, \"Although I am not left-footed, I am in the top 10 in history for goals scored with the left foot. These are numbers, I am the most complete player who has ever existed.\"</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRonaldo went on to highlight his versatility, stating, \"I play well with my head, I take good free kicks, I am fast, I am strong, I jump... I have never seen anyone better than me.\"<small class=\"brtagPara\"> </small> <strong>ALSO READ: <a href=\"https://www.business-standard.com/sports/football-news/winter-transfer-deadline-rashford-shifts-to-villa-nico-omar-joins-city-125020400500_1.html\">Winter transfer deadline: Rashford shifts to Villa; Nico, Omar joins City</a></strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRonaldo holds numerous records in men's international soccer, including the most appearances (217) and the most goals (135). His continued dominance in the sport has made him a household name, and he has often reiterated that he believes he will retire as the greatest player in football history.</div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>The Messi-Ronaldo debate</strong></div><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tWhile Ronaldo has frequently praised <a href=\"https://www.business-standard.com/topic/lionel-messi\" target=\"_blank\">Lionel Messi</a>, he has never shied away from asserting his own superiority in the ongoing debate over who is the best. In past discussions, he acknowledged Messi’s brilliance but ultimately stood firm in his own belief that he surpasses everyone else.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRonaldo's most recent comments have sparked reactions within the football community. Javier Mascherano, a former teammate of Messi and now his coach at Inter Miami, responded to Ronaldo’s words by stating, *\"I have a lot of respect for Cristiano and I don’t have to analyze his opinions. It's what he thinks. I have my own thoughts, and it isn’t that.\"*</div></div>",
            "pub_date": "2025-02-05 15:10:34",
            "link": "https://www.business-standard.com/sports/football-news/birthday-boy-ronaldo-proclaims-himself-best-footballer-in-history-125020500572_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500572"
        },
        {
            "title": "US postal service suspends incoming packages from China, Hong Kong",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe US Postal Service said it would temporarily suspend international parcels from China and Hong Kong, after President Donald Trump shut a trade loophole this week that has been used to ship low-value packages duty-free from China.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe Trump administration imposed an additional 10 per cent tariff on Chinese goods that came into effect on Tuesday and moved to close the \"de minimis\" loophole that allows importers and US shoppers to avoid paying tariffs for packages worth less than $800.<small class=\"brtag\"> </small></div>\n<div>\r\n\tUSPS said the change will not impact the flow of letters and 'flats' from China and Hong Kong. It did not immediately comment on whether this was tied to Trump's change to ending de minimis shipments from China and other countries.<small class=\"brtag\"> </small></div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\r\n\tFast-fashion retailer Shein and online dollar-store Temu, both of which sell products ranging from toys to smartphones, have grown rapidly in the US thanks in part to the de minimis exemption.<small class=\"brtag\"> </small></div>\n<div>\r\n\tThe two firms together likely accounted for more than 30 per cent of all packages shipped to the United States each day under the de minimis provision, the US congressional committee on China said in a June 2023 report.<small class=\"brtag\"> </small></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<div>\r\n\tNearly half of all packages shipped under de minimis come from China, according to the report.<small class=\"brtag\"> </small></div>\n<div>\r\n\tShein and Temu did not immediately reply to a request for comment.<small class=\"brtag\"> </small></div>\n<div>\r\n\tTrump imposed the extra tariff on Chinese goods after repeatedly warning Beijing it was not doing enough to halt the flow of illicit drugs into the United States, particularly fentanyl.<small class=\"brtagPara\"> </small>\n<strong><em>(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</em></strong></div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div></div>",
            "pub_date": "2025-02-05 15:05:28",
            "link": "https://www.business-standard.com/world-news/us-postal-service-suspends-incoming-packages-from-china-hong-kong-125020500584_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500584"
        },
        {
            "title": "Remember those behind polluted air, dirty water in Delhi: Rahul Gandhi",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tIn a swipe at the AAP, Congress leader Rahul Gandhi on Wednesday urged people of Delhi to remember while voting who committed the biggest scam in Delhi by talking about practising clean politics.</p>\n<p>\r\n\tThe former Congress president said people's vote for his party will protect their rights, strengthen the Constitution and put Delhi back on the path of progress.</p>\n<p>\r\n\tGandhi cast his ballot in the morning in the New Delhi constituency at the Nirman Bhawan polling centre.</p>\n<p>\r\n\tWith voting underway for the Delhi Assembly polls, the Leader of Opposition in the Lok Sabha issued an appeal to voters on X.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\t\"My dear brothers and sisters of Delhi. I appeal to all of you to go and vote today. Your every vote for the Congress will protect your rights, strengthen the Constitution and put Delhi back on the path of progress,\" he said in his post in Hindi.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\t\"While voting, remember who is responsible for polluted air, dirty water, and broken roads. Who committed the biggest scam in Delhi by talking about practising clean politics?\" the former Congress chief said.</p>\n<p>\r\n\tVoting is underway for the high-octane Delhi Assembly elections, with the Aam Aadmi Party (AAP) eyeing a third straight term, banking on its governance record and welfare schemes, while the BJP and Congress look for a resurgence.</p>\n<p>\r\n\tPolling is underway at 13,766 stations across all 70 Assembly constituencies to decide the fate of 699 candidates in a contest that could reshape the political landscape of the capital.</p>\n<p>\r\n\tThe Congress, which ruled Delhi for 15 years until 2013, is striving to stage a comeback after failing to win a single seat in the last two elections.</p><p></p></div>",
            "pub_date": "2025-02-05 15:05:27",
            "link": "https://www.business-standard.com/elections/delhi-elections/remember-those-behind-polluted-air-dirty-water-in-delhi-rahul-gandhi-125020500334_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020500334"
        }
    ]
}