{
    "data": [
        {
            "title": "Israel to send team to Qatar to discuss 2nd phase of ceasefire with Hamas",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tFollowing Prime Minister Benjamin Netanyahu's discussions in Washington, Israel will dispatch a working-level delegation to Qatar at the end of the week to address technical aspects of the second phase of a ceasefire with Hamas, the Prime Minister's office said on Tuesday morning.</p>\n<p>\r\n\tAfter returning from the US, Netanyahu will convene Israel's political-security cabinet to review the country's stance on the second phase of the deal, shaping future negotiations. Under the terms of the ceasefire that began on January 19, phase two talks were scheduled to begin on Monday. However, Netanyahu delayed the process until after his meeting with US National Security Advisor Mike Waltz and US President Donald Trump's special envoy to the Middle East, Steve Witkoff.<small class=\"brtag\"> </small></p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/world-news/six-injured-in-attack-in-israel-occupied-west-bank-assailant-killed-125020400722_1.html\" target=\"_blank\">Six injured in attack in Israel-occupied West Bank; assailant killed</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tAfter returning from the US, Netanyahu will convene Israel's political-security cabinet to review the country's stance on the second phase of the deal, shaping future negotiations.</p>\n<p>\r\n\tThe ongoing first phase of the ceasefire is supposed to see a total of 33 Israeli hostages freed over six weeks in exchange for hundreds of Palestinian terrorists imprisoned in Israel. The exact number will depend on how many are alive. So far, 18 hostages -- 13 Israelis and five Thais -- have been released.</p>\n<p>\r\n\tThe fate of the remaining 65 hostages will be determined by negotiations to begin on the 16th day of the ceasefire. Critics say the phased approach condemns hostages not freed in the beginning to open-ended captivity and undermines Israel's war gains.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tAt least 1,200 people were killed, and 252 Israelis and foreigners were taken hostage in Hamas's attacks on Israeli communities near the Gaza border on October 7. Of the 79 remaining hostages, 35 have been declared dead.</p><p></p></div>",
            "pub_date": "2025-02-04 18:45:27",
            "link": "https://www.business-standard.com/world-news/israel-to-send-team-to-qatar-to-discuss-2nd-phase-of-ceasefire-with-hamas-125020400786_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400786"
        },
        {
            "title": "Gold steady after record rally, investors cautious over Trump's tariffs",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tGold prices were steady on Tuesday, after a record rally in the previous session, with investors cautious about the potential effects of President Donald Trump's tariffs and ahead of the US economic data set to be released later this week.</p>\n<p>\r\n\tSpot gold gained 0.1 per cent to $2,809.91 per ounce as of 0927 GMT after hitting a record high of $2,830.49 on Monday. [GOL/]<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/markets/commodities/gold-dip-rs-10-silver-slides-rs-100-precious-metal-trading-at-rs-99-400-125020400089_1.html\" target=\"_blank\">Gold dip Rs 10, silver slides Rs 100; precious metal trading at Rs 99,400</a></strong></div>\n<p>\r\n\tUS gold futures fell 0.5 per cent to $2,843.50. Global bullion banks are flying gold to the US from hubs like Dubai and Hong Kong to take advantage of the high premium the US gold futures are commanding over spot prices on tariff concerns.</p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tChina imposed tariffs on US imports in a swift response to new US duties, escalating the trade war between the world's top two economies even as Trump offered reprieves to Mexico and Canada.</p>\n<p>\r\n\t\"It (Mexico and Canada tariff pause) does not remove the fact that global markets remain troubled by the prospect of trade wars that may boost prices while lowering the economic outlook,\" said Ole Hansen, head of commodity strategy at Saxo Bank.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tThe Trump administration's plans for trade tariffs come with inflation risks, three Fed officials warned on Monday, with one arguing that uncertainty over the outlook for prices calls for slower interest rate cuts than otherwise.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tBullion is traditionally considered a hedge against both inflation and geopolitical uncertainty, but higher rates reduce the non-yielding asset's appeal.</p>\n<p>\r\n\tMarkets will also closely watch key data this week, including US job openings expected at 1500 GMT, the ADP employment report on Wednesday and the payrolls report on Friday, along with speeches from several Fed officials.</p>\n<p>\r\n\t\"For now, the tariff focus supersedes any other development given their potential impact on inflation, growth and fiscal stability,\" Hansen said.</p>\n<p>\r\n\tSpot silver gained 0.1 per cent to $31.59 per ounce. Platinum shed 0.3 per cent to $962.00, and palladium fell 0.44 per cent to $1,004.86.</p><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tMarkets in top gold consumer China were closed for the Lunar New Year holidays and will resume trade on Wednesday.</p>\n<p>\r\n\t </p><p></p></div>",
            "pub_date": "2025-02-04 18:45:27",
            "link": "https://www.business-standard.com/markets/commodities/gold-steady-after-record-rally-investors-cautious-over-trump-s-tariffs-125020400804_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400804"
        },
        {
            "title": "India decides it will not operate a third aircraft carrier. Here is why",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Indian Navy has shelved its plans to operate three aircraft carriers simultaneously and is instead prioritising the development of a second indigenous aircraft carrier (IAC) as a future replacement for INS Vikramaditya, <em>ThePrint</em> reported on Monday. The report stated that the government does not support the Navy’s stance on maintaining a fleet of three aircraft carriers, which would have ensured that at least two remain operational at all times, even when one undergoes refits. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis development follows reports from late last year suggesting that China is advancing its nuclear-powered aircraft carrier programme, with indications that its fourth carrier could feature nuclear propulsion.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to <em>ThePrint</em>, the Navy’s decision follows a shift in its naval policy, which had originally aimed to establish a three-carrier force. Multiple naval chiefs in the past, including the immediate predecessor of the current naval chief, Admiral Hari Kumar, had advocated for the addition of a third aircraft carrier.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/navy-s-r-day-tableau-showcases-3-newly-commissioned-frontline-combatants-125012600189_1.html\" target=\"_blank\">Navy's R-Day tableau showcases 3 newly commissioned frontline combatants</a></strong></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, reports suggest that the government has opposed the Navy’s stance since at least 2020, advocating instead for a greater emphasis on submarines rather than aircraft carriers. Former Chief of Defence Staff General Bipin Rawat had publicly expressed scepticism about the necessity of a three-carrier fleet, referring to them as \"sitting ducks\".</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFormer Navy Chief Admiral Hari Kumar had reportedly proposed placing a repeat order for INS Vikrant, a 45,000-tonne aircraft carrier. However, previous naval chiefs had advocated for a larger carrier capable of accommodating more fighter jets, arguing that such a platform would offer greater operational advantages in warfare compared to a carrier with a limited aircraft complement.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSources within the defence establishment told <em>ThePrint</em> that INS Vikramaditya, a refurbished Russian aircraft carrier, will need to be phased out within the next 10–12 years.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBuilding an aircraft carrier requires approximately 10 to 12 years from the approval stage. According to the sources, many within the Indian Navy believe that the second indigenous aircraft carrier should be viewed as a replacement for Vikramaditya, rather than as an additional carrier.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/india-building-60-navy-ships-likely-to-see-rs-3-trillion-return-modi-125011501280_1.html\" target=\"_blank\">India building 60 Navy ships, to generate Rs 3 trillion in returns: Modi</a></strong></div></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn May 2024, Defence Minister Rajnath Singh reportedly announced that India would soon commence construction of its third aircraft carrier, which is expected to replace INS Vikramaditya, as indicated in <em>ThePrint</em> report. Singh had made these remarks in the context of the Navy’s pending proposal to build another indigenous aircraft carrier of similar size to INS Vikrant, a 45,000-tonne warship commissioned in September 2022.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCurrently, the Indian Navy operates two 45,000-tonne aircraft carriers: INS Vikramaditya and INS Vikrant. Both carriers are conventionally powered and utilise ski-jump ramps for aircraft take-offs. INS Vikrant, India's first indigenous carrier, was built by Cochin Shipyard Ltd, while INS Vikramaditya, originally from Russia, has been in service since 2014.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEach carrier can accommodate 25-30 fixed-wing aircraft along with 10 helicopters. If the proposed third aircraft carrier is of the same size and features conventional propulsion like INS Vikrant, it is expected to have a similar air wing capacity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, a project study initiated during former Defence Minister Manohar Parrikar’s tenure envisioned the second indigenous aircraft carrier as a 65,000-tonne CATOBAR (Catapult Assisted Take-Off Barrier Arrested Recovery) warship with electric propulsion. The proposed carrier was designed to accommodate a 54-fighter air wing, with considerations reportedly given to nuclear propulsion and electromagnetic catapults. However, current plans indicate that the second indigenous carrier, and India’s third overall, will be conventionally powered.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhat’s Behind the Decision to Drop a Three-Carrier Fleet?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRather than expanding the aircraft carrier fleet, the government reportedly prioritises sea denial capabilities through submarines. Aircraft carriers are seen as capital-intensive assets, not only due to their own costs but also because of the expenses associated with the Carrier Battle Group and fighter aircraft. Additionally, China has developed long-range anti-ship ballistic missiles designed to target aircraft carriers, specifically those of the United States, which are significantly larger and more heavily defended than their Indian counterparts.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/mdl-thyssenkrupp-invited-for-rs-70-000-cr-submarine-deal-negotiations-125012301587_1.html\" target=\"_blank\">MDL, ThyssenKrupp invited for Rs 70,000 cr submarine deal negotiations</a></strong></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe government has already revised the 30-year submarine-building programme. Instead of the originally planned 24 conventional submarines, the sanctioned fleet now consists of 18 diesel-electric submarines and six nuclear-powered attack submarines (SSNs), in addition to the ongoing nuclear ballistic missile submarine (SSBN) programme.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhat Do We Know About China's Nuclear-Powered Carrier Plans?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn November 2024, reports suggested that China is advancing its nuclear-powered aircraft carrier plans. Among these, the <em>South China Morning Post</em> highlighted renewed interest in Beijing’s global naval ambitions, citing reports of a prototype nuclear reactor under development.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUnlike conventional carriers, nuclear-powered aircraft carriers can operate for extended durations without refuelling, granting them greater operational range and the ability to carry more fuel and weapons for their aircraft.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChina’s pursuit of a nuclear-powered carrier has long been speculated upon, with analysts viewing it as a crucial step in the People’s Liberation Army (PLA) Navy’s quest for blue-water capabilities. The PLA Navy, already the world’s largest, aims to operate six aircraft carriers by 2035 as part of its modernisation drive.</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIts most recent and third aircraft carrier, the Fujian, began sea trials in 2024 and is the first non-US carrier to feature an electromagnetic catapult launch system, allowing for higher-frequency aircraft launches.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Fujian’s successor, tentatively referred to as Type 004, is expected to be of similar or larger size. If the nuclear reactor project proves successful, future Chinese aircraft carriers are expected to be entirely nuclear-powered.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn March 2024, the political commissar of the PLA Navy confirmed that work on a fourth aircraft carrier was underway, with an announcement regarding its potential nuclear propulsion expected soon.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe United States (US) currently operates 11 nuclear-powered aircraft carriers, while France has a single nuclear-powered carrier, the Charles de Gaulle. All of China’s existing carriers are conventionally powered, though the Fujian is larger and more advanced than its Chinese predecessors and Indian counterparts.</div></div>",
            "pub_date": "2025-02-04 18:40:29",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/india-decides-it-will-not-operate-a-third-aircraft-carrier-here-is-why-125020400853_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400853"
        },
        {
            "title": "Vivo reveals V50 smartphone's design and more details: Here is how it looks",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tChina's Vivo has revealed the first look of its upcoming V50 smartphone, which has been confirmed to launch in India soon. The company has also confirmed the colour options for the Vivo V50 and a few specification details such as the battery capacity and more. Here are the details.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Vivo V50: Design and details</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tVivo has revealed that the V50 smartphone will be available in Titanium Gray, Rose Red and Starry Night colourways. The company said that the Rose Red variant of the smartphone will offer warm tones and a luxurious feel. On the other hand, the Starry Night colourway of the Vivo V50 introduces \"3D-Star technology\" which will enable the back panel of the smartphone to interact with environmental lighting. Vivo said that under direct sunlight or focused indoor lighting, the panel shimmers like a star-studded night sky. This effect will be dynamic, elongating holographic dots into meteor-like streaks as the user moves their wrist.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Vivo V50 smartphone will feature a quad-curved display on the front, which the company said will offer an edge-to-edge screen. The company also said that it will be the country's slimmest smartphone within the 6000mAh battery category, measuring as low as 7.39mm.</div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Vivo V50: What to expect</strong></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tVivo V50 is expected to feature a camera system co-developed by the German optics brand Zeiss, featuring a 50MP primary and a 50MP ultra-wide-angle camera. The quad-curved display on the smartphone is expected to be a 6.7-inch panel of 120Hz refresh rate. As for performance, the smartphone will likely be powered by the Qualcomm Snapdragon 7 Gen three chip, coupled with up to 12GB RAM.</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\n<strong>Vivo V50: Expected specifications</strong></div>\n<ul>\n<li>\r\n\t\tDisplay: 6.7-inch quad-curved AMOLED, 120Hz refresh rate</li>\n<li>\r\n\t\tProcessor: Qualcomm Snapdragon 7 Gen 3</li>\n<li>\r\n\t\tRAM: up to 12GB</li>\n<li>\r\n\t\tStorage: up to 512GB</li>\n<li>\r\n\t\tRear camera: 50MP primary + 50MP ultra-wide</li>\n<li>\r\n\t\tFront camera: 50MP</li>\n<li>\r\n\t\tBattery: 6000mAh</li>\n<li>\r\n\t\tCharging: 90W wired charging</li>\n<li>\r\n\t\tOS: Android 15-based FunTouchOS 15</li>\n<li>\r\n\t\tProtection: IP68 + IP69</li>\n</ul></div>",
            "pub_date": "2025-02-04 18:40:29",
            "link": "https://www.business-standard.com/technology/tech-news/vivo-reveals-v50-smartphone-s-design-and-more-details-here-is-how-it-looks-125020400908_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400908"
        },
        {
            "title": "Govt framing schemes under export promotion mission for exporters: DGFT",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe government is framing schemes for MSME exporters to provide credit at easy terms, promote alternate financing instrument through strengthening factoring services for them, and offer assistance to deal with non-tariff measures imposed by other countries, an official said on Tuesday.</p>\n<p>\r\n\tThe commerce, MSME and finance ministries are working on these schemes, Director General of Foreign Trade (DGFT) Santosh Kumar Sarangi told reporters here.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/budget-allocation-for-export-promotion-schemes-dips-17-to-rs-2-250-cr-125020200361_1.html\" target=\"_blank\">Budget: Allocation for export promotion schemes dips 17% to Rs 2,250 cr</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tThese schemes are being formulated under the export promotion mission, announced in the Union Budget for 2025-26.</p>\n<p>\r\n\tThe schemes are expected to be rolled out in about 4-5 months, he said.<small class=\"brtag\"> </small></p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/budget-fy26-govt-to-launch-export-promotion-mission-worth-rs-2-250-crore-125020100843_1.html\" target=\"_blank\">Budget FY26: Govt to launch export promotion mission worth Rs 2,250 crore</a></strong></div>\n<p>\r\n\tThe government on February 1 announced the setting up of an Export Promotion Mission with an outlay of Rs 2,250 crore to promote the country's outbound shipments.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tFinance Minister Nirmala Sitharaman has said through the mission, the government will facilitate exporters to get easy access to credit, cross-border factoring support, and support MSMEs to tackle non-tariff measures in overseas markets.</p>\n<p>\r\n\tSarangi said that promoting factoring services would help reduce the dependence of exporters on banks.</p>\n<p>\r\n\tExport factoring services, a widely used financing instrument globally, have low adoption in India due to high factoring costs involving higher rates of interest, higher risk premiums and lack of parity with subvention schemes.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe cross-border factoring should attain a certain scale to reach about 3 per cent of merchandise exports (in line with the global average), he said.</p><p></p></div>",
            "pub_date": "2025-02-04 18:35:24",
            "link": "https://www.business-standard.com/budget/news/govt-framing-schemes-under-export-promotion-mission-for-exporters-dgft-125020400736_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400736"
        },
        {
            "title": "India decides it will not operate a third aircraft carrier. Here is why",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Indian Navy has shelved its plans to operate three aircraft carriers simultaneously and is instead prioritising the development of a second indigenous aircraft carrier (IAC) as a future replacement for INS Vikramaditya, <em>ThePrint</em> reported on Monday. The report stated that the government does not support the Navy’s stance on maintaining a fleet of three aircraft carriers, which would have ensured that at least two remain operational at all times, even when one undergoes refits. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis development follows reports from late last year suggesting that China is advancing its nuclear-powered aircraft carrier programme, with indications that its fourth carrier could feature nuclear propulsion.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to <em>ThePrint</em>, the Navy’s decision follows a shift in its naval policy, which had originally aimed to establish a three-carrier force. Multiple naval chiefs in the past, including the immediate predecessor of the current naval chief, Admiral Hari Kumar, had advocated for the addition of a third aircraft carrier.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/navy-s-r-day-tableau-showcases-3-newly-commissioned-frontline-combatants-125012600189_1.html\" target=\"_blank\">Navy's R-Day tableau showcases 3 newly commissioned frontline combatants</a></strong></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, reports suggest that the government has opposed the Navy’s stance since at least 2020, advocating instead for a greater emphasis on submarines rather than aircraft carriers. Former Chief of Defence Staff General Bipin Rawat had publicly expressed scepticism about the necessity of a three-carrier fleet, referring to them as \"sitting ducks\".</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFormer Navy Chief Admiral Hari Kumar had reportedly proposed placing a repeat order for INS Vikrant, a 45,000-tonne aircraft carrier. However, previous naval chiefs had advocated for a larger carrier capable of accommodating more fighter jets, arguing that such a platform would offer greater operational advantages in warfare compared to a carrier with a limited aircraft complement.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSources within the defence establishment told <em>ThePrint</em> that INS Vikramaditya, a refurbished Russian aircraft carrier, will need to be phased out within the next 10–12 years.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBuilding an aircraft carrier requires approximately 10 to 12 years from the approval stage. According to the sources, many within the Indian Navy believe that the second indigenous aircraft carrier should be viewed as a replacement for Vikramaditya, rather than as an additional carrier.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/india-building-60-navy-ships-likely-to-see-rs-3-trillion-return-modi-125011501280_1.html\" target=\"_blank\">India building 60 Navy ships, to generate Rs 3 trillion in returns: Modi</a></strong></div></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn May 2024, Defence Minister Rajnath Singh reportedly announced that India would soon commence construction of its third aircraft carrier, which is expected to replace INS Vikramaditya, as indicated in <em>ThePrint</em> report. Singh had made these remarks in the context of the Navy’s pending proposal to build another indigenous aircraft carrier of similar size to INS Vikrant, a 45,000-tonne warship commissioned in September 2022.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCurrently, the Indian Navy operates two 45,000-tonne aircraft carriers: INS Vikramaditya and INS Vikrant. Both carriers are conventionally powered and utilise ski-jump ramps for aircraft take-offs. INS Vikrant, India's first indigenous carrier, was built by Cochin Shipyard Ltd, while INS Vikramaditya, originally from Russia, has been in service since 2014.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEach carrier can accommodate 25-30 fixed-wing aircraft along with 10 helicopters. If the proposed third aircraft carrier is of the same size and features conventional propulsion like INS Vikrant, it is expected to have a similar air wing capacity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, a project study initiated during former Defence Minister Manohar Parrikar’s tenure envisioned the second indigenous aircraft carrier as a 65,000-tonne CATOBAR (Catapult Assisted Take-Off Barrier Arrested Recovery) warship with electric propulsion. The proposed carrier was designed to accommodate a 54-fighter air wing, with considerations reportedly given to nuclear propulsion and electromagnetic catapults. However, current plans indicate that the second indigenous carrier, and India’s third overall, will be conventionally powered.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhat’s Behind the Decision to Drop a Three-Carrier Fleet?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRather than expanding the aircraft carrier fleet, the government reportedly prioritises sea denial capabilities through submarines. Aircraft carriers are seen as capital-intensive assets, not only due to their own costs but also because of the expenses associated with the Carrier Battle Group and fighter aircraft. Additionally, China has developed long-range anti-ship ballistic missiles designed to target aircraft carriers, specifically those of the United States, which are significantly larger and more heavily defended than their Indian counterparts.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/mdl-thyssenkrupp-invited-for-rs-70-000-cr-submarine-deal-negotiations-125012301587_1.html\" target=\"_blank\">MDL, ThyssenKrupp invited for Rs 70,000 cr submarine deal negotiations</a></strong></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe government has already revised the 30-year submarine-building programme. Instead of the originally planned 24 conventional submarines, the sanctioned fleet now consists of 18 diesel-electric submarines and six nuclear-powered attack submarines (SSNs), in addition to the ongoing nuclear ballistic missile submarine (SSBN) programme.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhat Do We Know About China's Nuclear-Powered Carrier Plans?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn November 2024, reports suggested that China is advancing its nuclear-powered aircraft carrier plans. Among these, the <em>South China Morning Post</em> highlighted renewed interest in Beijing’s global naval ambitions, citing reports of a prototype nuclear reactor under development.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUnlike conventional carriers, nuclear-powered aircraft carriers can operate for extended durations without refuelling, granting them greater operational range and the ability to carry more fuel and weapons for their aircraft.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChina’s pursuit of a nuclear-powered carrier has long been speculated upon, with analysts viewing it as a crucial step in the People’s Liberation Army (PLA) Navy’s quest for blue-water capabilities. The PLA Navy, already the world’s largest, aims to operate six aircraft carriers by 2035 as part of its modernisation drive.</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIts most recent and third aircraft carrier, the Fujian, began sea trials in 2024 and is the first non-US carrier to feature an electromagnetic catapult launch system, allowing for higher-frequency aircraft launches.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Fujian’s successor, tentatively referred to as Type 004, is expected to be of similar or larger size. If the nuclear reactor project proves successful, future Chinese aircraft carriers are expected to be entirely nuclear-powered.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn March 2024, the political commissar of the PLA Navy confirmed that work on a fourth aircraft carrier was underway, with an announcement regarding its potential nuclear propulsion expected soon.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe United States (US) currently operates 11 nuclear-powered aircraft carriers, while France has a single nuclear-powered carrier, the Charles de Gaulle. All of China’s existing carriers are conventionally powered, though the Fujian is larger and more advanced than its Chinese predecessors and Indian counterparts.</div></div>",
            "pub_date": "2025-02-04 18:35:24",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/india-decides-it-will-not-operate-a-third-aircraft-carrier-here-is-why-125020400853_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400853"
        },
        {
            "title": "Govt framing schemes under export promotion mission for exporters: DGFT",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><p>\r\n\tThe government is framing schemes for MSME exporters to provide credit at easy terms, promote alternate financing instrument through strengthening factoring services for them, and offer assistance to deal with non-tariff measures imposed by other countries, an official said on Tuesday.</p>\n<p>\r\n\tThe commerce, MSME and finance ministries are working on these schemes, Director General of Foreign Trade (DGFT) Santosh Kumar Sarangi told reporters here.<small class=\"brtag\"> </small></p>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/budget-allocation-for-export-promotion-schemes-dips-17-to-rs-2-250-cr-125020200361_1.html\" target=\"_blank\">Budget: Allocation for export promotion schemes dips 17% to Rs 2,250 cr</a></strong><small class=\"brtag\"> </small></div>\n<p>\r\n\tThese schemes are being formulated under the export promotion mission, announced in the Union Budget for 2025-26.</p>\n<p>\r\n\tThe schemes are expected to be rolled out in about 4-5 months, he said.<small class=\"brtag\"> </small></p><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"/budget/news/budget-fy26-govt-to-launch-export-promotion-mission-worth-rs-2-250-crore-125020100843_1.html\" target=\"_blank\">Budget FY26: Govt to launch export promotion mission worth Rs 2,250 crore</a></strong></div>\n<p>\r\n\tThe government on February 1 announced the setting up of an Export Promotion Mission with an outlay of Rs 2,250 crore to promote the country's outbound shipments.</p><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<p>\r\n\tFinance Minister Nirmala Sitharaman has said through the mission, the government will facilitate exporters to get easy access to credit, cross-border factoring support, and support MSMEs to tackle non-tariff measures in overseas markets.</p>\n<p>\r\n\tSarangi said that promoting factoring services would help reduce the dependence of exporters on banks.</p>\n<p>\r\n\tExport factoring services, a widely used financing instrument globally, have low adoption in India due to high factoring costs involving higher rates of interest, higher risk premiums and lack of parity with subvention schemes.</p><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div>\n<p>\r\n\tThe cross-border factoring should attain a certain scale to reach about 3 per cent of merchandise exports (in line with the global average), he said.</p><p></p></div>",
            "pub_date": "2025-02-04 18:30:31",
            "link": "https://www.business-standard.com/budget/news/govt-framing-schemes-under-export-promotion-mission-for-exporters-dgft-125020400736_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400736"
        },
        {
            "title": "India decides it will not operate a third aircraft carrier. Here is why",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div id=\"between_article_content_1-0\" style=\"min-height:250px\"></div><div>\r\n\tThe Indian Navy has shelved its plans to operate three aircraft carriers simultaneously and is instead prioritising the development of a second indigenous aircraft carrier (IAC) as a future replacement for INS Vikramaditya, <em>ThePrint</em> reported on Monday. The report stated that the government does not support the Navy’s stance on maintaining a fleet of three aircraft carriers, which would have ensured that at least two remain operational at all times, even when one undergoes refits. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThis development follows reports from late last year suggesting that China is advancing its nuclear-powered aircraft carrier programme, with indications that its fourth carrier could feature nuclear propulsion.</div><span style=\"display:block;height:1px\"> </span><div id=\"between_article_content_2-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tAccording to <em>ThePrint</em>, the Navy’s decision follows a shift in its naval policy, which had originally aimed to establish a three-carrier force. Multiple naval chiefs in the past, including the immediate predecessor of the current naval chief, Admiral Hari Kumar, had advocated for the addition of a third aircraft carrier.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/navy-s-r-day-tableau-showcases-3-newly-commissioned-frontline-combatants-125012600189_1.html\" target=\"_blank\">Navy's R-Day tableau showcases 3 newly commissioned frontline combatants</a></strong></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, reports suggest that the government has opposed the Navy’s stance since at least 2020, advocating instead for a greater emphasis on submarines rather than aircraft carriers. Former Chief of Defence Staff General Bipin Rawat had publicly expressed scepticism about the necessity of a three-carrier fleet, referring to them as \"sitting ducks\".</div><div id=\"between_article_content_3-0\" style=\"min-height:250px\"></div><div class=\"mb-20\"><div class=\"latestnews_stryalsoread__HlMna\"></div></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tFormer Navy Chief Admiral Hari Kumar had reportedly proposed placing a repeat order for INS Vikrant, a 45,000-tonne aircraft carrier. However, previous naval chiefs had advocated for a larger carrier capable of accommodating more fighter jets, arguing that such a platform would offer greater operational advantages in warfare compared to a carrier with a limited aircraft complement.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tSources within the defence establishment told <em>ThePrint</em> that INS Vikramaditya, a refurbished Russian aircraft carrier, will need to be phased out within the next 10–12 years.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBuilding an aircraft carrier requires approximately 10 to 12 years from the approval stage. According to the sources, many within the Indian Navy believe that the second indigenous aircraft carrier should be viewed as a replacement for Vikramaditya, rather than as an additional carrier.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/india-building-60-navy-ships-likely-to-see-rs-3-trillion-return-modi-125011501280_1.html\" target=\"_blank\">India building 60 Navy ships, to generate Rs 3 trillion in returns: Modi</a></strong></div></div><div id=\"between_article_content_4-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn May 2024, Defence Minister Rajnath Singh reportedly announced that India would soon commence construction of its third aircraft carrier, which is expected to replace INS Vikramaditya, as indicated in <em>ThePrint</em> report. Singh had made these remarks in the context of the Navy’s pending proposal to build another indigenous aircraft carrier of similar size to INS Vikrant, a 45,000-tonne warship commissioned in September 2022.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tCurrently, the Indian Navy operates two 45,000-tonne aircraft carriers: INS Vikramaditya and INS Vikrant. Both carriers are conventionally powered and utilise ski-jump ramps for aircraft take-offs. INS Vikrant, India's first indigenous carrier, was built by Cochin Shipyard Ltd, while INS Vikramaditya, originally from Russia, has been in service since 2014.</div><div id=\"between_article_content_5-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tEach carrier can accommodate 25-30 fixed-wing aircraft along with 10 helicopters. If the proposed third aircraft carrier is of the same size and features conventional propulsion like INS Vikrant, it is expected to have a similar air wing capacity.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tHowever, a project study initiated during former Defence Minister Manohar Parrikar’s tenure envisioned the second indigenous aircraft carrier as a 65,000-tonne CATOBAR (Catapult Assisted Take-Off Barrier Arrested Recovery) warship with electric propulsion. The proposed carrier was designed to accommodate a 54-fighter air wing, with considerations reportedly given to nuclear propulsion and electromagnetic catapults. However, current plans indicate that the second indigenous carrier, and India’s third overall, will be conventionally powered.</div><div id=\"between_article_content_6-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhat’s Behind the Decision to Drop a Three-Carrier Fleet?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tRather than expanding the aircraft carrier fleet, the government reportedly prioritises sea denial capabilities through submarines. Aircraft carriers are seen as capital-intensive assets, not only due to their own costs but also because of the expenses associated with the Carrier Battle Group and fighter aircraft. Additionally, China has developed long-range anti-ship ballistic missiles designed to target aircraft carriers, specifically those of the United States, which are significantly larger and more heavily defended than their Indian counterparts.<small class=\"brtagPara\"> </small>\n<div>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/external-affairs-defence-security/news/mdl-thyssenkrupp-invited-for-rs-70-000-cr-submarine-deal-negotiations-125012301587_1.html\" target=\"_blank\">MDL, ThyssenKrupp invited for Rs 70,000 cr submarine deal negotiations</a></strong></div>\n</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe government has already revised the 30-year submarine-building programme. Instead of the originally planned 24 conventional submarines, the sanctioned fleet now consists of 18 diesel-electric submarines and six nuclear-powered attack submarines (SSNs), in addition to the ongoing nuclear ballistic missile submarine (SSBN) programme.</div><div id=\"between_article_content_7-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<h2>\r\n\tWhat Do We Know About China's Nuclear-Powered Carrier Plans?</h2>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn November 2024, reports suggested that China is advancing its nuclear-powered aircraft carrier plans. Among these, the <em>South China Morning Post</em> highlighted renewed interest in Beijing’s global naval ambitions, citing reports of a prototype nuclear reactor under development.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tUnlike conventional carriers, nuclear-powered aircraft carriers can operate for extended durations without refuelling, granting them greater operational range and the ability to carry more fuel and weapons for their aircraft.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tChina’s pursuit of a nuclear-powered carrier has long been speculated upon, with analysts viewing it as a crucial step in the People’s Liberation Army (PLA) Navy’s quest for blue-water capabilities. The PLA Navy, already the world’s largest, aims to operate six aircraft carriers by 2035 as part of its modernisation drive.</div><div id=\"between_article_content_8-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIts most recent and third aircraft carrier, the Fujian, began sea trials in 2024 and is the first non-US carrier to feature an electromagnetic catapult launch system, allowing for higher-frequency aircraft launches.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe Fujian’s successor, tentatively referred to as Type 004, is expected to be of similar or larger size. If the nuclear reactor project proves successful, future Chinese aircraft carriers are expected to be entirely nuclear-powered.</div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn March 2024, the political commissar of the PLA Navy confirmed that work on a fourth aircraft carrier was underway, with an announcement regarding its potential nuclear propulsion expected soon.</div><div id=\"between_article_content_9-0\" style=\"min-height:250px\"></div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe United States (US) currently operates 11 nuclear-powered aircraft carriers, while France has a single nuclear-powered carrier, the Charles de Gaulle. All of China’s existing carriers are conventionally powered, though the Fujian is larger and more advanced than its Chinese predecessors and Indian counterparts.</div></div>",
            "pub_date": "2025-02-04 18:30:30",
            "link": "https://www.business-standard.com/external-affairs-defence-security/news/india-decides-it-will-not-operate-a-third-aircraft-carrier-here-is-why-125020400853_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400853"
        },
        {
            "title": "Budget 2025: Internship scheme gets massive fund infusion, to see changes",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tThe Prime Minister Internship Scheme was announced in July 2024 in a Budget that followed an employment generation theme. In the latest Budget presented for financial year 2026, allocation for the programme is up almost 27 times, from Rs 380 crore as per the revised estimates for FY25 to Rs 10,831 crore in FY26.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tThe jump suggests the scheme, in its current avatar, is still at the pilot stage but is expected to see a full-fledged launch in financial year 2026. However, some changes may be in the offing.  </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tIn order for the scheme to attract more applicants, the government</div></div>",
            "pub_date": "2025-02-04 18:25:32",
            "link": "https://www.business-standard.com/budget/news/budget-2025-internship-scheme-gets-massive-fund-infusion-to-see-changes-125020400843_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400843"
        },
        {
            "title": "Budget 2025: Outcomes keep outlay for drinking water and sanitation intact",
            "description": "<div id=\"parent_top_div\" style=\"margin:0 0\"><div>\r\n\tOne of the major focuses of the <a href=\"https://www.business-standard.com/about/who-is-narendra-modi\" target=\"_blank\">Narendra Modi</a>-led NDA government ever since it assumed office in 2014 has been on improving sanitation coverage in both rural and urban areas, as well as providing clean drinking water. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tTwo broad central schemes – Jal Jeevan Mission and the Swachh Bharat Mission-Gramin – which aim to improve both sanitation and water coverage in villages had assumed marquee status after PM Modi repeatedly referred to them in his election speeches and other discourses as pathways to transforming the lives of people in rural India. </div>\n<small class=\"brtag\"> </small>\n<div>\r\n\tBoth schemes have also shown impressive results</div></div>",
            "pub_date": "2025-02-04 18:25:32",
            "link": "https://www.business-standard.com/budget/news/budget-2025-outcomes-keep-outlay-for-drinking-water-and-sanitation-intact-125020400839_1.html",
            "source": "business-standard",
            "kind": 1,
            "language": "en",
            "id": "125020400839"
        }
    ]
}