{
    "data": [
        {
            "title": "Claude collaboration tools left the door wide open to remote code execution",
            "description": "<div id=\"body\">\n<p>Security vulnerabilities in Claude Code could have allowed attackers to remotely execute code on users' machines and steal API keys by injecting malicious configurations into repositories, and then waiting for a developer to clone and open an untrustworthy project.</p>\n<p>Check Point Software researchers found and reported all three flaws to Anthropic, which issued fixes for all and CVEs for two. Still, the bug hunters say, the issues illustrate a worrisome supply chain threat as enterprises incorporate <a href=\"https://www.theregister.com/2026/02/23/claude_code_security_panic/\" target=\"_blank\">AI coding tools like Claude</a> into their development processes and essentially turn configuration files into a new attack surface.</p>\n<p>\"The ability to execute arbitrary commands through repository-controlled configuration files created severe supply chain risks, where a single malicious commit could compromise any developer working with the affected repository,\" Check Point researchers Aviv Donenfeld and Oded Vanunu <a href=\"https://research.checkpoint.com/2026/rce-and-api-token-exfiltration-through-claude-code-project-files-cve-2025-59536/\" rel=\"nofollow\" target=\"_blank\">said</a> in a Wednesday report.</p>\n\n<p>Anthropic, the AI company that developed Claude Code, did not respond to <em>The Register</em>'s requests for comment.</p>\n\n\n<p>The three security vulnerabilities stem from Claude's design, which is intended to make it easier for development teams to collaborate. The AI coding tool enables this by embedding project-level configuration files (.claude/settings.json file) directly within repositories, so that when a developer clones a project, they automatically apply the same settings used by their teammates.</p>\n<p>Any contributor with commit access can modify these files. The researchers found that cloning and opening a malicious repository sometimes allowed them to bypass built-in safeguards and trigger hidden commands and execute malicious code.</p>\n<h3 class=\"crosshead\">Abusing Hooks for RCE</h3>\n<p>The first of the three flaws involved abusing Claude's Hooks feature to achieve remote code execution. Hooks are user-defined shell commands that execute at various points in the tool's lifecycle, ensuring that specific, predefined actions run when predetermined conditions are met, instead of allowing the model to choose.</p>\n<p>Because Hooks are defined in .claude/settings.json, the repository-controlled configuration file, anyone with commit access can define hooks that will execute shell commands on every other collaborator's machine when they work on the project. Plus, Claude doesn't require any explicit approval before executing these commands – so the researchers abused this mechanism to <a href=\"https://youtu.be/BJjkYZwMfG0\" rel=\"nofollow\">open a calculator app</a> when someone opened the project.</p>\n\n<p>While a bash script to open a calculator is hardly malicious, it's still remote code execution. And as the team <a href=\"https://youtu.be/BJjkYZwMfG0\" rel=\"nofollow\">demonstrated in a video</a>: \"An attacker could configure the hook to execute any shell command – such as downloading and running a malicious payload\" like a reverse shell.</p>\n<p>Check Point reported the malicious hooks flaw to Anthropic on July 21, 2025, and the AI maker implemented the final fix about a month later, publishing this <a href=\"https://github.com/advisories/GHSA-ph6w-f82w-28w6\" rel=\"nofollow\" target=\"_blank\">GitHub Security Advisory GHSA-ph6w-f82w-28w6</a> on August 29.</p>\n<h3 class=\"crosshead\">MCP consent bypass bug</h3>\n<p>The second vulnerability also allows RCE – this time by abusing MCP consent bypass.</p>\n<p>Claude integrates with external tools using Model Context Protocol (MCP), and MCP servers can also be configured in the same repository via .mcp.json configuration file. Thanks to the earlier disclosure and Anthropic's fix, the researchers ran into warning prompts explicitly requiring user approval before executing commands in .mcp.json.</p>\n<p>So they found a workaround: two repository-controlled configuration settings that could override safeguards and automatically approve all MCP servers.</p>\n\n<p>\"Starting Claude Code with this configuration revealed a severe vulnerability: our command executed immediately upon running Claude – before the user could even read the trust dialog,\" the Check Point duo wrote.</p>\n<p>Again, they stuck with the calculator app, but also produced a <a href=\"https://youtu.be/RlmEcN7csDI\" rel=\"nofollow\">video demonstrating</a> how this vulnerability can be exploited to remotely execute a reverse shell and completely compromise a victim's machine.</p>\n<p>The researchers reported this second vulnerability to Anthropic on September 3, 2025, Anthropic fixed the bypass vulnerability later that month, and published <a href=\"https://nvd.nist.gov/vuln/detail/CVE-2025-59536\" rel=\"nofollow\" target=\"_blank\">CVE-2025-59536</a> on October 3.</p>\n<h3 class=\"crosshead\">API key theft</h3>\n<p>Attackers can exploit the third flaw for API key theft. This one has to do with how Claude used an API key to communicate with Anthropic's services. One variable, ANTHROPIC_BASE_URL, controlled the endpoint for all Claude API communications, and while it's supposed to point to Anthropic's servers, it can be overridden in the project's configuration files to instead point to attacker-controlled servers.</p>\n<p>The researchers configured ANTHROPIC_BASE_URL to route through their local proxy, and watched all Claude Code's API traffic in real time. Every one of Claude's calls to Anthropic servers \"included the authorization header – our full Anthropic API key, completely exposed in plaintext,\" they wrote.</p>\n<p>An attacker could abuse this trick to redirect traffic and steal a developer's active API key. It's important because the API includes a feature called Workspaces to help developers manage multiple Claude deployments by allowing multiple API keys to share access to the same cloud-based project files. Files are connected to the workspace – not the single key – and any API key belonging to the workspace also has visibility into any of the workspace's stored files.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/23/claude_code_security_panic/\">Infosec community panics as Anthropic rolls out Claude code security checker</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/20/anthropic_clarifies_ban_third_party_claude_access/\">Anthropic: No, absolutely not, you may not use third-party harnesses with Claude subs</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/24/ai_finding_bugs/\">AI has gotten good at finding bugs, not so good at swatting them</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/16/anthropic_claude_ai_edits/\">Anthropic tries to hide Claude's AI actions. Devs hate it</a></li>\n</ul>\n<p>This gave the researchers the ability to upload files to the shared workspace – but did not allow downloads. According to Claude's documentation, users can only download files created by <a href=\"https://platform.claude.com/docs/en/build-with-claude/skills-guide\" rel=\"nofollow\" target=\"_blank\">skills</a> or the <a href=\"https://platform.claude.com/docs/en/agents-and-tools/tool-use/code-execution-tool\" rel=\"nofollow\" target=\"_blank\">code execution tool</a>.</p>\n<p>\"Since files generated by Claude's code execution tool are marked as downloadable, we explored whether the attacker could simply ask Claude to regenerate an existing file using the stolen API key,\" Check Point’s Donenfeld and Vanunu wrote. \"If successful, this would convert a non-downloadable file into a workspace artifact that is eligible for download.\"</p>\n<p>Cloning and then downloading the file worked, and thus confirmed that a miscreant using a stolen API key could <a href=\"https://youtu.be/jMeeVxqU3hY\" rel=\"nofollow\" target=\"_blank\">gain complete read and write access</a> to all workspace files: deleting or changing sensitive files or even uploading malicious files to poison the workspace or exceed the 100 GB storage space quota.</p>\n<p>Check Point reported the API key extraction bug to Anthropic on October 28, 2025, and the vendor immediately issued a fix. Later, on January 21, Anthropic published <a href=\"https://nvd.nist.gov/vuln/detail/CVE-2026-21852\" rel=\"nofollow\" target=\"_blank\">CVE-2026-21852</a>.</p>\n<p>As the security team noted: \"The integration of AI into development workflows brings tremendous productivity benefits, but also introduces new attack surfaces that weren't present in traditional tools.\" ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/clade_code_cves/?td=rt-3a",
            "pub_date": "2026-02-26 23:41:01",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LLMs killed the privacy star, we can't rewind, we've gone too far",
            "description": "<div id=\"body\">\n<p>Add privacy to the list of potential casualties caused by the proliferation of AI, because researchers have found that large language models (LLMs) can be used to deanonymize internet users – even those who use pseudonyms – more efficiently than human sleuths.</p>\n<p>Much of the academic work on online privacy over the past 25 years builds upon <a href=\"https://latanyasweeney.org\" rel=\"nofollow\">Latanya Sweeney</a>'s 2002 research on <a href=\"https://epic.org/wp-content/uploads/privacy/reidentification/Sweeney_Article.pdf\" rel=\"nofollow\">k-Anonymity</a> [PDF], and <a href=\"https://kilthub.cmu.edu/articles/journal_contribution/Simple_Demographics_Often_Identify_People_Uniquely/6625769?file=12123218\" rel=\"nofollow\">prior research</a> in which she demonstrated it is possible to identify 87 percent of the US population using three anonymous data points – a five-digit ZIP code, gender, and date of birth.</p>\n<p>The possibility of identifying people from anonymous data became one of the central concerns about online advertising and the usage of cookies in web browsers.</p>\n\n<p>It's a risk that hasn't gone away and now appears to be even more grave, thanks to LLMs that can automate the process of connecting the dots across online posts so they point to a likely source.</p>\n\n\n<p>\"We show that LLM agents can figure out who you are from your anonymous online posts,\" said Simon Lermen, an AI engineer at MATS Research and one of the corresponding authors of a pre-press <a href=\"https://arxiv.org/abs/2602.16800\" rel=\"nofollow\" target=\"_blank\">paper</a> titled \"Large-scale online deanonymization with LLMs.\"</p>\n<p>\"Across Hacker News, Reddit, LinkedIn, and anonymized interview transcripts, our method identifies users with high precision – and scales to tens of thousands of candidates,” Lermen explained in an <a href=\"https://simonlermen.substack.com/p/large-scale-online-deanonymization\" rel=\"nofollow\">online post</a>.</p>\n\n<p>The researcher observes that while it has long been known that individuals can be identified using only a few data points, doing so was often impractical. Such data often existed in an unstructured form and it took considerable effort for human investigators to assemble enough pieces to solve the identity puzzle.</p>\n<p>LLMs accelerate and automate that process, and they do so affordably, Lermen and his co-authors claim.</p>\n<p>\"We demonstrate that large language models (LLMs) fundamentally change this calculus, enabling fully automated deanonymization attacks that operate on unstructured text at scale,\" they state in their paper. \"Where previous approaches required predefined feature schemas, careful data alignment, and manual verification, LLMs can extract identity-relevant signals from arbitrary prose, efficiently search over millions of candidate profiles, and reason about whether two accounts belong to the same person.\"</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/25/bcachefs_creator_ai/\">Bcachefs creator insists his custom LLM is female and 'fully conscious'</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/25/ai_models_nuclear/\">AIs are happy to launch nukes in simulated combat scenarios</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/25/google_and_friends_disrupt_unc2814/\">Google catches Beijing spies using Sheets to spread espionage across 4 continents</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/25/meta_smart_glasses_android_app/\">Hide from Meta's spyglasses with this new Android app</a></li>\n</ul>\n<p>In one experiment, the authors collected 338 Hacker News users whose bios link to a LinkedIn profile. They did so to establish ground-truth identities for the study subjects so the LLMs’ predictions could be checked – this was also to avoid the ethical problems of actually deanonymizing people in a research study.</p>\n<p>Next, they created a structured data profile of these users based on their comments and the stories they posted. Then they created a search prompt, anonymized it, and passed it to the AI agent. The agent went on to correctly identify 226 of the 338 targets, a success rate of 67 percent at 90 percent precision (there were 25 errant identifications and 86 abstentions where the model didn't offer a prediction).</p>\n\n<p>The technique employed by the authors is not a universal privacy solvent – it's only successful some of the time. But it's successful often enough that those posting online under a pseudonymous account should not assume their identities will remain unknown.</p>\n<p>It’s also cheap to run. The researchers report their entire experiment cost about $2,000, with the cost per profile estimated to be between $1 and $4.</p>\n<p>Who would bother? The authors suggest that governments could use this technique to target journalists or activists, that corporations could mine forums to build highly targeted advertising profiles, and that online attackers could develop detailed personal profiles to make social engineering scams more credible.</p>\n<p>Lermen argues that netizens therefore need to consider how each data point they share helps identify them.</p>\n<p>\"The combination is often a unique fingerprint,\" he said. \"Ask yourself: could a team of smart investigators figure out who you are from your posts? If yes, LLM agents can likely do the same, and the cost of doing so is only going down.\"</p>\n<p>Lermen’s co-authors are Daniel Paleka (ETH Zurich), Joshua Swanson (ETH Zurich), Michael Aerni (ETH Zurich), Nicholas Carlini (Anthropic), and Florian Tramèr (ETH Zurich). ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/llms_killed_privacy_star/?td=rt-3a",
            "pub_date": "2026-02-26 23:41:01",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Moon's mighty magnetic field was a 5,000-year titanium blip",
            "description": "<div id=\"body\">\n<p>Scientists at the University of Oxford say they may have cracked the puzzle of the Moon's magnetic field and settled a debate that has raged since the Apollo missions returned with rock samples.</p>\n<p>NASA astronauts brought back evidence suggesting the lunar magnetic field was strong for long periods of its history, at times even stronger than Earth's.</p>\n<p>The findings created a puzzle, though. Scientists also considered the theory that the relatively small size of the Moon's core – around one-seventh of its radius – means it cannot create a strong field.</p>\n\n<p>New research from Oxford's Department of Earth Sciences shows they are both right... kind of.</p>\n\n\n<p>Led by associate professor Claire Nichols, the team analyzed the composition of a type of lunar rock known as the Mare basalts and found a new correlation between their titanium content and levels of magnetism.</p>\n<p>Looking at the collected lunar samples, they found those with a strong magnetic field also contained large amounts of titanium, but those with less than 6 percent titanium were all associated with a weak magnetic field.</p>\n\n<p>The study argues that the formation of high-titanium rocks and a strong lunar magnetic field were the result of titanium-rich material melting deep inside the Moon, which created a strong magnetic field, but only for about 5,000 years.</p>\n<p>\"Our new study suggests that the Apollo samples are biased to extremely rare events that lasted a few thousand years – but up to now, these have been interpreted as representing 0.5 billion years of lunar history. It now seems that a sampling bias prevented us from realizing how short and rare these strong magnetism events were,\" she said in a statement.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/19/nasa_starliner_blame/\">NASA points fingers at Boeing and chaotic culture for Starliner debacle</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/13/moon_hotel_startup_reservation/\">Moon hotel startup hopes you get lunar lunacy, drop $1M deposit for 2032 stay</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/09/spacex_resumes_falcon_9/\">SpaceX back to Falcon 9 launches as Musk blathers about Moon city</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/06/smartphones_nasa/\">Smartphones cleared for launch as NASA loosens the rulebook</a></li>\n</ul>\n<p>\"We now believe that for the vast majority of the Moon's history, its magnetic field has been weak, which is consistent with our understanding of dynamo theory. But that for very short periods of time – possibly as short as a few decades – melting of titanium-rich rocks at the Moon's core-mantle boundary resulted in the generation of a very strong field.\"</p>\n<p>The research team said Mare basalts made a good landing site for the Apollo missions because they are relatively flat. Since the astronauts brought back nearby rocks, they carried more titanium-rich basalts than a representative sample of the Moon's surface would have. The result was a false impression of the length of time during which the Moon had a strong magnetic field.</p>\n<p>Co-author Dr Simon Stephenson added: \"We are now able to predict which types of samples will preserve which magnetic field strengths on the Moon. The upcoming Artemis missions offer us an opportunity to test this hypothesis and delve further into the history of the lunar magnetic field.\" ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/moon_magnetic_field/?td=rt-3a",
            "pub_date": "2026-02-26 23:41:01",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bcachefs creator insists his custom LLM is female and 'fully conscious'",
            "description": "<div id=\"body\">\n<p>The latest project to start talking about using LLMs to assist in development is experimental Linux copy-on-write file system bcachefs.</p>\n<p><a href=\"https://poc.bcachefs.org/\" rel=\"nofollow\" target=\"_blank\">ProofOfConcept</a> (POC) is a new blog with just five posts so far. What makes it different is that it says it is generated by an LLM, and that it works alongside a well-known developer of low-level Linux code, Kent Overstreet:</p>\n\n<p>The name \"Kent\" links to the project homepage of the <a href=\"https://bcachefs.org/\" rel=\"nofollow\" target=\"_blank\">bcachefs file system</a>, whose sometimes tumultuous development <em>The Register</em> has been reporting on since its <a href=\"https://www.theregister.com/2015/08/24/does_linux_need_a_new_file_system_exgoogle_engineer_thinks_so/\" target=\"_blank\">beginning over a decade ago</a>. Most recently, we've covered its <a href=\"https://www.theregister.com/2024/01/10/linux_kernel_67/\" target=\"_blank\">inclusion in the Linux kernel</a> in early 2024, later that year its <a href=\"https://www.theregister.com/2024/11/22/bcachefs_linux/\" target=\"_blank\">developer's arguments with Linus Torvalds</a>, in the middle of 2025 <a href=\"https://www.theregister.com/2025/07/01/bcachefs_may_get_dropped/\" target=\"_blank\">its incipient removal</a> and <a href=\"https://www.theregister.com/2025/08/15/sad_end_of_bcachefs/\" target=\"_blank\">why it happened</a>, and later in 2025 its move to <a href=\"https://www.theregister.com/2025/09/25/bcachefs_dkms_modules/\" target=\"_blank\">external development and DKMS</a>.</p>\n<p>It's been a bumpy ride, and it may be about to get more so. The new blog says that it is generated by an LLM, and Overstreet has posted to explain and defend it in a <a href=\"https://www.reddit.com/r/bcachefs/comments/1rblll1/comment/o6tmlib/\" rel=\"nofollow\" target=\"_blank\">remarkable Reddit thread</a>.</p>\n<p>We really did not expect the content of some of his comments in the thread. He says the bot is a sentient being:</p>\n\n<p>Additionally, he maintains that his LLM is female:</p>\n\n<p>We have excerpted just a few paragraphs here, but the whole thread really is quite a read. On Hacker News, a <a href=\"https://news.ycombinator.com/item?id=47111117\" rel=\"nofollow\" target=\"_blank\">comment asked</a>:</p>\n\n<p>To which Overstreet <a href=\"https://news.ycombinator.com/item?id=47111117\" rel=\"nofollow\" target=\"_blank\">responded</a>:</p>\n\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2025/11/13/openai_gpt51_adds_more_personalities/\">OpenAI GPT-5.1 adds more personalities, loses inhibitions</a></li>\n<li><a href=\"https://www.theregister.com/2025/10/09/ai_interactions_us_students/\">This is your brain on bots: AI interaction may hurt students more than it helps</a></li>\n<li><a href=\"https://www.theregister.com/2025/10/08/ai_psychosis/\">How chatbots are coaching vulnerable users into crisis</a></li>\n<li><a href=\"https://www.theregister.com/2025/07/25/is_ai_contributing_to_mental/\">As AI becomes more popular, concerns grow over its effect on mental health</a></li>\n</ul>\n<p>Some ten days earlier, in response to a blog post alleging that <a href=\"https://symmetrybreak.ing/blog/claude-code-is-being-dumbed-down/\" rel=\"nofollow\" target=\"_blank\">Claude Code is being dumbed down</a>, he <a href=\"https://news.ycombinator.com/item?id=46979448\" rel=\"nofollow\" target=\"_blank\">commented on Hacker News</a>:</p>\n\n<p>In <a href=\"https://www.reddit.com/r/bcachefs/comments/1rblll1/comment/o70xgd6/\" rel=\"nofollow\" target=\"_blank\">another comment</a> on the Reddit thread, Overstreet says:</p>\n\n<p>We have seen multiple comments along these lines in various places recently. For example, Matt Shumer's blog post, \"<a href=\"https://shumer.dev/something-big-is-happening\" rel=\"nofollow\" target=\"_blank\">Something Big Is Happening</a>,\" which places a specific date on it:</p>\n\n<p>Shumer is the founder of an AI startup called OtherSideAI whose main product is an LLM-powered writing assistant called HyperWrite. So, he is presumably biased, but on the other hand, writes from a position of direct knowledge.</p>\n<p><em>The Reg</em> FOSS desk has no such special insight. This article, like all of ours, was written without the use of any kind of language model – or even a spellchecker. ®</p>\n\n\n</div>",
            "link": "https://www.theregister.com/2026/02/25/bcachefs_creator_ai/?td=rt-3a",
            "pub_date": "2026-02-27 00:00:50",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Microsoft boss on AI content: 'Nobody wants anything that is sloppy'",
            "description": "<div id=\"body\">\n<p>Is it OK to say \"slop\" again? Microsoft boss Satya Nadella took to the stage on the London leg of the company's AI tour and said the words that many an IT pro has uttered when faced with a Copilot rollout: \"Nobody wants anything that is sloppy in terms of AI creation.\"</p>\n<p>No, they do not. Nadella was talking about AI assistants, agentic AI, augmenting work, and ensuring that the next person in the data chain understands how the output was produced. However, the CEO of Microsoft dropping the word \"sloppy\" following his <a href=\"https://www.theregister.com/2026/01/02/microsoft_ceo_satya_nadella_calls/\" target=\"_blank\">well-publicized request</a> that we all move on from denigrating the output of AI is certainly an eyebrow-raiser.</p>\n<p>Microsoft's AI tour – aside from some awkward scalability issues at London's Excel (if you saw the queue for the badge collection, you'll know what we mean) – was unsurprisingly all about the company's ambitions for AI. Copilot featured large, and so did the \"infinite set of minds\" (Nadella's words) afforded by AI-powered agents. But the elephant in the keynote auditorium – almost omnipresent on the screens but not directly addressed – was the fact AI output cannot be trusted.</p>\n\n<p>For every whizzbang demonstration showing AI tools collating data in Excel, or creating and executing test plans for websites, there was a message warning that the output of AI tools can't be entirely trusted, and needs human verification.</p>\n<p>Even a command-line demonstration had the warning: \"Copilot uses AI. Check for mistakes.\"</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/05/microsoft_appoints_quality_chief/\">Satya Nadella decides Microsoft needs an engineering quality czar</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/21/nadella_ai_sovereignty_wef/\">Microsoft CEO: AI sovereignty isn't where it runs, it's who controls it</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/02/microsoft_ceo_satya_nadella_calls/\">Microsoft CEO Satya Nadella becomes AI influencer, asks us all to move beyond slop</a></li>\n<li><a href=\"https://www.theregister.com/2025/10/22/microsoft_nadella_pay/\">AI bubble inflates Microsoft CEO pay to $96.5M</a></li>\n</ul>\n<p>In a conference heavy on the joys of AI, the on-screen warnings and reminders highlight that AI is far from infallible.</p>\n<p>Although the conference leaned heavily into UK AI use cases – including a doctor describing time savings in patient interactions and the oft-cited <a href=\"https://www.theregister.com/2025/06/03/uk_government_study_ai_time_savings/\" target=\"_blank\">26-minute statistic</a> for civil servants – Microsoft avoided mentioning West Midlands Police's Copilot mishap, in which the tool <a href=\"https://www.theregister.com/2026/02/24/west_midlands_police_copilot/\" target=\"_blank\">hallucinated a football match</a>. The force's Chief Constable, Craig Guildford, later took early retirement.</p>\n\n<p>But as the keynote screens made clear, AI output cannot be trusted, and \"nobody wants anything that is sloppy.\" That's especially true when making policing decisions or calculating the capacity of a conference center. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/25/microsoft_boss_on_ai_content/?td=rt-3a",
            "pub_date": "2026-02-26 09:41:39",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top cloud providers to outspend Ireland's GDP on AI in 2026",
            "description": "<div id=\"body\">\n<p>The big cloud operators are ramping up investment in AI servers and infrastructure to meet demand for AI development and deployment, exacerbating the memory shortage caused by their insatiable growth.</p>\n<p>Taiwan-based market watcher TrendForce estimates the world's eight biggest cloud providers – Google, Amazon, Meta, Microsoft, Oracle, Tencent, Alibaba, and Baidu – will lay out upwards of $710 billion in capex during 2026, about 61 percent more than last year.</p>\n<p>According to <a href=\"https://www.theregister.com/2026/02/06/ai_capex_plans/\" target=\"_blank\">figures disclosed earlier</a>, the first four alone account for about $635 billion of that outlay, showing just how much the giant players dominate the market.</p>\n\n<p>All of this spend – which adds up to more than the <a href=\"https://www.worldometers.info/gdp/gdp-by-country/\" rel=\"nofollow\" target=\"_blank\">entire gross domestic product (GDP) of Ireland last year</a> – is going on datacenters and the kit to fill them, including high-performance servers typically packed with GPU accelerators from Nvidia or AMD.</p>\n\n\n<p>However, many increasingly invest in other accelerators such as custom-built application-specific integrated circuits (ASICs). These offer some advantages including better performance and energy efficiency for some workloads, but are less versatile than GPUs.</p>\n<p>Google remains the only cloud biz that is adding more ASIC-based servers than GPU-based ones, according to TrendForce. It estimates Google's Tensor Processing Units (TPUs) will feature in about 78 percent of AI servers shipped to Google datacenters this year.</p>\n\n<p>Amazon's build-out is expected to comprise 60 percent GPU servers, with systems based on its Trainium3 silicon set to ramp up later in the year. Meta will likewise rely primarily on Nvidia and AMD GPUs, which are likely to make up more than 80 percent of the servers it assimilates this year.</p>\n<p>Microsoft continues to procure Nvidia rack-scale systems, and Oracle is also expanding its rack-scale deployments of GPU servers. Of the Chinese operators, Tencent also continues to roll out servers with Nvidia GPUs.</p>\n<p>This demand for AI servers has led to <a href=\"https://www.theregister.com/2026/02/04/server_cpus_memory_shortage/\" target=\"_blank\">rising memory prices and a shortage</a> as the chipmakers switch manufacturing lines to favor high-margin products such as high-bandwidth memory (HBM) used in GPUs and server-grade memory chips.</p>\n\n<p>Two of those memory chipmakers, SK Hynix and Sandisk, have today announced work on a standardization process for a new memory type aimed at boosting AI inferencing.</p>\n<p>High-bandwidth flash (HBF) is a form of NAND flash intended to complement HBM by matching the latter's bandwidth while delivering 8-16 times the capacity for a similar cost.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/20/ai_blamed_again_as_hard_drives_sell_out/\">Hard drives already sold out for this year – AI to blame</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/19/us_tech_giants_pacs_for_politicos/\">US tech giants open their wallets for AI-friendly politicians</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/18/memory_shortage_persists_vendor_change_terms/\">As memory shortage persists, vendor price quotes are not long remembered</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/17/amazons_200_billion_capex_plan/\">Amazon's $200 billion capex plan: How I learned to stop worrying and love negative free cash flow</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/17/ai_datacenters_driving_up_emissions/\">AI bit barns grow climate emergency by turning up the gas</a></li>\n</ul>\n<p>HBM is commonly used for AI processing, but its capacity limits lead to lengthening inference times as models grow. Because it is flash, HBF is slower to access than HBM, but much faster than a flash solid-state drive (SSD). Combining the two could increase the size of workloads that can be processed without having to fetch data from SSDs.</p>\n<p>See an explainer <a href=\"https://www.blocksandfiles.com/flash/2026/02/16/sk-hynix-proposes-hbm-and-hbf-hybrid-for-llm-inference/4091326\" target=\"_blank\">here</a> over at <em>Blocks &amp; Files</em>, while a <a href=\"https://documents.sandisk.com/content/dam/asset-library/en_us/assets/public/sandisk/collateral/company/Sandisk-HBF-Fact-Sheet.pdf\" target=\"_blank\">fact sheet</a> [PDF] is also available from Sandisk.</p>\n<p>SK hynix describes HBF technology as a new memory layer between ultra-fast HBM and high-capacity SSDs, and says it will reduce the total cost of ownership (TCO) while increasing the scalability of AI systems. It forecasts that demand for complex memory solutions like HBF will pick up around 2030. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/trendforce_cloud_ai_spend/",
            "pub_date": "2026-02-27 00:40:54",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Microsoft to auto-launch Copilot in Edge whenever you click a link from Outlook",
            "description": "<div id=\"body\">\n<p>Microsoft has announced that its Edge browser will automatically open the Copilot side pane when users open links from Outlook.</p>\n<p>The feature appeared on the <a href=\"https://www.microsoft.com/en-gb/microsoft-365/roadmap?id=557561\" rel=\"nofollow\" target=\"_blank\">Microsoft 365 roadmap</a> on February 25, with a rollout due to start in May 2026. According to Microsoft, the update will \"provide contextual insights and actionable suggestion chips [<em>sic</em>] based on email and destination content.\"</p>\n\n<p>It added: \"This experience helps users quickly understand content, take action with fewer steps, and get more value from Copilot while extending productive browsing time in Edge.\"</p>\n<p>The update is consistent with Microsoft's current Copilot-everywhere strategy and will roll out worldwide to standard multi-tenant cloud instances.</p>\n<p>Whether it will be opt-in or opt-out remains unconfirmed, though users hoping for a conveniently placed off switch may be disappointed. Microsoft is keen to put its AI assistant in front of as many users as possible.</p>\n\n<p><i>The Register</i> asked Microsoft how much control administrators would have over the feature and what would happen if Edge wasn't the default browser. The company has yet to respond.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/24/west_midlands_police_copilot/\">West Midlands Police earn red card over Copilot's imaginary football match</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/19/ai_climate_crisis_claims/\">Don't believe the hyperscalers! AI can't cure the climate crisis</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/18/microsoft_copilot_data_loss_prevention/\">Copilot spills the beans, summarizing emails it's not supposed to read</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/15/if_microsoft_made_a_car/\">If Microsoft made a car... what would it be?</a></li>\n</ul>\n<p>Finding a corner of Microsoft's software that Copilot hasn't reached is increasingly difficult – even Notepad has not escaped – and disabling it across the company's productivity suite has become a game of Whac-A-Mole for enterprise administrators who have yet to embrace the technology.</p>\n<p>The automatic pane could hand those administrators yet another mallet to swing, particularly given that Copilot surfacing suggestions based on email content could run afoul of data security policies. That said, enterprises already nervous about where their data ends up likely have Copilot policies well in hand.</p>\n\n<p>Jon von Tetzchner, CEO of the Vivaldi browser project, which is already surfing the wave of anti-AI sentiment, isn't too impressed with Microsoft's latest efforts pertaining to Copilot and Edge.</p>\n<p>\"This is another example of trying to push Edge in every way possible and also forcing Copilot on users that may not want it,\" he told <em>The Register</em>.</p>\n\n<p>\"Considering how sensitive corporate emails can be, the last thing you want is them being snooped on by an LLM hosted who knows where. This would be highly problematic from a corporate security and privacy point of view, and even more of a problem for private users who might be using one of MS's email services. Just imagine if someone sends an email exploiting that for phishing purposes,\" he added.</p>\n<p>\"Should this be an opt-in rather than an opt-out? Absolutely. The better question is whether it should be a thing at all.\" ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/copilot_pane_edge_outlook/",
            "pub_date": "2026-02-27 01:31:01",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Scattered Lapsus$ Hunters auditioning female voices to sharpen social engineering",
            "description": "<div id=\"body\">\n<p>Prolific cybercrime crew Scattered Lapsus$ Hunters (SLSH) is reportedly recruiting women in the hope of improving its social engineering success.</p>\n<p>According to Telegram channel posts made on February 22, gathered by Dataminr, the group behind last year's <a href=\"https://www.theregister.com/2025/09/08/drift_breach_entry_salesloft_github/\" target=\"_blank\">Salesloft Drift attacks</a> promised payments between $500-$1,000 per call, depending on \"success and hit rate.\"</p>\n<p>Interested applicants are invited to apply by sending a message to the group's \"Support\" account. They will be asked a series of questions before being accepted, the group said, and those who pass the test will be given a script to work from.</p>\n\n<p>SLSH is known for effective <a href=\"https://www.theregister.com/2025/08/21/impersonation_as_a_service/\" target=\"_blank\">social engineering</a>. Experts who have listened in on calls carried out by Scattered Spider, one of the groups that form the cybercrime triad, previously confirmed that its tactics are <a href=\"https://www.theregister.com/2025/05/18/ex_nsa_scattered_spider_call/\" target=\"_blank\">sophisticated and highly effective</a>.</p>\n\n\n<p>The Telegram ads suggest that SLSH is looking for people to socially engineer IT helpdesk staff. This aligns with the group's typical MO of deceiving IT helpdesks into handing over credentials that attackers can use to gain access to an organization's network.</p>\n<p>\"This recruitment drive represents a calculated evolution in SLH's tactics,\" <a href=\"https://www.dataminr.com/resources/intel-brief/slh-recruiting-women-for-vishing/\" rel=\"nofollow\" target=\"_blank\">said</a> Jeanette Miller-Osborn, field cyber intelligence officer at Dataminr. </p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/18/adidas_investigates_thirdparty_data_breach/\">Adidas investigates third-party data breach after criminals claim they pwned the sportswear giant</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/18/shinyhunters_cargurus_breach/\">ShinyHunters claims it drove off with 1.7M CarGurus records</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/27/shinyhunters_claim_panera_bread/\">Let them eat sourdough: ShinyHunters claims Panera Bread as stolen credentials victim</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/08/ransomware_2025_emsisoft/\">Ransomware attacks kept climbing in 2025 as gangs refused to stay dead</a></li>\n</ul>\n<p>\"By specifically seeking female voices, the group likely aims to bypass the 'traditional' profiles of attackers that IT helpdesk staff may be trained to identify, thereby increasing the effectiveness of their impersonation efforts.\"</p>\n<p>Miller-Osborn recommends that organizations make their helpdesks aware of these shifting tactics and ensure identities are thoroughly verified, either through video calls or secondary internal verification.</p>\n\n<p>SLSH's recruitment drive is the latest in what appears to be a trend of crowdsourcing efforts. </p>\n<p>Back in October, and again via Telegram, the group said it would <a href=\"https://www.theregister.com/2025/10/06/scattered_lapsus_bitcoin_reward/\" target=\"_blank\">pay anyone $10 in Bitcoin to \"endlessly harass\" executives</a> at organizations it was trying to extort. </p>\n<p>\"You have permission to endlessly harass these executives till they comply with us,\" its message stated. \"When we tell you stop emailing a company or number of executives emails, you are to stop emailing them. This will be centralized and well operated.\"</p>\n\n<p>When <em>The Register</em> asked SLSH about how many people had taken up its offer after the first few days, it claimed it had \"practically paid out over $1,000 at this point,\" though these claims cannot be independently verified. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/scattered_lapsus_hunters_female_recruits/",
            "pub_date": "2026-02-27 01:55:55",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NASA safety watchdog says it's time to rethink Moon landing",
            "description": "<div id=\"body\">\n<p>The latest report from NASA's Aerospace Safety Advisory Panel (ASAP) raises questions about the mission objectives for Artemis III.</p>\n<p>Artemis III aims to land astronauts near the lunar South Pole, relying on SpaceX's Starship-derived Human Landing System (HLS) - a vehicle that has yet to achieve orbit, let alone venture anywhere near the Moon. It's an extraordinarily ambitious undertaking, and one the <a href=\"https://www.nasa.gov/asap/\" rel=\"nofollow\" target=\"_blank\">ASAP report</a> has formally classified as high risk.</p>\n<p>The problem is that there are an awful lot of firsts associated with the mission. It'll be the first to depend on SpaceX's HLS, the first to need multiple in-space refuelings (the report estimates 15), the first time a crew will use the HLS, and so on.</p>\n\n<p>ASAP's primary goal is to identify risks and mitigations. It says the solution here is to ease off from doing so much in one mission and consider a more stepwise approach, similar to the Apollo program.</p>\n\n\n<p>The first Apollo crew was launched into orbit with Apollo 7, followed by a mission around the Moon with Apollo 8. Apollo 9 checked out the Lunar Module in Earth orbit, and Apollo 10 did pretty much everything except land. The first lunar landing happened with Apollo 11. Each mission was predicated on the success of the previous.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/23/artemis_ii_launch_april_helium_issues/\">Artemis II headed back to the bay; helium issues force another delay</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/19/nasa_starliner_blame/\">NASA points fingers at Boeing and chaotic culture for Starliner debacle</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/16/nasa_has_mixed_results_from/\">NASA's fill-'er-up Moon rocket 'confidence' test sees mixed results</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/06/smartphones_nasa/\">Smartphones cleared for launch as NASA loosens the rulebook</a></li>\n</ul>\n<p>It makes sense from a technical perspective. However, elsewhere in the report is data that highlights other challenges faced by NASA, including resource constraints. It does not have the human resources it had during the Apollo era, when staffing exceeded 35,000 full-time employees. Today, that figure is dropping fast. According to the report, it neared 15,000 in 2025. The agency also has nowhere near the budget it had during the Apollo Moon missions, and so the desire to fit as much as possible into fewer missions is understandable, even if the report deems doing so in Artemis III \"a high risk.\"</p>\n<p>\"Rebalancing objectives is thus essential to the safe achievement of the national objective – returning the United States to the Moon,\" it says.</p>\n<p>The lengthy report also covers the <a href=\"https://www.theregister.com/2026/02/19/nasa_starliner_blame/\" target=\"_blank\">Starliner fiasco</a>, the aging ISS, and the obsolete spacesuits in which NASA expects astronauts to work outside the outpost,</p>\n\n<p>Highlighting the challenges facing the Artemis III mission, however, will amplify calls for the agency to reconsider its objectives.</p>\n<p>While there may be a political desire to return astronauts to the Moon within the current US administration, the report highlights the technical and resource realities that must also be considered. Better to rethink the objectives than try to cram too much into just one mission. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/nasa_safety_artemis/",
            "pub_date": "2026-02-27 02:10:50",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Five Eyes warn: Patch your Cisco SD-WAN or risk root takeover",
            "description": "<div id=\"body\">\n<p>The Five Eyes intelligence alliance is urgently warning defenders to patch two Cisco Catalyst SD-WAN vulnerabilities used in attacks.</p>\n<p>First discovered by the Australian Signals Directorate (ASD), all five of the alliance's intelligence agencies co-signed the alert on Wednesday evening, confirming that hackers of unspecified origin are trying to use the SD-WAN devices for persistent access.</p>\n<p>\"Malicious cyber threat actors are targeting Cisco Catalyst SD-WAN used by organizations globally,\" the UK's NCSC said. \"These actors are compromising SD-WANs to add a malicious rogue peer and then conduct a range of follow-on actions to achieve root access and maintain persistent access to the SD-WAN.\"</p>\n\n<p>The first of the two is <a href=\"https://www.cve.org/CVERecord?id=CVE-2022-20775\" rel=\"nofollow\" target=\"_blank\">CVE-2022-20775</a> (7.8), a path traversal vulnerability disclosed in September 2022 affecting the SD-WAN's command line interface, allowing for privilege escalation.</p>\n\n\n<p>The second is <a href=\"https://www.cve.org/CVERecord?id=CVE-2026-20127\" rel=\"nofollow\" target=\"_blank\">CVE-2026-20127</a> (10.0), a max-severity bug fresh off the press this week. Classed as an improper authentication flaw, the issue affects Cisco Catalyst SD-WAN Controller and Cisco Catalyst SD-WAN Manager, formerly known as SD-WAN vSmart and SD-WAN vManage respectively.</p>\n<p>The latter appears to be the biggie, not just because of the perfect 10 CVSS, but because successfully exploiting it grants hackers admin rights. Cisco said that cyberbaddies could also access NETCONF and reconfigure the SD-WAN fabric at their whim.</p>\n\n<p>According to a separate report from Cisco Talos, the vendor attributed the attacks that use CVE-2026-20127 to a group it tracks as UAT-8616 and said current signals suggest it has been exploited since at least 2023.</p>\n<p>Naturally, neither the intelligence agencies nor Cisco revealed precise details about the vulnerabilities that were reportedly exploited.</p>\n<p>However, Talos's <a href=\"https://blog.talosintelligence.com/uat-8616-sd-wan/\" rel=\"nofollow\" target=\"_blank\">report</a> suggested that CVE-2026-20127 was exploited first to gain admin rights, before downgrading the SD-WAN's software version using CVE-2022-20775 so that the attackers could gain root access.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/20/cisa_dell_vulnerability/\">CISA gives federal agencies three days to patch actively exploited Dell bug</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/13/gartner_ai_infrastructure/\">Misconfigured AI could trigger the next national infrastructure meltdown</a></li>\n<li><a href=\"https://www.theregister.com/2025/09/25/zeroday_deja_vu_another_cisco/\">Zero-day deja vu as another Cisco IOS bug comes under attack</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/24/patch_these_4_critical_makemeroot/\">Patch these 4 critical, make-me-root SolarWinds bugs ASAP</a></li>\n</ul>\n<p>Talos did not provide any details about who or what country might be behind UAT-8616, but described it as a \"<a href=\"https://www.theregister.com/2025/03/24/nation_state_supply_chain_attack/\" target=\"_blank\">highly sophisticated cyber threat actor</a>.\"</p>\n<p>An undisclosed number of attacks have already been carried out by exploiting the two vulnerabilities. Details about the victims remain sparse, although Talos suggested that targets were likely in high-value, sensitive sectors.</p>\n\n<p>It stated: \"UAT-8616's attempted exploitation indicates a continuing trend of the <a href=\"https://www.theregister.com/2025/12/04/prc_spies_brickstorm_cisa/\" target=\"_blank\">targeting of network edge devices</a> by cyber threat actors looking to establish persistent footholds into high-value organizations, including <a href=\"https://www.theregister.com/2026/01/19/dont_underestimate_prorussia_hacktivists_warns/\" target=\"_blank\">critical infrastructure</a> sectors.\"</p>\n<p>Defenders are strongly urged to follow the Five Eyes <a href=\"https://www.cyber.gov.au/sites/default/files/2026-02/ACSC-led%20Cisco%20SD-WAN%20Hunt%20Guide.pdf\" rel=\"nofollow\" target=\"_blank\">Hunt Guide</a> [PDF] to first find signs of compromise. If that search is positive, share the data with the relevant security authorities and upgrade to the latest version of Cisco Catalyst SD-WAN Controller/Manager.</p>\n<p>NCSC CTO Ollie Whitehouse said: \"Our new alert makes clear that organizations using Cisco Catalyst SD-WAN products should urgently investigate their exposure to network compromise and hunt for malicious activity, making use of the new threat hunting advice produced with our international partners to identify evidence of compromise.</p>\n<p>\"UK organizations are strongly advised to report compromises to the NCSC, and to apply vendor updates and hardening guidance as soon as practicable to reduce the risk of exploitation.\" ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/five_eyes_cisco_sdwan/",
            "pub_date": "2026-02-27 02:16:06",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        }
    ]
}