{
    "data": [
        {
            "title": "BOFH: Nobody would be stupid enough to go live with the mirror system, surely",
            "description": "<div id=\"body\">\n<p><img alt=\"BOFH logo telephone with devil's horns\" class=\"img_float_left\" src=\"https://regmedia.co.uk/2001/09/12/223.jpg\"/><span class=\"label\">Episode 4</span> I'm enjoying a takeaway lunch of onion bhajis in Mission Control when the Boss walks in, accompanied by the Head Beancounter.</p>\n<p>\"Brian's here to get some numbers from you,\" the Boss explains.</p>\n<p>\"Not the enormous primes upon which my banking encryption is based, I hope?\" I ask.</p>\n\n<p>\"?\" the Boss says, glazing over slightly. \"It's for the Board meeting this afternoon. He needs some numbers from you.\"</p>\n\n\n<p>\"Will 13 and 771 do?\"</p>\n<p>\"No. I'm after the time-saving figures that AI's been generating for you,\" the Head Beancounter says.</p>\n\n<p>\"And do you need the time-wasting figures as well?\"</p>\n<p>\"Time wasting?\"</p>\n<p>\"Yeah, you know, the hours of pointless questions that staff have been asking AI. How to meet the right person, how to fix their TV, what spices to add to drinking water to mask the flavor of thallium.\"</p>\n\n<p>\"I... er... \" the Head Beancounter blathers, no doubt making a mental note to bring his own water from now on.</p>\n<p>\"So just the time-saving numbers then?\"</p>\n<p>\"Yes.\"</p>\n<p>\"For the board meeting?\"</p>\n<p>\"Yes. I'm due in... 23 minutes.\"</p>\n<p>\"Yeah, I think I can generate them in about... maybe 17 minutes. &gt;tappity&lt; I could send them... straight to your phone if you want?\"</p>\n<p>\"Yes! Perfect. Now, if you'll excuse me...\"</p>\n<p>The Head Beancounter dashes off to the lift, bumping into the PFY on the way in.</p>\n<p>\"What's going on?\" the PFY asks.</p>\n<p>\"Operation Hoarse Pigeon is a go,\" I murmur.</p>\n<p>\"So it's happening then?\" the PFY says, moving to his desktop.</p>\n<p>\"Yep.\"</p>\n<p>\"What's happening? What's a horse pigeon?\" the Boss asks, confused.</p>\n<p>\"Hoarse Pigeon,\" I say, reviewing the camera footage from outside the Boss's office.</p>\n<p>\"Horse pigeon?\" the Boss repeats.</p>\n<p>\"It's one of our code words,\" the PFY says. \"In this case for 'an attempted coup.'\"</p>\n<p>\"What?\"</p>\n<p>\"Have a nice conversation with the Head Beancounter earlier?\" I ask, finding some relevant video footage.</p>\n<p>\"I... guess so – we just chatted about AI and how it helps us buy computer equipment, and how you're using it to write programs and things like that. He was very interested.\"</p>\n<p>\"Uh-huh.\"</p>\n<p>\"So what do you mean, attempted coup?\" the Boss asks.</p>\n<p>\"There's a board meeting today – and someone just happens to come asking for data at the last minute.\"</p>\n<p>\"So?\"</p>\n<p>\"Just after they've been chatting to you about how AI's basically made us redundant.\"</p>\n<p>\"I...\"</p>\n<p>\"And he looked smug. That's one coincidence too many.\"</p>\n<p>\"Aren't you being a bit... paranoid?\"</p>\n<p>\"I wasn't paranoid in 01 when the colored pencil office wanted to do their own IT purchasing because they used the most expensive desktops. I wasn't paranoid in 2010, 2014, and 2016 – when the Beancounters said we didn't need an IT support department.\"</p>\n<p>\"Really?\" the Boss asks, doubtfully.</p>\n<p>\"Yeah. See, we oversee a stack of IT purchases every year,\" I explain. \"We approve or reject hundreds of high-value items.\"</p>\n<p>\"And?\"</p>\n<p>\"And people don't like it. They don't want us rejecting their oddball orders – like a 'portable laptop' with an 85-inch screen.\"</p>\n<p>\"And everyone wants an 85-inch screen,\" the PFY says. \"But you don't need to worry about that. What you should be worried about is that you'll be the first to go if the coup is successful. They'll do your exit interview and portfolio handover in the lift on the way out of the building this afternoon.\"</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/13/bofh_2026_episode_3/\"><abbr title=\"Bastard Operator from Hell\">BOFH</abbr>: Loss adjuster discovers liability is a two-way street</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/30/bofh_2026_episode_2/\"><abbr title=\"Bastard Operator from Hell\">BOFH</abbr>: Eight pints of a lager and a management breakthrough</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/16/bofh_2026_episode_1/\"><abbr title=\"Bastard Operator from Hell\">BOFH</abbr>: Every computer system eventually serves ads</a></li>\n<li><a href=\"https://www.theregister.com/2025/12/27/bofh_2025_episode_25/\"><abbr title=\"Bastard Operator from Hell\">BOFH</abbr>: The Christmas spirit has run dry – time to show some chiller instinct</a></li>\n</ul>\n<p>\"I... You've got to do something!\" the Boss gasps.</p>\n<p>\"No kidding,\" I reply. \"In the old days, we'd have a carrot and stick chat with board members about how an 85-inch screen might look nice in their drawing room and how they might want to flush the contents of their web cache – that sort of thing.\"</p>\n<p>\"I... and now?\"</p>\n<p>\"Now we take a more holistic view – and notice anomalies long before anything happens. Like the Head Beancounter asking our cloud hosting company to run up a mirror copy of financials without telling us – no doubt to prove that they can run their systems as well as we can.\"</p>\n<p>\"So you stopped it?\"</p>\n<p>\"No, we let them do it. I mean, it's not like they'd go live on the mirror system – just to prove a point at a Board meeting. That would be irresponsible.\"</p>\n<p>\"Did they go live?!\" the Boss asks.</p>\n<p>\"I certainly hope not. Not when the mirror system's got the same admin password as our system. Who knows what might happen to the data? Someone could change the currency from pounds to Turkish lira!\"</p>\n<p>\"Or bananas,\" the PFY adds. \"Or maybe they'd just delete several thousand transactions from the financials data.\"</p>\n<p>\"Or add several thousand transactions to the financials data,\" I suggest.</p>\n<p>\"Or maybe all three,\" the PFY says. \"Which is why they'd never go live. That would be madness.\"</p>\n<p>...</p>\n<p>A picture of the boardroom appears on the PFY's screen, and we notice the Head Beancounter sitting quietly, waiting for his moment.</p>\n<p>It doesn't go well.</p>\n<p>...</p>\n<p>The Head Beancounter is in Mission Control and he's not happy. Apparently, the Board didn't appreciate his presentation, nor the possible ramifications of missing transactions. His raging is interrupted by a phone call on my desk phone. From the boardroom.</p>\n<p>\"Yes?\" I say, listening intently. \"I see. Yes. No. I'm sure we can sort it out. You're sure? Consider it done.\"</p>\n<p>\"What's done?\" the Head Beancounter asks after I put the phone down.</p>\n<p>\"Oh, nothing,\" I say, turning to the PFY. \"Operation High Flyer.\"</p>\n<p>\"Oh,\" the PFY says, secretly operating the release lever on the office window. \"Is that someone breaking into your car?\"</p>\n<p>\"What?!\" the Head Beancounter says, heading over.</p>\n<p>...</p>\n<p>Uprising quelled.</p>\n<ul>\n<li><a href=\"https://www.theregister.com/data_centre/bofh/\">BOFH: Previous episodes on <em>The Register</em></a></li>\n<li><a href=\"http://www.bofharchive.com/\" target=\"_blank\">The Compleat BOFH Archives 95-99</a></li>\n</ul> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/bofh_2026_episode_4/?td=rt-3a",
            "pub_date": "2026-02-28 07:51:42",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lovable-hosted app littered with basic flaws exposed 18K users, researcher claims",
            "description": "<div id=\"body\">\n<p>Vibe-coding platform Lovable has been accused of hosting apps riddled with vulnerabilities after saying users are responsible for addressing security issues flagged before publishing.</p>\n<p>Taimur Khan, a tech entrepreneur with a background in software engineering, found 16 vulnerabilities – six of which he said were critical – in a single Lovable-hosted app that leaked more than 18,000 people's data.</p>\n<p>He declined to name the app during the disclosure process, although it was hosted on Lovable's platform and showcased on its Discover page. The app had more than 100,000 views and around 400 upvotes at the time Khan began his probe.</p>\n\n<p>The main issue, Khan said, was that all apps that are vibe-coded on Lovable's platform are shipped with their backends powered by Supabase, which handles authentication, file storage, and real-time updates through a PostgreSQL database connection.</p>\n\n\n<p>However, when the developer – in this case AI – or the human project owner fails to explicitly implement crucial security features like Supabase's row-level security and role-based access, code will be generated that looks functional but in reality is flawed.</p>\n<p>One example of this was a malformed authentication function. The AI that <a href=\"https://www.theregister.com/2025/11/24/opinion_column_vibe_coding/\" target=\"_blank\">vibe-coded</a> the Supabase backend, which uses remote procedure calls, implemented it with flawed access control logic, essentially blocking authenticated users and allowing access to unauthenticated users.</p>\n\n<p>Khan said the intent was to block non-admins from accessing parts of the app, but the faulty implementation blocked all logged-in users – an error he said was repeated across multiple critical functions.</p>\n<p>\"This is backwards,\" said Khan. \"The guard blocks the people it should allow and allows the people it should block. A classic logic inversion that a human security reviewer would catch in seconds – but an AI code generator, optimizing for 'code that works,' produced and deployed to production.\"</p>\n<p>Because the app itself was a platform for creating exam questions and viewing grades, the userbase is naturally comprised of teachers and students. Some were from top US universities such as UC Berkeley and UC Davis, while there were \"K-12 institutions with minors likely on the platform\" as well, Khan <a href=\"https://www.linkedin.com/pulse/lovable-more-like-hackable-taimur-khan-cewdf/?trackingId=%2BscO7NGeQ0%2BpVd7b1U0fYA%3D%3D\" rel=\"nofollow\" target=\"_blank\">said</a>.</p>\n\n<p>With the security flaws in place, an unauthenticated attacker could trivially access every user record, send bulk emails through the platform, delete any user account, grade student test submissions, and access organizations' admin emails, for example.</p>\n<p>Of the 18,697 total user records exposed, 14,928 contained unique email addresses. The dataset included 4,538 student accounts – all with email addresses – 10,505 enterprise users, and 870 users whose full PII was exposed.</p>\n<p>The security flaws here are not exclusive to apps hosted by Lovable; the issue is broader and well-told by now.</p>\n<p>Vibe coding, Collins Dictionary's Word of the Year for 2025, promised to break down software development's steep learning curve and empower any prompt jockey to bring their app ideas to life.</p>\n<p>However, when AI isn't <a href=\"https://www.theregister.com/2026/01/21/curl_ends_bug_bounty/\" target=\"_blank\">generating slop bug reports</a> in pursuit of lucrative bug bounties or <a href=\"https://www.theregister.com/2025/07/21/replit_saastr_vibe_coding_incident/\" target=\"_blank\">catastrophically forgoing instructions</a>, it can be found spewing glitzy-looking apps laden with vulnerabilities.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/25/bcachefs_creator_ai/\">Bcachefs creator insists his custom LLM is female and 'fully conscious'</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/23/ibm_share_dive_anthropic_cobol/\">IBM stock dives after Anthropic points out AI can rewrite COBOL fast</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/20/amazon_denies_kiro_agentic_ai_behind_outage/\">Amazon's vibe-coding tool Kiro reportedly vibed too hard and brought down AWS</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/19/jon_kern_vibe_coding/\">Agile Manifesto turns 25 – just in time for vibe coding to test it</a></li>\n</ul>\n<p>Veracode, for instance, <a href=\"https://www.veracode.com/blog/ai-generated-code-security-risks/\" rel=\"nofollow\" target=\"_blank\">recently found</a> that 45 percent of AI-generated code contained security flaws, not to mention the myriad <a href=\"https://www.theregister.com/2025/08/05/mcpoison_bug_abuses_cursor_mcp/\" target=\"_blank\">tales</a> of <a href=\"https://www.theregister.com/2026/02/20/openclaw_snuck_into_cline_package/\" target=\"_blank\">woe</a> reported by <em>The Register</em> in recent months.</p>\n<p>Khan said he believes Lovable should take responsibility for the security of the apps it hosts, and was especially peeved when, after reporting his findings via company support, his ticket was reportedly closed without response.</p>\n<p>\"If Lovable is going to market itself as a platform that generates production-ready apps with authentication 'included,' it bears some responsibility for the security posture of the apps it generates and promotes,\" Khan said.</p>\n<p>\"You can't showcase an app to 100,000 people, host it on your own infrastructure, and then close the ticket when someone tells you it's leaking user data. At minimum, a basic security scan of showcased applications would have caught every critical finding in this report.\"</p>\n<p>Lovable told <em>The Register</em> that the company has contacted the owner of the app in question and takes \"any findings of this kind extremely seriously.\"</p>\n<p>Regarding the closed ticket, Lovable CISO Igor Andriushchenko said that the company only received \"a proper disclosure report\" on the evening of February 26 and acted on the findings \"within minutes.\"</p>\n<p>\"Any project built with Lovable includes a free security scan before publishing,\" Andriushchenko told <em>The Register</em>. \"This scan checks for vulnerabilities and, if found, provides recommendations on actions to take to resolve before publishing.</p>\n<p>\"Ultimately, it is at the discretion of the user to implement these recommendations. In this case, that implementation did not happen.</p>\n<p>\"This project also includes code not generated by Lovable and the vulnerable database is not hosted by Lovable. We have been in contact with the creator of the app, who is now addressing the issue.\" ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/lovable_app_vulnerabilities/?td=rt-3a",
            "pub_date": "2026-02-28 08:16:05",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Engineer held hostage by client who asked for the wrong fix",
            "description": "<div id=\"body\">\n<p><span class=\"label\">On Call</span> Friday has arrived, bringing a promise of fleeting freedom – and a new instalment of On Call, <em>The Register</em>'s reader-contributed column that retells your tales of tech support incidents that became memorable for all the wrong reasons.</p>\n<p>This week, meet a reader we'll Regomize as \"Kent\" who told us he once worked as a field engineer and shares a story of the time a client dispatched him to a private datacenter to replace a failed system board in an HP server.</p>\n<p>\"A straightforward job,\" Kent told On Call. \"Board swap, set serial number and BIOS options, bring it through POST, confirm hardware health, hand it back. Flee.\"</p>\n\n<p>Kent arrived at the datacenter and made it through what he called \"the usual mantrap routine\" – the combination of revolving doors and swipe-card barriers that properly secure datacenters use to regulate entries and exits.</p>\n\n\n<p>Once inside he found the server, tested to verify the system board had failed – and saw it had. He therefore replaced it, reseated the RAM and CPU, put everything back together and turned the machine on.</p>\n<p>It booted, everything worked as intended, and the client's admin logged in and verified all was well – and then started talking to someone else about what sounded like a software upgrade.</p>\n\n<p>Kent didn't stick around to learn more.</p>\n<p>\"My brief was to swap a board. The board was swapped,\" he told On Call. So he packed up the failed board and his tools, then left.</p>\n<p>On his way out, Kent swiped his card and the mantrap gate didn't open. A short time later he tried again, without success.</p>\n\n<p>\"After a few minutes I called out to the security desk behind the glass and the guard checked his screen and said: ‘We've been told to hold you. The admin says there's still a problem with the server.'\"</p>\n<p>This was a surprise to Kent, who just a few minutes earlier had watched the server boot and heard the client's admin acknowledge the fact.</p>\n<p>Fifteen minutes later nobody had explained what was going on.</p>\n<p>Kent called his dispatcher, who called the client. \"The message relayed back was that they were 'still having issues,' and I was not to be released until they were resolved.\"</p>\n<p>\"At this point I was no longer a field engineer. I was collateral,\" Kent told On Call.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/20/on_call/\">Desktop tech sent to prison for an education on strange places to put tattoos</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/13/on_call/\">Enforcing piracy policy earned helpdesk worker death threats</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/06/on_call/\">New hire fixed a problem so fast, their boss left to become a yoga instructor</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/30/on_call/\">In-house techies fixed faults before outsourced help even noticed they'd happened</a></li>\n</ul>\n<p>One hour and forty-five minutes later, Kent's supervisor called for a three-way chat with the client.</p>\n<p>\"The tone had shifted,\" Kent wrote. \"My supervisor calmly informed them that if I was not released immediately, I had two options available to me: pull the fire alarm inside the datacenter or call Police.\"</p>\n<p>The client decided to let Kent leave.</p>\n<p>He later learned why he'd been detained.</p>\n<p>\"An application running on the server was malfunctioning,\" he told On Call. \"The application vendor blamed the operating system. The operating system vendor suggested the hardware might be unstable. The hardware had just had a board replaced. Therefore, the man who replaced the board must be the problem.\"</p>\n<p>20 minutes after Kent left the datacenter, his phone rang.</p>\n<p>\"The client's admin called my mobile – not to apologize, but to inform me that I was banned from the site.\"</p>\n<p>Kent thinks his crime was to successfully replace a motherboard in a server that ran a buggy application.</p>\n<p>\"My brief was to swap a board,\" he told On Call. \"The board was swapped.\"</p>\n<p>Has a client or a colleague ever kept you on site against your will? If so, release your story by <a href=\"mailto:oncall@theregister.com\" target=\"_blank\">clicking here</a> to send On Call an email so we can share your story on a future Friday. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/on_call/?td=rt-3a",
            "pub_date": "2026-02-28 07:16:35",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI models suck slightly less at math than they did last year",
            "description": "<div id=\"body\">\n<p><span class=\"label\">exclusive</span> Current-day LLMs are prediction engines and, as such, they can only find the most likely solution to problems, which is not necessarily the correct one. Though popular models have mostly become better at math, even top performer Gemini 3 Flash would receive a C if assessed with a letter grade.</p>\n<p>Researchers affiliated with Omni Calculator, a maker of online calculators for specific applications, have subjected a new set of AI models to the company's ORCA Benchmark, which consists of 500 practical math questions.</p>\n<p>In their initial evaluation last November, OpenAI's ChatGPT-5, Google's Gemini 2.5 Flash, Anthropic's Claude Sonnet 4.5, xAI's Grok 4, and DeepSeek's DeepSeek V3.2 (alpha) all did poorly, <a href=\"https://forums.theregister.com/forum/all/2025/11/17/ai_bad_math_orca/\" rel=\"nofollow\">scoring 63 percent or less</a> on math problems.</p>\n\n<p>The latest set of contestants consists of ChatGPT-5.2, Gemini 3 Flash, Grok 4.1, and DeepSeek V3.2 (stable release). Sonnet 4.5 didn't get re-evaluated as it hadn't changed and its successor had not been released during the testing period.</p>\n\n\n<p>For this second round of testing – provided to <em>The Register</em> prior to publication – all the models showed improvement except for Grok-4.1, which regressed.</p>\n<p>Gemini 3.1 Flash saw its accuracy hit 72.8 percent, a gain of 9.8 percentage points from its predecessor. DeepSeek V3.2 reached 55.2 percent, a gain of 3.2 percentage points from its alpha version. ChatGPT 5.2 achieved 54.0 percent accuracy, up 4.6 percentage points. And Grok 4.1 slipped to 60.2 percent, a loss of 2.6 percentage points.</p>\n\n<p>\"A calculator is predictable,\" said Dawid Siuda, researcher at ORCA, in a statement. \"Ask it the same question today or next year, and the answer stays the same. AI doesn't work that way. These systems are predicting the next likely word based on patterns. Mathematically, it's possible for a model to get a question right today and wrong tomorrow.\"</p>\n<p>The researchers attempted to assess the variability of model responses with a metric dubbed \"instability\" – a measure of how often models changed their answers when asked the same question twice.</p>\n\n<p>Gemini 3 Flash proved the most consistent, shifting only 46.1 percent for incorrect responses. ChatGPT, the researchers report, changed its answer 65.2 percent of the time. And DeepSeek V3.2 changed its answer for 68.8 percent of errors.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/26/clade_code_cves/\">Claude collaboration tools left the door wide open to remote code execution</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/veracode_security_ai/\">Rapid AI-driven development makes security unattainable, warns Veracode</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/copilot_pane_edge_outlook/\">Microsoft to auto-launch Copilot in Edge whenever you click a link from Outlook</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/llms_killed_privacy_star/\">LLMs killed the privacy star, we can't rewind, we've gone too far</a></li>\n</ul>\n<p>The <a href=\"https://www.omnicalculator.com/reports/omni-research-on-calculation-in-ai-benchmark#how-we-put-ais-to-the-test\" rel=\"nofollow\">ORCA researchers</a> note that model performance improvements over time differ across domains. DeepSeek, they say, saw its performance on Biology &amp; Chemistry questions go from 10.5 percent accuracy to 43.9 percent. And Gemini 3 Flash reached Math &amp; Conversions accuracy of 93.2 percent, up from 83 percent. Grok 4.1 meanwhile lost 9 percentage points for its accuracy answering Health &amp; Sports problems and lost 5.3 percentage points for Biology &amp; Chemistry. </p>\n<p>The researchers speculate that recent updates to Grok may have prioritized other capabilities than quantitative reasoning.</p>\n<p>Noting that calculation errors now account for 39.8 percent of all mistakes, up from 33.4 percent, and that rounding errors slipped to 25.8 percent, down from 34.7 percent, the ORCA group conclude that AI models are getting better at making the math look right through formatting, while still struggling with arithmetic.</p>\n<p>\"AI models are essentially prediction engines rather than logic engines,\" Siuda told <em>The Register</em> in an email. \"Because they work on probability, they are basically guessing the next most likely number or word based on patterns they have seen before. It is like a student who memorizes every answer in a math book but never actually learns how to add.\"</p>\n\n<p>Siuda said we knew that about models previously and that hasn't changed.</p>\n<p>\"They might get the right answer most of the time, but the second you give them a unique or tricky problem, or multi-step task, they stumble because they are not truly calculating anything,\" he said. \"It's probably impossible to close this gap completely with the current technology, but if we merge LLMs with function calling well enough, it may be possible to solve.\"</p>\n<p>Function calling – farming out arithmetic to a deterministic source – is one way around the poor math handling of models. </p>\n<p>\"Major AI companies like Google and OpenAI are already doing this by having the AI call a function to do the actual calculation,\" explained Siuda. \"The real headache happens with long, messy problems. The AI has to keep track of every little result at each stage, and it usually gets overwhelmed or confused.\"</p>\n<p>Another possible avenue for improvement might be teaching models to verify responses through formal proofs. As noted in <a href=\"https://www.nature.com/articles/s41586-025-09833-y\" rel=\"nofollow\">Nature</a> last November, Google's DeepMind has developed an approach that scored a silver medal result on the International Mathematical Olympiad through reinforcement learning based on proofs developed with the <a href=\"https://lean-lang.org/\" rel=\"nofollow\">Lean</a> programming language and proof assistant.</p>\n<p>But for the time being, trust no AI. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/ai_models_get_better_at/?td=rt-3a",
            "pub_date": "2026-02-28 04:01:31",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Denizens of DEF CON are 'fed up with government'",
            "description": "<div id=\"body\">\n<p><span class=\"label\">Interview</span> Hackers – especially Jake Braun – are \"fed up with government.\"</p>\n<p>Braun was one of the creators of the first-ever <a href=\"https://www.theregister.com/2018/08/13/DEF%20CON_election_vote_hacking/\" target=\"_blank\">Voting Machine Hacking Village at DEF CON</a> in 2017 and served as a homeland security and cyber advisor to the Obama and Biden administrations. He also co-founded the Franklin project, named for Benjamin Franklin, who founded America's first volunteer fire department and published the annual Poor Richard's Almanack – an eclectic collection of useful facts and other musings.</p>\n<p>The Franklin project, which <a href=\"https://www.theregister.com/2024/08/12/def_con_franklin_project_hopes_hackers/\" target=\"_blank\">launched at DEF CON</a> in 2024, enlists hackers to <a href=\"https://www.theregister.com/2025/08/10/def_con_hackers_water_security/\" target=\"_blank\">secure critical infrastructure</a>, and 350 people signed up that year to donate their time and talent to securing water facilities.</p>\n\n<p>Another of the project’s activities is publishing an annual Hacker's Almanack in homage to Franklin’s effort.</p>\n\n\n<p>The second volume, the <a href=\"https://harris.uchicago.edu/sites/default/files/the_def_con_33_hackers_Almanack.pdf\" rel=\"nofollow\" target=\"_blank\">DEF CON 33 Hackers' Almanack</a>, [PDF] landed earlier this month.</p>\n<blockquote class=\"pullquote\">\n<p>We saw society moving in the right direction for the last 500 years because of our commitment to science, human rights, and that seems to be at the very least slowing down, if not reversing</p>\n</blockquote>\n<p>\"Thinking back to Ben Franklin, we saw society moving in the right direction for the last 500 years because of our commitment to science, human rights, etc., and that seems to be at the very least slowing down, if not reversing,” Braun told <i>The Register</i>.</p>\n<p>Braun said he blames government for this state of affairs – pointedly \"the inability of government to continue to make the progress we saw from the enlightenment.\"</p>\n<p>\"This community is so committed to these principles of human rights and freedom of speech and science, that that when we see people fuck with them – or when we see the people that we elect to preserve these things not doing their fucking job – we're just like: ‘Fuck you guys,’\" Braun said.</p>\n\n<p>The Almanack highlights three major, all-of-society threats that governments have yet to fix: Cybercrime, AI, and - the biggie - authoritarianism. It presents a year's worth of DEF CON research on these three topics and shows how hackers are responding to each one.</p>\n<h3 class=\"crosshead\">AI for offense</h3>\n<p>Braun says he and the rest of the DEF CON volunteers listened to \"dozens and dozens\" of talks before this year's three topics bubbled to the surface.</p>\n<p>\"We started seeing lots of <a href=\"https://www.theregister.com/2025/08/11/ai_security_offense_defense/\" target=\"_blank\">instances where AI was winning</a> or placing high in these hacker competitions, and that wasn't happening last year,\" Braun said. \"That's new and also something we're worried about: When is this going to be the case that AI is as good as humans at hacking, and way better than humans [alone] once paired with a human?\"</p>\n<p>Anthropic researcher Keane Lucas entered his company's <a href=\"https://www.theregister.com/2026/02/23/claude_code_security_panic/\" target=\"_blank\">AI coding tool Claude</a> into seven competitions during DEF CON 33, including capture-the-flag contests. During one of these - PicoCTF - it placed in the <a href=\"https://www.youtube.com/watch?v=sbkeEwhWIks\" target=\"_blank\">top three percent globally</a>, while also successfully fending off red-team attacks in the Collegiate Cyber Defense Challenge.</p>\n<p>Claude did struggle with more difficult challenges, and also made up some of its own flags.</p>\n\n<p>Still, Claude's performance and other research presented at the convention illustrate \"the accelerating power of AI for offense,\" according to the Almanack. Meanwhile, security remains an afterthought.</p>\n<p>\"There's clearly more of a sense across the board than there was last year that we need the 20 critical controls for AI,\" Braun said, pointing to the Center for Internet Security's (CIS) <a href=\"https://www.cisecurity.org/controls/v8\" target=\"_blank\">Critical Security Controls</a> as an example of what this would look like. \"We need an industry-wide, accepted definition like what CIS has been doing, and I don't see any real movement toward that yet.\"</p>\n<h3 class=\"crosshead\">Combatting cybercrime</h3>\n<p>This year's cybercrime theme, \"Hackers don cape and mask,\" emerged after listening to accounts of DEF CON researchers performing feats such as taking down Russian dark web marketplace Solaris and its affiliated hacker collective, Killnet, and unveiling the real-world identity of phishing scammer Darcula, who is responsible for hundreds of thousands of people losing millions of dollars.</p>\n<p>\"These guys are taking down ransomware groups, and dealing with criminals in prison, and hacking the Russian firewall - it's just fascinating,\" Braun said.</p>\n<p>Global governments' effort to fight ransomware and other types of cybercrime isn't working, according to the Almanack. \"To properly fight back, policymakers need to unleash the full potential of programs like the FBIs Confidential Human Source (CHS) program, so we can leverage skilled white hat hackers as force multipliers to woefully outnumbered government authorities,\" it reads.</p>\n<h3 class=\"crosshead\">Down with despots</h3>\n<p>The third theme, \"down with despots,\" didn't come together until the end of the Almanack-writing process, as Braun saw examples of civil society methods to protect data, communications, and culture against censorship, surveilliance, and other kinds of oppression.</p>\n<p>This included hacker LambdaCalculus's off-grid mesh network, <a href=\"https://schedule.hope.net/hope16/speaker/XXHPGL/\" target=\"_blank\">PirateBox</a>, along with Jason Vogt and Josh Reiter's proposal of setting up mesh networks in Taiwan to help civilians fight a future Chinese invasion.</p>\n<p>Another talk by Saving Ukrainian Cultural Heritage Online (SUCHO) co-founder Quinn Dombrowski detailed his group's effort to save Ukrainian cultural websites – libraries, archives, museums, and community organizations – before Russia’s invasion. It ultimately helped preserve more than 1,500 websites.</p>\n<p>\"This is all about preserving freedom and democracy from authoritarians that are oppressing the vulnerable populations around the world, whether they be Ukrainians, potentially the Taiwanes,e Uyghurs, or migrants for that matter,\" Braun said.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2025/08/10/def_con_hackers_water_security/\">DEF CON hackers plug security holes in US water systems amid tsunami of threats</a></li>\n<li><a href=\"https://www.theregister.com/2024/08/12/def_con_franklin_project_hopes_hackers/\">DEF CON Franklin project enlists hackers to harden critical infrastructure</a></li>\n<li><a href=\"https://www.theregister.com/2018/08/13/DEF%20CON_election_vote_hacking/\">US voting systems: Full of holes, loaded with pop music, and 'hacked' by an 11-year-old</a></li>\n<li><a href=\"https://www.theregister.com/2025/08/11/ai_security_offense_defense/\">Red teams are safe from robots for now, as AI makes better shield than spear</a></li>\n</ul>\n<p>To combat authoritarianism, the Almanack proposes building a Digital Arsenal of Democracy, comprised of technologies like mesh networks, digital archives, PirateBox, and DNA data storage to help oppressed communities to preserve their history and culture. Communication capabilities are also on the to-do list for the Arsenal’s creators.</p>\n<p>This aligns with last year's DEF CON theme – access everywhere – and, as Moses writes in an epilogue to the Almanack, will carry over to this summer's focus on agency: \"The ability of a citizen to have agency over their identity, data, and persona.\"</p>\n<p>As Braun explains, \"It needs to be a concerted effort by the human rights community and the hacker community to sit down and look at what technologies are out there today that support the preservation of human rights around the world, figuring out what we don't have, and then building those missing pieces,\" he said.</p>\n<p>Braun is confident that DEF CON hackers will rise to the challenge.</p>\n<p>\"There's a certain thing in the hacker mindset that makes them a hacker: this commitment to freedom, transparency, science, very much Ben Franklin-esque,\" he said. \"When there's threats to that, they get super riled up. I feel like we're going to see a lot more research in this space because of what's happening around the world, including here at home.\" ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/28/def_con_jake_braun_fed_up_govt/",
            "pub_date": "2026-02-28 19:16:44",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Open source devs consider making hogs pay for every Git pull",
            "description": "<div id=\"body\">\n<p><span class=\"label\">Opinion</span> I'm at the <a href=\"https://events.linuxfoundation.org/lf-member-summit/\" rel=\"nofollow\" target=\"_blank\">Linux Foundation Members Summit</a>, and <a href=\"https://www.sonatype.com/\" rel=\"nofollow\" target=\"_blank\">Sonatype</a>'s CTO Brian Fox introduced me to a new open source problem. I wouldn't have thought that was possible, but here I am.</p>\n<p>Fox, who also oversees <a href=\"https://maven.apache.org/\" rel=\"nofollow\" target=\"_blank\">Apache Maven</a>, a popular Java build tool, explained that its repository site is at risk of being overwhelmed by constant Git pulls. The team has dug into this and found that 82 percent of the demand comes from less than 1 percent of IPs. Digging deeper, they discovered that many companies are using open source repositories as if they were content delivery networks (CDNs). So, for example, a single company might download the same code hundreds of thousands of times in a day, and the next day, and the next. This is unsustainable.</p>\n<p>So Maven and other open source repositories are considering introducing a tiered payment system. Lone developers and small groups will still be able to download the code for free, but the hogs will have to pay for every download. In other words, open source software is still free as in speech, but you can forget about being \"free as in beer\" going forward.</p>\n\n<p>How bad is it? Fox revealed that last year, major repositories handled 10 trillion downloads. That's double Google's annual search queries if you're counting from home and they're doing it on a shoestring. Fox described this as a \"tragedy of the commons,\" where the assumption of \"free and infinite\" resources leads to structural waste amplified by CI/CD pipelines, security scanners, and AI-driven code generation.</p>\n\n\n<p>Companies may think that they can rely on \"free and infinite\" infrastructure, when in reality the costs of bandwidth, storage, staffing, and compliance are accelerating.</p>\n<p>Fox shared data showing 82 percent of Maven Central's consumption comes from less than 1 percent of worldwide IPs, with 80 percent of traffic from the big three hyperscalers. Making it even more troublesome, \"IP addresses don't represent people. They're not even organizations anymore. They're ephemeral. They're kind of like weather,\" Fox explained in an interview, noting challenges from containers, NAT proxies, and cloud egress IPs. In one case, a department store's team of 60 developers generated more traffic than global cable modem users worldwide due to misconfigured React Native builds bypassing their Nexus repository manager.</p>\n\n<p>He detailed extreme examples, such as large organizations downloading the same 10,000 components a million times each month. \"That's ridiculous,\" Fox said. Throttling efforts led to \"brownouts\" via 429 errors, but patterns mutated, forcing a \"Whack-a-Mole\" game, especially since most consumption is headless and unnoticed.</p>\n<p>Registries are also burdened by commercial use, with companies publishing closed source components or massive SDKs as free CDNs. Fox noted that top publishers release gigabyte-scale artifacts daily, unlike in typical open source projects. </p>\n<p>In September 2025, the <a href=\"https://www.theregister.com/2025/09/23/openssf_open_source_infrastructure/\" target=\"_blank\">registries issued an open letter via OpenSSF calling for \"tiered access models\"</a> to keep it free for hobbyists and open source while mandating contributions from high-volume users. \"This is the important part, that it has to become mandatory, not optional, \" Fox emphasized. Open source charity is not a sustainable model.</p>\n\n<p>Businesses have been treating open source repositories as free, infinite infrastructure. That's nonsense. The reality is that the costs of bandwidth, storage, staffing, and compliance are ever-growing. In particular, as the letter stated, <a href=\"https://openssf.org/blog/2025/09/23/open-infrastructure-is-not-free-a-joint-statement-on-sustainable-stewardship/\" rel=\"nofollow\" target=\"_blank\">\"Commercial-scale use without commercial-scale support is unsustainable</a>.\" Open source foundations can't keep up with the demand for fast dependency resolution, signed packages, zero downtime, and rapid response to supply chain attacks – not to mention looming regulatory requirements such as the <a href=\"https://www.theregister.com/2023/12/04/infosec_in_brief/\" target=\"_blank\">EU's Cyber Resilience Act</a>.</p>\n<p>Fox anticipates the registries will start rolling out next quarter: \"We did the Open Letter way back in October... different ecosystems have figured out models that they think are going to work.\" In a pleasant surprise, reactions have been positive. Throttled organizations were \"surprised and apologetic,\" mistaking issues for malice rather than \"ignorance, unawareness.\"</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/27/open_source_endowment/\">New endowment hopes to raise a big pile of money for open source projects</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/veracode_security_ai/\">Rapid AI-driven development makes security unattainable, warns Veracode</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/25/cloudflare_nextjs_api_ai/\">Cloudflare experiment ports most of Next.js API 'in one week' with AI</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/24/google_android_developer_verification_plan/\">Rogue devs of sideloaded Android apps beg for freedom from Google's verification regime</a></li>\n</ul>\n<p>As the saying goes, never attribute to malice what can be explained by stupidity. Or, as Michael Winser, a co-founder of <a href=\"https://alpha-omega.dev/about/about-alpha-omega/\" rel=\"nofollow\" target=\"_blank\">Alpha-Omega</a>, a Linux Foundation project to help secure the open source supply chain, said at FOSDEM: \"If you're not caching, you're a goddamn idiot.\" Amen, brother!</p>\n<p>With AI-driven repository usage exploding, Fox urged checking bills, using caching proxies, and avoiding per-commit tests. He seeks endorsements: \"We need you to help step up... so that when we go out to the rest of the wild world... you need to pay to keep doing what you've been doing.\"</p>\n<p>But, wait, there's more! Besides simply being overwhelmed by constant download demands, Winser said, \"<a href=\"https://www.theregister.com/2026/02/16/open_source_registries_fund_security/\" target=\"_blank\">People conflate open source software and open source infrastructure.</a>.\" Yes, open source software is free, but the cost of registries to host all open source applications and libraries keeps increasing with greater usage.</p>\n<p>It's not just bandwidth and storage. Winser also pointed out that the repositories \"don't have enough money to spend on the very security features that we all desperately need to stop being a bunch of idiots and installing fu when it's malware.\"</p>\n<p>To quote Robert A. Heinlein: \"There's no such thing as a free lunch.\" The bill has come due for our misuse of the open source commons. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/28/open_source_opinion/",
            "pub_date": "2026-02-28 16:26:51",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Double whammy: Steaelite RAT bundles data theft, ransomware in one evil tool",
            "description": "<div id=\"body\">\n<p>A new remote access trojan (RAT) being sold on cybercrime networks enables double extortion attacks on Windows machines by bundling ransomware and data theft, along with credential and cryptocurrency stealers, live surveillance, and a whole host of other illicit capabilities, all controllable from a centralized dashboard.</p>\n<p>BlackFog researchers first spotted the malware, <a href=\"https://www.blackfog.com/steaelite-rat-double-extortion-from-single-panel/\" rel=\"nofollow\" target=\"_blank\">called Steaelite</a> and touted as \"fully undetectable\" and the \"best Windows RAT,\" in November 2025. It works across Windows 10 and 11, with an Android module reportedly in development.</p>\n<p>Steaelite's operator interface runs entirely in the browser, and the RAT starts stealing victims' data even before the criminals open the dashboard. </p>\n\n<p>\"When a new victim connects, Steaelite automatically harvests browser-stored passwords, session cookies, and application tokens before the operator issues any commands,\" according to the AI-based security shop. \"Data theft begins at the moment of connection.\"</p>\n\n\n<p>The dashboard includes a primary toolbar plus two additional sections, with the primary toolbar alone including modules for remote code execution, file management, live streaming, webcam and microphone access, process management, clipboard monitoring, password recovery, installed program enumeration, location tracking, arbitrary file execution, URL opening, DDoS attacks, and VB.NET payload compilation. </p>\n<p>If a criminal is seeking more - like locking up victims' files and extorting them for cryptocurrency - an \"advanced tools\" panel includes capabilities for ransomware deployment, hidden RDP, Windows Defender disabling and exclusion management, and persistence installation.</p>\n\n<p>Plus, a third \"developer tools\" panel adds keylogging, client-to-victim chat, file searching, USB spreading, a bot-killing feature that removes competing malware, message box delivery, wallpaper modification, UAC bypass, and a clipper that swaps cryptocurrency wallet addresses during copy-paste operations. </p>\n<p>The clipper can silently transfer the victims' cryptocurrency to the attacker - without the victim ever knowing - by monitoring the clipboard for wallet addresses and replacing them with an attacker-controlled address before the paste completes.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/27/ransomware_chainalysis/\">Ransomware payments cratered in 2025, but attacks surged to record highs</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/20/shinyhunters_wynn_resorts/\">ShinyHunters demands $1.5M not to leak Vegas casino and resort chain data</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/19/rmm_rat_trustconnect/\">Crims create fake remote management vendor that actually sells a RAT</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/27/odido_shinyhunters_leaks/\">Cops back Dutch telco Odido after second wave of ShinyHunters leaks</a></li>\n</ul>\n<p>\"The listing has been bumped consistently across multiple forum threads with 87 messages at the time of writing, and a promotional video demonstrating the tool's capabilities has been published on YouTube, a common distribution tactic for commercial remote access trojans looking to reach buyers outside of traditional forum ecosystems,\" BlackFog wrote.</p>\n<p>In addition to being an all-in-one RAT, this new malware makes it even easier for would-be criminals to pull off double extortion attacks - where the crooks first steal data, then encrypt victims' systems, and <a href=\"https://www.theregister.com/2026/02/27/odido_shinyhunters_leaks/\" target=\"_blank\">threaten to leak the stolen files</a> if the victim refuses to <a href=\"https://www.theregister.com/2026/02/20/shinyhunters_wynn_resorts/\" target=\"_blank\">pay a ransom</a>.</p>\n<p>\"Previously, double extortion required malware for initial access and exfiltration, then a separate ransomware payload for encryption, often involving coordination between initial access brokers and ransomware affiliates,\" BlackFog's team wrote. \"Steaelite puts both in the same interface, and the automated credential harvesting means data theft fires before the operator even interacts with the dashboard.\"</p>\n\n<p>Additionally, once the Android version goes live - and assuming it works as planned - a single Steaelite license could cover corporate Windows computers as well as the mobile devices employees use for authentication and messaging, the researchers note. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/double_extortion_whammy_steaelite_rat/",
            "pub_date": "2026-02-28 08:26:46",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump orders purge of 'woke' Anthropic from government",
            "description": "<div id=\"body\">\n<p><span class=\"label\">updated</span> President Trump has escalated Anthropic's dispute with the Defense Department with a social media post ordering the entire federal government purge the company's software from its systems. </p>\n<p>In a post on Truth Social, the President <a href=\"https://truthsocial.com/@realDonaldTrump/posts/116144552969293195\" rel=\"nofollow\" target=\"_blank\">called</a> Anthropic a \"radical left, woke\" company and said he was directing all federal agencies to cease use of its technology \"immediately.\" The move comes after a dispute between Anthropic and the Pentagon over the AI firm's refusal to relax safeguards barring its models from use in mass domestic surveillance or fully autonomous weapons systems.</p>\n<p>\"The Leftwing nut jobs at Anthropic have made a DISASTROUS MISTAKE trying to STRONG-ARM the Department of War, and force them to obey their Terms of Service instead of our Constitution,\" Trump said, apparently referring to the part of the Constitution about spying on Americans with AI and letting autonomous weapons make targeting and firing decisions.</p>\n\n<p>To be clear, <a href=\"https://www.theregister.com/2026/02/25/pentagon_threatens_anthropic/\">neither</a> party actually says the Pentagon intend to use Anthropic's AI for those purposes, but Anthropic's stance was enough to escalate tensions with the Defense Department and raise questions for agencies that had signed up for $1-for-a-year software deals that <a href=\"https://www.theregister.com/2025/08/12/gsa_inks_another_1dollar_onegov_deal/\">included</a> Anthropic's AI.</p>\n\n\n<p>Trump said in his post that he was giving agencies six months to phase out Anthropic's AI for something less woke - <a href=\"https://www.theregister.com/2025/09/25/grokai_servces_us_government/\">perhaps</a> like <a href=\"https://www.theregister.com/2025/07/09/grok_nazi/\">Grok</a>. </p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/26/anthropic_claude_opus_3_blog/\">Anthropic launches new marketing blog, pretends it's being 'written' by 'retired' LLM</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/clade_code_cves/\">Claude collaboration tools left the door wide open to remote code execution</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/10/trump_wants_no_ai_friction/\">Trump to hyperscalers: your datacenters, your power bill</a></li>\n<li><a href=\"https://www.theregister.com/2025/08/06/google_openai_anthropic_us_gov_ai_deal/\">Google, OpenAI, Anthropic get blanket deal to saturate US government with their AI</a></li>\n</ul>\n<p>\"Anthropic better get their act together, and be helpful during this phase out period, or I will use the Full Power of the Presidency to make them comply, with major civil and criminal consequences to follow,\" Trump said. </p>\n<p>It's not clear what level of official action the President's social media is intended to convey, and it doesn't include any mention of the formal cancellation of Anthropic's <a href=\"https://www.theregister.com/2025/07/14/pentagon_ai/\">up to $200 million Pentagon contract</a>. However, after publication, Defense Secretary Pete Hegseth also made a social media post that said he's directing his department to designate Anthropic a supply-chain risk to national security, meaning that nobody doing business with the US military may have any commercial activity with Anthropic.</p>\n<p>The General Services Administration has also announced it is removing Anthropic from <a href=\"https://www.usai.gov/\" rel=\"nofollow\" target=\"_blank\">USAi.gov</a> and its Multiple Award Schedule procurement vehicle.</p>\n\n<p>We reached out to Anthropic for comment and to the White House to determine if and when the President intended to issue a formal order <a href=\"https://www.latimes.com/opinion/story/2025-09-18/jimmy-kimmel-cancel-culture-charlie-kirk\" rel=\"nofollow\">canceling</a> Anthropic. We'll update this story if we hear back. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/trump_orders_purge_of_anthropic/",
            "pub_date": "2026-02-28 08:41:36",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PCs and phones to get more boring and expensive in 2026 thanks to memory drought",
            "description": "<div id=\"body\">\n<p>The next wave of smartphones and PCs will have less memory and fewer capabilities, yet are likely to cost consumers 14 percent more as AI ambitions eat all available memory supplies, according to researchers at IDC.</p>\n<p>IDC said that the <a href=\"https://www.idc.com/resource-center/blog/higher-asps-lower-unit-volumes-how-the-memory-crisis-is-reshaping-the-pc-and-smartphone-outlook/\" rel=\"nofollow\" target=\"_blank\">worsening memory</a> market has caused its outlook to deteriorate just since December. The analysts are penciling in a decline in the PC market of 11.3 percent in 2026 – about 26 percent worse than they had guessed in December – and a decline in the smartphone market of 12.9 percent, which is more than double the 5.2 percent drop they predicted as a worst-case scenario just two months back.</p>\n<p>“This is perhaps the biggest challenge the industry has faced since its inception,” said Nabilia Popal, IDC’s senior research director global consumer devices, during a roundtable video discussion posted Thursday. “This is not just a temporary situation. This is going to result in a structural reset of the entire industry, in terms of size, in terms of competitive landscape, of the product mix and also on the price.”</p>\n\n<p>To mitigate the cost and the short supply, IDC expects consumers to hang on to devices longer, or turn to used and refurbished units. Device makers meanwhile are likely to downgrade memory on their least expensive devices, optimize features around using less memory, or in some cases turn to Chinese suppliers that they've avoided over geopolitical or technical concerns.</p>\n\n\n<p>“Any meaningful impact is expected to take some time,” Jeff Janukowicz, research vice president at IDC, said in a video posted Thursday. \"So ultimately, from our perspective we continue to see a challenging environment in 2026. That’s likely to push into 2027.”</p>\n<p>IDC is not alone in sounding the alarm. Researchers at <a href=\"https://www.theregister.com/2026/02/26/memory_price_hikes/\" target=\"_blank\">Gartner this week</a> also said some types of memory have doubled or quadrupled in price since last year, and Gartner believes DRAM and NAND flash used in PCs and phones is set for a further 130 percent rise by the end of 2026.</p>\n\n<p>Gartner is projecting a drop in PC shipments of more than 10 percent during 2026, and a decline of around 8 percent for smartphones, all due to the AI-driven memory shortage.</p>\n<p>In the PC market, IDC expects the shortages to begin in the second quarter as smaller vendors struggle to obtain supplies unit volumes will “fall off dramatically,” researchers wrote.</p>\n<p>During its earnings call on Thursday, Dell’s chief operating officer and vice chairman <a href=\"https://investors.delltechnologies.com/financial-information/quarterly-results\" rel=\"nofollow\" target=\"_blank\">Jeff Clarke</a> said DRAM prices over the last 6 months are up nearly 5.5x, at $2.39 a gigabit. Meanwhile the cost of NAND is $0.20 a gigabyte; that's up nearly 4x over the last 6 months. He said that analysts are predicting prices in Q2 to be 20% to 50% higher.</p>\n\n<p>In October, Dell reduced the price of PCs to win market share, then in January, the company increased the cost of PCs to adjust for higher memory prices. At the time, the OEM had tens of thousands of deals in the pipeline that had prices adjusted upwards, which immediately took pressure off Dell’s margins, Clarke said.</p>\n<p>“In PCs, we purposely delayed implementing that price move to stay in the hunt to take share and to drive growth, which will serve us for the long run,” Clarke said. “And then when we made the change on January 6, it wasn't 90 days later, it was that day we stabilized margins,” he said.</p>\n<p>During its earnings call this week, <a href=\"https://www.theregister.com/2026/02/25/hp_inc_q1_2026/\" target=\"_blank\">HP revealed</a> that memory now accounts for 35 percent of the cost of materials it needs to build a PC, up from between 15 and 18 percent last quarter. The company expects to see memory prices increase 100 percent sequentially into the next quarter, according to HP CFO Karen Parkhill. The company said it has raised PC prices as a result.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/02/dram_prices_expected_to_double/\">DRAM prices expected to double in Q1 as AI ambitions push memory fabs to their limit</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/14/dram_infrastructure_costs/\">Buy servers now or cry later: DRAM price spike threatens infrastructure budgets</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/20/micron_powerchip_fab_acquisition/\">Micron finds a way to make more DRAM with $1.8bn chip plant purchase</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/06/memory_firm_profits_up_as/\">Mem-ageddon: AI chip frenzy to wallop DRAM prices with 70% hike</a></li>\n</ul>\n<p>And earlier this month <a href=\"https://www.veracast.com/webcasts/lenovo/meetings/7X3Z9C.cfm\" rel=\"nofollow\" target=\"_blank\">Lenovo’s PC boss Luca Rossi</a> said that they will raise their average selling price for PCs in 2026, as the number of available PCs will likely drop.</p>\n<p>“At the moment, we are modeling a mid-single-digit decline for the units. But that decline will be offset by a higher ASP (average selling price) and likely a favorable product mix,” Rossi told investors on Feb. 12. “Hence, the value of the market will not decline. For Lenovo, we will continue to grow at premium to market.”</p>\n<p>Janukowicz said with the top four cloud service providers projected to spend $600 billion this year on AI build outs that require DRAM and NAND – some 70 percent more than last year – the cost of memory will likely not stabilize until 2027.</p>\n<p>“This is not necessarily a short disruption and it reflects a structurally tight environment. This is a message that we’ve heard consistently really since the beginning of 2026,” Janukowicz said. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/memory_drought_pcs_phones_suck/",
            "pub_date": "2026-02-28 08:56:00",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amazon and Nvidia open their wallets to lock in OpenAI's business while SoftBank keeps the lights on",
            "description": "<div id=\"body\">\n<p>The headlines say OpenAI on Friday announced $110 billion in new investment from Amazon, Nvidia, and SoftBank at a $730 billion pre-money valuation, though terms and conditions apply.</p>\n<p>Both Amazon's $50 billion and Nvidia's $30 billion <a href=\"https://openai.com/index/scaling-ai-for-everyone/\" rel=\"nofollow\" target=\"_blank\">investments</a> are tied to massive customer commitments by OpenAI and its partners. </p>\n<p>Of Amazon's investment, $35 billion will only be paid out \"when certain conditions are met.\" From what we gather, those conditions include <a href=\"https://openai.com/index/amazon-partnership/\" rel=\"nofollow\" target=\"_blank\">renting</a> out two gigawatts worth of Amazon's Trainium AI accelerators and the deployment of OpenAI models and services in AWS. The cloud provider will also be the \"exclusive third-party cloud distribution provider for OpenAI Frontier.\"</p>\n\n<p>Announced earlier this month, Frontier is OpenAI's new <a href=\"https://openai.com/index/introducing-openai-frontier/\" target=\"_blank\">agent builder</a> aimed at enterprise customers. Curiously, OpenAI was quick to emphasize that \"nothing about today's announcements in any way changes the terms of the Microsoft and OpenAI relationship,\" and that Azure remains the exclusive cloud provider of its stateless OpenAI APIs and first party products, like Frontier.</p>\n\n\n<p>Nvidia's $30 billion investment appears to have similar provisions. In a <a href=\"https://openai.com/index/scaling-ai-for-everyone/\" rel=\"nofollow\" target=\"_blank\">blog post</a> published on Friday, the AI flag bearer announced an expanded partnership with Nvidia that would see the deployment of three gigawatts of inference and two gigawatts of training capacity built on the GPU slinger's Vera Rubin systems. Announced at CES in January, the racks are expected to begin shipping in the second half of 2026.</p>\n<p>The economics of datacenters can be tricky to pin down as it varies by region, but at a power usage effectiveness of 1.1, a gigawatt is enough for about 3,600 Vera Rubin NVL72 systems, assuming 250 kW per rack. </p>\n\n<p>At an <a href=\"https://www.nextplatform.com/ai/2026/01/06/nvidias-vera-rubin-platform-obsoletes-current-ai-iron-six-months-ahead-of-launch/4092179\" target=\"_blank\">estimated</a> cost of $8.4 million each, that's roughly $30 billion per gigawatt. However, compute only accounts for about half the cost of standing up a modern AI datacenter. </p>\n<p>The land, shell, power, and plumbing costs make up the remainder. This puts the cost of building and deploying 5 gigawatts worth of Vera Rubin accelerators at more than $300 billion. OpenAI is unlikely to take this on itself. Instead, we expect CEO Sam Altman to broker purchase agreements through its hyperscaler and neocloud partners, as it has done with Oracle and Crusoe for its Stargate facility in Abilene, Texas.</p>\n<p>Amazon is one of those partners. While OpenAI may be playing up Trainium in today's disclosures, its <a href=\"https://openai.com/index/aws-and-openai-partnership/\" rel=\"nofollow\" target=\"_blank\">existing</a> $38 billion tie-up with Amazon, <a href=\"https://www.theregister.com/2025/11/03/openai_inks_38b_deal_with_aws/\" target=\"_blank\">announced back in November</a>, was specific to Nvidia GB200 and GB300 systems. That contract has now been extended to $100 billion over the next eight years.</p>\n\n<p>Both Amazon's and Nvidia's investments are structured in such a way as to guarantee a return on every dollar invested in OpenAI. The funding is essentially a discount on compute infrastructure that doesn't dilute their revenues while driving up OpenAI's valuation.</p>\n<p>This kind of circular dealing has become commonplace amid the AI boom, and all the big boys are taking part. Back in October, Nvidia rival AMD <a href=\"https://www.theregister.com/2025/10/06/stargate_openai_amd/\" target=\"_blank\">issued</a> OpenAI a warrant for roughly 10 percent of its stock. To claim it, all Altman needs to do is deploy six gigawatts of the chip designer's Instinct accelerators. This week, AMD <a href=\"https://www.theregister.com/2026/02/24/amd_copypastes_openai_6gw_chipsforstock/\" target=\"_blank\">copied and pasted</a> that deal, extending the same offer to social media and would-be AI magnate Meta.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/26/burger_kings_new_ai/\">Burger King turns to AI to flame broil employees who aren't friendly enough</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/nvidia_q4_2026/\">Nvidia hasn't made a cent in China lately – and might not need to given $120B profit</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/25/openai_asks_its_friends_to/\">OpenAI asks its friends to tell their friends about Frontier</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/23/sam_altman_ai_efficiency/\">Altman: You think AI is wasted energy? Try raising 100 billion humans</a></li>\n</ul>\n<p>While Nvidia and Amazon are clearly engaged in financial engineering, the same doesn't appear to be the case for SoftBank. Infamous spendthrift Masayoshi Son plans to <a href=\"https://group.softbank/en/news/press/20260227\" target=\"_blank\">invest</a> another $30 billion into the company to keep the lights on while Altman and crew continue their search for artificial general intelligence. SoftBank's contribution will be paid out in three tranches of $10 billion beginning in April and wrapping up in October.</p>\n<p>Even with annualized recurring revenue reportedly <a href=\"https://www.reuters.com/business/openai-cfo-says-annualized-revenue-crosses-20-billion-2025-2026-01-19/\" rel=\"nofollow\" target=\"_blank\">exceeding</a> $20 billion and more than 50 million paying subscribers on the books, OpenAI is going to be reliant on outside funding for a while. The company isn't expected to achieve profitability until at least 2029. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/amazon_nvidia_softbank_openai_megadeal/",
            "pub_date": "2026-02-28 09:21:33",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        }
    ]
}