{
    "data": [
        {
            "title": "AI models suck slightly less at math than they did last year",
            "description": "<div id=\"body\">\n<p><span class=\"label\">exclusive</span> Current-day LLMs are prediction engines and, as such, they can only find the most likely solution to problems, which is not necessarily the correct one. Though popular models have mostly become better at math, even top performer Gemini 3 Flash would receive a C if assessed with a letter grade.</p>\n<p>Researchers affiliated with Omni Calculator, a maker of online calculators for specific applications, have subjected a new set of AI models to the company's ORCA Benchmark, which consists of 500 practical math questions.</p>\n<p>In their initial evaluation last November, OpenAI's ChatGPT-5, Google's Gemini 2.5 Flash, Anthropic's Claude Sonnet 4.5, xAI's Grok 4, and DeepSeek's DeepSeek V3.2 (alpha) all did poorly, <a href=\"https://forums.theregister.com/forum/all/2025/11/17/ai_bad_math_orca/\" rel=\"nofollow\">scoring 63 percent or less</a> on math problems.</p>\n\n<p>The latest set of contestants consists of ChatGPT-5.2, Gemini 3 Flash, Grok 4.1, and DeepSeek V3.2 (stable release). Sonnet 4.5 didn't get re-evaluated as it hadn't changed and its successor had not been released during the testing period.</p>\n\n\n<p>For this second round of testing – provided to <em>The Register</em> prior to publication – all the models showed improvement except for Grok-4.1, which regressed.</p>\n<p>Gemini 3.1 Flash saw its accuracy hit 72.8 percent, a gain of 9.8 percentage points from its predecessor. DeepSeek V3.2 reached 55.2 percent, a gain of 3.2 percentage points from its alpha version. ChatGPT 5.2 achieved 54.0 percent accuracy, up 4.6 percentage points. And Grok 4.1 slipped to 60.2 percent, a loss of 2.6 percentage points.</p>\n\n<p>\"A calculator is predictable,\" said Dawid Siuda, researcher at ORCA, in a statement. \"Ask it the same question today or next year, and the answer stays the same. AI doesn't work that way. These systems are predicting the next likely word based on patterns. Mathematically, it's possible for a model to get a question right today and wrong tomorrow.\"</p>\n<p>The researchers attempted to assess the variability of model responses with a metric dubbed \"instability\" – a measure of how often models changed their answers when asked the same question twice.</p>\n\n<p>Gemini 3 Flash proved the most consistent, shifting only 46.1 percent for incorrect responses. ChatGPT, the researchers report, changed its answer 65.2 percent of the time. And DeepSeek V3.2 changed its answer for 68.8 percent of errors.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/26/clade_code_cves/\">Claude collaboration tools left the door wide open to remote code execution</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/veracode_security_ai/\">Rapid AI-driven development makes security unattainable, warns Veracode</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/copilot_pane_edge_outlook/\">Microsoft to auto-launch Copilot in Edge whenever you click a link from Outlook</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/llms_killed_privacy_star/\">LLMs killed the privacy star, we can't rewind, we've gone too far</a></li>\n</ul>\n<p>The <a href=\"https://www.omnicalculator.com/reports/omni-research-on-calculation-in-ai-benchmark#how-we-put-ais-to-the-test\" rel=\"nofollow\">ORCA researchers</a> note that model performance improvements over time differ across domains. DeepSeek, they say, saw its performance on Biology &amp; Chemistry questions go from 10.5 percent accuracy to 43.9 percent. And Gemini 3 Flash reached Math &amp; Conversions accuracy of 93.2 percent, up from 83 percent. Grok 4.1 meanwhile lost 9 percentage points for its accuracy answering Health &amp; Sports problems and lost 5.3 percentage points for Biology &amp; Chemistry. </p>\n<p>The researchers speculate that recent updates to Grok may have prioritized other capabilities than quantitative reasoning.</p>\n<p>Noting that calculation errors now account for 39.8 percent of all mistakes, up from 33.4 percent, and that rounding errors slipped to 25.8 percent, down from 34.7 percent, the ORCA group conclude that AI models are getting better at making the math look right through formatting, while still struggling with arithmetic.</p>\n<p>\"AI models are essentially prediction engines rather than logic engines,\" Siuda told <em>The Register</em> in an email. \"Because they work on probability, they are basically guessing the next most likely number or word based on patterns they have seen before. It is like a student who memorizes every answer in a math book but never actually learns how to add.\"</p>\n\n<p>Siuda said we knew that about models previously and that hasn't changed.</p>\n<p>\"They might get the right answer most of the time, but the second you give them a unique or tricky problem, or multi-step task, they stumble because they are not truly calculating anything,\" he said. \"It's probably impossible to close this gap completely with the current technology, but if we merge LLMs with function calling well enough, it may be possible to solve.\"</p>\n<p>Function calling – farming out arithmetic to a deterministic source – is one way around the poor math handling of models. </p>\n<p>\"Major AI companies like Google and OpenAI are already doing this by having the AI call a function to do the actual calculation,\" explained Siuda. \"The real headache happens with long, messy problems. The AI has to keep track of every little result at each stage, and it usually gets overwhelmed or confused.\"</p>\n<p>Another possible avenue for improvement might be teaching models to verify responses through formal proofs. As noted in <a href=\"https://www.nature.com/articles/s41586-025-09833-y\" rel=\"nofollow\">Nature</a> last November, Google's DeepMind has developed an approach that scored a silver medal result on the International Mathematical Olympiad through reinforcement learning based on proofs developed with the <a href=\"https://lean-lang.org/\" rel=\"nofollow\">Lean</a> programming language and proof assistant.</p>\n<p>But for the time being, trust no AI. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/ai_models_get_better_at/?td=rt-3a",
            "pub_date": "2026-02-28 04:01:31",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China’s ‘The US hacks itself to make us look bad’ theorists return with a crypto conspiracy",
            "description": "<div id=\"body\">\n<p>The Chinese agency that has accused the USA of cyberattacks on its own infrastructure to make Beijing look bad is back with another theory: Washington’s actions against cryptocurrency crooks are just attempts to dominate the global financial system.</p>\n<p>The agency behind these theories is China's National Computer Virus Emergency Response Center (CVERC), which on Thursday published a document titled “Top Player: Analysis of Global Virtual Currency Assets Extortion under the U.S. Technological Hegemony.”</p>\n<p>The gist of it is that US actions such as <a href=\"https://www.theregister.com/2023/06/05/binance_us_sec_lawsuit/\" target=\"_blank\">prosecuting Binance co-founder Zhao Changpeng</a> and chasing alleged cyber-scam camp operator Chen Zhi were not law enforcement actions but attempts to ensure US hegemony over cryptocurrencies and preserve the role of the US dollar as the de facto currency of world trade.</p>\n\n<p>Even US president Donald Trump’s decision to pardon Zhao – which the commander in chief <a href=\"https://www.cbsnews.com/news/trump-pardon-of-crypto-billionaire-sparks-concerns-over-use-of-pardon-power-60-minutes-transcript/\" rel=\"nofollow\" target=\"_blank\">admitted</a> he made without knowing anything about the case – was just a cunning ploy to ensure Binance complied with US law in future so Washington gains more power over global crypto markets.</p>\n\n\n<p>CVERC says the US also targeted crypto outfits to profit by collecting massive fines and auctioning stolen cryptocurrencies retrieved by American authorities. It also accuses Washington of using action against cryptocurrencies to build a strategic reserve of virtual currencies, a Trump administration policy.</p>\n<p>The Chinese agency says Washington’s action against crypto companies is just one of its tactics, including “sponsored cyberattacks, weaponized technical standards, and digital cognitive warfare” that “serves its global expansion of political and economic interests while maintaining global hegemony.”</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2024/10/15/china_volt_typhoon_false_flag/\">China again claims Volt Typhoon cyber-attack crew was invented by the US to discredit it</a></li>\n<li><a href=\"https://www.theregister.com/2025/11/12/cverc_prince_grou_scam_bitcoin/\">China hates crypto and scams, but is now outraged USA acquired bitcoin from a scammer</a></li>\n<li><a href=\"https://www.theregister.com/2025/03/07/trump_signs_bitcoin_reserve_eo/\">Crypto takes a dip as Trump signs Bitcoin Reserve order</a></li>\n<li><a href=\"https://www.theregister.com/2025/04/07/asia_tech_news_in_brief/\">Asian tech players react to US tariffs with delays, doubts, deal-making</a></li>\n</ul>\n<p>The document neglects to mention the inconvenient fact that China has extradited and arrested Chen Zhi – and issued death sentences for others associated with scam camps in Cambodia. Nor does it consider that the proceeds of crypto cases brought by the US Federal government represent a tiny fraction of the nation’s budget.</p>\n<p>CVERC’s screed ends by noting China’s stance on cryptocurrency – they’re dangerous and therefore illegal – and contrasting that with a suggestion the US could exercise extra-territorial jurisdiction to seize crypto anywhere, anytime.</p>\n\n<p>Reality is, of course, rather more nuanced. The US has gone after suspected crypto-crooks outside its territory using well-established international procedures. However, the Trump administration has eased regulation on crypto companies, a contentious action as the Trump family has profited from its own virtual currency ventures. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/chinas_the_us_hacks_itself/?td=rt-3a",
            "pub_date": "2026-02-28 02:01:44",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Anthropic to Pentagon: Autonomous weapons could hurt US troops and civilians",
            "description": "<div id=\"body\">\n<p>Anthropic has fired back at the US Department of War, arguing that it can’t agree to Uncle Sam’s contract demand to remove guardrails on its AI in part because the tech can’t be trusted not to harm American civilians and warfighters.</p>\n<p>As <i>The Register</i> <a href=\"https://www.theregister.com/2026/02/25/pentagon_threatens_anthropic/?_gl=1*18366aj*_ga*MTI0MjE1MDMxNS4xNzE5OTg5NTg5*_ga_JXW44Y23NM*czE3NzIxNTc2ODkkbzE5MzQkZzEkdDE3NzIxNTc2OTYkajUzJGwwJGgw\" target=\"_blank\">reported</a> earlier this week, the US Department of War wants to compel Anthropic to allow unrestricted military use of its Claude tech, and has threatened to cancel the AI upstart’s Pentagon contracts and penalize the company if it does not comply.</p>\n<p>On Thursday, Anthropic issued a <a href=\"https://www.anthropic.com/news/statement-department-of-war\" rel=\"nofollow\" target=\"_blank\">statement</a> in which CEO Dario Amodei said the company won’t change its stance.</p>\n\n<p>“Anthropic understands that the Department of War, not private companies, makes military decisions. We have never raised objections to particular military operations nor attempted to limit use of our technology in an <i>ad hoc</i> manner,” he wrote, before adding “However, in a narrow set of cases, we believe AI can undermine, rather than defend, democratic values.”</p>\n\n\n<p>Amodei said two items in Anthropic’s contract with the department of war are “simply outside the bounds of what today’s technology can safely and reliably do.”</p>\n<p>One of those use cases is mass domestic surveillance, which Amodei said can now create “a comprehensive picture of any person’s life—automatically and at massive scale” with the help of AI. The CEO thinks that’s only legal “because the law has not yet caught up with the rapidly growing capabilities of AI.”</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/26/anthropic_claude_opus_3_blog/\">Anthropic launches new marketing blog, pretends it's being 'written' by 'retired' LLM</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/clade_code_cves/\">Claude collaboration tools left the door wide open to remote code execution</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/24/anthropic_misanthropic_chinese_ai_labs/\">Anthropic accuses China's AI labs of ripping off content – just like it did</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/23/claude_code_security_panic/\">Infosec community panics as Anthropic rolls out Claude code security checker</a></li>\n</ul>\n<p>The second use case is powering fully autonomous weapons, which Amodei says are too dangerous to deploy in their current form.</p>\n<p>“Today, frontier AI systems are simply not reliable enough to power fully autonomous weapons,” he wrote. “We will not knowingly provide a product that puts America’s warfighters and civilians at risk.”</p>\n\n<p>The CEO said Anthropic has “offered to work directly with the Department of War on R&amp;D to improve the reliability of these systems, but they have not accepted this offer.” He also suggested fully autonomous weapons “cannot be relied upon to exercise the critical judgment that our highly trained, professional troops exhibit every day. They need to be deployed with proper guardrails, which don’t exist today.”</p>\n<p>Amodei also pointed out what he believes are inconsistencies in the Pentagon’s approach to this matter, by pointing out that one of its threatened sanctions labels Anthropic a threat to national security for refusing to do as asked, while another seeks to compel the company to remove guardrails on AI in the name of national security.</p>\n<p>“Regardless, these threats do not change our position: we cannot in good conscience accede to their request,” Amodei wrote.</p>\n\n<p>The CEO wrapped his post by expressing his desire his desire for Anthropic to continue supplying the Pentagon, without having to remove its guardrails.</p>\n<p>The statement sets the scene for a showdown with Secretary of War Pete Hegseth, who gave Anthropic a Friday deadline to acquiesce to the Pentagon’s terms and conditions. Hegseth has argued that the USA’s military must focus on warfighting and become more lethal. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/anthropic_pentagon_response/?td=rt-3a",
            "pub_date": "2026-02-28 05:46:33",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BOFH: Nobody would be stupid enough to go live with the mirror system, surely",
            "description": "<div id=\"body\">\n<p><img alt=\"BOFH logo telephone with devil's horns\" class=\"img_float_left\" src=\"https://regmedia.co.uk/2001/09/12/223.jpg\"/><span class=\"label\">Episode 4</span> I'm enjoying a takeaway lunch of onion bhajis in Mission Control when the Boss walks in, accompanied by the Head Beancounter.</p>\n<p>\"Brian's here to get some numbers from you,\" the Boss explains.</p>\n<p>\"Not the enormous primes upon which my banking encryption is based, I hope?\" I ask.</p>\n\n<p>\"?\" the Boss says, glazing over slightly. \"It's for the Board meeting this afternoon. He needs some numbers from you.\"</p>\n\n\n<p>\"Will 13 and 771 do?\"</p>\n<p>\"No. I'm after the time-saving figures that AI's been generating for you,\" the Head Beancounter says.</p>\n\n<p>\"And do you need the time-wasting figures as well?\"</p>\n<p>\"Time wasting?\"</p>\n<p>\"Yeah, you know, the hours of pointless questions that staff have been asking AI. How to meet the right person, how to fix their TV, what spices to add to drinking water to mask the flavor of thallium.\"</p>\n\n<p>\"I... er... \" the Head Beancounter blathers, no doubt making a mental note to bring his own water from now on.</p>\n<p>\"So just the time-saving numbers then?\"</p>\n<p>\"Yes.\"</p>\n<p>\"For the board meeting?\"</p>\n<p>\"Yes. I'm due in... 23 minutes.\"</p>\n<p>\"Yeah, I think I can generate them in about... maybe 17 minutes. &gt;tappity&lt; I could send them... straight to your phone if you want?\"</p>\n<p>\"Yes! Perfect. Now, if you'll excuse me...\"</p>\n<p>The Head Beancounter dashes off to the lift, bumping into the PFY on the way in.</p>\n<p>\"What's going on?\" the PFY asks.</p>\n<p>\"Operation Hoarse Pigeon is a go,\" I murmur.</p>\n<p>\"So it's happening then?\" the PFY says, moving to his desktop.</p>\n<p>\"Yep.\"</p>\n<p>\"What's happening? What's a horse pigeon?\" the Boss asks, confused.</p>\n<p>\"Hoarse Pigeon,\" I say, reviewing the camera footage from outside the Boss's office.</p>\n<p>\"Horse pigeon?\" the Boss repeats.</p>\n<p>\"It's one of our code words,\" the PFY says. \"In this case for 'an attempted coup.'\"</p>\n<p>\"What?\"</p>\n<p>\"Have a nice conversation with the Head Beancounter earlier?\" I ask, finding some relevant video footage.</p>\n<p>\"I... guess so – we just chatted about AI and how it helps us buy computer equipment, and how you're using it to write programs and things like that. He was very interested.\"</p>\n<p>\"Uh-huh.\"</p>\n<p>\"So what do you mean, attempted coup?\" the Boss asks.</p>\n<p>\"There's a board meeting today – and someone just happens to come asking for data at the last minute.\"</p>\n<p>\"So?\"</p>\n<p>\"Just after they've been chatting to you about how AI's basically made us redundant.\"</p>\n<p>\"I...\"</p>\n<p>\"And he looked smug. That's one coincidence too many.\"</p>\n<p>\"Aren't you being a bit... paranoid?\"</p>\n<p>\"I wasn't paranoid in 01 when the colored pencil office wanted to do their own IT purchasing because they used the most expensive desktops. I wasn't paranoid in 2010, 2014, and 2016 – when the Beancounters said we didn't need an IT support department.\"</p>\n<p>\"Really?\" the Boss asks, doubtfully.</p>\n<p>\"Yeah. See, we oversee a stack of IT purchases every year,\" I explain. \"We approve or reject hundreds of high-value items.\"</p>\n<p>\"And?\"</p>\n<p>\"And people don't like it. They don't want us rejecting their oddball orders – like a 'portable laptop' with an 85-inch screen.\"</p>\n<p>\"And everyone wants an 85-inch screen,\" the PFY says. \"But you don't need to worry about that. What you should be worried about is that you'll be the first to go if the coup is successful. They'll do your exit interview and portfolio handover in the lift on the way out of the building this afternoon.\"</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/13/bofh_2026_episode_3/\"><abbr title=\"Bastard Operator from Hell\">BOFH</abbr>: Loss adjuster discovers liability is a two-way street</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/30/bofh_2026_episode_2/\"><abbr title=\"Bastard Operator from Hell\">BOFH</abbr>: Eight pints of a lager and a management breakthrough</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/16/bofh_2026_episode_1/\"><abbr title=\"Bastard Operator from Hell\">BOFH</abbr>: Every computer system eventually serves ads</a></li>\n<li><a href=\"https://www.theregister.com/2025/12/27/bofh_2025_episode_25/\"><abbr title=\"Bastard Operator from Hell\">BOFH</abbr>: The Christmas spirit has run dry – time to show some chiller instinct</a></li>\n</ul>\n<p>\"I... You've got to do something!\" the Boss gasps.</p>\n<p>\"No kidding,\" I reply. \"In the old days, we'd have a carrot and stick chat with board members about how an 85-inch screen might look nice in their drawing room and how they might want to flush the contents of their web cache – that sort of thing.\"</p>\n<p>\"I... and now?\"</p>\n<p>\"Now we take a more holistic view – and notice anomalies long before anything happens. Like the Head Beancounter asking our cloud hosting company to run up a mirror copy of financials without telling us – no doubt to prove that they can run their systems as well as we can.\"</p>\n<p>\"So you stopped it?\"</p>\n<p>\"No, we let them do it. I mean, it's not like they'd go live on the mirror system – just to prove a point at a Board meeting. That would be irresponsible.\"</p>\n<p>\"Did they go live?!\" the Boss asks.</p>\n<p>\"I certainly hope not. Not when the mirror system's got the same admin password as our system. Who knows what might happen to the data? Someone could change the currency from pounds to Turkish lira!\"</p>\n<p>\"Or bananas,\" the PFY adds. \"Or maybe they'd just delete several thousand transactions from the financials data.\"</p>\n<p>\"Or add several thousand transactions to the financials data,\" I suggest.</p>\n<p>\"Or maybe all three,\" the PFY says. \"Which is why they'd never go live. That would be madness.\"</p>\n<p>...</p>\n<p>A picture of the boardroom appears on the PFY's screen, and we notice the Head Beancounter sitting quietly, waiting for his moment.</p>\n<p>It doesn't go well.</p>\n<p>...</p>\n<p>The Head Beancounter is in Mission Control and he's not happy. Apparently, the Board didn't appreciate his presentation, nor the possible ramifications of missing transactions. His raging is interrupted by a phone call on my desk phone. From the boardroom.</p>\n<p>\"Yes?\" I say, listening intently. \"I see. Yes. No. I'm sure we can sort it out. You're sure? Consider it done.\"</p>\n<p>\"What's done?\" the Head Beancounter asks after I put the phone down.</p>\n<p>\"Oh, nothing,\" I say, turning to the PFY. \"Operation High Flyer.\"</p>\n<p>\"Oh,\" the PFY says, secretly operating the release lever on the office window. \"Is that someone breaking into your car?\"</p>\n<p>\"What?!\" the Head Beancounter says, heading over.</p>\n<p>...</p>\n<p>Uprising quelled.</p>\n<ul>\n<li><a href=\"https://www.theregister.com/data_centre/bofh/\">BOFH: Previous episodes on <em>The Register</em></a></li>\n<li><a href=\"http://www.bofharchive.com/\" target=\"_blank\">The Compleat BOFH Archives 95-99</a></li>\n</ul> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/bofh_2026_episode_4/?td=rt-3a",
            "pub_date": "2026-02-28 02:01:44",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PCs and phones to get more boring and expensive in 2026 thanks to memory drought",
            "description": "<div id=\"body\">\n<p>The next wave of smartphones and PCs will have less memory and fewer capabilities, yet are likely to cost consumers 14 percent more as AI ambitions eat all available memory supplies, according to researchers at IDC.</p>\n<p>IDC said that the <a href=\"https://www.idc.com/resource-center/blog/higher-asps-lower-unit-volumes-how-the-memory-crisis-is-reshaping-the-pc-and-smartphone-outlook/\" rel=\"nofollow\" target=\"_blank\">worsening memory</a> market has caused its outlook to deteriorate just since December. The analysts are penciling in a decline in the PC market of 11.3 percent in 2026 – about 26 percent worse than they had guessed in December – and a decline in the smartphone market of 12.9 percent, which is more than double the 5.2 percent drop they predicted as a worst-case scenario just two months back.</p>\n<p>“This is perhaps the biggest challenge the industry has faced since its inception,” said Nabilia Popal, IDC’s senior research director global consumer devices, during a roundtable video discussion posted Thursday. “This is not just a temporary situation. This is going to result in a structural reset of the entire industry, in terms of size, in terms of competitive landscape, of the product mix and also on the price.”</p>\n\n<p>To mitigate the cost and the short supply, IDC expects consumers to hang on to devices longer, or turn to used and refurbished units. Device makers meanwhile are likely to downgrade memory on their least expensive devices, optimize features around using less memory, or in some cases turn to Chinese suppliers that they've avoided over geopolitical or technical concerns.</p>\n\n\n<p>“Any meaningful impact is expected to take some time,” Jeff Janukowicz, research vice president at IDC, said in a video posted Thursday. \"So ultimately, from our perspective we continue to see a challenging environment in 2026. That’s likely to push into 2027.”</p>\n<p>IDC is not alone in sounding the alarm. Researchers at <a href=\"https://www.theregister.com/2026/02/26/memory_price_hikes/\" target=\"_blank\">Gartner this week</a> also said some types of memory have doubled or quadrupled in price since last year, and Gartner believes DRAM and NAND flash used in PCs and phones is set for a further 130 percent rise by the end of 2026.</p>\n\n<p>Gartner is projecting a drop in PC shipments of more than 10 percent during 2026, and a decline of around 8 percent for smartphones, all due to the AI-driven memory shortage.</p>\n<p>In the PC market, IDC expects the shortages to begin in the second quarter as smaller vendors struggle to obtain supplies unit volumes will “fall off dramatically,” researchers wrote.</p>\n<p>During its earnings call on Thursday, Dell’s chief operating officer and vice chairman <a href=\"https://investors.delltechnologies.com/financial-information/quarterly-results\" rel=\"nofollow\" target=\"_blank\">Jeff Clarke</a> said DRAM prices over the last 6 months are up nearly 5.5x, at $2.39 a gigabit. Meanwhile the cost of NAND is $0.20 a gigabyte; that's up nearly 4x over the last 6 months. He said that analysts are predicting prices in Q2 to be 20% to 50% higher.</p>\n\n<p>In October, Dell reduced the price of PCs to win market share, then in January, the company increased the cost of PCs to adjust for higher memory prices. At the time, the OEM had tens of thousands of deals in the pipeline that had prices adjusted upwards, which immediately took pressure off Dell’s margins, Clarke said.</p>\n<p>“In PCs, we purposely delayed implementing that price move to stay in the hunt to take share and to drive growth, which will serve us for the long run,” Clarke said. “And then when we made the change on January 6, it wasn't 90 days later, it was that day we stabilized margins,” he said.</p>\n<p>During its earnings call this week, <a href=\"https://www.theregister.com/2026/02/25/hp_inc_q1_2026/\" target=\"_blank\">HP revealed</a> that memory now accounts for 35 percent of the cost of materials it needs to build a PC, up from between 15 and 18 percent last quarter. The company expects to see memory prices increase 100 percent sequentially into the next quarter, according to HP CFO Karen Parkhill. The company said it has raised PC prices as a result.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/02/dram_prices_expected_to_double/\">DRAM prices expected to double in Q1 as AI ambitions push memory fabs to their limit</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/14/dram_infrastructure_costs/\">Buy servers now or cry later: DRAM price spike threatens infrastructure budgets</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/20/micron_powerchip_fab_acquisition/\">Micron finds a way to make more DRAM with $1.8bn chip plant purchase</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/06/memory_firm_profits_up_as/\">Mem-ageddon: AI chip frenzy to wallop DRAM prices with 70% hike</a></li>\n</ul>\n<p>And earlier this month <a href=\"https://www.veracast.com/webcasts/lenovo/meetings/7X3Z9C.cfm\" rel=\"nofollow\" target=\"_blank\">Lenovo’s PC boss Luca Rossi</a> said that they will raise their average selling price for PCs in 2026, as the number of available PCs will likely drop.</p>\n<p>“At the moment, we are modeling a mid-single-digit decline for the units. But that decline will be offset by a higher ASP (average selling price) and likely a favorable product mix,” Rossi told investors on Feb. 12. “Hence, the value of the market will not decline. For Lenovo, we will continue to grow at premium to market.”</p>\n<p>Janukowicz said with the top four cloud service providers projected to spend $600 billion this year on AI build outs that require DRAM and NAND – some 70 percent more than last year – the cost of memory will likely not stabilize until 2027.</p>\n<p>“This is not necessarily a short disruption and it reflects a structurally tight environment. This is a message that we’ve heard consistently really since the beginning of 2026,” Janukowicz said. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/memory_drought_pcs_phones_suck/",
            "pub_date": "2026-02-28 06:06:07",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Engineer held hostage by client who asked for the wrong fix",
            "description": "<div id=\"body\">\n<p><span class=\"label\">On Call</span> Friday has arrived, bringing a promise of fleeting freedom – and a new instalment of On Call, <em>The Register</em>'s reader-contributed column that retells your tales of tech support incidents that became memorable for all the wrong reasons.</p>\n<p>This week, meet a reader we'll Regomize as \"Kent\" who told us he once worked as a field engineer and shares a story of the time a client dispatched him to a private datacenter to replace a failed system board in an HP server.</p>\n<p>\"A straightforward job,\" Kent told On Call. \"Board swap, set serial number and BIOS options, bring it through POST, confirm hardware health, hand it back. Flee.\"</p>\n\n<p>Kent arrived at the datacenter and made it through what he called \"the usual mantrap routine\" – the combination of revolving doors and swipe-card barriers that properly secure datacenters use to regulate entries and exits.</p>\n\n\n<p>Once inside he found the server, tested to verify the system board had failed – and saw it had. He therefore replaced it, reseated the RAM and CPU, put everything back together and turned the machine on.</p>\n<p>It booted, everything worked as intended, and the client's admin logged in and verified all was well – and then started talking to someone else about what sounded like a software upgrade.</p>\n\n<p>Kent didn't stick around to learn more.</p>\n<p>\"My brief was to swap a board. The board was swapped,\" he told On Call. So he packed up the failed board and his tools, then left.</p>\n<p>On his way out, Kent swiped his card and the mantrap gate didn't open. A short time later he tried again, without success.</p>\n\n<p>\"After a few minutes I called out to the security desk behind the glass and the guard checked his screen and said: ‘We've been told to hold you. The admin says there's still a problem with the server.'\"</p>\n<p>This was a surprise to Kent, who just a few minutes earlier had watched the server boot and heard the client's admin acknowledge the fact.</p>\n<p>Fifteen minutes later nobody had explained what was going on.</p>\n<p>Kent called his dispatcher, who called the client. \"The message relayed back was that they were 'still having issues,' and I was not to be released until they were resolved.\"</p>\n<p>\"At this point I was no longer a field engineer. I was collateral,\" Kent told On Call.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/20/on_call/\">Desktop tech sent to prison for an education on strange places to put tattoos</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/13/on_call/\">Enforcing piracy policy earned helpdesk worker death threats</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/06/on_call/\">New hire fixed a problem so fast, their boss left to become a yoga instructor</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/30/on_call/\">In-house techies fixed faults before outsourced help even noticed they'd happened</a></li>\n</ul>\n<p>One hour and forty-five minutes later, Kent's supervisor called for a three-way chat with the client.</p>\n<p>\"The tone had shifted,\" Kent wrote. \"My supervisor calmly informed them that if I was not released immediately, I had two options available to me: pull the fire alarm inside the datacenter or call Police.\"</p>\n<p>The client decided to let Kent leave.</p>\n<p>He later learned why he'd been detained.</p>\n<p>\"An application running on the server was malfunctioning,\" he told On Call. \"The application vendor blamed the operating system. The operating system vendor suggested the hardware might be unstable. The hardware had just had a board replaced. Therefore, the man who replaced the board must be the problem.\"</p>\n<p>20 minutes after Kent left the datacenter, his phone rang.</p>\n<p>\"The client's admin called my mobile – not to apologize, but to inform me that I was banned from the site.\"</p>\n<p>Kent thinks his crime was to successfully replace a motherboard in a server that ran a buggy application.</p>\n<p>\"My brief was to swap a board,\" he told On Call. \"The board was swapped.\"</p>\n<p>Has a client or a colleague ever kept you on site against your will? If so, release your story by <a href=\"mailto:oncall@theregister.com\" target=\"_blank\">clicking here</a> to send On Call an email so we can share your story on a future Friday. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/on_call/?td=rt-3a",
            "pub_date": "2026-02-28 02:01:44",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amazon and Nvidia open their wallets to lock in OpenAI's business while SoftBank keeps the lights on",
            "description": "<div id=\"body\">\n<p>The headlines say OpenAI on Friday announced $110 billion in new investment from Amazon, Nvidia, and SoftBank at a $730 billion pre-money valuation, though terms and conditions apply.</p>\n<p>Both Amazon's $50 billion and Nvidia's $30 billion <a href=\"https://openai.com/index/scaling-ai-for-everyone/\" rel=\"nofollow\" target=\"_blank\">investments</a> are tied to massive customer commitments by OpenAI and its partners. </p>\n<p>Of Amazon's investment, $35 billion will only be paid out \"when certain conditions are met.\" From what we gather, those conditions include <a href=\"https://openai.com/index/amazon-partnership/\" rel=\"nofollow\" target=\"_blank\">renting</a> out two gigawatts worth of Amazon's Trainium AI accelerators and the deployment of OpenAI models and services in AWS. The cloud provider will also be the \"exclusive third-party cloud distribution provider for OpenAI Frontier.\"</p>\n\n<p>Announced earlier this month, Frontier is OpenAI's new <a href=\"https://openai.com/index/introducing-openai-frontier/\" target=\"_blank\">agent builder</a> aimed at enterprise customers. Curiously, OpenAI was quick to emphasize that \"nothing about today's announcements in any way changes the terms of the Microsoft and OpenAI relationship,\" and that Azure remains the exclusive cloud provider of its stateless OpenAI APIs and first party products, like Frontier.</p>\n\n\n<p>Nvidia's $30 billion investment appears to have similar provisions. In a <a href=\"https://openai.com/index/scaling-ai-for-everyone/\" rel=\"nofollow\" target=\"_blank\">blog post</a> published on Friday, the AI flag bearer announced an expanded partnership with Nvidia that would see the deployment of three gigawatts of inference and two gigawatts of training capacity built on the GPU slinger's Vera Rubin systems. Announced at CES in January, the racks are expected to begin shipping in the second half of 2026.</p>\n<p>The economics of datacenters can be tricky to pin down as it varies by region, but at a power usage effectiveness of 1.1, a gigawatt is enough for about 3,600 Vera Rubin NVL72 systems, assuming 250 kW per rack. </p>\n\n<p>At an <a href=\"https://www.nextplatform.com/ai/2026/01/06/nvidias-vera-rubin-platform-obsoletes-current-ai-iron-six-months-ahead-of-launch/4092179\" target=\"_blank\">estimated</a> cost of $8.4 million each, that's roughly $30 billion per gigawatt. However, compute only accounts for about half the cost of standing up a modern AI datacenter. </p>\n<p>The land, shell, power, and plumbing costs make up the remainder. This puts the cost of building and deploying 5 gigawatts worth of Vera Rubin accelerators at more than $300 billion. OpenAI is unlikely to take this on itself. Instead, we expect CEO Sam Altman to broker purchase agreements through its hyperscaler and neocloud partners, as it has done with Oracle and Crusoe for its Stargate facility in Abilene, Texas.</p>\n<p>Amazon is one of those partners. While OpenAI may be playing up Trainium in today's disclosures, its <a href=\"https://openai.com/index/aws-and-openai-partnership/\" rel=\"nofollow\" target=\"_blank\">existing</a> $38 billion tie-up with Amazon, <a href=\"https://www.theregister.com/2025/11/03/openai_inks_38b_deal_with_aws/\" target=\"_blank\">announced back in November</a>, was specific to Nvidia GB200 and GB300 systems. That contract has now been extended to $100 billion over the next eight years.</p>\n\n<p>Both Amazon's and Nvidia's investments are structured in such a way as to guarantee a return on every dollar invested in OpenAI. The funding is essentially a discount on compute infrastructure that doesn't dilute their revenues while driving up OpenAI's valuation.</p>\n<p>This kind of circular dealing has become commonplace amid the AI boom, and all the big boys are taking part. Back in October, Nvidia rival AMD <a href=\"https://www.theregister.com/2025/10/06/stargate_openai_amd/\" target=\"_blank\">issued</a> OpenAI a warrant for roughly 10 percent of its stock. To claim it, all Altman needs to do is deploy six gigawatts of the chip designer's Instinct accelerators. This week, AMD <a href=\"https://www.theregister.com/2026/02/24/amd_copypastes_openai_6gw_chipsforstock/\" target=\"_blank\">copied and pasted</a> that deal, extending the same offer to social media and would-be AI magnate Meta.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/26/burger_kings_new_ai/\">Burger King turns to AI to flame broil employees who aren't friendly enough</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/nvidia_q4_2026/\">Nvidia hasn't made a cent in China lately – and might not need to given $120B profit</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/25/openai_asks_its_friends_to/\">OpenAI asks its friends to tell their friends about Frontier</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/23/sam_altman_ai_efficiency/\">Altman: You think AI is wasted energy? Try raising 100 billion humans</a></li>\n</ul>\n<p>While Nvidia and Amazon are clearly engaged in financial engineering, the same doesn't appear to be the case for SoftBank. Infamous spendthrift Masayoshi Son plans to <a href=\"https://group.softbank/en/news/press/20260227\" target=\"_blank\">invest</a> another $30 billion into the company to keep the lights on while Altman and crew continue their search for artificial general intelligence. SoftBank's contribution will be paid out in three tranches of $10 billion beginning in April and wrapping up in October.</p>\n<p>Even with annualized recurring revenue reportedly <a href=\"https://www.reuters.com/business/openai-cfo-says-annualized-revenue-crosses-20-billion-2025-2026-01-19/\" rel=\"nofollow\" target=\"_blank\">exceeding</a> $20 billion and more than 50 million paying subscribers on the books, OpenAI is going to be reliant on outside funding for a while. The company isn't expected to achieve profitability until at least 2029. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/amazon_nvidia_softbank_openai_megadeal/",
            "pub_date": "2026-02-28 04:11:46",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oak Ridge spawns institute to curb AI datacenter power surge",
            "description": "<div id=\"body\">\n<p>Oak Ridge National Laboratory (ORNL) is hoping to turn its technical expertise to the problem of growing electricity demand from AI datacenters.</p>\n<p>The US federal research center in Tennessee is launching the <a href=\"https://www.ornl.gov/nextgendatacenters\" rel=\"nofollow\" target=\"_blank\">Next Generation Data Centers Institute</a> (NGDCI) in support of national energy and AI priorities, though any lessons learned will likely apply globally as well.</p>\n<p>As an internal \"institute within an institute,\" NGDCI aims to bring together the laboratory's facilities and expertise spanning energy, high-performance computing, cybersecurity, and grid technology. The ultimate goal is to ensure that America's rapidly growing AI infrastructure remains secure, efficient, and reliable, the lab says.</p>\n\n<p>\"Artificial intelligence is transforming every part of our society, but its energy appetite is unlike anything we've seen before,\" ORNL Director Stephen Streiffer stated.</p>\n\n\n<p>\"The electricity required to power AI datacenters is expected to double or triple in the coming decade, straining infrastructure that is already under pressure. ORNL is uniquely positioned to meet this challenge.\"</p>\n<p>Efforts will cover six research areas: thermal management, power system architecture, grid integration, security, integrated systems modeling, and operational load management.</p>\n\n<p>Thermal management will focus on the next generation of cooling tech, as ORNL claims current systems may account for 40 to 60 percent of a datacenter's total energy consumption. Research into power system architecture will look at <a href=\"https://www.theregister.com/2025/12/22/ai_power_datacenter/\" target=\"_blank\">how energy flows from source to server</a>, bringing in ideas such as direct current and new power electronics to reduce losses.</p>\n<p>Security considerations will look at embedding <a href=\"https://www.energy.gov/ceser/cyber-informed-engineering\" rel=\"nofollow\" target=\"_blank\">cyber-informed engineering</a> (an actual thing, apparently) into the infrastructure of datacenters, along with quantum-safe communications.</p>\n<p>Integrated systems modeling aims to look beyond the walls of the datacenter to anticipate how AI infrastructure may impact energy, jobs, materials, and US competitiveness through the 2030s and beyond.</p>\n\n<p>ORNL says that with the ballooning energy requirements of giant data campuses, the US grid cannot absorb the projected load growth without new approaches to planning and operation. But addressing the problem with intelligent integration that links power, cooling, thermal management, workload scheduling, and AI-enabled forecasting could turn it into an advantage.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/14/x_energy_smr_fuel/\">Amazon-backed X-Energy gets green light for mini reactor fuel production</a></li>\n<li><a href=\"https://www.theregister.com/2025/12/17/smr_investment/\">All aglow about DCs, investors launch $300M at microreactor startup</a></li>\n<li><a href=\"https://www.theregister.com/2025/11/27/arm_riscv_hpc/\">HPC won't be an x86 monoculture forever – and it's starting to show</a></li>\n<li><a href=\"https://www.theregister.com/2025/11/26/the_exascale_offensive/\">The exascale offensive: America's race to rule AI HPC</a></li>\n</ul>\n<p>\"We envision a future where datacenters are national assets: adaptive, efficient, and strengthening the nation's grid while fueling discovery and advancing America's leadership in AI,\" enthused Robert Wagner, ORNL associate laboratory director for energy science and technology.</p>\n<p>Notable names in the AI datacenter arena, including chipmakers Nvidia and AMD, welcomed the move.</p>\n<p>\"For decades, national labs like ORNL have relied on close collaboration with the computing industry to advance high-performance computing, and the next generation of AI is redefining requirements at the intersection of compute, power, and the grid. NGDCI is designed to address those challenges at scale,\" commented Forrest Norrod, the head of AMD's Data Center Solutions Business.</p>\n<p>ORNL is also part of the \"<a href=\"https://www.theregister.com/2025/12/11/doe_genesis_mission_funding/\" target=\"_blank\">Genesis Mission</a>,\" an initiative launched last year by the Trump administration as a national effort to develop and use AI for scientific discoveries, pooling supercomputers and other facilities from the numerous national labs with resources from industry and academia.</p>\n<p>As part of its contribution, the lab is preparing to deploy the <a href=\"https://www.theregister.com/2025/10/27/hpe_discovery_frontier_successor/\" target=\"_blank\">Discovery and Lux</a> supercomputers. Announced in October, Discovery is set to be a successor to Frontier, the world's first exascale system, while Lux is an AI cluster intended to advance machine learning. NGDCI will focus on the technologies required to operate these systems reliably while accelerating scientific breakthroughs, ORNL says. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/oak_ridge_datacenter_power/",
            "pub_date": "2026-02-28 06:21:28",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Suspected Nork digital intruders caught breaking into US healthcare, education orgs",
            "description": "<div id=\"body\">\n<p>Digital intruders with possible links to North Korea have been infecting US education and healthcare sectors with a never-before-seen backdoor since at least December, according to security researchers.</p>\n<p>\"We observed that the attacker had infected several educational institutions, including a university that is connected to several other institutions, indicating a potential wider attack surface,\" Cisco Talos researcher Chetan Raghuprasad told <em>The Register</em>. \"Additionally, one of the affected entities was a healthcare facility, specifically for elderly care. </p>\n<p>\"Based on the nature of the victimology in the current intrusions, the actor likely has a motive for financial gain,\" Raghuprasad added.</p>\n\n<p>Talos <a href=\"https://blog.talosintelligence.com/new-dohdoor-malware-campaign/\" rel=\"nofollow\" target=\"_blank\">spotted the ongoing campaign</a>, attributed to a group it tracks as UAT-10027, and says \"with low confidence\" that it's a North Korean crew based on similarities to Lazarus Group and other Pyongyang-backed gangs.</p>\n\n\n<p>The attackers likely gain initial access via social engineering and phishing, we're told, and the multi-stage infection ultimately delivers a new backdoor, Dohdoor, which shares similar technical characteristics to Lazarus Group's <a href=\"https://s2w.inc/en/resource/detail/941\" rel=\"nofollow\">Lazarloader</a> malware.</p>\n<p>After gaining access - potentially through a phishing email - the intruders execute a PowerShell downloader that runs a Windows batch script dropper from a remote staging server. The batch script then orchestrates a dynamic-link library (DLL) sideloading technique to execute a malicious Windows DLL named \"propsys.dll\" or \"batmeter.dll.\"</p>\n<h3 class=\"crosshead\">Brand new Dohdoor</h3>\n<p>The DLL, which Talos calls \"Dohdoor,\" operates as a loader, and it downloads, decrypts, and executes malicious payloads within legitimate Windows processes. This gives the intruders backdoor access to the victim's environment so it can download the next payload - a Cobalt Strike Beacon - into the machine's memory.</p>\n<p>UAT-10027 uses several stealthy techniques to help it avoid detection, including setting up command-and-control (C2) domains using Cloudflare infrastructure and using a technique called DNS-over-HTTPS to resolve the C2 server IP address. This helps the attackers bypass DNS security tools by ensuring all outbound traffic from compromised machines looks like legitimate HTTPS traffic to a trusted IP address.</p>\n\n<p>Dohoor also uses a technique called process hollowing to inject the payload into a legitimate Windows binary, allowing the malware to run without being detected.</p>\n<p>Additionally, Talos observed the new backdoor using an endpoint detection and response (EDR) bypass technique to bypass endpoint security tools that monitor Windows API calls. The backdoor does this by by unhooking system calls through user mode hooks in ntdll.dll.</p>\n<p>\"The NTDLL unhooking technique used to bypass EDR monitoring by identifying and restoring system call stubs aligns with features found in earlier Lazarloader variants,\" Talos' researchers Alex Karkins and Chetan Raghuprasad said in a Thursday report.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/24/north_koreas_lazarus_group_healthcare_medusa_ransomware/\">North Korea's Lazarus Group targets healthcare orgs with Medusa ransomware</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/09/pyongyangs_cyberspies_are_turning_qr/\">QR codes a powerful new phishing weapon in hands of Pyongyang cyberspies</a></li>\n<li><a href=\"https://www.theregister.com/2025/12/18/amazon_blocked_fake_dprk_workers/\">Amazon blocked 1,800 suspected North Korean scammers seeking jobs</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/01/ai_security_startup_ceo_posts/\">AI security startup CEO posts a job. Deepfake candidate applies, inner turmoil ensues</a></li>\n</ul>\n<p>They also noted that using DNS-over-HTTPS (DoH) via Cloudflare's DNS service, the process hollowing technique, and sideloading malicious DLLs in disguised file name \"propsys.dll,\" have all been used in earlier Lazarus campaigns.</p>\n<p>\"While UAT-10027's malware shares technical overlaps with the Lazarus Group, the campaign's focus on the education and health care sectors deviates from Lazarus' typical profile of cryptocurrency and defense targeting,\" the duo said. </p>\n\n<p>That assertion may be slightly out of date: Symantec and Carbon Black threat hunters earlier this week warned that <a href=\"https://www.theregister.com/2026/02/24/north_koreas_lazarus_group_healthcare_medusa_ransomware/\" target=\"_blank\">Lazarus has begun using Medusa ransomware</a> in extortion attacks targeting at least one US healthcare organization.</p>\n<p>One of Lazarus' most prolific subgroups, Andariel, which acts as the cyber-arm of North Korea's military intelligence agency, has previously used <a href=\"https://www.theregister.com/2022/08/10/maui_ransomware_andariel/\" target=\"_blank\">Maui</a> and <a href=\"https://unit42.paloaltonetworks.com/north-korean-threat-group-play-ransomware/\" rel=\"nofollow\" target=\"_blank\">Play ransomware</a> in its intrusions - including those targeting the healthcare sector. Additionally, <a href=\"https://www.theregister.com/2026/01/09/pyongyangs_cyberspies_are_turning_qr/\" target=\"_blank\">Kimsuky</a>, another one of Pyongyang's intelligence-gathering goon squads, has hit the <a href=\"https://globalcyberalliance.org/aide-data-kimsuky/#:~:text=The%20group%20is%20primarily%20targeting,group%27s%20sophisticated%20global%20reconnaissance%20operations\" rel=\"nofollow\" target=\"_blank\">education sector</a> in its campaigns. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/suspected_nork_digital_intruders_caught/",
            "pub_date": "2026-02-28 04:01:31",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Harvard boffins finally crack the mystery of squeaky sneakers",
            "description": "<div id=\"body\">\n<p>It is a sound evocative of high school: the characteristic squeak of sneakers on a basketball court. UK readers may, however, be familiar with the same sound from their trainers while playing badminton.</p>\n<p>Whichever it is, how exactly the sound is produced has been a mystery - until now.</p>\n<p>The high-pitched tones have often been attributed to the “stick-slip phenomenon,” which creates the sound from a violin bow moving against the instrument’s string. You can still read the explanation on the <a href=\"https://en.wikipedia.org/wiki/Stick%E2%80%93slip_phenomenon\" target=\"_blank\">Wikipedia page</a>.</p>\n\n<p>But the problem is that the sound tends to show up at high sliding speeds, while it also has a well-defined pitch, the frequency of which is difficult to explain.</p>\n\n\n<p>A team led by Harvard University postdoctoral researcher Adel Djellouli carried out an experimental analysis of the phenomenon and came up with an alternative to the stick-slip explanation.</p>\n<p>They replicated the sneaker-court interface by testing rubber blocks sliding against a special glass plate. Light shone into the glass at an angle and was trapped inside — a phenomenon known as total internal reflection — and only released when the rubber made contact with the plate. The researchers were able to record the contact regions using a high-speed camera.</p>\n\n<p>The results showed that the squeaking sound is produced by wave-like patterns across the rubber surface, contacting and then releasing from the glass, allowing the sliding between the surfaces. The waves move across the interface between the two materials at a speed of nearly 300 kilometers per hour.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/26/nasa_safety_artemis/\">NASA safety watchdog says it's time to rethink Moon landing</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/moon_magnetic_field/\">Moon's mighty magnetic field was a 5,000-year titanium blip</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/25/hubble_orbit_decay/\">Hubble in a death spiral that could end as early as 2028 without a reboost</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/23/pop_album_fatal_car_accidents/\">Pop music fans literally dying to stream hot new albums – in car crashes, that is</a></li>\n</ul>\n<p>The Harvard team also found that including ridges in the rubber akin to the sole of a sneaker produced a dramatic effect. “In flat samples, these pulses are irregular and generate broadband acoustic emissions. Introducing thin surface ridges confines pulse propagation, yielding a consistent repetition frequency matching the first shear mode of the sliding block and squeaking at that frequency,” the paper, <a href=\"https://www.nature.com/articles/s41586-026-10132-3\" target=\"_blank\">published in Nature this week</a>, said.</p>\n<p>In an accompanying article, Bart Weber from the University of Amsterdam wrote that “The study not only explains a familiar sound but also reveals how much complexity can hide in the seemingly simple act of sliding.”</p>\n<p>The researchers also observed tiny triboelectric discharges, brief flashes of light that appear capable of triggering the surface waves.</p>\n<p>Aside from explaining a curious effect from high school days, the researchers point to further work that could help enhance or reduce the effect, Weber said. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/harvard_boffins_squeaky_sneakers/",
            "pub_date": "2026-02-28 06:26:44",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        }
    ]
}