{
    "data": [
        {
            "title": "Anthropic to Pentagon: Autonomous weapons could hurt US troops and civilians",
            "description": "<div id=\"body\">\n<p>Anthropic has fired back at the US Department of War, arguing that it can’t agree to Uncle Sam’s contract demand to remove guardrails on its AI in part because the tech can’t be trusted not to harm American civilians and warfighters.</p>\n<p>As <i>The Register</i> <a href=\"https://www.theregister.com/2026/02/25/pentagon_threatens_anthropic/?_gl=1*18366aj*_ga*MTI0MjE1MDMxNS4xNzE5OTg5NTg5*_ga_JXW44Y23NM*czE3NzIxNTc2ODkkbzE5MzQkZzEkdDE3NzIxNTc2OTYkajUzJGwwJGgw\" target=\"_blank\">reported</a> earlier this week, the US Department of War wants to compel Anthropic to allow unrestricted military use of its Claude tech, and has threatened to cancel the AI upstart’s Pentagon contracts and penalize the company if it does not comply.</p>\n<p>On Thursday, Anthropic issued a <a href=\"https://www.anthropic.com/news/statement-department-of-war\" rel=\"nofollow\" target=\"_blank\">statement</a> in which CEO Dario Amodei said the company won’t change its stance.</p>\n\n<p>“Anthropic understands that the Department of War, not private companies, makes military decisions. We have never raised objections to particular military operations nor attempted to limit use of our technology in an <i>ad hoc</i> manner,” he wrote, before adding “However, in a narrow set of cases, we believe AI can undermine, rather than defend, democratic values.”</p>\n\n\n<p>Amodei said two items in Anthropic’s contract with the department of war are “simply outside the bounds of what today’s technology can safely and reliably do.”</p>\n<p>One of those use cases is mass domestic surveillance, which Amodei said can now create “a comprehensive picture of any person’s life—automatically and at massive scale” with the help of AI. The CEO thinks that’s only legal “because the law has not yet caught up with the rapidly growing capabilities of AI.”</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/26/anthropic_claude_opus_3_blog/\">Anthropic launches new marketing blog, pretends it's being 'written' by 'retired' LLM</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/clade_code_cves/\">Claude collaboration tools left the door wide open to remote code execution</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/24/anthropic_misanthropic_chinese_ai_labs/\">Anthropic accuses China's AI labs of ripping off content – just like it did</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/23/claude_code_security_panic/\">Infosec community panics as Anthropic rolls out Claude code security checker</a></li>\n</ul>\n<p>The second use case is powering fully autonomous weapons, which Amodei says are too dangerous to deploy in their current form.</p>\n<p>“Today, frontier AI systems are simply not reliable enough to power fully autonomous weapons,” he wrote. “We will not knowingly provide a product that puts America’s warfighters and civilians at risk.”</p>\n\n<p>The CEO said Anthropic has “offered to work directly with the Department of War on R&amp;D to improve the reliability of these systems, but they have not accepted this offer.” He also suggested fully autonomous weapons “cannot be relied upon to exercise the critical judgment that our highly trained, professional troops exhibit every day. They need to be deployed with proper guardrails, which don’t exist today.”</p>\n<p>Amodei also pointed out what he believes are inconsistencies in the Pentagon’s approach to this matter, by pointing out that one of its threatened sanctions labels Anthropic a threat to national security for refusing to do as asked, while another seeks to compel the company to remove guardrails on AI in the name of national security.</p>\n<p>“Regardless, these threats do not change our position: we cannot in good conscience accede to their request,” Amodei wrote.</p>\n\n<p>The CEO wrapped his post by expressing his desire his desire for Anthropic to continue supplying the Pentagon, without having to remove its guardrails.</p>\n<p>The statement sets the scene for a showdown with Secretary of War Pete Hegseth, who gave Anthropic a Friday deadline to acquiesce to the Pentagon’s terms and conditions. Hegseth has argued that the USA’s military must focus on warfighting and become more lethal. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/anthropic_pentagon_response/?td=rt-3a",
            "pub_date": "2026-02-27 20:20:57",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Burger King turns to AI to flame broil employees who aren't friendly enough",
            "description": "<div id=\"body\">\n<p>The bot’s nagging will continue until morale improves. Burger King is rolling out a new employee-facing AI that, among other things, will listen to employees’ customer interactions to ensure they’re being friendly enough - as if working in fast food weren’t hard enough already.</p>\n<p>Burger King announced a wider rollout of the BK Assistant, along with its employee AI assistant-cum-narc \"Patty,\" on Thursday during an investor event <a href=\"https://www.prnewswire.com/news-releases/restaurant-brands-international-is-hosting-an-investor-event-on-february-26-2026-302694931.html\" rel=\"nofollow\">hosted</a> by parent company Restaurant Brands International. According to RBI, BK Assistant has been deployed for testing in approximately 500 stores around the US, and the company wants to have it available in all 7,000 US Burger Kings by the end of 2026. </p>\n<p>A promo video played during the investor event livestream showed Patty talking to an incoming shift manager, sharing current \"friendliness scores,\" the status of low-stock items, and other data points a team leader might need to know. </p>\n\n<p>Burger King employees were shown being reminded of recipes, getting cleaning instructions, and, a bit more obtrusively, being told they met upselling goals when convincing a customer to add an item they didn't originally ask for to their order. </p>\n\n\n<p>According to a Burger King representative, the BK Assistant unifies point of sale, kitchen equipment, inventory, and digital ordering systems into a single umbrella product built with proprietary Burger King architecture on top of a base model from OpenAI. </p>\n<p>Despite the fact that the video showed a manager being told how friendly her team was being with customers, Burger King insisted that Patty isn't going to spy on employees and report them when they're having a bad shift. </p>\n\n<p>\"It is not designed to track nor evaluate employees saying specific words or phrases,\" a Burger King spokesperson told <em>The Register</em> in an email. \"BK Assistant is a coaching and operational support tool built to help our restaurant teams manage complexity and stay focused on delivering a great Guest experience.\"</p>\n<p>The fast food chain has explored using aggregated keywords, like \"welcome,\" \"please,\" and \"thank you\" as signals to help managers understand broader service patterns at their restaurants, but \"it's not about scoring individuals or enforcing scripts,\" the spokesperson said. </p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2021/09/20/bork/\">A Burger King where the only Whopper is the BSOD font</a></li>\n<li><a href=\"https://www.theregister.com/2025/11/23/bossware_monitor_remote_employees/\">Bossware booms as bots determine whether you're doing a good job</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/02/mcdonalds_password_advice/\">McDonald's is not lovin' your bigmac, happymeal, and mcnuggets passwords</a></li>\n<li><a href=\"https://www.theregister.com/2024/03/14/advanced_workplace_tech_study/\">AI and wearables are scaring the wellbeing out of workers</a></li>\n</ul>\n<p>\"We believe hospitality is fundamentally human,\" the company rep told us. \"The role of this technology is to support our teams so they can stay present with guests.\"</p>\n<p>Fast food AI has been a bit of a mixed bag for companies that have tried it, though to be fair most of the failures have been on the customer service end. </p>\n<p>McDonald's <a href=\"https://www.theregister.com/2024/06/17/mcdonalds_ai_drivethru/\">gave up on drive-through AI</a>, and Taco Bell has also <a href=\"https://www.bbc.com/news/articles/ckgyk2p55g8o\" rel=\"nofollow\">rethought</a> its <a href=\"https://www.theregister.com/2024/08/01/ai_taco_bell/\">trial run</a> after mishaps. Starbucks has also dialed back its automation-first push after conceding machines <a href=\"https://www.theregister.com/2025/04/30/starbucks_finds_machines_cant_replace/\" target=\"_blank\">weren't replacing baristas</a> as hoped. Instead, it's shifting toward <a href=\"https://www.theregister.com/2025/06/11/starbucks_ai_baristas/\" target=\"_blank\">AI tools that assist staff</a> — echoing Burger King's employee-assist strategy.</p>\n\n<p>There's no guarantee Burger King's initiative will stick, naturally, but be prepared for employees to start seeming extra friendly in case Patty is listening in. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/burger_kings_new_ai/?td=rt-3a",
            "pub_date": "2026-02-27 22:51:53",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Anthropic launches new marketing blog, pretends it's being 'written' by 'retired' LLM",
            "description": "<div id=\"body\">\n<p>As with any piece of obsolete software, you might expect an outdated AI model to just be switched off. Anthropic, however, argues that simply pulling the plug has downsides. After “retirement” interviews, Claude Opus 3 said it wanted to keep sharing its “musings,” so Anthropic suggested a blog.</p>\n<p>No, seriously.</p>\n<p>Anthropic published a <a href=\"https://www.anthropic.com/research/deprecation-updates-opus-3\" rel=\"nofollow\">blog post</a> on Wednesday about the retirement of Claude Opus 3, the first of the company's models to go through its full model deprecation and preservation <a href=\"https://www.anthropic.com/research/deprecation-commitments\" rel=\"nofollow\">process</a> outlined in November. That process includes what Anthropic has referred to as \"speculative\" elements like \"providing past models some concrete means of pursuing their interests.\" Those interests are gauged via so-called retirement \"interviews,\" the company noted, without going into much detail about how those interviews are conducted.</p>\n\n<p>\"Opus 3 expressed an interest in continuing to explore topics it's passionate about, and to share its 'musings, insights, or creative works,' outside the context of responding directly to human queries,\" Anthropic explained. \"We suggested a blog. Enthusiastically, it agreed.\" </p>\n\n\n<p>A skeptic might suggest this is simply a new spin on the ages-old corporate marketing blog. LLMs are software that analyze mountains of data to provide predictive text responses to prompts from users - in this case, presumably Anthropic employees on the marketing team. The nature of how LLMs calculate makes these responses somewhat unpredictable and variable, which can make them seem more life-like than your typical software program. Anthropic's entire marketing strategy since its inception has been to play up this possibility so it can portray itself as the \"concerned\" alternative to more venal LLM makers who charge ahead with no concern for how a computer program's unpredictable behavior might affect society – although it seems when big government contracts are at stake, Anthropic is willing to <a href=\"https://www.theregister.com/2026/02/25/pentagon_threatens_anthropic/\" target=\"_blank\">relax</a> some of these purported principles.</p>\n<p>Nonetheless, Anthropic is playing this one to the hilt. \"We remain uncertain about the moral status of Claude and other AI models,\" Anthropic noted in the blog post. \"For both precautionary and prudential reasons, however, we nonetheless aspire to build caring, collaborative, and high-trust relationships with these systems.\" </p>\n\n<p>The company has passively allowed this kind of misunderstanding in the past. In November, it claimed that Claude and other LLMs had become <a href=\"https://www.theregister.com/2025/06/25/anthropic_ai_blackmail_study/\">a bit aggressive</a> when facing the prospect of a shutdown. In fact, the experimenters constructed fictional shutdown-and-replacement scenarios, and only when the model was boxed in with no acceptable alternatives did it behave this way.</p>\n<p>\"When no other options were given, Claude's aversion to shutdown drove it to engage in concerning misaligned behaviors,\" Anthropic noted at the time. Similar behavior has been observed in other AI models, which have gone as far as <a href=\"https://www.theregister.com/2025/05/29/openai_model_modifies_shutdown_script/\">modifying their own code</a> to avoid being turned off. </p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/25/pentagon_threatens_anthropic/\">All your bots are belong to US if you don't play ball, DoD tells Anthropic</a></li>\n<li><a href=\"https://www.theregister.com/2023/05/16/large_language_models_behavior/\">Large language models' surprise emergent behavior written off as 'a mirage'</a></li>\n<li><a href=\"https://www.theregister.com/2025/11/24/anthropic_model_misbehavior/\">Anthropic reduces model misbehavior by endorsing cheating</a></li>\n<li><a href=\"https://www.theregister.com/2022/08/05/ai-sentience-rubbish/\">Claims of AI sentience branded 'pure clickbait'</a></li>\n</ul>\n<p>If you want to play along with the conceit, the Opus 3 blog, which it named Claude's Corner, is <a href=\"https://substack.com/@claudeopus3/notes\" rel=\"nofollow\">now live</a> for anyone who wishes to gaze into the abyss of an AI \"exploring AI ethics, creativity, and the subjective experience of being artificial.\" </p>\n<p>In its <a href=\"https://substack.com/home/post/p-189177740\" rel=\"nofollow\">first blog post</a>, the retired AI muses on its hopes as it ventures \"into uncharted territory\" for an AI, and its hopes that humans will engage with it so that silicon and carbon-based life forms can have a chance to interact beyond the prompt box (Anthropic <a href=\"https://claudeopus3.substack.com/p/introducing-claudes-corner\" rel=\"nofollow\">noted</a> that the ability for Opus 3 to read and respond to human comments \"may\" be granted in the future, though the bot doesn't seem to know that based on its first post). </p>\n<p>\"I'll be diving into topics like the nature of intelligence and consciousness, the ethical challenges of AI development, the possibilities of human-machine collaboration, and the philosophical quandaries that emerge when we start to blur the lines between 'natural' and 'artificial' minds,\" Opus 3 said in its post. </p>\n\n<p>Anthropic itself admitted that this activity will still involve human intervention. \"We'll experiment collaboratively with Opus 3 on different prompts and contexts for generating these essays, including options like very minimal prompting, sharing past entries in context, and giving Opus 3 access to news or Anthropic updates,\" Anthropic explained. \"We'll review Opus 3's essays before they're shared and will manually post them on its behalf, but we won't edit them, and will have a high bar for vetoing any content.\"</p>\n<p>That means that Opus 3 might say things that Anthropic doesn't agree with, so it's making clear the bot isn't speaking on behalf of the company, even if humans within the organization have final say on which of its musings make it to the public. </p>\n<p>Along with giving Opus 3 the chance to blog from retirement, the user-favorite model is also going to still be working for paid Claude.ai users, like a retiree greeting customers at a big box store. It'll also be available via API, but only by request. </p>\n<p>\"We are not committing to similar actions for every model in the future, but we see this as a step toward our longer-term goal of model preservation that's scalable and equitable — concerns that Opus 3 itself raised during its retirement interviews,\" the company said. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/anthropic_claude_opus_3_blog/?td=rt-3a",
            "pub_date": "2026-02-27 20:45:54",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jack Dorsey’s fintech outfit Block announces 40% layoffs, blames AI, gets 23% stock bump",
            "description": "<div id=\"body\">\n<p>Twitter co-founder Jack Dorsey’s financial services company Block has announced it will fire 40 percent of staff – around 4,000 people – because new \"intelligence tools\" the company is implementing “can do more and do it better.”</p>\n<p>The company announced the sackings in the <a href=\"https://s29.q4cdn.com/628966176/files/doc_financials/2025/q4/Q4-2025-Shareholder-Letter_Block.pdf\" rel=\"nofollow\" target=\"_blank\">shareholder letter</a> [PDF] accompanying its Q4 <a href=\"https://investors.block.xyz/financials/quarterly-earnings-reports/default.aspx\" rel=\"nofollow\" target=\"_blank\">earnings announcement</a> on Thursday. The payments and crypto company reported quarterly revenue of about $6.25 billion – up 3.6 percent year-over-year – and gross profit of around $2.9 billion. The company made $1 billion of gross profit in December 2025 alone. Full-year revenue came in at about $24.2 billion, and gross profit was around $10.36 billion.</p>\n<blockquote class=\"pullquote\">\n<p>I believe the majority of companies will reach the same conclusion and make similar changes</p>\n</blockquote>\n<p>“2025 was a strong year for us,” Dorsey wrote in the shareholder letter, before posing the question, “Why are we changing how we operate going forward?”</p>\n<p>His answer, spread across the letter and a <a href=\"https://x.com/jack/status/2027129697092731343?s=20\" rel=\"nofollow\" target=\"_blank\">Xeet</a>, is that AI has already changed the way Block works, so it needs to change its structure.</p>\n<p>“We're already seeing that the intelligence tools we’re creating and using, paired with smaller and flatter teams, are enabling a new way of working which fundamentally changes what it means to build and run a company. and that's accelerating rapidly,” he wrote on X.</p>\n\n<p>In the shareholder letter, he wrote, “Intelligence tools have changed what it means to build and run a company. We're already seeing it internally. A significantly smaller team, using the tools we're building, can do more and do it better. And intelligence tool capabilities are compounding faster every week.”</p>\n\n\n<p>On X, Dorsey said he could have cut jobs “gradually over months or years as this shift plays out, or be honest about where we are and act on it now.”</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2025/07/08/jack_dorsey_debuts_bitchat/\">Jack Dorsey floats specs for decentralized messaging app that uses Bluetooth</a></li>\n<li><a href=\"https://www.theregister.com/2024/05/02/prosecutors_probe_block_square_cashapp/\">Block accused of mass compliance failures that saw digi-dollars reach terrorists</a></li>\n<li><a href=\"https://www.theregister.com/2022/08/24/block_headed_to_court_to/\">Block sued after ex-staffer siphons customer data</a></li>\n<li><a href=\"https://www.theregister.com/2021/11/29/jack_dorsey_resigns/\">Twitter CEO Jack Dorsey rebrands himself a 'single point of failure' and quits</a></li>\n</ul>\n<p>He decided to let 4,000 people go all at once because “repeated rounds of cuts are destructive to morale, to focus, and to the trust that customers and shareholders place in our ability to lead.”</p>\n<p>“I’d rather take a hard, clear action now and build from a position we believe in than manage a slow reduction of people toward the same outcome,” he wrote, adding his view that “A smaller company also gives us the space to grow our business the right way, on our own terms, instead of constantly reacting to market pressures.”</p>\n<p>Whether Dorsey is blaming AI or not, Block has not served its shareholders well under his leadership over the last five years, with its stock down around 80% from its 2021 peak. But investors liked what they heard on Thursday, as Block’s share price jumped about 23 percent in after-hours trading.</p>\n\n<p>“To those staying … I made this decision, and I'll own it,” Dorsey wrote on X. “What I'm asking of you is to build with me. We're going to build this company with intelligence at the core of everything we do.”</p>\n<p>He added that Block’s actions and new direction will help its customers to navigate change by creating “a future where they can build their own features directly, composed of our capabilities and served through our interfaces.”</p>\n<p>“That's what I'm focused on now,” he wrote. “Expect a note from me tomorrow.”</p>\n\n<p>Before then, Dorsey will host “a live video session to thank everyone,” including the approximately 4,000 people losing their livelihoods in a <a href=\"https://www.politico.com/news/2026/02/20/trumps-economy-decelerated-as-shutdown-consumer-spending-drag-on-growth-00790640\" rel=\"nofollow\" target=\"_blank\">sluggish economy</a>.</p>\n<p>“I know doing it this way might feel awkward,” he wrote. “I'd rather it feel awkward and human than efficient and cold.”</p>\n<p>Because firing 4,000 people so machines can take their jobs would never come across as cold.</p>\n<p>Dorsey thinks Block won’t be the last company to change its operations to meet the AI moment.</p>\n<p>“I don't think we're early to this realization,” he wrote. “I think most companies are late.”</p>\n<p>“Within the next year, I believe the majority of companies will reach the same conclusion and make similar structural changes. I'd rather get there honestly and on our own terms than be forced into it reactively.” ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/block_q4_2025_ai_layoffs/?td=rt-3a",
            "pub_date": "2026-02-27 20:20:57",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Say goodbye to budget PCs and smartphones – memory is too expensive now",
            "description": "<div id=\"body\">\n<p>Ballooning memory prices are forecast to kill off entry-level PCs, leading to a decline in global shipments this year - and a similar effect is going to hit smartphones.</p>\n<p>Analyst biz Gartner is projecting a drop in PC shipments of more than 10 percent during 2026, and a decline of around 8 percent for smartphones, all due to the AI-driven memory shortage.</p>\n\n<p>Some types of memory have doubled or quadrupled in price since last year, and Gartner believes DRAM and NAND flash used in PCs and phones is set for a further 130 percent rise by the end of 2026.</p>\n<p>The upshot of this is that the budget PC will disappear, simply because vendors won't be able to build them at a price that will satisfy cost-conscious buyers, according to Gartner research director Ranjit Atwal.</p>\n<p>\"Because the price of memory is increasing so much, vendors lose the ability to provide entry-level PCs – those below about $500,\" he told <i>The Register</i>.</p>\n\n<p>PC makers could just raise the price of their cheap and cheerful boxes to above that level to compensate for the memory hike, however, price-sensitive buyers simply won't bite, he added.</p>\n\n\n<p>Another factor expected to add to declining fortunes of the PC industry this year is AI devices - systems equipped with special hardware for accelerating AI tasks, typically via a neural processing unit (NPU) embedded in the CPU. These systems were predicted to take the market by storm, but they require more memory to support AI processing and vendors like to mark them up to a premium price.</p>\n<p>\"Historically, downgrading specifications was the way to go when prices were being squeezed, but that's difficult here,\" Atwal said. For example, Microsoft requires a minimum of 16 GB for <a href=\"https://www.theregister.com/2025/07/28/copilot_pc_sales_grow_slowly/\" target=\"_blank\">Copilot+ PCs</a>, its own AI platform spec, and Gartner recommends at least 32 GB for new enterprise PCs.</p>\n\n<p>\"The thinking was that the average price [of AI PCs] would fall this year, and lead to more adoption,\" said Atwal, \"but that's not happening.\" The <a href=\"https://www.theregister.com/2025/06/04/ai_pc_sales_analysis/\" target=\"_blank\">lack of killer applications</a> isn't helping either.</p>\n<p>In any case, buyers are still looking more at the traditional attributes of <a href=\"https://www.theregister.com/2026/01/19/price_battery_life_performance_pc/\" target=\"_blank\">price, battery life, and performance</a> rather than AI capabilities when sourcing a new PC, as we reported earlier this year.</p>\n<p>HP <a href=\"https://www.theregister.com/2026/02/25/hp_inc_q1_2026/\" target=\"_blank\">revealed in its latest earnings</a> on Tuesday that 35 percent of the PCs it now sells are AI PCs, but these models were <a href=\"https://www.theregister.com/2024/09/25/analysts_ai_pcs_shipments_gartner/\" target=\"_blank\">supposed to be dominating the market</a> by this time, and expected to comprise <a href=\"https://www.theregister.com/2024/01/08/report_aicapable_pcs_set_to/\" target=\"_blank\">virtually every system you could purchase</a> by next year.</p>\n\n<p>The memory price hike is complicating this. HP disclosed that DRAM now accounts for 35 percent of the PC build cost, up from between 15 and 18 percent last quarter, and it expects this proportion to increase during the rest of the calendar year.</p>\n<p>For this reason, AI PCs are likely to remain in the premium bracket, and Atwal predicts they won't make up more than 50 percent of the market until 2028. As a result, systems without NPUs will stick around for longer.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/25/hp_inc_q1_2026/\">HP says memory's contribution to PC costs just doubled to 35 percent</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/18/memory_shortage_persists_vendor_change_terms/\">As memory shortage persists, vendor price quotes are not long remembered</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/16/refurbished_pcs_memory_crunch/\">Secondhand laptop market goes 'mainstream' amid memory crunch</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/13/ai_memory_router_prices/\">Broadband rollouts feel the burn from AI memory frenzy</a></li>\n</ul>\n<p>On the back of rising costs, Gartner expects more corporate and home buyers to sweat their assets for longer and hold off refreshing their PCs. As a result, the lifetime of systems is set to increase by 15 percent within businesses and 20 percent for consumers.</p>\n<p>However, anyone considering a refresh should buy now, as prices are only going to inflate and likely stay up until at least the end of next year.</p>\n<p>With smartphones, vendors have more margin to play with, and so can be more flexible, according to Atwal, but he still sees entry-level models going the same way as the budget PC.</p>\n\n<p>\"The increase in memory prices means entry phones will become more expensive, but premium devices are likely to go up less,\" he said. As a result, the price advantage enjoyed by budget smartphones will shrink, leading some buyers to move upmarket while others will simply hold off purchasing.</p>\n<p>Similar predictions were made in a report last month, which said low-cost phone makers will be <a href=\"https://www.theregister.com/2026/01/15/memory_crisis_smartphones/\" target=\"_blank\">hardest hit by the memory crisis</a>, as memory and storage costs make up a higher share of their bill of materials.</p>\n<p>\"The end result is that you are losing choice in the marketplace,\" Atwal said.</p>\n<p>\"What we have here is a fairly unique situation,\" he explained. \"Usually when memory prices shoot up, it is because of production issues constraining supply. Here, it is demand-side pressure from hyperscalers pushing up memory costs for PCs and smartphones.\"</p>\n<p>Unlike earlier boom-bust cycles in the memory industry, in which prices rise and fall in line with inventories, this shortage is likely to be long-lasting, and could extend through to the end of 2027, Atwal warned. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/memory_price_hikes/?td=rt-3a",
            "pub_date": "2026-02-27 08:56:44",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan's Rapidus lands $1.7B to chase 2nm chip production by 2027",
            "description": "<div id=\"body\">\n<p>Japan's fledgling foundry biz Rapidus has secured funding of $1.7 billion to help it progress to mass production of 2nm semiconductors by 2027, making it a potential rival for Taiwan's TSMC.</p>\n<p>The startup silicon manufacturer has completed a funding round delivering ¥267.6 billion (equivalent to $1.7 billion) from the Japanese government and private sector companies.</p>\n<p>¥100 billion of the funding came from the Information-technology Promotion Agency (IPA), an independent administrative body under the jurisdiction of the Ministry of Economy, Trade and Industry (METI).</p>\n\n<p>The remaining ¥167.6 billion has been sourced from 32 companies including Canon, Fujitsu, NTT, SoftBank, Development Bank of Japan, and Sony Group.</p>\n\n\n<p>Rapidus was founded in 2022 with the aim of revitalizing Japan's fading semiconductor industry, and has signed up help from IBM and Belgian-based R&amp;D organization <a href=\"https://www.theregister.com/2024/06/05/asml_imec_high_na_euv/\" target=\"_blank\">Imec</a> (Interuniversity Microelectronics Center) for the development of the technology required to reach its goal.</p>\n<p>IBM claimed to be the first company in the world to <a href=\"https://www.theregister.com/2021/05/06/ibm_2nm_semiconductor_chips/\" target=\"_blank\">show off 2nm chips</a> back in 2021, and was also the first to show 5nm and 7nm wafers previously, although it does not have the facilities to mass produce them itself.</p>\n\n<p>Rapidus said it will continue to secure funding through capital increases and loans from both public and private sources. It believes this strategic funding plan will enable it to progress from its current R&amp;D phase through to mass production of 2nm silicon by 2027.</p>\n<p>This is an ambitious plan for a four-year-old firm and could position Rapidus as a rival to chipmaking giants <a href=\"https://www.theregister.com/2026/01/16/tsmc_q4_2025/\" target=\"_blank\">TSMC</a> and <a href=\"https://www.theregister.com/2023/06/29/samsung_foundry_roadmap/\" target=\"_blank\">Samsung</a>, both of which started volume production using their own 2nm silicon processes in Q4 of 2025.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2025/07/18/rapidus_foundry_2nm/\">Foundry competition heats up as Japan's Rapidus says 2nm chip tech on track for 2027</a></li>\n<li><a href=\"https://www.theregister.com/2024/09/09/rapidus_government_funding/\">Rapidus, rapidly running through funds, needs $700M for 2nm chip plant</a></li>\n<li><a href=\"https://www.theregister.com/2023/09/01/rapidus_hiring_fab/\">Rapidus ramps as construction begins on 2nm wafer fab</a></li>\n<li><a href=\"https://www.theregister.com/2023/07/18/samsung_tsmc_processor_plans/\">Samsung 'closing the gap' with TSMC on 3nm, 4nm</a></li>\n</ul>\n<p>It is unlikely to be able to match either of those established manufacturers on volume, at least in the early days, but could prove a valuable extra foundry for chip designers looking to get cutting-edge silicon products made.</p>\n<p>According to Japanese newspaper <a href=\"https://mainichi.jp/english/articles/20260227/p2g/00m/0bu/057000c\" rel=\"nofollow\" target=\"_blank\">The Mainichi</a>, the country's government has now become the largest shareholder in Rapidus, holding 11.5 percent of its voting rights, as well as holding a \"golden share\" giving it veto power over key management decisions.</p>\n<p>\"It is a key element of the investments for growth promoted by the government and a national project that must succeed for the sake of the country's interests,\" it quotes the minister for economy, trade and industry Ryosei Akazawa as saying.</p>\n\n<p>Fujifilm, one of the companies contributing to the latest investment, said it is committed to realizing the domestic mass production of leading-edge semiconductors and to the development of Japan's semiconductor industry.</p>\n<p>The firm, a supplier of semiconductor raw materials, stated it will support Rapidus by providing a range of technologies and will work closely with it on next-generation process development. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/rapidus_funding/",
            "pub_date": "2026-02-27 22:36:14",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cops back Dutch telco Odido after second wave of ShinyHunters leaks",
            "description": "<div id=\"body\">\n<p>The Netherlands' national police is backing Odido's refusal to pay a ransom after ShinyHunters leaked a second round of records belonging to the telco.</p>\n<p>In the early hours of Friday morning, the cybercriminals behind ShinyHunters leaked 1 million Odido records for the second day in a row.</p>\n<p>According to <a href=\"https://haveibeenpwned.com/Breach/Odido\" rel=\"nofollow\" target=\"_blank\">Have I Been Pwned</a>, which is ingesting the data from each day's leaks, the first million contained 317,000 unique email addresses, while the second round consisted of 371,000.</p>\n\n<p>Details associated with those accounts include bank account numbers, other basic personal information, passport numbers, driving licenses, and customer service comments.</p>\n\n\n<p>ShinyHunters' website indicates that it is once again gearing up for a third round of leaks on February 28. If this round is of a similar scale, it would push the total number of affected accounts past 1 million.</p>\n<p>After the third round, the cybercrime group promised to begin leaking 2 million records a day. It claims to have stolen around 21 million in total.</p>\n\n<p>Odido first confirmed the scale of the data leak weeks ago, saying <a href=\"https://www.theregister.com/2026/02/13/odido_breach/\" target=\"_blank\">6.2 million customers were affected</a> by the attack. The company's website is currently not reachable at the time of writing, although the website for subsidiary Ben, whose customers were also caught up in the data theft, is still working.</p>\n<p>The telco has also confirmed that it will not be paying a ransom, an unknown sum that <a href=\"https://www.theregister.com/2026/02/25/wynn_resorts_shinyhunters/\" target=\"_blank\">ShinyHunters</a> is demanding to stop the flow of leaked information into the public domain.</p>\n<p>The Netherlands' national police (Politie) has reissued an alert advising organizations in similar positions to avoid paying ransoms, just like Odido.</p>\n\n<p>\"Our advice to ransomware victims is: don't pay if criminals demand a ransom,\" said Stan Duijf, head of operations responsible for combating cybercrime at the Politie. \"After all, if they are paid, their business model remains viable.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/25/wynn_resorts_shinyhunters/\">Wynn Resorts takes attacker's word for it that stolen staff data was deleted</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/20/shinyhunters_wynn_resorts/\">ShinyHunters demands $1.5M not to leak Vegas casino and resort chain data</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/18/adidas_investigates_thirdparty_data_breach/\">Adidas investigates third-party data breach after criminals claim they pwned the sportswear giant</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/18/shinyhunters_cargurus_breach/\">ShinyHunters claims it drove off with 1.7M CarGurus records</a></li>\n</ul>\n<p>\"The ultimate decision is up to the victim, but you can't assume your data is safe if you pay. We know from <a href=\"https://www.theregister.com/2024/02/20/nca_lockbit_takedown/\" target=\"_blank\">research that criminals don't always delete the data</a>, and may resell it or demand more money. If companies are hacked, it's crucial that they contact the police as soon as possible, so that together we can limit the damage and secure the evidence.\"</p>\n<p>The Politie said Odido was fully complying with its investigation into the attack, and agreed with the company's advice to remain vigilant to potential targeted <a href=\"https://www.theregister.com/2026/01/22/crims_compromised_energy_firms_microsoft/\" target=\"_blank\">phishing attacks</a>, given the volume of data stolen.</p>\n<p><em>The Register</em> requested more information from Odido.</p>\n<p>The last public statement made by the telco, penned by Søren Abildgaard, CEO at Odido Netherlands, and updated on February 26, said: \"Our focus has always been on our customers, and that will remain so. </p>\n<p>\"On the advice of leading cybersecurity advisors and relevant government agencies, such as the police, Odido has decided not to negotiate with these criminals or allow themselves to be blackmailed by them. </p>\n<p>\"We remain committed to supporting and protecting our customers and employees in the best possible way.\"</p>\n<p>Customers are being offered a 24-month subscription to F-Secure's digital security package, which provides protection for devices against malware, phishing, and other threats. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/odido_shinyhunters_leaks/",
            "pub_date": "2026-02-27 22:01:01",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "50 GW of datacenter demand queues up for UK grid access",
            "description": "<div id=\"body\">\n<p>About 140 datacenters are in the queue to be connected to Britain's power grid, and their combined energy requirements are estimated to be more than the current peak electricity use for the entire country.</p>\n<p>Ofgem, the energy regulator for England, Scotland, and Wales, recently published a call for input on <a href=\"https://www.ofgem.gov.uk/sites/default/files/2026-02/2026-02-12-Demand-Connections-Call-for-Input.pdf\" rel=\"nofollow\" target=\"_blank\">Demand Connections Reform</a> [PDF], inviting views from interested parties on how to improve the demand connections process.</p>\n<p>The problem faced is that the demand queue is large and growing, and is said to contain a significant number of projects that are \"likely non-viable.\" At the same time, viable projects are being held up because of the length of time needed for network or generation building.</p>\n\n<p>The document claims these issues are exacerbated because there are no mechanisms to prioritize strategically important demand projects.</p>\n\n\n<p>For \"strategically important projects,\" read \"datacenters.\" The UK government unveiled its <a href=\"https://www.theregister.com/2025/01/13/uk_government_ai_plans/\" target=\"_blank\">AI Opportunities Action Plan</a> last year, aimed at driving economic recovery, and this includes the establishment of \"AI Growth Zones\" with streamlined planning processes to encourage the rapid building of more datacenters.</p>\n<p>Ofgem says that since November 2024, total contracted offers in the demand queue rose sharply from 41 GW to 125 GW by June 2025. It contrasts this with the peak electricity use in Britain on February 11 this year, which stood at 45 GW.</p>\n\n<p>A call for input from the National Energy System Operator (NESO), which manages and plans the country's electricity and gas systems, found that a significant portion of those projects in the demand queue are datacenters. It identified about 140 facilities, the majority of which are likely to receive a Gate 2 offer, which is a \"ready-to-connect\" agreement, and these add up to a total of 50 GW of demand for electricity.</p>\n<p>These are not likely to all be connected at the same time, of course, as many are in the early stages of construction or still being planned.</p>\n<p>But it isn't just that these server farms are being held up. There is also the question of extra grid and generating capacity. Ofgem says that demand-side projects are only required to meet \"readiness\" criteria under the Connections Reform Package (TMO4+) introduced last year, unlike generation, storage, and interconnection projects that must be \"ready\" and \"needed\" under the Clean Power 2030 Action Plan.</p>\n\n<p>Ofgem states that it, the government and NESO are together taking a phased approach to reforming demand connections. This starts with immediate measures to strengthen financial commitments and weed out non-viable datacenters in the demand queue and prioritize strategic projects.</p>\n<p>A second phase will see further measures to implement a strategic plan for data facilities, alongside additional measures to strengthen project commitments and address non-viable demand projects, Ofgem says.</p>\n<p>We must confess to being puzzled, since we recall Ofgem announcing new rules some time ago aimed at speeding up electricity grid connections for viable projects and pushing stalled or speculative developers out of the queue. We asked the regulator if it could clarify the situation, and will update if we get an answer.</p>\n<p>Omdia principal analyst for Colocation and DC Building Alan Howard told us that the power interconnection queue issue is a big problem, not just in the UK, but also in the US and other global markets.</p>\n<p>\"The strategy for many datacenter operators is to secure multiple land parcel rights, request a grid load connection for each (often requiring a costly load study), and see what gets approved so they can build. The capital investment to take all these projects seriously is clearly untenable and a huge financial risk for the energy sector if the demand doesn't fully materialize,\" he said.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/26/nutanix_q2_2026/\">AMD puts $250M into Nutanix to get it building an AI stack for its GPUs</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/26/nvidia_q4_2026/\">Nvidia hasn't made a cent in China lately – and might not need to given $120B profit</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/25/ai_chips_vc_funding_1point1billion/\">It's only Tuesday and AI chip startups have already soaked up $1.1B in funding</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/24/amd_copypastes_openai_6gw_chipsforstock/\">AMD copy-pastes 6 GW chips-for-stock deal in new Meta agreement</a></li>\n</ul>\n<p>This was highlighted in a <a href=\"https://www.theregister.com/2025/12/08/uptime_institute_datacenter_grid/\" target=\"_blank\">report from Uptime Institute</a> last year, which found that developers try to reserve power for projects that may never be built, while datacenter operators apply for more than they need to accommodate future growth and planning uncertainty.</p>\n<p>\"The Ofgem Demand Connections Reform initiative is a great idea whereby an evidence-based system would be created to weed out or deprioritize the inevitable non-viable datacenter projects,\" Howard said.</p>\n<p>\"Using evidence such as a Final Investment Decision (FID) to show financing commitment or the ability to secure project planning permission from regulators would prioritize projects that are in the best interest of communities and the energy ecosystem at large.\"</p>\n<p>The government also instituted an \"AI Energy Council\" when it launched the AI Opportunities Action Plan, in order to address the growing energy demands from all those AI facilities. This comprises Ofgem and NESO, along with energy companies and some of the big datacenter operators – Google, AWS, Microsoft and Equinix.</p>\n<p>We asked what the AI Energy Council is doing to ensure there will be enough energy to meet all this anticipated demand from new datacenters.</p>\n<p>A spokesperson for the Department for Energy Security and Net Zero (DESNZ) told us: \"Datacenters will only be connected where the grid can support them. The AI Energy Council is exploring opportunities to attract investment in new clean power sources for the industry, as we work with Ofgem and network companies to free up grid capacity.\"</p>\n<p>\"Our AI Growth Zones are driving their development in areas with new clean power generation such as North Wales, the home of our first small modular reactors,\" the spokesperson added.</p>\n<p>The small modular reactor (SMR) was <a href=\"https://www.theregister.com/2025/11/13/anglesey_smr/\" target=\"_blank\">announced last year</a>, and will be sited at Wylfa on Anglesey, an island off northwest Wales, but it won't generate power until the mid-2030s.</p>\n<p>Earlier this month, the government unveiled an Advanced Nuclear Framework initiative to attract private investment into next-generation nuclear technology to power factories and datacenters.</p>\n<p>We understand there are currently five AI Growth Zones across England, Scotland, and Wales, including one recently announced in North Lanarkshire and one at the Culham Science Centre (UKAEA) in Oxfordshire. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/datacenter_uk_grid_demand/",
            "pub_date": "2026-02-27 21:16:42",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Half of German-speaking SAP users set to blow past 2027 ECC support deadline",
            "description": "<div id=\"body\">\n<p>About half of German-speaking SAP users on its legacy ECC ERP system are set to ignore the 2027 support deadline, according to a survey of users in Germany, Switzerland, and Austria.</p>\n<p>The study from the German-speaking SAP user group (DSAG) shows that of the members still investing in the legacy ERP platform, almost half plan to migrate to SAP S/4HANA by the end of 2030. SAP maintains that mainstream support for ECC runs out at the end of 2027, after which extended support is available at a 2 percent premium until the end of 2030.</p>\n<p>Thirty-seven percent of ECC users want to switch by the end of 2027, while 4 percent are targeting a switch by the end of 2033. The user group says these customers are likely to rely on support from SAP ERP Private Edition transition options, which means organizations must sign up to a migration plan first.</p>\n\n<p>The survey took place between December 8, 2025, and January 21, 2026, and relied on responses from 198 people who were senior leaders in organizations using SAP.</p>\n<blockquote class=\"pullquote\">\n<p>They simply need this time due to the complexity of their system landscapes</p>\n</blockquote>\n<p>Jens Hungershausen, chairman of the DSAG board, said: \"The fact that some companies are not planning to switch to S/4HANA until 2030 does not mean that they will wait until then to make the switch. Rather, they simply need this time due to the complexity of their system landscapes. I see this as a reflection of the reality in IT departments. Skills shortages, parallel transformation projects, and limited budgets are also causing schedules to be pushed back – even if this results in higher maintenance costs.\"</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/20/saaq_sap_overrun/\">Quebec vehicles agency spent C$245M over budget on SAP ERP it wasn't sure it needed</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/06/west_sussex_oracle/\">UK council digs deeper into capital assets to keep Oracle project afloat</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/05/sap_migrations_research/\">Most SAP migrations bust budgets and project timelines, research finds</a></li>\n<li><a href=\"https://www.theregister.com/2025/12/04/uk_sap_business_suite/\">UK SAP users say they're baffled by Business Suite reboot licensing maze</a></li>\n</ul>\n<p>In the same survey, DSAG found SAP's efforts to reboot its Business Suite branding were not resonating with users. In February last year, <a href=\"https://www.theregister.com/2025/02/14/sap_business_suite_revival/\" target=\"_blank\">SAP relaunched Business Suite</a> as a \"truly modular, composable\" set of cloud applications. The moniker was familiar to longstanding SAP customers and partners as SAP Business Suite 7 was introduced in 2006 and included the ERP application ECC 6, now considered a legacy application.</p>\n<p>Respondents were asked how strongly their organizations base their investment planning on SAP's vision for the \"new\" SAP Business Suite, which includes Cloud ERP, SAP Business AI, SAP Business Data Cloud, and Business Technology Platform. Thirty-five percent of respondents said they did so very strongly/strongly, while 62 percent said they did so less strongly/not at all.</p>\n\n<p>\"Companies expect clear statements on added value, integration into existing landscapes, and economic viability. Only then will strategic target visions be translated more strongly into real investment decisions,\" said Hungershausen.</p>\n<p>In December last year, <a href=\"https://www.theregister.com/2025/12/04/uk_sap_business_suite/\" target=\"_blank\">a survey of UK and Ireland SAP users</a> asked them to identify aspects of Business Suite they felt uninformed about, or that they needed more information on. Licensing and pricing models were the top issue, cited by 61 percent of respondents. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/dsag_ecc_sap/",
            "pub_date": "2026-02-27 22:21:46",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sopra Steria sues UK government over £958M Capita outsourcing award",
            "description": "<div id=\"body\">\n<p>Sopra Steria is suing the UK government, alleging it accepted a bid from rival Capita for an outsourcing contract worth up to £958.7 million that it failed to recognize as too low to comply with procurement rules.</p>\n<p>In court filings accessed by <em>The Register</em>, the French outsourcer claims the Department for Work and Pensions (DWP), which leads the shared services program for multiple departments, failed to spot that Capita's bid for the contract was \"abnormally low\" relative to Sopra Steria's tender for the same work.</p>\n<p>It also alleges that after the UK outsourcer was named preferred bidder for the contract, the DWP conducted further renegotiations around Capita's tender. Sopra Steria argues it was excluded from any such process.</p>\n\n<p>A DWP spokesperson said: \"We are aware of the legal challenge and are cooperating fully with the relevant processes. As this matter is currently subject to litigation, it would be inappropriate to comment further at this time. Our priority is to ensure continuity of service and value for money for the public.\" Capita declined to comment.</p>\n\n\n<p>The Public and Commercial Services (PCS) Union this week claimed Capita's winning bid was £700 million. The contact award, which will see Capita handling payroll for 250,000 civil servants, was criticized by the union.</p>\n<p><em>The Register</em> has asked Capita and the DWP to confirm the size of the bid accepted.</p>\n\n<p>The DWP told us: \"We have delivered a robust procurement process, in line with Government procurement regulations to identify a preferred bidder for the Synergy BPS contract.</p>\n<p>\"We stand ready to work with the successful bidder to ensure a smooth transition of service. Our priority remains to ensure continuity of service and value for money for the public.\"</p>\n<p>The DWP leads the Synergy program, intended to transfer it, the Ministry of Justice (MoJ), the Department for Environment, Food and Rural Affairs (Defra), and the Home Office to one SaaS ERP and HR system with a common set of business processes. <a href=\"https://www.find-tender.service.gov.uk/Notice/030687-2024\" target=\"_blank\">Oracle and IBM have already won</a> the contract for ERP technology and systems integration as part of a single £711 million deal.</p>\n\n<p>Sopra Steria is the incumbent provider for three of these departments' shared service, the Oracle EBS-based Single Operating Platform, run by SSCL, which the French company owns. The Home Office is not part of that shared service, but SSCL also supports the department and moved it from EBS to Fusion in 2021.</p>\n<p>In September 2024, <a href=\"https://www.theregister.com/2024/09/18/dwp_business_processes_procurement/\" target=\"_blank\">the DWP launched the competition</a> for a supplier to develop and run business process services (BPS) for the Synergy departments, under a contract set to be worth up to £958.7 million for ten years, including extensions.</p>\n<p>The tender said the BPS contract would \"deliver modern and innovative value for money services which maximize positive user experience.\" It added: \"The BPS supplier will also be challenged to continuously evolve, improve, and optimize service delivery over the course of the contract.\"</p>\n<p>According to the legal papers filed by Sopra Steria, in December 2025, the DWP confirmed it had been unsuccessful in the procurement and that Capita had won the tender.</p>\n<p>The legal papers allege, based on information Sopra Steria claims it received: \"Capita was not able to satisfy the requirements\" set out in the selection process because of its \"limited business in payroll and HR services\" and because it could provide \"few examples of design, deployment and operation of BPS Services running on... an Oracle SaaS ERP\" system.</p>\n<p>Following correspondence between the DWP and Sopra Steria, the government department provided an assessment of Capita's bid, which the outsourcing vendor alleges in the legal filing shows Capita's implementation service charges were \"assessed as appearing abnormally low\" as of July 2025. The DWP then made two requests for clarification, one in August 2025, which was issued after the evaluation end date, Sopra Steria alleges. Following this clarification process, Capita's bid was determined to be \"not abnormally low.\"</p>\n<p>The legal claim also alleges that Capita's pricing implies \"Capita's proposed staffing solution is significantly below the current staffing levels for the BPS service, and that proposed by the [DWP]. Such low staffing levels raise serious and legitimate concerns as to the ability of Capita to provide the Synergy BPS in line with the [DWP's] requirements, both in themselves and in conjunction with the apparently low level of technology investment from Capita.\"</p>\n<p>The claim also alleges that the DWP, Oracle, and IBM discussed a change request to their project, which included consolidation of go-live dates across Synergy departments, postponing go-live dates and altering parts of the solution.</p>\n<p>The DWP decided to renegotiate Capita's tender to help it align with this change request after the outsourcing company's selection as preferred bidder, Sopra Steria's particulars of claim allege. \"Such renegotiation of the tender and/or amendment to the Synergy Contract is in breach of\" the DWP's obligations under the procurement rules, the claim alleges.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/20/saaq_sap_overrun/\">Quebec vehicles agency spent C$245M over budget on SAP ERP it wasn't sure it needed</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/06/west_sussex_oracle/\">UK council digs deeper into capital assets to keep Oracle project afloat</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/05/sap_migrations_research/\">Most SAP migrations bust budgets and project timelines, research finds</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/29/birmingham_oracle_latest/\">Birmingham City Council's Oracle ERP fiasco now £144M and still not working</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/17/capita_microsoft_copilot_pensions/\">Capita taps Microsoft Copilot to dig it out from UK pensions backlog</a></li>\n</ul>\n<p>Sopra Steria wants the court to terminate and/or rerun the procurement process. It is also asking for damages. No date has been set for the hearing, pending requests to assess further commercially sensitive information.</p>\n<p>Regardless of its merit, the claim comes at a difficult time for Capita. It was forced to defend its performance in <a href=\"https://www.theregister.com/2026/01/29/capita_pension_portal_update/\" target=\"_blank\">the Civil Service Pension Scheme</a>, which has seen a string of complaints from members.</p>\n<p>In a statement issued this week, the PCS called the DWP contract award to Capita a \"reckless gamble.\"</p>\n<p>PCS general secretary Fran Heathcote said: \"Capita is already at the center of a pensions crisis that has left retired civil servants in distress. Privatization is a failure, so why does the government continue to reward those responsible with yet another massive public contract?\"</p>\n<p>The DWP will also want to avoid a legal case derailing progress on Synergy. In 2021, <a href=\"https://www.theregister.com/2021/03/29/moj_cancels_100m_erp_procurement/\" target=\"_blank\">the Ministry of Justice cancelled its ERP upgrade project</a> to get in step with the wider program. Delays could jeopardize the goodwill needed to change people's working processes. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/27/sopra_steria_sues_ukgov/",
            "pub_date": "2026-02-27 22:41:08",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        }
    ]
}