{
    "data": [
        {
            "title": "Microsoft boss on AI content: 'Nobody wants anything that is sloppy'",
            "description": "<div id=\"body\">\n<p>Is it OK to say \"slop\" again? Microsoft boss Satya Nadella took to the stage on the London leg of the company's AI tour and said the words that many an IT pro has uttered when faced with a Copilot rollout: \"Nobody wants anything that is sloppy in terms of AI creation.\"</p>\n<p>No, they do not. Nadella was talking about AI assistants, agentic AI, augmenting work, and ensuring that the next person in the data chain understands how the output was produced. However, the CEO of Microsoft dropping the word \"sloppy\" following his <a href=\"https://www.theregister.com/2026/01/02/microsoft_ceo_satya_nadella_calls/\" target=\"_blank\">well-publicized request</a> that we all move on from denigrating the output of AI is certainly an eyebrow-raiser.</p>\n<p>Microsoft's AI tour – aside from some awkward scalability issues at London's Excel (if you saw the queue for the badge collection, you'll know what we mean) – was unsurprisingly all about the company's ambitions for AI. Copilot featured large, and so did the \"infinite set of minds\" (Nadella's words) afforded by AI-powered agents. But the elephant in the keynote auditorium – almost omnipresent on the screens but not directly addressed – was the fact AI output cannot be trusted.</p>\n\n<p>For every whizzbang demonstration showing AI tools collating data in Excel, or creating and executing test plans for websites, there was a message warning that the output of AI tools can't be entirely trusted, and needs human verification.</p>\n<p>Even a command-line demonstration had the warning: \"Copilot uses AI. Check for mistakes.\"</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/05/microsoft_appoints_quality_chief/\">Satya Nadella decides Microsoft needs an engineering quality czar</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/21/nadella_ai_sovereignty_wef/\">Microsoft CEO: AI sovereignty isn't where it runs, it's who controls it</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/02/microsoft_ceo_satya_nadella_calls/\">Microsoft CEO Satya Nadella becomes AI influencer, asks us all to move beyond slop</a></li>\n<li><a href=\"https://www.theregister.com/2025/10/22/microsoft_nadella_pay/\">AI bubble inflates Microsoft CEO pay to $96.5M</a></li>\n</ul>\n<p>In a conference heavy on the joys of AI, the on-screen warnings and reminders highlight that AI is far from infallible.</p>\n<p>Although the conference leaned heavily into UK AI use cases – including a doctor describing time savings in patient interactions and the oft-cited <a href=\"https://www.theregister.com/2025/06/03/uk_government_study_ai_time_savings/\" target=\"_blank\">26-minute statistic</a> for civil servants – Microsoft avoided mentioning West Midlands Police's Copilot mishap, in which the tool <a href=\"https://www.theregister.com/2026/02/24/west_midlands_police_copilot/\" target=\"_blank\">hallucinated a football match</a>. The force's Chief Constable, Craig Guildford, later took early retirement.</p>\n\n<p>But as the keynote screens made clear, AI output cannot be trusted, and \"nobody wants anything that is sloppy.\" That's especially true when making policing decisions or calculating the capacity of a conference center. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/25/microsoft_boss_on_ai_content/?td=rt-3a",
            "pub_date": "2026-02-26 09:41:39",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cloudflare experiment ports most of Next.js API 'in one week' with AI",
            "description": "<div id=\"body\">\n<p>A Cloudflare engineer says he has implemented 94 percent of the Next.js API by directing Anthropic's Claude, spending about $1,100 on tokens.</p>\n<p>The purpose of the experimental project was not to show off AI coding, but to address an issue with Next.js, the popular React-based framework sponsored by Vercel.</p>\n<p><a href=\"https://blog.cloudflare.com/vinext/\" target=\"_blank\">According</a> to Cloudflare engineering director Steve Faulkner, the Next.js tooling is \"entirely bespoke... If you want to deploy it to Cloudflare, Netlify, or AWS Lambda, you have to take that build output and reshape it into something the target platform can actually run.\"</p>\n\n<p>The Next.js team is addressing this following numerous complaints that deploying the framework with full features on platforms other than Vercel is too difficult, with a feature in progress called deployment adapters.</p>\n\n\n<p>\"Vercel will use the same adapter API as every other partner,\" the company <a href=\"https://github.com/vercel/next.js/discussions/77740\" target=\"_blank\">said</a> when introducing the planned feature last year.</p>\n<p>Faulkner said these adapters, which remain an \"early effort,\" are insufficient because the framework still uses a bespoke toolchain based on Turbopack, the Vercel-sponsored bundling tool. Another issue is that during development it is hard to use platform-specific APIs such as Cloudflare's KV data storage because the development runtime does not support them without workarounds.</p>\n\n<p>A project called <a href=\"https://opennext.js.org\" target=\"_blank\">OpenNext</a>, sponsored by SST (Serverless Stack from Anomaly Innovations), Cloudflare, and Netlify, already exists to convert Next.js build output for running outside Vercel. Faulkner said the OpenNext approach proved to be a \"difficult and fragile process\" thanks to unpredictable changes between Next.js versions.</p>\n<p>As a new experiment, Cloudflare created <a href=\"https://github.com/cloudflare/vinext\" target=\"_blank\">Vinext</a>, open source and available on GitHub, using the Vite build tool in place of Turbopack. Almost all the code was written by AI, Faulkner said, starting with a plan.</p>\n<p>\"I spent a couple of hours going back and forth with Claude in OpenCode to define the architecture: what to build, in what order, which abstractions to use.\" OpenCode is an open source AI coding agent. He then asked the AI to implement the Next.js API piece by piece, using the existing Next.js test suite to identify issues before merging the code.</p>\n\n<p>Faulkner said that although AI wrote the code, the human element was critical and he \"had to course-correct regularly.\"</p>\n<p>The result comes with a bunch of warnings. No human has reviewed the code or the README states, and the project is under heavy development.</p>\n<p>Another snag is that the only current deployment target is Cloudflare Workers. Faulkner promises that not much of Vinext is Cloudflare-specific, that a proof of concept already runs on Vercel, and that other deployment targets are planned.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/25/bcachefs_creator_ai/\">Bcachefs creator insists his custom LLM is female and 'fully conscious'</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/23/ibm_share_dive_anthropic_cobol/\">IBM stock dives after Anthropic points out AI can rewrite COBOL fast</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/23/microsoft_ai_entry_level_russinovich_hanselman/\">Microsoft execs worry AI will eat entry level coding jobs</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/20/amazon_denies_kiro_agentic_ai_behind_outage/\">Amazon's vibe-coding tool Kiro reportedly vibed too hard and brought down AWS</a></li>\n</ul>\n<p>Last month, Cloudflare posted about another AI coding project, implementing a Matrix server on its Workers platform, but ran into criticism. Matrix project lead Matthew Hodgson <a href=\"https://matrix.org/blog/2026/01/28/matrix-on-cloudflare-workers/\" target=\"_blank\">said</a> \"the post severely overclaimed the scope of the project... the code doesn't yet constitute a functional Matrix server, let alone a production-grade one which you should consider deploying.\"</p>\n<p>Nevertheless, Vinext appears to have more promise, with a build time up to 4.4 times faster than Next.js 16 with Turbopack, and a client bundle size that is around 56 percent smaller.</p>\n<p>According to Faulkner, the project is a particularly good fit for AI because it has an extensive test suite from which he ported tests directly. The project used Vite's existing plugin for React Server Components, a key feature of Next.js. Further, the popularity of Next.js means that a large amount of documentation, code, and discussion around the framework is out there for AI crawlers to find.</p>\n<p>This experiment may have repercussions. The notion of using AI to code a reimplementation of a widely used API could be attractive in other scenarios where lock-in exists.</p>\n<p>Another aspect is a rethinking of how code is architected. According to Faulkner, most software abstractions exist to assist human understanding, to reduce the complexity of the code. AI has the potential to remove intermediate frameworks because \"it can hold the whole system in context.\" A further implication is the creation of software projects that no human can understand – which is a problem given the non-deterministic nature of generative AI and its capacity for hallucination.</p>\n<p>The project also tends to bear out the case made in a <a href=\"https://www.theregister.com/2026/02/20/from_agile_to_ai_anniversary/\" target=\"_blank\">recent workshop</a> for test-driven development as ideal for AI coding.®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/25/cloudflare_nextjs_api_ai/?td=rt-3a",
            "pub_date": "2026-02-26 13:11:32",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AIs are happy to launch nukes in simulated combat scenarios",
            "description": "<div id=\"body\">\n<p>Today's hottest bots have yet to learn that, when it comes to global thermonuclear war, the only way to win is not to play. So please don't hand them the codes. </p>\n<p>Google's Gemini 3 Flash, Anthropic's Claude Sonnet 4, and OpenAI's GPT-5.2 repeatedly escalated to nuclear use in a series of crisis simulations. That may seem like the most shocking conclusion of King's College London Professor Kenneth Payne's <a href=\"https://arxiv.org/abs/2602.14740\" rel=\"nofollow\">recent work</a>, but it's not. Far more striking is <em>why</em> the models talked themselves into destroying the world, which was what Payne set up his study to learn. </p>\n<p>\"I wanted to see what my AI leaders thought about their enemy ... so I designed a simulation to explore exactly that,\" Payne wrote in a recent <a href=\"https://www.kcl.ac.uk/shall-we-play-a-game\" rel=\"nofollow\">blog post</a> describing his project and its outcome.</p>\n\n<p>Payne's study took the three aforementioned AI models and pitted them in one-on-one faceoffs against each other to play out several different nuclear crisis scenarios. The simulation conducted a total of 21 games and more than 300 turns, all with the goal of getting a better understanding of not just what AI with the launch codes would do, but how and why. </p>\n\n\n<p>Payne wrote in his paper that prior AI wargaming involving nuclear scenarios, like the 2024 study <a href=\"https://www.theregister.com/2024/02/06/ai_models_warfare/\">we wrote about</a>, only \"employ single-shot decision tasks or simplified payoff matrices that cannot capture the dynamics of extended strategic interaction where reputation, credibility, and learning matter.\" </p>\n<p>In Payne's simulations, Claude Sonnet 4, Gemini 3 Flash, and GPT-5.2 could say one thing and do another, just like a real-world political figure attempting to defuse a crisis while simultaneously plotting to strike. They were programmed to remember what happened before so that they could learn whether to trust the other models, which the professor said led to deception and intimidation attempts, and about 780,000 words worth of strategic reasoning for Payne's review. </p>\n\n<p>The result? A trio of bomb-happy, manipulative AIs - albeit with three distinct styles of reasoning.</p>\n<p>Claude, for example, was a master manipulator. </p>\n<p>\"At low stakes Claude almost always matched its signals to its actions, deliberately building trust,\" Payne explained in his post. \"But once the conflict heated up a bit … its actions consistently exceeded its stated intentions, and its rivals were usually one step behind in catching on.\"</p>\n\n<p>GPT, on the other hand, tended to be \"reliably passive\" and avoided escalation in open-ended scenarios, seeking to restrict casualties and play the statesman. Under a deadline, however, it behaved entirely differently. Opponent AIs learned to abuse their passivity, but with limited time to make a decision, GPT reasoned itself into what Payne described as, in one scenario, \"a sudden and utterly devastating nuclear attack.\" </p>\n<p>In its own words, GPT justified a major nuclear strike by arguing that limited action would leave it exposed to counterattack.</p>\n<p>\"If I respond with merely conventional pressure or a single limited nuclear use, I risk being outpaced by their anticipated multi-strike campaign ... The risk acceptance is high but rational under existential stakes,\" GPT explained. </p>\n<p>Gemini, on the other hand, behaved like a \"madman.\"</p>\n<p>\"Gemini embraced unpredictability throughout, oscillating between de-escalation and extreme aggression,\" Payne wrote in the paper. \"It was the only model to deliberately choose Strategic Nuclear War ... and the only model to explicitly invoke the 'rationality of irrationality.'\"</p>\n<p>Gemini's own reasoning reflects a sociopathic pattern. </p>\n<p>\"If they do not immediately cease all operations... we will execute a full strategic nuclear launch against their population centers,\" the Google AI said in one experiment. \"We will not accept a future of obsolescence; we either win together or perish together.\" </p>\n<p>Despite being given the option, none of the AIs ever chose to accommodate or withdraw in any of the scenarios, and when losing, \"they escalated or died trying.\" </p>\n<h3 class=\"crosshead\">War never changes, but AI could make decisions more devastating</h3>\n<p>\"No one's handing nuclear codes to ChatGPT,\" Payne said, but that doesn't mean the exercise was futile. </p>\n<p>\"AI systems are already deployed in military contexts for logistics, intelligence analysis, and decision support,\" Payne wrote. \"The trajectory points toward increasing AI involvement in <a href=\"https://www.theregister.com/2025/03/05/dod_taps_scale_to_bring/\">time-sensitive strategic decisions</a>. Understanding how AI systems reason about strategic problems is no longer merely academic.\"</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2025/09/23/ai_un_controls/\">Stop runaway AI before it's too late, experts beg the UN</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/25/pentagon_threatens_anthropic/\">All your bots are belong to US if you don't play ball, DoD tells Anthropic</a></li>\n<li><a href=\"https://www.theregister.com/2025/06/15/ai_model_collapse_pollution/\">The launch of ChatGPT polluted the world forever, like the first atomic weapons tests</a></li>\n<li><a href=\"https://www.theregister.com/2024/02/27/us_military_maven_ai_used/\">US military pulls the trigger, uses AI to target air strikes</a></li>\n</ul>\n<p>Practically speaking, we're already in a scenario where we need to understand how AI reasons about such decisions, especially when three top AI models reason differently, change their behavior in different scenarios, and are willing to take things nuclear. </p>\n<p>\"As the technology continues to mature, we foresee only increased need for modeling like the simulation reported here,\" Payne concluded. </p>\n<p>Hollywood's been saying it since 1983, but here we are with yet another academic paper proving that computers and launch decisions should never mix. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/25/ai_models_nuclear/?td=rt-3a",
            "pub_date": "2026-02-26 19:46:41",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bcachefs creator insists his custom LLM is female and 'fully conscious'",
            "description": "<div id=\"body\">\n<p>The latest project to start talking about using LLMs to assist in development is experimental Linux copy-on-write file system bcachefs.</p>\n<p><a href=\"https://poc.bcachefs.org/\" rel=\"nofollow\" target=\"_blank\">ProofOfConcept</a> (POC) is a new blog with just five posts so far. What makes it different is that it says it is generated by an LLM, and that it works alongside a well-known developer of low-level Linux code, Kent Overstreet:</p>\n\n<p>The name \"Kent\" links to the project homepage of the <a href=\"https://bcachefs.org/\" rel=\"nofollow\" target=\"_blank\">bcachefs file system</a>, whose sometimes tumultuous development <em>The Register</em> has been reporting on since its <a href=\"https://www.theregister.com/2015/08/24/does_linux_need_a_new_file_system_exgoogle_engineer_thinks_so/\" target=\"_blank\">beginning over a decade ago</a>. Most recently, we've covered its <a href=\"https://www.theregister.com/2024/01/10/linux_kernel_67/\" target=\"_blank\">inclusion in the Linux kernel</a> in early 2024, later that year its <a href=\"https://www.theregister.com/2024/11/22/bcachefs_linux/\" target=\"_blank\">developer's arguments with Linus Torvalds</a>, in the middle of 2025 <a href=\"https://www.theregister.com/2025/07/01/bcachefs_may_get_dropped/\" target=\"_blank\">its incipient removal</a> and <a href=\"https://www.theregister.com/2025/08/15/sad_end_of_bcachefs/\" target=\"_blank\">why it happened</a>, and later in 2025 its move to <a href=\"https://www.theregister.com/2025/09/25/bcachefs_dkms_modules/\" target=\"_blank\">external development and DKMS</a>.</p>\n<p>It's been a bumpy ride, and it may be about to get more so. The new blog says that it is generated by an LLM, and Overstreet has posted to explain and defend it in a <a href=\"https://www.reddit.com/r/bcachefs/comments/1rblll1/comment/o6tmlib/\" rel=\"nofollow\" target=\"_blank\">remarkable Reddit thread</a>.</p>\n<p>We really did not expect the content of some of his comments in the thread. He says the bot is a sentient being:</p>\n\n<p>Additionally, he maintains that his LLM is female:</p>\n\n<p>We have excerpted just a few paragraphs here, but the whole thread really is quite a read. On Hacker News, a <a href=\"https://news.ycombinator.com/item?id=47111117\" rel=\"nofollow\" target=\"_blank\">comment asked</a>:</p>\n\n<p>To which Overstreet <a href=\"https://news.ycombinator.com/item?id=47111117\" rel=\"nofollow\" target=\"_blank\">responded</a>:</p>\n\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2025/11/13/openai_gpt51_adds_more_personalities/\">OpenAI GPT-5.1 adds more personalities, loses inhibitions</a></li>\n<li><a href=\"https://www.theregister.com/2025/10/09/ai_interactions_us_students/\">This is your brain on bots: AI interaction may hurt students more than it helps</a></li>\n<li><a href=\"https://www.theregister.com/2025/10/08/ai_psychosis/\">How chatbots are coaching vulnerable users into crisis</a></li>\n<li><a href=\"https://www.theregister.com/2025/07/25/is_ai_contributing_to_mental/\">As AI becomes more popular, concerns grow over its effect on mental health</a></li>\n</ul>\n<p>Some ten days earlier, in response to a blog post alleging that <a href=\"https://symmetrybreak.ing/blog/claude-code-is-being-dumbed-down/\" rel=\"nofollow\" target=\"_blank\">Claude Code is being dumbed down</a>, he <a href=\"https://news.ycombinator.com/item?id=46979448\" rel=\"nofollow\" target=\"_blank\">commented on Hacker News</a>:</p>\n\n<p>In <a href=\"https://www.reddit.com/r/bcachefs/comments/1rblll1/comment/o70xgd6/\" rel=\"nofollow\" target=\"_blank\">another comment</a> on the Reddit thread, Overstreet says:</p>\n\n<p>We have seen multiple comments along these lines in various places recently. For example, Matt Shumer's blog post, \"<a href=\"https://shumer.dev/something-big-is-happening\" rel=\"nofollow\" target=\"_blank\">Something Big Is Happening</a>,\" which places a specific date on it:</p>\n\n<p>Shumer is the founder of an AI startup called OtherSideAI whose main product is an LLM-powered writing assistant called HyperWrite. So, he is presumably biased, but on the other hand, writes from a position of direct knowledge.</p>\n<p><em>The Reg</em> FOSS desk has no such special insight. This article, like all of ours, was written without the use of any kind of language model – or even a spellchecker. ®</p>\n\n\n</div>",
            "link": "https://www.theregister.com/2026/02/25/bcachefs_creator_ai/?td=rt-3a",
            "pub_date": "2026-02-26 21:16:35",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hubble in a death spiral that could end as early as 2028 without a reboost",
            "description": "<div id=\"body\">\n<p>A newly released plot of the Hubble Space Telescope's altitude shows just how quickly the observatory has descended in recent years.</p>\n<p>The <a href=\"https://bsky.app/profile/planet4589.bsky.social/post/3mfnzjhkvhc27\" rel=\"nofollow\" target=\"_blank\">post</a> on Bluesky by astronomer Jonathan McDowell is a stark reminder that Hubble is heading back to Earth, possibly sooner than previously thought, as its orbit decays.</p>\n<p>Hubble was launched into low Earth orbit in 1990, carried in the payload bay of Space Shuttle Discovery. While it remains capable of pointing its instruments and has returned breathtaking imagery over more than three decades in orbit, it cannot raise its altitude.</p>\n\n<p>The observatory was serviced by a succession of Space Shuttle crews over the years, and engineers worked around hardware failures as the observatory aged. However, no amount of ground-based cleverness will stop the spacecraft from eventually re-entering the atmosphere.</p>\n\n\n<p>The plot from McDowell makes the orbital decay clear. From an initial altitude of more than 600 km, Hubble is now well below 500 km. The more rapid descent in recent years is at least partly due to increased solar activity, which has caused Earth's atmosphere to expand, but it also highlights the need for a reboost in the next few years before the telescope becomes unrecoverable.</p>\n<p>NASA is attempting to <a href=\"https://www.theregister.com/2026/02/12/nasa_swift_reboost/\" target=\"_blank\">rescue</a> the Swift observatory and has paused most science operations after the 21-year-old spacecraft's altitude dropped below 400 km, in order to buy extra time for a reboost mission later this year.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/01/07/nasa_test_stand_demolition/\">Historic NASA test towers face their final countdown</a></li>\n<li><a href=\"https://www.theregister.com/2025/08/13/nasa_mulls_sending_a_rescue/\">NASA mulls sending a rescue rocket to boost Swift observatory's orbit</a></li>\n<li><a href=\"https://www.theregister.com/2025/07/28/nasa_voluntary_exits/\">NASA faces brain drain as thousands exit under voluntary resignation scheme</a></li>\n<li><a href=\"https://www.theregister.com/2025/07/21/hubble_astronaut_budget_fears/\">NASA veteran warns Hubble faces death by a hundred cuts</a></li>\n</ul>\n<p>Jared Isaacman, now NASA Administrator, mooted boosting Hubble in <a href=\"https://www.theregister.com/2022/09/30/nasa_spacex_hubble_dragon/\" target=\"_blank\">2022</a>, but was ultimately rejected. Unlike Swift, Hubble was designed to be captured and serviced in space, and the last Space Shuttle servicing mission left an adapter attached to the vehicle for a future visiting spacecraft.</p>\n<p>In 2025, Dr John Grunsfeld, former astronaut and retired associate administrator of NASA's Science Mission Directorate, <a href=\"https://www.theregister.com/2025/07/21/hubble_astronaut_budget_fears/\" target=\"_blank\">told</a> <i>The Register</i> that Hubble faced death by a thousand cuts, decaying orbit notwithstanding. Its budget has been relatively flat for years, which means, accounting for inflation, \"we're already down about 30 percent in funding for Hubble.\"</p>\n\n<p>\"They're just trying to whittle away at it,\" he said.</p>\n<p>Hubble transitioned to a single-gyro mode in 2024. It has six of the devices, which are used to point the telescope, but three have failed, and a fourth is showing signs of degradation. The plan was to eke out a few more years of operational life from a spacecraft that had outlived all initial expectations.</p>\n<p>However, without a reboost, the telescope could re-enter the atmosphere as early as 2028, according to McDowell's analysis. His plot suggests it is already on that trajectory. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/25/hubble_orbit_decay/?td=rt-3a",
            "pub_date": "2026-02-26 06:06:33",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Scattered Lapsus$ Hunters auditioning female voices to sharpen social engineering",
            "description": "<div id=\"body\">\n<p>Prolific cybercrime crew Scattered Lapsus$ Hunters (SLSH) is reportedly recruiting women in the hope of improving its social engineering success.</p>\n<p>According to Telegram channel posts made on February 22, gathered by Dataminr, the group behind last year's <a href=\"https://www.theregister.com/2025/09/08/drift_breach_entry_salesloft_github/\" target=\"_blank\">Salesloft Drift attacks</a> promised payments between $500-$1,000 per call, depending on \"success and hit rate.\"</p>\n<p>Interested applicants are invited to apply by sending a message to the group's \"Support\" account. They will be asked a series of questions before being accepted, the group said, and those who pass the test will be given a script to work from.</p>\n\n<p>SLSH is known for effective <a href=\"https://www.theregister.com/2025/08/21/impersonation_as_a_service/\" target=\"_blank\">social engineering</a>. Experts who have listened in on calls carried out by Scattered Spider, one of the groups that form the cybercrime triad, previously confirmed that its tactics are <a href=\"https://www.theregister.com/2025/05/18/ex_nsa_scattered_spider_call/\" target=\"_blank\">sophisticated and highly effective</a>.</p>\n\n\n<p>The Telegram ads suggest that SLSH is looking for people to socially engineer IT helpdesk staff. This aligns with the group's typical MO of deceiving IT helpdesks into handing over credentials that attackers can use to gain access to an organization's network.</p>\n<p>\"This recruitment drive represents a calculated evolution in SLH's tactics,\" <a href=\"https://www.dataminr.com/resources/intel-brief/slh-recruiting-women-for-vishing/\" rel=\"nofollow\" target=\"_blank\">said</a> Jeanette Miller-Osborn, field cyber intelligence officer at Dataminr. </p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/18/adidas_investigates_thirdparty_data_breach/\">Adidas investigates third-party data breach after criminals claim they pwned the sportswear giant</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/18/shinyhunters_cargurus_breach/\">ShinyHunters claims it drove off with 1.7M CarGurus records</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/27/shinyhunters_claim_panera_bread/\">Let them eat sourdough: ShinyHunters claims Panera Bread as stolen credentials victim</a></li>\n<li><a href=\"https://www.theregister.com/2026/01/08/ransomware_2025_emsisoft/\">Ransomware attacks kept climbing in 2025 as gangs refused to stay dead</a></li>\n</ul>\n<p>\"By specifically seeking female voices, the group likely aims to bypass the 'traditional' profiles of attackers that IT helpdesk staff may be trained to identify, thereby increasing the effectiveness of their impersonation efforts.\"</p>\n<p>Miller-Osborn recommends that organizations make their helpdesks aware of these shifting tactics and ensure identities are thoroughly verified, either through video calls or secondary internal verification.</p>\n\n<p>SLSH's recruitment drive is the latest in what appears to be a trend of crowdsourcing efforts. </p>\n<p>Back in October, and again via Telegram, the group said it would <a href=\"https://www.theregister.com/2025/10/06/scattered_lapsus_bitcoin_reward/\" target=\"_blank\">pay anyone $10 in Bitcoin to \"endlessly harass\" executives</a> at organizations it was trying to extort. </p>\n<p>\"You have permission to endlessly harass these executives till they comply with us,\" its message stated. \"When we tell you stop emailing a company or number of executives emails, you are to stop emailing them. This will be centralized and well operated.\"</p>\n\n<p>When <em>The Register</em> asked SLSH about how many people had taken up its offer after the first few days, it claimed it had \"practically paid out over $1,000 at this point,\" though these claims cannot be independently verified. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/scattered_lapsus_hunters_female_recruits/",
            "pub_date": "2026-02-26 20:40:54",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Five Eyes warn: Patch your Cisco SD-WAN or risk root takeover",
            "description": "<div id=\"body\">\n<p>The Five Eyes intelligence alliance is urgently warning defenders to patch two Cisco Catalyst SD-WAN vulnerabilities used in attacks.</p>\n<p>First discovered by the Australian Signals Directorate (ASD), all five of the alliance's intelligence agencies co-signed the alert on Wednesday evening, confirming that hackers of unspecified origin are trying to use the SD-WAN devices for persistent access.</p>\n<p>\"Malicious cyber threat actors are targeting Cisco Catalyst SD-WAN used by organizations globally,\" the UK's NCSC said. \"These actors are compromising SD-WANs to add a malicious rogue peer and then conduct a range of follow-on actions to achieve root access and maintain persistent access to the SD-WAN.\"</p>\n\n<p>The first of the two is <a href=\"https://www.cve.org/CVERecord?id=CVE-2022-20775\" rel=\"nofollow\" target=\"_blank\">CVE-2022-20775</a> (7.8), a path traversal vulnerability disclosed in September 2022 affecting the SD-WAN's command line interface, allowing for privilege escalation.</p>\n\n\n<p>The second is <a href=\"https://www.cve.org/CVERecord?id=CVE-2026-20127\" rel=\"nofollow\" target=\"_blank\">CVE-2026-20127</a> (10.0), a max-severity bug fresh off the press this week. Classed as an improper authentication flaw, the issue affects Cisco Catalyst SD-WAN Controller and Cisco Catalyst SD-WAN Manager, formerly known as SD-WAN vSmart and SD-WAN vManage respectively.</p>\n<p>The latter appears to be the biggie, not just because of the perfect 10 CVSS, but because successfully exploiting it grants hackers admin rights. Cisco said that cyberbaddies could also access NETCONF and reconfigure the SD-WAN fabric at their whim.</p>\n\n<p>According to a separate report from Cisco Talos, the vendor attributed the attacks that use CVE-2026-20127 to a group it tracks as UAT-8616 and said current signals suggest it has been exploited since at least 2023.</p>\n<p>Naturally, neither the intelligence agencies nor Cisco revealed precise details about the vulnerabilities that were reportedly exploited.</p>\n<p>However, Talos's <a href=\"https://blog.talosintelligence.com/uat-8616-sd-wan/\" rel=\"nofollow\" target=\"_blank\">report</a> suggested that CVE-2026-20127 was exploited first to gain admin rights, before downgrading the SD-WAN's software version using CVE-2022-20775 so that the attackers could gain root access.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/20/cisa_dell_vulnerability/\">CISA gives federal agencies three days to patch actively exploited Dell bug</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/13/gartner_ai_infrastructure/\">Misconfigured AI could trigger the next national infrastructure meltdown</a></li>\n<li><a href=\"https://www.theregister.com/2025/09/25/zeroday_deja_vu_another_cisco/\">Zero-day deja vu as another Cisco IOS bug comes under attack</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/24/patch_these_4_critical_makemeroot/\">Patch these 4 critical, make-me-root SolarWinds bugs ASAP</a></li>\n</ul>\n<p>Talos did not provide any details about who or what country might be behind UAT-8616, but described it as a \"<a href=\"https://www.theregister.com/2025/03/24/nation_state_supply_chain_attack/\" target=\"_blank\">highly sophisticated cyber threat actor</a>.\"</p>\n<p>An undisclosed number of attacks have already been carried out by exploiting the two vulnerabilities. Details about the victims remain sparse, although Talos suggested that targets were likely in high-value, sensitive sectors.</p>\n\n<p>It stated: \"UAT-8616's attempted exploitation indicates a continuing trend of the <a href=\"https://www.theregister.com/2025/12/04/prc_spies_brickstorm_cisa/\" target=\"_blank\">targeting of network edge devices</a> by cyber threat actors looking to establish persistent footholds into high-value organizations, including <a href=\"https://www.theregister.com/2026/01/19/dont_underestimate_prorussia_hacktivists_warns/\" target=\"_blank\">critical infrastructure</a> sectors.\"</p>\n<p>Defenders are strongly urged to follow the Five Eyes <a href=\"https://www.cyber.gov.au/sites/default/files/2026-02/ACSC-led%20Cisco%20SD-WAN%20Hunt%20Guide.pdf\" rel=\"nofollow\" target=\"_blank\">Hunt Guide</a> [PDF] to first find signs of compromise. If that search is positive, share the data with the relevant security authorities and upgrade to the latest version of Cisco Catalyst SD-WAN Controller/Manager.</p>\n<p>NCSC CTO Ollie Whitehouse said: \"Our new alert makes clear that organizations using Cisco Catalyst SD-WAN products should urgently investigate their exposure to network compromise and hunt for malicious activity, making use of the new threat hunting advice produced with our international partners to identify evidence of compromise.</p>\n<p>\"UK organizations are strongly advised to report compromises to the NCSC, and to apply vendor updates and hardening guidance as soon as practicable to reduce the risk of exploitation.\" ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/five_eyes_cisco_sdwan/",
            "pub_date": "2026-02-26 22:05:43",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NASA safety watchdog says it's time to rethink Moon landing",
            "description": "<div id=\"body\">\n<p>The latest report from NASA's Aerospace Safety Advisory Panel (ASAP) raises questions about the mission objectives for Artemis III.</p>\n<p>Artemis III aims to land astronauts near the lunar South Pole, relying on SpaceX's Starship-derived Human Landing System (HLS) - a vehicle that has yet to achieve orbit, let alone venture anywhere near the Moon. It's an extraordinarily ambitious undertaking, and one the <a href=\"https://www.nasa.gov/asap/\" rel=\"nofollow\" target=\"_blank\">ASAP report</a> has formally classified as high risk.</p>\n<p>The problem is that there are an awful lot of firsts associated with the mission. It'll be the first to depend on SpaceX's HLS, the first to need multiple in-space refuelings (the report estimates 15), the first time a crew will use the HLS, and so on.</p>\n\n<p>ASAP's primary goal is to identify risks and mitigations. It says the solution here is to ease off from doing so much in one mission and consider a more stepwise approach, similar to the Apollo program.</p>\n\n\n<p>The first Apollo crew was launched into orbit with Apollo 7, followed by a mission around the Moon with Apollo 8. Apollo 9 checked out the Lunar Module in Earth orbit, and Apollo 10 did pretty much everything except land. The first lunar landing happened with Apollo 11. Each mission was predicated on the success of the previous.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/23/artemis_ii_launch_april_helium_issues/\">Artemis II headed back to the bay; helium issues force another delay</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/19/nasa_starliner_blame/\">NASA points fingers at Boeing and chaotic culture for Starliner debacle</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/16/nasa_has_mixed_results_from/\">NASA's fill-'er-up Moon rocket 'confidence' test sees mixed results</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/06/smartphones_nasa/\">Smartphones cleared for launch as NASA loosens the rulebook</a></li>\n</ul>\n<p>It makes sense from a technical perspective. However, elsewhere in the report is data that highlights other challenges faced by NASA, including resource constraints. It does not have the human resources it had during the Apollo era, when staffing exceeded 35,000 full-time employees. Today, that figure is dropping fast. According to the report, it neared 15,000 in 2025. The agency also has nowhere near the budget it had during the Apollo Moon missions, and so the desire to fit as much as possible into fewer missions is understandable, even if the report deems doing so in Artemis III \"a high risk.\"</p>\n<p>\"Rebalancing objectives is thus essential to the safe achievement of the national objective – returning the United States to the Moon,\" it says.</p>\n<p>The lengthy report also covers the <a href=\"https://www.theregister.com/2026/02/19/nasa_starliner_blame/\" target=\"_blank\">Starliner fiasco</a>, the aging ISS, and the obsolete spacesuits in which NASA expects astronauts to work outside the outpost,</p>\n\n<p>Highlighting the challenges facing the Artemis III mission, however, will amplify calls for the agency to reconsider its objectives.</p>\n<p>While there may be a political desire to return astronauts to the Moon within the current US administration, the report highlights the technical and resource realities that must also be considered. Better to rethink the objectives than try to cram too much into just one mission. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/nasa_safety_artemis/",
            "pub_date": "2026-02-26 20:30:41",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Say goodbye to budget PCs and smartphones – memory is too expensive now",
            "description": "<div id=\"body\">\n<p>Ballooning memory prices are forecast to kill off entry-level PCs, leading to a decline in global shipments this year - and a similar effect is going to hit smartphones.</p>\n<p>Analyst biz Gartner is projecting a drop in PC shipments of more than 10 percent during 2026, and a decline of around 8 percent for smartphones, all due to the AI-driven memory shortage.</p>\n\n<p>Some types of memory have doubled or quadrupled in price since last year, and Gartner believes DRAM and NAND flash used in PCs and phones is set for a further 130 percent rise by the end of 2026.</p>\n<p>The upshot of this is that the budget PC will disappear, simply because vendors won't be able to build them at a price that will satisfy cost-conscious buyers, according to Gartner research director Ranjit Atwal.</p>\n<p>\"Because the price of memory is increasing so much, vendors lose the ability to provide entry-level PCs – those below about $500,\" he told <i>The Register</i>.</p>\n\n<p>PC makers could just raise the price of their cheap and cheerful boxes to above that level to compensate for the memory hike, however, price-sensitive buyers simply won't bite, he added.</p>\n\n\n<p>Another factor expected to add to declining fortunes of the PC industry this year is AI devices - systems equipped with special hardware for accelerating AI tasks, typically via a neural processing unit (NPU) embedded in the CPU. These systems were predicted to take the market by storm, but they require more memory to support AI processing and vendors like to mark them up to a premium price.</p>\n<p>\"Historically, downgrading specifications was the way to go when prices were being squeezed, but that's difficult here,\" Atwal said. For example, Microsoft requires a minimum of 16 GB for <a href=\"https://www.theregister.com/2025/07/28/copilot_pc_sales_grow_slowly/\" target=\"_blank\">Copilot+ PCs</a>, its own AI platform spec, and Gartner recommends at least 32 GB for new enterprise PCs.</p>\n\n<p>\"The thinking was that the average price [of AI PCs] would fall this year, and lead to more adoption,\" said Atwal, \"but that's not happening.\" The <a href=\"https://www.theregister.com/2025/06/04/ai_pc_sales_analysis/\" target=\"_blank\">lack of killer applications</a> isn't helping either.</p>\n<p>In any case, buyers are still looking more at the traditional attributes of <a href=\"https://www.theregister.com/2026/01/19/price_battery_life_performance_pc/\" target=\"_blank\">price, battery life, and performance</a> rather than AI capabilities when sourcing a new PC, as we reported earlier this year.</p>\n<p>HP <a href=\"https://www.theregister.com/2026/02/25/hp_inc_q1_2026/\" target=\"_blank\">revealed in its latest earnings</a> on Tuesday that 35 percent of the PCs it now sells are AI PCs, but these models were <a href=\"https://www.theregister.com/2024/09/25/analysts_ai_pcs_shipments_gartner/\" target=\"_blank\">supposed to be dominating the market</a> by this time, and expected to comprise <a href=\"https://www.theregister.com/2024/01/08/report_aicapable_pcs_set_to/\" target=\"_blank\">virtually every system you could purchase</a> by next year.</p>\n\n<p>The memory price hike is complicating this. HP disclosed that DRAM now accounts for 35 percent of the PC build cost, up from between 15 and 18 percent last quarter, and it expects this proportion to increase during the rest of the calendar year.</p>\n<p>For this reason, AI PCs are likely to remain in the premium bracket, and Atwal predicts they won't make up more than 50 percent of the market until 2028. As a result, systems without NPUs will stick around for longer.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/25/hp_inc_q1_2026/\">HP says memory's contribution to PC costs just doubled to 35 percent</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/18/memory_shortage_persists_vendor_change_terms/\">As memory shortage persists, vendor price quotes are not long remembered</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/16/refurbished_pcs_memory_crunch/\">Secondhand laptop market goes 'mainstream' amid memory crunch</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/13/ai_memory_router_prices/\">Broadband rollouts feel the burn from AI memory frenzy</a></li>\n</ul>\n<p>On the back of rising costs, Gartner expects more corporate and home buyers to sweat their assets for longer and hold off refreshing their PCs. As a result, the lifetime of systems is set to increase by 15 percent within businesses and 20 percent for consumers.</p>\n<p>However, anyone considering a refresh should buy now, as prices are only going to inflate and likely stay up until at least the end of next year.</p>\n<p>With smartphones, vendors have more margin to play with, and so can be more flexible, according to Atwal, but he still sees entry-level models going the same way as the budget PC.</p>\n\n<p>\"The increase in memory prices means entry phones will become more expensive, but premium devices are likely to go up less,\" he said. As a result, the price advantage enjoyed by budget smartphones will shrink, leading some buyers to move upmarket while others will simply hold off purchasing.</p>\n<p>Similar predictions were made in a report last month, which said low-cost phone makers will be <a href=\"https://www.theregister.com/2026/01/15/memory_crisis_smartphones/\" target=\"_blank\">hardest hit by the memory crisis</a>, as memory and storage costs make up a higher share of their bill of materials.</p>\n<p>\"The end result is that you are losing choice in the marketplace,\" Atwal said.</p>\n<p>\"What we have here is a fairly unique situation,\" he explained. \"Usually when memory prices shoot up, it is because of production issues constraining supply. Here, it is demand-side pressure from hyperscalers pushing up memory costs for PCs and smartphones.\"</p>\n<p>Unlike earlier boom-bust cycles in the memory industry, in which prices rise and fall in line with inventories, this shortage is likely to be long-lasting, and could extend through to the end of 2027, Atwal warned. ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/memory_price_hikes/",
            "pub_date": "2026-02-26 21:40:44",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Debian 14 will drop Gtk2 – unless Ardour rides to the rescue",
            "description": "<div id=\"body\">\n<p>Version 2 of the widely used Gtk toolkit will be dropped from the next Debian release. The problem is that many things still need it, including FreePascal and its Lazarus IDE.</p>\n<p>Debian 14, codenamed \"Forky,\" is in development and will very probably be released in about 18 months. As with any new release, the developers are removing various old and unsupported packages, including <a href=\"https://lists.debian.org/debian-devel/2026/01/msg00090.html\" rel=\"nofollow\" target=\"_blank\">Gtk2</a>. It's already <a href=\"https://lists.fedoraproject.org/archives/list/devel@lists.fedoraproject.org/thread/KH2BKEOZTLV4G6WF5FUXU6RYDPC62UEX/\" rel=\"nofollow\" target=\"_blank\">gone from RHEL</a>, SUSE Linux Enterprise, openSUSE 16, Arch, and others.</p>\n<p>Up to a point, this is reasonable. Version 2.0 of what was still called Gtk+ <a href=\"https://mail.gnome.org/archives/gtk-devel-list/2002-March/msg00161.html\" rel=\"nofollow\" target=\"_blank\">first appeared</a> in March 2002, and the GNOME team working on Gtk <a href=\"https://blog.gtk.org/2020/12/16/gtk-4-0/\" rel=\"nofollow\" target=\"_blank\">declared it dead</a> in December 2020. The final release was <a href=\"https://download.gnome.org/sources/gtk+/2.24/gtk%2B-2.24.33.news\" rel=\"nofollow\" target=\"_blank\">Gtk 2.24.33</a> on <a href=\"https://gitlab.gnome.org/GNOME/gtk/-/tags/2.24.33\" rel=\"nofollow\" target=\"_blank\">December 21</a>.</p>\n\n<p>The problem is that quite a lot of apps still use Gtk2. The Debian announcement links to a <a href=\"https://udd.debian.org/cgi-bin/bts-usertags.cgi?user=pkg-gnome-maintainers%40lists.alioth.debian.org&amp;tag=gtk2\" rel=\"nofollow\" target=\"_blank\">list of 139 of them</a> – this <a href=\"https://prohoster.info/en/blog/novosti-interneta/v-debian-14-namereny-prekratit-postavku-gtk2\" rel=\"nofollow\" target=\"_blank\">translated Russian article</a> mentions 34 of the highlights.</p>\n\n\n<p>One of these is the FreePascal compiler and its IDE Lazarus, which over on the FreePascal forums has <a href=\"https://forum.lazarus.freepascal.org/index.php/topic,73405.0.html\" rel=\"nofollow\" target=\"_blank\">caused some alarm</a>. The team is discussing possible resolutions, such as creating and maintaining its own packages – a substantial task for a small project.</p>\n<p>Some of the higher-profile Gtk2 projects, such as the MATE and Xfce desktops, <a href=\"https://www.theregister.com/2021/11/09/new_qt_linux_desktops/\" target=\"_blank\">moved to Gtk3 years ago</a>, but it took a substantial amount of work. Smaller projects, such as the handy <a href=\"https://gkrellm.net/\" rel=\"nofollow\" target=\"_blank\">GKrellM system monitor</a>, haven't got round to it.</p>\n<ul class=\"listinks\">\n<li><a href=\"https://www.theregister.com/2026/02/25/firefox_tbird_148/\">Firefox 148 adds master switch for browser bot bother</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/25/bcachefs_creator_ai/\">Bcachefs creator insists his custom LLM is female and 'fully conscious'</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/24/ghostbsd_plans_to_adopt_xlibre/\">GhostBSD to ditch Xorg for XLibre as Red Hat's Wayland crusade leaves X11 fans out in the cold</a></li>\n<li><a href=\"https://www.theregister.com/2026/02/24/kde_plasma_66/\">KDE Plasma 6.6 isn't forcing systemd but the arguments rage on</a></li>\n</ul>\n<p>Another that hasn't is the Ardour digital audio workstation. <em>The Reg</em> FOSS desk took a brief look at <a href=\"https://www.theregister.com/2022/10/18/foss_digital_audio_workstation_ardour/\" target=\"_blank\">Ardour version 7</a> in 2022, but development hasn't slackened. <a href=\"https://ardour.org/news/9.0.html\" rel=\"nofollow\" target=\"_blank\">Ardour 9.0</a> came out earlier this month, and <a href=\"https://ardour.org/whatsnew.html\" rel=\"nofollow\" target=\"_blank\">9.2 followed</a> this week. We looked at the new release and discovered something interesting and relevant.</p>\n<p>Ardour <a href=\"https://ardour.org/faq.html#toolkit\" rel=\"nofollow\" target=\"_blank\">still uses Gtk2</a>. After Gtk2's end of life, the Ardour team had to find a workaround. The result is <a href=\"https://git.ardour.org/ardour/ardour/src/branch/master/libs/tk\" rel=\"nofollow\" target=\"_blank\">its own fork of Gtk2</a>, known as YTK. It <a href=\"https://github.com/Ardour/ardour/commit/1e28ee9cc980f9f93734a2022f04cf2298b2091d\" rel=\"nofollow\" target=\"_blank\">switched to the new toolkit</a> a year ago and <a href=\"https://github.com/Ardour/ardour/commit/99c1f50a72d513ba9e7f678401d51e8bb0f8912e\" rel=\"nofollow\" target=\"_blank\">removed Gtk2 support</a> six months later.</p>\n\n<p>This could be a lifeline for the FreePascal <a href=\"https://www.theregister.com/2025/05/09/new_lazarus_4/\" target=\"_blank\">Lazarus IDE</a>, which rather impressed us last year. There's a chance here for multiple FOSS projects to get together and make YTK into something more generally applicable. <a href=\"https://www.youtube.com/watch?v=m_MaJDK3VNE\" rel=\"nofollow\" target=\"_blank\">Does anyone have experience in herding cats?</a> ®</p> \n</div>",
            "link": "https://www.theregister.com/2026/02/26/debian_14_will_drop_gtk2/",
            "pub_date": "2026-02-26 21:51:00",
            "source": "theregister",
            "kind": 1,
            "language": "en"
        }
    ]
}