{
    "data": [
        {
            "title": "1,300 Toyota Prius units recalled in Singapore over rear doors that could open while car is moving",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Some 1,300 Toyota Prius cars are being recalled in Singapore over a fault in the rear electric doors, which can cause them to open while the car is in motion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Borneo Motors Singapore, the authorised distributor of Toyota here, is notifying the owners by post.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Based on information posted on the Land Transport Authority’s (LTA) electronic vehicle recall system, the rear doors of the popular hybrid car can unlock unexpectedly because of a short circuit caused by water entering the system.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In response to <em>The Straits Times</em>, Borneo Motors said on Friday (Feb 27) that the rectification involves modifying the left and right rear door switch circuits, to prevent the switch from activating if a short circuit occurs. A short circuit may happen if large amounts of water enter the rear door opener switch, such as during a car wash, after its seal – a protective barrier around the switch – degrades over time.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">If the door is shut with force, water may seep into the switch. Should the water contain detergent, it could trigger the switch and cause the rear doors to open.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Rectification work has already begun, and the repair can be completed within the same day. Owners will not be charged for the work.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While waiting for their appointments, customers can continue to drive their vehicles, said Borneo Motors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Borneo Motors said the fault will be rectified on new Prius cars before delivery to customers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It began selling the current version of the Prius in early 2024. Parallel importers started offering the model here in 2023.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Owners of parallel-imported cars can also contact Borneo Motors for help.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While the dealer did not indicate the specific batches of cars that are affected, the recall in the United States reportedly affects more than 142,000 Prius cars made between model years 2023 and 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Model year” refers to the way carmakers identify the specific version of a given car model, and may not correspond to an actual calendar year. Cars made in model year 2023, for example, would typically have been introduced some time in late 2022.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This latest Toyota Prius recall is similar to an earlier one in April 2024, also for rear doors that can open unexpectedly because of a short circuit. This was reported to have affected about 211,000 vehicles globally.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Borneo Motors said that after that recall, Toyota identified another set of circumstances that can cause the rear door switch to be activated, leading to the potential for the door to open while the car is being driven.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">LTA told ST on Feb 27 that vehicle manufacturers and motor dealers are responsible for identifying affected vehicles, notifying owners and arranging for safety-related defects to be fixed. <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.straitstimes.com/singapore/transport/1300-toyota-prius-cars-recalled-in-spore-after-rear-doors-found-at-risk-of-opening-while-moving\" target=\"_blank\">THE STRAITS TIMES</a></p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/1300-toyota-prius-units-recalled-singapore-over-rear-doors-could-open-while-car-moving",
            "pub_date": "2026-02-27 17:25:36",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sunway is willing to walk away if RM11 billion IJM bid rejected",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[KUALA LUMPUR] Sunway Bhd is prepared to walk away from its offer to acquire IJM Corp if the builder’s shareholders do not accept the conglomerate’s deal by the Apr 6 deadline, said Sunway founder Jeffrey Cheah.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“There’s no compulsion for the shareholders to sell to us,” Cheah told reporters on Friday (Feb 27). If IJM shareholders reject the offer, “we walk away,” he said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sunway in January offered to buy its smaller rival for RM11 billion (S$3.6 billion), a move that analysts said would allow the group to emerge as the largest property and construction conglomerate group in Malaysia. The offer has since drawn political scrutiny over concerns that it could dilute both the equity interests of the government and the rights of the nation’s indigenous majority. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A politician from a key member of Prime Minister Anwar Ibrahim’s ruling coalition said Malaysia’s majority Bumiputera group’s stakes in major corporations are “already limited” and the merger would reduce that further.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IJM’s operations came under scrutiny amid a probe by the Malaysian Anti-Corruption Commission and tax authorities after Sunway’s bid. The builder has refuted money laundering allegations. Its chairman was recently released from an overnight detention by Malaysian anti-graft officials.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We are doing it just for commercial purposes. We find that it is an attractive vehicle to have,” Cheah said of Sunway’s offer. It is a transaction between a “willing buyer, willing seller,” he said. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/property/sunway-willing-walk-away-if-rm11-billion-ijm-bid-rejected",
            "pub_date": "2026-02-27 17:20:39",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Malaysia to decide on MACC inquiry after probe on chief is done",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[KUALA LUMPUR] Malaysia will decide whether to establish a Royal Commission of Inquiry to investigate allegations of wrongdoing at the country’s anti-graft agency after a committee investigating the shareholdings of the commission’s chief submits a separate report next week.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Cabinet will make the decision after the committee, which is led by the attorney general, issues its findings into reports that Malaysian Anti-Corruption Commission Chief Commissioner Azam Baki held shares that were above the allowed limits for public officials, Communications Minister Fahmi Fadzil said at a press conference in Putrajaya on Friday (Feb 27). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The move comes after Bloomberg News published two reports this month that caused an outcry in the country. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The second one contained allegations that a group of businessmen nicknamed the “corporate mafia” was working with MACC officials to oust executives and take over companies, which the anti-graft agency has strongly denied. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/malaysia-decide-macc-inquiry-after-probe-chief-done",
            "pub_date": "2026-02-27 17:05:38",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How Budget 2026 should affect Singaporean wallets",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHEN Singapore Budget 2026 was unveiled on Feb 12, the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/budget-2026-highlights-ai-champions-foreign-worker-policy-tweaks-more-cdc-vouchers\" target=\"_blank\">headline numbers</a> caught attention. For individuals, in particular: Community Development Council (CDC) Vouchers, cost-of-living payouts and education credits. But beneath the surface lies a deeper message. One that does not show up on the balance sheet yet will determine the financial futures of millions of Singaporeans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This Budget arrives in a world where artificial intelligence (AI) is reshaping careers, living costs still matter and family-building gets expensive fast. More than a fiscal document, the Budget quietly, but powerfully, challenges each of us to upgrade our money mindset alongside the nation’s economy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here’s why every young career starter, aspiring parent and middle-class professional should read the Budget with as much interest as the next smartphone launch.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/how-budget-2026-should-affect-singaporean-wallets",
            "pub_date": "2026-02-27 17:00:46",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SAP’s new bonus system sparks outcry over rewards for underperforming bosses",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BERLIN] SAP’s new bonus system ended up rewarding underperforming managers while holding lower-ranking workers to a higher standard for their payouts, prompting an outcry from employees and leaders alike at the German software company, people familiar with the matter said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP has since set aside millions of euros to appease angered staff and improve the new global system, which wound up rewarding senior-level employees who did not meet all expectations in their roles, according to documents reviewed by Bloomberg and people familiar with the situation. The people asked not to be identified because the matter isn’t public. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The compensation programme riled SAP employees, who have already signalled in surveys that they are losing trust in the company’s executive board amid job cuts and a restructuring process that dragged on for months. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As artificial intelligence tools threaten traditional enterprise software models, SAP’s stock has lost about 135 billion euros (S$201.7 billion) in value after reaching an all-time-high a year ago. SAP reported on Thursday (Feb 26) that chief executive officer Christian Klein made 16.2 million euros in 2025, about 14 per cent below his compensation a year earlier. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP confirmed that it had introduced a new performance-based compensation framework. During the rollout, the firm “identified additional areas for refinement related to stock-based compensation for non-executives,” a company spokesperson said. The topics were reviewed and addressed “to the extent possible prior to the process finalisation,” he added, saying that “fair and competitive compensation for performance is a priority for SAP.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Klein had set a goal of overhauling the employee reward system in 2023 to better incentivise high performance. He put chief people officer Gina Vargiu-Breuer in charge of the development of the new stock incentive plan, which was rolled out to employees this month, two of the people said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Klein told Vargiu-Breuer’s team to rework the system after employees and managers complained that it was unfair, the two people said. The fallout could threaten her future at the company after her contract ends in early 2027, they said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“As is standard practice, SAP does not comment on individual personnel or contractual matters,” a company spokesperson said by email. Gina Vargiu-Breuer did not respond to a request for comment sent through SAP.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP categorised its general staff in five levels, ranging from the lowest (T1) to managers or senior employees (T5), the documents reviewed by Bloomberg show. While the three bottom ranks had to surpass expectations to receive stock-based bonuses, T4 and T5 employees who did not meet all their benchmarks still qualified for incentives, according to the documents and people familiar with the situation. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP has seen high executive board turnover in the past six years, and several contracts were terminated prematurely, costing the firm millions of euros in payouts. Klein’s co-CEO Jennifer Morgan left after months in the role in 2020. Starting in 2023, chief financial officer Luka Mucic and executive board members Sabine Bendiek, Scott Russell, Julia White and Jürgen Müller also departed. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Separately, Muhammad Alam, who leads product engineering, does not plan to renew his contract when it ends next year, the people said. Alam did not respond to a request for comment, and SAP declined to comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In an internal survey in November, 59 per cent of employees said they trusted the executive board, down six percentage points from half a year earlier, according to an internal email sent by Vargiu-Breuer and seen by Bloomberg News. In April 2021, more than 80 per cent of employees said they trusted the executive team.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The turnover at the top level has added another layer of instability as SAP works to rearrange its business around the threats of the new AI era. Some early users of the company’s flagship AI assistant, Joule – designed to help users navigate complex SAP systems and make tasks like coding easier – have been disappointed, customers and partners have said, asking to not be identified discussing their relationship with the vendor. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/saps-new-bonus-system-sparks-outcry-over-rewards-underperforming-bosses",
            "pub_date": "2026-02-27 17:00:47",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CDL H2 net profit up over four times at S$538.5 million on improved showings across all segments",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] <!-- --> <!-- -->City Developments Ltd’s (CDL)<!-- --> <!-- --> second-half earnings rose more than four times to S$538.5 million, from S$113.5 million in the previous corresponding period.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This more than trebled the group’s full-year earnings to S$629.7 million, from S$201.3 million in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The improvements were primarily driven by robust residential sales in Singapore and strong capital recycling gains, notably, from the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/property/cdl-selling-its-50-1-south-beach-stake-its-malaysian-partner-ioi-s834-million-yielding-s465-million\" target=\"_blank\">sale of a 50.1 per cent stake in the South Beach mixed-use development</a> in H2 to Malaysian partner IOI Properties Group, said CDL on Friday (Feb 27). The S$834 million transaction yielded a S$465 million gain.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sherman Kwek, CDL’s group chief executive officer, said that strong residential sales in Singapore and accelerated capital recycling drove a “significant uplift” to the group’s earnings, despite the company facing a “challenging environment with ongoing economic uncertainties” in 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To maximise shareholder returns, we are actively reviewing our growth strategy, portfolio structures and capital allocation priorities,” Kwek said. “We have taken decisive steps to unlock value from mature and non-core assets while selectively redeploying capital to drive growth.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In early 2025, Kwek was embroiled in a public feud with his father and CDL executive chairman Kwek Leng Beng, but the matter was settled subsequently.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the second half, CDL posted an earnings per share (EPS) of S$0.598, versus S$0.121 in the year-ago period. EPS for the full year rose to S$0.694, from S$0.213 in the previous financial year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for H2 stood at S$1.9 billion, up 11.1 per cent on the year from S$1.7 billion. Full-year revenue grew 9.7 per cent to S$3.6 billion from S$3.3 billion.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Better results across all segments</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CDL said that all its business segments reported improvements for H2 and FY2025, with the property development segment being the biggest contributor to revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, that segment’s revenue rose 24.1 per cent on the year to S$1.2 billion, supported by higher contributions from Singapore projects such as The Myst, Norwood Grand and Union Square Residences. The sales of the Ransome’s Wharf site in London and the office component of Suzhou Hong Leong City Center in China also boosted revenue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Notably, the hotel operations segment saw a 1.7 per cent increase in revenue and improvements in revenue per available room, said CDL. This was supported by new additions including The Mayfair Hotel Christchurch, acquired in January 2025, and the Hilton Paris Opera, acquired in May 2024. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group noted that the increase in gross profits for H2 and FY2025 was marginal, despite its revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its overall gross profit margin fell to 41 per cent for H2 and FY2025, from 45 per cent for both periods in 2024, as it was impacted by an S$80.5 million allowance for foreseeable losses that was made in relation to China development properties.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at Dec 31, CDL maintained strong cash reserves of S$2.1 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The board proposed a final dividend of S$0.25 per share, payable on May 19, after the record date of May 4. Together with the special interim dividend of S$0.03 per share paid in September 2025, the total ordinary dividend for FY2025 amounts to S$0.28 per share, representing a 40 per cent dividend payout ratio. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of CDL ended Thursday 6 per cent or S$0.60 down at S$9.36.  </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/cdl-h2-net-profit-over-four-times-s538-5-million-improved-showings-across-all-segments",
            "pub_date": "2026-02-27 16:55:32",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nintendo announces 290 billion yen share sale by Kyoto bank and others",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[TOKYO] Nintendo announced on Friday (Feb 27) an unwinding of strategic shareholdings that will see companies including MUFG Bank and the Bank of Kyoto selling shares in the company behind gaming franchises such as “Super Mario”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The sale, which was first reported by Reuters, will total about 290 billion yen (S$2.35 billion) at Friday’s closing price, excluding an overallotment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Kyoto-based Nintendo also said it would spend up to 100 billion yen buying back up to 14 million shares.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nintendo’s shares pared gains and closed up nearly 3 per cent following the Reuters report. Shares in Kyoto Financial Group, a regional lender, leapt almost 10 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Resona Bank, part of Resona Holdings, and DeNA will also sell shares in Nintendo. MUFG Bank, Japan’s largest and a part of Mitsubishi UFJ Financial Group, will sell Nintendo shares held by a trust bank.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Regulators and the Tokyo Stock Exchange have encouraged Japanese companies to unwind their cross-shareholdings and the banks have outlined policies to reduce their stakes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A share sale in 2019 saw banks offload some 71 billion yen worth of Nintendo’s shares.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Toyota is planning an unwinding of strategic shareholdings that would involve banks and insurers selling around US$19 billion of its shares, Reuters reported on Thursday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The practice, which involves firms holding shares in each other to cement business ties, has been criticised by governance experts and overseas investors as insulating management from shareholders. Although the practice has been widespread in Japan for decades, it is less common in the West. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/nintendo-announces-290-billion-yen-share-sale-kyoto-bank-and-others",
            "pub_date": "2026-02-27 16:55:32",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Foreign investors pile into JGBs as yields settle, BOJ hike fears ease",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[TOKYO] Foreign investors heavily bought Japanese government bonds (JGBs) last week, drawn by relatively higher yields after January’s sharp sell-off eased – and on hopes the Bank of Japan may not rush further rate hikes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">They bought long-term Japanese bonds worth 1.89 trillion yen (S$15.31 billion) in the week until Feb 21, snapping a two-week trend of net selling, data from Japan’s Ministry of Finance showed on Friday (Feb 27).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Some analysts said if Japan follows through on its US$550 billion US investment commitment agreed in 2025, it could significantly impact the cross-currency basis swap market used to hedge US dollar exposure, boosting hedged returns on JGBs for US dollar-based investors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Foreigners, meanwhile, invested 402 billion yen in Japanese stocks, as they extended their recent buying streak into a ninth successive week.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Nikkei logged a record 59,332.43 on Thursday, as software shares gained after investor fears over the disruption from artificial intelligence eased.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At the same time, Japanese investors divested approximately 1.9 trillion yen worth of foreign long-term bonds in their largest weekly net sales since Apr 5.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, they bought foreign stocks of a net 408.5 billion yen, the most in the last three weeks. REUTERS </p></div>",
            "link": "https://www.businesstimes.com.sg/international/foreign-investors-pile-jgbs-yields-settle-boj-hike-fears-ease",
            "pub_date": "2026-02-27 16:55:33",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "British Airways owner IAG beats profit estimates as premium demand lifts earnings",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON] British Airways owner IAG reported a better-than-expected annual profit on Friday (Feb 27), as it benefited from lower fuel costs and resilience on its core transatlantic routes, particularly for its premium services.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">European airlines have been riding strong premium demand across the North Atlantic, a key profit engine, even as US-sold economy fares softened, mirroring an industry-wide trend, in which affluent travellers continue to spend. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, price-sensitive flyers pull back amid tariff-related uncertainty and shifting US demand signals. European peers have been capitalising on strong premium-travel demand, with Lufthansa rolling out new premium seats and Air France-KLM boosting premium products through upgraded cabins, lounges, and onboard services.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On Thursday, IAG said it would return 1.5 billion euros (S$2.24 billion) in excess cash to shareholders over the next 12 months, starting with a 500 million euro share buyback to be completed by the end of May 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IAG reported an operating profit before exceptional items of 5.02 million euros, compared with 4.97 billion euros projected by analysts polled by LSEG. That’s up 3.5 per cent from last year’s adjusted operating profit of 4.44 billion euros. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/british-airways-owner-iag-beats-profit-estimates-premium-demand-lifts-earnings",
            "pub_date": "2026-02-27 16:00:40",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Saying yes, for less: Why lab-grown diamonds have cornered 80% of the engagement ring market",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] For decades, the mined diamond was the undisputed centrepiece of a marriage proposal, including in Singapore. But pragmatic couples are breaking with tradition by opting for lab-grown stones instead.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lab-grown diamonds now account for about 80 per cent of engagement ring sales, jewellery stores across the island tell <em>The Business Times</em>.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Part of a worldwide trend, the transition was helped along by the US Federal Trade Commission, which in 2018 stopped defining a diamond as strictly “natural”. </p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/saying-yes-less-why-lab-grown-diamonds-have-cornered-80-engagement-ring-market",
            "pub_date": "2026-02-27 16:06:21",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        }
    ]
}