{
    "data": [
        {
            "title": "Nintendo plans around 300 billion yen share sale by Kyoto bank and others: sources",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[TOKYO] Nintendo plans an unwinding of strategic shareholdings that would see companies including MUFG Bank and the Bank of Kyoto selling shares of the <em>Super Mario</em> maker, according to three sources familiar with the situation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The sale is expected to total roughly 300 billion yen (S$2.4 billion) and Nintendo could make a decision as soon as Friday (Feb 27), two of the sources said. The Kyoto-based gaming company also plans a buyback, the sources said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Reuters is reporting Nintendo’s plan for the first time.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nintendo did not respond to a request for comment. The sources declined to be identified as the information is not public.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nintendo’s shares pared gains and were up 2.4 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Both banks have set out policies to reduce cross-shareholdings. A 2019 sale of Nintendo’s shares, in which they and others participated, totalled some 71 billion yen.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Bank of Kyoto, a regional lender, held a 4.19 per cent stake in Nintendo as at September last year. MUFG Bank, Japan’s largest, had a 3.62 per cent stake, which is held by a trust bank.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Mitsubishi UFJ Financial Group declined to comment and Kyoto Financial Group did not respond to a request for comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Kyoto Financial’s shares jumped 9 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Regulators and the Tokyo Stock Exchange have been encouraging Japanese companies to unwind their cross-shareholdings.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Toyota is planning an unwinding of strategic shareholdings that would involve banks and insurers selling around US$19 billion of its shares, Reuters reported on Thursday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The practice, which involves firms holding shares in each other to cement business ties, has been criticised by governance experts and overseas investors as insulating management from shareholders. Although the practice has been widespread in Japan for decades, it is less common in the West. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/nintendo-plans-around-300-billion-yen-share-sale-kyoto-bank-and-others-sources",
            "pub_date": "2026-02-27 12:45:42",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hyundai Motor to invest 9 trillion won in AI, robotics centre",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SEOUL] Hyundai Motor will invest nine trillion won (S$8 billion) to build an artificial intelligence (AI) data centre, robot factory and hydrogen plant in South Korea, as the automaker accelerates its push into new technologies.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The largest part of the investment will be a 5.8 trillion won AI data centre equipped with 50,000 GPUs to support autonomous vehicle development and robot learning, according to a statement from South Korea’s land ministry on Friday (Feb 27).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A further one trillion won has been allocated to open a water electrolysis facility capable of producing 80 tonnes of green hydrogen a day, while 1.3 trillion won will be spent on a solar plant to power the AI and hydrogen initiatives.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The facilities will be built in the Saemangeum area, which is about 270 kilometres (168 miles) southwest of Seoul.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The project also calls for launching Hyundai’s first robot factory in South Korea, totalling 400 billion won, designed to mass produce wearable robots and other industrial and logistics models, and eventually to foster a robot parts cluster in the region.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hyundai signed an investment agreement with seven government agencies on Friday, after clinching a partnership in October with Nvidia to develop a national physical AI cluster using the chipmaker’s Blackwell accelerators.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The announcement comes as Hyundai ramps up investment in new growth fields, including AI, robotics and self-driving technology, amid mounting pressure on its core auto business from US tariffs, competition from Chinese automakers, and a slowing transition to electric vehicles in key markets like North America.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company’s Boston Dynamics unit showcased the production-ready version of its Atlas humanoid robot at last month’s CES, which will be made in the US.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The large-scale investment also fits with South Korean President Lee Jae Myung’s call to create more jobs and boost regional economies away from Seoul and other major cities. The plan is expected create 71,000 new jobs and attract global partner companies and their talent, according to the land ministry.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The logistics and industrial robots to be mass-produced at this factory will be connected to the AI data centre for constant learning,” Lee said at a ceremony for the investment agreement. “This area will be reborn as a future city where everyone conveniently uses robots in their daily lives.” BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/hyundai-motor-invest-9-trillion-won-ai-robotics-centre",
            "pub_date": "2026-02-27 12:30:47",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Analysts raise target prices for Food Empire with strong growth expected across key markets",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Various analysts have raised their target prices on <!-- --> <!-- -->Food Empire<!-- --> <!-- -->, after the group released its “stronger-than-expected” results for FY2025. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">UOB Kay Hian (UOBKH) analysts John Cheong, Heidi Mo and Tang Kai Jie noted that its total revenue rose by 21 per cent year on year to US$577 million, as the company sees momentum and “double-digit growth” across most key markets.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As such, they increased the target price by 40 per cent to S$4.21 from S$3 previously. The counter was up 0.9 per cent or S$0.03 at S$3.24 as at the midday break.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group reported a 2025 profit after tax and minority interests (Patmi) of US$36 million, which factors in a one-off, non-cash fair value loss of US$32.6 million on redeemable exchangeable notes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Excluding this item, core Patmi had surged 38 per cent year on year to US$68.6 million, beating our full-year forecast by 15 per cent,” said the UOBKH analysts in their Thursday (Feb 26) report.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Separately, the strong revenue figure was recognised by Maybank Group Research analyst Jarick Seet as well, who has kept a “buy” rating on Food Empire and a target price of S$3.95, up from S$2.92.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He noted that in particular, revenue from Russia and Central Asia surged 34.8 per cent and 25.6 per cent year on year, respectively, driven by higher sales volume and price gains, supported by improved in-store execution and broader product range representation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This came alongside a 10 per cent appreciation of the Russian Ruble against the US dollar,” the analyst wrote on Friday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The growth from Central Asia is also partially aided by the full-year consolidation of Tea House, which became a subsidiary of the group in May 2024, said Seet.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At the same time, South Asia and South-east Asia revenue grew 16 per cent and 14 per cent year on year, respectively, driven by stronger market engagement, with South-east Asia contributing 26 per cent of total revenue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Notably, Vietnam was a significant contributor to the group’s South-east Asia sales, on “new products and marketing strategies”, according to Alfie Yeo, RHB Group Research analyst. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Food Empire’s Vietnam facility currently has a production area of around 1,313 square metres,” flagged Maybank’s Seet. “Management plans to increase production capacity by 15 per cent in 2026 through automation, and by another 30 per cent in 2027.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Management also declared a final dividend of S$0.05 per share, and special dividend of S$0.04 per share, which the analysts were upbeat about.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Yeo cited this move as a “positive surprise”, as it brings the full-year dividend per share to S$0.12, with a payout ratio of 86 per cent. He has raised his target price on the counter to S$3.73, from S$2.95.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On a whole, the analysts expect core Patmi and revenue margins to stay strong in FY2026. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Capacity expansion should continue to drive top-line growth, while improving sales mix and operational efficiencies are expected to support margins going forward,” noted the UOBKH analysts.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Some risks to such forecasts include a disruption in operations due to the Russia-Ukraine conflict, and the negative effect of a change in the value of the ruble and other countries’ currencies, Yeo from RHB Group Research said.  </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/analysts-raise-target-prices-food-empire-strong-growth-expected-across-key-markets",
            "pub_date": "2026-02-27 12:30:47",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sunway Healthcare seeks RM2.9 billion from Malaysia IPO",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[KUALA LUMPUR] Malaysia’s Sunway Healthcare Holdings has started taking investor orders for an initial public offering (IPO) that seeks to raise RM2.9 billion (S$942 million), in what may be the country’s biggest listing in nine years. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The health-care arm of conglomerate Sunway on Friday (Feb 27) said that the deal would offer 1.97 billion shares at 1.45 ringgit apiece, according to terms of the deal seen by Bloomberg News. The company is seeking to list its shares on Mar 18. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The deal would provide a boost to Kuala Lumpur’s IPO market, which saw a 14 per cent decline in proceeds last year. The MSCI Malaysia Index has gained 6.8 per cent over the past year, compared with a 38 per cent gain in the MSCI Asia-Pacific Index.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sunway Healthcare will use the proceeds for capital expenditure related to expansion of existing hospitals, construction of a new hospital and the redemption of Islamic medium-term notes. The valuation of 16.7 billion ringgit would make Sunway Healthcare the second-largest listed health-care provider in Malaysia after IHH Healthcare Bhd.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sunway Healthcare operates five private hospitals, as well as ambulatory care centres and supportive care facilities across Malaysia. It is looking to add as many as five more hospitals in the coming years, with three under construction.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The health-care listing will be Sunway’s third carveout to be listed in the Malaysian stock exchange, after its construction arm Sunway Construction Group Bhd and Sunway Real Estate Investment Trust. Founded by tycoon Jeffrey Cheah, the conglomerate operates in several industries and also owns universities, malls, quarries, and had also ventured into building data centres.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Cornerstone investors in the IPO include JPMorgan Asset Management, Eastspring Investments and RBC Global Asset Management, according to the deal terms.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Malayan Banking, AmInvestment Bank, UBS Group, HSBC Holdings and Jefferies Financial Group are among the banks arranging Sunway Healthcare’s IPO. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/consumer-healthcare/sunway-healthcare-seeks-rm2-9-billion-malaysia-ipo",
            "pub_date": "2026-02-27 12:06:18",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The argument that never ends",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IN RECENT weeks, we watched “nobody is actually using artificial intelligence (AI)” become “AI is devouring us whole”. The speed of this pivot was breathtaking. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The sceptics changed their arguments with the terrified fervour of late converts. They did not change their underlying conclusions. The conclusion always came first. The evidence was always completely negotiable. Fear simply found a new vocabulary. \n\nThe extreme optimists are equally guilty of intellectual fraud. They dip aggressively into historical archives for psychological comfort. They point blindly to the invention of the mechanical loom. They cite the widespread adoption of the car. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">They even weaponise the invention of flash-frozen food. They dress blind hope in the respectable garments of historical analysis. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Neither side can paint a credible road map of the coming decades. Both sides plunder the past for convenient anecdotes. History is stripped of its complex context to serve modern dogmas. We are using dead centuries to comfort our living fears.\n\nWhat both camps share is a stubborn refusal to accept reality. We are standing in a genuinely unrecognisable era. A fourth economic sector – beyond agriculture, industry and services – is rising vertically. Its workers are machines.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Historical precedents offer zero intellectual protection. Outsourcing physical labour to machines was easy for our egos. Outsourcing cognition is a direct assault on human pride. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Forecasting the trajectory of machine intelligence with historical analogies is fundamentally absurd. It is like predicting the arc of a modern cricket match by analysing a forgotten sport played in 18th-century Rajasthan. The rules are entirely alien. The fundamental players are no longer exclusively human. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The realisation that our history books are utterly useless will take years to accept. The future has no precedent, but the opportunists already have a script.\n\nMachines themselves are helping us build the most fanatical scenarios imaginable, engineered not for accuracy but for virality, calibrated to stoke the basest emotions of hope and dread in equal measure. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Some of these visions will be proven right. Most will not. It will not matter. By the time any verdict arrives, there will be exponentially more to process, more to fear, more to celebrate, more to argue about. \n\nFor now, the arrow of history points towards a few cold truths. AI will not be useless. It will not suddenly plateau on some invisible scaling law. It will not go unused by the masses. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This reveals exactly how the technology will infiltrate every future argument. It will be used as a blank canvas for human insecurity. It will be weaponised for political ends, financial positioning and bitter personal agendas. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">We are seeing only the first skirmishes of a permanent war of interpretation. People will take aggressive stances on algorithms simply to secure their own relevance. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">History will be dragged from its grave to serve preformed conclusions. It will be shouted loudly across every platform. Volume is the only compensation for the total absence of evidence.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But the true crisis is not societal. The true crisis is fiercely intimate. Most of us wear two fundamentally incompatible masks. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Economists hide this trauma behind sterile terminology. They speak casually of producer utility. They speak academically of consumer utility. The reality is simpler and far more brutal. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In different domains of our lives, we sit on completely different sides of the AI divide. We sit on opposite sides of our own lives. And, we switch sides constantly. Sometimes within the same hour. We are haunted by our own hypocrisy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Imagine waking up drowning in profound gratitude. An AI perfectly diagnoses a loved one. It spots the invisible anomaly. It actively saves a human life – never mind the career of the displaced radiologist. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nightfall brings a radically different reality. A child returns home with an expensive engineering degree to discover that the job market has shifted beneath them. Fury rapidly replaces the morning gratitude. We are desperate to quarantine the magic from the massacre.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Then, before bed, the portfolio notification arrives. The AI infrastructure company posted record earnings. The retirement account is up. Three emotional states. None of them is dishonest. They inhabit one body. They occur on the exact same day. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A child in a remote village finally receives a world-class education. An algorithm tailors every lesson to her specific mind. It is a beautiful triumph of accessibility. It is also a quiet tragedy. That same child will never secure the offshore service job her older sibling cherished. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Our wallets celebrate the very efficiency that breaks our hearts. The ladder that lifted hundreds of millions into the middle class is being pulled up while a different, unfamiliar ladder is being lowered. Nobody knows if the new one reaches the same floors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Every convenience comes twinned with a threat. Every gain in one role is shadowed by a loss in another. It is the modern condition of trying to reason with a moody, two-faced Gemini hovering in the OpenAI clouds, never quite knowing if today’s X factor will be benevolence or foreclosure. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The bribe of convenience is simply too sweet to refuse. We willingly fund the exact forces we deeply fear.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">These internal divisions are not temporary. They are permanent features of the new economy.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">We will beg to separate the warmth of the fire from its devastating burn. The separation is impossible. We harbour a personal AI left and a personal AI right. Our political stance shifts dynamically with our daily convenience. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The trauma crosses generations seamlessly. Parents who cheat death via medical algorithms raise children who starve for economic relevance. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nobody designed it this way. It is simply what happens when a force this large moves this fast through a species this complicated.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>The writer is chief executive officer of Singapore-based, global innovation investment company, GenInnov</strong>\n<strong>This is an edited excerpt of an article published on </strong><em><strong>https://www.geninnov.ai/blog</strong></em></p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/argument-never-ends",
            "pub_date": "2026-02-27 12:00:41",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Panama officials search CK Hutchison’s subsidiary office: source",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[PANAMA CITY] Panamanian authorities conducted a search of an office unit of Hong Kong conglomerate CK Hutchison in Panama on Thursday (Feb 26), according to a source familiar with the operation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The raid on CK Hutchison’s Panama Ports Company (PPC) did not relate to a government decision to annul deals that gave the company control of two strategic port canals in Panama, this source said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The source declined to be identified because the information had not yet been made public.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CK Hutchison did not immediately respond to a request for comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This is an independent investigation carried out exclusively by the Public Ministry of Panama in the exercise of its legal powers,” the Panamanian government said in a statement without naming CK Hutchison as the target of the raid.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CK Hutchison’s shares fell 0.9 per cent in early trading in Hong Kong on Friday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Local media reported the raid earlier. Television station TVN showed images of about a dozen people, some wearing vests emblazoned with the initials of Panama’s investigative police, or DIJ, in an underground parking lot that the station said was in the high-end Albrook area of Panama City.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The images showed some of the people loading cardboard boxes into the back of a police truck.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The name of the location was not visible in the images, and Reuters could not independently verify the report.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A judicial official interviewed on a local television station confirmed a search had taken place, but did not name the business or what materials had been seized.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Panama’s top court recently declared unconstitutional CK Hutchison’s contracts to operate port terminals at the entrance to the Panama Canal, leading the government to annul the deals.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The decision sparked a battle embroiling both Beijing and Washington, after pressure from US President Donald Trump for Panama to curb Chinese influence over the Panama Canal, which carries about 5 per cent of global maritime trade.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CK Hutchison has said that it sees the decision as unlawful and is considering legal action. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/panama-officials-search-ck-hutchisons-subsidiary-office-source",
            "pub_date": "2026-02-27 11:50:43",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indonesia court jails ex-CEOs of Pertamina units in major graft case",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[JAKARTA] An Indonesian court has jailed nine people in a major corruption case involving subsidiaries of state energy firm Pertamina, including two former chief executives of its units, which prosecutors say caused US$17 billion in state losses.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The case, which centres on alleged illegal leasing of a fuel terminal and illegal imports of crude oil, among other offences, is one of the biggest launched under the administration of President Prabowo Subianto, who has vowed to eradicate corruption.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The nine were sentenced by the Central Jakarta Court, with the reading of the verdicts starting on Thursday (Feb 26) afternoon and continuing into the early hours of Friday. The defendants were sentenced to prison terms ranging from nine years to 15 years, after prosecutors had sought terms of 14 to 18 years. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Yoki Firnandi, former chief executive of Pertamina International Shipping, and Riva Siahaan, former Pertamina Patra Niaga chief executive, each received a nine-year sentence from the panel of judges. Muhamad Kerry Adrianto Riza, a beneficial owner of a fuel terminal leased by Pertamina, was jailed for 15 years for his involvement, less than the 18 years sought by prosecutors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Riza is the son of businessman Mohammad Riza Chalid, who has been named a suspect in the case and who the police said is now at large.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The three men had each denied the charges against them and pleaded not guilty, local media reported during the trial.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Riza’s lawyer Patra Zen said on Friday that his client rejected the ruling and would appeal.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Outside the court on Friday, Firnandi said that he was disappointed by a verdict that he called a farce, and said he would discuss with his counsel about appealing.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Siahaan’s lawyer Luhut Pangaribuan said that he was saddened and disappointed by the verdict.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Pertamina did not immediately respond to a request for comment. The company has previously said that it respected the legal process and had cooperated with the investigation. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/asean/indonesia-court-jails-ex-ceos-pertamina-units-major-graft-case",
            "pub_date": "2026-02-27 11:35:41",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "450 high-net-worth investors granted Singapore PR under Global Investor Programme from 2015 to 2025",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Around 450 high-net-worth investors were granted permanent residency under the Global Investor Programme (GIP) between 2015 and 2025, injecting about S$500 million directly into Singapore-based entities, Minister of State for Trade and Industry Gan Siow Huang said in Parliament on Friday (Feb 27).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The GIP grants PR status to eligible global investors who make significant investments to drive business growth in Singapore.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">More than half of the S$500 million invested went to the professional services, info-communications and financial services sub-sectors, said Gan. Another S$430 million was placed in GIP-select funds investing in Singapore-based companies.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Qualified investors may apply for the GIP through three options: investing at least S$10 million in a Singapore-based business; placing at least S$25 million in a GIP-select fund; or establishing a single family office with at least S$200 million in assets under management, of which at least S$50 million must be deployed in Economic Development Board (EDB)-specified investments.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">About half of the investors invested directly in Singapore-based businesses, 40 per cent placed money in GIP-select funds, and the remaining 10 per cent set up single family offices.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“EDB works with the GIP recipients to ensure that they continue to fulfil the government’s specified economic and residency commitments during their stay,” said Gan, in response to questions from Workers’ Party MP Fadli Fawzi.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Qualified investors are required to submit evidence of the Singapore-based companies that they have invested in. EDB also conducts visits to these companies to assess their business activities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Asked by Fadli if the profile and volume of GIP applicants has changed since the 2023 review – when investment thresholds for all three options were raised – Gan replied that there has not been a major change yet.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">She noted, however, that the composition of GIP-select funds have shifted since the review: “In fact, I would say that prior to 2023, the GIP funds comprised mainly of local funds.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">GIP applicants who have chosen to invest through the select funds since the review are still going through the application process and have yet to confirm their investments, Gan added. </p></div>",
            "link": "https://www.businesstimes.com.sg/singapore/450-high-net-worth-investors-granted-singapore-pr-under-global-investor-programme-2015-2025",
            "pub_date": "2026-02-27 11:16:16",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold steady as investors weigh progress in US-Iran talks",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BENGALURU] Gold prices held broadly steady on Friday (Feb 27), with investors digesting the previous day’s US-Iran nuclear talks, while the US dollar, hovering near three-week highs, pressured the yellow metal. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Spot gold was steady at US$5,187.39 per ounce by 9.46 am. Bullion hit a more than three-week high on Tuesday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">US gold futures for April delivery were up 0.2 per cent at US$5,204.10. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The US dollar held steady to hover near three-week highs, making US dollar-denominated gold more expensive for holders of other currencies. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The number of Americans filing new applications for jobless benefits increased slightly last week, and the unemployment rate appeared to hold steady in February amid a stable labour market. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, Federal Reserve chair nominee Kevin Warsh’s path to out-of-the-gate interest rate cuts in alignment with US President Donald Trump’s expectations could be narrowing amid emerging bullishness about the US economy, growing CEO confidence in the outlook, and investors keying off a hawkish shift among the central bank’s policymakers. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Markets currently expect three 25-basis-point rate cuts from the Federal Reserve this year, according to CME’s FedWatch Tool. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Gold looks neutral in a range of US$5,158 to US$5,201 per ounce, and an escape could suggest a direction, Reuters technical analyst Wang Tao said, adding that the bias might be towards the upside, it is supposed to travel to US$5,243 or a much higher level. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In Geneva, the US and Iran made progress in talks over Tehran’s nuclear programme on Thursday, mediator Oman said, but hours of negotiation ended with no sign of a breakthrough that could avert potential US strikes amid a massive military buildup.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Spot silver rose 0.6 per cent to US$88.81 per ounce, after climbing to a three-week high on Wednesday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Spot platinum added 0.6 per cent to US$2,286.53 per ounce, while palladium gained 0.5 per cent to US$1,794.13. REUTERS </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/energy-commodities/gold-steady-investors-weigh-progress-us-iran-talks",
            "pub_date": "2026-02-27 11:12:06",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sweet succession: The heir rewriting Vietnam’s largest sugar empire",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><em><strong>Inside Asia’s family empires: How they are transforming to seize the next stage of growth</strong></em></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[HO CHI MINH CITY] Far from the cane fields that built her family’s fortune, Dang Huynh Uc My, or Omi Dang – the daughter of a couple once dubbed Vietnam’s “sugar king and sugar queen” – set up a modest three-person office in Singapore to plot an unlikely overseas push for AgriS. It would prove to be a sweet spot.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Fifteen years on, that tentative outpost has become the nerve centre of AgriS’ international expansion – a strategy that helped transform a domestic sugar champion into a group with more than US$1 billion in annual revenue and exports to nearly 80 countries.</p></div>",
            "link": "https://www.businesstimes.com.sg/international/asean/sweet-succession-heir-rewriting-vietnams-largest-sugar-empire",
            "pub_date": "2026-02-27 11:05:42",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        }
    ]
}