{
    "data": [
        {
            "title": "Bitcoin recovers above US$68,000 after death of Iranian leader",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[MUMBAI] Bitcoin and other cryptocurrencies rebounded sharply in early Asia trading on Sunday (Mar 1) after Iran confirmed that the country’s supreme leader had been killed during a military campaign by the US and Israel.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The original cryptocurrency rose as much as 2.21 per cent to US$68,196 following the news. It was trading at around US$67,700 at 11 am in Singapore, after dropping as much as 3.8 per cent the previous day. Ether, the second-largest token, gained as much as 4.58 per cent to trade back above US$2,000.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Crypto markets, which trade 24/7, were rattled in the hours after the bombing began. Iran launched counterstrikes on multiple locations – including Israel, Qatar, the United Arab Emirates and Bahrain – and threatened more against US linked bases in Iraq. Yet digital assets started to recover throughout the day, with Bitcoin moving sharply higher after initial reports that Iranian leader Ayatollah Ali Khamenei was dead.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Traders generally don’t expect the Iran conflict to have major negative economic consequences, and demand for upside Bitcoin calls has clearly picked up in recent days,” said Markus Thielen, head of research at 10x Research, adding that traders were positioning themselves for the upcoming Federal Reserve meeting.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Cryptocurrencies had recovered roughly US$32 billion in market value by Sunday morning, after shedding about US$128 billion the previous day, according to data from CoinGecko.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Bitcoin is the only large liquid asset trading 24/7, so it absorbed all the selling pressure that would normally spread across equities, bonds, and commodities,” said Hayden Hughes, managing partner at Tokenize Capital. “The real price discovery happens Monday when US equity markets and Bitcoin ETFs reopen. With missiles hitting Dubai, Iranian retaliation across the Gulf, and Strait of Hormuz closure risk, this is not a contained event.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For Bitcoin, the weekend losses extend a months-long sell-off in crypto markets, beginning with the liquidation of some US$19 billion in leveraged positions in October. Bitcoin has fallen around 50 per cent from its all-time peak of over US$126,000 earlier that month, unable to latch on to rallies in gold and other safe-haven assets.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“As always, when critical events take place during the weekend, Bitcoin plays the role of pressure valve,” said Justin d’Anethan, head of research at Arctic Digital, noting that the initial impact on the token wasn’t as drastic as some might have expected.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“With a lot of the leverage already cleared out and exhausted sellers, there’s only so much impact macro events can have,” he added.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, with traditional venues closed, digital-asset investors turned to tokenized commodities on decentralised exchange Hyperliquid to position for geopolitical fallout. Prices for contracts tied to oil, gold and silver jumped on the platform.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The reaction also materialised through a sharp increase in selling pressure on Bitcoin derivatives, where within a single hour on Saturday morning, sell volume surged by approximately US$1.8 billion, according to an analysis published by CryptoQuant.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This type of imbalance reflects clear seller dominance and rising short-term risk aversion,” wrote crypto analyst Sylvain Olive. “Flows are driven more by emotion and risk management than by structural dynamic, requiring a cautious approach.” BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/wealth/crypto-alternative-assets/bitcoin-recovers-above-us68000-after-death-iranian-leader",
            "pub_date": "2026-03-01 11:56:39",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil and gas majors and traders suspend shipments via Hormuz: sources",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON] Several tanker owners, oil majors and trading houses have suspended crude oil, fuel and liquefied natural gas shipments via the Strait of Hormuz after the US and Israel attacked Iran and Teheran said it had closed navigation, trading sources said on Saturday (Feb 28).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Our ships will stay put for several days,” one top executive at a major trading desk said. Satellite images from tanker trackers showed vessels backed up next to big ports, such as Fujairah in the United Arab Emirates, and not moving through Hormuz.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Multiple vessels in the area have received VHF transmission from Iran’s Revolutionary Guards that “no ship is allowed to pass the Strait of Hormuz”, an official with the EU naval mission Aspides told Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The British Navy said Iran’s orders were not legally binding and advised vessels to transit with caution.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Vessel traffic through the Strait of Hormuz has not completely stopped but disruptions are building rapidly, shipbroker Poten &amp; Partners said in a note to clients.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The tanker association Intertanko said the US Navy had warned against navigation in the area – the whole of the Gulf, Gulf of Oman, North Arabian Sea, and the Strait of Hormuz – saying it could not guarantee the safety of shipping.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Greece’s shipping ministry advised vessels on Saturday to avoid the Persian Gulf, the Gulf of Oman and the Strait of Hormuz, according to an advisory seen by Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Some 20 per cent of global oil, including from producers Saudi Arabia, the United Arab Emirates, Iraq, Kuwait and Iran, passes through Hormuz along with large volumes of LNG from Qatar.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Fourteen LNG tankers have shown signs of slowing down, U-turning or stopping in or around the Strait, said Laura Page from consultancy Kpler,adding that the number would likely rise, posing risks to Qatari LNG exports.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">German container-shipping group Hapag-Lloyd said it is suspending all vessel transit through the Strait of Hormuz until further notice. Services calling on ports in the Gulf may experience delays, rerouting or schedule adjustments, the company said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Denmark’s Maersk said in an undated update on its website that it was coordinating with security partners on all operations in the Red Sea and the Gulf of Aden but cargo acceptance in the Middle East remained open.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">French shipping group CMA CGM said it had told its vessels inside or headed for the Gulf to proceed to shelter after the US and Israel attacked Iran. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/oil-and-gas-majors-and-traders-suspend-shipments-hormuz-sources",
            "pub_date": "2026-03-01 11:31:34",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire CEO Greg Abel seeks to reassure shareholders after taking baton from Buffett",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[NEW YORK] Berkshire Hathaway’s new chief executive Greg Abel moved to put his stamp on the conglomerate with his first annual letter to shareholders on Saturday (Feb 28), pledging to maintain its “fortress-like” balance sheet and uphold the values of his predecessor and mentor, Warren Buffett.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Abel, 63, said he would not rush to deploy Berkshire’s near-record US$373.3 billion cash stake, though he said it gave the company plenty of “dry powder” and that he had no plans to begin paying dividends, which Buffett also opposed. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Berkshire has not repurchased its own stock since the spring of 2024. “I recognize how you want us to succeed together, and to do so in the right way,” Abel wrote in an 18-page, single-spaced letter. “My role is to ensure our liquidity levels and capital deployment remain intentional and deliberate.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Abel also paid homage to Buffett, 95, who remains chairman and goes to Berkshire’s offices five days a week, calling him a “remarkable” CEO.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Warren Buffett is arguably the greatest investor of all time, with generations benefiting from his investment acumen,” Abel wrote. “To invest in Berkshire has long been a vote of trust in our founder – a trust that now rests with Berkshire.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Berkshire shares have significantly underperformed the Standard &amp; Poor’s 500 index since Buffett announced unexpectedly in May he was stepping aside as CEO. Though Abel’s letter lacked Buffett’s writing flair, CFRA Research analyst Cathy Seifert said it might prove reassuring to investors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“He needed to show a degree of continuity, that the Berkshire franchise would continue despite the change in leadership, and it would be business as usual,” she said. “In my opinion, he hit the mark.” The letter also signalled that Abel wouldn’t upend Buffett’s 60 years of work transforming Berkshire from a failing textile company into a more than US$1 trillion conglomerate that owns car insurer Geico, BNSF railroad and dozens of other insurance, manufacturing, energy and retail businesses. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“If there were any doubts about whether Greg was the right individual to take the reins, the letter should dispel them,” said Dan Hanson, who oversees more than US$6 billion as head of the quality equity team at Neuberger Berman.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Profit declines </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Berkshire also reported declining profit, after taking writedowns for its approximately 27 per cent stakes in both Kraft Heinz and oil company Occidental Petroleum. Fourth-quarter operating profit fell 30 per cent to US$10.2 billion as income from insurance operations such as Geico declined. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Net income fell 3 per cent to US$19.2 billion, reflecting a US$4.5 billion writedown for Occidental, despite gains from equity holdings led by Apple and American Express. For all of 2025, operating profit fell 6 per cent to US$44.49 billion, while net income fell 25 per cent to US$66.97 billion. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Buffett had long urged investors to ignore fluctuations in Berkshire’s net income, which reflect accounting rules for equity investments. Full-year revenue was essentially unchanged at US$371.44 billion, and Seifert said Abel “teed up an expectation that reinsurance and commercial insurance growth may be nonexistent” in 2026.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">One of Berkshire’s best-known businesses, Fruit of the Loom, shed 6,000 jobs last year as revenue fell, Berkshire said.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Wildfire-battered PacifiCorp utility ‘not a deep pocket’</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Abel said Berkshire’s culture and values will continue “in perpetuity,” and signalled no changes in its decentralised structure in which its dozens of businesses operate largely without interference from the top. He also signalled a willingness to stick around, suggesting that in 20 years he will have had “just a fraction of the tenure that Warren had.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Abel pledged to invest in durable, well-managed businesses that Berkshire understands and “avoid businesses that undermine the fabric of society or could jeopardise Berkshire’s reputation.” He did not elaborate, but Seifert said he could have been referring to artificial intelligence. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Abel acknowledged pressures on its PacifiCorp utility from litigation over Oregon and California wildfires that burned more than 500,000 acres in 2020. Many victims blame PacifiCorp, saying it failed to shut off power lines. The utility has reached more than US$2.2 billion of settlements, but faces US$50 billion of additional wildfire claims. Abel said Berkshire accepts responsibility when it causes wildfires, but will fight unjustified claims in court. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“PacifiCorp is not an insurer of last resort and should not be treated as a deep pocket,” Abel said. “Accountability, paired with principled opposition to unwarranted liability, is essential to preserving the regulatory compact that governs utilities.”</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Ted Weschler stays on </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Abel was more critical than Buffett of Berkshire businesses that could perform better. He said the performance gap between BNSF and industry-leading rivals is “too wide,” while “self-inflicted” difficulties at the Shaw flooring company hurt quality and service. “Each business is accountable to its CEO, who is expected to pursue operational excellence relentlessly and close performance gaps,” Abel said, referring to Berkshire’s non-insurance businesses. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hanson, the Neuberger Berman investment manager, said: “Those are fighting words.” Berkshire has not named a chief investment officer to replace Buffett, though Abel said responsibility for equity investments “ultimately resides with me as CEO.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Abel signalled that longtime portfolio manager Ted Weschler, who manages about 6 per cent of Berkshire’s equity investments, will continue playing a “broader role” assessing significant investment opportunities and supporting Berkshire in other ways. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/berkshire-ceo-greg-abel-seeks-reassure-shareholders-after-taking-baton-buffett",
            "pub_date": "2026-03-01 11:21:23",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thai gold-trading curbs take effect as authorities rein in baht",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BANGKOK] Thailand will implement tough new rules governing retail gold-trading from Sunday (Mar 1), hoping to curb speculative activity that’s fuelled gains in the baht and weakened the nation’s competitiveness.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Individuals’ online, baht-denominated gold transactions will be subject to a daily limit of 50 million baht (S$2 million) per person, per platform, according to the Bank of Thailand’s website. The rules exempt US dollar-denominated trades, physical gold shop dealing and futures markets.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In addition, the central bank is requiring full, upfront electronic payments for any transactions. It is also banning nominee accounts and short selling, arguing the changes will boost transparency and market standards.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The move underscores growing concern within the central bank that large, baht-denominated gold trades have amplified the currency’s strength. The baht has gained about 9 per cent over the past year, making it the second-best performer among Asian currencies tracked by Bloomberg. The rally, which officials say is partly driven by US dollar-sales linked to gold, has weighed on exports and tourism, adding to headwinds for the economy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We’ve seen online gold trading volumes ease slightly since the measures were floated earlier this year, but it’s still too soon to tell whether that’s having any impact on the currency,” Teerarat Jutavarakul, managing director at InterGold Gold Trade, said in an interview on Thursday. “After Mar 1, we’ll need a period of bigger price swings, like we saw in January, to really determine whether these rules are making a difference.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The rollout comes as earlier efforts to weaken gold’s grip on the baht appear to be losing traction. The 60-day correlation between the currency and the precious metal climbed to the highest level since September last month, after having fallen to a two-year low earlier. That renewed linkage has helped keep the baht trading near 31 per US dollar for much of this year – a level some analysts view as a threshold at which the Bank of Thailand may step up efforts to counter excessive strength.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Policymakers have repeatedly flagged that the baht’s gains have outpaced what economic fundamentals would suggest, fuelled in part by speculative and high-value gold transactions that spur US dollar selling and push the local currency higher. Such dynamics have reignited debate over the limits of traditional monetary tools in managing exchange-rate volatility.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In its latest statement on Wednesday, the Monetary Policy Committee said the baht’s appreciation has tightened financial conditions for exporters, particularly those facing intense price competition and thin profit margins. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The panel said it will closely monitor currency movements and transactions that exert significant pressure on the baht, including assessing the effectiveness and adequacy of regulatory measures already introduced for gold. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/asean/thai-gold-trading-curbs-take-effect-authorities-rein-baht",
            "pub_date": "2026-03-01 10:55:37",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US-Iran strikes unleash travel chaos as airlines cancel flights",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[DUBAI] Major Middle Eastern airports, including Dubai, the world’s busiest international travel hub, were shut on Saturday (Feb 28) after US and Israeli strikes on Iran and Iranian missile retaliation rippled through the region, unleashing one of the most severe disruptions to global aviation in years. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dubai’s international airport, which handles more than 1,000 flights a day, sustained damage during an overnight Iranian retaliatory attack on sites across the Arab Gulf states, while Abu Dhabi and Kuwait’s international airports were also hit. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Major regional gateways including Dubai, Doha and Abu Dhabi were closed as countries across the Middle East shut their airspace following the strikes and Iran’s retaliation. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Flight maps showed skies over Iran, Iraq, Kuwait, Israel and Bahrain virtually empty, while airlines across Europe and the Middle East announced sweeping cancellations.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dubai and neighbouring Doha sit at the crossroads of east-west air travel, funnelling long-haul traffic between Europe and Asia through a tightly scheduled network of connecting flights. Any prolonged shutdown of its airports ripples far beyond the region, forcing airlines worldwide to reroute or cancel services.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The scale of these hubs today is just so enormous. You will have hundreds of thousands of people being stuck in wrong parts of the world without any certainty as to when they can move,” said UK-based aviation analyst John Strickland.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It hits at so many levels. There is the immediate issue of what happens today and the ricochet effect of how long this persists,” Strickland added, noting that major Gulf airlines, like Emirates and Qatar Airways, are also among the world’s biggest cargo operators.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dubai Airports suspended all flights at Dubai International and at Al Maktoum International until further notice, urging passengers not to travel.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Airspace could be closed for ‘some time’ </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The US and Israel launched their most ambitious attack on Iran in decades on Saturday, killing Iran’s Supreme Leader Ayatollah Ali Khamenei and prompting Iran to retaliate with missile and drone attacks, sharply raising the risk of a broader Middle East conflict.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Passengers and airlines can expect airspace to be shut for quite some time,” said Eric Schouten, head of aviation security advisory Dyami.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Airlines cancelled on Saturday about half of their flights to Qatar and Israel and about 28 per cent of their flights to Kuwait, after the US and Israel launched strikes on Iran, according to preliminary Cirium data. In total, about 24 per cent of flights to the Middle East were cancelled, the data showed.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The region has become more important for global aviation since the Russia-Ukraine war forced airlines to avoid both countries’ airspace.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Conflict zones add to operational risks, raising fears of accidental shoot-downs and lengthening routes, which increases fuel costs.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Passengers stranded across Europe</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Students travelling from Paris to Dubai said their college trip was abandoned. “We still have some students that went there earlier and they’re stuck in Dubai and we don’t know when they’ll be able to come back,” said Benjamin Gnatek.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At Charles de Gaulle airport, Thai-bound traveller Roman Simon said his onward flight via Doha was cancelled. “Now, we’re trying to find a solution to still make our trip to Thailand,” he told Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At Doha’s Hamad International Airport, gates were nearly empty as stranded passengers queued to make hotel arrangements, a Reuters witness said. As countries in the region closed their airspace, aircraft were forced to divert around Larnaca, Jeddah, Cairo and Riyadh. Flightradar24 briefly went down due to surging demand.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The European Union’s aviation regulator EASA on Saturday recommended its airlines stay out of the airspace affected by the ongoing military intervention. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/us-iran-strikes-unleash-travel-chaos-airlines-cancel-flights",
            "pub_date": "2026-03-01 10:16:21",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Iranian state media confirms Supreme Leader Ayatollah Ali Khamenei killed; Trump says strikes will continue",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[TEHERAN] Iran’s Supreme Leader Ayatollah Ali Khamenei has been killed in Israeli and US strikes, Iranian state media said on Sunday (Mar 1).  The strikes also resulted in the deaths of several of Khamenei’s family members, including his daughter, grandchild, daughter-in-law and son-in-law.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">US President Donald Trump on Saturday celebrated US-Israeli airstrikes that he said killed Iranian Supreme Leader Ayatollah Ali Khamenei, but warned attacks would continue. The strikes, which Trump said were aimed at destroying Iranian missiles and annihilating its navy, follow repeated US-Israeli warnings that they would strike Iran again if it pressed ahead with its nuclear and ballistic missile programmes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A senior Israeli official earlier told Reuters that Khamenei’s body had been found, and Trump concurred in a post on Truth Social.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump, who is monitoring the operation from his Mar-a-Lago oceanfront resort in Florida, posted on Saturday afternoon that Khamenei had died in the strikes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This is not only Justice for the people of Iran, but for all Great Americans, and those people from many Countries throughout the World, that have been killed or mutilated by Khamenei and his gang of bloodthirsty THUGS,” Trump wrote.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump had warned earlier on Saturday there could be American casualties from “major combat operations” in Iran. But almost 12 hours after the first strikes, US Central Command said it had “no reports of US casualties or combat-related injuries. Damage to US installations was minimal and has not impacted operations.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The strikes are expected to happen over several days, a US official told Reuters. Trump said on social media that heavy bombing “will continue, uninterrupted throughout the week or, as long as necessary” to achieve “PEACE THROUGHOUT THE MIDDLE EAST AND, INDEED, THE WORLD!”</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">US officials accuse iran negotiators of playing games</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This is the second series of US strikes on Iran since Trump returned to the White House last year. The first was in June when Washington struck Iranian nuclear sites. Despite talks in recent weeks between Iran and the US, including a meeting on Thursday, senior Trump administration officials told reporters on Saturday the president saw both immediate and long-term reasons to green-light the latest strikes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">One senior US official said the Iranians were not willing to give up their nuclear program, and that “it was very clear that the intent for them was to preserve their ability to do enrichment, so that over time, they could use it for nuclear bombs.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This official said the Iranians used “games, tricks, stall tactics” to string out talks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Another senior US official said Iran’s missile programme posed a more immediate threat, and the US had “indicators” Iran intended to use this capability against American forces “potentially, preemptively,” or “simultaneous” to military operations against the Iranians.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We had analysis that basically told us, if we sat back and waited to get hit first, the amount of casualties and damage would be substantially higher than if we acted in a preemptive defensive way,” the senior administration official said without sharing specific details.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In his original Saturday announcement video, Trump encouraged regime change, telling the members of the Islamic Revolutionary Guard Corps, Iran’s elite armed forces, to lay down their weapons, promising they would be granted immunity.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The other option, according to Trump, is “certain death.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Iranian people should “take over” governance of their country, Trump said in the video.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It will be yours to take,” he said. “This will be probably your only chance for generations.”</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Some lawmakers look for more answers</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Photos released by the White House from Mar-a-Lago show Trump wearing a white “USA” hat as he worked with his national security team near a large map of the Middle East dotted with American and Iranian flags.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Mar-a-Lago’s gold-leaf decor is nowhere to be seen in the handout photos, as the president, CIA Director John Ratcliffe, Secretary of State Marco Rubio, chairman of the Joint Chiefs of Staff General Dan Caine, and White House Chief of Staff Susie Wiles work in a space surrounded by long black curtains hanging from wood rafters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Other Cabinet officials joined from Washington, with one handout photo showing vice-president JD Vance in the White House’s Situation Room.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Trump administration said Rubio spoke this week with top congressional leaders in both parties leading up to the strike.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Everything I have heard from the administration before and after these strikes on Iran confirms this is a war of choice with no strategic endgame,” said Representative Jim Himes of Connecticut, the top Democrat on the House of Representatives’ Intelligence Committee.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">House Minority Leader Hakeem Jeffries said the administration must seek congressional authorisation for the preemptive use of military force that constitutes an act of war.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Rubio told the leaders during a briefing at the White House on Tuesday that the operation would likely move forward even as diplomatic efforts continued, two sources familiar with the matter said. The secretary of state on Friday informed the top lawmakers that the operation to attack Iran was likely to commence in the following hours, but said Trump could change his mind, the sources said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Some European nations are urging a return to negotiations, but most of Trump’s fellow Republicans in Congress – and a few Democrats such as Senator John Fetterman of Pennsylvania – cheered Saturday’s strikes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Senator Lindsey Graham, a South Carolina Republican and frequent advocate for an aggressive US foreign policy, criticised European calls for further talks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To our European allies: you have gone pathetically soft and lost your zeal for confronting evil apparently unless it’s on your front porch,” Graham said in a social media post. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/iranian-state-media-confirms-supreme-leader-ayatollah-ali-khamenei-killed-trump-says-strikes-will",
            "pub_date": "2026-03-01 09:45:40",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "What can China do to slow down its rising currency?",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[HONG KONG] China’s renminbi is surging against the US dollar, boosted by booming exports and aided by falling US interest rates and the wobbly greenback.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The renminbi strengthened 4.4 per cent last year in its biggest annual gain since 2020, and has firmed about 2 per cent so far in 2026, hovering near three-year highs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">China’s central bank moved to slow the pace of renminbi appreciation on Feb 27, scrapping risk reserves requirements for forex forward contracts in a move that would encourage US dollar buying.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The People’s Bank of China (PBOC) may deploy additional measures to prevent the renminbi from appreciating too quickly, analysts say.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here are the tools at its disposal:</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">FX requirements ratio</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The PBOC said it would scrap the 20 per cent reserves requirements for forex forward contracts, starting on Monday (Mar 2).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The move would reduce the cost of US dollar buying, and reverses a decision in September 2022 to raise the risk reserve requirements to stem the renminbi’s rapid losses and capital outflows.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It sends a clear policy signal that regulators want to prevent excessive renminbi appreciation, which will help stabilise market expectations,” said Wang Qing, chief macroeconomic analyst at Orient Golden Credit Rating.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Next, the PBOC could raise outright the amount of foreign exchange that financial institutions must hold as reserves, which would require US dollar buying and tighten onshore US dollar liquidity – slowing renminbi gains. It is currently at 4 per cent, having been reduced from 6 per cent in 2023 as a measure to try and stem renminbi weakness.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Counter-cyclical factor in renminbi’s daily guidance fix</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Since December, the central bank has been setting its daily renminbi official guidance at levels weaker than market projections, signalling its attention to slow the pace of renminbi appreciation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The gap has widened this week to record levels, signifying the PBOC’s growing discomfort with the renminbi’s rise and its strong intent to manage market expectations.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">State bank dollar buying</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">China’s major state-owned banks bought US dollars in the onshore spot market and held them in an unusually strong effort to rein in renminbi strength, Reuters reported in December.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The lenders did not appear to recycle the US dollars into the swap market, likely aimed at tightening US dollar liquidity and so raising the cost of long renminbi bets.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Although the PBOC itself wasn’t seen directly in the market, the state banks could have been acting on behalf of the central bank, said Brad Setser, a currency expert at the Council on Foreign Relations, in a recent blog post.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“All the activity is with the state banks,” he noted estimating a “nearly unprecedented” level of backdoor intervention in December.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Verbal guidance</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">PBOC officials frequently make public statements to reaffirm its commitment to keep the renminbi “basically stable”, and warn against the risk of currency overshooting.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The central bank has also repeatedly urged market participants to use derivatives to hedge against currency risks, rather than making one-way bets on the renminbi.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Direct intervention</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In extreme cases, the PBOC can directly buy and sell foreign currencies in the market to influence exchange rates.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">During the 2015-16 China market crash, the PBOC sold US dollars in the market to stablize a slumping renminbi.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In recent years, China’s central bank has refrained from direct intervention, which is evidenced by its relatively stable foreign currency reserves. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/capital-markets-currencies/what-can-china-do-slow-down-its-rising-currency",
            "pub_date": "2026-03-01 10:05:49",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump cheers death of Iranian Supreme Leader Ayatollah Ali Khamenei, says strikes will continue",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[PALM BEACH, Florida] US President Donald Trump on Saturday (Feb 28) celebrated US-Israeli airstrikes that he said killed Iran’s leader, but warned attacks would continue. The strikes, which Trump said were aimed at destroying Iranian missiles and annihilating its navy, follow repeated US-Israeli warnings that they would strike Iran again if it pressed ahead with its nuclear and ballistic missile programmes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, Khamenei’s daughter, grandchild, daughter-in-law and son-in-law were killed in US-Israeli strikes, Iranian state media reported on Sunday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump, who is monitoring the operation from his Mar-a-Lago oceanfront resort in Florida, posted on Saturday afternoon that Iranian Supreme Leader Ayatollah Ali Khamenei had died in the strikes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iran has not confirmed Khamenei’s death, and Iranian news agencies Tasnim and Mehr reported he was “steadfast and firm in commanding the field.” But a senior Israeli official earlier told Reuters that Khamenei’s body had been found, and Trump concurred in a post on Truth Social.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This is not only Justice for the people of Iran, but for all Great Americans, and those people from many Countries throughout the World, that have been killed or mutilated by Khamenei and his gang of bloodthirsty THUGS,” Trump wrote.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump had warned earlier on Saturday there could be American casualties from “major combat operations” in Iran. But almost 12 hours after the first strikes, US Central Command said it had “no reports of US casualties or combat-related injuries. Damage to US installations was minimal and has not impacted operations.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The strikes are expected to happen over several days, a US official told Reuters. Trump said on social media that heavy bombing “will continue, uninterrupted throughout the week or, as long as necessary” to achieve “PEACE THROUGHOUT THE MIDDLE EAST AND, INDEED, THE WORLD!”</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">US officials accuse iran negotiators of playing games</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This is the second series of US strikes on Iran since Trump returned to the White House last year. The first was in June when Washington struck Iranian nuclear sites. Despite talks in recent weeks between Iran and the US, including a meeting on Thursday, senior Trump administration officials told reporters on Saturday the president saw both immediate and long-term reasons to green-light the latest strikes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">One senior US official said the Iranians were not willing to give up their nuclear program, and that “it was very clear that the intent for them was to preserve their ability to do enrichment, so that over time, they could use it for nuclear bombs.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This official said the Iranians used “games, tricks, stall tactics” to string out talks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Another senior US official said Iran’s missile programme posed a more immediate threat, and the US had “indicators” Iran intended to use this capability against American forces “potentially, preemptively,” or “simultaneous” to military operations against the Iranians.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We had analysis that basically told us, if we sat back and waited to get hit first, the amount of casualties and damage would be substantially higher than if we acted in a preemptive defensive way,” the senior administration official said without sharing specific details.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In his original Saturday announcement video, Trump encouraged regime change, telling the members of the Islamic Revolutionary Guard Corps, Iran’s elite armed forces, to lay down their weapons, promising they would be granted immunity.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The other option, according to Trump, is “certain death.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Iranian people should “take over” governance of their country, Trump said in the video.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It will be yours to take,” he said. “This will be probably your only chance for generations.”</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Some lawmakers look for more answers</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Photos released by the White House from Mar-a-Lago show Trump wearing a white “USA” hat as he worked with his national security team near a large map of the Middle East dotted with American and Iranian flags.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Mar-a-Lago’s gold-leaf decor is nowhere to be seen in the handout photos, as the president, CIA Director John Ratcliffe, Secretary of State Marco Rubio, chairman of the Joint Chiefs of Staff General Dan Caine, and White House Chief of Staff Susie Wiles work in a space surrounded by long black curtains hanging from wood rafters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Other Cabinet officials joined from Washington, with one handout photo showing vice-president JD Vance in the White House’s Situation Room.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Trump administration said Rubio spoke this week with top congressional leaders in both parties leading up to the strike.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Everything I have heard from the administration before and after these strikes on Iran confirms this is a war of choice with no strategic endgame,” said Representative Jim Himes of Connecticut, the top Democrat on the House of Representatives’ Intelligence Committee.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">House Minority Leader Hakeem Jeffries said the administration must seek congressional authorisation for the preemptive use of military force that constitutes an act of war.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Rubio told the leaders during a briefing at the White House on Tuesday that the operation would likely move forward even as diplomatic efforts continued, two sources familiar with the matter said. The secretary of state on Friday informed the top lawmakers that the operation to attack Iran was likely to commence in the following hours, but said Trump could change his mind, the sources said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Some European nations are urging a return to negotiations, but most of Trump’s fellow Republicans in Congress – and a few Democrats such as Senator John Fetterman of Pennsylvania – cheered Saturday’s strikes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Senator Lindsey Graham, a South Carolina Republican and frequent advocate for an aggressive US foreign policy, criticised European calls for further talks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To our European allies: you have gone pathetically soft and lost your zeal for confronting evil apparently unless it’s on your front porch,” Graham said in a social media post. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/trump-cheers-death-iranian-supreme-leader-ayatollah-ali-khamenei-says-strikes-will-continue",
            "pub_date": "2026-03-01 09:20:38",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Restaurants emerge as bright spot for US job growth as consumers seek treats",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[NEW YORK] On paper, American consumers spent last year tightening their belts, and even retail heavyweights stumbled. But sit-down restaurants and some drive-through chains buzzed with patrons seeking a special treat or cheap comfort food.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Their upbeat sales made the US restaurant industry a rare bright spot for jobs, with restaurant payrolls ticking up 1 per cent last year, adding about 108,000 jobs, according to the Bureau of Labor Statistics.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In contrast, the overall US economy added 181,000 non-farm jobs in 2025, marking the weakest annual payroll growth in 20 years outside a recession year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Success among restaurants was not evenly spread, though.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Corporate filings show that eateries such as Brinker’s Chili’s, Yum Brands’ Taco Bell and fast-growing coffee chain Dutch Bros lured customers by aggressively marketing bundled deals, leaning into digital innovation and limited-time offers, and focusing on high-margin, Instagrammable food.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But previous darlings like Chipotle and Cava were hurt by what analysts call the “slop-bowl fatigue” – growing weariness among younger consumers with high-priced, customizable grain or salad bowls.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Tempe, Arizona-based Dutch Bros and its franchisees added roughly 8,000 employees in the last two years, a 33 per cent increase, the company said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We have a healthy pipeline of growth,” CEO Christine Barone told Reuters after the company’s earnings in February. The brand, which serves customisable beverages, is a hit with younger consumers, Barone said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A similar story is playing out at another chain that, like Dutch Bros, sells more treats than meals.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ice cream chain Whit’s Frozen Custard has grown its payroll by up to 40 per cent a year for the past two years, said owner bill Aseere, to keep up with rapid growth. It now has stores in 93 locations across 10 states and some 15 to 20 employees per store. Amanda Wang, co-founder of fast-growing Chinese beverage chain Ningji Lemon Tea – part of a tidal wave of Chinese tea brands coming to the US – said her chain’s new restaurants in the US were buoyed by demand among price-weary consumers for affordable indulgences.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Tea “offers that little bit of happiness,” she said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As a whole, the restaurant industry grew payrolls even as it weathers depressed traffic and rising labour costs, analysts say, thanks in part to menu price increases. Menu prices at restaurants grew 4.1 per cent in 2025 compared to grocery inflation of 2.3 per cent, according to the Federal Reserve Bank of St Louis.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Diverging fortunes</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A deeper look at 2025 payroll data shows the difference in fortunes between types of restaurants: staff headcount at snack and non-alcoholic beverage restaurants grew 3.6 per cent in 2025 and those at sit-down restaurants rose 1 per cent. But fast-food payrolls grew only 0.4 per cent, while cafeterias and buffet payrolls shrank 3.9 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“At the end of the day, people want go out to eat and celebrate those big occasions,” said Chad Moutray, an economist at the National Restaurant Association, referring to resilient spending at sit-down restaurants.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Consumers might be pulling back from vacations, but they still prioritize eating out.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The payroll data and Moutray’s comments underscore what the industry calls the “lipstick effect” – consumers tightened their budgets, canceling expensive trips and postponing big-ticket purchases, but treated themselves to an indulgent meal, coffee or dessert.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Brinker’s reported 23 per cent growth in its hourly restaurant staff between fiscal years 2024 and 2025, according to SEC filings, though it indicated that a growing share of its employees were part-time.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Darden, the parent company of sit-down restaurants like Olive Garden and LongHorn Steakhouse, increased staff for fiscal 2025 by about 3.8 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Most national restaurant chains are franchised and do not report total employment figures among franchisees, but Chipotle and Starbucks, which operate the majority of their own stores, reported slight declines in total headcount for fiscal year 2025. While cascades of tariff announcements have forced other industries to raise prices and reroute sourcing, restaurant owners have only faced the tariffs impacting narrow categories like cup packaging and Chinese Sichuan peppers. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/restaurants-emerge-bright-spot-us-job-growth-consumers-seek-treats",
            "pub_date": "2026-03-01 09:00:42",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Israel-US attack on Iran will affect energy prices, impact countries far away like Singapore: SM Lee",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SINGAPORE - The  attack on Iran by Israel and the United States  will impact energy prices and affect countries far from the conflict, like Singapore, said Senior Minister Lee Hsien Loong.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Speaking at a Chinese New Year dinner at Teck Ghee Community Club on Feb 28<em>, </em>SM Lee said the attack contributes to an uncertain global climate which will in turn affect trade and investment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He noted that tensions between the United States and Iran have been building for weeks, and that America had assembled a huge military force in the Middle East, including aircraft carriers, destroyers, missile defences and attack weapons.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Today, Israel and the US together attacked Iran jointly,” SM Lee said. “The war has begun. Iran has struck back - cities, targets across the Middle East, Israel itself, Doha, Kuwait, Bahrain, the UAE.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Noting the potential impact of the war, he said: “You can see when the war will start. It is very hard to tell how the war will end.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SM Lee said that in an uncertain world, Singapore cannot take its good economic performance in the previous year for granted.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He noted it had done better than expected with a GDP growth of 5 per cent, and an increase in wages and lower inflation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">And while he hoped Singapore will continue to do well in 2026, it is unclear what new surprises are in store.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The attack on Feb 28 follows a 12-day air war in June 2025 between Israel and Iran and repeated US-Israeli warnings that they would strike again if Iran pressed ahead with its nuclear and ballistic missile programmes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">During that time, the US had also struck three Iranian nuclear sites, with the attack producing conflicting reports over the extent of damage done to Iran’s nuclear capabilities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On the global economic front, SM Lee highlighted President Trump’s new global tariffs that came as a response to the Supreme Court ruling on Feb 20 that most of the duties imposed by the US Administration in 2025 were illegal.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SM Lee said while the US administration had responded to the ruling by immediately invoking another law to impose a flat 10 per cent tariff on all countries, President Trump changed his mind within a day, and raised it to 15 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SM Lee said: “We watched with concern. But so far, the official US tariff rate is still 10 per cent. So we are relieved, but I think we have to watch very carefully.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The overall climate of uncertainty created by these dramatic twists and turns will dampen the global climate for trade and investment, and for cooperation and prosperity, he added.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He said: “Because businesses and companies will find it impossible to plan for what will happen tomorrow, what they can rely on, where they can safely invest, what they should do in order to make sure that the company will be okay day after tomorrow.”\n\n“And this is going to affect us too, as a small and open economy reliant on global trade and investments.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He said<em><strong> </strong></em>under such conditions, the Government will do its part to help Singaporeans but also urged them to upgrade themselves with new skills.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SM Lee said Prime Minister Lawrence Wong on Feb 12 had unveiled Budget 2026 with help for businesses, workers, the elderly and vulnerable, and households to cope with cost-of-living concerns.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SM Lee highlighted schemes including the Cost-of-Living Special Payment of between $200 and $400 for all adult Singaporeans, $500 in CDC vouchers for every household next January, and more generous U-Save rebates to help with utilities expenses.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He said: “Most households will receive some form of financial help almost every month – whether its U-Save or S&amp;CC rebates, whether its CPF top-ups, LifeSG credits, CDC Vouchers, or cash.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SM Lee also noted how the Government was investing in strengthening the economy, especially to encourage and support Singaporean workers in learning how to use Artificial Intelligence (AI).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The new moves announced by PM Wong included the expansion of the Enterprise Innovation Scheme to support businesses in their adoption of AI and free subscription to AI tools for Singaporeans taking up selected AI training courses.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SM Lee urged Singaporeans to play their part, too, to continue to learn new skills like AI.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He said: “Our companies have to upgrade themselves, reinvent and transform their businesses to stay competitive.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“And I hope everyone makes full use of the support you are getting through our various programmes, and work together to take advantage of these opportunities and overcome the challenges ahead of us to build a brighter future for ourselves.”</p></div>",
            "link": "https://www.businesstimes.com.sg/singapore/israel-us-attack-iran-will-affect-energy-prices-impact-countries-far-away-singapore-sm-lee",
            "pub_date": "2026-02-28 21:40:36",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        }
    ]
}