{
    "data": [
        {
            "title": "OUE loss widens to S$314.7 million in H2 FY2025",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] OUE reported a loss of S$314.7 million in H2 FY2025, 65 per cent more than the S$190.7 million in red ink in the preceding financial year.   </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The real estate and healthcare group on Friday (Feb 27) reported a drop in half-year revenue to S$324.3 million from S$332 million the year prior. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It attributed the drop to a lower contribution from the real estate segment, from the absence of Lippo Plaza Shanghai’s contribution following its divestment in December 2024. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The board proposed a dividend of S$0.01 a share; together with the interim dividend of S$0.01 a share, the total cash dividend for the year would be S$0.02 per share, subject to shareholders’ approval.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Factoring in the S$35.6 million in profit booked in H1, FY2025 losses came in at S$279.1 million, narrower by 2.7 per cent from the S$286.8 million loss in FY2024. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This came mainly from the absence of a fair-value loss recognised for Lippo Plaza Shanghai from its divestment, and lower finance expenses. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This was partially offset by a higher share of losses from its associated company, Gemdale Properties and Investment Corporation (GPI), and a S$20 million impairment loss on its investment in GPI.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for the full year fell 4.6 per cent to S$617.0 million, from S$646.5 million in FY2024. This was the result of lower contributions from the real estate segment, including the absence of contributions from the divested Lippo Plaza Shanghai, though this was partially offset by higher contributions from the commercial portfolio in Singapore.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As a result, the group’s investment properties and fund management division recorded a 7.4 per cent decline in FY2025 revenue to S$192.2 million, from S$207.5 million in FY2024. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue from the hospitality division was 4.4 per cent lower in FY2025 at S$220 million, from S$230.2 million in FY2024. This was due to a higher base from the previous year’s surge in concert-driven tourism and the commencement of the visa-free arrangement between Singapore and China.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The FY2025 revenue for the healthcare segment grew 0.3 per cent to S$152.7 million from S$152.2 million in FY2024, on the back of a stronger performance from specialist clinics in Singapore and contributions from its newly acquired cardiopulmonary physiotherapy business. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, this was partially offset by depreciation of the rupiah and the yen against the Singapore dollar, and the absence of contribution from the closure of a pharmaceutical distribution business in China.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue from the company’s “others” segment for FY2025 – primarily contributions from its food and beverage operations – came in at S$52.0 million, up 9.8 per cent from the S$47.4 million in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This  increase was mainly driven by contributions from newly opened dining outlets and the full-year contribution from the dining concepts launched in 2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In late December 2025, the group strengthened its healthcare portfolio with the acquisition of an additional 19.32 per cent stake in OUE Healthcare, increasing its total interest to 89.68 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In a bourse filing, OUE said that the global and domestic economic environment remains challenging against the backdrop of heightened trade tensions and policy uncertainty.<strong> </strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its portfolio, comprising commercial properties, hospitality and retail assets, as well as its healthcare segment, are expected to provide a stable performance in 2026. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of OUE closed down S$0.02 or 1.7 per cent down at S$1.17 on Friday.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/oue-loss-widens-s314-7-million-h2-fy2025",
            "pub_date": "2026-02-27 23:41:28",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Straits Trading H2 loss widens to S$208.4 million; dividend of S$0.08 a share proposed",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] The Straits Trading Company’s net loss widened to S$208.5 million for its second half ended Dec 31, 2025, from S$12.5 million a year earlier, as it recorded a one-off charge and a net fair-value loss on investment properties.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue increased by 14 per cent year on year to S$355.8 million, the group’s financial results filed on Friday (Feb 27) showed.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Net fair-value changes in investment properties came in at minus S$43.9 million, compared with a gain of S$7.7 million in H2 FY2024. The group attributed this primarily to fair-value losses from properties in China, South Korea and Australia.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The resources segment had a better showing in H2 FY2025, which the group said was mainly due to higher average tin prices and the ringgit’s appreciation against the Singapore dollar.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The hospitality segment’s performance weakened, however, “primarily due to ongoing refurbishment works in its Australia-owned hotel (and) the absence of contribution from a hotel disposed of in December 2024”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Straits Trading’s real estate business reported a greater loss in H2 FY2025. This came on the back of a S$102.3 million loss that stemmed from the group losing joint control over a joint venture. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group explained that “the appointment of receivers and managers over (a) mortgaged property in December 2025” had led to the investment being derecognised as a joint venture.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Loss per share for H2 FY2025 stood at S$0.444, compared with S$0.028 for the corresponding period a year earlier.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Straits Trading’s board has proposed an interim dividend of S$0.08 a share payable on Jun 30, with the quantum unchanged from FY2024 and the option of payment in scrip available.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, the group’s loss widened to S$249.1 million from S$7.2 million a year earlier. Revenue, meanwhile, was 10.4 per cent higher year on year at S$623.3 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The weaker full-year performance was again attributed to the loss of joint control over the joint venture and net fair-value losses on investment properties.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Straits Trading noted that the losses are “non-cash in nature and do not impact the group’s operating cash flow”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Chew Gek Khim, executive chairman of Straits Trading, said FY2025 “represents a watershed year” for the group, “marked by a disciplined reassessment of our portfolio and a continued focus on prudent capital recycling amid a challenging operating environment”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Straits Trading said it will “continue to adopt a prudent and disciplined approach to capital management”. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The group will remain focused on maintaining financial resilience, preserving liquidity and prioritising investments that generate long-term sustainable value for its stakeholders,” it added.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Straits Trading rose 1.2 per cent or S$0.02 to close at S$1.75 on Friday, before the news.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/straits-tradings-h2-fy2025-loss-widens-s208-4-million-proposes-dividend-s0-08",
            "pub_date": "2026-02-27 23:41:28",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Land betterment charges upped 4.1% on average for non-landed residential, 4% for landed residential uses",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] In tandem with the uplift in sentiment in Singapore’s transaction market, the government has raised average land betterment charge (LBC) rates across most real estate sectors in its latest half-yearly update.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Only rates for the hotel/hospital/nursing home use group were left unchanged.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Announced on Friday (Feb 27), the latest rates are for the six months starting on Mar 1. LBC rates were increased for residential, commercial, industrial and place of worship/civic and community institution uses. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Developers pay an LBC for the right to enhance the use of some sites or to build bigger projects on them. The rates are stated according to use groups across 118 geographical sectors in Singapore.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">LBC rates for non-landed residential use have been raised by 4.1 per cent on average. LBC rates in 114 sectors have been raised by around 3 to 23 per cent. There are no changes in the other four sectors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For landed residential use, LBC rates have risen by 4 per cent on average. Rates have been upped for 93 sectors by around 3 to 10 per cent, with no changes in the other 25 sectors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">LBC rates for industrial use have been raised by 3.2 per cent on average. All 118 sectors saw increases ranging from around 2 to 9 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">LBC rates for commercial use have gone up by 0.5 per cent on average. Twenty of the 118 geographical sectors will see increases of around 3 to 4 per cent, with no change for the remaining 98 sectors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the place of worship/civic and community institution use group, LBC rates have increased by 3 per cent on average across all 118 sectors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Commenting on the broad-based increases in LBC rates, JLL’s head of research and consultancy for South-east Asia Chua Yang Liang said: “Persistent strong results at government land sales (GLS) tenders would have motivated the chief valuer (CV) to adjust the LBC rates accordingly.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Some of the adjustments were also motivated by the residual gap between recent market transactions and the implied land value based on Sep 1, 2025, LBC  rates for that use group and location.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">LBC rates are announced twice a year, on Mar 1 and Sep 1, following a review by the Singapore Land Authority in consultation with the taxman’s CV.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For non-landed residential use, the biggest LBC rate hike of 22.7 per cent was in Sector 97 which includes the Bedok South area. JLL’s analysis showed that the S$1,330 per square foot per plot ratio (psf ppr) top bid for the Bedok Rise GLS site in November 2025 was about 36 per cent above the implied land value based on the Sep 1, 2025, LBC rate for non-landed residential use in the sector.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Also in November, a GLS tender for a site next to Newton MRT interchange station fetched a top bid of nearly S$1,820 psf ppr. This was 16 per cent above the implied land value based on the Sep 1, 2025, LBC rate for non-landed residential use in that location, which is in Sector 37, where the LBC rate is being raised by 10.2 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Huttons Asia chief executive officer Mark Yip noted that the 4.1 per cent rise on average for non-landed residential use LBC rates is the biggest increase since September 2022. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He added: “The strong take-up at private residential project launches in 2025 renewed the need among developers to replenish their land banks. As well, reduced borrowing costs for developers boosted their ability to pay more for GLS sites amid the increased competition.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On industrial LBC rates being raised across all 118 sectors by about 2 to 9 per cent, Wong Shanting, research head for Singapore at Newmark, noted: “This broad-based uplift reflects an active industrial market, underpinned by several high-value transactions that have driven land costs higher.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">An example would be 680 Upper Thomson Road, which was sold in October 2025 for about S$665 psf ppr. Based on JLL’s analysis, this was a 190 per cent premium to the land value implied by the Sep 1, 2025, industrial LBC rate for the area, which is in Sector 107; the LBC rate for the sector has been raised by 9.3 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Summing up, Dr Chua of JLL said: “The refreshed LBC rates should not have any significant drag on the market trend or dampen developers’ and investors’ longer-term confidence in the underlying property market.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, CBRE’s research head for Singapore and South-east Asia Tricia Song pointed out: “The increase in residential LBC rates could further increase acquisition costs for developers, and dampen an already-weak collective sale market.”</p></div>",
            "link": "https://www.businesstimes.com.sg/property/land-betterment-charges-upped-4-1-average-non-landed-residential-4-landed-residential-uses",
            "pub_date": "2026-02-27 23:16:24",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lululemon founder Chip Wilson ramps up pressure on board amid proxy fight",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[VANCOUVER] Lululemon Athletica founder Chip Wilson stepped up his campaign for board and governance changes at the struggling athletic apparel maker on Friday (Feb 27), including replacing more than three directors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The move heightened tensions between the Canadian yoga wear maker and its founder, who has increasingly criticised the board’s strategic direction, its handling of CEO succession and what he describes as a lack of creative and marketing expertise at the top.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Wilson had launched a proxy fight at the end of last year by nominating three independent directors – Marc Maurer, Laura Gentile and Eric Hirshberg – to the company’s board, and called for annual board elections.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“While we have proposed changing three directors, our strong feeling is that more than three directors should be replaced,” Wilson said in a letter to shareholders.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Following director nominations in December, Wilson said the board engaged with them only earlier this week, and that its response was “weak and insufficient.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I have pursued private, constructive dialogues with the Lululemon board of directors for the past few months. My attempts towards a sensible solution have not been reciprocated,” he said on Friday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Wilson, one of the biggest independent shareholders of Lululemon with a 4.27 per cent stake, also said the board rejected his proposal to create a committee focused on brand, product and creative oversight.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lululemon did not immediately respond to a Reuters request for comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Wilson’s campaign comes as the company’s shares have lost nearly half of their value over the past 12 months, with the brand struggling to retain younger and affluent shoppers amid intense competition from fast-growing rivals such as Alo Yoga and Vuori.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lululemon is also operating without a permanent CEO after Calvin McDonald’s departure in December, and is facing pressure from activist investor Elliott Investment Management, which has built a stake of more than US$1  billion in the retailer. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/consumer-healthcare/lululemon-founder-chip-wilson-ramps-pressure-board-amid-proxy-fight",
            "pub_date": "2026-02-27 23:10:56",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI’s US$110 billion funding round draws investment from Amazon, Nvidia, SoftBank",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BENGALURU] OpenAI said on Friday (Feb 27) it is raising US$110 billion in a blockbuster funding round that would value the ChatGPT maker at US$840 billion, in a deal that signals the feverish pace of investment in artificial intelligence.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The funding round includes a US$30 billion investment from SoftBank, US$30 billion from Nvidia, and US$50 billion from Amazon, and comes ahead of the AI startup’s expected mega-IPO later this year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Big Tech companies and large tech investors such as SoftBank are racing to forge partnerships with OpenAI – which is spending heavily on data centres – betting that closer ties with the company would give them a competitive edge in the AI race.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Amazon will start with an initial US$15 billion investment, followed by another US$35 billion in the coming months when certain conditions are met.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Along with the investment, OpenAI and Amazon have also struck a deal in which OpenAI will utilise two gigawatts of computing capacity powered by Amazon’s in-house Trainium chips, the companies said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Amazon’s cloud computing platform, AWS, will also be the exclusive third-party cloud provider for OpenAI Frontier, the ChatGPT maker’s enterprise platform for building, deploying and managing AI agents.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The partnership does not change OpenAI’s existing relationship with Microsoft. Microsoft Azure still remains the exclusive cloud provider for OpenAI’s APIs that provide access to OpenAI’s models, the companies said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">OpenAI’s first party products will continue to be hosted on Azure, and Microsoft holds its exclusive licence and access to intellectual property across OpenAI models and products.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It was not immediately clear whether Nvidia’s US$30 billion investment replaced its earlier commitment announced in September under which Nvidia would invest up to US$100 billion in the startup.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">OpenAI and Nvidia did not immediately respond to Reuters’ requests for clarification. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/startups-tech/startups/openais-us110-billion-funding-round-draws-investment-amazon-nvidia-softbank",
            "pub_date": "2026-02-27 22:56:24",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indonesia hits the brakes on Prabowo’s mega order of Indian lorries",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[JAKARTA] Indonesia is halting an order for 105,000 lorries from India’s Tata Motors and Mahindra &amp; Mahindra following a pushback from policymakers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Imports of the vehicles, a mix of 4x4s and six-wheeler lorries , will be put on hold pending a meeting between the government and lawmakers, Cooperatives Minister Ferry Juliantono said on Thursday (Feb 26).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">They were slated for use in President Prabowo Subianto’s drive to establish more than 80,000 community cooperatives across the archipelago nation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Pausing is “the right step to avoid further controversy”, Juliantono said. “And when the time comes, we will be able to sit down together to find the best solution.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The proposed imports have touched a nerve in Jakarta at a time when other foreign automakers with a large Indonesian manufacturing presence – such as Toyota – are struggling to regain their pre-pandemic footing in South-east Asia’s largest economy. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Car sales fell 7.2 per cent in 2025 to 803,687 units, data compiled by Bloomberg revealed. Weak household spending and cautious lending have weighed on demand.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Juliantono said Prabowo had ordered lorries as part of his plan to serve thousands of cooperatives – village-level hubs envisaged as bases for basic goods such as cold storage and subsidised fertiliser. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The cooperatives could also provide loan services, letting the government bypass chains of regional administration to directly reach millions of rural residents.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Mumbai-based Mahindra said earlier in February the deal would have been its biggest export orders. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It was set to deliver 35,000 Scorpio Pik Ups this year to “enable village-level commerce” and support Indonesia’s “national food-security transformation”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">An Indonesian unit of Tata Motors said its order of some 35,000 Yodha pick-ups and 35,000 Ultra T.7 lorries was the company’s largest into Indonesia.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Representatives for Mahindra and Tata Motors did not immediately respond to requests for a comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But Indonesian business associations have pushed back against the truck-import plan, saying it flies in the face of the government’s goals to encourage industrialisation and create jobs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The industry ministry earlier in February noted that Indonesia’s automotive industry has the ability to produce around one million pick-up trucks a year. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Alongside Toyota, other foreign automakers with a manufacturing presence in the country include Suzuki Motor and Mitsubishi Motors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Industry Minister Agus Gumiwang Kartasasmita said that if around 70,000 pick-up lorries were instead made and assembled domestically, the benefit to the Indonesian economy would be about 27 trillion rupiah (S$2 billion) and the creation of jobs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earlier this week, Sufmi Dasco Ahmad, the parliament deputy speaker and a high-ranking member of Prabowo’s Gerindra Party, also called for a halt to the imports until the president returns from overseas travel. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Prabowo returned early on Friday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Indonesian procuring body was to be Agrinas Pangan Nusantara, a recently established, state-owned company tasked with boosting food self-sufficiency, including by supporting large-scale agricultural projects. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/indonesia-hits-brakes-prabowos-mega-order-indian-lorries",
            "pub_date": "2026-02-27 22:51:31",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swatch slams Morgan Stanley over report on losing market share",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[ZURICH] Swatch Group took aim at Morgan Stanley after the US investment firm said in a research report the Swiss watchmaker was losing market share and that its Longines brand became unprofitable last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The figures and statements in the research are based on unsuitable and not transparent data sources,” Swatch said in an open letter to Morgan Stanley Investment Management published on its website on Friday (Feb 27). “As far as our brands are concerned, the figures in the research are highly inaccurate.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Feb 18 report, compiled with industry adviser LuxeConsult, said Swatch Group’s market share has shrunk 10 percentage points since 2019 and had the industry’s biggest drop in 2025. It described Longines as Swatch’s “main problem child,” citing high management turnover and reliance on China.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Among its numerous criticisms of the report, Swatch – which does not give a detailed breakdown of its brands’ performances – countered that Longines reported “a profit of 16.6 per cent on net sales” in 2025. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oliver Mueller, head of Switzerland’s LuxeConsult, and Morgan Stanley had no immediate comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Swatch’s operating profit margin tumbled by more than half to 2.1 per cent in 2025, it reported last month, as the company grappled with weak demand in China and the fallout from President Donald Trump’s tariffs in the US. The watchmaker’s policy of maintaining jobs, production and inventory to be ready for an upturn has also faced criticism from investors for keeping costs high.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Swatch have rebounded more than 20 per cent since the company gave a more optimistic outlook for the current fiscal year, though they are still well below their level in the post-pandemic boom that lifted luxury brands.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">They fell as much as 3.1 per cent on Friday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the report, Morgan Stanley also said revenue for Swatch’s Omega brand had stagnated at around 2.2 billion Swiss francs (S$3.6 billion) for more than a decade, and was overtaken by Patek Philippe and Audemars Piguet last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Swatch described the report’s conclusions and the rankings of watch brands as “questionable.” It also said that unlike Morgan Stanley, LuxeConsult did not disclose potential conflicts of interest. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Occasionally, the research even produces defamatory and potentially damaging statements,” Swatch said, adding “legal action should be considered.” BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/swatch-slams-morgan-stanley-over-report-losing-market-share",
            "pub_date": "2026-02-27 22:15:46",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US producer prices increase more than expected in January",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[WASHINGTON] US producer prices increased more than expected in January, likely as businesses passed on higher costs from import tariffs, suggesting inflation could pick up in the months ahead.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Producer Price Index (PPI) for final demand rose 0.5 per cent last month after advancing by a downwardly revised 0.4 per cent in December, the Labor Department’s Bureau of Labor Statistics said on Friday (Feb 27). Economists polled by Reuters had forecast the PPI gaining 0.3 per cent after a previously reported 0.5 per cent increase in December.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A 0.8 per cent jump in services accounted for the rise in the PPI. That reflected a 2.5 per cent increase in trade services, which measure changes in margins received by wholesalers and retailers. There was a 14.4 per cent surge in margins for professional and commercial equipment wholesaling, suggesting businesses were passing on tariffs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Prices also increased for apparel, footwear and accessories retailing, as well as chemicals and allied products wholesaling, bundled wired telecommunications access services, health, beauty and optical goods retailing, and food and alcohol retailing.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the 12 months through January, the PPI increased 2.9 per cent after rising 3.0 per cent in December. The moderation in the year-on-year producer inflation rate reflected last year’s high readings dropping out of the calculation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The report was delayed by the brief shutdown of the federal government early this month</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Producer goods prices fell 0.3 per cent, with the cost of energy declining 2.7 per cent and food decreasing 1.5 per cent. Excluding food and energy, goods prices soared 0.7 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Some of the components in the PPI report go into the calculation of the Personal Consumption Expenditures (PCE) Price Indexes, the inflation measures tracked by the Federal Reserve for its 2 per cent target.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Prior to the PPI data, economists estimated that core PCE inflation increased by as much as 0.5 per cent in January, which would translate to a year-on-year advance of 3.1 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Core PCE inflation rose 0.4 per cent in December and increased 3.0 per cent year-on-year. The government will publish the delayed PCE inflation report on March 13. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/us-producer-prices-increase-more-expected-january",
            "pub_date": "2026-02-27 22:15:46",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HSBC opens wealth centre at Singapore Land Tower amid premium pivot",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] HSBC on Friday (Feb 27) announced the opening of its fourth and largest wealth centre in Singapore on the 33rd floor of the Singapore Land Tower.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This comes as the bank is set to close its Raffles Place retail branch on Saturday, a move announced in January as it pivots towards affluent clients in one of Asia’s most important financial hubs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The new facility has 14 meeting rooms, as well as a family room that the bank said will offer “privacy for complex and multi-generational wealth discussions”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ashmita Acharya, HSBC’s head of international wealth and premier banking in Singapore, said the city-state is “a priority market and a wealth hub” for the bank.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The new wealth centre spans 7,884 square feet and is designed to “deliver a personalised and premium banking experience”. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">HSBC said Premier and Premier Elite clients will have “exclusive spaces” in the facility.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Premier Elite caters to “affluent clients with a minimum total relationship balance of S$1.2 million”. Such clients will have access to “bespoke creations” from celebrity chef Janice Wong, among other privileges.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The bank said that the new wealth centre is a part of its “ongoing multi-year transformation journey, which includes a fivefold investment towards increasing its physical network in Singapore”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">HSBC’s announcement follows media reports earlier in the week claiming that the bank has <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/companies-markets/banking-finance/hsbc-kicks-singapore-insurance-business-sale-eyes-over-us1-billion-value-sources\" target=\"_blank\">kicked off the sales process</a> for its Singapore insurance business.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/banking-finance/hsbc-opens-wealth-centre-singapore-land-tower-amid-premium-pivot",
            "pub_date": "2026-02-27 22:15:47",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ST Engineering hit by S$689 million impairment as H2 net profit falls 83.6%; defence growth seen underpinning 2026",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] ST Engineering recognised S$689 million in one-off impairment losses in its 2025 financial year, tied largely to its satellite communications (satcom) unit, iDirect. This weighed down its second-half net profit.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But group president and chief executive officer Vincent Chong noted on Friday (Feb 27) at ST Engineering’s full-year results briefing that activity is picking up in 2026, with more orders secured and cost cuts under way as the company focuses on turning the business around.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Our priority remains supporting customers, executing the turnaround, and evaluating the strategic path forward for the satcom business,” he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Even as it evaluates “strategic actions” for the business, ST Engineering has implemented S$43 million in annualised cost savings for the satcom unit. It has more plans to bring these savings up to S$63 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For satcom, the group is targeting H1 revenue that is stronger year on year (yoy), following its dive in net profit for H2 FY2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The urban solutions and satcom segment sank into the red with a S$567.7 million loss in H2, reversing from earnings of S$31.1 million in the year-ago period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, the segment’s H2 revenue rose 6 per cent yoy to S$1.1 billion, from S$1 billion the previous year. Urban solutions drove the improvement, which was partially offset by lower satcom contributions.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">ST Engineering reported a net profit of S$59.9 million for H2 FY2025, an 83.6 per cent decline from S$365.7 million in the previous corresponding period. Its operating profit for H2, however, stood at S$448 million, an increase of 22.5 per cent from S$365.7 million the year before.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group’s revenue came in at S$6.4 billion for the half-year, up from S$5.8 billion in H2 FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for FY2025 stood at S$0.1484. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Growth driven by defence and aerospace</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As the group irons out its urban solutions and satcom business, its other two segments – commercial aerospace, and defence and public security – posted higher profits in FY2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">ST Engineering’s commercial aerospace profits for H2 rose to S$319 million, from S$210.5 million in the year-ago period. The segment’s revenue increased 23 per cent to S$2.6 billion, from S$2.2 billion the previous year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This growth was contributed by stronger sales from engines, MRO (maintenance, repair and operations) and nacelles,” said Cedric Foo, group chief financial officer of ST Engineering.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The defence and public security segment reported S$551.4 million in H2 earnings, up from S$311.9 the previous year. Its revenue stood at S$2.7 billion, rising 5 per cent on the year from S$2.6 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the full year, commercial aerospace accounted for 40 per cent of the group’s revenue, and defence and public security made up 43 per cent. The urban solutions and satcom segment contributed 16 per cent of the revenue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Overall, ST Engineering’s revenue stood at S$12.3 billion for FY2025, up 9.5 per cent from S$11.3 billion in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Full-year net profit fell 34.1 per cent yoy to S$462.8 million, from S$702.3 million. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nonetheless, the group’s fiscal outlook remains positive. It cited contract wins, a strong order book and a structural shift in global defence spending.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at Dec 31, 2025, its order book stood at S$33.2 billion, of which S$9.9 billion is expected to be delivered this year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Our record order book is a clear leading indicator of revenue growth in the years ahead,” said Chong.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Mervyn Tan, group chief operating officer for technology and innovation, as well as president of defence and public security, said: “We continue to stick to our assessment that the increase that we see in the investment in defence for various countries (appears) to be a structural shift.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group proposed a final dividend of S$0.06 per ordinary share and a special dividend of S$0.05 a share.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In total, the dividend for FY2025 is S$0.23 per ordinary share, translating to a dividend yield of 3.52 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of <!-- --> <!-- -->ST Engineering<!-- --> <!-- --> ended Friday 0.5 per cent or S$0.05 lower at S$9.97, after the results were released.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/st-engineering-hit-s689-million-impairment-h2-net-profit-falls-83-6-defence-growth-seen-underpinning",
            "pub_date": "2026-02-27 22:05:33",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        }
    ]
}