{
    "data": [
        {
            "title": "CDL H2 net profit up over four times at S$538.5 million on improved showings across all segments",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] <!-- --> <!-- -->City Developments Ltd’s (CDL)<!-- --> <!-- --> second-half earnings rose more than four times to S$538.5 million, from S$113.5 million in the previous corresponding period.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This more than trebled the group’s full-year earnings to S$629.7 million in the 2025 financial year, from S$201.3 million in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The improvements were primarily driven by robust residential sales in Singapore and strong capital recycling gains, notably, from the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/property/cdl-selling-its-50-1-south-beach-stake-its-malaysian-partner-ioi-s834-million-yielding-s465-million\" target=\"_blank\">sale of a 50.1 per cent stake in the South Beach mixed-use development</a> in H2 to Malaysian partner IOI Properties Group, said CDL on Friday (Feb 27). The S$834 million transaction yielded a S$465 million gain.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sherman Kwek, CDL’s group chief executive officer, said that strong residential sales in Singapore and accelerated capital recycling drove a “significant uplift” to the group’s earnings, despite the company facing a “challenging environment with ongoing economic uncertainties” in 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To maximise shareholder returns, we are actively reviewing our growth strategy, portfolio structures and capital allocation priorities,” Kwek said. “We have taken decisive steps to unlock value from mature and non-core assets, while selectively redeploying capital to drive growth.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In early 2025, Kwek was embroiled in a public feud with his father and CDL executive chairman Kwek Leng Beng, but the matter was settled subsequently.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For H2, CDL posted an earnings per share (EPS) of S$0.598, versus S$0.121 in the year-ago period. EPS for the full year rose to S$0.694, from S$0.213 in the previous financial year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for H2 stood at S$1.9 billion, up 11.1 per cent on the year from S$1.7 billion. Full-year revenue grew 9.7 per cent to S$3.6 billion from S$3.3 billion.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Better results across all segments</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CDL said that all its business segments reported improvements for H2 and FY2025, with the property development segment being the biggest contributor to revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, that segment’s revenue rose 24.1 per cent on the year to S$1.2 billion, supported by higher contributions from Singapore projects such as The Myst, Norwood Grand and Union Square Residences. The sales of the Ransome’s Wharf site in London and the office component of Suzhou Hong Leong City Center in China also boosted revenue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Notably, the hotel operations segment saw a 1.7 per cent increase in revenue and improvements in revenue per available room, said CDL. This was supported by new additions including The Mayfair Hotel Christchurch, acquired in January 2025, and the Hilton Paris Opera, acquired in May 2024. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group noted that the increase in gross profits for H2 and FY2025 was marginal, despite its revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its overall gross profit margin fell to 41 per cent for H2 and FY2025, from 45 per cent for both periods in 2024, as it was impacted by an S$80.5 million allowance for foreseeable losses that was made in relation to China development properties.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at Dec 31, CDL maintained strong cash reserves of S$2.1 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The board proposed a final dividend of S$0.25 per share, payable on May 19, after the record date on May 4. Together with the special interim dividend of S$0.03 per share paid in September 2025, the total ordinary dividend for FY2025 amounts to S$0.28 per share, representing a 40 per cent dividend payout ratio. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of CDL ended 4.9 per cent or S$0.46 higher at S$9.82 on Friday.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/cdl-h2-net-profit-over-four-times-s538-5-million-improved-showings-across-all-segments",
            "pub_date": "2026-02-27 19:40:45",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UMS Q4 FY2025 earnings flat at S$11.1 million; declares dividend of S$0.02",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] UMS Integration reported a flat earnings of S$11.1 million for the fourth quarter ended Dec 31, 2025, as higher tax expenses offset improved gross material margins and lower personnel costs. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for the quarter eased 1 per cent to S$66.8 million, the company said in its financial results released on Friday (Feb 27). UMS Integration provides equipment manufacturing and engineering services to semiconductor original equipment manufacturers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for Q4 FY2025 were also flat, at S$0.0156.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A final dividend of S$0.02 per share for FY2025 was proposed, unchanged from the S$0.02 final dividend paid for FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Specifically, semiconductor segment sales were 1 per cent lower at S$56.8 million, due mainly to lower component sales.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sales in other segments, which includes the manufacture of water disinfection systems and metal distribution, surged 45 per cent. This was mainly due to revenue recognition of several completed projects under the group’s water treatment subsidiary, Kalf Engineering.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Geographically, all the group’s key markets, except Singapore and the US, posted higher revenue compared with the same period in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue from Taiwan soared 44 per cent due to the commencement of component sales to a new key customer’s location there, while revenue from Malaysia edged up 2 per cent to slightly above S$8 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sales in Singapore fell 2 per cent to S$42.4 million mainly due to lower overall semiconductor sales, while those in the US slumped 42 per cent to S$5.2 million on lower semiconductor and aerospace component sales.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, earnings rose 2 per cent to S$41.6 million from S$40.6 million in FY2024. Revenue for FY2025 grew 4 per cent to S$251.1 million from S$242.1 million in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for the full year stood at S$0.0585, up from S$0.0574 in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group also announced it has successfully renewed its Integrated System contract with an existing key customer for another three years as semiconductor demand accelerates.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group noted it has invested more than S$155 million in the last four years to expand manufacturing capabilities to prepare for an “expected production ramp-up.” Its new facilities are now operational and equipped with capabilities to capture new market opportunities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group is currently working on many new product introductions from its new key customer to expand its product offerings in line with upbeat forecasts in the coming months.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Andy Luong, chief executive of UMS, said: “Both our key global customers have forecast robust demand growth for 2026 and 2027. With the acceleration of AI (artificial intelligence) applications, they are ramping execution velocity to drive multi-year outperformance targets.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of UMS closed up 5.1 per cent or S$0.07 to S$1.45 on Friday.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/ums-q4-fy2025-earnings-flat-s11-1-million-declares-dividend-s0-02",
            "pub_date": "2026-02-27 19:25:48",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "This Singapore deep-tech startup believes its paper batteries are an important part of the global clean energy transition",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Sustainable alternatives are often more expensive or come with compromises in terms of functionality, but one Singapore company is trying to buck the trend with a unique product – paper batteries. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Deep-tech startup Flint produces batteries made of cellulose – the key ingredient in paper production, hence their name – that are priced competitively with their lithium-based counterparts. Their performance is also comparable.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">These paper batteries can be used in devices such as keyboards, computer mice and wearables. The carbon footprint for manufacturing each one is around 30 per cent smaller than that for a conventional battery.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Paper batteries are also safer as they are fire-resistant; conventional batteries are made from flammable and reactive materials. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As Flint’s batteries are composed of cellulose, manganese and zinc, their production does not depend on the supply chains for the scarce resources used to manufacture conventional batteries, such as lithium and cobalt. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This allows the process to be decentralised from places where batteries are typically produced – an especially critical feature when the global battery supply chain has turned into a flashpoint for trade tensions. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Therefore, even a small country lacking natural resources such as Singapore can manufacture paper batteries, said Flint co-founder Carlo Charles. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With companies looking to move their supply chains out of China, he noted that geopolitical developments have boosted demand for Flint’s products. A large proportion of its clients, from sectors such as tech and electronics, hail from Europe and North America.  </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Supporting the clean energy transition</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In January, Flint was among more than 30 Singapore companies that showcased their products at the Consumer Electronics Show in Las Vegas – a milestone for the startup. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Flint began in 2019 as a passion project, driven by Charles’ desire to create a more sustainable alternative to conventional batteries, which are key components in the world’s transition to green energy. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“One of the most important aspects for climate change is clean energy, and to… transition (the world) to green energy, you really need to use a lot of batteries,” he said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“(The fact that) the batteries that we’re using today are not green themselves is such an irony.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Flint was incorporated in 2021 and today counts household names such as Amazon and Logitech among its clients. It is run by a 10-strong team and operates from an 8,000-square-foot space at 8 CleanTech Loop. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company takes on projects to build batteries for specific applications based on customers’ requests, including energy storage systems, toys and consumer electronics such as mobile phones, tablets and laptops, Charles said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Within the next five years, Flint intends to scale its production and get its batteries into every device that requires them, the co-founder added, noting that it hopes to develop batteries for electric vehicles (EVs). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“EVs are like the holy grail that we want... but we are not focusing on that yet.” He said that EV battery production requires gigafactories that need considerable amounts of money, resources and capital to be built. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For now, manufacturing constraints present a barrier to scalability. “The harsh truth of building a hard-tech company (is that) it really boils down to production.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Flint makes batteries at its office and lab in Singapore, where around five million units can be produced each year. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Charles said that the startup is looking to build a facility in Europe that will expand its production to around 300 million batteries a year. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Profitability on the horizon </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With Flint expected to reach profitability this year, the goal is for the company to sustain its own growth, he said, although he is not closed off to funding. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He noted that Flint has completed its seed and pre-Series A rounds of fundraising, and now has sufficient funds to scale. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I guess the key reason is we don’t want to dilute ourselves too much. As a founder, I want to focus on what matters, (which is) the products and the innovation.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Going public is not off the table either, but the company has no plans for an initial public offering anytime soon, he added. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Plans beyond batteries  </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the longer term, his vision is for Flint to venture beyond batteries and tackle other environmental issues. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“In the next 10 years, our goal is to really focus on other problems that the world has, and to try to solve those... The main reason I started (this) was to combat climate change with technology, and batteries are really just the first step.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He said the areas the company could explore next are carbon capture and storage technology, or problems such as plastic pollution and ocean acidification. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“There’s a lot of things that we can focus on, but I guess I’m trying my best to not get diverted and lose focus. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I have a lot of ideas that I’m just keeping in my journal, but at the end of the day, I’m 100 per cent focused on Flint’s strategy for batteries today.” </p></div>",
            "link": "https://www.businesstimes.com.sg/singapore/singapore-deep-tech-startup-believes-its-paper-batteries-are-important-part-global-clean-energy",
            "pub_date": "2026-02-27 19:25:49",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jardine Cycle & Carriage H2 profit up 36%  at US$626.7 million; declares dividend of US$0.85",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Jardine Cycle &amp; Carriage (JC&amp;C) posted earnings of US$626.7 million for H2 FY2025, a 36 per cent increase from US$462.5 million the year prior. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company on Friday (Feb 27) reported a half-year revenue of US$10.6 billion, down 9 per cent from US$11.6 billion previously.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the full-year, revenue came in at US$21.4 billion, 4 per cent lower than US$22.3 billion in the previous corresponding period. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings rose 5 per cent to US$997.8 million from US$945.8 million in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">JC&amp;C attributed the increase in full-year profit to improvements in Vietnam and Singapore businesses, as well as foreign exchange gains and lower financing costs at the corporate level, which helped offset a lower contribution from its Indonesian operations.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Astra contributed US$927 million to the group’s underlying profit for the full year, 7 per cent lower than the previous year. This reflected the impact of a weaker Indonesian rupiah and “weaker performances” from its mining services, coal mining operations and new car sales, the group stated.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its direct motor interests through Tunas Ridean in Indonesia saw its contribution fall 46 per cent to US$18 million, mainly due to lower profits from consumer finance and automotive operations.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Contributions from the group’s Vietnam businesses rose 25 per cent to US$129 million. This was driven by a 39 per cent rise in earnings from Truong Hai Group Corporation (Thaco) to US$55 million, and a 39 per cent increase from Refrigeration Electrical Engineering Corporation (REE) to US$41 million. Earnings from Cycle &amp; Carriage in Singapore and Malaysia also jumped 49 per cent to US$48 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for H2 FY2025 was at US$1.58, up from US$1.17 the year prior. For the full year, earnings per share was US$2.52, up from US$2.39 previously.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The board has proposed a final one-tier tax-exempt dividend of US$0.85 per share for the year, up from US$0.84 per share in 2024. \n\nThe dividend will be paid on Jun 12.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As for the group’s consolidated net debt position, the amount, excluding the net borrowings within Astra’s financial services subsidiaries, improved to US$44 million as at end-2025, from US$235 million at the end of 2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group attributed the improvement to the divestment of a 4.6 per cent interest in Vinamilk for US$228 million in December, in line with its strategy to build a “focused portfolio” that enhances shareholder value.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Net debt within Astra’s financial services subsidiaries rose from US$3.7 billion at the end of 2024 to US$3.9 billion. JC&amp;C corporate net debt was US$577 million, down from US$816 million at the end of 2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company expects the year ahead in Indonesia to be challenging, though consumer sentiment in the country may see a moderate recovery. JC&amp;C expects Vietnam to continue to grow and Singapore to deliver resilient earnings.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Samuel Tsien, chairman of JC&amp;C, said: “Notwithstanding the near-term outlook, we remain focused on our longer-term objective of building a portfolio aimed at creating sustainable value and delivering strong total shareholder returns.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of JC&amp;C closed down 0.2 per cent or US$0.06 to US$35.36 on Friday.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/jardine-cycle-carriage-h2-profit-36-us626-7-million-declares-dividend-us0-85",
            "pub_date": "2026-02-27 19:25:49",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sats Q3 profit rises 20.4% to S$84.7 million on record cargo volumes",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] In-flight caterer and ground handler Sats on Friday (Feb 27) reported a net profit of S$84.7 million for its third quarter ended Dec 31, 2025, representing a 20.4 per cent increase from the S$70.4 million booked for the previous corresponding period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The stronger performance came on the back of improved cargo volume growth across Asia, Europe and the Middle East, said the group. It added that its global network “continued to capture trade-flow shifts” driven by geopolitical developments and tariff policies.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue rose 8 per cent to S$1.6 billion in Q3 FY2026, from S$1.5 billion a year earlier. The top-line growth was driven primarily by the group’s gateway services segment, in which cargo volumes rose 7.3 per cent year on year to a record-high 2.5 million tonnes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share came in at S$0.057, up from S$0.047 a year earlier.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the nine months ended Dec 31, 2025, Sats booked a 14.4 per cent increase in net profit to S$234.5 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nine-month revenue rose 8.7 per cent year on year to S$4.72 billion. This was supported by broad-based growth, including an 8.2 per cent increase in cargo tonnage, a 0.8 per cent rise in flights handled and a 3.6 per cent bump in aviation meals served.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sats president and chief executive officer Kerry Mok noted that the group’s latest showing was “driven by seasonal peak demand” and marked a “ninth consecutive quarter outperforming industry benchmarks”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For Q4, Sats expects passenger and cargo demand to moderate, though “overall cargo trends remain resilient”. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group also expects “continued volume growth across our network, driven by market share gains and new client wins”. This, it noted, comes despite the International Air Transport Association’s “modest” 2026 global growth forecast of 2.4 to 2.6 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sats added that its financial focus remains anchored in “operational excellence”, “strategic capital deployment”, “prudent cost discipline amid global trade uncertainties” and continued debt reduction.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Sats rose 1.3 per cent or S$0.05 to close at S$3.92 on Friday, before the results were announced.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/sats-q3-profit-rises-20-4-s84-7-million-record-cargo-volumes",
            "pub_date": "2026-02-27 19:20:43",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jeff Bezos’ US$30 billion AI lab seeks industrial sector deals, FT reports",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SAN FRANCISCO] Bezos’ artificial intelligence (AI) lab is raising tens of billions of dollars to buy the companies impacted by the technology – in an effort to benefit from the disruption that he believes will reshape the industrial sector, the<em> Financial Times</em> reported on Friday (Feb 27).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The funding valued the business at about US$30 billion, excluding the new investment, the report said, citing two people with knowledge of the deal.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2025, <em>The New York Times</em> reported that Bezos would serve as co-CEO of a new startup called Project Prometheus, focused on the usage of AI for the engineering and manufacturing of computers, cars and spacecraft.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It was the first time that he took a formal operational role at a company since he stepped down as Amazon CEO in July 2021. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He is involved in Blue Origin, but his official title at the space company is as its founder.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Prometheus is in early discussions with a number of big sovereign wealth funds – including the Abu Dhabi Investment Authority – about investing in the holding company, the report said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Bezos is also talking to JPMorgan CEO Jamie Dimon about investing, it added, and that investment would come through the bank’s US$10 billion fund for its security and resiliency initiative, which aims to reinforce American supply chains in critical industries.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He could not immediately be reached for comment. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The project’s co-founders, Sherjil Ozair and William Guss, did not respond to Reuters’ requests for comments sent outside regular business hours on LinkedIn. REUTERS </p></div>",
            "link": "https://www.businesstimes.com.sg/international/jeff-bezos-us30-billion-ai-lab-seeks-industrial-sector-deals-ft-reports",
            "pub_date": "2026-02-27 19:11:17",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CDL undertakes review to relook strategy, optimise portfolio and capital recycling",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] City Developments Ltd (CDL) is taking a hard look at its global portfolio and capital allocation priorities under a sweeping strategic review, with plans to step up capital recycling and monetise assets. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To maximise shareholder returns, we are actively reviewing our growth strategy, portfolio structures and capital allocation priorities,” said group chief executive Sherman Kwek, at CDL’s earnings briefing on Friday (Feb 27). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We have taken decisive steps to unlock value from mature and non-core assets while selectively redeploying capital to drive growth.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The property giant engaged a global advisory firm around September last year to conduct a review of its strategy and operations. CDL expects to announce the outcome of the review by June this year. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Key areas include rightsizing its portfolio and reviewing capital allocation priorities across geographies and asset classes, said Kwek, noting that formal targets will be provided once the review is completed. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Among assets under scrutiny is CDL’s UK development legacy portfolio, which comprises five properties with a total carrying value of about S$800 million as at end-December 2025, after two assets were sold over the last two years. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">UK development platform </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Acknowledging that the UK assets have “underperformed”, Kwek said the group is looking to “recycle this capital as quickly as possible” and hopes to do so by the end of the year. CDL entered into the UK before Kwek assumed the CEO role, and had to engage an external manager then as it had no presence in the UK. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Currently, CDL’s five properties in the platform are a carpark at 28 Pavilion Road, Knightsbridge, acquired in 2013; Stag Brewery at Mortlake, bought in 2015; office building Development House acquired in 2016; residential project Teddington Riverside bought in 2015; and the six-unit Chesham Street in Belgravia. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at end-December 2025, 148 of the 224 units in Teddington Riverside remain unsold, and three of the six units at Chesham Street remain unsold. CDL is exploring options including bulk sales for Teddington Riverside, said Kwek. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For its China commercial properties, Kwek said the market remains challenging and the group will take a pragmatic approach, assessing each asset individually and even accepting “some haircuts on it”, where necessary, to unlock capital. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We have to continue to drive forward with our capital recycling – it is not a one-off exercise. Capital recycling is very much a part of our business as property developer and asset manager.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2025, CDL secured around S$2 billion in contracted divestments globally, outpacing around S$1.7 billion of acquisitions, which included three Singapore government land sales sites for about S$1.2 billion, and the Holiday Inn London - Kensington High Street hotel for 280 million pounds (about S$480.2 million). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The contracted divestments included the sale of Quayside Isle @ Sentosa Cove for S$97.3 million, which was completed in February 2026. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CDL on Friday posted a net profit of S$538.5 million for the second-half ended Dec 31, 2025, rising more four times from S$113.5 million in the year-ago period. This more than trebled the group’s full-year earnings to S$629.7 million, from S$201.3 million in FY2024. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Robust growth</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Bottom line growth was primarily driven by robust Singapore home sales and strong capital recycling gains, notably from the sale of a 50.1 per cent stake in the South Beach mixed-use development to Malaysian partner IOI Properties Group for S$834 million. The deal generated a gain of S$473.1 million. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at Feb 25, 2026, CDL has sold 95 per cent of the 777-unit The Orie condo project in Toa Payoh. It also sold 87 per cent of the 706-unit Zyon Grand project, as well as 66 per cent of its 246-unit Newport Residences development. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Including executive condos, the group sold 1,657 units for FY2025, raking in total sales value of S$4.35 billion – marking the highest sales value in CDL’s history. In FY2024, the group sold 1,489 units with total sales value of S$2.97 billion. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CDL said it is confident in the Singapore residential market for 2026, supported by stable demand in public and private housing. With moderating interest rates, buying interest is likely to remain resilient. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group is preparing to launch its Lakeside Drive project in Q3 2026 – featuring five 17-storey residential towers with 570 units and commercial space on the first storey. CDL clinched the site in June 2025 at S$608 million or S$1,132.08 per square foot per plot ratio (psf ppr). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It also plans to launch projects on the Woodlands Drive 17 and Senja Close EC sites in the first quarter of 2027. In August 2025, the residential heavyweight bid S$360.9 million or S$782 psf ppr for the Woodlands site, and S$252.9 million or S$771 psf ppr for the other plot. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On the commercial front, Kwek said the group has considered amalgamating Delfi with neighbouring Claymore Connect and Orchard Hotel to create a sizeable mixed-use development.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While CDL has taken some steps under the Strategic Development Incentive scheme, Kwek said the project will not start in the near term to avoid putting financial strain on the group. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Looking ahead, the group enters its next phase of growth with renewed vigour. As we embark on our value creation journey, we are well positioned to deliver sustainable growth and maximise returns for all shareholders,” said Kwek. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of <!-- --> <!-- -->CDL<!-- --> <!-- --> ended Friday 4.9 per cent or S$0.46 higher at S$9.82, after the release of the results. </p></div>",
            "link": "https://www.businesstimes.com.sg/property/cdl-undertakes-review-relook-strategy-optimise-portfolio-and-capital-recycling",
            "pub_date": "2026-02-27 19:11:18",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Issue 184: OCBC hit by coal complaint; Parkway Life Reit secures green, social debt",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Sustainable finance</strong></p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">OCBC under pressure for coal-financing disclosures</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/esg/green-group-files-sgx-complaint-against-ocbc-alleging-disclosure-gaps-carbon-intensive-assets\" target=\"_blank\">OCBC</a> is the target in a complaint lodged with Singapore Exchange alleging inadequate disclosure by the Singapore lender on its exposure to coal.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The complaint is the latest salvo by environmental group Market Forces, which had <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/esg/singapore-banks-flagged-financing-haritas-coal-powered-nickel-smelters-ocbc-tops-list-financiers\" target=\"_blank\">previously</a> identified OCBC and its Singapore peers UOB and DBS as financiers for Indonesian miner Harita Nickel, whose facilities rely largely on coal for energy.</p></div>",
            "link": "https://www.businesstimes.com.sg/newsletters/esg-insights/issue-184-ocbc-hit-coal-complaint-parkway-life-reit-secures-green-social-debt",
            "pub_date": "2026-02-27 19:00:37",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Joo Chiat speakeasy Gaudi Room pays homage to the famous Spanish architect",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Tapas joint Carlitos opened in 2024 with a nondescript, walled-off section in the back that looked as if it might lead to a storeroom. A year later, the curtain was finally pulled back to reveal Gaudi Room, a small “hidden” bar.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For founders Antonio Miscellaneo and Carlos Montobbio, having a separate area for cocktails within Carlitos was always on the cards. “We actually designed the restaurant with space to build this bar from the opening,” says Miscellaneo.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He recounts customers at his other restaurant – La Bottega Enoteca, just a few doors down – asking him for “follow-up experiences” after dinner. “I had nowhere to send them anywhere nearby, but opening a bar on its own is <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/companies-markets/consumer-healthcare/prive-eggslut-fb-closures-2025\" target=\"_blank\">difficult to sustain</a>, so this was the best way.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The duo, however, decided to launch Carlitos before Gaudi Room so they could take more time to perfect the speakeasy’s look and feel.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Inspired by and named after Catalan architect Antoni Gaudi, the bar’s design features his signature organic shapes, including rounded pilasters that transition seamlessly into the walls, as well as custom-carved wood fittings and two long tables.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Explaining why they focused on Gaudi Room only after operations at Carlitos were “fairly stable”, Miscellaneo says: “We knew it would take longer, especially for the level of detail we wanted.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Emulating Gaudi’s “quirky” style added an extra layer of complexity, he adds: “It’s not just a room, tiles, a couple of pieces of furniture; we needed time.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Everything in the 23-seater space was chosen or even made by the founders, down to the ceramic tile mosaic tabletops and the matching upholstery on a bench that anchors a corner. In all, putting the bar together took around four months.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">A new experience</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With Gaudi Room being both Miscellaneo’s and Montobbio’s first cocktail bar, they faced a steep learning curve, particularly when it came to developing the menu. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Montobbio, who is also the chef-owner of Esquina in Chinatown, notes that mixology requires a high level of precision; after all, each drink is only so many ounces of liquid, which leaves little room for error.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“When we taste a cocktail, we may feel it needs a little sweetness; then we add two drops of sugar syrup, and the cocktail is completely changed,” he explains. “It’s not as forgiving as food.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">After working with a consultant on an initial draft for the menu, Miscellaneo and Montobbio set to work on fine-tuning things, infusing each drink with “Spanish and Latin touches”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Among the cocktails in the final line-up is the Margarita de La Vera – Montobbio’s favourite – which includes an infusion of smoked paprika sourced from the county in western Spain from which the drink gets its name.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Another of Montobbio’s top picks is the La Sagrada Paloma: a spicy, Asian-inspired iteration of the classic paloma that includes togarashi and a kimchi base, named for the still-unfinished Barcelona church that is perhaps the architect’s most famous creation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For Miscellaneo, meanwhile, bourbon-based The Smoking Architect was a fast favourite.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I drink cocktails very fast… I usually gulp them down, and in one second – gone,” he says with a laugh. “But with The Smoking Architect, I can pace it a little more; the drink develops and gets rounder as the ice melts.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Also on Gaudi Room’s menu is the Veneno de la Pasion, a Spanish riff on a porn star martini served with a sidecar of cava instead of the usual champagne. Then there’s the Gaudoni Negroni, which adds cassis and cacao to the traditional negroni for a bold, almost dessert-like concoction.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Miscellaneo and Montobbio intend to continually refresh the menu with their team, further refining existing drinks and introducing new ones to keep things interesting.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In line with the speakeasy theme, the duo has opted to let news of the bar spread mostly through word of mouth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“If you come, a friend brings you over, you have a good time and the drinks are good… you will come back with another bunch of friends,” Montobbio concludes. “There’s no better marketing than that.”</p></div>",
            "link": "https://www.businesstimes.com.sg/lifestyle/joo-chiat-speakeasy-gaudi-room-pays-homage-famous-spanish-architect",
            "pub_date": "2026-02-27 19:00:38",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India's GDP growth estimated at 7.8% in Oct-Dec following data revamp",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[NEW DELHI] India’s economy grew 7.8 per cent in October-December from the same period a year earlier, after posting 8.4 per cent growth in the previous quarter, the government said on Friday (Feb 27), as it unveiled a revised series of national output data.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the full fiscal year ending in March, the government expects the South Asian economy to have grown by 7.6 per cent, the National Statistics Office said. It had been forecast to grow by 7.4 per cent under the old data series.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Prime Minister Narendra Modi’s government has undertaken to revamp economic data, including for inflation and gross domestic product, by expanding the sources of information and updating the base year to 2022-23, among other changes. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The adjustments aim to address criticism of outdated data practices and enhance accuracy. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/indias-gdp-growth-estimated-7-8-oct-dec-following-data-revamp",
            "pub_date": "2026-02-27 19:00:38",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        }
    ]
}