{
    "data": [
        {
            "title": "Trump Media considers spinning off Truth Social into public company, reports wider annual loss",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">TRUMP Media &amp; Technology Group, founded by US President Donald Trump, is considering spinning off its social media platform Truth Social into a publicly traded company.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company is in discussions with TAE Technologies and Texas Ventures Acquisition III about the proposed transaction, the company said on Friday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Under the proposal, shares in the spun-off company would be distributed to eligible TMTG shareholders, after which the new entity would merge with a special purpose acquisition company.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This would separate TMTG’s social media and digital media assets from its recently announced fusion energy venture, effectively splitting the company into two publicly traded businesses with distinct strategies.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Truth Social-parent’s net loss widened to US$712.3 million in 2025 from US$400.9 million a year earlier, mostly reflecting unrealised losses from the company’s purchase of bitcoin and Cronos.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">TMTG ended 2025 with about US$2.5 billion in financial assets, more than triple the US$776.8 million it had a year earlier, the company said. Net sales edged up to US$3.68 million from US$3.62 million in 2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Founded by Trump and known for its Truth Social platform aimed at conservative audiences, TMTG has faced challenges scaling its media business amid competition from larger social networks and uneven user growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It is now seeking to reposition itself beyond its core Truth Social platform and tap investor interest in emerging energy technologies.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">TMTG said no definitive agreement has been reached on the spin-off and discussions are ongoing. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In December, TMTG agreed to merge with TAE in an all-stock deal valued at more than US$6 billion, marking a pivot toward fusion energy and the creation of a publicly traded company focused on developing utility-scale power plants to help meet rising electricity demand, including from AI data centres.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">TAE Technologies is a California-based private company developing advanced nuclear fusion technology that has raised more than US$1 billion from investors, including Alphabet’s Google and Chevron.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The startup focuses on a form of fusion designed to produce electricity without releasing large amounts of neutron radiation, reducing radioactive waste. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/trump-media-considers-spinning-truth-social-public-company-reports-wider-annual-loss",
            "pub_date": "2026-02-28 09:45:37",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump directs US agencies to toss Anthropic’s AI as Pentagon calls startup a supply risk",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[WASHINGTON] US President Donald Trump said on Friday he is directing the government to stop work with Anthropic and the Pentagon said it will declare the startup a supply-chain risk, dealing a major blow to the artificial intelligence lab after a showdown about technology guardrails.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump added there would be a six-month phase-out for the Defense Department and other agencies that use the company’s products. If Anthropic does not help with the transition, Trump said, he would use “the Full Power of the Presidency to make them comply, with major civil and criminal consequences to follow.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Spokespeople for Anthropic, which won up to US$200 million from the Pentagon in a contract last year, did not immediately respond to a request for comment. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The planned designation as a supply-chain risk, announced by Defense Secretary Pete Hegseth, means that contractors could be barred from deploying Anthropic’s AI as part of work for the Pentagon. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The defence industrial base includes tens of thousands of contractors, including major public companies. The designation is typically reserved for suppliers from adversary nations. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Such action was taken to remove Chinese tech giant Huawei from the Pentagon’s supply chains: Starting in 2017, the US restricted Defense Department use of Huawei equipment, prohibited federal agencies from purchasing its technology, and halted federal grant and loan funds for Huawei equipment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Anthropic could launch a court challenge to the designation, which poses an existential threat to its business with the government and may harm its private-sector relationships, according to Franklin Turner, an attorney who specialises in government contracts.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Blacklisting Anthropic is the contractual equivalent of nuclear war,” he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Weapons, surveillance concerns</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Pentagon had set a Friday deadline to resolve an escalating feud with San Francisco-based Anthropic over how the military could use AI at war. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">AI leader Anthropic has raced to win fierce competition to sell novel technology to businesses and government, particularly for national security, ahead of a widely expected initial public offering. The company has said it has not finalised an IPO decision.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At the same time, the battle over technological guardrails had raised concerns that the Defense Department would follow US law but few other constraints when deploying AI for national-security missions, regardless of safety or ethics terms required by the technology’s developers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Anthropic had sought guarantees that its AI would not be used for fully autonomous weapons or for mass domestic surveillance - applications in which the Pentagon has said it had no interest.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Anthropic was the first frontier AI lab to put its models on classified networks via cloud provider Amazon.com and the first to build customised models for national security customers, the startup has said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its product Claude is in use across the intelligence community and armed services.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">US Senator Mark Warner, a Democrat and vice-chairman of the Select Committee on Intelligence, criticised the action taken by Trump, a Republican.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The president’s directive to halt the use of a leading American AI company across the federal government, combined with inflammatory rhetoric attacking that company, raises serious concerns about whether national security decisions are being driven by careful analysis or political considerations.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Tech companies and the Pentagon have repeatedly locked horns since at least 2018, when employees at Alphabet’s Google protested against the Pentagon’s use of the company’s AI to analyse drone footage. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A rapprochement ensued with companies including Amazon and Microsoft jousting for defence business, while several big-tech CEOs pledged cooperation last year with the Trump administration.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But theoretical “killer robots” have remained a concern held by human-rights and technology activists. At the same time, Ukraine and Gaza have become theatres for increasingly automated systems on the battlefield. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/trump-directs-us-agencies-toss-anthropics-ai-pentagon-calls-startup-supply-risk",
            "pub_date": "2026-02-28 09:15:37",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall Street hit by UK mortgage lender collapse, raising fears of more credit ‘cockroaches’",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON] Wall Street lenders on Friday were rocked by the implosion of little-known UK mortgage provider Market Financial Solution, fuelling concerns about wider losses among banks and reviving warnings of more “cockroaches” in the booming private credit industry. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The collapse of MFS hammered the shares of Barclays and Jefferies, and accelerated a broader selloff in financial firms and alternative asset managers on Friday, as the market grappled with the prospect of a widening credit contagion, amid concerns about lending standards in the industry. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Other players impacted included Atlas SP Partners, a structured credit affiliate of Apollo Global Management. It comes after twin bankruptcies of auto parts supplier First Brands and car dealership Tricolor last year and follows troubles at Blue Owl, which emerged late last year when it moved to limit withdrawals from a fund. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We’re starting to continue to see these types of things pop up, which is definitely a problem,” said Joe Saluzzi, co-head of Equity Trading at Themis Trading in Chatham, New Jersey, adding that he was concerned how deep problems went. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares in Jefferies fell nearly 10 per cent in US trading, adding to Thursday’s 3.5 per cent decline, as reports of the New York-based bank’s exposure to MFS rattled investors. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Barclays shares were down 4.2 per cent, underperforming the broader FTSE 100 index, which rose 0.6 per cent. Santander shares dropped nearly 5 per cent. The sentiment hit banking shares more broadly with S&amp;P 500 bank index down 4 per cent on Friday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">London-based MFS specialised in complex property-backed loans. It had applied for administration, a form of UK insolvency protection, after it ran into difficulties, according to previous media reports and court documents seen by Reuters. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Creditors who successfully applied to have the company put into administration on Wednesday cited financial irregularities and mismanagement in court documents.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The administrators said in court documents for Wednesday’s hearing that they had support for putting MFS into administration from “major international financial institutions and/or their legal counsel”. The institutions’ names were redacted in court documents provided to Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">MFS may have been “double pledging” assets and there could be a collateral shortfall of £930 million (S$1.58 billion), administrators working on behalf of creditors warned in documents submitted to London’s High Court this week. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The collapse raises further questions on the practice of asset-based financing, which involves loans that are backed by collateral such as hard assets, while also putting the spotlight on double-pledging that was at the heart of the twin bankruptcies of auto parts supplier First Brands and car dealership Tricolor.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For loans to MFS totalling £1.16 billion, there was only £230 million of “true value” available in the collateral accounts, they said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Another blow for Jefferies</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The collapse of MFS marks a double whammy for Jefferies, which was already in the spotlight due to its prominent role in the implosion of First Brands. Apart from Jefferies, others including Barclays, Santander, Wells Fargo, and Apollo-backed Atlas are among the lenders to MFS, which had borrowed more than £2 billion (S$3.4 billion), according to the court documents.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The banks declined to comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Atlas said it has roughly £400 million of exposure to the mortgage provider, or about 1 per cent of its balance sheet. Atlas is one of the senior creditors to MFS, alongside other bank lenders.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Following a breach of contractual terms by Market Financial Solutions, Atlas proactively put two warehouses into default last week and is pursuing all legal avenues to maximize recoveries,” a spokesperson for Atlas said in a statement to Reuters, referring to two so-called warehouse loans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Apollo and other asset managers were down on Friday on broader investor concerns around stress in the private credit industry. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Investors are on the alert for any sign of deteriorating lending standards and cracks appearing in credit markets, with some of those fears centred on a boom in private credit, in which specialist funds lend directly to companies. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The collapse last year of First Brands and Tricolor heightened those concerns, although traditional banks were among the most exposed. Jefferies disclosed last year that its Leucadia Asset Management division, through its credit fund Point Bonita, held about US$715 million in receivables linked to First Brands, although it later said its exposure was limited.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Some experts played down concerns over wider losses at Jefferies. The bank’s total exposure to MFS has been estimated at roughly £100 million, “but the entire balance is unlikely at risk,” BMO Capital Markets said in a note on Friday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Latest ’cockroach’ </strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The implosion of MFS comes months after JPMorgan CEO Jamie Dimon warned that more “cockroaches” could emerge from pockets of Wall Street’s multitrillion-dollar credit machinery, following the bankruptcies of First Brands and Tricolor.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">MFS, based in London’s Mayfair, described itself as a specialist provider of buy-to-let mortgage lending and bridging finance, with net assets of £15.9 million and 149 employees as of Dec 31, 2024, according to its most recently filed accounts.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company, founded by CEO Paresh Raja, said it had a loan book of £2.4 billion at the end of 2024, the accounts show. MFS did not respond to a request for comment. The company is unaffiliated with the US-based asset manager MFS Investment Management.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">MFS creditors Amber Bridging Limited and Zircon Bridging Limited had separately filed for an administration order against MFS, court documents dated Feb 24 and reviewed by Reuters show, citing “real and serious concerns about the mismanagement of the company” and entities in its wider MFS Group.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Amber Bridging and Zircon Bridging, cited as creditors of MFS in the court documents, said there were irregularities in payments due to their accounts and applied for independent administrators to be appointed.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><em>The Times</em> reported Barclays has a £600 million exposure to MFS. Bloomberg said Barclays was among the banks that arranged the loans for MFS.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Analysts from Citi said that the figure may warrant some caution, given banks typically sell on some or all of their exposure when arranging such loans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Arranging a loan is very different to retaining that risk on B/S (balance sheet),” Citi said. “Also not clear if/how much could already be provisioned against (if anything).” REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/wall-street-hit-uk-mortgage-lender-collapse-raising-fears-more-credit-cockroaches",
            "pub_date": "2026-02-28 08:35:39",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall Street hit by UK mortgage lender collapse, raising fears of more credit ‘cockroaches’",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON] Wall Street lenders on Friday were rocked by the implosion of little-known UK mortgage provider Market Financial Solution, fuelling concerns about wider losses among banks and reviving warnings of more “cockroaches” in the booming private credit industry. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The collapse of MFS hammered the shares of Barclays and Jefferies, and accelerated a broader selloff in financial firms and alternative asset managers on Friday, as the market grappled with the prospect of a widening credit contagion, amid concerns about lending standards in the industry. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Other players impacted included Atlas SP Partners, a structured credit affiliate of Apollo Global Management. It comes after twin bankruptcies of auto parts supplier First Brands and car dealership Tricolor last year and follows troubles at Blue Owl, which emerged late last year when it moved to limit withdrawals from a fund. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We’re starting to continue to see these types of things pop up, which is definitely a problem,” said Joe Saluzzi, co-head of Equity Trading at Themis Trading in Chatham, New Jersey, adding that he was concerned how deep problems went. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares in Jefferies fell nearly 10 per cent in US trading, adding to Thursday’s 3.5 per cent decline, as reports of the New York-based bank’s exposure to MFS rattled investors. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Barclays shares were down 4.2 per cent, underperforming the broader FTSE 100 index, which rose 0.6 per cent. Santander shares dropped nearly 5 per cent. The sentiment hit banking shares more broadly with S&amp;P 500 bank index down 4 per cent on Friday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">London-based MFS specialised in complex property-backed loans. It had applied for administration, a form of UK insolvency protection, after it ran into difficulties, according to previous media reports and court documents seen by Reuters. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Creditors who successfully applied to have the company put into administration on Wednesday cited financial irregularities and mismanagement in court documents.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The administrators said in court documents for Wednesday’s hearing that they had support for putting MFS into administration from “major international financial institutions and/or their legal counsel”. The institutions’ names were redacted in court documents provided to Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">MFS may have been “double pledging” assets and there could be a collateral shortfall of £930 million (S$1.58 billion), administrators working on behalf of creditors warned in documents submitted to London’s High Court this week. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The collapse raises further questions on the practice of asset-based financing, which involves loans that are backed by collateral such as hard assets, while also putting the spotlight on double-pledging that was at the heart of the twin bankruptcies of auto parts supplier First Brands and car dealership Tricolor.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For loans to MFS totalling £1.16 billion, there was only £230 million of “true value” available in the collateral accounts, they said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Another blow for Jefferies</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The collapse of MFS marks a double whammy for Jefferies, which was already in the spotlight due to its prominent role in the implosion of First Brands. Apart from Jefferies, others including Barclays, Santander, Wells Fargo, and Apollo-backed Atlas are among the lenders to MFS, which had borrowed more than £2 billion (S$3.4 billion), according to the court documents.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The banks declined to comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Atlas said it has roughly £400 million of exposure to the mortgage provider, or about 1 per cent of its balance sheet. Atlas is one of the senior creditors to MFS, alongside other bank lenders.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Following a breach of contractual terms by Market Financial Solutions, Atlas proactively put two warehouses into default last week and is pursuing all legal avenues to maximize recoveries,” a spokesperson for Atlas said in a statement to Reuters, referring to two so-called warehouse loans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Apollo and other asset managers were down on Friday on broader investor concerns around stress in the private credit industry. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Investors are on the alert for any sign of deteriorating lending standards and cracks appearing in credit markets, with some of those fears centred on a boom in private credit, in which specialist funds lend directly to companies. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The collapse last year of First Brands and Tricolor heightened those concerns, although traditional banks were among the most exposed. Jefferies disclosed last year that its Leucadia Asset Management division, through its credit fund Point Bonita, held about US$715 million in receivables linked to First Brands, although it later said its exposure was limited.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Some experts played down concerns over wider losses at Jefferies. The bank’s total exposure to MFS has been estimated at roughly £100 million, “but the entire balance is unlikely at risk,” BMO Capital Markets said in a note on Friday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Latest ’cockroach’ </strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The implosion of MFS comes months after JPMorgan CEO Jamie Dimon warned that more “cockroaches” could emerge from pockets of Wall Street’s multitrillion-dollar credit machinery, following the bankruptcies of First Brands and Tricolor.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">MFS, based in London’s Mayfair, described itself as a specialist provider of buy-to-let mortgage lending and bridging finance, with net assets of £15.9 million and 149 employees as of Dec 31, 2024, according to its most recently filed accounts.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company, founded by CEO Paresh Raja, said it had a loan book of £2.4 billion at the end of 2024, the accounts show. MFS did not respond to a request for comment. The company is unaffiliated with the US-based asset manager MFS Investment Management.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">MFS creditors Amber Bridging Limited and Zircon Bridging Limited had separately filed for an administration order against MFS, court documents dated Feb 24 and reviewed by Reuters show, citing “real and serious concerns about the mismanagement of the company” and entities in its wider MFS Group.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Amber Bridging and Zircon Bridging, cited as creditors of MFS in the court documents, said there were irregularities in payments due to their accounts and applied for independent administrators to be appointed.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><em>The Times</em> reported Barclays has a £600 million exposure to MFS. Bloomberg said Barclays was among the banks that arranged the loans for MFS.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Analysts from Citi said that the figure may warrant some caution, given banks typically sell on some or all of their exposure when arranging such loans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Arranging a loan is very different to retaining that risk on B/S (balance sheet),” Citi said. “Also not clear if/how much could already be provisioned against (if anything).” REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/property/wall-street-hit-uk-mortgage-lender-collapse-raising-fears-more-credit-cockroaches",
            "pub_date": "2026-02-28 08:26:25",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil prices rise more than 2% as US and Iran extend talks",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[HOUSTON] Oil prices rose about 2 per cent on Friday with traders bracing for supply disruptions as nuclear talks between the United States and Iran had yet to reach an agreement. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Brent crude futures settled at US$72.48 a barrel, up US$1.73, or 2.45 per cent. US West Texas Intermediate crude finished at US$67.02 a barrel, up $1.81, or 2.78 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The two sides agreed to extend indirect negotiations into next week but traders grew skeptical that an agreement between US President Donald Trump’s administration and Iran was possible.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The likelihood Iran is going to agree to what the Trump administration wants doesn’t seem possible,” said Phil Flynn, senior analyst with Price Futures Group. “There’s got to be an endgame to this and the market seems to think that’s where we are headed.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Oil benchmarks on track for weekly gains</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Brent and WTI benchmarks were trading at their highest since July and August, respectively, and were poised to register weekly gains well above 1 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Uncertainty prevails, fear is pushing prices higher today,” said Tamas Varga, an oil analyst at brokerage PVM. “It is completely driven by the outcome of the Iranian nuclear talks and possible military action the US might take against Iran.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The United States and Iran held indirect talks in Geneva on Thursday after Trump ordered a military buildup in the region.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oil prices gained more than a dollar a barrel during the talks, on media reports indicating that discussions had stalled over US insistence on zero enrichment of uranium by Iran. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, prices eased after the Omani mediator said the two sides had made progress. They plan to resume negotiations with technical-level discussions scheduled next week in Vienna, Omani Foreign Minister Sayyid Badr Albusaidi said on X.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We think the latest round of talks offers some hope on chances of a peaceful resolution, but military strikes are in no way out of the equation,” said DBS analyst Suvro Sarkar. Trump said on Feb 19 that Iran must make a deal over its nuclear programme within 10 to 15 days or “really bad things” will happen.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Geopolitical risk premiums of US$8 to US$10 a barrel have been built into oil prices on fears that a conflict will disrupt Middle East supply through the Strait of Hormuz, where about 20 per cent of global oil supply passes, Sarkar said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">To cushion the impact from a possible strike, UAE oil producer Abu Dhabi is set to export more of its flagship Murban crude in April, two trade sources said on Friday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earlier this week, other sources said Saudi Arabia would also increase oil production. Additionally, Saudi Arabia may raise its April crude price to Asia for the first time in five months due to higher demand from India to replace Russian supplies, potentially raising it by about US$1 a barrel. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Producer group Opec+, meanwhile, is likely to consider raising oil output by 137,000 barrels per day for April at its March 1 meeting, sources said, after suspending production increases in the first quarter. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/energy-commodities/oil-prices-rise-more-2-us-and-iran-extend-talks",
            "pub_date": "2026-02-28 08:15:43",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "European shares close eighth month of gains on earnings lift; credit fears hit banks",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">EUROPEAN shares closed at a record high on Friday to log their eighth straight month of gains after better-than-expected corporate updates, while heavyweight banks tumbled amid credit and AI-disruption concerns.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The pan-European Stoxx 600 ended 0.1 per cent higher at 633.85 points, taking its weekly gains to 0.5 per cent. It is now on its longest monthly winning streak since 2012-2013. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But banks dropped 1.7 per cent on Friday in their steepest one-day decline in two weeks. Barclays fell 4.2 per cent after media reports that banks face potential losses related to the collapse of UK mortgage provider Market Financial Solutions.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Santander shed 2.8 per cent as it owns Atlas SP Partners - a lender to MFS - with other banks. The financials-heavy stock index of Spain underperformed major peers with a 0.7 per cent loss.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The recent stress seen in the private credit market, tied to the selloff in software companies this month, is being topped by worries regarding potential irregularities in the mortgage space,” said Ipek Ozkardeskaya, senior analyst at Swissquote Bank.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Much of February has been dominated by concerns that new AI tools could disrupt traditional business and eat into its profits, along with confusion over trade after US President Donald Trump said he was imposing a new global tariff.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nevertheless, investors have taken comfort from an overall improving corporate outlook in Europe, with updates from HSBC, Nestle and Capgemini lifting sentiment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings are expected to drop 0.6 per cent in the previous quarter on a year-on-year basis, compared to a 4 per cent fall analysts were expecting earlier in the month, according to data compiled by LSEG.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“February was marked by this resilience investors are looking for, the safe harbour from the technology disruption... we expect this to remain in place as long as we don’t have enough clarity on how fast AI adoption will be,” Ozkardeskaya said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Investors flocked to healthcare and food and beverage stocks, up 1 per cent and 1.5 per cent respectively, that are considered traditionally defensive sectors amid market worries. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Among other stocks, Melrose dropped 11.6 per cent to the bottom of the Stoxx 600 after the GKN Aerospace owner flagged softer-than-expected revenue for 2026 as sector-wide supply chain constraints persist. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">British Airways owner IAG beat annual profit expectations. However, shares fell 7.4 per cent along with the broader travel and leisure sector - the biggest sectoral loser - as crude prices gained over 3 per cent. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Online takeaway food company Delivery Hero fell 4.4 per cent after reporting annual gross merchandise value slightly below market expectations, reflecting competitive pressure and a challenging economic environment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Swiss Re shares added 3.7 per cent after the reinsurer posted a better-than-expected rise in net profit of 47 per cent and announced an additional US$1 billion share buyback. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/capital-markets-currencies/european-shares-close-eighth-month-gains-earnings-lift-credit-fears-hit-banks",
            "pub_date": "2026-02-28 08:15:43",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US stocks: Wall Street notches monthly declines on combined AI, tariff, geopolitical uncertainty",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[NEW YORK] Financial and tech stocks were hit hard by a handful of persistent investor worries on Friday, with US stocks suffering their largest monthly percentage declines in a year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">All three major indexes ended decisively lower and posted steep weekly declines, with the blue-chip Dow logging its biggest weekly drop since mid-November. The selloff was driven by uncertainty over costs and disruption related to artificial intelligence, revived tariff uncertainties and simmering geopolitical tensions.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The S&amp;P 500 and the Nasdaq logged their steepest monthly declines since March 2025, while the Dow eked out its tenth straight month of gains, its longest winning streak since the ten-month run that ended in January 2018.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To wrap up the month of February, we were reminded there are still some cracks out there,” said Ryan Detrick, chief market strategist at Carson Group in Omaha, Nebraska. “Adding to the day’s weakness was the hotter inflation data, potentially pushing back on the idea of a dovish Fed later this year.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It’s been a rough go in February, but corporate America is looking at over a 14 per cent gain in earnings in the fourth quarter,” Detrick added. “The reality is that earnings drive long-term stock gains and this was a very impressive earnings season.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Financial stocks slid following reports that Barclays, Jefferies, Wells Fargo and other banks face potential losses related to the collapse of UK mortgage provider Market Financial Solutions Ltd, amid broader concerns about lending standards. Wells Fargo, Jefferies and US-listed shares of Barclays dropped between 4.0 per cent and 9.3 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Tech shares also continued to weigh on the indexes as lingering fears related to AI dragged chips and software down 1.2 per cent and 1.5 per cent, respectively.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Defensive sectors such as consumer staples, healthcare and utilities were the session’s clear outperformers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This is a classic risk-off environment where the pure defensive areas are finding some strength while the market is turning its head on some of the more cyclical growth areas that are clearly lagging,” Detrick said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On the economics front, a hotter-than-expected Producer Price Index reading fortified expectations that the US Federal Reserve is unlikely to cut its key interest rate in the near term.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Financial markets are currently pricing in a 94.1 per cent probability that the central bank will leave the Fed funds target rate in the 3.50 per cent to 3.75 per cent range at its upcoming monetary policy meeting in March, according to CME ’s FedWatch tool.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Dow Jones Industrial Average fell 521.28 points, or 1.05 per cent, to 48,977.92, the S&amp;P 500 lost 29.98 points, or 0.43 per cent, to 6,878.88 and the Nasdaq Composite lost 210.17 points, or 0.92 per cent, to 22,668.21. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Of the 11 major sectors in the S&amp;P 500, healthcare and energy - with a boost from rising crude prices - led the gainers, while only financial and technology stocks suffered percentage losses. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nvidia slid 4.2 per cent, extending the previous session’s 5.5 per ent drop despite solid earnings, a sign of persistent unease over emergent AI technology. Zscaler plunged 12.2 per ent after the cloud security firm reported a wider net loss in the second quarter. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Netflix jumped 13.8 per cent as investors cheered its decision to exit the fight for Warner Bros Discovery, which dropped 2.2 per cent. Paramount Skydance, WBD’s likely buyer, soared by 20.8 per cent. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Block surged 16.8 per cent after the payments firm said it would axe nearly half its workforce, as part of its effort to embed AI across operations. Dell shot up 21.9 per cent after the PC maker said it expects revenue from its key AI-optimised servers business to double in fiscal year 2027 and promised to return more cash to shareholders.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Declining issues outnumbered advancers by a 1.31-to-1 ratio on the NYSE. There were 564 new highs and 121 new lows on the NYSE.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On the Nasdaq, 1,594 stocks rose and 3,158 fell as declining issues outnumbered advancers by a 1.98-to-1 ratio.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The S&amp;P 500 posted 49 new 52-week highs and 2 new lows while the Nasdaq Composite recorded 78 new highs and 127 new lows.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Volume on US exchanges was 20.85 billion shares, compared with the 20.19 billion average for the full session over the last 20 trading days. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/capital-markets-currencies/us-stocks-wall-street-notches-monthly-declines-combined-ai-tariff-geopolitical-uncertainty",
            "pub_date": "2026-02-28 07:46:07",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The new age of chokepoints",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IRAN’S recent partial closure of the Strait of Hormuz has once again exposed how vulnerable global commerce remains to disruption at a handful of narrow passages.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Roughly a fifth of the world’s oil and a significant share of maritime trade pass through Hormuz alone. When tensions constrict such arteries, energy prices, freight rates, insurance premiums and corporate balance sheets <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/possible-hormuz-blockade-threatens-asias-energy-lifeline-unsettling-oil-market\" target=\"_blank\">react</a> almost immediately.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hormuz is not an anomaly. The global economy runs on a small number of critical passages, including the Suez Canal, Panama Canal and Strait of Malacca, that together carry more than half of global maritime trade.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/new-age-chokepoints",
            "pub_date": "2026-02-28 07:16:14",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "To boldly go: redefining jobs and expertise in the AI era",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WE FIND it unproductive to be pulled between utopian visions of artificial intelligence (AI)-driven efficiency and dystopian fears of mass unemployment. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">What we observe is more interesting: AI is revealing what was always most valuable about human work – and it isn’t what most of us were trained to sell.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">AI can now draft reports, write code and analyse data – the bedrock of modern jobs. If your value comes from recalling and synthesising information, that value is falling fast. </p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/boldly-go-redefining-jobs-and-expertise-ai-era",
            "pub_date": "2026-02-28 07:00:42",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trading in the ‘Year of Geopolitics’",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IN THE Chinese zodiac it’s the Year of the Fire Horse. But in the volatile, fiery crucible that is the markets in 2026, it’s the Year of Geopolitics.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Eight weeks into the year, we’ve had to experience – and anticipate – risks around Ukraine, Israel, Venezuela, Greenland, plus the worrying and current concentration of <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/opinion-features/edge-precipice-us-iran-crisis-2026\" target=\"_blank\">US military assets off Iran</a>. Simultaneously, we’ve been grappling with concerns around the independence of the US Federal Reserve, and the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/opinion-features/despite-legal-woes-trumps-tariffs-remain-challenge-south-east-asia\" target=\"_blank\">additional trade tariffs</a> announced by US President Donald Trump following the recent Supreme Court ruling.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It begs the question: In an environment where economic growth remains resilient, how should we price geopolitical risk? Should we sell now and ask questions later? Or should we discount, look through, or simply ignore? Should Asian markets – from Tokyo to Mumbai – treat geopolitical risks as transient noise to be filtered out, or as a material threat requiring active and urgent defensive repositioning? </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Inevitably (and unfortunately) there is no easy answer. Our region exhibits specific economic vulnerabilities and thus a unique set of transmission channels through which geopolitical risk flows across asset prices. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">These complexities require a more nuanced response than either pure complacency or panic selling. So in this Year of Geopolitics, I share the Lombard Odier framework which analyses and assesses geopolitical risk, and how to position (our Asia-tilted) portfolios accordingly. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Loud headlines, quiet markets</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">First, to look beyond emotion. Geopolitical events, while heavily covered in media, generate limited and short-lived stress in financial markets. Volatility tends to be episodic, with asset prices recovering within hours (as in the case of “Liberation Day” in 2025), days or weeks – unless fundamental economic channels are disrupted. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At Lombard Odier, we believe markets are primarily macro-driven, responding to negative forces such as financial crises, recessions and pandemics rather than geopolitical shocks. This shifts investor focus from predicting the unpredictable – such as wars, elections and diplomatic breakdowns – towards assessing when such events threaten corporate profitability and economic stability.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Second, identify whether key economic transmission channels are disrupted. Markets respond meaningfully when critical technologies such as semiconductors are restricted, and/or when energy and commodity markets face sustained supply constraints; for example, if conflicts in the Strait of Hormuz or Suez Canal closed oil markets or interrupted supply chains. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Finally, assess whether a geopolitical event impairs companies’ ability to generate profits. Outside of recessions, corporate earnings tend to keep growing, and markets look through transient volatility if demand stays intact and cost structures remain undamaged. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Investors should ask a simple, disciplined question: Does this event alter revenue growth or margins in a sustained way? If the answer is no, then geopolitical risk belongs to short-term noise rather than longer-term strategic asset allocation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Following these three principles offers resilience when applied to portfolio construction. It recognises that markets price economic implications, rather than ethical or moral judgments. By focusing on whether profitability is genuinely threatened rather than forecasting specific shocks, Lombard Odier believes we can navigate our adapting, fragmented world order.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Asia tilt</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Treating geopolitical risk as a globally “uniform” phenomenon obscures crucial regional distinctions. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Different risks will affect different regions differently. For example, Asian markets face asymmetric exposure to Middle Eastern conflict through (extreme) energy import dependence, concentrated shipping chokepoint vulnerability and complex supply chain integration that compounds during disruption to global trade flows.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Crucially, Japan, South Korea, Taiwan, and India import 80 to 100 per cent of their petroleum requirements, with substantial volumes transiting the Strait of Hormuz. China’s onshore crude inventories – including its strategic petroleum reserve – cover over 90 days of imports, a buffer that does not entirely eliminate vulnerability to (sustained) supply disruption. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The per-barrel price of Brent crude is higher by 18 per cent year to date, suggesting potentially compressed margins for energy-hungry Asian airlines, chemical producers and power utilities. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Yet historical examples suggest that unless physical supply is interrupted, price spikes prove temporary. The 2019 attacks on Saudi Aramco facilities and the 2021 Suez Canal blockage produced initial volatility followed by rapid normalisation as alternative sourcing, inventory draws and demand elasticity restored market balance. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Asian investors must distinguish between the substantial risk premium currently embedded in energy markets and the probability of actual supply curtailment that would transform premium into sustained economic damage. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Seek, discover, decide</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The challenge for Asian investors in this Year of Geopolitics is constructing portfolios that endure geopolitical volatility without – as ever – sacrificing performance. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The solution lies neither in blanket defensive positioning nor in naive “all-in” risk appetite, but in differentiation – identifying specific vulnerabilities and opportunities that regional complexities create. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For example, (enduring) US-China geopolitical tensions are giving rise to a new wave of sectoral opportunities. Asian equity markets have commenced significant reallocation towards “strategic autonomy” such as semiconductor manufacturing equipment, rare earth processing, renewables and space-related technologies, creating competitive advantages less susceptible to volatilities in global trade. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This rotation provides a mechanism for reducing portfolio “geopolitical beta” without retreating to cash.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lombard Odier believes resilience emerges from understanding that markets are discounting machines, rather than moral arbiters. Markets price economic implications; they do not make ethical judgments.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The intelligent allocator builds diversified portfolios that endure shocks through robust strategic and tactical asset allocation, allowing them to navigate an adapting, fragmented order without panic or complacency.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>The writer is chief investment officer for Asia at Lombard Odier</strong></p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/trading-year-geopolitics",
            "pub_date": "2026-02-28 07:00:43",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        }
    ]
}