{
    "data": [
        {
            "title": "PropNex H2 profit up 28.3% at S$28.1 million",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] PropNex posted a net profit of S$28.1 million for its second half ended Dec 31, up 28.3 per cent from S$21.9 million in the year-ago period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This translated to an earnings per share of S$0.038, a 28.3 per cent increase from S$0.0296 in H2 2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its H2 revenue rose 18.3 per cent on the year to S$517.5 million from S$437.4 million previously. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">PropNex said on Friday (Feb 27) that the improvements were mainly due to the increase in commission income from project marketing services of S$81.3 million, which was a result of a higher number of transactions completed in H2 2025. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company proposed a final cash dividend of S$0.045 per ordinary share for H2 2025, compared with S$0.055 per share in the year-ago period.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This, together with the dividend per share of S$0.05 declared for H1, brings its total dividend for FY2025 to S$0.095, which the group said is a record, representing a dividend yield of 5.1 per cent. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The distribution will be paid on May 8, after the book closure date of Apr 28 at 5 pm. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The counter closed on Thursday 2.2 per cent or S$0.05 down at S$2.23. </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/propnex-h2-profit-28-3-s28-1-million",
            "pub_date": "2026-02-27 07:50:34",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JPMorgan sees crypto boost if market-structure bill passes",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[NEW YORK] Crypto markets may get a meaningful lift in the second half of the year if US lawmakers approve sweeping market-structure legislation by midyear, even as sentiment remains sour, JPMorgan Chase said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“If passed, it will reshape market structure by providing regulatory clarity, ending ‘regulation by enforcement’, promoting tokenisation, and facilitating greater institutional participation,” the bank said in a research note.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Clarity Act, which has passed the House, is part of a broader push in Congress to create a comprehensive regulatory framework for digital assets. The bill has moved more slowly in the Senate amid disagreements, as lawmakers seek to address what they view as gaps in the Genius Act, signed by US President Donald Trump in July. The measure was the first to set a federal framework for issuing stablecoins.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A key sticking point is whether crypto trading platforms such as Coinbase Global should be allowed to pay users rewards for holding stablecoins, a type of token designed to track the value of the US dollar. Banks argue that letting firms effectively pay yield on clients’ stablecoin holdings could draw money away from lower-yielding deposits and pose risks to financial stability.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Coinbase chief executive officer Brian Armstrong in January, withdrew his support for the draft legislation. Coinbase, other crypto firms and trade groups and the banking industry have since held several meetings at the White House to discuss a compromise. Last week, Armstrong said there is a “path forward”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Bitcoin surged on expectations of a more crypto-friendly second Trump administration, reaching a record above US$126,000 last October. A sharp sell-off followed, leaving digital assets under pressure and investors more cautious. Any sustained rebound would offer relief after cryptocurrencies were pummelled late last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Crypto winters don’t end in excitement; they end in apathy,” said Matt Hougan, chief investment officer at Bitwise Asset Management. “The one-day big up moves are thrilling, but no one expects Bitcoin to run straight back to US$100,000. Bitcoin is in the process of bottoming. The process will take a while and will be messy. There could be lower lows.” BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/banking-finance/jpmorgan-sees-crypto-boost-if-market-structure-bill-passes",
            "pub_date": "2026-02-27 07:30:34",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI and accountancy: Evolution or elimination?",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHENEVER a new wave of technology emerges, the same question follows: Will this <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/opinion-features/pursue-responsible-ai-growth-business-leaders-must-address-labour-displacement\" target=\"_blank\">replace jobs</a>?</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With artificial intelligence (AI), that question feels more urgent. AI can scan thousands of transactions in seconds. It can detect patterns humans might miss. Understandably, people are asking whether <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/budget-2026-why-singapores-white-collar-ai-training-drive-starting-law-and-accounting\" target=\"_blank\">accountants</a>, especially junior ones, will become obsolete. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">From the lens of the Institute of Singapore Chartered Accountants (Isca), that is not where the profession is heading.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/ai-and-accountancy-evolution-or-elimination",
            "pub_date": "2026-02-27 07:00:48",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jack Dorsey’s Block slashes nearly half its staff in AI bet",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[NEW YORK] Jack Dorsey’s Block is cutting 4,000 employees, reducing its workforce by nearly half as the financial technology firm places a bet on artificial intelligence (AI) changing the future of labour productivity. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Block has been restructuring its business model and staffing since 2024 as the company’s stock has lagged. At the same time, the company has invested heavily in AI tools to run more efficiently, including building its own tool called Goose. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The reduction in force, which was announced in a shareholder letter on Thursday (Feb 26), comes after rolling job eliminations that have often been tied to annual performance reviews. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We are taking bold and decisive action here, but we are doing it from a position of strength,” Amrita Ahuja, chief financial officer, said. “We are doing it in a way that we believe positions us to move even faster for our customers.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">After the announcement, Block’s stock jumped as much as 22 per cent in extended trading. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The move by Block is the latest indication of the havoc that new AI tools are wreaking on the economy and financial markets. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the shareholder letter, the company highlighted strong financial performance over 2025, including gross profit growth that more than doubled from the first quarter to the fourth quarter. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dorsey, the company’s co-founder, touted how the company has reignited the growth of users of its peer-to-peer payments app Cash App, scaled its lending products and accelerated Square gross payment volume. Block reported gross profit of US$10.36 billion in 2025, up 17 per cent year-over-year. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dorsey wrote in his letter that his staff learnt about the cuts on Thursday and that he believes many companies will ultimately have to make similar moves due to AI.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I don’t think we are early to this realisation,” he wrote. “I think most companies are late. Within the next year, I believe the majority of companies will reach the same conclusion and make similar structural changes. I’d rather get there honestly and on our own terms than be forced into it reactively.” BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/jack-dorseys-block-slashes-nearly-half-its-staff-ai-bet",
            "pub_date": "2026-02-27 07:00:48",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "30-year mortgage rate falls below 6% for first time since 2022",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BOSTON] For the first time since 2022, the average 30-year mortgage rate in the US has slipped below 6 per cent, a milestone that could breathe life into the coming spring home-selling season.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The average for 30-year, fixed loans was 5.98 per cent, down from 6.01 per cent last week, data from Freddie Mac showed on Thursday (Feb 26). By comparison, it was 6.76 per cent a year ago. The last time it was below 6 per cent was in September 2022. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A rate with a five at the front will ease affordability slightly and may get some buyers off the fence. The property market has been in a holding pattern since 2022 when rates shot up, pricing out many would-be buyers and dissuading homeowners from selling because most were holding onto much lower rates. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Now, the question for sidelined buyers is whether that’s low enough. Slow improvements in affordability could make the peak sales season this spring the best in years, said Mike Simonsen, chief economist at brokerage Compass. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“With a sub-6 per cent rate, we will get reliable sales growth across the country,” Simonsen said. “But none of it is setting up to have a banner year like 2021 without a dramatic change in the economic data.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Pending sales of existing homes in January fell to the lowest level in data dating back to 2001, according to the National Association of Realtors, with the market held down by an unusually brutal winter and lingering economic uncertainty.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Borrowing costs would have to plunge significantly further to fully unlock the housing market, not just because renters remain priced out, but because many homeowners refuse to trade in their existing ultra-low mortgage rates. About seven out of 10 borrowers are locked into rates below 5 per cent, according to data provider Intercontinental Exchange.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, conditions are at least improving, according to Andy Walden, the company’s head of mortgage and housing market research.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The mortgage payment needed to purchase an average home in the US has fallen to about 27 per cent of the median household income – still significantly above historic norms, but the best in nearly four years, Walden said. But the market needs more buyers and sellers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Affordability pressures have been slowly easing, thanks to lower interest rates, softer home prices and rising incomes,” Walden said. “To keep that momentum going, we will need more homes for sale. When affordability improvements are matched with meaningful inventory gains, it can help sustain reduced pressure on home prices.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This winter’s storms across the Northeast may have only added to the pent-up demand that’s been building for years. Now, everything hinges on whether the sub-6 per cent rates last long enough to save the sales season. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“There are likely lots of people who would be looking to jump into the market now if it were not February,” said Jake Krimmel, a senior economist with Realtor.com. “The spring buying season will be the big test, if the timing lines up and expectations meet reality.” BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/property/30-year-mortgage-rate-falls-below-6-first-time-2022",
            "pub_date": "2026-02-27 06:45:44",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Smartphone market set for biggest-ever decline in 2026 on memory price surge: IDC",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BENGALURU] The global smartphone market is poised to suffer its biggest decline ever in 2026, sinking to a more than decade low in shipments, as surging memory chip prices drive up device costs, the International Data Corporation (IDC) said on Thursday (Feb 26)</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Smartphone shipments are expected to drop 12.9 per cent to 1.1 billion units, the research firm said in a report.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The decline will hit low-end Android manufacturers the hardest, while Apple and Samsung are positioned to gain market share as smaller rivals struggle or exit the market entirely, the report said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“What we are witnessing is not a temporary squeeze, but a tsunami-like shock originating in the memory supply chain,” said Francisco Jeronimo, vice-president for Worldwide Client Devices at IDC.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A rapid build-out of AI infrastructure by tech firms such as Meta, Google and Microsoft has captured much of the memory chips supply, lifting prices as manufacturers prioritise components for higher-margin data centres over consumer devices.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Memory chips, or DRAM, are crucial to smartphones as they allow power-hungry applications to run smoothly.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Analysts have said rising component costs will force budget-device focused companies to pass the expenses on to consumers, just as demand at higher price points is weakening.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Apple and Samsung, with stronger balance sheets and premium positioning, are better positioned, IDC said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It expects the average selling price of smartphones to surge 14 per cent to a record US$523 this year, as manufacturers shift towards higher-margin models to offset ballooning costs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IDC expects a modest 2 per cent recovery in 2027 as the crisis eases, followed by a 5.2 per cent rebound in 2028, though it said that the market was unlikely to return to previous norms.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The memory crisis will cause more than a temporary decline; it marks a structural reset of the entire market,” said Nabila Popal, senior research director at IDC’s Mobile Phone Tracker.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">She warned that the sub-US$100 smartphone segment, representing 171 million devices, will become “permanently uneconomical” even after memory prices stabilise by mid-2027. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/smartphone-market-set-biggest-ever-decline-2026-memory-price-surge-idc",
            "pub_date": "2026-02-27 06:31:15",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil settles down after choppy session as traders follow US, Iran talks",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[HOUSTON] Oil prices settled lower after a choppy session on Thursday (Feb 26) as investors tracked developments in talks between the United States and Iran over the Opec member’s nuclear programme, weighing potential supply concerns if hostilities escalate.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Brent crude futures settled down 10 US cents, or 0.14 per cent, to US$70.75 a barrel. WTI futures settled down 21 US cents or 0.32 per cent to US$65.21. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The United States and Iran held indirect talks in Geneva on Thursday over their long-running nuclear dispute to avert a conflict after US President Donald Trump ordered a military build-up in the region.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ongoing developments surrounding those talks during Thursday’s session drove whipsaw moves in crude futures.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oil prices had gained more than a dollar a barrel after media reports indicated the talks had stalled over US insistence on zero enrichment of uranium by Iran, as well as a demand for the delivery of all 60 per cent enriched uranium to the United States.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, prices then retreated after the two countries extended talks into next week, reducing an immediate strike potential, according to Janiv Shah, vice-president of oil analytics at consultancy, Rystad Energy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iranian Foreign Minister Abbas Araqchi described Thursday’s talks as the most serious exchanges with the United States yet, saying Iran clearly laid out its demand for lifting sanctions and the process for relief. Araqchi confirmed talks will continue next week.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oman Foreign Minister Sayyid Badr Albusaidi earlier said significant progress was made in Thursday’s talks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The crude selloff is simply the market removing a geopolitical risk premium,” said Shohruh Zukhritdinov, a Dubai-based oil trader.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Traders priced out the fear of tighter sanctions or disruption through Hormuz. But fundamentally nothing has changed – supply is still long, Opec+ may add barrels in April, and Iran is front-loading exports. So this is sentiment-driven, not structural,” Zukhritdinov said. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/energy-commodities/oil-settles-down-after-choppy-session-traders-follow-us-iran-talks",
            "pub_date": "2026-02-27 06:05:30",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Board of Peace: Bold vision, uncertain future",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHEN US President Donald Trump announced the formation of the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/global/billion-dollar-membership-fee-what-know-about-trumps-board-peace-gaza\" target=\"_blank\">Board of Peace</a> in October 2025, many dismissed it as theatrical diplomacy – another headline-grabbing gesture dressed up in superlatives.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As representatives from more than 40 nations <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/over-20-countries-will-attend-trumps-board-peace-meeting-feb-19-white-house\" target=\"_blank\">gathered</a> at the US Institute of Peace in Washington for the board’s inaugural meeting on Feb 19, it became harder to wave it away entirely. But it also became harder to take it entirely at face value. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">What emerged from the day’s proceedings was a portrait of something genuinely unprecedented: an international body that is equal parts promising and problematic, visionary and vague.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/board-peace-bold-vision-uncertain-future",
            "pub_date": "2026-02-27 06:05:31",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Limited edition drops from Franck Muller, IWC and Bell & Ross",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Franck Muller Vanguard Sport Asia-Pacific Exclusive</strong>\nFranck Muller is leaning into its “sport” side with the new Vanguard Sport Asia-Pacific Exclusive. It’s built around that trademark tonneau shape, but the hand-polished V 43 stainless-steel case feels more agile and refined on the wrist than your typical bulky sports watch. Measuring 42.5 mm wide and 52.7 mm long, it strikes a confident balance between a bold presence and everyday wearability.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The dial takes centre stage on the watch, with its brushed sun guilloche finish. Every numeral is hand-painted and applied individually. This meticulous process requires 25 layers of lacquer to achieve that specific depth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">To keep the look sharp, the case inserts and the contrast stitching on the alligator leather strap are colour-coordinated with the numerals. Inside, the MVD 2536-SCDT automatic movement keeps things running with a 42-hour power reserve.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>IWC Pilot’s Watch George Russell Editions</strong>\nFor Formula 1 fans, George Russell’s signature blue is as much a part of his identity as his racing number. Now, IWC has brought that specific pop of colour to the wrist with two new limited-edition Pilot’s Watches. Instead of just slapping Russell’s name on a dial, IWC’s design team worked with the British racing driver to create something that feels both personal and high-performance.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Both the Chronograph and the Automatic models are housed in 41 mm cases made of matte-black zirconium oxide ceramic. The stealthy, “instrument” look makes the electric blue accents – on the hands, numerals, and even the luminescence – really jump off the dial. Flip the watch over and you’ll find the driver’s number, “63”, engraved on the titanium case-back.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The in-house 69380 calibre powers the Chronograph; the Automatic version, with its 32112 calibre, is a bit of a marathon runner, boasting a five-day power reserve. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Both come on a matching blue rubber strap with a quick-change system. Limited to just 63 pieces each.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Bell &amp; Ross BR-X3 Tourbillon Micro-Rotor</strong>\nBell &amp; Ross steps away from the cockpit and into the world of high-concept art with the BR-X3 Tourbillon Micro-Rotor. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A bold departure from its pilot-watch roots, this one turns the house’s signature square silhouette into a fully transparent showcase for what it calls “mechanical contemplation”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Limited to just 25 pieces, the watch isn’t really about a quick glance at the time, but rather letting the movement tell its own story. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its architecture is clever: instead of a traditional case holding a movement, the steel and sapphire structure is built as a single, inseparable unit. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The design takes a page from Piet Mondrian’s playbook, using a strict, geometric grid of brushed bridges and polished edges that make the internal cogs look like a piece of modernist sculpture.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Technically, it’s a powerhouse as well, with the BR-CAL.389 manufacture movement packing a flying tourbillon and an automatic micro-rotor into a 9 mm case. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">By offsetting the hours and minutes to the two o’clock position, Bell &amp; Ross gives the mechanics the spotlight they deserve.</p></div>",
            "link": "https://www.businesstimes.com.sg/lifestyle/limited-edition-drops-franck-muller-iwc-and-bell-ross",
            "pub_date": "2026-02-27 06:05:31",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall St ends lower as tech rally stalls, AI fervour wanes after Nvidia results",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[NEW YORK] US stocks turned sharply lower on Thursday (Feb 26), the day after earnings from artificial intelligence (AI) vanguard Nvidia failed to impress investors, weighing down technology shares which have provided muscle to the recent rally.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A pivot back to cyclical sectors helped keep the Dow nominally higher, while a 3.2 per cent drop in the Philadelphia SE Semiconductor index helped drag the tech-laden Nasdaq down 1.2 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With Thursday’s drop, the SOX, which has surged 15.7 per cent year-to-date, is on the verge of snapping what would have been a record 11-week winning streak.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Technology shares in general, and software and chips in particular, have see-sawed in recent weeks as investors wrestle with uneasiness over the massive costs and potential disruption of nascent AI technology.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While all three major US stock indexes are on track for modest weekly losses, the S&amp;P 500 and the Nasdaq are poised to close lower on the month. The Dow remains on track to post an advance in February.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nvidia’s fourth-quarter results, posted after Wednesday’s closing bell, were better than analysts expected, and the chipmaker provided above-market estimates. But the world’s richest company by market cap wrestled with increasingly difficult year-on-year comparisons as its revenue growth decelerates. Its shares lost 5.5 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It feels like an Nvidia hangover that’s specific to the AI space,” said Michael Green, chief strategist at Simplify Asset Management in Philadelphia. “The S&amp;P itself is being dragged down by Nvidia and the Magnificent 7, and the Nasdaq is really getting hammered.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It’s as simple as investors being levered long in Nvidia and short the AI disruption,” Green added. “And when that failed to materialise in a large enough scale, they sold out of their position, driving Nvidia down and pushing the stocks they were short back up.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Dow Jones Industrial Average rose 17.05 points, or 0.03 per cent, to 49,499.20, the S&amp;P 500 lost 37.27 points, or 0.54 per cent, to 6,908.86 and the Nasdaq Composite lost 273.70 points, or 1.18 per cent, to 22,878.38.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Among the 11 major sectors of the S&amp;P 500, tech and communication services suffered the steepest percentage losses, while financials led the gainers, rising 1.3 per cent on the strength of big bank shares, including JPMorgan Chase, Bank of America and Wells Fargo .</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The S&amp;P 500 software and services index, battered in recent weeks on worries over AI-related disruption, gained 1.4 per cent, boosted by a 4 per cent increase in Salesforce shares, even though the company provided weaker-than-expected revenue guidance.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trade Desk slid 4.8 per cent following its disappointing revenue forecast amid mounting pressure from larger rivals.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">J.M. Smucker surged 8.8 per cent on the packaged food company’s solid quarterly profit and sales estimates.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">C3.ai tumbled 18.5 per cent after it provided a weaker-than-expected current quarter sales forecast and announced it would slash 26 per cent of its global workforce.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Celsius Holding jumped 6.9 per cent after the energy drink maker beat quarterly revenue estimates.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Advancing issues outnumbered decliners by a 1.41-to-1 ratio on the NYSE. There were 444 new highs and 71 new lows on the NYSE.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On the Nasdaq, 2,439 stocks rose and 2,237 fell as advancing issues outnumbered decliners by a 1.09-to-1 ratio.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The S&amp;P 500 posted 37 new 52-week highs and one new low while the Nasdaq Composite recorded 88 new highs and 88 new lows.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Volume on US exchanges was 19.55 billion shares, compared with the 20.31 billion average for the full session over the last 20 trading days. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/capital-markets-currencies/wall-st-ends-lower-tech-rally-stalls-ai-fervour-wanes-after-nvidia-results",
            "pub_date": "2026-02-27 05:56:16",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        }
    ]
}