{
    "data": [
        {
            "title": "Bedrooms for sale highlight the depths of Europe’s housing crisis",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[MADRID/LONDON] A Spanish startup is selling bedrooms in flats shared with strangers, a British developer offers mortgages for friends willing to buy together, while stakes in rental properties help some tenants cover their housing costs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Such unconventional arrangements highlight the lengths some young Europeans are ready to go to cope with a housing crisis that has hit them the hardest.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Over the past decade, house prices in the European Union grew 10 per cent faster than incomes, according to the European Commission research, and all metrics show that the young feel the squeeze the most.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">And while plans announced by the EU executive in December to make housing more affordable have yet to take shape, some businesses offer novel ways of getting a foothold in the increasingly challenging property market.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In Spain, where housing shortages in Madrid, Barcelona and other major cities were made worse by a surge in short-term holiday rentals, Habitacion.com offers individual rooms for up to 80,000 euros (S$119,424), about a third of what a one-bedroom flat would fetch in similar locations.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It said it sold 200 rooms last year and has a waiting list of 32,000, with properties in seven cities listed on its website.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Offer for singles on tight budgets</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Founder and CEO Oriol Valls says his firm offers a solution to the squeeze on finances – official data show average Spanish monthly salaries rose 26 per cent over the past decade and property prices 81 per cent – and changing life circumstances.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“People no longer get married, or if they do, they get married but don’t have children ... or they do it much later,” he said. “They require much smaller living spaces that are also much more affordable.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Customers must fill compatibility questionnaires, which cover questions whether they have partners or wash the dishes after meals, to be paired with co-owners or renters. They also need to use personal loans rather than mortgages and have to go through the company if they want to resell.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Alvarez, a prospective buyer who declined to give his first name, said Habitacion.com offered to help him get a personal 10-year loan from a regional bank at 6 per cent interest, twice the regular mortgage average, but in the end could not find any rooms in Madrid where he lives.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He also said the scheme, while a good option in general for young people with not enough savings, “loses all appeal if I can’t live with my partner.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, in London, developer Fairview has a “Buddy Up” scheme, offering to connect friends with a broker and solicitor and covering up to £2,000 (S$S$3,406) towards legal fees if they decide to buy property together in the capital or its surroundings.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Banks in Britain, France, Germany and Italy are also reviving low or zero-deposit mortgages that vanished after the 2008 financial crisis. They come with higher costs and typically require applicants to present high, stable income, but while still rare offer an option for those unable to save up for a downpayment but desperate for a home of their own.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Natalie and Martin Walker from West Yorkshire in northern England say an eviction notice served when their baby was one month old drove them to take up a zero-deposit mortgage last year to buy a house after four years of renting.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The sense of stability that it brings you, that’s the biggest delight for me,” said Natalie.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Back in Spain, Carlos Sempere, a 36-year-old industrial engineer who rents a flat in central Madrid, where properties are selling for around one million euros – far out of his reach – bought a rental property in southern Spain instead via an investment company PropHero.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Either it helps me pay the rent, or I sell it in the future,” he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For those who cannot afford a whole property, PropHero also offers stakes in rental apartment buildings in Spain and Ireland for as little as 20,000 euros.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ultimately, it is the dire market conditions that make prospective first-time buyers look past legal complexities and cost of new schemes, says real estate consultant and head of alternative investments at AIRE Partners Patricio Palomar.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“All these housing solutions serve to show how people are getting poorer.” REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/property/bedrooms-sale-highlight-depths-europes-housing-crisis",
            "pub_date": "2026-02-28 14:00:38",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump administration seeks delay in tariff refund fight",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">THE Trump administration is seeking to delay court proceedings over whether it must refund importers billions of dollars in tariffs recently struck down by the US Supreme Court, marking a contentious start to the next phase of the legal fight.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The government wants to wait as long as four months before reviving litigation before the US Court of International Trade on the refund question, according to a filing by the Justice Department late Friday. DOJ lawyers criticised lawyers for companies in one of the lead cases for pressing to reopen the legal wrangling as soon as possible.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Complexity in the future counsels appropriately careful process, not breakneck speed,” the government said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Justice Department appeared to acknowledge that there will be a refund process after its loss in the Supreme Court, warning that “the coming process will take time” and noting the example of an earlier mass refund situation that took years to play out.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But the government’s filing didn’t offer a full-throated assurance that the administration would commit to refunding all importers the full amount of tariffs they paid. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The DOJ lawyers wrote that a delay wouldn’t hurt companies because “monetary loss is a classic harm that can be remedied by payment of money with appropriate interest.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Last year, the government successfully argued for judges to allow the administration to continue collecting tariffs while the legal fight was pending, at one point telling the trade court that the plaintiffs “will assuredly receive payment on their refund with interest” if they won.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Importers had paid approximately US$170 billion in the contested duties by the time the justices ruled, according to Bloomberg Economics analysis.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sara Albrecht, chairperson of Liberty Justice Center, which has represented companies in the case before the Supreme Court, said in a statement that “the government cannot have it both ways.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It cannot argue there is no harm because refunds are available — and then delay when the time comes to return the money,” she said. “American businesses paid money the government had no authority to collect. That money does not belong to Washington. It belongs to the American people who earned it.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Supreme Court’s 6-3 decision on Feb 20 was silent on the refund question, meaning it will go back to the New York-based trade court to resolve. But that next phase is in limbo until the Supreme Court and US Court of Appeals for the Federal Circuit formally close out their proceedings, which hasn’t happened yet.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Over the past week, lawyers for companies seeking refunds have asked the Federal Circuit to swiftly take steps to finish its phase of the case and urged the trade court to move quickly to establish a schedule for the next round.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Justice Department, by contrast, wants the Federal Circuit to wait until the Supreme Court finalises its judgment, which can take up to 32 days. After that happens, the government is then arguing for another 90-day delay, saying that it would “allow the political branches an opportunity to consider options.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The administration accused the companies of pushing for a speedy schedule out of an “apparent desire to be the center of attention” in the future proceedings before the trade court.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The latest filing also referred to Trump’s move to impose new global tariffs under a different legal authority after the Supreme Court ruled, citing the fact that the levies declared unlawful by the Supreme Court “have been replaced by vigorous new tariffs.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The government didn’t elaborate on the relationship between the new duties and the question of whether businesses should be refunded for money they already paid.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump signalled the administration might contest refunds shortly after the Supreme Court announced its decision, telling reporters “I guess it has to get litigated.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In a social media post on Friday, he appeared to refer to potential refunds as an “undeserved ‘windfall’” and asked, “Is a Rehearing or Readjudication of this case possible???”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">More than 2,000 tariff lawsuits have been filed so far, nearly all of which were lodged in the trade court after the Supreme Court heard arguments in November. The trade court paused all of the cases until the Supreme Court ruled.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Only importers are eligible to seek refunds directly from customs authorities, but consumers recently joined the fray as well, filing a handful of proposed class actions this week to recoup the higher prices they paid as businesses passed on the cost of the levies. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/trump-administration-seeks-delay-tariff-refund-fight",
            "pub_date": "2026-02-28 13:51:17",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia plans new chip to speed AI processing, WSJ reports",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">NVIDIA plans to launch a new processor designed to help OpenAI and other customers build faster, more efficient AI systems, the <em>Wall Street Journa</em>l reported on Friday, citing people familiar with the matter.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nvidia is developing a new system for “inference” computing, a form of processing that allows AI models to respond to queries, the report said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The new platform is set to be unveiled at Nvidia’s GTC developer conference in San Jose next month and will incorporate a chip designed by startup Groq, the report added citing people familiar.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Reuters could not immediately verify the report. Nvidia and OpenAI did not immediately respond to Reuters request for comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Reuters earlier this month reported OpenAI is unsatisfied with the speed at which Nvidia’s hardware can spit out answers to ChatGPT users for specific types of problems such as software development and AI communicating with other software.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It needs new hardware that would eventually provide about 10 per cent of OpenAI’s inference computing needs in the future, one of the sources told Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The ChatGPT maker has discussed working with startups including Cerebras and Groq to provide chips for faster inference, two sources said. But Nvidia struck a US$20-billion licensing deal with Groq that shut down OpenAI’s talks, one of the sources told Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In September, Nvidia said it intended to pour as much as US$100 billion into OpenAI as part of a deal that gave the chipmaker a stake in the startup and gave OpenAI the cash it needed to buy the advanced chips. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/nvidia-plans-new-chip-speed-ai-processing-wsj-reports",
            "pub_date": "2026-02-28 13:40:48",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Saying yes, for less: Why lab-grown diamonds have cornered 80% of the engagement ring market",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] For decades, the mined diamond was the undisputed centrepiece of a marriage proposal, including in Singapore. But pragmatic couples are breaking with tradition by opting for lab-grown stones instead.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lab-grown diamonds now account for about 80 per cent of engagement ring sales, jewellery stores across the island tell <em>The Business Times</em>.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Part of a worldwide trend, the transition was helped along by the US Federal Trade Commission, which in 2018 stopped defining a diamond as strictly “natural”. </p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/saying-yes-less-why-lab-grown-diamonds-have-cornered-80-engagement-ring-market",
            "pub_date": "2026-02-28 13:31:21",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Maduro seeks to toss US charges over blocked fees to lawyer",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">OUSTED Venezuelan leader Nicolas Maduro asked a federal judge to dismiss drug-trafficking charges against him, claiming the US is blocking funds for his legal defence from the Venezuelan government.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Maduro’s lawyer, Barry Pollack, said in a Thursday court filing in New York that actions by the US Treasury Department unconstitutionally violated Maduro’s right to the counsel of his choice. According to Pollack, this requires the case to be dismissed.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Maduro and his wife Cilia Flores were both forcibly removed from Venezuela by US forces in January. Days later they appeared in court in New York where both pleaded not guilty. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Because Maduro and Venezuela are under US sanctions, Pollack requires a license from the Treasury Department’s Office of Foreign Assets Control to send funds for the ousted president’s defence, the lawyer said. But OFAC “appears unwilling” or “has been instructed” not to issue such a license.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A spokesman for the Manhattan US Attorney’s office, which is prosecuting the case, declined to comment. A spokesperson for the Treasury department didn’t respond to requests for comment. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Pollack said Venezuelan law requires the government in Caracas to pay Maduro’s legal fees, and officials there are willing to do so.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I have relied on this expectation and cannot afford to pay for my own legal defence,” Maduro said in a signed declaration accompanying the court filing.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Pollack told the court that counsel for Maduro and Flores both applied for OFAC licenses on Jan 7. They were issued two days later, but OFAC amended the Maduro license, within hours and without explanation, to bar payments from Venezuela.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The United States government, even while authorising myriad commercial transactions with Venezuela, is prohibiting counsel from receiving untainted funds from the government of Venezuela, despite Venezuela’s obligation to fund Mr Maduro’s defence,” Pollack said in the court filing. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/maduro-seeks-toss-us-charges-over-blocked-fees-lawyer",
            "pub_date": "2026-02-28 12:45:38",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bill Clinton tells House panel he wasn’t aware of Epstein crimes",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">FORMER President Bill Clinton delivered a sweeping denial of any knowledge of Jeffrey Epstein’s crimes during roughly six hours of closed-door testimony on Friday before a House committee investigating the disgraced financier’s political connections.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I saw nothing, and I did nothing wrong,” Clinton said in a statement prepared for delivery at his closed-door deposition in Chappaqua, New York. “I know what I saw, and more importantly, what I didn’t see.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Clinton said he had “no idea of the crimes Epstein was committing” and described their relationship as a “brief acquaintance” that ended years before Epstein’s conduct became public.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Clinton on Friday became the first former American president forced to testify to Congress. His wife, former US Secretary of State Hillary Clinton, testified before the same panel on Thursday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The former president signalled that some of his answers might frustrate lawmakers, cautioning that he would not speculate about events from decades ago. “You’ll often hear me say that I don’t recall,” he said. “I’m not going to say something I’m not sure of.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hillary Clinton told reporters after her own deposition, which she said spanned topics like UFOs and the so-called PizzaGate conspiracy theory, that she is confident her husband knew nothing about Epstein’s crimes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">House Oversight Chair James Comer said the committee planned to question Clinton on flights the former president took on Epstein’s private plane and visits the financier made to the White House during the Clinton presidency. After the hours-long questioning, Comer called it a “very productive deposition.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I do think that we picked up some new facts,” Comer added. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Representative Robert Garcia, the panel’s top-ranking Democrat, told reporters during an afternoon break in the questioning that Clinton was “very cooperative” and “answering the questions fairly, to the best of his ability.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">President Donald Trump and his allies have sought to put a spotlight on Epstein’s connections to Democrats, including the Clintons, amid public attention on the sex offender’s ties to the president and his associates, including Commerce Secretary Howard Lutnick and former senior adviser Steve Bannon.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Representative Nancy Mace, a South Carolina Republican and one of the lawmakers on the panel, said earlier that Clinton would “be thoroughly asked about” photographs of him featured in the first tranche of Epstein files released by the Justice Department in December. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Those photos, including one of the former president soaking in a jacuzzi and another swimming with Epstein accomplice Ghislaine Maxwell, garnered significant media attention. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Mace said the panel questioned Hillary Clinton about the photos on Thursday but she re-directed the questions to her husband.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Since I am under oath, I will not falsely state that I am looking forward to your questions. But I am ready to answer them,” the former president said in his opening statement.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Garcia told reporters before the deposition began that Democrats “have real questions, questions that deserve serious answers from former President Clinton” but “what we do not want today is a sideshow.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Bill Clinton took several trips on Epstein’s private plane before Epstein pleaded guilty in 2008 to Florida state charges that included procurement of a minor to engage in prostitution. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Epstein also donated US$1,000 to Bill Clinton’s 1992 presidential campaign and US$20,000 to Hillary Clinton’s 2000 US Senate campaign. A charity controlled by Epstein contributed US$25,000 to the Clintons’ private foundation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In an interview with the BBC in mid-February, Hillary Clinton said her husband had flown on Epstein’s private jet “for his charitable work” and she didn’t recall ever meeting Epstein. She said she had met Maxwell “on a few occasions.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Maxwell was convicted in 2021 of recruiting girls for sexual abuse and participating in some of the assaults. She is currently serving a 20-year prison sentence.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Bill Clinton has said that he parted ways with Epstein many years before the financier’s 2019 death in a New York jail cell while awaiting trial on sex trafficking charges. Authorities ruled the death a suicide.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Clintons yielded to Republican demands to appear before a House committee investigating Epstein after GOP lawmakers threatened to hold them both in contempt of Congress if they didn’t testify.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Clintons said they’d offered to send sworn statements to the House committee as others who’d been subpoenaed to testify had done, but the Republican-led panel turned them down.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Democratic lawmakers said the panel should follow the precedent set with Clinton and subpoena Trump to testify under oath.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“President Trump was in the Epstein files almost more than anyone else besides Ghislaine Maxwell,” Garcia told reporters. “Answer our questions. This is not a hoax. He has not been exonerated.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">White House spokesperson Abigail Jackson said that Trump had been “totally exonerated on anything relating to Epstein” and has “done more for Epstein’s victims than anyone before him.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump has denied any knowledge of Epstein’s criminal activities. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/bill-clinton-tells-house-panel-he-wasnt-aware-epstein-crimes",
            "pub_date": "2026-02-28 11:21:11",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BMW launches recall over potential fire hazard",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BERLIN] German premium carmaker BMW has launched a recall affecting hundreds of thousands of vehicles worldwide over a potential fire hazard, according to KBA, Germany’s motor vehicle authority.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The authority said on its website that 337,374 vehicles of the i7, i5, 5, 7 and M5 series were potentially affected, with manufacture dates between 2022 and 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It warned that an improper installation of the cockpit wiring harness could damage cables when replacing the microfilter, resulting in a short circuit causing a fire.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A BMW spokesperson said quality checks found cable routing in affected vehicles needed fixing, but no accidents linked to the issue had been reported. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/bmw-launches-recall-over-potential-fire-hazard",
            "pub_date": "2026-02-28 10:46:09",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump touts economy, energy in Texas, mum on his favourite in Republican Senate race",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[CORPUS CHRISTI, Texas] US President Donald Trump touted his economic and fossil fuel agenda in southern Texas on Friday but was coy about which of three Republican candidates he would back in the state’s looming US Senate primary. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump has stayed out of his party’s messy US Senate contest ahead of Tuesday’s vote. His visit to Corpus Christi placed him near several competitive US House of Representatives districts where Hispanic voters, an important constituency for Republicans nationally, could determine the outcome in November’s midterm elections.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump, wearing a red “Make America Great Again” hat, spoke to several hundred supporters at a waterfront rally in front of a ship he said had carried oil from the United States’ “new friend and partner” Venezuela.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump boasted about his single-minded determination to increase production of fossil fuels blamed for climate change, saying his policies had led to lower petrol prices and helped boost economic growth. Gas prices are about 4 per cent lower since January last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We’re witnessing a historic American energy boom like we’ve never seen,” Trump said. The trip followed a warning from a Texas Republican who said her recent loss in a state legislature race, despite Trump’s endorsement, was a “wake-up call” for the party.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump urged his supporters to vote. “We don’t want to lose the midterm. We got to win the midterm,” he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Trump mum on Texas senate endorsement</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The president’s event springboarded off his <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/global/trump-touts-economic-record-state-union-seeking-reset-ahead-midterm-elections\" target=\"_blank\">State of the Union address</a>, which sought to draw sharp contrasts with Democrats on affordability and immigration enforcement as they aim to gain control of Congress later this year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Midterm elections are historically seen as a check on the sitting president, and Trump has warned his agenda will be derailed if his party loses power. But first, Republicans in the deeply conservative state of Texas must settle on who they want to represent them in November’s general election.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Public opinion polls show Senator John Cornyn, in office since 2002, trailing two challengers - Texas Attorney General Ken Paxton and US Representative Wesley Hunt - in Texas’ most cutthroat contest.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump told reporters on Friday that he had “pretty much” decided who to support but would not share the name.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">During the rally, Trump revelled in the three-way competition. “It’s going to be an interesting one,” Trump said, taking time to shout out each candidate in attendance.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As he has done several times before, Trump also raised the prospect of seeking an unconstitutional third term as president.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Can forced restricting rescue Republicans?</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At the president’s urging last year, Texas Republicans launched a redistricting fight aimed at improving the party’s prospects in US House races. With the new map in effect, Republicans could gain up to five more seats across the state.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hispanic voters in south Texas are key to the party’s electoral success, said Corpus Christi’s state Senator Adam Hinojosa, the first Republican to represent the Rio Grande Valley in the Texas Senate since 1874.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We need the job opportunities, we need to make sure that our families are taken care of, we need to be able to afford all of the groceries and things to have a decent lifestyle,” Hinojosa said in an interview ahead of the rally. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump has prioritised maximising US fossil fuel production by rolling back environmental regulations and streamlining permitting for energy projects. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Corpus Christi area is the top exporter of liquefied natural gas in the US. Even so, a recent Reuters/Ipsos poll found that 36 per cent of people nationwide approved of Trump’s handling of the economy while 56 per cent disapproved.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Mary Campbell, who attended Friday’s rally and has two Christmas trees she keeps decorated for Trump year-round, said she was “very happy with the border” under his presidency. But the economy, she said, “could use a little more help.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I  ’m sad that prices are not quite controlled yet, but hopefully we’re working in that direction,” Campbell, of Corpus Christi, said. “I have five kids, so you know, I watch some of them struggling.” REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/trump-touts-economy-energy-texas-mum-his-favourite-republican-senate-race",
            "pub_date": "2026-02-28 10:30:42",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "eBay laying off about 800 workers, 6% of global workforce",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SAN JOSE] eBay is cutting about 800 jobs, or 6 per cent of its full-time employees, saying the layoffs are needed to align its workforce with strategic priorities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We are taking steps to reinvest across our business and align our structure with our strategic priorities, which will affect certain roles across our workforce,” the San Jose, California-based company said early Thursday (Feb 26) in a statement. “We are grateful for the contributions of the employees impacted and are committed to supporting them with care and respect.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">eBay will continue to hire in key areas.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The cuts come a week after the company said it would acquire secondhand fashion marketplace Depop for about US$1.2 billion in an effort to draw younger shoppers and after it reported robust quarterly results. Revenue increased 15 per cent to US$3 billion in the fourth quarter, surpassing analyst estimates.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The layoffs mark the third round of cuts in three years. In early 2024, the e-commerce company axed about 1,000 jobs, or about 9 per cent of its workforce, saying labour costs had outpaced growth. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In early 2023, the company terminated about 500 employees, or about 4 per cent of staff, citing a pullback in consumer spending following the pandemic-era online shopping boom. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/ebay-laying-about-800-workers-6-global-workforce",
            "pub_date": "2026-02-28 10:16:10",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "From Bill Gates to JPMorgan: Businesses and billionaire leaders caught up in the Epstein scandal",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] As Global Counsel collapsed into administration over its founder’s ties to Jeffrey Epstein, it joined a growing list of organisations and individuals scathed by the scandal surrounding the convicted sex offender, who died in 2019. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The public affairs consultancy, which had a presence in Singapore, was hit with an exodus of client departures due to its founder Peter Mandelson’s past relationship with Epstein. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This was despite the firm having cut ties with the former British politician in September 2025, on the same day he was sacked from his role as the UK’s envoy to the US.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Global Counsel’s collapse follows the release of fresh documents from the Epstein files, a vast multimedia collection containing millions of records related to his sex-trafficking operations, including images, videos and e-mails. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The documents released in January by the US Department of Justice (DOJ) did not just reignite interest in the scandal that erupted following Epstein’s arrest in July 2019 on federal sex-trafficking charges; it also cast a light on numerous personalities and companies linked to him, from politicians and tech billionaires to Wall Street banks and Hollywood celebrities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Global Counsel is just one entity caught in the fallout from a saga that has toppled companies, sent individuals to jail, and counts among those implicated US President Donald Trump and former Prince Andrew. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here are some others: </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">SpaceX and Elon Musk </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Tesla CEO Elon Musk is known to have socialised with Epstein after the latter’s conviction as a sex offender in 2008.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The tech billionaire, who was invited to Epstein’s island but denies ever visiting it, has sought to publicly distance himself from the disgraced financier for years. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">E-mails released by the DOJ show Epstein visited SpaceX’s headquarters in 2013, although Musk claimed in 2020 that Epstein never toured his potentially US$800 billion space company, which is eyeing an initial public offering this year. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Notably, Epstein attempted to bring three foreign national women onto the premises, which raised security concerns; access to SpaceX’s facilities is often limited to US citizens as the firm manufactures defence-related technology. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Fed chair nominee Kevin Warsh</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump’s nominee to <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/global/what-does-kevin-warshs-nomination-mean-fed\" target=\"_blank\">replace US Federal Reserve chairman Jerome Powell</a> has been named in the DOJ documents. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Kevin Warsh, a 55-year-old Wall Street and public service veteran, once worked at Morgan Stanley, which has past links to Epstein.  </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Bill Gates and the Gates Foundation</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Microsoft co-founder <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/bill-gates-cancels-keynote-address-india-ai-summit\" target=\"_blank\">abruptly withdrew</a> from India’s AI Impact Summit amid increasing scrutiny of his links to Epstein after e-mails revealed correspondence between the financier and Gates Foundation staff.   </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While Gates’ absence was perceived as <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/indias-ai-summit-where-big-ambitions-met-hard-realities\" target=\"_blank\">an additional setback</a> for the flagship summit, the six-day event nonetheless garnered over US$200 billion in investment pledges for India’s AI infrastructure. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Gates has expressed regret over meeting Epstein. He has maintained that the relationship with Epstein was restricted to philanthropy-related discussions. He has also said that he neither did nor witnessed anything illicit. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Virgin Group founder Richard Branson</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">E-mails showed that the British entrepreneur who founded the Virgin Group had a warm relationship with Epstein. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Branson corresponded with Epstein in 2013, after the latter’s conviction. A Virgin Group spokesperson has said that contact between Branson and Epstein took place on a few occasions. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">According to the <em>Financial Times</em>, Epstein offered donations to Virgin Unite, the nonprofit arm of Branson’s Virgin Group, but the foundation blocked Epstein’s money after carrying out due diligence.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Peter Mandelson and Global Counsel</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The former UK cabinet minister faces allegations of suspected misconduct in public office. He is also under investigation for allegedly disclosing market-sensitive government information to Epstein when he was a minister. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This comes after e-mails between Mandelson and Epstein were determined to contain market-sensitive information that should not have been disclosed to those outside the government. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Police <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/former-uk-ambassador-mandelson-arrested-after-epstein-revelations\" target=\"_blank\">arrested Mandelson</a> on Monday (Feb 23) in relation to a misconduct probe, stemming from his ties to Epstein. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Mandelson, who has publicly expressed regret for associating with Epstein, was released from police custody on bail hours after his arrest. His lawyers claimed that his arrest resulted from “baseless” suspicions of intent to abscond. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">JPMorgan Chase and Jamie Dimon </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">America’s biggest bank has faced several lawsuits over its troubled relationship with Epstein, who was a client of 15 years – from 1998 to 2013 – before being kicked out. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2019, JPMorgan flagged more than US$1 billion in suspicious transactions linked to Epstein, who had moved hundreds of millions of dollars through the lender to Russian banks. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">JPMorgan chief executive officer and Wall Street veteran Jamie Dimon has claimed he did not know of Epstein’s activities until news broke of the criminal operations in 2019.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, top executives at the New York-based bank were actively involved with Epstein, and some staff even kept in contact with him after he shifted his accounts to Deutsche Bank.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">JPMorgan deputies linked to Epstein include its former private banking chief Jes Staley and its current asset and wealth-management chief Mary Erdoes, who was aware of his sex-offender status. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2023, JPMorgan agreed to pay the US Virgin Islands – where Epstein’s island is located – a US$75 million settlement for a lawsuit that accused the bank of enabling Epstein’s sex trafficking. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">That same year, it reached a US$290 million settlement with Epstein’s victims. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Wasserman Group leader, Hollywood talent agent Casey Wasserman</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hollywood talent agent Casey Wasserman came under fire after flirtatious e-mails he exchanged in 2003 with Epstein’s accomplice Ghislaine Maxwell – who is now serving a 20-year prison sentence – surfaced from the Epstein files. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">His talent agency has lost high-profile clients, including pop star Chappell Roan and former US football player Abby Wambach. This has led him to announce plans to put up his agency for sale. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While Wasserman remains in charge of the organising committee of the 2028 Los Angeles Olympic Games, there are widespread calls for him to step down. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Deutsche Bank</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Germany’s largest lender banked Epstein from 2013 to 2018 and processed hundreds of transactions for him. These included payments to victims and suspected accomplices.   </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">New York state regulators accused the Frankfurt-based bank of failing to properly vet Epstein’s transactions despite publicly available data of his sexual offences. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Deutsche Bank agreed to pay regulators a US$150 million settlement for compliance failures involving Epstein. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Morgan Stanley </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The investment bank continued to secure banking relationships with entities linked to Epstein following his conviction, opening accounts for his trusts from 2015 to 2019. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Documents showed Morgan Stanley had notified Epstein that it would cease its banking relationship with him after closing a trust account in 2017. However, it subsequently opened another account linked to him in 2019; this was closed shortly afterwards. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Former WEF chief Borge Brende</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The president of the World Economic Forum (WEF) announced his resignation on Thursday after the organisation opened an independent probe into his relationship with Epstein. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Brende, who was previously Norwegian foreign minister, dined with Epstein thrice at business dinners and corresponded with him via e-mail and text messages. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He claims to have been unaware of Epstein’s criminal activity before the two met in 2018. He has also expressed remorse for not investigating Epstein more thoroughly.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Google co-founder Sergey Brin</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sergey Brin visited Epstein’s island and made dinner plans at his New York City townhouse in 2003, before the financier was convicted as a sex offender. He also corresponded with Maxwell.</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/bill-gates-jpmorgan-businesses-and-billionaire-leaders-caught-epstein-scandal",
            "pub_date": "2026-02-28 10:01:24",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        }
    ]
}