{
    "data": [
        {
            "title": "How a little-known team from Norway is slaying Europe’s football elite",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[MILAN] The year that Inter Milan last won the Champions League, in the 2009/10 season, Bodo/Glimt finished sixth in the second division of Norway’s football league.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The gulf in the respective sizes and international reputations of these two clubs is wide.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But Inter, one of the most storied clubs ever to exist – 20-time Serie A champions and three-time European champions – were beaten on Tuesday (Feb 24) in the knockout playoffs of the Champions League, and beaten easily, by “a team from a small town up north”, as Bodo/Glimt’s head coach Kjetil Knutsen put it after the match.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Even that is an understatement: Bodo is so far north that it is just above the Arctic Circle, home to a population of just more than 40,000, all of whom could have fit comfortably inside Inter’s San Siro stadium.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This was not just a plucky upstart taking down a faded giant: Inter is 10 points clear at the top of Serie A and has reached the Champions League final in two of the past three seasons.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It also was not a fluke, or a mugging that Bodo did not deserve. The team hammered Inter in the first leg of the matchup in Norway and kept it at arm’s length in the second. Despite producing less possession (71 per cent to 29 per cent) and fewer shots (30 to seven) in Milan, Bodo never looked in real danger.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This is Bodo’s first season in the Champions League, having come through the qualifiers to reach the league phase, but it also looked likely to go out rather quietly at that stage: After six of its eight games, it stood at 32nd in the standings, having not recorded a win. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It had to beat Manchester City and then Atletico Madrid to stand a chance of even reaching these playoffs, which it somehow managed, but surely the Norwegian team would not be able to pull off another upset? As it turns out, it very much could.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Can you believe it?” Knutsen said after the game, his eyes wide with wonder at what his team had achieved. “I can’t actually believe it. The players were amazing. I’m so proud.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It is also worth pointing out that Bodo is playing in its offseason: The Norwegian league finished in November, and while the end of the domestic season coincided with the team’s revival in Europe, and it has not lost since, it goes against conventional wisdom that a team can succeed without the rhythm of regular football  matches.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It sounds not true,” said Jens Petter Hauge, the winger who started at Bodo but then left for Inter’s rivals AC Milan in 2020. He returned to Bodo in 2024. “What we have done, I’m so proud of the group. We’re all in this together, and we believe so much in this project.”</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Effective strategy</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Bodo’s success has not come because of some wealthy benefactor. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This is more organic, broadly explained by Knutsen’s adherence to high-intensity, high-energy football and a recruitment strategy that not only finds players who fit that approach, but also identifies those with raw talent and an X-factor – one single outstanding quality that everyone else might have overlooked because the player might be raw and unpolished.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This strategy has worked in recent years, when the team was merely bloodying the noses of the big boys in European football’s two lesser competitions, the Europa League and the Conference League, and it is still working at the highest level, and with some gusto.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Is this win over Inter the biggest upset in the history of the Champions League knockout stages? </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It could well be. Other nominations might include Dynamo Kyiv beating Real Madrid in 1999; Deportivo La Coruna producing an astonishing comeback to beat Milan in 2003-04; or maybe Monaco beating Manchester City in 2016-17. Bodo’s achievement is different from all of those.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It is certainly one of the more extraordinary runs of form the Champions League has ever seen. It is also, as the data firm Opta pointed out, the first time since 1972 that a team from outside the top five European leagues – England, Spain, Germany, Italy and France – has won four consecutive games against teams from those nations in the Champions League or its predecessor, the European Cup. That team in 1972 was Ajax Amsterdam, which went on to win the whole thing.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This is not the first time Bodo/Glimt has made an Italian giant look small: In 2021, it hammered Jose Mourinho’s Roma 6-1 in the Europa Conference League. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Up next for the Norwegian club is either Sporting Lisbon or Manchester City. You would not bet on it being their last miracle, either. NYTIMES</p></div>",
            "link": "https://www.businesstimes.com.sg/lifestyle/how-little-known-team-norway-slaying-europes-football-elite",
            "pub_date": "2026-02-27 18:01:32",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ComfortDelGro H2 earnings up 7.9% at S$124.3 million, full-year revenue crosses S$5 billion",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Transport operator ComfortDelGro (CDG) reported a 7.9 per cent year-on-year rise in earnings to S$124.3 million for the second half of the financial year 2025 ended December.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">H2 revenue was up 11.7 per cent at S$2.6 billion, from S$2.4 billion in the corresponding year-ago period. In particular, revenue from its public transport business was 8.2 per cent higher at S$1.7 billion. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This was attributed to the commencement of UK Metroline Manchester contracts, UK London bus contracts renewed at improved margins and increased Singapore rail fare revenues, though these were partially offset by the transfer of the Jurong West bus package.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, operating profit from the public transport segment rose 35.3 per cent to S$101.5 million. The group stated this was mainly due to a gain on the disposal of Victoria bus depots as part of newly awarded contracts, contributions from the UK Metroline Manchester contracts and improved margins on UK Metroline London bus contracts.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its taxi and private-hire vehicle business revenue surged 21.7 per cent to S$512.6 million, mainly from the incremental revenue from the 2024 acquisition of Addison Lee, which was offset by a decrease in the taxi fleet size in Singapore. However, operating profit for this segment fell 25.2 per cent to S$53.9 million. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This decline was mainly attributed to lower revenue contributions in Singapore, alongside higher amortisation expenses of intangible assets arising from the A2B and Addison Lee acquisitions.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the second half, revenue from its other private transport segment grew 7.5 per cent to S$250.2 million, contributed by CMAC in the UK, but offset by lower contributions from Australia non-emergency patient transport. Operating profit for the segment came in at S$11.3 million, representing a 21.5 per cent drop from S$14.4 million in the second half of 2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, the group posted a 9.4 per cent improvement in earnings to S$230.3 million, from S$210.5 million. Its top line increased 13 per cent to S$5.1 billion, from S$4.5 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A final dividend of S$0.0459 per share has been proposed, which takes the total dividend for the year to S$0.0850 per share, inclusive of the interim dividend of S$0.0391 per share. This represents a payout ratio of 80 per cent of profit after tax and minority interests. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It will be paid on May 13, subject to shareholder approval.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Outlook</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">ComfortDelGro’s managing director and group CEO, Cheng Siak Kian, described crossing the S$5 billion revenue mark as a “defining milestone”, reflecting strong operational discipline and the focused execution of its international growth strategy. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue from outside the home market of Singapore expanded to 55.3 per cent of total revenue, up from 49.1 per cent the year before.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Rail fare increases granted by the Public Transport Council took effect from December 2025. The Tampines public bus package is scheduled for handover to a new operator from July 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">London public bus contract renewals are expected to continue at improved margins. The group is participating in ongoing Liverpool and West Yorkshire public bus franchise tenders, as well as the Copenhagen metro tender with RATP Dev. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In Australia, the new Metropolitan Zero Emission Bus franchises in Victoria that commenced in July 2025 will contribute in full in 2026, with industrywide shortage of bus drivers easing.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The business-to-consumer segment is expected to remain under pressure due to intense competition from ride-hailing companies. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group is also aggressively developing autonomous vehicle (AV) capabilities, aiming to transition 10 per cent of its point-to-point fleet to AVs by 2030. This involves scaling existing operations in China and Singapore, such as the Zig Driverless AV shuttle familiarisation programme and exploring pilot projects in London. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">ComfortDelGro’s shares closed at S$1.55, up 1.3 per cent or S$0.020, before its financial results were posted.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/comfortdelgro-h2-earnings-7-9-s124-3-million-full-year-revenue-crosses-s5-billion",
            "pub_date": "2026-02-27 18:01:33",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Land-betterment charges up 0.5% to 4.1% on average for commercial, residential, industrial, place of worship uses",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] The government has increased average land betterment charge (LBC) rates for commercial, residential, industrial and place or worship/civic and community institution uses for the six months starting Mar 1, 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, LBC rates remain unchanged for the hotel/hospital use group.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Developers pay an LBC for the right to enhance the use of some sites or to build bigger projects on them.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The rates are stated according to use groups across 118 geographical sectors in Singapore.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">LBC rates for commercial use have gone up by 0.5 per cent on average. Twenty out of the 118 geographical sectors will see increases of around 3 per cent to 4 per cent, with no  change for the remaining 98 sectors. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For landed residential use, LBC rates have risen by 4 per cent on average. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Rates have been upped for 93 sectors by around 3-10 per cent, with no changes in the other 25 sectors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For non-landed residential use, the increase is 4.1 per cent on average. LBC rates in 114 sectors have been raised by around 3 per cent to 23 per cent. There are no changes in the other four sectors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">LBC rates for industrial use have been raised by 3.2 per cent on average. All 118 sectors saw increases ranging from around 2 per cent to 9 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the place of worship, and civic and community institution use group, LBC rates have increased by 3 per cent on average for all 118 sectors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">LBC rates are announced twice a year, on Mar 1 and Sep 1, following a review by the Singapore Land Authority (SLA), in consultation with the taxman’s chief valuer (CV). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The LBC rates are based on the CV’s assessment of land values and take into consideration recent land sales.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The latest LBC rates announced on Friday (Feb 27) are for the Mar 1 to Aug 31, 2026 period.</p></div>",
            "link": "https://www.businesstimes.com.sg/property/land-betterment-charges-0-5-4-1-average-commercial-residential-industrial-place-worship-uses",
            "pub_date": "2026-02-27 17:50:34",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "What AI windfall? Debt will still weigh on big economies",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON] An AI productivity boom, if it materialises, may help buy major economies more time to clean up their strained public finances, economists say, although it won’t do the heavy lifting.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The stakes could not be higher. Debt is above 100 per cent of output across most rich economies and set to rise given ageing population costs, interest bills and pressure to spend more on defence and climate change.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">US policymakers are already optimistic on AI-driven growth and economists say the technology has the potential to shake the world out of a post-2008 productivity slump by boosting workers’ efficiency and freeing them to focus on more productive tasks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Higher economic growth would make government spending and debt loads potentially more manageable and help fend off scrutiny from bond vigilantes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">To sketch the impact on public finances if AI does boost labour productivity over the long term, the OECD and three high- profile economists shared early estimates with Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Filiz Unsal, the OECD’s deputy director of economic policy and research, said an AI productivity surge, were it to increase employment, would lower debt across OECD countries, from the US to Germany and Japan, by 10 percentage points from the roughly 150 per cent of output the organisation expects in 2036.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">That would still be a sharp rise from 110 per cent currently.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Much will depend on whether job creation eventually outweighs any job losses from automation, as well as whether firms pass on higher profits by raising wages and how governments manage their overall spending.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the US, two of the other economists projected debt rising more slowly to roughly 120 per cent over the next decade from around 100 per cent of output now in their best-case scenarios. One saw little change.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Productivity is like magic... It helps the fiscal dynamics dramatically,” said Idanna Appio, one of the economists, who was previously at the New York Federal Reserve and is now a fund manager at First Eagle Investment Management.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“But our fiscal problems are well beyond what productivity can fix,” Appio said.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Demographics to limit AI impact</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For now, ratings agency S&amp;P assumes no major public finance impact by the end of the decade.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The one (path) that the (US) administration is hoping for would be you get saved by the bell,” said Mark Patrick, head of macro and country risk at Teachers Insurance and Annuity Association of America, but added: that isn’t “something we can set our clocks by.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The economists did not provide estimates for other countries. However, AI could boost productivity in Britain in line with the US, but by half as much in Italy and Japan due to lower adoption rates and smaller sectors that could benefit from AI, OECD research has found.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ultimately, fiscal dynamics will determine how much AI-driven productivity can counterbalance rising debt. Demographics is the biggest challenge.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The root of the debt issue is with ageing demographics and the entitlements that are tied to that,” said Kevin Khang, who heads global economic research at Vanguard, the world’s second- largest asset manager.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Addressing it “requires getting the fiscal house in order and (AI is) just buying us the time,” he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Khang sees a scenario where AI boosts US growth to average 3 per cent through 2040 as most likely. The Fed sees potential growth around 2 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He estimates higher growth and tax revenues would slow US debt growth to around 120 per cent of output by the late 2030s. That’s much lower than the 180 per cent he foresees – higher than others – if AI disappoints, growth slows and market pressure raises borrowing costs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Bond investors have been quick to punish governments for fiscal largesse ever since bond yields rose sharply after the pandemic across rich economies.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Appio said declining US immigration added to the demographic challenge.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The labour shock offsets any (AI) productivity growth,” she said, but added she would be much more worried without AI.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Uncertainty around tax, spending</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Economy-wide productivity gains should raise revenues. But if AI reduces employment or competition, and profits and capital – often taxed less than labour – see most benefit, revenues could disappoint.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On the spending side, public sector efficiency gains could help costs, but the risk is spending rising alongside growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">That’s why Kent Smetters, director of the University of Pennsylvania’s Penn Wharton Budget Model analysis group, expects a tiny impact on US debt in a decade.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Even if growth is higher than he currently expects, that would still have little impact on curbing social security, which makes up a fifth of federal spending, because claims are indexed to average wages, Smetters said. Other labour costs the government covers would also rise if productivity raises private sector wages, he added.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It’s very important to see whether wages are going to increase,” the OECD’s Unsal said, adding that wage growth was more likely if AI doesn’t increase employment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">There are of course debt costs, which will depend on whether productivity raises real interest rates, a debate already emerging at the Fed, and how long growth outpaces any rise, economists said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Clearly, they don’t have crystal balls. A shock could quickly upend this debate.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A recession could mean “the AI boom may not come quick enough before the market gets nervous about the fiscal trajectory,” said Barclays’ global head of economics research Christian Keller. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/what-ai-windfall-debt-will-still-weigh-big-economies",
            "pub_date": "2026-02-27 17:50:35",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI boom will be no free pass for debt-laden major economies",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON] An AI productivity boom, if it materialises, may help buy major economies more time to clean up their strained public finances, economists say, although it won’t do the heavy lifting.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The stakes could not be higher. Debt is above 100 per cent of output across most rich economies and set to rise given ageing population costs, interest bills and pressure to spend more on defence and climate change.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">US policymakers are already optimistic on AI-driven growth and economists say the technology has the potential to shake the world out of a post-2008 productivity slump by boosting workers’ efficiency and freeing them to focus on more productive tasks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Higher economic growth would make government spending and debt loads potentially more manageable and help fend off scrutiny from bond vigilantes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">To sketch the impact on public finances if AI does boost labour productivity over the long term, the OECD and three high- profile economists shared early estimates with Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Filiz Unsal, the OECD’s deputy director of economic policy and research, said an AI productivity surge, were it to increase employment, would lower debt across OECD countries, from the US to Germany and Japan, by 10 percentage points from the roughly 150 per cent of output the organisation expects in 2036.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">That would still be a sharp rise from 110 per cent currently.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Much will depend on whether job creation eventually outweighs any job losses from automation, as well as whether firms pass on higher profits by raising wages and how governments manage their overall spending.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the US, two of the other economists projected debt rising more slowly to roughly 120 per cent over the next decade from around 100 per cent of output now in their best-case scenarios. One saw little change.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Productivity is like magic... It helps the fiscal dynamics dramatically,” said Idanna Appio, one of the economists, who was previously at the New York Federal Reserve and is now a fund manager at First Eagle Investment Management.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“But our fiscal problems are well beyond what productivity can fix,” Appio said.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Demographics to limit AI impact</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For now, ratings agency S&amp;P assumes no major public finance impact by the end of the decade.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The one (path) that the (US) administration is hoping for would be you get saved by the bell,” said Mark Patrick, head of macro and country risk at Teachers Insurance and Annuity Association of America, but added: that isn’t “something we can set our clocks by.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The economists did not provide estimates for other countries. However, AI could boost productivity in Britain in line with the US, but by half as much in Italy and Japan due to lower adoption rates and smaller sectors that could benefit from AI, OECD research has found.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ultimately, fiscal dynamics will determine how much AI-driven productivity can counterbalance rising debt. Demographics is the biggest challenge.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The root of the debt issue is with ageing demographics and the entitlements that are tied to that,” said Kevin Khang, who heads global economic research at Vanguard, the world’s second- largest asset manager.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Addressing it “requires getting the fiscal house in order and (AI is) just buying us the time,” he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Khang sees a scenario where AI boosts US growth to average 3 per cent through 2040 as most likely. The Fed sees potential growth around 2 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He estimates higher growth and tax revenues would slow US debt growth to around 120 per cent of output by the late 2030s. That’s much lower than the 180 per cent he foresees – higher than others – if AI disappoints, growth slows and market pressure raises borrowing costs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Bond investors have been quick to punish governments for fiscal largesse ever since bond yields rose sharply after the pandemic across rich economies.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Appio said declining US immigration added to the demographic challenge.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The labour shock offsets any (AI) productivity growth,” she said, but added she would be much more worried without AI.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Uncertainty around tax, spending</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Economy-wide productivity gains should raise revenues. But if AI reduces employment or competition, and profits and capital – often taxed less than labour – see most benefit, revenues could disappoint.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On the spending side, public sector efficiency gains could help costs, but the risk is spending rising alongside growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">That’s why Kent Smetters, director of the University of Pennsylvania’s Penn Wharton Budget Model analysis group, expects a tiny impact on US debt in a decade.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Even if growth is higher than he currently expects, that would still have little impact on curbing social security, which makes up a fifth of federal spending, because claims are indexed to average wages, Smetters said. Other labour costs the government covers would also rise if productivity raises private sector wages, he added.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It’s very important to see whether wages are going to increase,” the OECD’s Unsal said, adding that wage growth was more likely if AI doesn’t increase employment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">There are of course debt costs, which will depend on whether productivity raises real interest rates, a debate already emerging at the Fed, and how long growth outpaces any rise, economists said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Clearly, they don’t have crystal balls. A shock could quickly upend this debate.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A recession could mean “the AI boom may not come quick enough before the market gets nervous about the fiscal trajectory,” said Barclays’ global head of economics research Christian Keller. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/ai-boom-will-be-no-free-pass-debt-laden-major-economies",
            "pub_date": "2026-02-27 17:41:20",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "1,300 Toyota Prius units recalled in Singapore over rear doors that could open while car is moving",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Some 1,300 Toyota Prius cars are being recalled in Singapore over a fault in the rear electric doors, which can cause them to open while the car is in motion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Borneo Motors Singapore, the authorised distributor of Toyota here, is notifying the owners by post.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Based on information posted on the Land Transport Authority’s (LTA) electronic vehicle recall system, the rear doors of the popular hybrid car can unlock unexpectedly because of a short circuit caused by water entering the system.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In response to <em>The Straits Times</em>, Borneo Motors said on Friday (Feb 27) that the rectification involves modifying the left and right rear door switch circuits, to prevent the switch from activating if a short circuit occurs. A short circuit may happen if large amounts of water enter the rear door opener switch, such as during a car wash, after its seal – a protective barrier around the switch – degrades over time.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">If the door is shut with force, water may seep into the switch. Should the water contain detergent, it could trigger the switch and cause the rear doors to open.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Rectification work has already begun, and the repair can be completed within the same day. Owners will not be charged for the work.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While waiting for their appointments, customers can continue to drive their vehicles, said Borneo Motors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Borneo Motors said the fault will be rectified on new Prius cars before delivery to customers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It began selling the current version of the Prius in early 2024. Parallel importers started offering the model here in 2023.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Owners of parallel-imported cars can also contact Borneo Motors for help.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While the dealer did not indicate the specific batches of cars that are affected, the recall in the United States reportedly affects more than 142,000 Prius cars made between model years 2023 and 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Model year” refers to the way carmakers identify the specific version of a given car model, and may not correspond to an actual calendar year. Cars made in model year 2023, for example, would typically have been introduced some time in late 2022.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This latest Toyota Prius recall is similar to an earlier one in April 2024, also for rear doors that can open unexpectedly because of a short circuit. This was reported to have affected about 211,000 vehicles globally.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Borneo Motors said that after that recall, Toyota identified another set of circumstances that can cause the rear door switch to be activated, leading to the potential for the door to open while the car is being driven.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">LTA told ST on Feb 27 that vehicle manufacturers and motor dealers are responsible for identifying affected vehicles, notifying owners and arranging for safety-related defects to be fixed. <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.straitstimes.com/singapore/transport/1300-toyota-prius-cars-recalled-in-spore-after-rear-doors-found-at-risk-of-opening-while-moving\" target=\"_blank\">THE STRAITS TIMES</a></p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/1300-toyota-prius-units-recalled-singapore-over-rear-doors-could-open-while-car-moving",
            "pub_date": "2026-02-27 17:25:36",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sunway is willing to walk away if RM11 billion IJM bid rejected",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[KUALA LUMPUR] Sunway Bhd is prepared to walk away from its offer to acquire IJM Corp if the builder’s shareholders do not accept the conglomerate’s deal by the Apr 6 deadline, said Sunway founder Jeffrey Cheah.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“There’s no compulsion for the shareholders to sell to us,” Cheah told reporters on Friday (Feb 27). If IJM shareholders reject the offer, “we walk away,” he said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sunway in January offered to buy its smaller rival for RM11 billion (S$3.6 billion), a move that analysts said would allow the group to emerge as the largest property and construction conglomerate group in Malaysia. The offer has since drawn political scrutiny over concerns that it could dilute both the equity interests of the government and the rights of the nation’s indigenous majority. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A politician from a key member of Prime Minister Anwar Ibrahim’s ruling coalition said Malaysia’s majority Bumiputera group’s stakes in major corporations are “already limited” and the merger would reduce that further.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IJM’s operations came under scrutiny amid a probe by the Malaysian Anti-Corruption Commission and tax authorities after Sunway’s bid. The builder has refuted money laundering allegations. Its chairman was recently released from an overnight detention by Malaysian anti-graft officials.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We are doing it just for commercial purposes. We find that it is an attractive vehicle to have,” Cheah said of Sunway’s offer. It is a transaction between a “willing buyer, willing seller,” he said. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/property/sunway-willing-walk-away-if-rm11-billion-ijm-bid-rejected",
            "pub_date": "2026-02-27 17:20:39",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Malaysia to decide on MACC inquiry after probe on chief is done",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[KUALA LUMPUR] Malaysia will decide whether to establish a Royal Commission of Inquiry to investigate allegations of wrongdoing at the country’s anti-graft agency after a committee investigating the shareholdings of the commission’s chief submits a separate report next week.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Cabinet will make the decision after the committee, which is led by the attorney general, issues its findings into reports that Malaysian Anti-Corruption Commission Chief Commissioner Azam Baki held shares that were above the allowed limits for public officials, Communications Minister Fahmi Fadzil said at a press conference in Putrajaya on Friday (Feb 27). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The move comes after Bloomberg News published two reports this month that caused an outcry in the country. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The second one contained allegations that a group of businessmen nicknamed the “corporate mafia” was working with MACC officials to oust executives and take over companies, which the anti-graft agency has strongly denied. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/malaysia-decide-macc-inquiry-after-probe-chief-done",
            "pub_date": "2026-02-27 17:05:38",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How Budget 2026 should affect Singaporean wallets",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHEN Singapore Budget 2026 was unveiled on Feb 12, the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/budget-2026-highlights-ai-champions-foreign-worker-policy-tweaks-more-cdc-vouchers\" target=\"_blank\">headline numbers</a> caught attention. For individuals, in particular: Community Development Council (CDC) Vouchers, cost-of-living payouts and education credits. But beneath the surface lies a deeper message. One that does not show up on the balance sheet yet will determine the financial futures of millions of Singaporeans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This Budget arrives in a world where artificial intelligence (AI) is reshaping careers, living costs still matter and family-building gets expensive fast. More than a fiscal document, the Budget quietly, but powerfully, challenges each of us to upgrade our money mindset alongside the nation’s economy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here’s why every young career starter, aspiring parent and middle-class professional should read the Budget with as much interest as the next smartphone launch.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/how-budget-2026-should-affect-singaporean-wallets",
            "pub_date": "2026-02-27 17:00:46",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SAP’s new bonus system sparks outcry over rewards for underperforming bosses",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BERLIN] SAP’s new bonus system ended up rewarding underperforming managers while holding lower-ranking workers to a higher standard for their payouts, prompting an outcry from employees and leaders alike at the German software company, people familiar with the matter said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP has since set aside millions of euros to appease angered staff and improve the new global system, which wound up rewarding senior-level employees who did not meet all expectations in their roles, according to documents reviewed by Bloomberg and people familiar with the situation. The people asked not to be identified because the matter isn’t public. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The compensation programme riled SAP employees, who have already signalled in surveys that they are losing trust in the company’s executive board amid job cuts and a restructuring process that dragged on for months. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As artificial intelligence tools threaten traditional enterprise software models, SAP’s stock has lost about 135 billion euros (S$201.7 billion) in value after reaching an all-time-high a year ago. SAP reported on Thursday (Feb 26) that chief executive officer Christian Klein made 16.2 million euros in 2025, about 14 per cent below his compensation a year earlier. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP confirmed that it had introduced a new performance-based compensation framework. During the rollout, the firm “identified additional areas for refinement related to stock-based compensation for non-executives,” a company spokesperson said. The topics were reviewed and addressed “to the extent possible prior to the process finalisation,” he added, saying that “fair and competitive compensation for performance is a priority for SAP.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Klein had set a goal of overhauling the employee reward system in 2023 to better incentivise high performance. He put chief people officer Gina Vargiu-Breuer in charge of the development of the new stock incentive plan, which was rolled out to employees this month, two of the people said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Klein told Vargiu-Breuer’s team to rework the system after employees and managers complained that it was unfair, the two people said. The fallout could threaten her future at the company after her contract ends in early 2027, they said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“As is standard practice, SAP does not comment on individual personnel or contractual matters,” a company spokesperson said by email. Gina Vargiu-Breuer did not respond to a request for comment sent through SAP.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP categorised its general staff in five levels, ranging from the lowest (T1) to managers or senior employees (T5), the documents reviewed by Bloomberg show. While the three bottom ranks had to surpass expectations to receive stock-based bonuses, T4 and T5 employees who did not meet all their benchmarks still qualified for incentives, according to the documents and people familiar with the situation. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP has seen high executive board turnover in the past six years, and several contracts were terminated prematurely, costing the firm millions of euros in payouts. Klein’s co-CEO Jennifer Morgan left after months in the role in 2020. Starting in 2023, chief financial officer Luka Mucic and executive board members Sabine Bendiek, Scott Russell, Julia White and Jürgen Müller also departed. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Separately, Muhammad Alam, who leads product engineering, does not plan to renew his contract when it ends next year, the people said. Alam did not respond to a request for comment, and SAP declined to comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In an internal survey in November, 59 per cent of employees said they trusted the executive board, down six percentage points from half a year earlier, according to an internal email sent by Vargiu-Breuer and seen by Bloomberg News. In April 2021, more than 80 per cent of employees said they trusted the executive team.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The turnover at the top level has added another layer of instability as SAP works to rearrange its business around the threats of the new AI era. Some early users of the company’s flagship AI assistant, Joule – designed to help users navigate complex SAP systems and make tasks like coding easier – have been disappointed, customers and partners have said, asking to not be identified discussing their relationship with the vendor. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/saps-new-bonus-system-sparks-outcry-over-rewards-underperforming-bosses",
            "pub_date": "2026-02-27 17:00:47",
            "source": "businesstimes",
            "kind": 1,
            "language": "en"
        }
    ]
}