{
    "data": [
        {
            "title": "Singapore expands rent subsidies for SMEs",
            "description": "<div class=\"nf__description\">\n<p><strong>FM Wong tackles SME squeeze with new rent subsidies for 99% of Singapore firms.</strong></p><p>The government is expanding schemes that subsidise rental payments for qualifying <a href=\"https://sbr.com.sg/markets/news/global-expansion-tops-sme-agenda-amidst-market-volatility-dbs-finds\" rel=\"noopener dofollow\">small and medium-sized enterprises</a> (SMEs), helping them maintain operations while managing operational costs with a particular focus on rental expenses.</p><p>During the Budget Debate Round-Up Speech, Finance Minister Lawrence Wong reaffirmed the government's commitment to helping SMEs, which remain a cornerstone of Singapore’s economy, accounting for over 99% of enterprises and two-thirds of total employment.</p><p>By targeting rental relief, the government aims to protect jobs, preserve business continuity, and support the SME sector's post-pandemic recovery.</p><p>The Budget also includes incentives for landlords to offer reduced rents to small tenants, creating a shared responsibility framework between property owners and the state.</p><p>Officials noted that these measures complement broader initiatives, such as enhanced digitalisation grants, workforce upskilling programs, and business transformation support, all designed to strengthen SME resilience in a competitive market</p><p>With rental support front and centre, SMEs in Singapore are expected to have more flexibility to invest in growth, retain talent, and navigate market uncertainties.</p>\n</div>",
            "link": "https://sbr.com.sg/economy/news/singapore-expands-rent-subsidies-smes",
            "pub_date": "2026-02-27 17:56:02",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MAS forecasters lift 2026 growth to 3.6%",
            "description": "<div class=\"nf__description\">\n<p><strong>MAS March survey shows GDP forecast jumps to 3.6% after 6.9% Q4 2025 growth.</strong></p><p>Singapore’s economy is projected to grow 3.6% in 2026, according to the <a href=\"https://sbr.com.sg/economy/news/mas-hikes-inflation-forecast-1-2-it-holds-monetary-policy\" rel=\"noopener dofollow\">Monetary Authority of Singapore’s</a> (MAS) March 2026 Survey of Professional Forecasters.</p><p>The median forecast marks an increase from 2.3% in the December 2025 survey, reflecting higher expectations for manufacturing and wholesale and retail trade.</p><p>The economy expanded 6.9% year-on-year (YoY) in the fourth quarter of 2025, above the forecast in the previous survey, with GDP for the first quarter of 2026 projected at 5.8% YoY, whilst growth for 2027 is expected at 2.5%.</p><p>Inflation is projected to remain modest, with the median forecast for CPI-All Items at 1.5% and MAS Core Inflation at 1.5% for 2026.</p><p>The overall unemployment rate is expected to remain at 2.1% by the end of the year.</p><p>For 2027, both CPI-All Items and MAS Core Inflation are projected at 1.7%.</p><p>Monetary policy expectations indicate that 47% of respondents anticipate an increase in the slope of the S$NEER policy band in April 2026, whilst no changes are expected to the band’s width or central level.</p><p>The exchange rate is projected at 1.25 Singapore dollars per US dollar, the average SORA is expected at 1.3% per annum, and bank loans are forecast to grow 4.8% by year-end.</p><p>The survey gathered responses from 22 economists and analysts who closely monitor the Singapore economy.</p><p>Geopolitical risks, including escalation in trade tensions and wars, were the most cited downside risks to the country's economic performance.</p><p>\"Respondents also flagged the burst of the Artificial Intelligence (AI) bubble, with spillovers to financial markets, and external economic slowdown, as potential risks,\" the report stated.</p><p>\"More respondents cited a sustained AI-led tech cycle upturn as an upside risk to Singapore’s economic outlook, identified by 94% of respondents. Respondents also pointed to resilient global growth and easing of trade tensions as key upside risks,\" it added.</p>\n</div>",
            "link": "https://sbr.com.sg/economy/news/mas-forecasters-lift-2026-growth-36",
            "pub_date": "2026-02-27 15:55:47",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Soilbuild profit sky-rockets 139% as order book hits $1.1b",
            "description": "<div class=\"nf__description\">\n<p><strong>Net profit rises to $63.6M in FY2025 as revenue jumps 50.8%, enabling higher dividends.</strong></p><p><a href=\"https://sbr.com.sg/building-engineering/news/soilbuild-bags-158m-new-construction-and-precast-contracts\" rel=\"noopener dofollow\">Soilbuild Construction Group Ltd</a> posted a net profit after tax of $63.6m for the full year ended 31 December 2025 (FY 2025), more than doubling from the $26.6m in FY 2024, according to the company’s announcement on 26 February 2026.</p><p>Earnings per share (EPS) for FY2025 was 5.28 cents, compared with 2.21 cents in FY 2024.</p><p>Revenue rose 50.8% to $590.7m, supported by the Construction division, which contributed $476.6m, and Precast &amp; Prefabrication, which generated $111.7m.</p><p>Elsewhere, gross profit doubled to $93.2m, with a gross margin of 15.8%.</p><p>The company reported cash and cash equivalents of $153.3m and total assets of $408.8m as of 31 December 2025 whilst net cash generated from operating activities was $157.0m.</p><p>The order book stood at approximately $1.07b, including contracts secured since FY2024, providing revenue visibility for future periods.</p><p>The company proposed a final dividend of 2.5 cents per share, bringing the total dividend payout for FY2025 to 31.2% of net profit.</p>\n</div>",
            "link": "https://sbr.com.sg/building-engineering/news/soilbuild-profit-sky-rockets-139-order-book-hits-11b",
            "pub_date": "2026-02-27 15:15:56",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "First Resources' net profit rises 44% to $446m in FY2025",
            "description": "<div class=\"nf__description\">\n<p><strong>The board has proposed a final dividend of 10.20 cents per share.</strong></p><p><a href=\"https://sbr.com.sg/news/first-resources-sells-west-papua-subsidiaries\">First Resources Limited</a> reported a 44% increase in net profit to $446m (US$353.9m) for the 12 months ended 31 December 2025 (FY2025), up from $309.7m (US$245.8m) in FY2024.</p><p>Underlying net profit rose 56.5% to $451.3m (US$358.2m), compared with $288.3m (US$228.8m) a year earlier.</p><p>Revenue grew 59.9% to $2.09b (US$1.66b) in FY2025 from $1.31b (US$1.04b).</p><p>Gross profit increased 56.1% to $876.6m (US$695.7m), whilst EBITDA climbed 54.1% to $774.8m (US$614.9m).</p><p>The board has proposed a final dividend of 10.20 cents per share. Total dividends for FY2025 amounted to 14.70 cents per share.</p><p>$1 = US$0.79</p>\n</div>",
            "link": "https://sbr.com.sg/agribusiness/news/first-resources-net-profit-rises-44-446m-in-fy2025",
            "pub_date": "2026-02-27 15:10:55",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Golden Agri's FY 2025 profit jumps 10% to $506m",
            "description": "<div class=\"nf__description\">\n<p><strong>FY2025 profit rises to $506m as upstream EBITDA grows 25% despite extra costs.</strong></p><p><a href=\"https://sbr.com.sg/agribusiness/news/golden-agri-resources-net-profit-29-yoy-in-9m\" rel=\"noopener dofollow\">Golden Agri-Resources</a> (GAR) reported profit attributable to owners of the Company of $506.0m (US$400m) for 2025, up 10% from the previous year, as revenue reached a record $16.4b (US$12.95b), a 19% increase.</p><p>Earnings per share (EPS) improved in line with the higher PAT, reflecting stronger returns for shareholders.</p><p>Underlying profit, which excludes non-operational items such as foreign exchange effects and depreciation of bearer plants, rose 25% to $660.3 (US$522m).</p><p>EBITDA grew 14% to $1.6b (US$1.3b), while the plantations and palm oil mills segment drove upstream EBITDA 25% higher to $896.8 (US$709m) on stronger crude palm oil and palm kernel prices.</p><p>The downstream business, which includes processing and merchandising palm and oilseed products, recorded revenue of $16.2b (US$12.8b) and EBITDA of $695.7 (US$550m), with sales volumes rising 3%.</p><p>GAR’s board has proposed a final dividend of 0.952 Singapore cents per share, an 18% increase, subject to shareholder approval.</p><p>The company also continued sustainability and smallholder programmes in Indonesia, methane capture projects, and operational efficiency initiatives to support long-term growth.<br/> </p>\n</div>",
            "link": "https://sbr.com.sg/agribusiness/news/golden-agris-fy-2025-profit-jumps-10-506m",
            "pub_date": "2026-02-27 15:00:50",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Uni-Asia swings to $1.16m profit as total income rises",
            "description": "<div class=\"nf__description\">\n<p><strong>Investment gains drive the company’s profit rebound.</strong></p><p><a href=\"https://sbr.com.sg/shipping-marine/news/uni-asia-rebounds-in-h1\" rel=\"noopener dofollow\" target=\"_blank\">Uni-Asia Group</a> reported a net profit of $1.16m (US$0.92m) for the fiscal year ended 31 December 2025, according to its financial statement.</p><p>Basic and diluted earnings per share reached 1.47 Singapore cents (1.17 US cents). Total income rose to $62.87m (US$49.9 m), driven by investment returns of $7.43m (US$5.9 m) and the absence of non-cash fair value losses recorded in 2024.</p><p>Investment returns included gains from ship joint investment projects and the sale of property assets in Japan, the statement said.</p><p>The company also recorded a profit after tax of $1.01m (US$0.8 m), following a net loss of $35.53m (US$28.2 m), according to its financial statement.</p><p>Operating expenses decreased to $55.82m (US$44.3 m). The final dividend was 1.0 Singapore cent per share, bringing the total dividend for 2025 to 2.0 Singapore cents per share.</p><p>Charter income declined as the group implemented a fleet renewal programme. In 2025, the company acquired four vessels and sold all remaining 29k DWT vessels, exiting the Handysize segment.</p><p>The MV Glengyle remained off-hire from April 2025 following a collision and is scheduled to return to service in April 2026.</p><p>Total assets and borrowings increased to fund vessel acquisitions and Japan property projects, whilst the company sold two projects in 2025, compared to three in 2024.</p><p>The group also reported a cybersecurity incident during the year. Whilst it had no impact on its financial position or operations, external advisers are reviewing systems to recommend changes to the security framework.</p><p><em>(US$1 = SG$1.26)</em></p>\n</div>",
            "link": "https://sbr.com.sg/markets-investing/news/uni-asia-swings-116m-profit-total-income-rises",
            "pub_date": "2026-02-27 14:30:51",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thakral Corporation FY2025 net profit rises five-fold to $170.9m",
            "description": "<div class=\"nf__description\">\n<p><strong>Revenue rose 42% year-on-year to $411.3m.</strong></p><p><a href=\"https://sbr.com.sg/markets-investing/news/thakral-profit-surges-195m-strong-investment-and-lifestyle-segment\">Thakral Corporation Ltd</a> reported a net profit attributable to shareholders of $170.9m for the 12 months ended 31 December 2025 (FY2025), up 493% from $28.8m a year earlier.</p><p>Revenue rose 42% year-on-year to $411.3m, according to the group’s press release.</p><p>Meanwhile, revenue from the lifestyle segment increased 29% to $352.1m.</p><p>The board has declared a second interim dividend of 3.5 cents per share, bringing total dividends for FY2025 to 6.5 cents per share.</p>\n</div>",
            "link": "https://sbr.com.sg/markets-investing/news/thakral-corporation-fy2025-net-profit-rises-five-fold-1709m",
            "pub_date": "2026-02-27 14:10:53",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singlife launches universal life plan with income linked to global indices",
            "description": "<div class=\"nf__description\">\n<p><strong>The plan has a built-in floor rate of 0.00% per annum.</strong></p><p><a href=\"https://sbr.com.sg/news/mufg-and-singlife-seal-landmark-550m-insurance-financing-deal\">Singlife </a>has launched a whole-of-life, non-participating universal life plan that combines growth potential with flexible income options.</p><p>The Singlife Legacy Indexed Income plan provides an income stream linked to the performance of five selected indices, the group said in a press release.</p><p>These include the S&amp;P 500 Index, S&amp;P 500 Engle 8% VT TCA Index, Nasdaq-100 Engle 8% Index, UBS Global Multi Asset Engle 8% Index, and UBS Gold Engle 8% Index.</p><p>The plan has a built-in floor rate of 0.00% per annum to prevent negative returns in volatile market conditions.</p><p>According to Singlife, policyholders receive income during each policy year in the payout period based on the performance of the chosen indices, up to a target annual income.</p><p>Meanwhile, additional gains within the same year are automatically reinvested to support the continued growth of the policy value.</p><p>The plan also provides a guaranteed loyalty bonus of 0.7% per annum on the Index Account from the eleventh policy year onwards.</p>\n</div>",
            "link": "https://sbr.com.sg/insurance/news/singlife-launches-universal-life-plan-income-linked-global-indices",
            "pub_date": "2026-02-27 13:05:51",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Savills offers Chinatown shophouses with income-generating tenants",
            "description": "<div class=\"nf__description\">\n<p><strong>The shophouses at 277/279 South Bridge Road total 8,259 sq ft.</strong></p><p><a href=\"https://sbr.com.sg/markets-investing/news/savills-singapore-acquires-majority-stake-in-alpina-40m\" rel=\"noopener dofollow\">Savills Singapore</a> launched for sale a pair of adjoining refurbished shophouses at 277/279 South Bridge Road in the Chinatown Conservation Area.</p><p>The properties sit on a combined 2,847 sq ft of land with a total built-up area of 8,259 sq ft, zoned “Commercial” under the Master Plan 2025.</p><p>The shophouses feature marble flooring and high-quality finishes and are sold with existing tenants, including F&amp;B operator Gunkee.</p><p>South Bridge Road has evolved into a lifestyle and heritage corridor, hosting tenants such as The Great Room, ST Signature, and Tong Heng, alongside established F&amp;B brands like Ya Kun Kaya Toast.</p><p>The properties benefit from prominent street frontage, high pedestrian traffic, and proximity to Chinatown and Maxwell MRT stations.</p><p>According to Ms. Yap Hui Yee, Executive Director, Investment Sales &amp; Capital Markets, SAVILLS Singapore, the shophouses’ location bridges Chinatown with the Central Business District and offers a stable income stream.</p><p>The sale is open to both local and foreign buyers, with no Seller’s Stamp Duty or Additional Buyer’s Stamp Duty, via an Expression of Interest closing 1 April 2026 at 3 p.m.<br/> </p>\n</div>",
            "link": "https://sbr.com.sg/commercial-property/news/savills-offers-chinatown-shophouses-income-generating-tenants",
            "pub_date": "2026-02-27 13:05:51",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "All GST-registered firms face mandatory InvoiceNow shift by 2031",
            "description": "<div class=\"nf__description\">\n<p><strong>Funding of up to $5,000 will be provided to support the transition.</strong></p><p>All goods and services tax (GST)-registered businesses will be required to onboard the InvoiceNow network and submit invoice data directly to the <a href=\"https://sbr.com.sg/news/government-grants-one-off-property-tax-rebate-2026-bills-approach\">Inland Revenue Authority of Singapore (IRAS)</a> by 2031.</p><p>Announced at the Ministry of Finance Committee of Supply (COS) Debate 2026, the initiative will roll out from April 2028.</p><p>Transitional funding will be provided to offset onboarding costs, with small and medium-sized enterprises (SMEs) eligible for up to $1,000 and larger businesses up to $5,000. SMEs can also access InvoiceNow-Ready solutions for free until Mar 2031.</p><p>From 1 April, all new voluntary GST registrants must submit their invoice data via the network, regardless of incorporation date or business structure, IRAS said in a press release.</p><p>The COS 2026 announcement extends the requirement to all remaining GST-registered businesses, bringing an estimated 90,000 more businesses onto the network.</p><p>The InvoiceNow network enables businesses to send and receive invoices in a structured digital format, based on the international Peppol standard.</p><p>Since 1 November 2025, newly incorporated companies that voluntarily register for GST have been required to transmit invoice data via InvoiceNow.</p><p>IRAS said over 63,000 businesses are currently in the network using services from accredited providers.</p>\n</div>",
            "link": "https://sbr.com.sg/economy/news/all-gst-registered-firms-face-mandatory-invoicenow-shift-2031",
            "pub_date": "2026-02-27 12:50:53",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        }
    ]
}