{
    "data": [
        {
            "title": "Sabana Industrial REIT completes solar project with Keppel EaaS",
            "description": "<div class=\"nf__description\">\n<p><strong>The project installed solar panels on nine of the REIT’s properties.</strong></p><p><a href=\"https://sbr.com.sg/commercial-property/news/sabana-industrial-reit-2024-dpu-36-yoy-00286\">Sabana Industrial REIT</a> has completed its dual-phase project with Keppel’s Energy-as-a-Service arm (Keppel EaaS) to install solar panels atop nine of the REIT’s properties.</p><p>The project was completed in two phases. Phase 1 installed solar panels at 10 Changi South Street 2, 34 Penjuru Lane, 3A Joo Koon Circle, and Sabana@1TA4.</p><p>Phase 2 involved 2 Toh Tuck Link, 8 Commonwealth Lane, 23 Serangoon North Avenue 5, 39 Ubi Road 1, and 51 Penjuru Road. Four of these properties currently contribute about two-thirds of the total output, led by 34 Penjuru Lane.</p><p>In total, these properties have an overall installed capacity of 7.6 Megawatt peak (MWp) that will potentially generate more than 9,000 Megawatt-hours (MWh) per year, which is sufficient to power over 2,700 three-room HDB flats for a year.</p>\n</div>",
            "link": "https://sbr.com.sg/energy-offshore/news/sabana-industrial-reit-completes-solar-project-keppel-eaas",
            "pub_date": "2025-02-05 11:01:05",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CICT’s NPI up 1.3% YoY in H2 2024",
            "description": "<div class=\"nf__description\">\n<p><strong>DPU for FY2024 rose 1.2% YoY to $0.1088.</strong></p><p>CapitaLand Integrated Commercial Trust (CICT) registered a 6.4% year-on-year (YoY) growth in distributable income to $385.7m in H2 2024 from $362.5m in H2 2023.</p><p>This growth was driven by the acquisition of a <a href=\"https://sbr.com.sg/markets-investing/news/cict-completes-acquisition-50-stake-in-ion-orchard\">50.0% interest in ION Orchard</a>, strong performance in existing operating properties, and management of operating and interest costs.</p><p>Despite the divestment of 21 Collyer Quay on 11 November 2024, which partially offset gains during the period, net property income (NPI) rose 1.3% y-o-y to $571.1m.</p><p>Distribution per unit (DPU) for the period remained stable at $0.0545, comprising an advanced distribution of $0.0216 from 1 July to 11 September 2024, which was paid on 17 October 2024. For FY 2024, CICT achieved a DPU of $0.1088, up 1.2% YoY.</p><p>The record date for the remaining DPU of $0.0329 is set for February, and unitholders can expect to receive it on 21 March.</p><p>As of 31 December 2024, CICT’s committed portfolio occupancy stood at 96.7%. Its retail portfolio stood at 99.3% whilst its office and integrated development portfolios rose to 94.8% and 98.9%, respectively.</p><p>“In 2025, we remain committed to driving sustainable growth through active portfolio management and disciplined cost and capital management. We will also capitalise on growth opportunities while staying agile and responsive to market changes,” Teo Swee Lian, chairman of CITC’s manager said.</p>\n</div>",
            "link": "https://sbr.com.sg/markets-investing/news/cicts-npi-13-yoy-in-h2-2024",
            "pub_date": "2025-02-05 11:01:05",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore deploys unmanned surface vessels for maritime security",
            "description": "<div class=\"nf__description\">\n<p><strong>These conduct patrols alongside manned ships.</strong></p><p>The Republic of Singapore Navy has announced that its Maritime Security Unmanned Surface Vessels (MARSEC USVs) have begun operational patrols in January 2025, helping manned ships in ensuring the security of the city-state's waters.</p><p>According to the government, the USVs, which can be operated by a two-man crew, were developed with the Defence Science &amp; Technology Agency and Defence Science Organisation National Laboratories. These are 16.9 metres long and have a speed in excess of 25 knots.</p><p>The vessels conduct patrols and can also investigate and interdict suspicious vessels, allowing Littoral Mission Vessels to focus on more complex missions.</p><p>These also use technologies, such as the Collision Detection and Collision Avoidance (CDCA) algorithm, that enable autonomous operations in congested maritime environments. The said system integrates the USV’s perception and navigation sensors, as well as collision detection equipment used for maritime navigation with an algorithm designed for the Navy’s operations.</p><p>“This rules-based system automates the collision avoidance decision-making process while ensuring that the USVs exhibit avoidance behaviour that complies with the Convention on the International Regulations for Preventing Collisions at Sea,” authorities said.</p><p>The CDCA algorithm was tested in trials and completed over 12 million kilometres of simulated distance with zero collisions, equivalent to 26 years of real-world testing. The USVs have also clocked over 1000 hours of real-world autonomous operations, with zero need for human intervention.       </p>\n</div>",
            "link": "https://sbr.com.sg/news/singapore-deploys-unmanned-surface-vessels-maritime-security",
            "pub_date": "2025-02-05 10:40:55",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "STI's year-end target maintained at 3950",
            "description": "<div class=\"nf__description\">\n<p><strong>It is expected to move sideways as tariff uncertainties resurface.</strong></p><p>The Straits Times Index (STI) <a href=\"https://sbr.com.sg/stocks/news/singapores-sti-projected-hit-3950-2025-strong-bank-performance-dbs\">year-end target</a> remains at 3950 despite renewed tariff uncertainties and shifting market dynamics, DBS reported.</p><p>Whilst the index has gained 6.3% since the US Presidential election, analysts expect it to trade sideways as investors focus on the upcoming 4Q24/FY24 earnings season and President Trump’s policy direction.</p><p>The Singapore Budget 2025 and recent General Election developments are unlikely to have a significant market impact.</p><p>Analysts favour Sembcorp Industries, AEM Holdings, DFI Retail, and iFAST ahead of earnings season. Sembcorp is expected to deliver strong results and positive guidance, whilst AEM’s 4Q24 performance should set the tone for FY25.</p><p>Meanwhile, DFI Retail could see upside from its Yonghui disposal proceeds, and iFAST is positioned for further pension business growth. Conversely, caution is advised on SIA, Genting Singapore, and SATS due to potential headwinds.</p><p>Market skepticism surrounds President Trump’s latest tariff moves, which may be used to offset tax cuts.</p><p>\"Tariffs will be a key source of funding for the Trump administration to balance the<br/>anticipated tax cuts,\" the report said.</p><p>The “Trump trade” has resulted in fewer rate cut expectations, higher treasury yields, and a stronger USD. Stocks expected to benefit include UOB, ST Engineering, ComfortDelGro, Seatrium, Venture, and Frencken, while REITs like FCT, CICT, and MINT could gain as market sentiment shifts.</p><p>Moreover, analysts highlighted stocks with resilient earnings, including ST Engineering, backed by a strong order backlog and potential defense spending increases.</p><p>Sheng Siong may also attract interest as cost-of-living concerns rise ahead of Budget 2025. ThaiBev’s improving fundamentals and Singtel’s potential from sector consolidation are also key investment themes for the year.</p>\n</div>",
            "link": "https://sbr.com.sg/stocks/news/stis-year-end-target-maintained-3950",
            "pub_date": "2025-02-05 10:30:55",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore tourism grows with China-led visitor surge in 2024",
            "description": "<div class=\"nf__description\">\n<p><strong><meta content=\"uuidOpqJuNzQaOpN\" name=\"uuid\"/>The surge was due to the 30-day mutual visa exemption with Mainland China</strong></p><p>Singapore’s International Visitor Arrivals (IVA) increased by 21% year-on-year (YoY) from 16.5 million in 2023, the Singapore Tourism Board (STB) reported.</p><p>Visitors from Mainland China led inbound tourism with 3.08 million arrivals, followed by Indonesia (2.49 million), and India (1.20 million).</p><p>STB attributed this surge to the <a href=\"https://sbr.com.sg/hotels-tourism/news/singapore-china-set-30-day-visa-free-travel-arrangement\">30-day mutual visa exemption with Mainland China</a>, Singapore’s strong growth in air connectivity, and the increase in Changi Airport’s total international seat capacity to over 41 million in 2024.</p><p>Tourism Receipts (TR) in 9M2024 reached $22.4b, rising 10% YoY with all spend categories recording YoY growth.</p><p>The growth was driven by Sightseeing, Entertainment &amp; Gaming (SEG) at 25%, followed by Accommodation (+17%). Food &amp; Beverage (F&amp;B) and Shopping rose by 6% and +5%, respectively, whilst other categories, including airfares and business spending, also contributed to TR.</p><p>Of these receipts, $3.58b came from Mainland China, $2.13b from Indonesia, and $1.44b from Australia, excluding SEG.</p><p>In addition, this surge in tourism also created jobs for locals. According to STB, as of September 2024, the total tourism workforce has recovered to around 76,000 which is about 4% higher YoY.</p><p>“Our Tourism 2040 roadmap will guide our efforts to drive the next phase of quality tourism growth for Singapore. This will ensure Singapore continues to thrive as a world-class destination that meets the needs of the evolving global traveler,” Melissa Ow, chief executive of STB said.</p>\n</div>",
            "link": "https://sbr.com.sg/hotels-tourism/news/singapore-tourism-grows-china-led-visitor-surge-in-2024",
            "pub_date": "2025-02-05 10:20:49",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore banks see 90% client losses due to onboarding delays",
            "description": "<div class=\"nf__description\">\n<p><strong>Singaporean banks have been experiencing the highest client losses worldwide due to Know Your Customer (KYC) inefficiencies. </strong></p><p>Nearly 90% of <a href=\"https://sbr.com.sg/financial-services/in-focus/sg-banks-report-softer-earnings-q4\">banking</a> executives in Singapore report losing clients due to delays and inefficiencies in the onboarding process, marking a 35% increase from 2023, according to Fenergo.</p><p>Fenergo said Singaporean banks have been experiencing the highest client losses worldwide due to Know Your Customer (KYC) inefficiencies. Financial institutions are under mounting pressure to comply with stricter Anti-Money Laundering (AML) regulations that took effect in 2024.</p><p>While banks in the US, UK, and Japan are also facing similar challenges, Singapore has emerged as a hotspot for compliance breakdowns, highlighting the urgent need for reform.</p><p>Regulatory and financial consequences are compounding the crisis. 91% of financial institutions now attribute high client abandonment rates to poor data management and siloed workflows.</p><p>Additionally, 79% of banking executives point to manual KYC processes as a major bottleneck that disrupts customer experience and slows down business operations. A further 47% blame outdated compliance infrastructure, which hinders digital transformation and contributes to inefficiencies.</p><p>In response to these challenges, some banks are turning to AI and automation to improve KYC processes. 38% of financial institutions plan to implement AI-driven solutions to streamline compliance workflows, enhance verification accuracy, and reduce onboarding times.</p><p>Another 30% aim to improve data accuracy using AI-powered compliance tools, signaling a gradual shift toward technology-driven regulatory solutions.<br/> </p>\n</div>",
            "link": "https://sbr.com.sg/news/singapore-banks-see-90-client-losses-due-onboarding-delays",
            "pub_date": "2025-02-05 09:55:48",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore’s tech funding drops 56% to $2.1b in 2024: report",
            "description": "<div class=\"nf__description\">\n<p><strong>Despite the decline, Singapore remained the 11th highest-funded country globally, surpassing Japan and Australia.</strong></p><p>Singapore’s <a href=\"https://sbr.com.sg/exclusive/chatgpt-effect-investors-bet-big-deep-tech-startups\">tech startups </a>raised $2.1b in 2024, marking a 56% decline from $4.8b in 2023 and a 74% drop from $8.1b in 2022, Tracxn reported.</p><p>Despite the decline, Singapore remained the 11th highest-funded country globally, surpassing Japan and Australia.</p><p>Tracxn said also revealed investment trends showed a significant drop across all funding stages. Late-stage funding experienced the steepest decline, falling 74.71% to $708m from $2.8b in 2023.</p><p>Seed-stage investments also dropped 50.6% to $310m, whilst early-stage funding saw a 15.38% decrease, totaling $1.1b in 2024.</p><p>Sector-wise, FinTech remained the dominant industry, securing $1b, but still saw a 15% decline from 2023 and a 71% drop from 2022.</p><p>High Tech was the only sector that showed growth, with funding increasing 4% to $884m, though it remained 67% lower than 2022 levels. Enterprise Applications struggled, with investments falling 29% from 2023, amounting to $597m in 2024.</p><p>Singapore’s tech funding landscape remained centered in the city-state itself, with 100% of the investments going to Singapore-based companies.</p><p>On a global scale, Singapore’s $2.1b in funding ranked it 11th worldwide, significantly trailing behind leading tech ecosystems such as the United States ($155.9b), United Kingdom ($14.0b), China ($11.8b), and India ($11.6b).</p><p> </p>\n</div>",
            "link": "https://sbr.com.sg/information-technology/news/singapores-tech-funding-drops-56-21b-in-2024-report",
            "pub_date": "2025-02-05 09:55:49",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Daily Markets Briefing: STI down 0.13%; Top stock is DFIRG USD",
            "description": "<div class=\"nf__description\">\n<p><strong>DFIRG USD is the top stock with a 2.19% increase.</strong></p><p>The Straits Times Index (STI) closed at 3,821.480 down 0.13% Tuesday, 4 February, at 5:21 p.m.</p><p>DFIRG USD is the most active <a href=\"https://sbr.com.sg/stocks/news/daily-markets-briefing-sti-down-07-top-stock-wilmar-intl\">stock</a>, followed by CapitaLandInvest (+1.65%) and Mapletree Ind Tr (+0.95%).</p><p>Mapletree Log Tr and JMH USD were at the foot.<br/> </p>\n</div>",
            "link": "https://sbr.com.sg/stocks/news/daily-markets-briefing-sti-down-013-top-stock-dfirg-usd",
            "pub_date": "2025-02-05 06:40:48",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Industrial rents reach highest level since 1996 with Q4 2024 growth",
            "description": "<div class=\"nf__description\">\n<p><strong>Overall rental growth was mainly driven by the multiple-user and warehouse segments.</strong></p><p>Rents for all industrial properties in Singapore rose by 0.5% quarter-on-quarter (QoQ) in Q4 2024, marking the 17th consecutive quarter of growth and reaching its highest level since Q2 1996, JTC reported.</p><p>Year-on-year (YoY), rents grew by 3.5%, slowing from the 8.9% increase recorded in 2023.</p><p><img height=\"460\" src=\"https://www.cmgassets.com/s3fs-public/users/user12663/cotd0204.png?s43774d1738652294\" width=\"926\"/></p><p>Overall rental growth was positive across all segments, driven largely by the multiple-user and <a href=\"https://sbr.com.sg/commercial-property/news/warehouse-occupancy-and-rents-fall-amid-increased-supply\">warehouse segments.</a></p><p>Meanwhile, overall industrial occupancy remained flat, with occupancy rates declining in the multiple-user factory and business park segments.</p><p>The price index grew by 0.5% QoQ, down from the 1.2% growth in Q3, bringing annual growth for 2024 to 2.1%, a decline from the 5.1% recorded in 2023.</p>\n</div>",
            "link": "https://sbr.com.sg/commercial-property/news/industrial-rents-reach-highest-level-1996-q4-2024-growth",
            "pub_date": "2025-02-05 05:30:54",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore ranks second for online safety in Southeast Asia in 2024",
            "description": "<div class=\"nf__description\">\n<p><strong>Telegram scams are the top web threat in Singapore in 2024.</strong></p><p>Singapore recorded the second-lowest proportion of users affected by <a href=\"https://sbr.com.sg/videos/singapore-targets-ransomware-tougher-policies-avoids-payouts\">web threats </a>within Southeast Asia (SEA) in 2024, Kaspersky reported.</p><p>According to Kaspersky, Singapore's strong online safety can be attributed to enhanced cybersecurity measures, sustained government support, and improved cyber hygiene and user vigilance.</p><p>Telegram scams emerged as one of the top scams in Singapore in 2024, with a 137.5% increase in cases during the first half of the year. </p><p>In addition, over 100 public officials were targeted by malicious AI-driven campaigns in November, receiving blackmail emails with deepfake images of their faces in compromising situations.</p><p>In response, Singapore launched the Critical Infrastructure Defence Exercise, which includes live AI models for cyber defense training. The country will also introduce the Digital Infrastructure Act this year.</p><p>“Web safety and a strong cyber posture are not just technical necessities, but the foundation of trust and resilience in our digital future,” Yeo Siang Tiong, general manager for Southeast Asia at Kaspersky said.</p>\n</div>",
            "link": "https://sbr.com.sg/information-technology/news/singapore-ranks-second-online-safety-in-southeast-asia-in-2024",
            "pub_date": "2025-02-05 05:30:54",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        }
    ]
}