{
    "data": [
        {
            "title": "HDI Global Singapore names Haris Michaels as Eastern energy head",
            "description": "<div class=\"nf__description\">\n<p><strong>The appointment takes effect 1 March from the insurer Singapore branch.</strong></p><p><a href=\"https://insuranceasia.com/company/hdi-global\">HDI Global Singapore</a> has appointed Haris Michaels as the new head of Energy and Power for the Eastern Region, effective 1 March. </p><p>Based in the insurer’s Singapore branch, Michaels will lead the underwriting and management of power generation and energy portfolios across the region.</p><p>Michaels brings over 20 years of industry experience to the role, with a background in technical underwriting for complex engineering and energy risks. </p><p>He first joined HDI Global in 2013, holding leadership positions in Australasia before moving to Singapore in August 2025. </p><p>His recent work has focused on supporting Southeast Asian clients through energy transition projects and emerging technologies.</p><p>He succeeds Mark Mackay, who has been promoted to the role of Global head of Energy &amp; Power at HDI Global. <br/>Mackay, who previously led the portfolio from Singapore, will also begin his new global mandate on 1 March.<br/> </p>\n</div>",
            "link": "https://sbr.com.sg/insurance/news/hdi-global-singapore-names-haris-michaels-eastern-energy-head",
            "pub_date": "2026-02-27 07:50:48",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Daily Markets Briefing: STI down 0.92%; Top stock is Seatrium Limited",
            "description": "<div class=\"nf__description\">\n<p><strong>Seatrium Limited is the top stock with a 3.17% increase.</strong></p><p>The Straits Times Index (STI) closed at 4,961.470, down 0.92% on Thursday, 26 February, at 5:21 p.m.</p><p>Seatrium Limited was the most active <a href=\"https://sbr.com.sg/stocks/news/daily-markets-briefing-sti-down-026-top-stock-dfi-retail\" rel=\"noopener dofollow\" target=\"_blank\">stock</a>, followed by Yangzijiang Shipbuilding (Holdings) Pte Ltd (+1.82%) and Keppel DC REIT (+0.87%).</p><p>CapitaLand Integrated Commercial Trust and CapitaLand Ascendas REIT were at the foot.</p><p> </p>\n</div>",
            "link": "https://sbr.com.sg/markets/news/daily-markets-briefing-sti-down-092-top-stock-seatrium-limited",
            "pub_date": "2026-02-27 06:31:29",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KSH subsidiary wins over $503m construction project",
            "description": "<div class=\"nf__description\">\n<p><strong>The group's order book is now estimated at $970m.</strong></p><p><a href=\"https://sbr.com.sg/news/kshs-orderbook-reaches-315m-following-kim-seng-heng-win\">KSH Holdings Limited</a> said its wholly owned subsidiary, Kim Seng Heng Engineering Construction (Pte) Ltd, has accepted a letter of acceptance for a new construction project worth more than $503m.</p><p>Following the award, the group’s construction order book in Singapore is estimated at approximately $970m, according to a filing.</p><p>The order book is expected to contribute to the group’s financial results up to the financial year ending 31 March 2030.<br/> </p><p> </p>\n</div>",
            "link": "https://sbr.com.sg/building-engineering/news/ksh-subsidiary-wins-over-503m-construction-project",
            "pub_date": "2026-02-27 06:05:49",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Syfe launches JPMAM active ETF portfolio in Singapore",
            "description": "<div class=\"nf__description\">\n<p><strong>The Equity Alpha portfolio targets an annual alpha of 0.5% to 1% at a fraction of typical annual fees.</strong></p><p><a href=\"https://asianbankingandfinance.net/wealth-management/news/syfe-acquire-aussie-investment-platform-selfwealth\">Syfe</a>, a digital wealth platform, now offers J.P. Morgan Asset Management (JPMAM)’s institutional active ETF strategy to its Singapore customers.</p><p>The “Equity Alpha portfolio powered by J.P. Morgan Asset Management” is an actively-managed ETF that targets an annual alpha of 0.5% to 1%, Syfe said in a press release published on 26 February 2026.</p><p>The new portfolio targets investors seeking alpha, or excess return above the market, and promises a disciplined and research-led approach, it said. It will have active stock selection and active asset allocation.</p><p>Portfolio is typically rebalanced 2 to 4 times per year.</p><p>The underlying cost is about 0.20% per year, compared to the 1% and 2% a year fees of traditional active funds, Syfe said.</p><p>The Equity Alpha portfolio is available to all Syfe customers on the Syfe app starting 26 February 2026.</p><p>In Hong Kong, JPM and Syfe already collaborate on the Income+ Max portfolio, announced earlier in February.</p>\n</div>",
            "link": "https://sbr.com.sg/news/syfe-launches-jpmam-active-etf-portfolio-in-singapore",
            "pub_date": "2026-02-27 06:05:49",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NTUC proposes triple-action plan to shield entry-level jobs from AI",
            "description": "<div class=\"nf__description\">\n<p><strong>One measure is to turn junior roles into AI-focused apprenticeships.</strong></p><p><a href=\"https://sbr.com.sg/hr-education/news/ntuc-launches-ai-ready-sg-one-stop-platform-upskill-workers\">The National Trades Union Congress (NTUC)</a> has proposed a three-pronged approach to address the impact of artificial intelligence (AI) on entry-level jobs in parliament.</p><p>The first measure is to incentivise firms to convert traditional junior execution roles into structured apprenticeships that incorporate AI oversight and integration skills, said NTUC Deputy Secretary-General Desmond Choo.</p><p>“We often admire the apprenticeship systems of Germany and Switzerland,” he said. “They expand into banking, insurance and advanced services.”</p><p>Choo suggested the government could partly fund the gap for a set period to reduce hiring risks. He also proposed to formalise AI oversight as a recognised industry skill.</p><p>Meanwhile, the second proposal is to equip students for higher-value responsibilities from the start of their careers. “AI literacy cannot be optional—it must be foundational.”</p><p>The third measure calls for accelerating reskilling timelines. Choo proposed reviewing earlier access to SkillsFuture support and expanding place-and-train models.</p><p>“Structured pathways that combine employment and training reduce risk and increase participation,” he added.</p>\n</div>",
            "link": "https://sbr.com.sg/hr-education/news/ntuc-proposes-triple-action-plan-shield-entry-level-jobs-ai",
            "pub_date": "2026-02-26 11:50:35",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top 1% of households hold 14% of nation’s wealth, Minister Siow says",
            "description": "<div class=\"nf__description\">\n<p><strong>The level is comparable to advanced economies with similar wealth Gini coefficients.</strong></p><p>The top 1% of households in Singapore hold about 14% of total household wealth, whilst the top 5% hold about 33%, according to Senior Minister of State for Finance Jeffrey Siow.</p><p>“These levels are broadly comparable to advanced economies with similar wealth Gini coefficients,” Siow said in a written parliamentary reply to questions on wealth concentration and the measurement of inequality.</p><p>However, he cautioned that the estimates should be interpreted carefully due to sample size limitations and potential under-reporting in survey responses at both ends of the distribution.</p><p>Siow said wealth inequality is generally higher than income inequality in advanced economies, as wealth accumulates over the life cycle.</p><p>In Singapore, a significant portion of household wealth — particularly amongst lower- and middle-income households — is held in owner-occupied housing and CPF savings.</p><p><a href=\"https://sbr.com.sg/news/hnw-individuals-fear-wealth-may-not-last-beyond-next-generation-report\">Wealth inequality</a> is measured at the household level using a combination of survey data and administrative records.</p><p>Meanwhile, Siow noted that the government does not differentiate between public and private housing, or between owner-occupied and non-owner-occupied housing, in computing the wealth Gini coefficient.</p><p>“It is a stock measure of net worth rather than a measure of liquidity,” he added.</p><p>The government intends to track the measure over time, with the next Household Expenditure Survey cycle scheduled for 2028.</p><p>In response to questions on wealth taxation, Siow said the government focuses on taxing less mobile assets such as property and motor vehicles, with progressive rates applied to higher-value assets.</p><p>“For asset-rich but income-poor seniors, we provide deferral mechanisms for property tax payments to ease cash-flow pressures,” he added.</p>\n</div>",
            "link": "https://sbr.com.sg/economy/news/top-1-households-hold-14-nations-wealth-minister-siow-says",
            "pub_date": "2026-02-26 11:50:36",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Deliveroo exits Singapore market after 11 years",
            "description": "<div class=\"nf__description\">\n<p><strong>Its platform will remain live until 4 March 2026.</strong></p><p><a href=\"https://sbr.com.sg/food-beverage/news/doordash-enters-singapore-market-deliveroo-acquisition\">Deliveroo </a>will exit the Singapore market and begin an orderly wind-down of its operations, the company announced on 25 February.</p><p>The decision follows a review of country-specific conditions and prioritises investment in long-term leadership and sustainable scale.</p><p>“Over the last 11 years, we have been proud to help shape food delivery in Singapore, giving consumers access to a wide variety of restaurant and grocery partners,” said Miki Kuusi, Head of DoorDash International, CEO of Deliveroo and co-founder of Wolt.</p><p>Deliveroo said it will work with local teams to support customers, partners and riders during the transition period. Its platform will remain live until 4 March 2026.</p>\n</div>",
            "link": "https://sbr.com.sg/food-beverage/news/deliveroo-exits-singapore-market-after-11-years",
            "pub_date": "2026-02-26 11:05:20",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Seatrium FY2025 net profit up 106% as oil and offshore wind revenue lifts",
            "description": "<div class=\"nf__description\">\n<p><strong>Gross profit rose to $848m, whilst gross margin improved to 7.4% from 3.1%.</strong></p><p><a href=\"https://sbr.com.sg/news/seatrium-cut-50m-in-annual-costs-non-core-asset-sales\">Seatrium Limited </a>has recorded a net profit of $323.6m for the financial year ended 31 December 2025 (FY2025), up 106% year-on-year from $156.8m.</p><p>Gross profit rose to $848m from $291m in the previous year, whilst gross margin improved to 7.4% from 3.1%, according to a press release.</p><p>Revenue rose 24% to $11.5b in FY2025, up from $9.2b.</p><p>The increase was attributed to the group’s ‘Oil &amp; Gas’ and ‘Offshore Wind’ segments, supported by the execution of the Petrobras P-Series FPSO and TenneT 2GW HVDC projects.</p><p>Seatrium said it expects to realise over $50m in annualised cost savings from previously announced strategic divestments expected to be completed by the first half of 2026.</p><p>It added that total annualised cost savings are projected to exceed $100m by FY2028, following additional divestments and the return of Admiralty Yard to the authorities.</p><p>The board has proposed a final dividend of 3.0 cents per share for FY2025, an increase from 1.5 cents per share for FY2024.</p>\n</div>",
            "link": "https://sbr.com.sg/energy-offshore/news/seatrium-fy2025-net-profit-106-oil-and-offshore-wind-revenue-lifts",
            "pub_date": "2026-02-26 10:31:26",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Morrison Lane bid may hit S$1,500 psf ppr",
            "description": "<div class=\"nf__description\">\n<p><strong>Analysts split on tender trigger odds.</strong></p><p>Analysts diverged on whether the Reserve List residential site at Morrison Lane will be triggered soon, even as they sketched a potential top bid in the mid-$1,400s per square foot per plot ratio (psf ppr).</p><p>PropNex said it does not expect the Robertson Quay area plot to be triggered in the near term, despite a rebound in Core Central Region (CCR) demand in 2025.</p><p>PropNex highlighted competitive supply and pointed to unsold inventory nearby, including the expected March 2026 launch of the 455-unit River Modern, alongside sales progress at The Robertson Opus and Union Square Residences based on caveats lodged.</p><p>Huttons took a more upbeat view, saying the site along Mohamed Sultan may be triggered for sale and noting it was previously used for transitional office space.</p><p>Huttons estimated a successful bid of $1,400 to $1,500 psf ppr, which it said could translate to a development quantum of around $300m and attract up to five developers, whilst citing stronger CCR sentiment and interest indicators at Newport Residences and River Modern. </p>\n</div>",
            "link": "https://sbr.com.sg/residential-property/news/morrison-lane-bid-may-hit-s1500-psf-ppr",
            "pub_date": "2026-02-26 10:20:55",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Holland Plain tender may top S$1,500 psf ppr",
            "description": "<div class=\"nf__description\">\n<p><strong>Analysts see two to five bids.</strong></p><p>Property analysts expect measured demand for the Holland Plain Government Land Sales (GLS) site, with top bids clustered around the mid-$1,400s per square foot per plot ratio (psf ppr).</p><p>PropNex forecast about three to five bids and pegged the highest offer at around $1,400 to $1,500 psf ppr, pointing to the $1,432 psf ppr result for the earlier Holland Link plot as a reference point.</p><p>Realion and Huttons were more conservative on pricing, each putting the top bid at about $1,350 to $1,450 psf ppr.</p><p>Bidder interest could vary, with Realion estimating two to five bids and Huttons projecting one to three bidders, citing a selective land-buying backdrop even as sentiment in the Core Central Region improves.</p><p>Huttons also said the land cost could translate into a moderate development quantum below $500m.</p><p>Analysts framed the site’s appeal around the emerging Holland Plain private housing enclave, highlighting its park-side setting near Holland Green Linear Park and the Rail Corridor, plus proximity to schools and amenities such as Bukit Timah Plaza and KAP Mall.</p><p>Huttons added that the Holland Plain plot has a slightly higher plot ratio than Holland Link, which could support a taller project.</p><p>On transport, commentators flagged longer-term connectivity upside from the future Cross Island Line interchange at King Albert Park, with PropNex citing an expected completion in 2032.</p><p>Realion said the future interchange would be about a 10-minute walk from the site under Master Plan 2025.</p>\n</div>",
            "link": "https://sbr.com.sg/residential-property/news/holland-plain-tender-may-top-s1500-psf-ppr",
            "pub_date": "2026-02-26 07:50:18",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        }
    ]
}