{
    "data": [
        {
            "title": "Thakral Corporation FY2025 net profit rises five-fold to $170.9m",
            "description": "<div class=\"nf__description\">\n<p><strong>Revenue rose 42% year-on-year to $411.3m.</strong></p><p><a href=\"https://sbr.com.sg/markets-investing/news/thakral-profit-surges-195m-strong-investment-and-lifestyle-segment\">Thakral Corporation Ltd</a> reported a net profit attributable to shareholders of $170.9m for the 12 months ended 31 December 2025 (FY2025), up 493% from $28.8m a year earlier.</p><p>Revenue rose 42% year-on-year to $411.3m, according to the group’s press release.</p><p>Meanwhile, revenue from the lifestyle segment increased 29% to $352.1m.</p><p>The board has declared a second interim dividend of 3.5 cents per share, bringing total dividends for FY2025 to 6.5 cents per share.</p>\n</div>",
            "link": "https://sbr.com.sg/markets-investing/news/thakral-corporation-fy2025-net-profit-rises-five-fold-1709m",
            "pub_date": "2026-02-27 14:10:53",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singlife launches universal life plan with income linked to global indices",
            "description": "<div class=\"nf__description\">\n<p><strong>The plan has a built-in floor rate of 0.00% per annum.</strong></p><p><a href=\"https://sbr.com.sg/news/mufg-and-singlife-seal-landmark-550m-insurance-financing-deal\">Singlife </a>has launched a whole-of-life, non-participating universal life plan that combines growth potential with flexible income options.</p><p>The Singlife Legacy Indexed Income plan provides an income stream linked to the performance of five selected indices, the group said in a press release.</p><p>These include the S&amp;P 500 Index, S&amp;P 500 Engle 8% VT TCA Index, Nasdaq-100 Engle 8% Index, UBS Global Multi Asset Engle 8% Index, and UBS Gold Engle 8% Index.</p><p>The plan has a built-in floor rate of 0.00% per annum to prevent negative returns in volatile market conditions.</p><p>According to Singlife, policyholders receive income during each policy year in the payout period based on the performance of the chosen indices, up to a target annual income.</p><p>Meanwhile, additional gains within the same year are automatically reinvested to support the continued growth of the policy value.</p><p>The plan also provides a guaranteed loyalty bonus of 0.7% per annum on the Index Account from the eleventh policy year onwards.</p>\n</div>",
            "link": "https://sbr.com.sg/insurance/news/singlife-launches-universal-life-plan-income-linked-global-indices",
            "pub_date": "2026-02-27 13:05:51",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Savills offers Chinatown shophouses with income-generating tenants",
            "description": "<div class=\"nf__description\">\n<p><strong>The shophouses at 277/279 South Bridge Road total 8,259 sq ft.</strong></p><p><a href=\"https://sbr.com.sg/markets-investing/news/savills-singapore-acquires-majority-stake-in-alpina-40m\" rel=\"noopener dofollow\">Savills Singapore</a> launched for sale a pair of adjoining refurbished shophouses at 277/279 South Bridge Road in the Chinatown Conservation Area.</p><p>The properties sit on a combined 2,847 sq ft of land with a total built-up area of 8,259 sq ft, zoned “Commercial” under the Master Plan 2025.</p><p>The shophouses feature marble flooring and high-quality finishes and are sold with existing tenants, including F&amp;B operator Gunkee.</p><p>South Bridge Road has evolved into a lifestyle and heritage corridor, hosting tenants such as The Great Room, ST Signature, and Tong Heng, alongside established F&amp;B brands like Ya Kun Kaya Toast.</p><p>The properties benefit from prominent street frontage, high pedestrian traffic, and proximity to Chinatown and Maxwell MRT stations.</p><p>According to Ms. Yap Hui Yee, Executive Director, Investment Sales &amp; Capital Markets, SAVILLS Singapore, the shophouses’ location bridges Chinatown with the Central Business District and offers a stable income stream.</p><p>The sale is open to both local and foreign buyers, with no Seller’s Stamp Duty or Additional Buyer’s Stamp Duty, via an Expression of Interest closing 1 April 2026 at 3 p.m.<br/> </p>\n</div>",
            "link": "https://sbr.com.sg/commercial-property/news/savills-offers-chinatown-shophouses-income-generating-tenants",
            "pub_date": "2026-02-27 13:05:51",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "All GST-registered firms face mandatory InvoiceNow shift by 2031",
            "description": "<div class=\"nf__description\">\n<p><strong>Funding of up to $5,000 will be provided to support the transition.</strong></p><p>All goods and services tax (GST)-registered businesses will be required to onboard the InvoiceNow network and submit invoice data directly to the <a href=\"https://sbr.com.sg/news/government-grants-one-off-property-tax-rebate-2026-bills-approach\">Inland Revenue Authority of Singapore (IRAS)</a> by 2031.</p><p>Announced at the Ministry of Finance Committee of Supply (COS) Debate 2026, the initiative will roll out from April 2028.</p><p>Transitional funding will be provided to offset onboarding costs, with small and medium-sized enterprises (SMEs) eligible for up to $1,000 and larger businesses up to $5,000. SMEs can also access InvoiceNow-Ready solutions for free until Mar 2031.</p><p>From 1 April, all new voluntary GST registrants must submit their invoice data via the network, regardless of incorporation date or business structure, IRAS said in a press release.</p><p>The COS 2026 announcement extends the requirement to all remaining GST-registered businesses, bringing an estimated 90,000 more businesses onto the network.</p><p>The InvoiceNow network enables businesses to send and receive invoices in a structured digital format, based on the international Peppol standard.</p><p>Since 1 November 2025, newly incorporated companies that voluntarily register for GST have been required to transmit invoice data via InvoiceNow.</p><p>IRAS said over 63,000 businesses are currently in the network using services from accredited providers.</p>\n</div>",
            "link": "https://sbr.com.sg/economy/news/all-gst-registered-firms-face-mandatory-invoicenow-shift-2031",
            "pub_date": "2026-02-27 12:50:53",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CDL, Climate Group launch SG’s first market-wide concrete benchmark",
            "description": "<div class=\"nf__description\">\n<p><strong>The framework will guide the industry in choosing lower-carbon options.</strong></p><p><a href=\"https://sbr.com.sg/residential-property/news/cdl-fy2025-net-profit-surges-213-6297m-property-sales-surge\">CapitaLand Development</a> and Climate Group’s ConcreteZero initiative have launched the ‘Concrete Data for Concrete Action’ benchmark, Singapore’s first market-wide reference for measuring concrete’s carbon footprint.</p><p>The benchmark establishes a baseline for the embodied carbon intensity of concrete supplied in the country, providing the construction sector with a shared reference point for the first time.</p><p>It is designed to enable the value chain to identify and select lower-carbon options.</p><p>“As the country's first standardised measurement framework for concrete, it gives industry the transparency needed to make informed decisions about low-carbon materials,” said Mike Pierce, Executive Director, Systems Change at Climate Group.</p><p>The guide was developed using verified environmental data collected from concrete suppliers and represents a weighted average of the embodied carbon performance across commonly used concrete mixes.</p><p>Moreover, it draws on international standards from the UK and Australia,</p><p>The launch comes as concrete accounts for roughly 8% of global carbon dioxide emissions, while the broader built environment contributes nearly 40%. Meanwhile, Singapore imports most of its construction materials.</p><p>The framework draws on international standards from the UK and Australia, adapted for Singapore’s market to ensure regional relevance and global comparability.</p>\n</div>",
            "link": "https://sbr.com.sg/building-engineering/news/cdl-climate-group-launch-sgs-first-market-wide-concrete-benchmark",
            "pub_date": "2026-02-27 11:51:06",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CDL FY2025 net profit surges 213% to $629.7m on property sales surge",
            "description": "<div class=\"nf__description\">\n<p><strong>Revenue increased by 9.7% to approximately $3.6b from $3.3b.</strong></p><p><a href=\"https://sbr.com.sg/residential-property/news/cdl-debuts-newport-residences-13m-entry-price\">City Developments Limited’s</a> net profit after tax and non-controlling interest (PATMI) rose 212.8% to $629.7m for the full year ended 31 December 2025 (FY2025), from $201.3m a year earlier.</p><p>PATMI for the second half stood at $538.5m, up 374.3% year-on-year from $113.5m, according to the group’s press release.</p><p>Revenue for FY2025 increased by 9.7% to approximately $3.6b from $3.3b. Growth was driven by the property development segment, which increased 24.1%.</p><p>In Singapore, projects including The Myst, Norwood Grand, and Union Square Residences contributed to the segment’s growth, alongside the sale of the Ransome’s Wharf site in London and the office portion of Suzhou Hong Leong City Center in China.</p><p>The Board of Directors has updated the Group’s dividend policy to declare ordinary cash dividends at least once annually, targeting a minimum payout ratio of 35% of reported PATMI.</p><p>The Board recommends a final ordinary dividend of 25.0 cents per share. Total dividends for the year amount to 28.0 cents per share, up from 10.0 cents per share in FY2024.</p>\n</div>",
            "link": "https://sbr.com.sg/residential-property/news/cdl-fy2025-net-profit-surges-213-6297m-property-sales-surge",
            "pub_date": "2026-02-27 10:56:37",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Frasers Property solidifies Orchard grip with $391.9m Centrepoint win",
            "description": "<div class=\"nf__description\">\n<p><strong>The group moves one step closer to full ownership of the prime shopping landmark.</strong></p><p><a href=\"https://sbr.com.sg/news/frasers-property-launches-9-mall-rebrand-and-tech-overhaul\">Frasers Property,</a> through its wholly owned subsidiary Frasers Property Cuppage Pte. Ltd., has secured the collective sale tender for the leasehold rear plot at The Centrepoint on Orchard Road for $391.9m.</p><p>The tender price represents a land rate of approximately $2,577 per square foot per plot ratio, including lease top-ups and any land betterment charges, according to a filing.</p><p>The leasehold rear plot comprises 66 retail units and 66 residential apartments under Management Corporation Strata Title Plan No. 1304.</p><p>The acquisition will be completed once a sale order approving the collective sale is obtained, or once all subsidiary proprietors have given their consent.</p><p>Prior to the collective sale, Frasers Property owned over 52% of the units by strata area. The group is also a majority shareholder of the freehold front plot, holding roughly 96% of the units.</p>\n</div>",
            "link": "https://sbr.com.sg/commercial-property/news/frasers-property-solidifies-orchard-grip-3919m-centrepoint-win",
            "pub_date": "2026-02-27 10:25:56",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Factory output jumps 16.6% in January",
            "description": "<div class=\"nf__description\">\n<p><strong>Electronics up 44% on AI demand.</strong></p><p>Manufacturing output rose 16.6% YoY in January 2026, according to data from the Economic Development Board.</p><p>Excluding biomedical manufacturing, output increased 24.1% from a year earlier.</p><p>Electronics output climbed 44.0%, led by other electronic modules and components and semiconductors, with semiconductor output supported by strong AI-related demand.</p><p>Transport engineering rose 25.2% on higher aerospace output, driven by increased aircraft parts production and sustained maintenance, repair, and overhaul work.</p><p>Biomedical manufacturing fell 33.1%, as pharmaceuticals contracted due to lower output of biological products and active pharmaceutical ingredients, whilst medical technology declined due to softer demand for medical devices.</p>\n</div>",
            "link": "https://sbr.com.sg/manufacturing/news/factory-output-jumps-166-in-january",
            "pub_date": "2026-02-27 10:05:59",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Household net worth growth slows in Q4 2025",
            "description": "<div class=\"nf__description\">\n<p><strong>Liabilities rise faster on loans.</strong></p><p>Household sector net worth growth eased to 7.3% YoY in Q4 2025, slowing from 8.8% in Q3 as asset growth moderated whilst liabilities rose faster.</p><p>Household assets grew 7.3% in Q4, down from 8.6% in Q3, as growth in both financial assets and residential property assets slowed.</p><p>Household liabilities increased 7.4% in Q4, up from 6.6% in Q3, extending a rise the report said has run for nine consecutive quarters, driven by faster growth in mortgage loans and personal loans.</p><p>Residential property assets growth slowed to 5.1% in Q4 from 7.6%, whilst financial assets growth eased to 9.0% from 9.4%.</p><p>On a personal disposable income basis, household net worth was 868.1% of PDI in Q4 2025, with assets at 975.4% and liabilities at 107.3%, the report said.</p>\n</div>",
            "link": "https://sbr.com.sg/economy/news/household-net-worth-growth-slows-in-q4-2025",
            "pub_date": "2026-02-27 07:55:50",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Services trade tops $1t in 2024",
            "description": "<div class=\"nf__description\">\n<p><strong>Exports rise 13.2% to $533.7b.</strong></p><p>The total international trade in services rose 13.0% to $1,021.4b in 2024, according to data released by the Singapore Department of Statistics.</p><p>Services exports increased 13.2% to $533.7b from $471.3b in 2023, whilst imports rose 12.7% to $487.6b from $432.6b.</p><p>The European Union remained Singapore’s largest services export market, though receipts fell 1.9% to $69.3b, whilst exports to the United States rose 24.3% to $63.5b.</p><p>Exports to Japan rose 10.7% to $48.3b, Australia increased 3.2% to $40.8b, and ASEAN grew 8.3% to $37.8b.</p><p>On the import side, the United States remained Singapore’s largest services import partner, with payments rising 13.7% to $121.6b, the department said.</p>\n</div>",
            "link": "https://sbr.com.sg/economy/news/services-trade-tops-1t-in-2024",
            "pub_date": "2026-02-27 07:55:50",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        }
    ]
}