{
    "data": [
        {
            "title": "CDL FY2025 net profit surges 213% to $629.7m on property sales surge",
            "description": "<div class=\"nf__description\">\n<p><strong>Revenue increased by 9.7% to approximately $3.6b from $3.3b.</strong></p><p><a href=\"https://sbr.com.sg/residential-property/news/cdl-debuts-newport-residences-13m-entry-price\">City Developments Limited’s</a> net profit after tax and non-controlling interest (PATMI) rose 212.8% to $629.7m for the full year ended 31 December 2025 (FY2025), from $201.3m a year earlier.</p><p>PATMI for the second half stood at $538.5m, up 374.3% year-on-year from $113.5m, according to the group’s press release.</p><p>Revenue for FY2025 increased by 9.7% to approximately $3.6b from $3.3b. Growth was driven by the property development segment, which increased 24.1%.</p><p>In Singapore, projects including The Myst, Norwood Grand, and Union Square Residences contributed to the segment’s growth, alongside the sale of the Ransome’s Wharf site in London and the office portion of Suzhou Hong Leong City Center in China.</p><p>The Board of Directors has updated the Group’s dividend policy to declare ordinary cash dividends at least once annually, targeting a minimum payout ratio of 35% of reported PATMI.</p><p>The Board recommends a final ordinary dividend of 25.0 cents per share. Total dividends for the year amount to 28.0 cents per share, up from 10.0 cents per share in FY2024.</p>\n</div>",
            "link": "https://sbr.com.sg/residential-property/news/cdl-fy2025-net-profit-surges-213-6297m-property-sales-surge",
            "pub_date": "2026-02-27 10:56:37",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Frasers Property solidifies Orchard grip with $391.9m Centrepoint win",
            "description": "<div class=\"nf__description\">\n<p><strong>The group moves one step closer to full ownership of the prime shopping landmark.</strong></p><p><a href=\"https://sbr.com.sg/news/frasers-property-launches-9-mall-rebrand-and-tech-overhaul\">Frasers Property,</a> through its wholly owned subsidiary Frasers Property Cuppage Pte. Ltd., has secured the collective sale tender for the leasehold rear plot at The Centrepoint on Orchard Road for $391.9m.</p><p>The tender price represents a land rate of approximately $2,577 per square foot per plot ratio, including lease top-ups and any land betterment charges, according to a filing.</p><p>The leasehold rear plot comprises 66 retail units and 66 residential apartments under Management Corporation Strata Title Plan No. 1304.</p><p>The acquisition will be completed once a sale order approving the collective sale is obtained, or once all subsidiary proprietors have given their consent.</p><p>Prior to the collective sale, Frasers Property owned over 52% of the units by strata area. The group is also a majority shareholder of the freehold front plot, holding roughly 96% of the units.</p>\n</div>",
            "link": "https://sbr.com.sg/commercial-property/news/frasers-property-solidifies-orchard-grip-3919m-centrepoint-win",
            "pub_date": "2026-02-27 10:25:56",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Factory output jumps 16.6% in January",
            "description": "<div class=\"nf__description\">\n<p><strong>Electronics up 44% on AI demand.</strong></p><p>Manufacturing output rose 16.6% YoY in January 2026, according to data from the Economic Development Board.</p><p>Excluding biomedical manufacturing, output increased 24.1% from a year earlier.</p><p>Electronics output climbed 44.0%, led by other electronic modules and components and semiconductors, with semiconductor output supported by strong AI-related demand.</p><p>Transport engineering rose 25.2% on higher aerospace output, driven by increased aircraft parts production and sustained maintenance, repair, and overhaul work.</p><p>Biomedical manufacturing fell 33.1%, as pharmaceuticals contracted due to lower output of biological products and active pharmaceutical ingredients, whilst medical technology declined due to softer demand for medical devices.</p>\n</div>",
            "link": "https://sbr.com.sg/manufacturing/news/factory-output-jumps-166-in-january",
            "pub_date": "2026-02-27 10:05:59",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Household net worth growth slows in Q4 2025",
            "description": "<div class=\"nf__description\">\n<p><strong>Liabilities rise faster on loans.</strong></p><p>Household sector net worth growth eased to 7.3% YoY in Q4 2025, slowing from 8.8% in Q3 as asset growth moderated whilst liabilities rose faster.</p><p>Household assets grew 7.3% in Q4, down from 8.6% in Q3, as growth in both financial assets and residential property assets slowed.</p><p>Household liabilities increased 7.4% in Q4, up from 6.6% in Q3, extending a rise the report said has run for nine consecutive quarters, driven by faster growth in mortgage loans and personal loans.</p><p>Residential property assets growth slowed to 5.1% in Q4 from 7.6%, whilst financial assets growth eased to 9.0% from 9.4%.</p><p>On a personal disposable income basis, household net worth was 868.1% of PDI in Q4 2025, with assets at 975.4% and liabilities at 107.3%, the report said.</p>\n</div>",
            "link": "https://sbr.com.sg/economy/news/household-net-worth-growth-slows-in-q4-2025",
            "pub_date": "2026-02-27 07:55:50",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Services trade tops $1t in 2024",
            "description": "<div class=\"nf__description\">\n<p><strong>Exports rise 13.2% to $533.7b.</strong></p><p>The total international trade in services rose 13.0% to $1,021.4b in 2024, according to data released by the Singapore Department of Statistics.</p><p>Services exports increased 13.2% to $533.7b from $471.3b in 2023, whilst imports rose 12.7% to $487.6b from $432.6b.</p><p>The European Union remained Singapore’s largest services export market, though receipts fell 1.9% to $69.3b, whilst exports to the United States rose 24.3% to $63.5b.</p><p>Exports to Japan rose 10.7% to $48.3b, Australia increased 3.2% to $40.8b, and ASEAN grew 8.3% to $37.8b.</p><p>On the import side, the United States remained Singapore’s largest services import partner, with payments rising 13.7% to $121.6b, the department said.</p>\n</div>",
            "link": "https://sbr.com.sg/economy/news/services-trade-tops-1t-in-2024",
            "pub_date": "2026-02-27 07:55:50",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HDI Global Singapore names Haris Michaels as Eastern energy head",
            "description": "<div class=\"nf__description\">\n<p><strong>The appointment takes effect 1 March from the insurer Singapore branch.</strong></p><p><a href=\"https://insuranceasia.com/company/hdi-global\">HDI Global Singapore</a> has appointed Haris Michaels as the new head of Energy and Power for the Eastern Region, effective 1 March. </p><p>Based in the insurer’s Singapore branch, Michaels will lead the underwriting and management of power generation and energy portfolios across the region.</p><p>Michaels brings over 20 years of industry experience to the role, with a background in technical underwriting for complex engineering and energy risks. </p><p>He first joined HDI Global in 2013, holding leadership positions in Australasia before moving to Singapore in August 2025. </p><p>His recent work has focused on supporting Southeast Asian clients through energy transition projects and emerging technologies.</p><p>He succeeds Mark Mackay, who has been promoted to the role of Global head of Energy &amp; Power at HDI Global. <br/>Mackay, who previously led the portfolio from Singapore, will also begin his new global mandate on 1 March.<br/> </p>\n</div>",
            "link": "https://sbr.com.sg/insurance/news/hdi-global-singapore-names-haris-michaels-eastern-energy-head",
            "pub_date": "2026-02-27 07:50:48",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Daily Markets Briefing: STI down 0.92%; Top stock is Seatrium Limited",
            "description": "<div class=\"nf__description\">\n<p><strong>Seatrium Limited is the top stock with a 3.17% increase.</strong></p><p>The Straits Times Index (STI) closed at 4,961.470, down 0.92% on Thursday, 26 February, at 5:21 p.m.</p><p>Seatrium Limited was the most active <a href=\"https://sbr.com.sg/stocks/news/daily-markets-briefing-sti-down-026-top-stock-dfi-retail\" rel=\"noopener dofollow\" target=\"_blank\">stock</a>, followed by Yangzijiang Shipbuilding (Holdings) Pte Ltd (+1.82%) and Keppel DC REIT (+0.87%).</p><p>CapitaLand Integrated Commercial Trust and CapitaLand Ascendas REIT were at the foot.</p><p> </p>\n</div>",
            "link": "https://sbr.com.sg/markets/news/daily-markets-briefing-sti-down-092-top-stock-seatrium-limited",
            "pub_date": "2026-02-27 06:31:29",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KSH subsidiary wins over $503m construction project",
            "description": "<div class=\"nf__description\">\n<p><strong>The group's order book is now estimated at $970m.</strong></p><p><a href=\"https://sbr.com.sg/news/kshs-orderbook-reaches-315m-following-kim-seng-heng-win\">KSH Holdings Limited</a> said its wholly owned subsidiary, Kim Seng Heng Engineering Construction (Pte) Ltd, has accepted a letter of acceptance for a new construction project worth more than $503m.</p><p>Following the award, the group’s construction order book in Singapore is estimated at approximately $970m, according to a filing.</p><p>The order book is expected to contribute to the group’s financial results up to the financial year ending 31 March 2030.<br/> </p><p> </p>\n</div>",
            "link": "https://sbr.com.sg/building-engineering/news/ksh-subsidiary-wins-over-503m-construction-project",
            "pub_date": "2026-02-27 06:05:49",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Syfe launches JPMAM active ETF portfolio in Singapore",
            "description": "<div class=\"nf__description\">\n<p><strong>The Equity Alpha portfolio targets an annual alpha of 0.5% to 1% at a fraction of typical annual fees.</strong></p><p><a href=\"https://asianbankingandfinance.net/wealth-management/news/syfe-acquire-aussie-investment-platform-selfwealth\">Syfe</a>, a digital wealth platform, now offers J.P. Morgan Asset Management (JPMAM)’s institutional active ETF strategy to its Singapore customers.</p><p>The “Equity Alpha portfolio powered by J.P. Morgan Asset Management” is an actively-managed ETF that targets an annual alpha of 0.5% to 1%, Syfe said in a press release published on 26 February 2026.</p><p>The new portfolio targets investors seeking alpha, or excess return above the market, and promises a disciplined and research-led approach, it said. It will have active stock selection and active asset allocation.</p><p>Portfolio is typically rebalanced 2 to 4 times per year.</p><p>The underlying cost is about 0.20% per year, compared to the 1% and 2% a year fees of traditional active funds, Syfe said.</p><p>The Equity Alpha portfolio is available to all Syfe customers on the Syfe app starting 26 February 2026.</p><p>In Hong Kong, JPM and Syfe already collaborate on the Income+ Max portfolio, announced earlier in February.</p>\n</div>",
            "link": "https://sbr.com.sg/news/syfe-launches-jpmam-active-etf-portfolio-in-singapore",
            "pub_date": "2026-02-27 06:05:49",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NTUC proposes triple-action plan to shield entry-level jobs from AI",
            "description": "<div class=\"nf__description\">\n<p><strong>One measure is to turn junior roles into AI-focused apprenticeships.</strong></p><p><a href=\"https://sbr.com.sg/hr-education/news/ntuc-launches-ai-ready-sg-one-stop-platform-upskill-workers\">The National Trades Union Congress (NTUC)</a> has proposed a three-pronged approach to address the impact of artificial intelligence (AI) on entry-level jobs in parliament.</p><p>The first measure is to incentivise firms to convert traditional junior execution roles into structured apprenticeships that incorporate AI oversight and integration skills, said NTUC Deputy Secretary-General Desmond Choo.</p><p>“We often admire the apprenticeship systems of Germany and Switzerland,” he said. “They expand into banking, insurance and advanced services.”</p><p>Choo suggested the government could partly fund the gap for a set period to reduce hiring risks. He also proposed to formalise AI oversight as a recognised industry skill.</p><p>Meanwhile, the second proposal is to equip students for higher-value responsibilities from the start of their careers. “AI literacy cannot be optional—it must be foundational.”</p><p>The third measure calls for accelerating reskilling timelines. Choo proposed reviewing earlier access to SkillsFuture support and expanding place-and-train models.</p><p>“Structured pathways that combine employment and training reduce risk and increase participation,” he added.</p>\n</div>",
            "link": "https://sbr.com.sg/hr-education/news/ntuc-proposes-triple-action-plan-shield-entry-level-jobs-ai",
            "pub_date": "2026-02-26 11:50:35",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        }
    ]
}