{
    "data": [
        {
            "title": "ELTA public sales to launch on 22 February",
            "description": "<div class=\"nf__description\">\n<p><strong>It was launched by MCL Land and CSC Land Group.</strong></p><p>ELTA, the new 501-unit residential development located in Clementi will start selling on 22 February 2025.</p><p>The development is located along Clementi Avenue 1, close to established schools, bustling eateries and Clementi MRT station.</p><p>ELTA  comprises two 39-storey towers offering expansive views of the city, Pandan Reservoir and the sea. It was tastefully designed to embrace modern living alongside the tranquillity of nature and offers spacious one-bedroom + study to five-bedroom units ranging from 506 sq ft to 1,776 sq ft.</p><p>The ELTA show flat along Prince Charles Crescent showcases three elegantly designed layouts: a two-bedroom + study that can easily be transformed into a compact three-bedroom, a flexible four-bedroom dual-key unit, and a luxurious five-bedroom unit catering to multi-generational living.</p><p>The five-bedroom units offer a spacious, square-shaped living and dining area, with every bedroom featuring an ensuite bathroom. Each of these units includes two junior master bedrooms, a master bedroom and a powder room for guests.</p><p>All 501 units are equipped with full-height glass windows and Küche smart kitchen appliances. Selected units also feature a Steigen automated drying rack and a Wells water purifier and dispenser.</p><p>Indicative pricing starts from $1.158m for a one-bedroom + study unit (506 sq ft), $1.388m for a two-bedroom (614 sq ft), $2.198m for a three-bedroom (926 sq ft), $2.798m for a four-bedroom (1,184 sq ft), and $3.888m for a five-bedroom (1,776 sq ft).</p><p>The preview will be on 7 February.</p>\n</div>",
            "link": "https://sbr.com.sg/residential-property/news/elta-public-sales-launch-22-february",
            "pub_date": "2025-02-05 12:25:48",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FedEx expands day-definite service to Singapore",
            "description": "<div class=\"nf__description\">\n<p><strong>The company operates these in markets like China, Hong Kong SAR, and Japan.</strong></p><p>International express transportation company FedEx is expanding its FedEx® International Connect Plus (FICP) service to Singapore.</p><p>Singapore joins China, Hong Kong SAR, and Japan amongst the markets where this service is available.</p><p>FICP is FedEx’s international, day-definite e-commerce shipping service.</p><p>The company said this aligns with its commitment to support the growth of cross-border e-commerce from Asia to the U.S. and Europe which is projected to reach US$13.2b by 2030 at a CAGR of 17.6%.</p>\n</div>",
            "link": "https://sbr.com.sg/transport-logistics/news/fedex-expands-day-definite-service-singapore",
            "pub_date": "2025-02-05 12:20:47",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tourism spend to reach all-time high for 2024",
            "description": "<div class=\"nf__description\">\n<p><strong>Chinese, Indonesian, and Australian tourists are the top spenders.</strong></p><p><a href=\"https://sbr.com.sg/topics/singapore-tourism\" rel=\"dofollow\" target=\"_blank\">Tourism spending</a> is expected to beat the 2019 all-time high record of $27.7b in 2024, a report from the Singapore Tourism Board (STB) revealed.</p><p>Because of the tourism sector’s strong performance, it expects tourism receipts (TR) to reach the upper bounds of its forecast for 2024 at $27.5b to $29b.</p><p>TR reached $22.4b between January and September 2024, an increase of 10% compared to the same period in 2023. All spend categories have shown year-on-year growth, led by Sightseeing, Entertainment &amp; Gaming (SEG) at 25%, followed by Accommodation at 17%.</p><p>Meanwhile, Food &amp; Beverage (F&amp;B) and Shopping saw a 6% and 5% increase respectively, with other categories such as airfares and business spending contributing to TR as well.</p><p>Mainland China, Indonesia, and Australia emerged as the top tourism receipts generating markets, contributing $3.58b, $2.13b, and $1.44b respectively (excluding Sightseeing, Entertainment and Gaming). Notably, Mainland China and Japan showed strong year-on-year growth in tourism receipts.</p><p>Top markets for visitor arrivals were Mainland China (3.08 million), Indonesia (2.49 million) and India (1.20 million). Other markets that exhibited healthy year-on-year mid and long-haul markets. Contributing factors included the growth included Japan, Taiwan, the UK, and the USA, representing a good mix of short, 30-day mutual visa exemption with Mainland China, and Singapore’s strong growth in air connectivity.</p><p>In 2024, Changi Airport had a total international seat capacity of over 41 million, representing a 15% increase compared to 2023 and 98% recovery to 2019.4</p><p>STB expects 2025 international visitor arrivals to reach between 17 to 18.5 million, bringing in approximately $29b to $30.5b in tourism receipts. </p>\n</div>",
            "link": "https://sbr.com.sg/hotels-tourism/news/tourism-spend-reach-all-time-high-2024",
            "pub_date": "2025-02-05 12:05:44",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HDB resale price growth to slow amidst buyer caution",
            "description": "<div class=\"nf__description\">\n<p><strong>Prices rose by 1% in January.</strong></p><p>HDB resale prices grew 1% in January, a slight uptick from 0.2% in December, suggesting a shift in bargaining power towards buyers and growing spending caution after prices in many areas saw record high growth, Luqman Hakim, Chief Data &amp; Analytics Officer at 99.co said.</p><p>HDB resale prices in Mature Estates and Non-Mature Estates increased by 0.7% and 1%, respectively. In terms of room types, 3-room prices, 4-room prices, 5-room prices, and Executive prices increased by 1.1%, 1.3%, 1.1%, and 0.5%, respectively.</p><p>According to the SRX Property Price Index for HDB Resale, the year-on-year, overall price increase was 9.3% from January 2024. 3-room increased by 10.1%, 4-room by 10.4%, 5-room by 7.7%, and Executive by 5.2%.</p><p>Both Mature and Non-Mature Estate prices increased by 8.9% and 9.3%, respectively, from a year ago.</p><p>A total of 2,329 HDB resale flats were transacted in January 2025, representing a 9.4% increase from December 2024.</p><p>Meanwhile, YoY resale volumes in January 2025 were 11.4% lower than the previous year.</p><p>Breaking it down by room type, in January 2025, 25.5% of the HDB resale volumes came from 3-room, 45.5% from 4-room, 23.4% from 5-room, and 5.6% from Executive.</p><p>Breaking it down by estate, 59.8% of the resale volumes in January 2024 came from Non-Mature Estates. The remaining 40.2% in the month was from Mature Estates.</p><p>The highest transacted price for a resale flat in the month was $1.6m for a 5-room flat at Lor 1A Toa Payoh.</p><p>Hakim said that resale prices are projected to rise by 4% to 6% in 2025, a more moderate pace compared to the 9% increase in 2024.</p><p>“On the other hand, million-dollar flat transactions are expected to remain strong, with the potential to surpass 1,000 units again this year. This is especially for larger homes, such as lofts and maisonettes, as they will likely continue to drive these high-value deals as buyers prioritise spacious living. In January alone, the number of million-dollar flat transactions was just one sale shy of the all-time high (ATH), comprising 5.1% of the total resale volume for the month,” Hakim added.</p><p>Meanwhile, the upcoming launch of more Build-To-Order (BTO) flats this year is expected to ease pressure on the resale market, helping to moderate price growth, although global economic uncertainties, including the recent US tariffs, may pose potential headwinds to broader market stability.</p>\n</div>",
            "link": "https://sbr.com.sg/residential-property/news/hdb-resale-price-growth-slow-amidst-buyer-caution",
            "pub_date": "2025-02-05 11:50:51",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Uni-Fuels raises $1.7m in over-allotment",
            "description": "<div class=\"nf__description\">\n<p><strong>Additional shares were purchased for US$4 apiece.</strong></p><p>Uni-Fuels Holdings Limited has raised additional gross proceeds of S$1.7m ($1.26m) after its US initial public offering (IPO) underwriter exercised its over-allotment option in full and purchased an additional 315,000 Class A Ordinary Shares at S$5.41 (US$4.00) per share.</p><p>“After giving effect to the full exercise of the Over-Allotment Option, the total number of Class A Ordinary Shares sold by the company in the offering increased to 2,415,000 Class A Ordinary Shares and the gross proceeds increased to US$9.66m [S$13.04m], before deducting underwriting discounts and commissions,” the company statement read.</p><p>The Class A Ordinary Shares commenced<a href=\"https://sbr.com.sg/markets-investing/news/uni-fuels-raises-115m-in-us-maiden-offering\" rel=\"noopener dofollow\" target=\"_blank\"> trading on Nasdaq Capital Market </a>on 14 January under the ticker symbol “UFG.”</p><p>Uni-Fuels intends to use the proceeds from the IPO for scaling up its reselling activities to gain market share from existing and new markets; for strengthening its workforce and expanding its market presence in new geographical locations; and as cash reserve and general corporate purposes.</p><p>R. F. Lafferty &amp; Co., Inc. acted as the sole book-running manager for the offering.</p>\n</div>",
            "link": "https://sbr.com.sg/news/uni-fuels-raises-17m-in-over-allotment",
            "pub_date": "2025-02-05 11:30:54",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sabana Industrial REIT completes solar project with Keppel EaaS",
            "description": "<div class=\"nf__description\">\n<p><strong>The project installed solar panels on nine of the REIT’s properties.</strong></p><p><a href=\"https://sbr.com.sg/commercial-property/news/sabana-industrial-reit-2024-dpu-36-yoy-00286\">Sabana Industrial REIT</a> has completed its dual-phase project with Keppel’s Energy-as-a-Service arm (Keppel EaaS) to install solar panels atop nine of the REIT’s properties.</p><p>The project was completed in two phases. Phase 1 installed solar panels at 10 Changi South Street 2, 34 Penjuru Lane, 3A Joo Koon Circle, and Sabana@1TA4.</p><p>Phase 2 involved 2 Toh Tuck Link, 8 Commonwealth Lane, 23 Serangoon North Avenue 5, 39 Ubi Road 1, and 51 Penjuru Road. Four of these properties currently contribute about two-thirds of the total output, led by 34 Penjuru Lane.</p><p>In total, these properties have an overall installed capacity of 7.6 Megawatt peak (MWp) that will potentially generate more than 9,000 Megawatt-hours (MWh) per year, which is sufficient to power over 2,700 three-room HDB flats for a year.</p>\n</div>",
            "link": "https://sbr.com.sg/energy-offshore/news/sabana-industrial-reit-completes-solar-project-keppel-eaas",
            "pub_date": "2025-02-05 11:01:05",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CICT’s NPI up 1.3% YoY in H2 2024",
            "description": "<div class=\"nf__description\">\n<p><strong>DPU for FY2024 rose 1.2% YoY to $0.1088.</strong></p><p>CapitaLand Integrated Commercial Trust (CICT) registered a 6.4% year-on-year (YoY) growth in distributable income to $385.7m in H2 2024 from $362.5m in H2 2023.</p><p>This growth was driven by the acquisition of a <a href=\"https://sbr.com.sg/markets-investing/news/cict-completes-acquisition-50-stake-in-ion-orchard\">50.0% interest in ION Orchard</a>, strong performance in existing operating properties, and management of operating and interest costs.</p><p>Despite the divestment of 21 Collyer Quay on 11 November 2024, which partially offset gains during the period, net property income (NPI) rose 1.3% y-o-y to $571.1m.</p><p>Distribution per unit (DPU) for the period remained stable at $0.0545, comprising an advanced distribution of $0.0216 from 1 July to 11 September 2024, which was paid on 17 October 2024. For FY 2024, CICT achieved a DPU of $0.1088, up 1.2% YoY.</p><p>The record date for the remaining DPU of $0.0329 is set for February, and unitholders can expect to receive it on 21 March.</p><p>As of 31 December 2024, CICT’s committed portfolio occupancy stood at 96.7%. Its retail portfolio stood at 99.3% whilst its office and integrated development portfolios rose to 94.8% and 98.9%, respectively.</p><p>“In 2025, we remain committed to driving sustainable growth through active portfolio management and disciplined cost and capital management. We will also capitalise on growth opportunities while staying agile and responsive to market changes,” Teo Swee Lian, chairman of CITC’s manager said.</p>\n</div>",
            "link": "https://sbr.com.sg/markets-investing/news/cicts-npi-13-yoy-in-h2-2024",
            "pub_date": "2025-02-05 11:01:05",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore deploys unmanned surface vessels for maritime security",
            "description": "<div class=\"nf__description\">\n<p><strong>These conduct patrols alongside manned ships.</strong></p><p>The Republic of Singapore Navy has announced that its Maritime Security Unmanned Surface Vessels (MARSEC USVs) have begun operational patrols in January 2025, helping manned ships in ensuring the security of the city-state's waters.</p><p>According to the government, the USVs, which can be operated by a two-man crew, were developed with the Defence Science &amp; Technology Agency and Defence Science Organisation National Laboratories. These are 16.9 metres long and have a speed in excess of 25 knots.</p><p>The vessels conduct patrols and can also investigate and interdict suspicious vessels, allowing Littoral Mission Vessels to focus on more complex missions.</p><p>These also use technologies, such as the Collision Detection and Collision Avoidance (CDCA) algorithm, that enable autonomous operations in congested maritime environments. The said system integrates the USV’s perception and navigation sensors, as well as collision detection equipment used for maritime navigation with an algorithm designed for the Navy’s operations.</p><p>“This rules-based system automates the collision avoidance decision-making process while ensuring that the USVs exhibit avoidance behaviour that complies with the Convention on the International Regulations for Preventing Collisions at Sea,” authorities said.</p><p>The CDCA algorithm was tested in trials and completed over 12 million kilometres of simulated distance with zero collisions, equivalent to 26 years of real-world testing. The USVs have also clocked over 1000 hours of real-world autonomous operations, with zero need for human intervention.       </p>\n</div>",
            "link": "https://sbr.com.sg/news/singapore-deploys-unmanned-surface-vessels-maritime-security",
            "pub_date": "2025-02-05 10:40:55",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "STI's year-end target maintained at 3950",
            "description": "<div class=\"nf__description\">\n<p><strong>It is expected to move sideways as tariff uncertainties resurface.</strong></p><p>The Straits Times Index (STI) <a href=\"https://sbr.com.sg/stocks/news/singapores-sti-projected-hit-3950-2025-strong-bank-performance-dbs\">year-end target</a> remains at 3950 despite renewed tariff uncertainties and shifting market dynamics, DBS reported.</p><p>Whilst the index has gained 6.3% since the US Presidential election, analysts expect it to trade sideways as investors focus on the upcoming 4Q24/FY24 earnings season and President Trump’s policy direction.</p><p>The Singapore Budget 2025 and recent General Election developments are unlikely to have a significant market impact.</p><p>Analysts favour Sembcorp Industries, AEM Holdings, DFI Retail, and iFAST ahead of earnings season. Sembcorp is expected to deliver strong results and positive guidance, whilst AEM’s 4Q24 performance should set the tone for FY25.</p><p>Meanwhile, DFI Retail could see upside from its Yonghui disposal proceeds, and iFAST is positioned for further pension business growth. Conversely, caution is advised on SIA, Genting Singapore, and SATS due to potential headwinds.</p><p>Market skepticism surrounds President Trump’s latest tariff moves, which may be used to offset tax cuts.</p><p>\"Tariffs will be a key source of funding for the Trump administration to balance the<br/>anticipated tax cuts,\" the report said.</p><p>The “Trump trade” has resulted in fewer rate cut expectations, higher treasury yields, and a stronger USD. Stocks expected to benefit include UOB, ST Engineering, ComfortDelGro, Seatrium, Venture, and Frencken, while REITs like FCT, CICT, and MINT could gain as market sentiment shifts.</p><p>Moreover, analysts highlighted stocks with resilient earnings, including ST Engineering, backed by a strong order backlog and potential defense spending increases.</p><p>Sheng Siong may also attract interest as cost-of-living concerns rise ahead of Budget 2025. ThaiBev’s improving fundamentals and Singtel’s potential from sector consolidation are also key investment themes for the year.</p>\n</div>",
            "link": "https://sbr.com.sg/stocks/news/stis-year-end-target-maintained-3950",
            "pub_date": "2025-02-05 10:30:55",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore tourism grows with China-led visitor surge in 2024",
            "description": "<div class=\"nf__description\">\n<p><strong><meta content=\"uuidOpqJuNzQaOpN\" name=\"uuid\"/>The surge was due to the 30-day mutual visa exemption with Mainland China</strong></p><p>Singapore’s International Visitor Arrivals (IVA) increased by 21% year-on-year (YoY) from 16.5 million in 2023, the Singapore Tourism Board (STB) reported.</p><p>Visitors from Mainland China led inbound tourism with 3.08 million arrivals, followed by Indonesia (2.49 million), and India (1.20 million).</p><p>STB attributed this surge to the <a href=\"https://sbr.com.sg/hotels-tourism/news/singapore-china-set-30-day-visa-free-travel-arrangement\">30-day mutual visa exemption with Mainland China</a>, Singapore’s strong growth in air connectivity, and the increase in Changi Airport’s total international seat capacity to over 41 million in 2024.</p><p>Tourism Receipts (TR) in 9M2024 reached $22.4b, rising 10% YoY with all spend categories recording YoY growth.</p><p>The growth was driven by Sightseeing, Entertainment &amp; Gaming (SEG) at 25%, followed by Accommodation (+17%). Food &amp; Beverage (F&amp;B) and Shopping rose by 6% and +5%, respectively, whilst other categories, including airfares and business spending, also contributed to TR.</p><p>Of these receipts, $3.58b came from Mainland China, $2.13b from Indonesia, and $1.44b from Australia, excluding SEG.</p><p>In addition, this surge in tourism also created jobs for locals. According to STB, as of September 2024, the total tourism workforce has recovered to around 76,000 which is about 4% higher YoY.</p><p>“Our Tourism 2040 roadmap will guide our efforts to drive the next phase of quality tourism growth for Singapore. This will ensure Singapore continues to thrive as a world-class destination that meets the needs of the evolving global traveler,” Melissa Ow, chief executive of STB said.</p>\n</div>",
            "link": "https://sbr.com.sg/hotels-tourism/news/singapore-tourism-grows-china-led-visitor-surge-in-2024",
            "pub_date": "2025-02-05 10:20:49",
            "source": "sbr",
            "kind": 1,
            "language": "en"
        }
    ]
}