{
    "data": [
        {
            "id": 2992282,
            "title": "AMERISAFE Earnings Call: Profits Hold Amid Headwinds",
            "description": "<html><head></head><body><p>AMERISAFE, Inc. (<a data-ticker=\"AMSF\" href=\"https://www.tipranks.com/stocks/amsf\">(AMSF)</a>) has held its Q4 earnings call. Read on for the main highlights of the call. </p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>AMERISAFE struck a cautiously upbeat tone on its earnings call, highlighting solid growth and healthy profitability despite mounting headwinds. Management stressed that an 18.5% return on equity and a 91.3% combined ratio show the core workers’ compensation franchise remains strong, even as rising claim severity, medical <a data-autolink=\"true\" href=\"https://www.tipranks.com/economic-indicators/inflation-rate\">inflation</a>, and a soft pricing environment squeezed margins.</p>\n<h2>ROE, Combined Ratio Underscore Profit Discipline</h2>\n<p>AMERISAFE posted a full-year ROE of 18.5% and a conservative 91.3% combined ratio, signaling continued underwriting profitability. Executives framed these metrics as proof that disciplined risk selection and pricing are offsetting pressure from higher loss costs.</p>\n<h2>Top-Line Momentum in Gross Premiums Written</h2>\n<p>Gross premiums written climbed 11.7% in the quarter and 6.7% for the year, marking a seventh straight quarter of growth. Management pointed to sustained demand in its workers’ comp niche as evidence that the company is growing even in a prolonged soft market.</p>\n<h2>Voluntary Premiums and Earned Premiums Accelerate</h2>\n<p>Voluntary premium, the main driver of gross written premium, rose 10.5% in the quarter and 10.2% for the year, more than double the prior year’s pace. Net premiums earned increased 10.7% in the quarter to $73.6 million and 4.6% for the year to $283.0 million, bolstering revenue.</p>\n<h2>Retention and Policy Count Support Sustainable Growth</h2>\n<p>Renewal retention for policies offered renewal hit 93.7% in the quarter, reflecting strong customer loyalty. In-force policy count grew 10.2% over the year, showing AMERISAFE is expanding its footprint while holding onto existing business.</p>\n<h2>Favorable Prior-Year Development Cushions Losses</h2>\n<p>Favorable development from prior accident years totaled $7.6 million in the quarter and $33.9 million for the full year. This prior-year benefit, equal to roughly 10% to 12% of earned premium, helped offset current-year loss pressure and supported the combined ratio.</p>\n<h2>Investment Yield Edges Higher on Quality Portfolio</h2>\n<p>The tax-equivalent book yield on invested assets ticked up to 3.83%, three basis points higher than last year. Management emphasized a high-quality portfolio with an average AA- rating, roughly $797 million in cash and investments, and a duration of 4.3 years.</p>\n<h2>Profits Remain Positive Despite Headwinds</h2>\n<p>AMERISAFE reported full-year net income of $47.1 million and net operating income of $41.8 million, underscoring continued profitability. In the fourth quarter, net income was $10.4 million, or $0.55 per share, with operating net income of $9.8 million, or $0.51 per share.</p>\n<h2>Distribution Strategy and Efficiency Improvements</h2>\n<p>Management highlighted improved agency effectiveness, noting the contracted agency count has been cut by more than one-third in four years. Despite fewer agencies, AMERISAFE is generating more opportunities and binds, helped by tighter collaboration among sales, safety, and underwriting teams.</p>\n<h2>Targeted Growth in Niche Segments</h2>\n<p>The company continues to deepen its presence in select segments, with the services line increasing from 5.3% to 5.8% of the book. Agriculture also expanded from 6.0% to 7.3%, demonstrating growth within existing geographies and classes rather than broad diversification.</p>\n<h2>Balance Sheet Strength and Capital Deployment</h2>\n<p>Management underscored a strong balance sheet backed by $797 million in invested assets and cash. Book value per share stood at $13.39 after a special dividend late in the year, reflecting both solid capital levels and shareholder returns.</p>\n<h2>Higher Current Accident-Year Loss Ratio and Severity</h2>\n<p>The current accident-year loss ratio rose to 72% for the full year, up from a prior 71% assumption and above recent years. AMERISAFE recorded 25 claims exceeding $1 million, versus 18 in the prior year, leading management to increase its loss pick to reflect rising severity.</p>\n<h2>Reported Loss Ratios Show Deterioration</h2>\n<p>Reported loss ratios worsened, with the quarterly ratio rising to 64.5% from 56.4%, an 8.1-point increase. For the year, the loss ratio moved up to 60.0% from 58.1%, illustrating the impact of severity trends and softer pricing on underwriting margins.</p>\n<h2>Year-Over-Year Earnings Decline</h2>\n<p>Full-year net income slipped to $47.1 million from $55.4 million, about a 15% decline. Net operating income fell to $41.8 million from $48.4 million, roughly 13.6% lower, as margin pressure from claims and rate headwinds weighed on results.</p>\n<h2>Investment Income Drag on Results</h2>\n<p>Net investment income fell 7.6% for the year to $27.0 million, acting as a headwind to total earnings. While there was a modest sequential uptick in the latest quarter, the full-year decline added to the overall pressure on profitability.</p>\n<h2>Audit Premiums Normalize After Surge</h2>\n<p>Audit premium and adjustments contributed $12.6 million for the year, down sharply from $20.2 million previously. Management said this roughly 38% decline is consistent with expectations that an earlier spike in audit activity would moderate.</p>\n<h2>Soft Market Keeps Rate Pressure Intense</h2>\n<p>The company continues to operate in a soft workers’ compensation market, now in its twelfth year of rate declines. Filed rates are expected to be negative in the mid-single digits for 2026, maintaining pressure on pricing and loss ratios across the book.</p>\n<h2>Medical Inflation Adds to Cost Headwinds</h2>\n<p>Executives pointed to persistent medical inflation as a key driver of higher claim severity, particularly in home health services and prosthetic equipment. These cost pressures are contributing to upward trends in loss costs and complicate underwriting in long-tail claims.</p>\n<h2>Unrealized Losses Highlight Rate Sensitivity</h2>\n<p>The investment portfolio showed net unrealized losses of $5.5 million at quarter end, reflecting market volatility. Management noted that securities classified as held to maturity are carried at amortized cost, so these losses do not affect reported book value.</p>\n<h2>Large-Claim Volatility Clouds Earnings Visibility</h2>\n<p>Management described the uptick in $1 million-plus claims as lumpy, with volatility in large-loss frequency impacting results. This variability drove reserving changes and adjustments to the loss pick, adding an element of unpredictability to future earnings.</p>\n<h2>Expense Ratio and Margin Compression</h2>\n<p>The expense ratio was 29.2% for the quarter and 30.4% for the full year, elevated versus prior periods. Combined with higher loss costs, these operating expenses contributed to a tighter underwriting margin even as the combined ratio remained below 100.</p>\n<h2>Guidance Signals Caution on Rates and Loss Costs</h2>\n<p>Looking ahead, management expects 2026 filed rate changes to remain negative in the mid-single-digit range. They plan to carry a 72% accident-year loss pick into 2026, citing mid-single-digit loss cost trends, continued severity in large claims, solid retention, ongoing premium growth, and a strong capital and investment position.</p>\n<p>AMERISAFE’s earnings call painted a picture of a firm that is still generating attractive returns yet facing meaningful external pressures. For investors, the story is one of disciplined underwriting and capital strength, balanced against softer pricing, medical inflation, and large-claim volatility that will require close monitoring in the coming year.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_2088641584-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/amerisafe-earnings-call-profits-hold-amid-headwinds",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 08:27:35",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2992285,
            "title": "APA Corp. Earnings Call Highlights Cost Wins, Cash Surge",
            "description": "<html><head></head><body><p>APA Corp. (<a data-ticker=\"APA\" href=\"https://www.tipranks.com/stocks/apa\">(APA)</a>) has held its Q4 earnings call. Read on for the main highlights of the call. </p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>APA Corp.’s latest earnings call carried a distinctly upbeat tone, as management emphasized ahead‑of‑schedule cost reductions, robust free cash flow and solid reserve growth despite weaker oil prices. While they acknowledged short‑term operational hiccups in Egypt and some looming cost and decommissioning pressures, executives framed these as manageable against a backdrop of improving balance-sheet health and a deep, highly economic Permian inventory.</p>\n<h2>Cost Cuts Running Well Ahead of Schedule</h2>\n<p>APA underscored its cost leadership push, noting that it captured more than $300 million of savings in 2025 and exited the year at a $350 million controllable-spend run rate, reaching its target two years early. Management now expects incremental reductions through 2026, targeting a $450 million run rate by year-end alongside a further $200 million decline in controllable spend that should structurally lift margins.</p>\n<h2>Free Cash Flow Fuels Shareholder Returns</h2>\n<p>The company generated over $1.0 billion in free cash flow for 2025 and returned about $640 million, or roughly 63%, to shareholders via dividends and buybacks. In the fourth quarter alone, APA produced $425 million of free cash flow and returned $154 million, underscoring its commitment to capital discipline and a payout framework that ties distributions to underlying cash generation.</p>\n<h2>Balance-Sheet Repair Gathers Pace</h2>\n<p>Net debt ended 2025 just under $4.0 billion, a reduction of about $1.4 billion versus year-end 2024 as free cash flow was steered toward deleveraging. Interest expense fell by roughly $80 million year-on-year, and management reiterated its long-term net-debt target of $3.0 billion, positioning the company for more flexibility through the cycle and additional optionality on future shareholder returns.</p>\n<h2>Reserves Grow Despite Lower Oil Prices</h2>\n<p>APA reported a roughly 9% year-over-year increase in proved reserves, pushing the portfolio above 1.0 billion barrels of oil equivalent even as SEC oil prices fell 13%. The all-in reserve replacement ratio exceeded 160% for 2025, signaling that the company is not only replenishing but expanding its resource base and doing so under less supportive price assumptions.</p>\n<h2>Permian Efficiency Delivers More with Less</h2>\n<p>In the Permian, APA beat oil production guidance every quarter in 2025 despite spending less capital than planned, highlighting significant operational gains. Average drilling and completion costs dropped to about $595 per lateral foot in the Midland Basin and $750 in the Delaware, with late-2025 wells as low as under $500 and $700 per foot respectively, representing roughly a 30% improvement versus prior periods.</p>\n<h2>Deep, High-Quality Permian Inventory</h2>\n<p>Management detailed a sizable runway of high-return projects, citing around 1,700 operated locations in economic inventory at a minimum 10% rate-of-return threshold plus another 1,700 locations categorized as technical upside. They expressed confidence that this inventory can sustain current oil production levels for at least the next decade, with a planned four-well First Bone Spring appraisal potentially converting about a year of drilling from technical to economic inventory.</p>\n<h2>Egypt Shifts to Gas-Led Growth</h2>\n<p>APA highlighted momentum in Egypt as it pivots to a gas-focused program under a new pricing framework that improves project economics. Gross gas production is expected to reach about 540–550 million cubic feet per day in 2026, up from 501 million cubic feet per day in the fourth quarter after temporary pipeline issues were resolved, supported by a roughly $500 million capital program aimed at modest BOE growth and sustained gas expansion.</p>\n<h2>Trading and Marketing Remain a Profit Engine</h2>\n<p>The company’s oil and gas trading and marketing arm continues to be a meaningful earnings lever, with management guiding to about $650 million of pretax income from these activities in 2026. Cumulatively, APA expects nearly $2 billion of pretax trading and marketing income over the 2020–2025 period, providing a powerful supplement to upstream cash flows while market spreads remain favorable.</p>\n<h2>Suriname and Exploration Offer Long-Term Upside</h2>\n<p>APA is advancing the GranMorgu development offshore Suriname, allocating roughly $230 million in 2026 as operator Total continues execution toward a mid-2028 first-oil target. Exploration spending of about $70 million next year will support Alaska preparations and a return to Suriname’s Block 58 in late fourth quarter, while the Alaska Sockeye discovery underpins appraisal plans slated for early 2027 and adds to longer-dated option value.</p>\n<h2>Egypt Pipeline Issues Dent Q4 Gas Volumes</h2>\n<p>Not all the news was positive, as the company missed its fourth-quarter gas guidance in Egypt after unplanned pipeline disruptions late in the period temporarily curtailed volumes. Gross gas production came in at 501 million cubic feet per day, and although operations have since resumed, the episode highlighted the region’s infrastructure sensitivity and its potential to create short-term volatility.</p>\n<h2>LOE and Market Pressures on the Horizon</h2>\n<p>Lease operating expenses came in better than expected in the fourth quarter thanks to ongoing cost initiatives, but management cautioned that 2026 LOE will likely run slightly above 2025 levels. Market-related factors, particularly in the Permian and North Sea, are driving the anticipated uptick even as APA invests about $100 million in Permian LOE-reduction projects that should generate $3–3.5 million in monthly savings once fully ramped.</p>\n<h2>Higher Decommissioning Spend Hits Near-Term Cash</h2>\n<p>The company flagged a rise in decommissioning and asset-retirement obligations, projecting combined gross spending of about $280 million in 2026 and roughly $225 million on a net basis after North Sea tax benefits. While this step-up will weigh on near-term cash outflows, management cast it as necessary cleanup that reduces long-term liability overhang and aligns with regulatory requirements in its mature basins.</p>\n<h2>Noncore Egyptian Exit Trims Volumes, Not Cash</h2>\n<p>APA elected to withdraw from a small noncore concession in Egypt that sits outside its merged concession area and does not benefit from the new gas-pricing framework. The asset was not generating free cash flow, so the exit is expected to have little financial impact beyond a modest reduction in reported oil and gas volumes, allowing capital and attention to be redirected to higher-margin opportunities.</p>\n<h2>Q4 One-Off Accounting Items Distort GAAP</h2>\n<p>Fourth-quarter GAAP results reflected several noncore accounting items, including about $36 million in noncash impairments and roughly $29 million of unrealized hedge losses. These were partially offset by a $47 million gain tied to decommissioning contingencies, leading to reported net income of $279 million and adjusted net income of $324 million, a gap that investors will likely focus on when assessing underlying performance.</p>\n<h2>Trading Income Exposed to Midstream Dynamics</h2>\n<p>Management stressed that trading and marketing income remains sensitive to Permian takeaway capacity and related regional price spreads, which are expected to evolve over time. While 2026 pretax trading contributions are forecast at about $650 million, the company anticipates this benefit will moderate in subsequent years if new pipelines and infrastructure compress the differentials that have supported outsized margins.</p>\n<h2>Weather Risks Cloud Early 2026 Production</h2>\n<p>After strong uptime in the Permian during the fourth quarter, APA has already seen about 3,000 barrels per day of weather-related downtime in the first quarter of 2026. Executives warned that first-quarter weather is often materially more disruptive than late-year conditions, implying that investors should brace for some seasonal softness in volumes despite underlying operational improvements.</p>\n<h2>Disciplined 2026 Plan and Steady Output</h2>\n<p>Looking ahead, APA guided to a disciplined $2.1 billion portfolio spend in 2026, roughly 10% lower year-on-year, with about $1.3 billion earmarked for U.S. development and around $500 million for Egypt. The plan targets flat U.S. oil production of roughly 120–122 thousand barrels per day and slight BOE growth in Egypt, supported by a large Permian inventory, rising gas output and an expected $650 million pretax boost from trading and marketing.</p>\n<p>APA’s earnings call painted the picture of a company tightening its cost base, expanding its reserves and paying down debt while still returning the bulk of free cash flow to shareholders. Though weather risks, higher decommissioning outlays, modest LOE <a data-autolink=\"true\" href=\"https://www.tipranks.com/economic-indicators/inflation-rate\">inflation</a> and Egypt-specific events pose near-term headwinds, management’s disciplined capital plan and deep inventory suggest APA is positioned to deliver durable cash generation and further balance-sheet progress.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Energy-7-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/apa-corp-earnings-call-highlights-cost-wins-cash-surge",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 08:28:11",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2992289,
            "title": "Essential Utilities Earnings Call Highlights Growth and Risks",
            "description": "<html><head></head><body><p>Essential Utilities, Inc. (<a data-ticker=\"WTRG\" href=\"https://www.tipranks.com/stocks/wtrg\">(WTRG)</a>) has held its Q4 earnings call. Read on for the main highlights of the call. </p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Essential Utilities, Inc. struck an upbeat tone on its 2025 earnings call, framing the year as one of strong financial and operational execution despite several moving parts. Management emphasized robust revenue growth, EPS outperformance versus guidance, record infrastructure spending, and healthy credit metrics, while noting merger expenses, nonrecurring items, and regulatory timing as notable headwinds.</p>\n<h2>Revenue Growth</h2>\n<p>Total revenue climbed about 18.6% year over year, rising from roughly $2.1 billion to nearly $2.5 billion in 2025. Management credited this broad-based advance to both core utility operations and a sizable contribution from regulatory-driven revenue recoveries.</p>\n<h2>Earnings Per Share Outperformance</h2>\n<p>GAAP EPS reached $2.20 for 2025, topping the company’s guidance range of $2.07 to $2.11 and improving from $2.17 in 2024. Executives said EPS would still have exceeded guidance even if several favorable nonrecurring items were stripped out of the results.</p>\n<h2>Regulatory Recoveries Driving Revenue</h2>\n<p>Roughly $177.6 million of the revenue increase stemmed from regulatory recoveries, underscoring the value of timely rate mechanisms. In 2025 alone, completed recoveries generated $101.5 million of incremental annualized revenue, with about $92.6 million tied to water and wastewater operations.</p>\n<h2>Record Infrastructure Investment</h2>\n<p>Essential Utilities poured a record $1.4 billion into regulated infrastructure in 2025 to bolster system reliability and resilience. The company plans to raise that figure to $1.7 billion in 2026, signaling continued confidence in rate base growth and long-term earnings power.</p>\n<h2>Dividend Growth and Shareholder Returns</h2>\n<p>The board approved a 5.25% dividend increase in July 2025, continuing a long-standing pattern of steady payouts. The company has now delivered 35 dividend increases in 34 years and paid dividends for 80 consecutive years, while targeting a 60% to 65% payout ratio.</p>\n<h2>Operational Execution and Capital Work</h2>\n<p>Operationally, the utility replaced or retired more than 400 miles of main across its water and natural gas systems in 2025. Management highlighted ongoing main replacement efforts and the integration of new municipal wastewater systems in Pennsylvania and North Carolina as key value drivers.</p>\n<h2>Acquisitions and Customer Additions</h2>\n<p>The company closed three water and wastewater acquisitions in 2025 for about $58 million, adding over 12,700 customers to its regulated base. Three additional signed transactions are expected to close in 2026, extending Essential Utilities’ consolidation strategy in fragmented local markets.</p>\n<h2>Merger Progress and Regulatory Filings</h2>\n<p>On the larger merger front, shareholders approved the deal in record time, clearing a key milestone for management. By year-end 2025, seven state filings had been completed, with procedural schedules set in most jurisdictions and a targeted closing date in 2027 still on the table.</p>\n<h2>Sustainability and Reputation Recognition</h2>\n<p>The company’s ESG profile continued to garner national attention, adding credibility with regulators and investors alike. Essential Utilities was again named one of America’s Climate Leaders by USA TODAY and one of Newsweek’s Most Responsible Companies, marking its third and fifth consecutive appearances, respectively.</p>\n<h2>Guidance Reaffirmation and Long-Term Targets</h2>\n<p>Management reaffirmed its 5% to 7% multiyear EPS CAGR goal for 2024 through 2027, anchored on 2024 non-GAAP EPS of $1.97. They also signaled confidence that credit metrics, including funds-from-operations-to-debt above roughly 12%, will remain comfortably aligned with rating agency expectations.</p>\n<h2>Nonrecurring and Other Items Impacting EPS</h2>\n<p>Underlying earnings faced a notable $0.48 per-share headwind from “other” items, including higher depreciation, interest, and taxes. Roughly half of that drag, about $0.24 per share, reflected the lapping of prior-year gains that did not repeat in 2025.</p>\n<h2>Merger-Related Expenses</h2>\n<p>Merger-related banking, legal, and advisory costs weighed on reported results and partially offset operational strength. Management framed these expenses as necessary investments to complete a transformative transaction expected to contribute to long-term growth.</p>\n<h2>Regulatory and Transaction Timing Uncertainty</h2>\n<p>The DELCORA wastewater acquisition remains on hold due to a federal court stay tied to the City of Chester’s bankruptcy process. This delay adds timing and execution risk to that specific deal and illustrates broader regulatory complexity around large transactions.</p>\n<h2>Higher Operating Costs and Volume Pressures</h2>\n<p>Operating and maintenance expense increased by $52.3 million, nudging O&amp;M up 0.9% year over year and trimming EPS by about $0.09. The company also cited a modest $0.02 EPS hit from lower water volumes, reflecting weather and consumption variability.</p>\n<h2>Weather and Prior-Year Items Complicate Comparisons</h2>\n<p>Year-over-year comparisons were clouded by one-off items, including a prior gain on the sale of a Pittsburgh-area energy project. Unusual 2024 weather patterns further distorted trends, prompting management to lean on non-GAAP metrics to present underlying performance.</p>\n<h2>Affordability and Regulatory Scrutiny Risks</h2>\n<p>Executives acknowledged rising national and state-level scrutiny around utility affordability that could influence future rate cases. Regulatory lag and separate dockets for merger and rate issues were flagged as ongoing risks that investors should monitor.</p>\n<h2>Forward-Looking Guidance and Capital Plans</h2>\n<p>Looking ahead, Essential Utilities expects to maintain 5% to 7% EPS growth through 2027 while lifting regulated infrastructure investment to $1.7 billion in 2026 from 2025’s record $1.4 billion. The company plans to keep its payout ratio in the 60% to 65% range, sustain dividend growth, pursue additional acquisitions, and close the pending merger in 2027 while preserving strong balance sheet metrics.</p>\n<p>Overall, the earnings call painted a picture of a utility leaning into growth through infrastructure, regulatory recoveries, and disciplined M&amp;A while carefully managing risk. For investors, Essential Utilities offered a blend of steady dividends, visible capital deployment, and measured earnings expansion, tempered by cost pressure and regulatory complexity that will remain central themes to watch.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_650529391-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/essential-utilities-earnings-call-highlights-growth-and-risks",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 08:28:43",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2992292,
            "title": "BioCryst Earnings Call Highlights Profits, Pipeline Momentum",
            "description": "<html><head></head><body><p>BioCryst Pharmaceuticals (<a data-ticker=\"BCRX\" href=\"https://www.tipranks.com/stocks/bcrx\">(BCRX)</a>) has held its Q4 earnings call. Read on for the main highlights of the call. </p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>BioCryst Pharmaceuticals’ latest earnings call painted a broadly optimistic picture, with management highlighting record profitability, strong ORLADEYO growth, and a fortified balance sheet supporting an ambitious R&amp;D agenda. While executives acknowledged near‑term headwinds from seasonal dynamics, higher 2026 R&amp;D spending, and regulatory timing risks, they argued these are manageable against the backdrop of robust clinical data and scalable commercial execution.</p>\n<h2>Record ORLADEYO Full‑Year Revenue</h2>\n<p>BioCryst delivered full‑year 2025 ORLADEYO revenue of $601.8 million, a 38% year‑over‑year increase and 43% growth when excluding the divested European business. Management framed this performance as evidence that ORLADEYO remains a powerful growth engine in hereditary angioedema, even after shedding a non‑core geography.</p>\n<h2>Strong Overall Revenue and Profitability</h2>\n<p>Total non‑GAAP revenue in 2025 climbed 45% year over year, with ORLADEYO contributing roughly $169 million of incremental non‑GAAP revenue, or about 43% growth. Non‑GAAP operating profit surged to $214 million, up 198% from the prior year and the highest in the company’s history, underscoring operating leverage as the franchise scales.</p>\n<h2>Robust Balance Sheet and Financing Optionality</h2>\n<p>The company ended 2025 with $337.5 million in cash and investments, providing a solid liquidity cushion as it advances late‑stage programs. A $400 million financing facility with Blackstone Life Sciences adds further optionality, giving BioCryst flexibility to fund development, manage risk, and potentially accelerate strategic initiatives without immediate equity dilution.</p>\n<h2>Pediatric Approval for ORLADEYO Pellets</h2>\n<p>The December 2025 FDA approval of ORLADEYO pellets for children aged 2 to under 12 marks a strategic expansion of the franchise into younger patients. Management has baked only a small pediatric contribution into 2026 guidance, but emphasized the long‑term upside as diagnosis improves and treatment rates in children move closer to adult levels.</p>\n<h2>Navenibart Clinical Efficacy and Development Progress</h2>\n<p>Navenibart’s Phase II ALPHA‑SOLAR data showed striking efficacy, with mean attack rate reductions of 92% on an every‑three‑month schedule and 90% on an every‑six‑month schedule. Patients saw mean attack rates fall from 2.23 per month to 0.16, translating to fewer than two attacks per year, while median attack reductions reached 97%, supporting its potential as a best‑in‑class prophylactic.</p>\n<h2>Clear Regulatory &amp; Development Timeline for Navenibart</h2>\n<p>BioCryst outlined a structured path forward for navenibart, targeting completion of the pivotal Phase III enrollment of 145 patients around mid‑2026. The company plans to submit a biologics license application by the end of 2027, driven largely by the need for 12 months of safety data, with an eye toward potential U.S. approval in late 2028 if timelines and regulatory interactions remain on track.</p>\n<h2>BCX17725 Early‑Stage Results and Patient Study Initiation</h2>\n<p>In early development, BCX17725’s Phase I data showed the drug was safe and well tolerated in healthy volunteers, with linear exposure, epidermal distribution, and a half‑life of roughly 12 to 19 days. BioCryst is prioritizing patient cohorts in Part 4 of the study, enrolling up to 12 patients to generate proof‑of‑concept data by year‑end 2026, which could support pipeline diversification beyond ORLADEYO and navenibart.</p>\n<h2>Commercial Execution and Patient Persistence</h2>\n<p>Management highlighted strong real‑world persistence on ORLADEYO, noting pivotal data where just over half of starters stayed on therapy for two years with a 91% attack reduction. In clinical practice, about 60% of patients remain on treatment after 12 months and nearly half of U.S. patients who have tried ORLADEYO over the past five years are still on therapy, supporting durable revenue and a sales and marketing return of roughly four times net sales.</p>\n<h2>Conservative, Disciplined Financial Guidance</h2>\n<p>For 2026, BioCryst guided ORLADEYO revenues to a range of $625 million to $645 million, implying about 13% growth versus 2025 when adjusted for Europe. Non‑GAAP operating expenses are expected at $450 million to $470 million, including costs from the Astria integration, with management stressing disciplined R&amp;D spending and rigorous capital allocation as late‑stage programs peak.</p>\n<h2>European Business Divestiture and Impact</h2>\n<p>The sale of the European ORLADEYO business, described as loss‑making, reduces reported revenue but improves the profitability mix and refocuses resources on higher‑margin markets. With the U.S. now representing more than 90% of sales, investors must weigh the benefit of stronger margins against the reduction in geographic diversification and increased dependence on one market.</p>\n<h2>Q1 Reauthorization Headwind</h2>\n<p>Executives cautioned that first‑quarter 2026 revenue is likely to dip slightly versus the fourth quarter because of annual payer reauthorizations. During this period, BioCryst expects higher co‑pay assistance, more free product, and the absence of the prior year’s Medicare policy tailwind to temporarily pressure reported sales before volumes normalize and rebound in the second quarter.</p>\n<h2>Near‑Term R&amp;D Cost Increase</h2>\n<p>R&amp;D spending is set to rise in 2026 as BioCryst completes the navenibart Phase III program and undertakes biologics license application‑enabling chemistry, manufacturing, and controls work. Management framed this as a deliberate, time‑bounded investment, guiding that R&amp;D intensity should ease beyond 2026 once critical late‑stage milestones are met and the pipeline transitions toward potential commercialization.</p>\n<h2>Pediatric Uptake Uncertainty</h2>\n<p>Despite the new pediatric approval, executives acknowledged uncertainty around how quickly children aged 2 to under 12 will start treatment, given under‑diagnosis and lower treatment rates versus adults. As a result, the company has only modest pediatric volumes in its 2026 forecast, leaving room for upside if awareness campaigns, diagnosis rates, and physician comfort with the pellets accelerate adoption.</p>\n<h2>Predictability of ORLADEYO Super Responders</h2>\n<p>The company noted there are no reliable predictors for which patients will become ORLADEYO “super responders,” who experience exceptionally large attack reductions. Physicians and patients generally need three to six months on therapy to gauge response, which introduces some element of trial‑and‑error and potential early churn but also allows strong responders to be identified and retained over the long term.</p>\n<h2>Development and Regulatory Timing Risks</h2>\n<p>BioCryst emphasized that navenibart timelines are still subject to operational and regulatory variables, including the pace of enrollment and the requirement for a full year of safety follow‑up on the last patient. The biologics license application schedule also depends on alignment with regulators, leaving the late‑2028 approval goal exposed to potential delays from slower recruitment or shifting agency review timing.</p>\n<h2>Guidance and Longer‑Term Outlook</h2>\n<p>Looking ahead, management’s 2026 guide calls for mid‑teens ORLADEYO growth off an already elevated base, underpinned by price, patient adds, and a small pediatric contribution. BioCryst believes it can reach $1 billion in peak ORLADEYO revenue by 2029 with roughly 150 net new patients per year, supported by strong cash reserves, the $400 million Blackstone facility, and progressing timelines toward a navenibart filing by 2027 and potential approval in 2028.</p>\n<p>BioCryst’s call balanced near‑term caution with long‑term confidence, anchored by record non‑GAAP operating profit and compelling efficacy data from its late‑stage pipeline. For investors, the story now hinges on steady ORLADEYO execution through seasonal and reimbursement noise, disciplined management of elevated 2026 R&amp;D, and timely advancement of navenibart and BCX17725 to sustain growth beyond the current flagship franchise.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_390599908-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/biocryst-earnings-call-highlights-profits-pipeline-momentum",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 08:29:18",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2992293,
            "title": "Churchill Downs Earnings Call Highlights Derby-Fueled Growth",
            "description": "<html><head></head><body><p>Churchill Downs (<a data-ticker=\"CHDN\" href=\"https://www.tipranks.com/stocks/chdn\">(CHDN)</a>) has held its Q4 earnings call. Read on for the main highlights of the call. </p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Churchill Downs’ latest earnings call struck an upbeat tone as management highlighted record net revenue, record adjusted EBITDA and a powerful $700 million in free cash flow for 2025. While earnings came in just shy of last year’s peak and some regional pressures surfaced, executives framed these as manageable headwinds against a strong growth and deleveraging story into 2026.</p>\n<h2>Record Revenue and Adjusted EBITDA Streak Extends</h2>\n<p>Churchill Downs reported record net revenue and record adjusted EBITDA for 2025, including record fourth-quarter figures. Excluding the pandemic year, this marks nine consecutive years of record top-line and adjusted EBITDA performance, reinforcing the company’s ability to compound growth through both its racing and gaming platforms.</p>\n<h2>Kentucky Derby and Derby Week Powerhouse</h2>\n<p>The Kentucky Derby franchise remained the crown jewel, delivering record handle for the race, Derby Day program and Derby Week overall. The company also posted the highest television ratings in nearly four decades and expects the 2026 Derby to generate an additional $15 million to $20 million of incremental adjusted EBITDA.</p>\n<h2>Robust Free Cash Flow and Shareholder Returns</h2>\n<p>Free cash flow surged to a record $700 million, or $9.75 per share, underscoring the cash-generative nature of the portfolio. Management deployed this strength by repurchasing over 4.2 million shares, returning more than $456 million to shareholders through buybacks and dividends, and extending its streak of annual dividend-per-share increases to 15 years.</p>\n<h2>HRM Footprint Expansion and New Projects</h2>\n<p>The company continued to build out its historical racing machine network with new openings in Owensboro, Marshall Yards and Roseshire, alongside progress on The Rose project. It also announced a major $180 million to $200 million investment in the Rockingham Grand Casino in Salem, New Hampshire, signaling confidence in long-term regional demand.</p>\n<h2>Wagering Services Growth Led by Exacta</h2>\n<p>The Wagering Services and Solutions segment posted a 7% increase in adjusted EBITDA for 2025, driven primarily by growth in Exacta. Management highlighted ongoing momentum in business-to-business deployments, adding new customers in Kansas and Alabama that broaden the distribution of its wagering technology.</p>\n<h2>Electronic Table Games as a New Growth Avenue</h2>\n<p>Churchill Downs secured regulatory approval in Kentucky and launched roulette electronic table games in early February, opening a new product channel. While the ETG rollout contributed nothing to 2025 results, the company views the early-stage deployment and potential additions like craps and blackjack as a meaningful long-term earnings lever.</p>\n<h2>Churchill Downs Racetrack Upgrades and Capacity Gains</h2>\n<p>At the flagship racetrack, the company completed renovations including the starting gate Pavilion for roughly 8,100 guests and a redesigned Paddock. Ongoing work on the Mansion and Finish Line Suites remains on time and on budget, and the upcoming Victory Run project will add about 1,400 seats, a 22% capacity boost in that premium area.</p>\n<h2>Disciplined Capital Allocation and Leverage Management</h2>\n<p>Maintenance capital expenditure totaled $70 million in 2025 with expectations rising to $90 million to $110 million in 2026, while project capex was $205 million and is guided to $180 million to $220 million next year. Bank covenant net leverage stood at 4.1x at year-end 2025, and management anticipates this ratio falling below 4.0x during 2026 as strong cash flow supports further balance sheet improvement.</p>\n<h2>Earnings Below Peak Amid Tough Comparisons</h2>\n<p>Despite record revenue and adjusted EBITDA, management acknowledged that overall earnings landed slightly below the prior year’s record level. The company cited challenging year-over-year comparisons and pockets of economic uncertainty earlier in 2025, but stressed that core demand trends and project execution remain on track.</p>\n<h2>Tariff Volatility and Sales-Cycle Disruptions</h2>\n<p>Executives flagged that <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/stocks-hurt-by-trump-tariffs\">tariff</a>-related volatility and broader macro uncertainty disrupted the sales process for certain events late in the selling cycle. This timing issue weighed on revenue cadence earlier in 2025, but was portrayed as a transitory factor rather than a structural change in demand.</p>\n<h2>Regional Gaming Margins Face Mild Pressure</h2>\n<p>Same-store wholly owned casino margins, excluding racing, slipped by 0.8 percentage points versus 2024, with softness concentrated in Mississippi. Management linked this modest compression to local market challenges and emphasized that the overall regional portfolio remains resilient and profitable.</p>\n<h2>Weather and Local Issues Temporarily Impact Operations</h2>\n<p>Significant January weather events and localized disruptions, including roadwork and curfews in Mississippi plus adverse conditions in December, created short-term revenue headwinds. The company noted that underlying customer demand held up well once these temporary obstacles eased.</p>\n<h2>Deliberate ETG Rollout Strategy</h2>\n<p>The ETG initiative remains in a measured ramp-up phase, starting with roulette and expanding only as products prove themselves with customers and regulators. Management stressed that ETGs provided no incremental benefit to 2025 results and are being managed as a multi-year earnings opportunity rather than a quick fix.</p>\n<h2>Regulatory and Legislative Uncertainty</h2>\n<p>The company continues to monitor legislative developments around iGaming and other competitive shifts, calling out Virginia discussions as a potential risk to its operations there. While management views iGaming as unfavorable for its Virginia properties, it framed this as an ongoing policy watch item rather than an immediate financial shock.</p>\n<h2>Guidance Signals Confident 2026 Outlook</h2>\n<p>Looking ahead, Churchill Downs expects the 2026 Kentucky Derby to contribute $15 million to $20 million of incremental adjusted EBITDA as Derby Week expands to seven live race dates across eight days with attendance around 75,000 and pacing already ahead of prior years. Project capex is projected at $180 million to $220 million, maintenance capex at $90 million to $110 million and leverage is expected to drop below 4.0x, supported by continued strong cash generation after 2025’s $700 million free cash flow.</p>\n<p>Overall, the earnings call painted the picture of a company leaning into its marquee Derby brand, expanding HRM and ETG platforms and returning significant capital while keeping leverage in check. Short-term margin and macro bumps were acknowledged but framed as manageable, leaving investors with a narrative centered on sustained cash flow, disciplined investment and a constructive growth trajectory into 2026 and beyond.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Consumer-Cylical-5-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/churchill-downs-earnings-call-highlights-derby-fueled-growth",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 08:29:51",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2992241,
            "title": "Intellia Therapeutics Eyes 2026 Pivotal CRISPR Milestone",
            "description": "<html><head></head><body><p>Intellia Therapeutics Inc (<a data-ticker=\"NTLA\" href=\"https://www.tipranks.com/stocks/ntla\">(NTLA)</a>) has held its Q4 earnings call. Read on for the main highlights of the call. </p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Intellia Therapeutics’ latest earnings call struck a cautiously optimistic tone, blending clinical momentum and strengthening financial discipline with serious safety and regulatory overhangs. Management leaned into the potential of lonvo-z as a first-in-class in vivo CRISPR therapy while acknowledging that the unresolved FDA hold on the key cardiomyopathy program continues to cap investor confidence.</p>\n<h2>Lonvo-z Phase 3 on Track for First Pivotal CRISPR Readout</h2>\n<p>Intellia confirmed that the HAELO Phase 3 trial of lonvo-z in hereditary angioedema is fully enrolled, with 80 patients recruited in roughly nine months. Top-line data are expected by mid-2026, and the company is targeting a BLA filing in the second half of 2026, positioning lonvo-z for the first pivotal readout of an in vivo CRISPR gene-editing therapy.</p>\n<h2>Robust Patient and Physician Appetite for Gene Editing in HAE</h2>\n<p>Survey work suggests a receptive U.S. market for lonvo-z if the data hold up, with 99% of patients indicating at least some willingness to take a gene-editing therapy and nearly two-thirds reporting they are extremely or very likely to do so. Among 151 U.S. physicians managing more than 4,000 patients, 92% said they could identify candidates and estimated they would prescribe lonvo-z to roughly 2,200, or about 54% of their treated population.</p>\n<h2>Durable Efficacy Signals Support Lonvo-z’s One-Time Treatment Thesis</h2>\n<p>Management highlighted durability data from early-phase studies, noting up to three years of follow-up without evidence of waning serum kallikrein or TTR suppression. A pooled analysis showed that 76% of patients at least one year beyond a 50 mg dose were free of attacks and off ongoing therapy for 12 months or more, a stark contrast with current prophylactics, where roughly 20% of patients remain attack-free.</p>\n<h2>Q4 2025 Numbers Show Improving P&amp;L Discipline</h2>\n<p>On the financial front, Intellia delivered stronger fourth-quarter metrics, with collaboration revenue rising to $23.0 million from $12.9 million, a gain of about 78% year over year. R&amp;D spending fell to $88.7 million from $116.9 million, helping narrow the quarterly net loss to $95.8 million from $128.9 million, a sign of tightening cost control as key trials mature.</p>\n<h2>Cash Runway Extends into 2027 but Headroom Has Shrunk</h2>\n<p>The company closed 2025 with $605.1 million in cash, cash equivalents and marketable securities, down from $861.7 million a year earlier, a roughly 30% decline. Management believes this balance is sufficient to fund operations into the second half of 2027 and carry Intellia through major lonvo-z milestones, while commercial manufacturing, field teams and payer outreach for a possible launch are already largely in place.</p>\n<h2>MAGNITUDE-2 ATTR Polyneuropathy Program Back in Motion</h2>\n<p>Regulatory fortunes were mixed, with the FDA lifting the clinical hold on MAGNITUDE-2 for ATTR polyneuropathy in late January after agreeing on tighter safety measures. The study now includes additional early post-dose liver testing, a short-course steroid protocol for liver function spikes and refined screening, and its enrollment target has risen to about 60 patients, with 47 already recruited heading into an expected completion in the second half of 2026.</p>\n<h2>Cardiomyopathy Trial Remains Frozen Under FDA Scrutiny</h2>\n<p>By contrast, MAGNITUDE in ATTR cardiomyopathy remains on full clinical hold after serious liver enzyme and bilirubin elevations in one patient, halting a trial that had already enrolled more than 650 participants, above its original 550-patient plan. Intellia is in ongoing dialogue with regulators and has proposed similar risk-mitigation steps, but no green light has yet been granted, leaving the largest commercial opportunity in limbo.</p>\n<h2>Serious Adverse Event Clouds Safety Profile and Adds Risk</h2>\n<p>The safety narrative was dominated by a patient in MAGNITUDE who developed Grade 4 elevations in liver transaminases and bilirubin and later died from a ruptured duodenal ulcer, with causality to treatment unclear. While the company said such severe liver events occurred in less than 1% of patients and appear immune-mediated, the mechanism is not fully understood, introducing meaningful regulatory and pipeline risk.</p>\n<h2>Cash Burn and Operational Disruption Highlight Execution Challenges</h2>\n<p>The roughly 30% year-over-year drop in cash underscores the cost of building a first-wave CRISPR business despite the improved quarterly loss profile. Operationally, the October enrollment suspension in MAGNITUDE and MAGNITUDE-2, subsequent FDA pauses and protocol amendments have added complexity and time, even as MAGNITUDE-2 now resumes under tighter monitoring requirements.</p>\n<h2>Pipeline Read-Through and HAE Reproducibility Remain Open Questions</h2>\n<p>Management acknowledged that it cannot yet definitively determine whether the liver toxicity signal is unique to the TTR target or could emerge in other in vivo CRISPR programs, leaving investors with unanswered questions about broader platform risk. Executives also flagged that Phase 1/2 HAE data came largely from ex-U.S. patients while Phase 3 includes U.S. subjects with potentially different baseline characteristics, creating some risk around how well early efficacy will translate.</p>\n<h2>Forward-Looking Outlook: Pivotal 2026 Data and Launch Ambitions</h2>\n<p>Looking ahead, Intellia framed 2026 as a pivotal year, with HAELO Phase 3 top-line lonvo-z data expected by mid-year, a planned BLA submission in the second half and a potential 2027 commercial launch if results and regulators cooperate. The company aims to complete MAGNITUDE-2 enrollment in the second half of 2026 under new liver-monitoring and steroid protocols, while managing a cash runway into late 2027 and betting that strong patient and physician interest will translate into substantial uptake if lonvo-z reaches the market.</p>\n<p>Intellia’s call painted the picture of a high-upside but high-risk story, with lonvo-z nearing a watershed CRISPR readout that could redefine HAE treatment and the company’s valuation. Yet the unresolved cardiomyopathy hold, safety uncertainties and a shrinking cash cushion temper the bull case, leaving investors to weigh breakthrough potential against regulatory and execution hazards over the next 18 to 24 months.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_1931544818-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/intellia-therapeutics-eyes-2026-pivotal-crispr-milestone",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 08:20:57",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991972,
            "title": "Northern Oil and Gas Earnings Call Balances Upside and Risk",
            "description": "<html><head></head><body><p>Northern Oil And Gas (<a data-ticker=\"NOG\" href=\"https://www.tipranks.com/stocks/nog\">(NOG)</a>) has held its Q4 earnings call. Read on for the main highlights of the call. </p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Northern Oil and Gas’ latest earnings call painted a mixed but ultimately constructive picture for investors. Management highlighted strong cash generation, growing production and a fortified balance sheet, even as GAAP results were hit by large non‑cash impairments and weaker commodity realizations. The tone was confident about dividend durability and upside leverage to a future recovery, while candid on near‑term volatility and activity uncertainty.</p>\n<h2>Robust Adjusted EBITDA and Free Cash Flow</h2>\n<p>Northern Oil and Gas reported adjusted EBITDA of $1.63 billion for 2025, with Q4 contributing $367 million, underscoring resilient profitability in a softer price environment. Full‑year free cash flow reached $424 million and Q4 generated $43 million, showing that the business continues to throw off meaningful cash even as commodity headwinds weigh on realized pricing.</p>\n<h2>Production Growth and Record Gas Volumes</h2>\n<p>Average daily production in Q4 climbed to 140,000 BOE per day, up 7% sequentially and 6% year over year, while full‑year volumes averaged 135,000 BOE per day, a 9% increase versus 2024. The Appalachian JV was a standout, with gas volumes hitting a third straight quarterly record at 392 MMcf per day, up 11% from Q3 and 24% from the prior year.</p>\n<h2>Ground Game Delivers Acreage Expansion</h2>\n<p>The company leaned on its non‑operated “ground game” to expand its footprint, adding more than 12,000 net acres in 2025 and ending the year with roughly 12,300 plus acres and 12.8 net wells. Q4 was a record quarter, with over 6,000 net acres and 1.2 net wells acquired across 33 deals, drawn from more than 700 evaluated opportunities, highlighting a highly selective but active acquisition engine.</p>\n<h2>Strategic Utica Deal Scales Appalachia</h2>\n<p>A centerpiece of the year was the integrated Utica acquisition alongside Infinity, anchored by assets operated by Antero. The transaction boosts Northern’s Appalachian footprint by about 45% on a pro forma basis to roughly 90,000 net acres and adds more than 100 identified gross locations, providing meaningful inventory depth and optionality across both upstream and midstream.</p>\n<h2>Liquidity Bolstered and Debt Ladder Extended</h2>\n<p>Management moved aggressively on the balance sheet, extending the revolving credit facility maturity from June 2027 to November 2030 while lifting the borrowing base to $1.975 billion and elected commitments to $1.8 billion. The company also issued $725 million of notes at 7.875%, retiring most of its 2028 notes and ending the year with more than $1 billion of liquidity following the Utica close.</p>\n<h2>Cost Efficiencies and Operational Improvements</h2>\n<p>Operationally, Northern continues to benefit from longer laterals and lower well costs, with normalized lateral lengths around 13,000 feet and normalized well costs down nearly 5% quarter over quarter. Lease operating expense improved in Q4 to $9.30 per BOE, a 5% reduction versus Q3 and 3% lower than Q4 2024, reflecting efficiency gains despite a challenging cost environment.</p>\n<h2>Disciplined Capital Allocation Across Basins</h2>\n<p>For 2025, total capital spending excluding non‑budgeted acquisitions came in at $1.0 billion, including $174 million devoted to the ground game. In Q4, CapEx excluding non‑budgeted deals totaled $270 million, with about 44% directed to the Permian, 26% to the Williston, 8% to the Uinta and 22% to Appalachia, and roughly $193 million going to organic development projects.</p>\n<h2>Dividend Resilience and Hedging Support</h2>\n<p>Management underscored that the dividend is designed to be sustainable even in a significantly weaker commodity backdrop, pointing to modest EBITDA growth despite lower prices. Adjusted EBITDA rose about 1% year over year even as average oil prices fell around 14% in 2025, a performance credited largely to effective hedging and disciplined capital allocation.</p>\n<h2>Non‑Cash Impairments Cloud GAAP Results</h2>\n<p>On the downside, reported GAAP earnings were heavily impacted by $703 million of non‑cash impairments recorded over 2025, including $270 million in Q4 alone. These write‑downs were tied to the full‑cost ceiling test and lower average oil prices, underlining how accounting rules can obscure underlying cash performance even when operations remain solid.</p>\n<h2>Weaker Realizations and Wider Differentials</h2>\n<p>Commodity realizations deteriorated, with oil differentials widening to $5.05 per barrel in Q4 from $3.89 in Q3 and averaging $5.53 for the year. Natural gas pricing was particularly pressured as realizations fell to 58% of benchmark in Q4 and averaged 79% for the year, down from 93% in 2024, driven by Waha weakness, softer NGL prices and unfavorable regional dynamics.</p>\n<h2>Oil Volumes Slip and Activity Visibility Declines</h2>\n<p>While total production grew, Q4 oil volumes of 75,000 barrels per day were up 3% sequentially but down 5% versus the prior year, reflecting mix and timing effects. Management flagged high uncertainty for 2026, citing deferred completions, operator curtailments and 13 net wells elected but not yet spud, which together introduce a wide range of possible activity outcomes.</p>\n<h2>Higher Maintenance Burden Lifts LOE</h2>\n<p>Despite efficiency gains late in the year, full‑year lease operating expense rose modestly to $9.61 per BOE, up 2% from 2024. The company attributed the increase to higher workover and maintenance costs associated with supporting growing volumes, highlighting that sustaining production across a broader asset base carries an incremental cost burden.</p>\n<h2>Share Price Pressure and Multiple Compression</h2>\n<p>Management acknowledged that shareholders did not fully benefit from the operational progress, as total equity returns were negative in 2025. The stock has suffered from multiple compression amid declining oil prices and broader market skepticism toward the sector, even as Northern improved its asset base, scale and cash generation capability.</p>\n<h2>Wide‑Range 2026 Guidance Signals Flexibility</h2>\n<p>For 2026, Northern issued a two‑case framework with low‑ and high‑activity scenarios covering production, operating costs and capital spending and assuming roughly 70 to 90 net wells. The program is anchored by about 45.6 net wells in process and 13 net wells elected but not yet spud, with a basin mix of around 40% Permian, 25% Appalachia, 25% Williston and 10% Uinta and well costs trending lower with 13,000‑foot laterals.</p>\n<h2>Forward‑Looking Outlook and Capital Optionality</h2>\n<p>Guidance suggests spending will be front‑loaded, with roughly 60% of CapEx in the first half while well activity remains roughly even, and Q1 typically slower before a Q2 ramp. In the low‑activity case, Northern expects lower oil volumes but materially reduced spending and significantly higher free cash flow at current strip, while the high‑activity case assumes fewer curtailments, more turn‑in‑lines and roughly a $100 to $150 million spending delta, with strong sensitivity to oil prices and ample liquidity to pursue either path.</p>\n<p>Northern Oil and Gas exits the year as a larger, more diversified and better‑funded non‑operator, yet one still exposed to commodity swings and operator timing. Investors are being asked to look past non‑cash impairments and near‑term pricing headwinds toward a flexible 2026 plan backed by strong liquidity, visible inventory and a dividend policy built to endure the downcycle and capture upside when conditions improve.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Energy-10-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/northern-oil-and-gas-earnings-call-balances-upside-and-risk",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 08:06:29",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991848,
            "title": "FrontView REIT Launches $75 Million At-The-Market Program",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>The latest update is out from FrontView REIT, Inc. ( <a data-ticker=\"FVR\" href=\"https://www.tipranks.com/stocks/fvr\">(FVR)</a> ).</p>\n<p></p>\n<p></p><p>On February 27, 2026, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/fvr\" target=\"_blank\" ;=\"\" rel=\"nofollow\">FrontView REIT, Inc.</a></span> and its operating partnership entered into a $75 million at-the-market equity distribution agreement with a syndicate of major broker-dealers to offer and sell shares of its common stock from time to time. The shares may be sold through the agents as sales agents or to them as principals in ordinary at-the-market transactions or negotiated deals, with the company paying commissions of up to 2.0% of gross sales proceeds.</p>\n<p>The agreement also enables FrontView to use forward sale arrangements, under which designated forward purchasers will initially borrow and sell shares, with the company expected to settle these contracts physically within three months to two years and receive cash proceeds at that time. The program, launched under an effective shelf registration, provides FrontView with a flexible mechanism to raise equity capital over time without committing to a fixed issuance schedule, potentially supporting its balance sheet management and future investment plans.</p>\n<p>The most recent analyst rating on <a data-ticker=\"FVR\" href=\"https://www.tipranks.com/stocks/fvr\">(FVR)</a> stock is a Buy with a $18.00 price target. To see the full list of analyst forecasts on FrontView REIT, Inc. stock, see the FVR <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/fvr/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on FVR Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, FVR is a Outperform.</p>\n<p>The score is driven primarily by strong cash generation and a notably improved balance sheet, reinforced by a constructive earnings update with raised AFFO guidance and high occupancy. Offsetting factors are inconsistent GAAP profitability (negative P/E) and only moderate momentum/valuation support despite the attractive dividend yield.</p>\n<p>To see Spark’s full report on FVR stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/fvr/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about FrontView REIT, Inc.</u></b></p>\n<p>FrontView REIT, Inc. is a real estate investment trust that raises capital through the issuance of common stock to support its real estate investment and operating activities. The company accesses public equity markets using shelf registration statements and at-the-market offering programs to provide flexible, ongoing funding for its portfolio and growth initiatives.</p>\n<p><b>Average Trading Volume:</b> 176,769</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $465.4M</p>\n<p></p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/shutterstock_1030918024-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/frontview-reit-launches-75-million-at-the-market-program",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 06:53:39",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991849,
            "title": "American Healthcare REIT Launches New $1.75 Billion ATM Program",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>American Healthcare REIT, Inc. ( <a data-ticker=\"AHR\" href=\"https://www.tipranks.com/stocks/ahr\">(AHR)</a> ) has provided an announcement.</p>\n<p></p>\n<p></p><p>On February 27, 2026, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ahr\" target=\"_blank\" ;=\"\" rel=\"nofollow\">American Healthcare REIT, Inc.</a></span> and its operating partnership entered into a new at-the-market equity offering sales agreement with a syndicate of major investment banks, enabling the company to sell up to $1.75 billion of common stock from time to time. Concurrently, the company terminated its prior ATM program, which still had about $230.1 million of unsold capacity, and set agent commissions at up to 2% of gross sales proceeds, with flexibility for negotiated, block, and exchange-based transactions.</p>\n<p>The structure also allows for forward sale agreements with designated banks acting as forward purchasers, under which shares may be borrowed and sold to hedge forward exposure, with pricing adjusted for interest and expected dividends. The company plans to contribute net proceeds from any issuances and forward settlements to its operating partnership for units redeemable into common stock, to be used for general corporate purposes such as debt repayment, working capital, capital expenditures, and potential future investments, enhancing balance-sheet flexibility and funding optionality.\n</p>\n<p>The most recent analyst rating on <a data-ticker=\"AHR\" href=\"https://www.tipranks.com/stocks/ahr\">(AHR)</a> stock is a Buy with a $55.00 price target. To see the full list of analyst forecasts on American Healthcare REIT, Inc. stock, see the AHR <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ahr/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on AHR Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, AHR is a Neutral.</p>\n<p>American Healthcare REIT, Inc. shows strong cash flow management and strategic growth initiatives, as highlighted in the earnings call and corporate events. However, profitability challenges and high valuation concerns weigh on the overall score. The stock’s technical indicators suggest a balanced outlook, with moderate bullish momentum.</p>\n<p>To see Spark’s full report on AHR stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ahr/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about American Healthcare REIT, Inc.</u></b></p>\n<p>American Healthcare REIT, Inc. is a real estate investment trust focused on healthcare-related properties, operating through its American Healthcare REIT Holdings, LP operating partnership. The company invests in and manages a portfolio of healthcare assets, using public equity and debt capital markets to fund general corporate purposes, manage leverage, and support future growth and capital expenditures.</p>\n<p><b>Average Trading Volume:</b> 2,519,306</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $9.84B</p>\n<p></p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/shutterstock_1921507979-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/american-healthcare-reit-launches-new-1-75-billion-atm-program",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 06:54:18",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991850,
            "title": "IonQ Files Prospectus Supplement for Secondary Share Resale",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>IonQ ( <a data-ticker=\"IONQ\" href=\"https://www.tipranks.com/stocks/ionq\">(IONQ)</a> ) has issued an update.</p>\n<p></p>\n<p></p><p>On February 27, 2026, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ionq\" target=\"_blank\" ;=\"\" rel=\"nofollow\">IonQ</a></span>, Inc. filed a prospectus supplement with the U.S. Securities and Exchange Commission related to an existing shelf registration statement. The filing covers the potential resale by certain selling stockholders of a total of 5,127,459 shares of IonQ common stock, which does not itself raise new capital for the company but may affect the trading dynamics of its shares as additional stock becomes eligible for resale.</p>\n<p>As part of the filing, IonQ included a legal opinion from Paul, Weiss, Rifkind, Wharton &amp; Garrison LLP regarding the validity of the shares covered by the prospectus supplement. This legal documentation supports the compliance and enforceability of the registered shares, reinforcing regulatory transparency around the resale process for existing shareholders and market participants.</p>\n<p>The most recent analyst rating on <a data-ticker=\"IONQ\" href=\"https://www.tipranks.com/stocks/ionq\">(IONQ)</a> stock is a Hold with a $37.00 price target. To see the full list of analyst forecasts on IonQ stock, see the IONQ <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ionq/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on IONQ Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, IONQ is a Neutral.</p>\n<p>The score is held back primarily by weak financial performance (large losses and cash burn) and bearish technicals (below key moving averages with negative MACD). Offsetting these risks are a strong earnings outlook with significant backlog growth and ample liquidity, plus strategically positive M&amp;A developments.</p>\n<p>To see Spark’s full report on IONQ stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ionq/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about IonQ</u></b></p>\n<p>IonQ, Inc. is a <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/quantum-computing\">quantum computing</a> company that develops and commercializes quantum computers, offering access to its systems primarily through cloud platforms and partnerships. The company focuses on advancing quantum technology for commercial and research applications, targeting industries that require high-performance computing and complex problem-solving capabilities.</p>\n<p><b>Average Trading Volume:</b> 19,215,044</p>\n<p><b>Technical Sentiment Signal:</b> Hold</p>\n<p><b>Current Market Cap:</b> $11.2B</p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_2168579375-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/ionq-files-prospectus-supplement-for-secondary-share-resale",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 06:55:02",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991851,
            "title": "CBRE Group Updates Senior Executive Compensation Packages",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>An announcement from CBRE Group ( <a data-ticker=\"CBRE\" href=\"https://www.tipranks.com/stocks/cbre\">(CBRE)</a> ) is now available.</p>\n<p></p>\n<p></p><p>On February 25, 2026, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cbre\" target=\"_blank\" ;=\"\" rel=\"nofollow\">CBRE Group</a></span> updated compensation targets for two senior executives, Chief Legal &amp; Administrative Officer and Corporate Secretary Chad J. Doellinger and Executive Group President, Trammell Crow Company, Daniel G. Queenan, while leaving targets for other named executive officers unchanged. Doellinger’s package now includes a $700,000 base salary, a $1,150,000 annual performance award target and $2,750,000 in total long‑term equity incentives, and Queenan’s includes a $700,000 base salary, a $1,300,000 annual performance award target and $3,000,000 in total long‑term equity incentives, underscoring CBRE’s focus on retaining and incentivizing leadership in legal, administrative and development operations.</p>\n<p>The most recent analyst rating on <a data-ticker=\"CBRE\" href=\"https://www.tipranks.com/stocks/cbre\">(CBRE)</a> stock is a Buy with a $163.00 price target. To see the full list of analyst forecasts on CBRE Group stock, see the CBRE <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cbre/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on CBRE Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, CBRE is a Neutral.</p>\n<p>The score is primarily supported by solid financial quality (especially improved leverage) and a strongly positive earnings outlook with optimistic 2026 EPS guidance and growth drivers (notably data centers). Offsetting this, technical indicators are weak with the stock trading below key moving averages, and valuation is elevated (P/E ~38) with no dividend support, increasing sensitivity to execution and cash-flow timing.</p>\n<p>To see Spark’s full report on CBRE stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cbre/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about CBRE Group</u></b></p>\n<p>CBRE Group is a global commercial real estate services and investment firm that advises on and manages property for occupiers, investors and developers. Its operations span leasing, capital markets, property management, valuation and project development, including through its Trammell Crow Company development platform, giving it a central role in major corporate and institutional real estate strategies.</p>\n<p><b>Average Trading Volume:</b> 1,921,999</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $43.14B</p>\n<p></p>\n<p></p><p>Learn more about CBRE stock on <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cbre\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Stock Analysis page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/shutterstock_1928345756-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/cbre-group-updates-senior-executive-compensation-packages",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 06:55:42",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991852,
            "title": "Real Asset Acquisition Plans Quantum Computing Merger With IQM",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Real Asset Acquisition Corporation Class A ( <a data-ticker=\"RAAQ\" href=\"https://www.tipranks.com/stocks/raaq\">(RAAQ)</a> ) has issued an update.</p>\n<p></p>\n<p></p><p>On February 23, 2026, IQM Finland Oy and Real Asset Acquisition Corp. announced a definitive business combination agreement that would take IQM public in the United States via American Depositary Shares, with IQM also evaluating a subsequent dual listing of its ordinary shares on the Helsinki stock exchange. On February 27, 2026, the companies followed up with plans for a joint investor conference call and webcast to outline transaction highlights and indicated that IQM will file a Form F-4 registration statement with the SEC, a step that underscores their push to secure fresh capital for scaling quantum hardware and software development and to cement IQM’s position as a leading player in the emerging <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/quantum-computing\">quantum computing</a> market.</p>\n<p>The proposed deal is structured to provide funding aimed at accelerating IQM’s technology roadmap toward fault-tolerant quantum computing and expanding its commercial footprint across government, academic and enterprise customers. For RAAQ shareholders, the transaction represents an opportunity to pivot SPAC capital into a high-growth, early-stage deep-tech company, while regulatory filings and shareholder votes still pending mean the combination’s completion and ultimate benefits will hinge on market reception, redemptions and regulatory approvals.</p>\n<p><b><u>More about Real Asset Acquisition Corporation Class A</u></b></p>\n<p>IQM Finland Oy is a Finland-headquartered quantum computing company specializing in full-stack, open-architecture superconducting quantum computers that can be deployed on-premise or accessed via the cloud. Its vertically integrated model spans proprietary chip design tools, software platforms, fabrication, assembly and data center operations, serving high-performance computing centers, research labs, universities and enterprises worldwide.</p>\n<p>Real Asset Acquisition Corp., based in Princeton, N.J., is a Nasdaq-listed special purpose acquisition company focused on effecting mergers and similar business combinations, and its team includes quantum computing specialists with deep technical and industry expertise. The partnership aligns a sector-focused SPAC with a leading quantum hardware and software provider targeting accelerated commercialization and ecosystem growth.</p>\n<p><b>Average Trading Volume:</b> 85,381</p>\n<p><b>Technical Sentiment Signal:</b> Strong Buy</p>\n<p><b>Current Market Cap:</b> $242.4M</p>\n<p></p>\n<p></p><p>For an in-depth examination of RAAQ stock, go to <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/raaq\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Overview page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/shutterstock_559447282-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/real-asset-acquisition-plans-quantum-computing-merger-with-iqm",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 06:56:23",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991853,
            "title": "Braskem Outlines Weaker 4Q25 Operating Metrics Amid Global Petrochemical Pressure",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Braskem SA ( <a data-ticker=\"BAK\" href=\"https://www.tipranks.com/stocks/bak\">(BAK)</a> ) just unveiled an update.</p>\n<p></p>\n<p></p><p>Braskem reported preliminary operational figures for the fourth quarter and full year 2025 on February 27, 2026, showing the impact of a volatile global macro environment, strong product oversupply and weaker petrochemical spreads across its main markets. The company’s petrochemical cracker utilization rates in Brazil and South America fell versus both the prior quarter and 2024, largely due to a scheduled maintenance shutdown at the Bahia complex, lower feedstock supply in São Paulo and demand-driven production adjustments.</p>\n<p>Resin sales in Brazil declined in 4Q25 compared with both the previous quarter and year-ago period, as higher inventories in the transformation chain, seasonal demand softness and a strategy to favor higher value-added sales reduced PE, PP and PVC volumes. Exports of resins dipped in the quarter but rose for the full year, supported by higher PE and PP shipments to South America after a 3% contraction in Brazilian market demand freed up product for export.</p>\n<p>Sales of main chemicals in Brazil were down sharply in 4Q25 from 3Q25 and 4Q24 and lower for 2025 as a whole, reflecting reduced availability of products like gasoline and paraxylene amid lower utilization rates and weaker demand for olefins and aromatics as clients optimized their operating rates. Chemical exports jumped in the quarter due to specific opportunities for paraxylene and benzene, but fell significantly for the year on reduced gasoline exports, U.S. tariffs on benzene and weaker toluene demand amid substitution in the domestic market.</p>\n<p>In the United States and Europe, Braskem faced lower polypropylene spreads in 4Q25 as higher <a data-autolink=\"true\" href=\"https://www.tipranks.com/economic-indicators\">imports</a> expanded supply, while utilization rates declined due to scheduled maintenance in Europe, further weighing on regional performance. In Mexico, however, the company achieved its highest utilization rate since early 2017, driven by stable operations after a major 3Q25 maintenance shutdown and increased imported ethane availability, particularly from the Terminal Química Puerto México, supporting a stronger operational contribution from that segment.</p>\n<p>The company’s green ethylene operations saw utilization rates rebound sharply from 3Q25 after inventory optimization, though they remained below 4Q24 and full-year 2024 levels due to an unscheduled power-related shutdown earlier in 2025 and deliberate Green PE inventory adjustments. Overall, the data underscore how maintenance cycles, feedstock constraints and weaker global petrochemical fundamentals weighed on Braskem’s 2025 operating profile, while targeted export strategies and improved Mexican utilization provided partial offsets for stakeholders monitoring capacity use and market exposure.</p>\n<p>The most recent analyst rating on <a data-ticker=\"BAK\" href=\"https://www.tipranks.com/stocks/bak\">(BAK)</a> stock is a Hold with a $3.50 price target. To see the full list of analyst forecasts on Braskem SA stock, see the BAK <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/bak/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on BAK Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, BAK is a Neutral.</p>\n<p>Braskem SA’s overall stock score reflects significant financial challenges, with high leverage and declining profitability being the most critical factors. While there are some positive aspects, such as improved EBITDA and liquidity, these are overshadowed by ongoing industry pressures and valuation concerns. Technical analysis provides a neutral outlook, with mixed signals on momentum.</p>\n<p>To see Spark’s full report on BAK stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/bak/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Braskem SA</u></b></p>\n<p>Braskem S.A. is a Brazilian petrochemical company and major producer of resins and basic chemicals, operating large petrochemical complexes in Brazil, Mexico, the United States and Europe. Its portfolio includes polyethylene, polypropylene, PVC and key chemical intermediates, with a growing focus on green ethylene and biopolymers aimed at higher value-added and more sustainable applications across global industrial and consumer markets.</p>\n<p><b>Average Trading Volume:</b> 1,290,429</p>\n<p><b>Technical Sentiment Signal:</b> Sell</p>\n<p><b>Current Market Cap:</b> $1.44B</p>\n<p></p>\n<p></p><p>For a thorough assessment of BAK stock, go to <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/bak\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Stock Analysis page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_303418172-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/braskem-outlines-weaker-4q25-operating-metrics-amid-global-petrochemical-pressure",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 06:57:02",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991785,
            "title": "DNOW Announces Planned Board Transition as Director Departs",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Now ( <a data-ticker=\"DNOW\" href=\"https://www.tipranks.com/stocks/dnow\">(DNOW)</a> ) just unveiled an update.</p>\n<p></p>\n<p></p><p>On February 25, 2026, DNOW Inc. announced that Board member Rodney Eads has notified the company he will not stand for reelection at the 2026 annual meeting of stockholders, and will step off the Board when his current term expires at that meeting. The company emphasized that Eads’ departure is not due to any disagreement over operations, policies or practices, suggesting an orderly governance transition and signaling stability in its strategic direction.</p>\n<p>The Board of Directors publicly thanked Eads for his dedicated service, underscoring a cordial separation and continuity of boardroom relations. For investors and other stakeholders, the announcement frames the upcoming board change as routine succession rather than a sign of internal conflict or strategic upheaval.</p>\n<p>The most recent analyst rating on <a data-ticker=\"DNOW\" href=\"https://www.tipranks.com/stocks/dnow\">(DNOW)</a> stock is a Buy with a $16.00 price target. To see the full list of analyst forecasts on Now stock, see the DNOW <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/dnow/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on DNOW Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, DNOW is a Outperform.</p>\n<p>DNOW’s score is driven primarily by strong financial footing (notably a very conservative balance sheet) and constructive earnings-call guidance supported by solid recent profitability and free-cash-flow expectations. The main offsets are weaker longer-term technical posture (below 100/200-day averages with negative MACD) and only mid-range valuation support due to no dividend yield.</p>\n<p>To see Spark’s full report on DNOW stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/dnow/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Now</u></b></p>\n<p>DNOW Inc. is a company with a formal Board of Directors structure, indicating a publicly held corporate governance framework. The company operates with a focus on stockholder representation through an annual meeting at which directors are elected, reflecting standard practices in its market and regulatory environment.</p>\n<p><b>Average Trading Volume:</b> 2,561,672</p>\n<p><b>Technical Sentiment Signal:</b> Sell</p>\n<p><b>Current Market Cap:</b> $2.2B</p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Industrials-10-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/dnow-announces-planned-board-transition-as-director-departs",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 06:26:18",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991755,
            "title": "GE HealthCare Establishes New 364-Day Revolving Credit Facility",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>GE Healthcare Technologies Inc ( <a data-ticker=\"GEHC\" href=\"https://www.tipranks.com/stocks/gehc\">(GEHC)</a> ) just unveiled an announcement.</p>\n<p></p>\n<p></p><p>On February 26, 2026, GE HealthCare Technologies Inc. entered into a new 364-day senior unsecured revolving credit agreement with JPMorgan Chase Bank and a syndicate of lenders, establishing a $0.5 billion committed facility that matures on February 25, 2027. The facility allows multi-currency borrowing in U.S. Dollars, Euros, and Pound Sterling at benchmark-linked floating rates plus a margin tied to the company’s long-term debt ratings.</p>\n<p>The new agreement replaces a similar $0.5 billion 364-day revolving credit facility dated March 27, 2025, which was terminated without penalty on February 26, 2026, effectively rolling over the company’s short-term liquidity backstop. The facility includes customary covenants on leverage, liens, subsidiary indebtedness, and change of control, reinforcing GE HealthCare’s financial flexibility and providing lenders with standard protections through detailed default and covenant structures.</p>\n<p>The most recent analyst rating on <a data-ticker=\"GEHC\" href=\"https://www.tipranks.com/stocks/gehc\">(GEHC)</a> stock is a Buy with a $105.00 price target. To see the full list of analyst forecasts on GE Healthcare Technologies Inc stock, see the GEHC <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/gehc/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on GEHC Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, GEHC is a Neutral.</p>\n<p>The score is driven primarily by mixed financial performance—especially the 2025 cash flow deterioration—offset by a stronger balance sheet and supportive 2026 guidance for growth, margins, and free cash flow. Technicals are neutral with negative MACD, and valuation appears reasonable but not notably attractive given the low dividend yield.</p>\n<p>To see Spark’s full report on GEHC stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/gehc/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about GE Healthcare Technologies Inc</u></b></p>\n<p>GE HealthCare Technologies Inc. is a global medical technology and diagnostics company that provides imaging, monitoring, diagnostics, and digital solutions for healthcare providers. The company focuses on enabling precision care and improving clinical outcomes across hospitals and health systems in key markets worldwide.</p>\n<p><b>Average Trading Volume:</b> 3,281,124</p>\n<p><b>Technical Sentiment Signal:</b> Strong Buy</p>\n<p><b>Current Market Cap:</b> $38.31B</p>\n<p></p>\n<p></p><p>For an in-depth examination of GEHC stock, go to <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/gehc\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Overview page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_1917115745-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/ge-healthcare-establishes-new-364-day-revolving-credit-facility",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 06:11:15",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991706,
            "title": "PrimeEnergy Amends Credit Facility, Reaffirms $115 Million Base",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Primeenergy ( <a data-ticker=\"PNRG\" href=\"https://www.tipranks.com/stocks/pnrg\">(PNRG)</a> ) has issued an announcement.</p>\n<p></p>\n<p></p><p>On February 24, 2026, PrimeEnergy Resources Corporation entered into a Fifth Amendment to its Fourth Amended and Restated Credit Agreement with Citibank and other lenders, reaffirming its borrowing base at $115 million. The amendment reduces interest margins on SOFR and base-rate loans by 50 basis points at each utilization level, updates commodity hedging covenants by raising certain utilization thresholds from 25% to 30%, adjusts lender schedules, and imposes customary post-closing mortgage and title delivery obligations, while leaving core facility terms such as commitments, collateral, covenants, and maturity unchanged.</p>\n<p>As of December 31, 2025, and February 27, 2026, PrimeEnergy had no outstanding borrowings, preserving full availability under the $115 million borrowing base. The changes are expected to lower the company’s cost of capital on future draws and provide slightly more flexibility around hedging requirements, supporting its liquidity position without altering the overall structure of its revolving credit facility.</p>\n<p>The most recent analyst rating on <a data-ticker=\"PNRG\" href=\"https://www.tipranks.com/stocks/pnrg\">(PNRG)</a> stock is a Buy with a $184.00 price target. To see the full list of analyst forecasts on Primeenergy stock, see the PNRG <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/pnrg/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on PNRG Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, PNRG is a Outperform.</p>\n<p>Primeenergy’s overall stock score is driven by its strong financial position and improving cash flow generation, despite challenges in revenue and profit margins. Technical analysis indicates short-term bullish momentum but warns of potential overbought conditions. Valuation is fair, though the lack of a dividend yield may deter some investors.</p>\n<p>To see Spark’s full report on PNRG stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/pnrg/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Primeenergy</u></b></p>\n<p>PrimeEnergy Resources Corporation operates in the energy sector and utilizes a senior secured revolving credit facility to support its operations. The company’s capital structure includes a borrowing base backed by oil and gas properties, with Citibank, N.A. serving as administrative agent under its primary credit agreement.</p>\n<p><b>Average Trading Volume:</b> 54,342</p>\n<p><b>Technical Sentiment Signal:</b> Strong Buy</p>\n<p><b>Current Market Cap:</b> $300.4M</p>\n<p></p>\n<p></p><p>Learn more about PNRG stock on <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/pnrg\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Stock Analysis page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Energy-6-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/primeenergy-amends-credit-facility-reaffirms-115-million-base",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 05:51:04",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991699,
            "title": "Ocular Therapeutix Highlights Phase 3 AXPAXLI Trial Progress",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Ocular Therapeutix ( <a data-ticker=\"OCUL\" href=\"https://www.tipranks.com/stocks/ocul\">(OCUL)</a> ) has provided an announcement.</p>\n<p></p>\n<p></p><p>On February 27, 2026, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ocul\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Ocular Therapeutix</a></span> announced that it would post investor presentation slides on its corporate website at 4:15 p.m. Eastern Time. The materials detail results from the SOL-1 Phase 3 superiority clinical trial of AXPAXLI (OTX-TKI) for the treatment of wet age-related macular degeneration, underscoring the company’s progress in advancing late-stage retinal disease therapies.</p>\n<p>The disclosure of Phase 3 data at the 49th Macula Society Annual Meeting highlights Ocular Therapeutix’s bid to strengthen its position in the competitive ophthalmology market. By sharing detailed trial outcomes with both clinicians and investors, the company is signaling a critical development milestone that could influence perceptions of its clinical pipeline and future commercial prospects.</p>\n<p>The most recent analyst rating on <a data-ticker=\"OCUL\" href=\"https://www.tipranks.com/stocks/ocul\">(OCUL)</a> stock is a Hold with a $8.00 price target. To see the full list of analyst forecasts on Ocular Therapeutix stock, see the OCUL <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ocul/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on OCUL Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, OCUL is a Neutral.</p>\n<p>The score is held down primarily by weak financial performance (large and widening losses plus accelerating cash burn) and bearish technicals (below key moving averages with negative MACD). These are partially offset by a constructive earnings-call outlook centered on strong trial progress, upcoming SOL-1 data, and an extended cash runway, while valuation remains constrained by negative earnings and no dividend.</p>\n<p>To see Spark’s full report on OCUL stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ocul/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Ocular Therapeutix</u></b></p>\n<p>Ocular Therapeutix, Inc. is a biopharmaceutical company focused on ophthalmology, developing therapies for eye diseases such as wet age-related macular degeneration. The company’s pipeline includes AXPAXLI (also known as OTX-TKI), designed as a treatment for retinal conditions that require long-acting, localized drug delivery.</p>\n<p><b>Average Trading Volume:</b> 5,749,145</p>\n<p><b>Technical Sentiment Signal:</b> Hold</p>\n<p><b>Current Market Cap:</b> $1.95B</p>\n<p></p>\n<p></p><p>For a thorough assessment of OCUL stock, go to <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ocul\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Stock Analysis page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_390599908-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/ocular-therapeutix-highlights-phase-3-axpaxli-trial-progress",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 05:46:11",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991667,
            "title": "Comcast Expands Board Oversight with New Audit Committee Appointment",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>An announcement from Comcast ( <a data-ticker=\"CMCSA\" href=\"https://www.tipranks.com/stocks/cmcsa\">(CMCSA)</a> ) is now available.</p>\n<p></p>\n<p></p><p><span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cmcsa\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Comcast</a></span> said that on February 25, 2026, its board of directors appointed Gordon Smith to serve on the board’s Audit Committee, following his earlier appointment as a director on February 4, 2026. The move signals Comcast’s continued focus on board-level financial oversight and governance, which may influence how the company manages risk, compliance and financial reporting for investors and other stakeholders.</p>\n<p>The most recent analyst rating on <a data-ticker=\"CMCSA\" href=\"https://www.tipranks.com/stocks/cmcsa\">(CMCSA)</a> stock is a Sell with a $27.00 price target. To see the full list of analyst forecasts on Comcast stock, see the CMCSA <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cmcsa/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on CMCSA Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, CMCSA is a Outperform.</p>\n<p>The score is driven primarily by strong financial performance (healthy margins and robust free cash flow) and very compelling valuation (low P/E and high dividend yield). Technicals are moderately supportive with positive momentum. The main constraint is earnings-call guidance pointing to near-term broadband and segment EBITDA pressure and less favorable cash-tax benefits in 2026.</p>\n<p>To see Spark’s full report on CMCSA stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cmcsa/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Comcast</u></b></p>\n<p>Comcast Corporation is a global media and technology company operating in the telecommunications and entertainment industries, best known for its cable and broadband services as well as content production and distribution. The company serves residential and business customers through its communications networks and media platforms, competing with other major telecom and streaming providers.</p>\n<p><b>Average Trading Volume:</b> 35,496,392</p>\n<p><b>Technical Sentiment Signal:</b> Hold</p>\n<p><b>Current Market Cap:</b> $113.7B</p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/12/shutterstock_2148870733.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/comcast-expands-board-oversight-with-new-audit-committee-appointment",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 05:35:05",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991591,
            "title": "United States Antimony Highlights North American Supply Strategy",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>An announcement from United States Antimony ( <a data-ticker=\"UAMY\" href=\"https://www.tipranks.com/stocks/uamy\">(UAMY)</a> ) is now available.</p>\n<p></p>\n<p></p><p><span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/uamy\" target=\"_blank\" ;=\"\" rel=\"nofollow\">United States Antimony</a></span> has furnished new investor presentation materials outlining its strategy to expand a secure North American antimony supply chain and highlight its unique position as the only fully integrated producer in the region. The materials emphasize the company’s operational platform, including permitted smelters in Montana and Mexico and growing mining and processing capabilities in North America.</p>\n<p>The presentation also details global supply constraints driven by China and Russia’s dominance in antimony, rising prices since 2024–2025, and USAC’s efforts to leverage this backdrop through international ore supply partnerships in Chad, Peru, Australia and Bolivia and the restart of its Madero smelter. These disclosures, provided in connection with a current report filing, are explicitly characterized as informational and non‑filed, and are accompanied by extensive cautionary language regarding forward‑looking statements and associated risks for investors.</p>\n<p>The most recent analyst rating on <a data-ticker=\"UAMY\" href=\"https://www.tipranks.com/stocks/uamy\">(UAMY)</a> stock is a Buy with a $11.00 price target. To see the full list of analyst forecasts on United States Antimony stock, see the UAMY <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/uamy/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on UAMY Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, UAMY is a Neutral.</p>\n<p>The score is primarily driven by mixed fundamentals: rapid revenue growth and low leverage are outweighed by weak profitability and negative operating/free cash flow. Technicals are supportive with the stock trading above major moving averages and a positive MACD. Valuation is constrained by losses (negative P/E). Earnings-call details improve the outlook due to strong sales momentum, liquidity, and large multi-year contracts, partially offset by margin-pressure and net-loss risks.</p>\n<p>To see Spark’s full report on UAMY stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/uamy/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about United States Antimony</u></b></p>\n<p>United States Antimony Corporation is a North American producer of antimony and related products, operating as the region’s only fully integrated primary antimony miner, smelter, and downstream manufacturer. Its business spans antimony metal, oxides, trisulfide and nanocrystals, serving defense, energy, industrial and flame‑retardant markets through operations in the U.S., Mexico and Canada.</p>\n<p><b>Average Trading Volume:</b> 12,765,695</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $1.17B</p>\n<p></p>\n<p></p><p>Find detailed analytics on UAMY stock on <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/uamy\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Stock Analysis page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_2186329533-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/united-states-antimony-highlights-north-american-supply-strategy",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 04:47:45",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2991640,
            "title": "Akanda’s First Towers & Fiber to Ramp Up Leasing of Central Mexico Dark Fiber Network",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>The latest update is out from Akanda Corp ( <a data-ticker=\"AKAN\" href=\"https://www.tipranks.com/stocks/akan\">(AKAN)</a> ).</p>\n<p></p>\n<p></p><p>Akanda Corp., through its wholly owned Mexican subsidiary First Towers &amp; Fiber Corp., operates what it describes as the largest dark fiber optic network in Central Mexico, spanning roughly 700 kilometres and serving major industrial corridors and high-growth state economies. The infrastructure is anchored by a 20-year lease with Telefónica, which currently uses only a small portion of the network’s 24 available fiber pairs, alongside capacity leased to Marcatel.</p>\n<p>In a February 27, 2026 announcement, Akanda and FTF outlined plans to expand leasing of this underutilized dark fiber network starting in 2026, aiming to add more tenants and boost recurring revenue with limited additional capital outlay. Management argues that the network’s scale, redundancy and available capacity position FTF as a key shared infrastructure provider for rising connectivity demand in Central Mexico, with potential implications for the region’s telecom competition and for Akanda’s long-term revenue mix.</p>\n<p><b><u>More about Akanda Corp</u></b></p>\n<p>First Towers &amp; Fiber Corp. is an emerging telecommunications infrastructure developer in Mexico, focused on cellular tower construction and dark fiber networks. The company partners with national carriers and technology providers to deliver scalable, reliable connectivity solutions that support commercial growth and digital inclusion in fast-growing regional markets.</p>\n<p><b>Average Trading Volume:</b> 1,376,505</p>\n<p><b>Technical Sentiment Signal:</b> Sell</p>\n<p><b>Current Market Cap:</b> $1.85M</p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_296599349-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/akandas-first-towers-fiber-to-ramp-up-leasing-of-central-mexico-dark-fiber-network",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-28 05:17:17",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        }
    ]
}