{
    "data": [
        {
            "id": 2985568,
            "title": "Top Diodes Insiders Make Significant Stock Moves in Latest Trading Activity",
            "description": "<html><head></head><body><p>New insider activity at Diodes ( <a data-ticker=\"DIOD\" href=\"https://www.tipranks.com/stocks/diod\">(DIOD)</a> ) has taken place on February 26, 2026.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Diodes Incorporated saw notable insider activity as two top executives recently sold company stock. SVP of Worldwide Sales and Marketing Emily Yang disposed of 2,154 shares of Diodes stock in a transaction valued at $150,543. In a separate move, President and CEO Gary Yu sold 2,000 shares of Diodes stock for a total of $140,000. These transactions highlight meaningful share sales by key leaders within the company.</p>\n<p><b><u>Recent Updates on DIOD stock </u></b></p>\n<p>Diodes’ shares surged roughly 30% over the last day as investors reacted to strong Q4 and 2025 results, upside EPS versus consensus, and guidance that implies continued double‑digit revenue growth. Analysts updated models and targets mainly on the back of accelerating <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> server, automotive, and industrial demand, robust cash generation, and new multi‑year goals for higher revenue, margins, and EPS, despite near‑term margin pressure from underloaded fabs and elevated costs.</p>\n<p><b><u>Spark’s Take on DIOD Stock</u></b></p>\n<p>According to Spark, TipRanks’ AI Analyst, DIOD is a Outperform.</p>\n<p>The score is driven primarily by strong financial resilience (notably a highly de-levered balance sheet) and improving operating momentum highlighted in guidance and multi-year targets. Technicals also support the view with a clear uptrend. The main offset is valuation risk from a high P/E alongside still-pressured margins and uneven free cash flow.</p>\n<p>To see Spark’s full report on DIOD stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/diod/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Diodes</u></b></p>\n<p><b>YTD Price Performance:</b> 43.49%</p>\n<p><b>Average Trading Volume:</b> 379,508</p>\n<p><b>Technical Sentiment Signal:</b> Strong Buy</p>\n<p><b>Current Market Cap:</b> $3.18B</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_112821256-750x406.jpg",
            "link": "https://www.tipranks.com/news/insider-trading/top-diodes-insiders-make-significant-stock-moves-in-latest-trading-activity-insider-trading-news",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 10:09:05",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2985569,
            "title": "Major Insider Move at Lee Enterprises Signals Bold Confidence From the Boardroom",
            "description": "<html><head></head><body><p>New insider activity at Lee Enterprises ( <a data-ticker=\"LEE\" href=\"https://www.tipranks.com/stocks/lee\">(LEE)</a> ) has taken place on February 26, 2026.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Director David Henry Hoffmann has made a significant insider purchase of Lee Enterprises stock, acquiring 44,110 shares in a single transaction. The move represents a strong show of confidence in the company, with the total value of the purchase reaching $390,078. This sizable investment from a board member may be closely watched by shareholders and market observers as a potential signal about Lee Enterprises’ future prospects.</p>\n<p><b><u>Recent Updates on LEE stock </u></b></p>\n<p>Lee Enterprises’ stock has been reacting to a mixed but improving fundamental story in the last day, as analysts weighed a sharp rebound in Q1 adjusted EBITDA, accelerating digital growth and sizable interest savings against ongoing losses and heavy leverage. Recent price target resets reflect optimism around stronger cash flow from a $50M equity raise, a cut in loan interest from 9% to 5%, and digital revenue now exceeding half of sales, tempered by structural print declines, reliance on capital raises and asset sales, and execution risk in the digital pivot.</p>\n<p><b><u>Spark’s Take on LEE Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, LEE is a Neutral.</p>\n<p>The score is held back primarily by weak financial performance (revenue contraction, net losses, and negative equity with substantial leverage), partially offset by improved near-term operating momentum highlighted on the earnings call (strong Q1 adjusted EBITDA and material interest savings). Technicals are supportive but stretched (overbought signals), while valuation is difficult to assess with a negative P/E and no dividend yield provided.</p>\n<p>To see Spark’s full report on LEE stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/lee/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Lee Enterprises</u></b></p>\n<p><b>YTD Price Performance:</b> 83.09%</p>\n<p><b>Average Trading Volume:</b> 63,672</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $194.2M</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Communication-Services-4-750x406.jpg",
            "link": "https://www.tipranks.com/news/insider-trading/major-insider-move-at-lee-enterprises-signals-bold-confidence-from-the-boardroom-insider-trading-news",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 10:09:11",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2985571,
            "title": "Major Insider Move Rocks MACOM Technology Solutions Holdings",
            "description": "<html><head></head><body><p>New insider activity at MACOM Technology Solutions Holdings ( <a data-ticker=\"MTSI\" href=\"https://www.tipranks.com/stocks/mtsi\">(MTSI)</a> ) has taken place on February 26, 2026.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Significant shareholder Susan Ocampo has executed a major sale of MACOM Technology Solutions Holdings stock, offloading a total of 315,272 shares. The transaction is valued at an impressive $79,980,605, marking a substantial change in her ownership position and representing a notable insider move that investors may watch closely.</p>\n<p><b><u>Recent Updates on MTSI stock </u></b></p>\n<p>MACOM Technology Solutions shares reacted to a flurry of analyst target hikes over the last day, driven by a strong “beat and raise” Q4 earnings report and guidance. Firms highlighted an exceptional 1.3x book‑to‑bill, raised datacenter growth outlook, and broad-based strength across business lines, with particular confidence in longer-term datacenter and telecom demand.</p>\n<p>Analysts cited inflecting datacenter demand as a key driver for re-rating the stock and framed MACOM as a leading product-cycle story in semiconductors. Several notes emphasized upside potential into fiscal 2026 as models were revised higher for top-line growth, reflecting expectations of continued momentum in both Datacenter and Telco markets.</p>\n<p><b><u>Spark’s Take on MTSI Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, MTSI is a Outperform.</p>\n<p>The score is driven primarily by solid current fundamentals (healthy margins, improving results, manageable leverage) and strong technical momentum (price above all key moving averages with supportive MACD/RSI). Offsetting these positives, valuation is a notable constraint given the very high P/E, and cash-flow conversion/working-capital needs remain a key near-term risk despite upbeat guidance.</p>\n<p>To see Spark’s full report on MTSI stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/mtsi/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about MACOM Technology Solutions Holdings</u></b></p>\n<p><b>YTD Price Performance:</b> 47.93%</p>\n<p><b>Average Trading Volume:</b> 1,316,671</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $18.62B</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_1975936445-750x406.jpg",
            "link": "https://www.tipranks.com/news/insider-trading/major-insider-move-rocks-macom-technology-solutions-holdings-insider-trading-news",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 10:09:17",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984870,
            "title": "Acm Research Balances Growth Ambition With Margin Strain",
            "description": "<html><head></head><body><p>Acm Research (<a data-ticker=\"ACMR\" href=\"https://www.tipranks.com/stocks/acmr\">(ACMR)</a>) has held its Q4 earnings call. Read on for the main highlights of the call. </p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Acm Research’s latest earnings call struck a cautious but constructive tone as management balanced strong revenue growth and a fortified balance sheet against sharp margin pressure and softer shipments. Executives leaned heavily on a robust new-product pipeline and major capacity expansions to argue that today’s profitability dip is temporary, with 2026 set up as a pivotal ramp year.</p>\n<h2>Revenue Growth Outpaces Cycle Headwinds</h2>\n<p>Acm Research delivered Q4 2025 revenue of $244 million, up roughly 9% year over year, underscoring resilient demand despite a tricky wafer fab spending environment. Full-year sales climbed to $901.3 million, about 15% higher than 2024, and the company reiterated 2026 revenue guidance of $1.08 billion to $1.175 billion, implying roughly 25% growth at the midpoint.</p>\n<h2>Balance Sheet Firepower Supports Expansion Plans</h2>\n<p>The company ended 2025 with net cash of $845.5 million, up from $259.1 million a year earlier, after successful ACM Shanghai equity offerings. Total cash, cash equivalents and time deposits surged to $1.13 billion versus $441 million in 2024, giving Acm ample resources to fund R&amp;D, capex and global expansion without near-term balance sheet strain.</p>\n<h2>Cleaning Leads While Portfolio Diversification Accelerates</h2>\n<p>Cleaning tools remained the core franchise, generating $626 million of revenue in 2025, up about 8% and accounting for roughly 69% of total sales as management claims coverage of about 95% of cleaning applications. At the same time, electroplating and advanced packaging systems excluding ECP climbed about 45% to $76 million, signaling meaningful progress in diversifying away from a single product line.</p>\n<h2>Technical Milestones Aim for Best-in-Class Performance</h2>\n<p>Management highlighted a redesigned SPM nozzle that achieved a 50 nm particle count under 20, which they called best-in-class and said eliminates routine chamber DI cleaning, improving tool uptime for customers. The company’s supercritical CO2 dry tool also showed about 40% lower CO2 consumption than competitors in demos, a potential cost and sustainability advantage for future wins.</p>\n<h2>New Wins Showcase Growing Global Reach</h2>\n<p>Acm reported its first tool installation in Singapore, delivering several single-wafer cleaning systems to a local facility and marking another step beyond its China base. Orders from three global customers for wafer-level and panel-level advanced packaging tools, including a North American customer with deliveries expected later in 2026, along with strong repeat SPM orders, point to broadening international traction.</p>\n<h2>Manufacturing Footprint Scales for Multi-Billion Output</h2>\n<p>The Lingang production and R&amp;D center has become the company’s primary manufacturing site, with two buildings designed to support up to $3 billion in annual output as volumes scale. Acm is also accelerating investment in its Oregon facility, expected to start operations in the second half of 2026 to support U.S. customers and onshore production, backed by a roughly $200 million 2026 capex plan.</p>\n<h2>Roadmap Progress in Track, PECVD, Furnace and Panels</h2>\n<p>On the product roadmap, Acm delivered a high-throughput 300 wafers-per-hour KrF track tool for evaluation, with mass production qualification targeted in 2026 and the first Ultra Lith BK system now in customers’ hands. The company also shipped a horizontal panel-level electroplating tool to a large panel customer and argues its horizontal approach offers a competitive edge over vertical plating architectures.</p>\n<h2>Gross Margin Hit by Mix and Provisions</h2>\n<p>Profitability took a notable step back as Q4 2025 gross margin fell to 41.0%, below the long-term 42% to 48% target range and roughly 8.8 percentage points lower year on year. For the full year, gross margin slid to 44.5% from 50.4% in 2024, with management citing unfavorable product mix and higher inventory provisions as key drivers of the compression.</p>\n<h2>Shipments Decline on Pushed-Out New Products</h2>\n<p>Total shipments fell to $854 million in 2025 from $973 million in 2024, a drop of roughly 12.2%, while Q4 shipments of $228 million were down about 13.5% year over year. Management pointed to timing issues, noting that some new-product shipments were pushed into 2026, which depressed near-term shipment metrics but may set the stage for a stronger ramp next year.</p>\n<h2>Operating and Net Income Under Pressure</h2>\n<p>The margin squeeze flowed through to earnings as Q4 operating income declined to $29.5 million from $52.8 million a year earlier, with the operating margin sliding to 12.1% from 23.6%. For 2025 overall, operating margin dropped to 15.9% from 25.6%, while net income attributable to Acm Research fell to $110.2 million and diluted EPS decreased to $1.61 from $2.26.</p>\n<h2>Rising OpEx and R&amp;D Spend Weigh on Leverage</h2>\n<p>Operating expenses rose sharply, with Q4 OpEx climbing about 21% to $70.6 million and full-year OpEx up roughly 34% to $258.4 million as the company invested for future growth. R&amp;D reached 15.1% of sales in 2025 and is expected to rise further to 16% to 18% in 2026, which management acknowledged will pressure near-term operating leverage even as it underpins long-term product competitiveness.</p>\n<h2>Inventory Build and Provisions Cloud Profitability</h2>\n<p>Year-end inventory swelled to $702.6 million, reflecting both growth plans and seasonal dynamics, but it also contributed to margin headwinds through higher provisions. Management said seasonal inventory provisions alone shaved about four percentage points off Q4 gross margin, and one-time inventory adjustments further weighed on reported profitability.</p>\n<h2>Competitive Intensity and Customer Concentration Risks</h2>\n<p>Executives flagged a flood of new local entrants in China, which is intensifying price competition, particularly for semi-critical products and pressuring margins. Customer concentration remains high as the top four customers accounted for roughly 52.2% of 2025 sales, leaving Acm exposed if any key relationship weakens or demand patterns shift.</p>\n<h2>Margin Recovery Path Hinges on Execution</h2>\n<p>Management expects 2026 operating margin to remain in the mid-teens, similar to 2025, with gross margins at the low end of the 42% to 48% target in the first half before improving in the second half. That outlook implies only a gradual margin rebound and depends heavily on the timing and scale of new-product ramps, making execution on the broader portfolio rollout a central investor watchpoint.</p>\n<h2>Guidance Signals Strong Growth but Measured Profitability</h2>\n<p>Looking ahead, Acm reiterated 2026 revenue guidance of $1.08 billion to $1.175 billion and said shipment growth should outpace revenue growth, with H2 accounting for roughly 57% to 58% of sales. The company expects gross margins within its 42% to 48% long-term band but at the low end in early 2026, mid-teens operating margins, elevated R&amp;D at 16% to 18% of sales and about $200 million in capex to support Lingang, the mini-line and the Oregon ramp as it pursues a longer-term $4 billion revenue target.</p>\n<p>Acm Research’s earnings call painted a picture of a high-growth chip equipment supplier trading near-term margin comfort for future scale and technology leadership. With a cash-rich balance sheet, ambitious capacity build-out and promising new products, the story now rests on whether management can navigate competition, concentration risks and execution on its 2026 ramp without further eroding profitability.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_155454977-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/acm-research-balances-growth-ambition-with-margin-strain",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 08:29:07",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984872,
            "title": "Palvella Therapeutics Announces Underwritten Common Stock Offering",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>The latest announcement is out from Palvella Therapeutics ( <a data-ticker=\"PVLA\" href=\"https://www.tipranks.com/stocks/pvla\">(PVLA)</a> ).</p>\n<p></p>\n<p></p><p>On February 25, 2026, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/pvla\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Palvella Therapeutics</a></span>, Inc. entered into an underwriting agreement to issue and sell 1,600,000 shares of common stock at $125.00 per share, with underwriters granted a 30‑day option to purchase up to an additional 240,000 shares. The company expects net proceeds of approximately $187.3 million, with the offering, made via an SEC‑filed prospectus supplement under an effective shelf registration, scheduled to close on or about February 27, 2026, subject to customary conditions.</p>\n<p>All of the shares in the offering are being sold by Palvella, and the company has provided customary representations, warranties, covenants and indemnification to the underwriters. Palvella plans to use the proceeds, together with existing cash and marketable securities, to advance development of its QTORIN rapamycin and QTORIN pitavastatin programs and to fund working capital and general corporate purposes, including research and development, potentially strengthening its balance sheet and supporting continued pipeline investment.</p>\n<p>The most recent analyst rating on <a data-ticker=\"PVLA\" href=\"https://www.tipranks.com/stocks/pvla\">(PVLA)</a> stock is a Buy with a $210.00 price target. To see the full list of analyst forecasts on Palvella Therapeutics stock, see the PVLA <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/pvla/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on PVLA Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, PVLA is a Neutral.</p>\n<p>The score is held down primarily by weak financial performance (no current revenue, ongoing losses, and persistent cash burn) and bearish technical signals. Offsetting this, corporate events are notably positive with encouraging Phase 2 data and clear near-term clinical/regulatory catalysts, but this does not fully overcome the current fundamentals and trend.</p>\n<p>To see Spark’s full report on PVLA stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/pvla/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Palvella Therapeutics</u></b></p>\n<p>Palvella Therapeutics, Inc. is a biopharmaceutical company focused on developing therapies for serious, rare dermatologic and other diseases. Its pipeline includes topical formulations such as QTORIN rapamycin and QTORIN pitavastatin, reflecting a market focus on targeted, late-stage clinical programs aimed at underserved patient populations.</p>\n<p><b>Average Trading Volume:</b> 292,050</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $1.43B</p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_2157214825-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/palvella-therapeutics-announces-underwritten-common-stock-offering",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 08:29:28",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984873,
            "title": "Eos Energy Earnings Call: Rapid Growth, Execution Risks",
            "description": "<html><head></head><body><p>Eos Energy Enterprises, Inc. (<a data-ticker=\"EOSE\" href=\"https://www.tipranks.com/stocks/eose\">(EOSE)</a>) has held its Q4 earnings call. Read on for the main highlights of the call. </p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Eos Energy Enterprises’ latest earnings call painted a mixed picture of rapid commercial momentum colliding with growing pains in execution. Management highlighted breakneck revenue growth, a swelling backlog and ample liquidity, yet also detailed manufacturing bottlenecks, a large GAAP loss and a pushed-out path to profitability, leaving investors balancing opportunity against near-term risk.</p>\n<h2>Record Revenue and Rapid Top-Line Growth</h2>\n<p>Eos reported full-year 2025 revenue of $114.2 million, more than seven times the prior year’s level and reflecting a 632% increase. Fourth-quarter revenue reached $58 million, nearly double Q3 and marking the fourth straight quarter of record sales as projects moved from backlog into recognized revenue.</p>\n<h2>Strong Backlog and Large Commercial Pipeline</h2>\n<p>The company ended the quarter with just over $701 million in backlog, having booked nearly 1.1 GWh of orders across eight customers and nine projects, a 9% sequential increase. Its commercial pipeline expanded to $23.6 billion, representing about 99 GWh and rising 4% quarter over quarter and 64% year over year.</p>\n<h2>Substantial New Orders and Diversified Wins</h2>\n<p>New orders exceeded $240 million in the quarter, spanning commercial and industrial, distributed generation and front-of-the-meter segments. Highlights included a 50 MWh master supply agreement with attractive incentives, multiple hotel projects in Florida and an integration deal with a national lab for a global power company, underscoring growing customer diversity.</p>\n<h2>Improving Margins and Unit Economics</h2>\n<p>While still deeply negative, profitability metrics showed notable progress as scale improved. The full-year gross loss of $143.8 million represented a 408 percentage-point gross margin improvement year over year, and adjusted gross loss of $128.5 million alongside an adjusted EBITDA loss of $219.1 million reflected an 812-point margin gain.</p>\n<h2>Strong Cash Position and Balance Sheet Strengthening</h2>\n<p>Eos closed 2025 with just under $625 million in cash, its strongest liquidity position to date and sufficient to support its growth plan. A November refinancing added $474 million, retired roughly 80% of 2030 convertible notes, cut interest costs, freed $11.5 million of restricted cash and was supplemented by about $80 million from public warrant exercises, enabling removal of going-concern language.</p>\n<h2>Manufacturing Automation and Capacity Ramp</h2>\n<p>The company completed subassembly automation and now reports a fully automated battery line that has recently delivered production records. Management framed current operations as enabling roughly 2 GWh of line capacity supported by 26 suppliers and set a target of ramping to 4 GWh of nameplate manufacturing capacity by the end of 2026.</p>\n<h2>Product and Software Innovations</h2>\n<p>Eos introduced its Indensity platform, a modular 133-kWh core that can be stacked up to 12 units high to improve site energy density, field serviceability and manufacturability. The firm also launched its DawnOS software for granular battery monitoring and control and expects Indensity shipments to begin in the second half of 2026.</p>\n<h2>Market Demand Tailwinds and Use-Case Growth</h2>\n<p>Management emphasized robust structural demand drivers including data centers, electrification and reshoring that are expanding the market for long-duration storage. Data center leads increased about 50% quarter over quarter, the active data center pipeline grew more than 40% and 63% of Eos’s pipeline now consists of systems rated for eight hours or longer.</p>\n<h2>Missed Guidance and Execution Shortfall</h2>\n<p>Despite strong demand, leadership openly acknowledged that the company missed its guidance for the period and tied the shortfall to operational execution rather than customer appetite. The CEO took responsibility, stressing that the gap stemmed from factory performance and ramp challenges, not from project cancellations or pipeline weakness.</p>\n<h2>Manufacturing Quality and Downtime Issues</h2>\n<p>Three key operational setbacks weighed on results, including a nonperforming supplier that cost about a week of production. Automated bipolar production took longer than expected to meet quality standards and battery line downtime ran in the mid-30% range versus a roughly 10% target, significantly cutting throughput even though management reports improvement in early 2026.</p>\n<h2>Large Net Loss and Noncash Volatility</h2>\n<p>For 2025, Eos recorded a net loss of $969.6 million, widening from $685.9 million a year earlier, though a substantial portion was noncash. The company reported $746.8 million of fair value accounting impacts tied to warrants and derivative liabilities driven by a roughly 135% stock price rise, creating sizable mark-to-market swings disconnected from operating performance.</p>\n<h2>Delay to Profitability Targets</h2>\n<p>The path to profitability stretched out as material costs and production issues pushed expectations. Management now forecasts reaching gross-margin positive territory in the second half of 2026, a delay from the earlier goal of achieving positive gross margin by the first quarter of that year.</p>\n<h2>Operational Inefficiencies and Single Points of Failure</h2>\n<p>Executives highlighted structural inefficiencies at the existing plant, where materials currently traverse multiple floors and buildings—about two miles in total—adding time and cost. They also flagged the reliance on a single primary production line as a vulnerability until a second line and the Thornhill expansion come online to provide redundancy.</p>\n<h2>Ongoing Work on Bipolar Yields and Rework</h2>\n<p>Initial yields from the automated bipolar fabrication process fell short of internal benchmarks, leading to extensive rework and lost revenue, particularly in the fourth quarter. Management said yield trends are moving in the right direction with remediation underway, but acknowledged that the issue materially dragged on recent performance.</p>\n<h2>Elevated Operating Expense and Cash Burn</h2>\n<p>Operating expenses rose 26% year over year to $115.4 million in 2025 as Eos invested heavily to scale manufacturing, engineering and commercial capabilities. Roughly 22% of that total was noncash, yet analysts pressed on quarterly operating cash outflows, and management conceded that execution hiccups contributed to higher-than-planned cash usage.</p>\n<h2>Revenue Concentration Risk</h2>\n<p>Although Eos recognized revenue from 18 customers during the year, it remains reliant on a relatively small number of large accounts for a significant share of sales. Management acknowledged that this concentration exposes the company to timing and approval risks if major customers delay projects or alter deployment schedules.</p>\n<h2>Guidance and Forward-Looking Outlook</h2>\n<p>Looking ahead to 2026, Eos guided to revenue of $300 million to $400 million, with the $300 million base case largely underpinned by existing backlog and the additional $100 million tied to big project approvals and Indensity’s late-year launch. The forecast assumes ramping manufacturing capacity toward 4 GWh, achieving gross-margin profitability in the second half of 2026 and executing on a $23.6 billion commercial pipeline anchored in long-duration storage demand.</p>\n<p>Eos’s earnings call underscored a company racing to meet surging demand in long-duration energy storage while still ironing out factory and cost challenges. Investors heard a story of exceptional growth, stronger finances and a deep pipeline, counterbalanced by operational missteps and a delayed profitability timeline that keep execution risk firmly in focus.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Industrials-5-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/eos-energy-earnings-call-rapid-growth-execution-risks",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 08:29:37",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984876,
            "title": "Warner Bros. Discovery Earnings Call Highlights Streaming Push",
            "description": "<html><head></head><body><p>Warner Bros. Discovery, Inc. Series A (<a data-ticker=\"WBD\" href=\"https://www.tipranks.com/stocks/wbd\">(WBD)</a>) has held its Q4 earnings call. Read on for the main highlights of the call. </p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Warner Bros. Discovery’s latest earnings call struck a cautiously upbeat tone, with management leaning on box office strength, streaming scale, and sports momentum to offset linear TV headwinds and a stumbling games business. Executives framed the story as one of durable franchises and expanding monetization levers, while acknowledging investor anxiety around leverage as Discovery Global prepares to separate.</p>\n<h2>Film Slate Dominance Powers Warner Bros. Momentum</h2>\n<p>Warner Bros. Motion Picture Group remains a rare bright spot, delivering seven straight films opening above $40 million and spending 16 weeks atop the global box office. Nine number‑one debuts, nine Golden Globes, and 30 Oscar nominations underline the creative streak, with recent originals already topping $160 million globally in two weeks, including an $83 million opening weekend.</p>\n<h2>Streaming Scale Targets Signal Aggressive Growth Ambitions</h2>\n<p>HBO Max is rapidly scaling, with management on track to surpass 140 million streaming subscribers by the end of Q1 and projecting more than 150 million by year‑end. International rollouts in Germany, Italy, the U.K., and Ireland, alongside further expansion, are expected to drive the next leg of growth and underpin long‑term profitability targets.</p>\n<h2>Linear Networks Still Command Scale Despite Industry Pressures</h2>\n<p>WBD’s cable portfolio continues to punch above its weight, attracting 30% of all prime‑time cable viewing in the U.S. HBO and key linear networks posted sequential audience gains, with some returning series seeing audience growth in the 30% to 50% range, demonstrating that hit content can still draw scale even as cord‑cutting accelerates.</p>\n<h2>Sports And Events Deliver Audience And Engagement Spikes</h2>\n<p>Sports and major events remained a powerful engagement engine, highlighted by the 2026 Milano Cortina Winter Games, where streaming audiences more than tripled versus 2022 and European linear viewing hours rose over 50%. Across the past 12 months, WBD aired 440 sports events that each drew at least 2 million viewers, reinforcing the strategic value of live rights.</p>\n<h2>Advertising Environment Shows Signs Of Stabilizing</h2>\n<p>Management reported that ad trends improved sequentially in Q4 and stayed firm into Q1, with stronger scatter pricing, solid upfronts, and healthier international markets. They expect international ad sales to be flat to slightly up this year, suggesting that the worst of the cyclical downturn may be behind them even as structural shifts persist.</p>\n<h2>Monetizing Streaming: Price, Ads, And Product Levers</h2>\n<p>The company highlighted multiple levers to boost streaming economics, including stronger originals, major market launches, and a push into ad tiers. Password‑sharing enforcement and product upgrades are early but seen as key upside drivers, and management stressed that international ad fill rates are still relatively low, leaving room for meaningful revenue growth over time.</p>\n<h2>Creative Renaissance Across Film, HBO, And TV Studios</h2>\n<p>Executives repeatedly pointed to a creative turnaround across Warner Bros. Motion Pictures, HBO, and Warner Bros. Television, anchored in retaining and attracting top talent. Franchise rebuilding around brands like Minecraft, Superman, and Batman, plus series averaging 13 million to 27 million viewers per episode, is bolstering both cultural relevance and monetization prospects.</p>\n<h2>Discovery Global Spin Preps For Life As A Levered Pure‑Play</h2>\n<p>The planned separation of Discovery Global was a central focus, with management projecting pro forma net leverage around 3.3x and arguing the profile is sustainable. Expected credit ratings in the single‑B to low double‑B range and profitable Discovery+ operations in many markets are cited to support the case for standalone viability despite investor skepticism.</p>\n<h2>Games Pipeline Reset And New Titles On The Horizon</h2>\n<p>After a reset of its games strategy, WBD is refocusing on proven studios and franchises, but the near‑term pipeline remains thin. Two 2026 releases were flagged, including a TT Games console and PC title in May and a Dragonfire mobile follow‑up to Game of Thrones: Conquest in summer, with management reminding investors of historically strong mobile franchise returns.</p>\n<h2>Structural Headwinds Weigh On Linear And News Assets</h2>\n<p>Management was candid about persistent secular pressures on linear TV and regional variation in ad markets, noting that some geographies lag others. CNN faced ad sales headwinds earlier in the period despite a later audience uptick, underscoring the vulnerability of news and legacy linear assets within the broader portfolio.</p>\n<h2>NBA Exposure Creates Near‑Term Advertising Drag</h2>\n<p>While many sports properties performed well, WBD flagged the NBA as a specific headwind impacting ad comparisons in the period. Costs and related dynamics around NBA exposure weighed on advertising performance, partially offsetting better trends seen in other leagues such as MLB playoffs and the NHL.</p>\n<h2>Video Games: Missed Launches And Earnings Drag Ahead</h2>\n<p>The company acknowledged that a 2024 game launch was “unfortunately unsuccessful,” and characterized 2025 as a reset year, limiting near‑term contributions from the division. With the 2026 slate only modestly refreshed and expected to resemble 2025 in scope, management cautioned that games will not be a major EBITDA driver in the short term.</p>\n<h2>Early Days For Password‑Sharing Crackdown And Ad Tiers</h2>\n<p>Password‑sharing enforcement is still described as being in its “second inning,” with full global rollout yet to occur, meaning its revenue impact remains in the early stages. Similarly, international ad tiers are only beginning to scale, so the monetization benefits from these initiatives should build gradually rather than immediately.</p>\n<h2>Leverage And Separation Remain In The Investor Crosshairs</h2>\n<p>Investors continue to scrutinize leverage around the Discovery Global spin, despite management’s assertion that roughly 3.3x net leverage is manageable. A proxy range of zero to $2 billion for certain items highlights the potential variability around the transaction, keeping capital allocation and balance sheet strategy front and center.</p>\n<h2>Efficiency Push And Cost Discipline Continue</h2>\n<p>Management reiterated that operational efficiency remains a priority, including the use of <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> and ongoing cost‑savings efforts targeted for 2026. These actions, part of the Discovery Global plan, signal that restructuring and discretionary cost controls will continue as WBD seeks to protect margins while funding growth initiatives.</p>\n<h2>Guidance Underscores Streaming Scale And Spin‑Off Metrics</h2>\n<p>Looking ahead, WBD expects HBO Max to surpass 140 million subscribers by the end of Q1 2026 and exceed 150 million by year‑end, with streaming profits targeted to roughly triple by 2030. Discovery Global is projected to emerge with around 3.3x net leverage and single‑B to low double‑B ratings, while international ad sales are guided to be flat to slightly up and theatrical and sports metrics remain strong.</p>\n<p>Warner Bros. Discovery’s earnings call painted a picture of a content powerhouse leaning on film hits, streaming scale, and sports while navigating structural linear decline and a reset in gaming. For investors, the story hinges on whether management can convert creative momentum and early monetization efforts into durable cash flow while keeping leverage in check through the Discovery Global separation.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Communication-Services-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/warner-bros-discovery-earnings-call-highlights-streaming-push",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 08:30:09",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984889,
            "title": "NuScale Power Alters Capital Strategy, Ends ATM Program",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>An announcement from NuScale Power ( <a data-ticker=\"SMR\" href=\"https://www.tipranks.com/stocks/smr\">(SMR)</a> ) is now available.</p>\n<p></p>\n<p></p><p><span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/smr\" target=\"_blank\" ;=\"\" rel=\"nofollow\">NuScale Power</a></span>, a company operating in the energy technology sector with a focus on nuclear power solutions, did not provide additional operational or market details in this disclosure.</p>\n<p>The company announced that, in connection with entering into a new sales agreement, it terminated its prior at-the-market equity offering program under a sales agreement dated November 7, 2025, signaling a shift in how it may access capital markets going forward.</p>\n<p>The most recent analyst rating on <a data-ticker=\"SMR\" href=\"https://www.tipranks.com/stocks/smr\">(SMR)</a> stock is a Buy with a $20.00 price target. To see the full list of analyst forecasts on NuScale Power stock, see the SMR <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/smr/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on SMR Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, SMR is a Neutral.</p>\n<p>The score is held down primarily by weak financial performance—very large losses and substantial negative free cash flow—despite strong gross margins and a low-debt balance sheet. Technicals also lean bearish with price below key moving averages and negative MACD. These are partially offset by a constructive earnings call featuring a major deployment partnership and higher reported liquidity.</p>\n<p>To see Spark’s full report on SMR stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/smr/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about NuScale Power</u></b></p>\n<p><b>Average Trading Volume:</b> 26,550,012</p>\n<p><b>Technical Sentiment Signal:</b> Sell</p>\n<p><b>Current Market Cap:</b> $4.07B</p>\n<p></p>\n<p></p><p>Learn more about SMR stock on <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/smr\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Stock Analysis page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Industrials-4-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/nuscale-power-alters-capital-strategy-ends-atm-program",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 08:35:33",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984878,
            "title": "Macerich Expands and Refinances $900 Million Credit Facility",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Macerich ( <a data-ticker=\"MAC\" href=\"https://www.tipranks.com/stocks/mac\">(MAC)</a> ) just unveiled an update.</p>\n<p></p>\n<p></p><p>On February 24, 2026, The <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/mac\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Macerich</a></span> Company and its operating partnership entered into a Second Amended and Restated Credit Agreement that refinanced and expanded their revolving credit facility to $900 million, maturing March 1, 2029, with an option to extend to March 1, 2030. The facility can be upsized to $1.1 billion, carries interest based on Base Rate or Term SOFR plus a margin tied initially to debt yield and later to net debt to EBITDA, and charges a fee on unused commitments.</p>\n<p>The credit line is secured by mortgages on certain wholly owned assets and equity pledges, with a borrowing base maintenance covenant requiring collateral value to at least match outstanding borrowings. Macerich can sell or finance secured assets and potentially release all mortgages once leverage tests are met, while remaining subject to minimum debt yield, fixed charge coverage, maximum floating-rate debt, and other customary covenants and events of default.</p>\n<p>The most recent analyst rating on <a data-ticker=\"MAC\" href=\"https://www.tipranks.com/stocks/mac\">(MAC)</a> stock is a Hold with a $21.00 price target. To see the full list of analyst forecasts on Macerich stock, see the MAC <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/mac/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on MAC Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, MAC is a Neutral.</p>\n<p>The score is held back primarily by weak financial performance (sharp 2025 revenue drop, ongoing net losses, and high leverage), partially offset by resilient operating/free cash flow. Recent earnings-call disclosures point to improving operational momentum (record leasing, occupancy gains, and a sizable SNO pipeline) but with meaningful execution and balance-sheet risks. Technically, the stock shows a supportive uptrend, while valuation is mixed due to the negative P/E despite a moderate dividend yield.</p>\n<p>To see Spark’s full report on MAC stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/mac/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Macerich</u></b></p>\n<p>The Macerich Company is a U.S. real estate investment trust focused on owning, operating and redeveloping retail and mixed-use properties through its operating partnership, The Macerich Partnership, L.P. Its portfolio and secured financing activities are centered on income-producing, wholly owned assets, with capital structure management playing a key role in its strategy.</p>\n<p><b>Average Trading Volume:</b> 1,937,174</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $5.39B</p>\n<p></p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/shutterstock_1921507979-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/macerich-expands-and-refinances-900-million-credit-facility",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 08:30:15",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984183,
            "title": "Civista Bancshares Elevates Veronica Doucette to Officer Role",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Civista Bancshares ( <a data-ticker=\"CIVB\" href=\"https://www.tipranks.com/stocks/civb\">(CIVB)</a> ) has issued an announcement.</p>\n<p></p>\n<p></p><p>On February 26, 2026, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/civb\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Civista Bancshares</a></span>, Inc. announced that Veronica Doucette, currently Senior Vice President and Human Resources Officer at Civista Bank, has been appointed an officer of the holding company, reflecting the board’s confidence in her leadership and strategic HR expertise. The move underscores Civista’s emphasis on strengthening leadership and aligning its operating subsidiaries, as Doucette’s long tenure since 2008 in advancing human resources practices, talent strategy and organizational development is expected to further support the company’s culture, employee initiatives and overall governance framework.</p>\n<p>The most recent analyst rating on <a data-ticker=\"CIVB\" href=\"https://www.tipranks.com/stocks/civb\">(CIVB)</a> stock is a Hold with a $26.00 price target. To see the full list of analyst forecasts on Civista Bancshares stock, see the CIVB <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/civb/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on CIVB Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, CIVB is a Neutral.</p>\n<p>The score is supported by attractive valuation (low P/E with a solid dividend) and constructive technicals (trading above key moving averages with moderate momentum). Financial performance is mixed: strong margins and reasonable leverage/capital are tempered by a steep revenue growth decline and weaker operating cash-flow conversion. Earnings call commentary is broadly positive on loan growth, NIM, and funding mix, but near-term expense pressure and a modest uptick in problem credits cap the upside.</p>\n<p>To see Spark’s full report on CIVB stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/civb/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Civista Bancshares</u></b></p>\n<p>Civista Bancshares, Inc. is a $4.3 billion financial holding company headquartered in Sandusky, Ohio, whose primary subsidiary, Civista Bank, was founded in 1884 and provides full-service banking, commercial lending, mortgage and wealth management services. Civista Bank operates 44 locations across Ohio, Southeastern Indiana and Northern Kentucky and offers commercial equipment leasing nationwide through its Civista Leasing and Finance Division, with its common shares traded on the NASDAQ Capital Market under the symbol CIVB.</p>\n<p><b>Average Trading Volume:</b> 103,790</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $461.6M</p>\n<p></p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_2136560565-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/civista-bancshares-elevates-veronica-doucette-to-officer-role",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 07:39:14",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984184,
            "title": "NewMarket Declares Quarterly Dividend, Signaling Ongoing Confidence",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>An announcement from Newmarket ( <a data-ticker=\"NEU\" href=\"https://www.tipranks.com/stocks/neu\">(NEU)</a> ) is now available.</p>\n<p></p>\n<p></p><p>On February 26, 2026, NewMarket Corporation announced that its board of directors had declared a quarterly dividend of $3.00 per share on its common stock. The dividend is scheduled to be paid on April 1, 2026, to shareholders of record as of the close of business on March 16, 2026.</p>\n<p>The increased quarterly dividend underlines NewMarket’s continued emphasis on returning capital to shareholders, supported by cash flows from its fuel additives and aerospace and defense materials businesses. The move may signal management’s confidence in the company’s financial position and the resilience of demand across its petroleum additives and mission-critical propellant markets.\n</p>\n<p>The most recent analyst rating on <a data-ticker=\"NEU\" href=\"https://www.tipranks.com/stocks/neu\">(NEU)</a> stock is a Hold with a $660.00 price target. To see the full list of analyst forecasts on Newmarket stock, see the NEU <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/neu/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on NEU Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, NEU is a Neutral.</p>\n<p>The score is driven primarily by solid fundamentals—strong margins, strong recent free cash flow, and improved leverage—tempered by clear technical weakness (price below major moving averages and negative MACD). Valuation is supportive (P/E ~13.5 with ~1.85% yield), while the latest earnings call was mixed: Specialty Materials momentum and capital commitment contrast with softness in Petroleum Additives and tax/margin headwinds.</p>\n<p>To see Spark’s full report on NEU stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/neu/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Newmarket</u></b></p>\n<p>NewMarket Corporation is a Richmond, Virginia-based holding company operating through subsidiaries Afton Chemical, Ethyl, American Pacific Corporation and Calca Solutions. Afton and Ethyl develop, manufacture, blend and supply chemical additives that improve petroleum product performance, while AMPAC and Calca focus on specialty materials and high-purity hydrazine for aerospace and defense applications.</p>\n<p>The group positions itself as a long-term provider of mission-critical materials and innovative solutions, with an emphasis on safety and supporting advanced aerospace and defense uses. Its portfolio spans fuel and lubricant additives, solid rocket motor materials and ultra-high-purity propellants, giving it exposure to both energy-related and defense-oriented industrial demand.\n</p>\n<p><b>Average Trading Volume:</b> 141,715</p>\n<p><b>Technical Sentiment Signal:</b> Hold</p>\n<p><b>Current Market Cap:</b> $5.82B</p>\n<p></p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_2186329533-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/newmarket-declares-quarterly-dividend-signaling-ongoing-confidence",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 07:39:56",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984172,
            "title": "CenterPoint Energy Raises $650 Million via Convertible Notes",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Centerpoint Energy ( <a data-ticker=\"CNP\" href=\"https://www.tipranks.com/stocks/cnp\">(CNP)</a> ) has provided an announcement.</p>\n<p></p>\n<p></p><p>On February 26, 2026, CenterPoint Energy, Inc. completed a private sale of $650 million aggregate principal amount of 2.875% Convertible Senior Notes due 2029 to qualified institutional buyers, generating net proceeds of approximately $641.5 million. The notes, issued under an indenture with The Bank of New York Mellon Trust Company as trustee, bear semiannual interest, mature on May 15, 2029, and cannot be redeemed early, while offering holders conditional conversion rights and standard protections in events of default or fundamental corporate changes.</p>\n<p>The securities are senior unsecured obligations ranking pari passu with CenterPoint’s existing convertible notes and structurally junior to subsidiary liabilities, with an initial conversion rate equivalent to a price of about $53.61 per share, a 25% premium to the February 23, 2026 NYSE closing price. The structure gives CenterPoint relatively low-cost, flexible financing while potentially diluting common shareholders if the stock trades above the conversion price, and provides institutional investors with downside credit protection and upside equity participation tied to the company’s future performance.</p>\n<p>The most recent analyst rating on <a data-ticker=\"CNP\" href=\"https://www.tipranks.com/stocks/cnp\">(CNP)</a> stock is a Hold with a $44.00 price target. To see the full list of analyst forecasts on Centerpoint Energy stock, see the CNP <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cnp/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on CNP Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, CNP is a Neutral.</p>\n<p>The score is driven mainly by improving forward outlook from the earnings call (reaffirmed EPS growth guidance, accelerating Houston load growth, and expanded long-term capex plan) and supportive technical momentum (price above major moving averages with positive MACD). These positives are tempered by weaker underlying cash-flow quality (persistently negative free cash flow) and elevated leverage, with valuation also on the high side for a regulated utility.</p>\n<p>To see Spark’s full report on CNP stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cnp/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Centerpoint Energy</u></b></p>\n<p>CenterPoint Energy, Inc. is a U.S. utility holding company that operates in the energy infrastructure sector, with a primary focus on regulated electric and natural gas distribution. Its business centers on serving residential, commercial, and industrial customers through transmission and distribution networks in its service territories, relying heavily on access to capital markets to fund operations and investments.</p>\n<p><b>Average Trading Volume:</b> 5,364,981</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $27.94B</p>\n<p></p>\n<p></p><p>Find detailed analytics on CNP stock on <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cnp\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Stock Analysis page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/10/shutterstock_2185349659.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/centerpoint-energy-raises-650-million-via-convertible-notes",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 07:35:32",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984144,
            "title": "Compass Reports Record 2025 Results and Cash Flow",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Compass ( <a data-ticker=\"COMP\" href=\"https://www.tipranks.com/stocks/comp\">(COMP)</a> ) has shared an announcement.</p>\n<p></p>\n<p></p><p>On February 26, 2026, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/comp\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Compass</a></span> reported record results for the fourth quarter and full year 2025, highlighted by Q4 revenue of $1.70 billion, up 23.1% year over year, and full-year revenue of $7.0 billion, along with record full-year operating cash flow of $217 million and its eighth consecutive quarter of positive operating cash flow. Although the company posted a GAAP net loss of $42.6 million in Q4 2025, reflecting merger-related costs and non-cash expenses, it significantly improved profitability metrics with Adjusted EBITDA rising to $58.3 million, strengthened its balance sheet with $199 million in cash and no revolver borrowings, expanded its principal agent base by 19.4%, and continued to outperform the U.S. housing market in transaction and GTV growth while deepening adoption of its technology platform and integrating recent acquisitions, including Christie’s International Real Estate and the closed Anywhere transaction.</p>\n<p>Operationally in 2025, Compass drove 19.7% year-over-year growth in Q4 transactions versus a 0.7% increase for the broader U.S. market, lifted organic revenue and GTV by double digits, and maintained high agent retention at 96.8%. The company also advanced key platform offerings such as Compass One, Make-Me-Sell, One-Click Title &amp; Escrow and a new Buyer Demand Tool, which together increased client engagement and attach rates, underscoring a strategy of tightly linking technology, ancillary services, and disciplined cost control to enhance competitiveness and long-term value for agents and shareholders.</p>\n<p>The most recent analyst rating on <a data-ticker=\"COMP\" href=\"https://www.tipranks.com/stocks/comp\">(COMP)</a> stock is a Buy with a $15.00 price target. To see the full list of analyst forecasts on Compass stock, see the COMP <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/comp/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on COMP Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, COMP is a Neutral.</p>\n<p>The score is primarily driven by improving financial trajectory (notably strong free cash flow growth and better leverage) and strong technical momentum. This is offset by ongoing profitability weaknesses and a valuation profile dominated by losses (negative P/E), while the latest earnings call was supportive due to strong Q3 performance and cost discipline despite elevated OpEx and legal costs.</p>\n<p>To see Spark’s full report on COMP stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/comp/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Compass</u></b></p>\n<p>Compass, Inc., which operates as Compass International Holdings, is a global real estate services company listed on the NYSE under the ticker COMP. The firm focuses on residential brokerage supported by a proprietary end-to-end technology platform, with operations in every major U.S. city and across roughly 120 countries and territories, serving agents and clients through data-driven tools and integrated transaction services.</p>\n<p><b>Average Trading Volume:</b> 18,659,154</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $6.83B</p>\n<p></p>\n<p></p><p>Find detailed analytics on COMP stock on <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/comp\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Stock Analysis page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/shutterstock_1921507979-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/compass-reports-record-2025-results-and-cash-flow",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 07:25:09",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984067,
            "title": "ETHZilla Rebrands as Forum Markets, Emphasizing Tokenization Strategy",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>ETHZilla Corporation ( <a data-ticker=\"ETHZ\" href=\"https://www.tipranks.com/stocks/ethz\">(ETHZ)</a> ) just unveiled an announcement.</p>\n<p></p>\n<p></p><p>On February 24, 2026, the company filed a Certificate of Amendment in Delaware to change its name from <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ethz\" target=\"_blank\" ;=\"\" rel=\"nofollow\">ETHZilla Corporation</a></span> to Forum Markets, Incorporated, with the amendment becoming effective at 12:01 a.m. EST on February 25, 2026. The board-approved change, which required no shareholder vote and leaves security holder rights and the CUSIP number unchanged, will see the stock begin trading on Nasdaq under the new ticker “FRMM” at the market open on March 2, 2026.</p>\n<p>In tandem with the rebrand, Forum launched a new corporate website on February 25, 2026, and framed the name change as the next step in its strategic evolution into an institutional-grade digital asset platform focused on tokenizing real-world, income-generating assets on <a data-autolink=\"true\" href=\"https://www.tipranks.com/cryptocurrency/eth-usd\">Ethereum</a>. Management emphasized that the new identity reflects the company’s role as a regulated bridge between traditional capital markets and blockchain-based infrastructure, underpinned by a multi-pronged revenue model and recent moves such as launching the Eurus Aero Token I and acquiring a portfolio of manufactured and modular home loans for future tokenization.</p>\n<p>The rebranding consolidates Forum’s positioning as it transitions from passively holding <a data-autolink=\"true\" href=\"https://www.tipranks.com/cryptocurrency\">crypto</a> assets to executing a broader tokenization strategy spanning sectors including auto loans, housing finance and aerospace equipment. For investors and institutional partners, the shift signals a more mature, infrastructure-centric business model aimed at defining market structure for on-chain finance and scaling access to tokenized real-world asset products.</p>\n<p>The most recent analyst rating on <a data-ticker=\"ETHZ\" href=\"https://www.tipranks.com/stocks/ethz\">(ETHZ)</a> stock is a Hold with a $4.00 price target. To see the full list of analyst forecasts on ETHZilla Corporation stock, see the ETHZ <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ethz/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on ETHZ Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, ETHZ is a Neutral.</p>\n<p>Overall score is pressured most by very weak financial performance (large losses and ongoing cash burn) and bearish technicals (below key moving averages with negative MACD). Corporate actions are a relative positive—especially the convertible note redemption and strategic moves—but they do not yet offset the current profitability, cash-flow, and trend concerns.</p>\n<p>To see Spark’s full report on ETHZ stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/ethz/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about ETHZilla Corporation</u></b></p>\n<p>Forum Markets, Incorporated, formerly ETHZilla Corporation, is a Nasdaq-listed digital asset platform focused on tokenizing institutional-grade real-world assets on Ethereum. The company structures cash-generating assets onto blockchain-based infrastructure to unlock liquidity, broaden investor access and improve primary issuance and secondary market efficiency for institutional participants.</p>\n<p>Forum integrates traditional asset management principles with scalable digital market architecture, positioning itself as a bridge between traditional finance and blockchain-based capital markets. Since launching in August 2025, it has built infrastructure, partnerships and asset pipelines across sectors such as auto loans, manufactured housing finance and aerospace equipment to support institutional-scale tokenization.</p>\n<p>The firm operates an economic model built around four revenue streams: yield on assets held prior to tokenization, origination fees on tokenized products, recurring asset management fees and potential transaction-based revenue from secondary trading. Through strategic equity investments in AI-driven credit and underwriting platforms and regulated distribution via partners like Liquidity.io, Forum aims to create a repeatable pipeline for tokenized investment products across multiple asset classes.</p>\n<p><b>Average Trading Volume:</b> 772,505</p>\n<p><b>Technical Sentiment Signal:</b> Sell</p>\n<p><b>Current Market Cap:</b> $65.59M</p>\n<p></p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_1096459574-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/ethzilla-rebrands-as-forum-markets-emphasizing-tokenization-strategy",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 06:55:11",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984055,
            "title": "CBRE Grants Performance-Based Equity Award in Succession Plan",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>CBRE Group ( <a data-ticker=\"CBRE\" href=\"https://www.tipranks.com/stocks/cbre\">(CBRE)</a> ) has provided an update.</p>\n<p></p>\n<p></p><p>On February 25, 2026, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cbre\" target=\"_blank\" ;=\"\" rel=\"nofollow\">CBRE Group</a></span>’s Compensation Committee granted a one-time, fully performance-based equity retention award with a $5 million target value to Chief Operating Officer and CEO of Advisory Services, Vikram Kohli, as part of the company’s long-term succession strategy. Structured entirely as performance-based restricted stock units split evenly between relative total shareholder return and relative earnings per share goals versus the S&amp;P 500, the award features a five-year vesting period, above-market performance hurdles starting at the 40th percentile, and potential payouts ranging from 0% to 175% of target, tying Kohli’s long-term compensation tightly to CBRE’s comparative shareholder returns and earnings growth.</p>\n<p>The award’s rTSR portion will measure cumulative total shareholder return from February 25, 2026, to January 31, 2031, while the rEPS portion will track Core EPS growth against peers’ GAAP EPS growth from January 1, 2026, to December 31, 2030, with vesting occurring after performance certification but no later than February 25, 2031. By extending vesting to five years and requiring performance above median for enhanced payouts, CBRE is signaling a strong commitment to rigorous pay-for-performance alignment, executive retention and competitive positioning in the S&amp;P 500 peer set, potentially reassuring investors about long-term leadership stability and disciplined incentive design.</p>\n<p>The most recent analyst rating on <a data-ticker=\"CBRE\" href=\"https://www.tipranks.com/stocks/cbre\">(CBRE)</a> stock is a Buy with a $180.00 price target. To see the full list of analyst forecasts on CBRE Group stock, see the CBRE <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cbre/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on CBRE Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, CBRE is a Neutral.</p>\n<p>The score is driven primarily by solid financial performance (notably a strengthened balance sheet and improving revenue trend) and upbeat earnings-call guidance for 2026 EPS growth. These positives are tempered by weak technical momentum (price below key moving averages with negative MACD) and a demanding valuation (P/E ~39.5 with no dividend support).</p>\n<p>To see Spark’s full report on CBRE stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cbre/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about CBRE Group</u></b></p>\n<p>CBRE Group operates in the commercial real estate services and investment industry, providing advisory and transaction services, property management, and related financial and strategic consulting to corporate, institutional and investor clients globally. The company focuses on long-term value creation for shareholders through performance-based compensation structures that align executive incentives with market benchmarks and earnings growth.</p>\n<p><b>Average Trading Volume:</b> 1,921,999</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $43.14B</p>\n<p></p>\n<p></p><p>For an in-depth examination of CBRE stock, go to <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/cbre\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Overview page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/shutterstock_1921507979-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/cbre-grants-performance-based-equity-award-in-succession-plan",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 06:50:03",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2984032,
            "title": "AXIA Energia Sets April Vote on Novo Mercado Migration and Share Conversion",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>AXIA Energia Pfd Class B ( ($AXIA.PR) ) has provided an announcement.</p>\n<p></p>\n<p></p><p>AXIA Energia, the Brazilian electric utility better known as Eletrobras, is advancing a corporate restructuring aimed at listing all its shares on B3’s Novo Mercado, which requires a single class of common stock and enhanced governance. The move is designed to unify common and preferred share classes while preserving the historical dividend premium enjoyed by preferred shareholders through an agreed exchange ratio.</p>\n<p>In February 2026 the company detailed its proposal and convened special and extraordinary shareholders’ meetings for April 1, 2026 to vote on the conversion of Class A1 and B1 preferred shares into common stock. The announcement, which has drawn broadly positive assessments from sell-side analysts and was followed by a sharp rise in AXIA’s share prices and market capitalization, is seen as a key de-risking milestone that could boost liquidity, improve governance, and broaden the company’s institutional investor base.</p>\n<p>The most recent analyst rating on ($AXIA.PR) stock is a Hold with a $10.50 price target. To see the full list of analyst forecasts on AXIA Energia Pfd Class B stock, see the AXIA.PR <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/axia.pr/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on AXIA.PR Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, AXIA.PR is a Outperform.</p>\n<p>The overall stock score of 74 reflects a strong strategic position with significant achievements in asset divestment and dividend payouts, as highlighted in the earnings call. Technical indicators show bullish momentum, though valuation concerns persist due to negative profitability. Financial performance is stable but faces challenges with profitability and revenue growth.</p>\n<p>To see Spark’s full report on AXIA.PR stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/axia.pr/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about AXIA Energia Pfd Class B</u></b></p>\n<p>AXIA Energia, operating under the corporate name Centrais Elétricas Brasileiras S.A. – Eletrobras, is Brazil’s largest electric power company, active across generation, transmission, and related energy services. Listed in Brazil and the U.S., it targets both domestic and international investors, and is moving to align its share structure with the Novo Mercado’s higher corporate governance standards.</p>\n<p><b>Average Trading Volume:</b> 31,103</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $27.96B</p>\n<p></p>\n<p></p>",
            "image": "",
            "link": "https://www.tipranks.com/news/company-announcements/axia-energia-sets-april-vote-on-novo-mercado-migration-and-share-conversion",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 06:40:35",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2983990,
            "title": "Grupo Aval Publishes Q4 2025 Results Materials Ahead of Investor Call",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Grupo Aval Acciones y Valores SA Pfd ( <a data-ticker=\"AVAL\" href=\"https://www.tipranks.com/stocks/aval\">(AVAL)</a> ) just unveiled an announcement.</p>\n<p></p>\n<p></p><p>On February 26, 2026, Grupo Aval Acciones y Valores S.A. announced that its materials for the quarterly consolidated results as of December 31, 2025, were made available to investors. The company noted that these documents support a results call scheduled for the same day, underscoring its ongoing disclosure practices and engagement with the international investment community.</p>\n<p>The release signals that Grupo Aval is maintaining its regular reporting cycle and providing detailed performance information to the market. This transparency is important for analysts and shareholders tracking the company’s financial position and strategic direction in the Latin American banking sector, although specific financial figures were not disclosed in the notice itself.</p>\n<p>The most recent analyst rating on <a data-ticker=\"AVAL\" href=\"https://www.tipranks.com/stocks/aval\">(AVAL)</a> stock is a Buy with a $5.50 price target. To see the full list of analyst forecasts on Grupo Aval Acciones y Valores SA Pfd stock, see the AVAL <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/aval/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on AVAL Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, AVAL is a Neutral.</p>\n<p>Overall score reflects a recovery in earnings and supportive earnings-call guidance, but is held back most by elevated leverage and weak cash flow conversion. Technicals are positive yet overextended, while valuation and dividend provide moderate support.</p>\n<p>To see Spark’s full report on AVAL stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/aval/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Grupo Aval Acciones y Valores SA Pfd</u></b></p>\n<p>Grupo Aval Acciones y Valores S.A. is a Colombia-based financial holding company operating in the banking and financial services industry. Through its subsidiaries, it focuses on a broad range of retail and corporate banking, lending, and related financial products in Colombia and the wider Latin American market, targeting both local and international investors.</p>\n<p><b>Average Trading Volume:</b> 121,189</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $5.24B</p>\n<p></p>\n<p></p><p>For a thorough assessment of AVAL stock, go to <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/aval\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Stock Analysis page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/09/shutterstock_2112464087-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/grupo-aval-publishes-q4-2025-results-materials-ahead-of-investor-call",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 06:31:22",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2983782,
            "title": "Energy Fuels Updates Pinyon Plain Mine Pre-Feasibility Study",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Energy Fuels ( <a data-ticker=\"UUUU\" href=\"https://www.tipranks.com/stocks/uuuu\">(UUUU)</a> ) has provided an announcement.</p>\n<p></p>\n<p></p><p><span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/uuuu\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Energy Fuels</a></span> Inc. has released an updated pre-feasibility study for its Pinyon Plain Mine in Coconino County, Arizona, and a feasibility study for its Donald Rare Earths and Mineral Sands Project in Victoria, Australia. The Pinyon Plain technical report, prepared by SLR International Corporation with an effective date of December 31, 2025 and signed on February 19, 2026, consolidates geological, mining, processing, environmental and economic analyses, underscoring Energy Fuels’ ongoing technical and economic evaluation of key uranium and rare earth assets that are central to its future project pipeline and portfolio development.</p>\n<p>The most recent analyst rating on <a data-ticker=\"UUUU\" href=\"https://www.tipranks.com/stocks/uuuu\">(UUUU)</a> stock is a Buy with a $21.35 price target. To see the full list of analyst forecasts on Energy Fuels stock, see the UUUU <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/uuuu/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on UUUU Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, UUUU is a Neutral.</p>\n<p>The score is primarily driven by strong technical momentum and a conservative balance sheet, but is held back by weak TTM profitability and ongoing negative operating/free cash flow. Management’s 2026 margin/cost improvement outlook and strategic moves in rare earths/critical minerals provide upside potential, though execution, grade variability, and geopolitical risk remain key constraints.</p>\n<p>To see Spark’s full report on UUUU stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/uuuu/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Energy Fuels</u></b></p>\n<p>Energy Fuels Inc. operates in the mining and mineral resources sector, with a focus on uranium, rare earths and associated mineral sands projects in North America and Australia. The company is advancing the Pinyon Plain uranium and copper mine in Coconino County, Arizona, and the Donald Rare Earths and Mineral Sands Project in Victoria, Australia, positioning itself in strategic fuel and critical minerals markets.</p>\n<p><b>Average Trading Volume:</b> 12,798,914</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> $5.4B</p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Energy-3-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/energy-fuels-updates-pinyon-plain-mine-pre-feasibility-study",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 05:56:51",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2983787,
            "title": "Helio Hires New Auditor Ahead of Planned NYSE Uplisting",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>The latest announcement is out from Helio Corporation ( <a data-ticker=\"HLEO\" href=\"https://www.tipranks.com/stocks/hleo\">(HLEO)</a> ).</p>\n<p></p>\n<p></p><p>On February 23, 2026, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/hleo\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Helio Corporation</a></span> announced that its board had engaged Hacker, Johnson &amp; Smith PA, a PCAOB-registered accounting firm with extensive SEC-reporting experience, as its independent auditor for the fiscal year ending October 31, 2026, effective February 21. The move is intended to bolster Helio’s audit infrastructure and internal reporting processes with institutional-grade capabilities as it advances its space-based solar power initiatives and prepares for a planned uplisting to the New York Stock Exchange.</p>\n<p>By selecting a firm that serves a large roster of regulated, complex clients, Helio is signaling a stronger emphasis on corporate governance, rigorous financial reporting and alignment with public market standards. The decision is aimed at reinforcing shareholder confidence and supporting the company’s transition from an OTC-quoted space power innovator toward a more prominent capital markets profile tied to its long-term growth ambitions.\n</p>\n<p><b><u>More about Helio Corporation</u></b></p>\n<p>Helio Corporation, based in Berkeley, California, is developing space-based solar power systems that capture solar energy beyond Earth’s atmosphere and beam it to the surface, aiming to create orbital platforms as part of the global power grid. Founded in 2018, the company designs space mechanisms, advanced antenna systems and space design solutions for NASA, the European Space Agency, private aerospace firms, universities and other space agencies worldwide.</p>\n<p>Its products operate across the solar system, from the Sun to Jupiter, and Helio positions itself as a key technology partner to more than a dozen organizations in highly advanced space missions. The company’s strategic focus centers on leveraging its engineering expertise to support flagship space initiatives while advancing its vision of delivering uninterrupted, carbon-free electricity at scale through orbital infrastructure.</p>\n<p><b>Average Trading Volume:</b> 57,499</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p></p>\n<p></p><p>For an in-depth examination of HLEO stock, go to <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/hleo\" target=\"_blank\" ;=\"\" rel=\"nofollow\">TipRanks’ Overview page</a></span>.</p><p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Industrials-5-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/helio-hires-new-auditor-ahead-of-planned-nyse-uplisting",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 05:57:39",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2983547,
            "title": "Suncor Energy Files Form 6-K and Releases 2025 Annual Report",
            "description": "<html><head></head><body><p></p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p><p>Suncor Energy ( <a data-ticker=\"TSE:SU\" href=\"https://www.tipranks.com/stocks/tse:su\">(TSE:SU)</a> ) just unveiled an update.</p>\n<p></p>\n<p></p><p>Suncor Energy Inc., the Calgary-based integrated oil and gas producer, has filed a Form 6-K with the U.S. Securities and Exchange Commission for February 2026 as a foreign private issuer reporting under Form 40-F. The filing reflects the company’s ongoing compliance with U.S. reporting requirements tied to its listed securities and provides investors with updated regulatory documentation.</p>\n<p>On February 26, 2026, Suncor submitted the report authorized by Assistant Corporate Secretary Shawn Poirier, indicating the formal release of its 2025 Annual Report to Shareholders for the year ended December 31, 2025 and an associated Form 51-101F4 as exhibits. The submission consolidates Suncor’s 2025 operating and reserves disclosure into the U.S. public record, supporting transparency for cross-border investors and reinforcing its governance and disclosure practices.</p>\n<p>The most recent analyst rating on <a data-ticker=\"TSE:SU\" href=\"https://www.tipranks.com/stocks/tse:su\">(TSE:SU)</a> stock is a Buy with a C$84.00 price target. To see the full list of analyst forecasts on Suncor Energy stock, see the TSE:SU <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/tse:su/forecast\" target=\"_blank\" ;=\"\" rel=\"nofollow\">Stock Forecast page</a></span>.</p>\n<p><b><u>Spark’s Take on TSE:SU Stock</u></b></p>\n<p>According to Spark, TipRanks’ <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> Analyst, TSE:SU is a Outperform.</p>\n<p>The score is driven by solid financial performance (durable profitability and strong operating cash generation) and a constructive technical backdrop (clear uptrend with positive momentum). The earnings call adds support via raised guidance, record operations, and continued dividends/buybacks, while valuation is reasonable but not a major upside catalyst. Key offsets are 2025 free-cash-flow softness versus 2024, higher 2025 debt, and an overbought RSI that elevates near-term pullback risk.</p>\n<p>To see Spark’s full report on TSE:SU stock, <span class=\"tr-stock-ticker\" style=\"color:blue\"><a href=\"https://www.tipranks.com/stocks/tse:su/ai-stock-analysis\" target=\"_blank\" ;=\"\" rel=\"nofollow\">click here</a></span>. </p>\n<p><b><u>More about Suncor Energy</u></b></p>\n<p>Suncor Energy Inc. is a Canadian integrated energy company headquartered in Calgary, Alberta, operating primarily in the oil and gas sector. The company focuses on the development, production, and marketing of crude oil and related petroleum products, serving domestic and international markets through upstream, downstream, and refining operations.</p>\n<p><b>Average Trading Volume:</b> 7,043,454</p>\n<p><b>Technical Sentiment Signal:</b> Buy</p>\n<p><b>Current Market Cap:</b> C$91.27B</p>\n<p></p>\n<p></p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/Energy-6-750x406.jpg",
            "link": "https://www.tipranks.com/news/company-announcements/suncor-energy-files-form-6-k-and-releases-2025-annual-report",
            "author": "TipRanks Auto-Generated Newsdesk",
            "pub_date": "2026-02-27 05:18:48",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        }
    ]
}