{
    "data": [
        {
            "id": 1233233,
            "title": "UK Stocks: Entain’s BetMGM Achieves $1B Sales; Investments Curb Profits",
            "description": "<p></p>\n<p>Based in London, Entain is a gaming and sports betting company that owns brands like Bwin, Ladbrokes, Partypoker, and PartyCasino. Meanwhile, BetMGM is a leader in sports betting and iGaming in the U.S., jointly owned by Entain and the U.S.-based MGM Resorts <a data-ticker=\"MGM\" href=\"https://www.tipranks.com/stocks/mgm\">(MGM)</a>. </p>\n<h2 class=\"wp-block-heading\"><strong>BetMGM’s First-Half Update</strong></h2>\n<p>Among BetMGM’s revenues, Online Sports Betting NGR (net gaming revenue) per active user rose 16% year-on-year in the second quarter. Meanwhile, iGaming saw an 18% year-on-year increase in average monthly actives, marking an acceleration from 9% growth in the first quarter.</p>\n<p>In the first half, BetMGM expanded its geographic footprint by launching digital sports betting in North Carolina in March and across the District of Columbia in July. </p>\n<p>Moving forward, BetMGM stated that it has surpassed its targets for both customer acquisition and retention and expects this to result in higher year-over-year revenue growth in the second half of the year.</p>\n<h2 class=\"wp-block-heading\"><strong>Are Entain Shares a Good Buy?</strong></h2>\n<p>Analyst Ed Young from Morgan Stanley expressed his confidence in BetMGM’s outlook in the U.S. He expects it to achieve a significant position in the large U.S. market with increased investments.</p>\n<p>According to TipRanks consensus, <a href=\"https://www.tipranks.com/stocks/gb:ent/forecast\">ENT stock</a> has received a Strong Buy rating, backed by three Buys and one Hold recommendation. The <a href=\"https://www.tipranks.com/stocks/gb:ent\">Entain share price</a> prediction is 1,082.50p, which is 83.6% higher than the current trading levels.</p>\n<p>Year-to-date, ENT stock has lost 40% of its value in trading.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2024/07/shutterstock_2271694753-750x406.jpg",
            "link": "https://www.tipranks.com/news/global-markets/uk-stocks-entains-betmgm-achieves-1b-sales-investments-curb-profits",
            "author": "Kirti Tak",
            "pub_date": "2024-07-29 21:58:05",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1233927,
            "title": "UK Stocks: Pearson Reports Lower H1 Profits; Confirms Guidance",
            "description": "<p></p>\n<p>Pearson PLC is a publishing company that offers educational solutions, courses, and digital content in around 200 countries worldwide.</p>\n<h2 class=\"wp-block-heading\"><strong>Highlights from Pearson’s Interim Results</strong></h2>\n<p>For the first half, Pearson’s pretax profit dropped to £212 million, down from £236 million in the same period last year. Meanwhile, sales reached £1.75 billion, marking a decline from £1.88 billion a year ago.</p>\n<p>On the plus side, Pearson’s underlying adjusted operating profit increased by 4% to £250 million, with the adjusted profit margin rising to 14% from 13% the previous year.</p>\n<p>Among its businesses, the company’s sales in English Language Learning increased by 11%. This was mainly driven by strong growth in its Institutional business and the language learning solution, Mondly. However, the momentum in the English Language Learning business was partially offset by a sales decline in PTE (Pearson test of English) due to market dynamics. </p>\n<p>Meanwhile, Workforce Skills sales experienced 6% growth, while the Assessment &amp; Qualifications business grew by 2%. On the other hand, sales from Higher Education and Virtual Learning businesses fell by 2% and 1%, respectively.</p>\n<p>Additionally, Pearson announced an<a href=\"https://www.tipranks.com/stocks/gb:pson/dividends\"> interim dividend of 7.4p per share</a>, marking an increase of 6% over the previous year. During the period, the company completed a share buyback worth £500 million. However, Pearson has paused any further buybacks for now.</p>\n<p>The company also revealed that it aims to drive growth and efficiencies across all five of its core businesses, which is expected to result in restructuring costs. </p>\n<h2 class=\"wp-block-heading\"><strong>Is Pearson Stock a Good Buy?</strong></h2>\n<p>Overall, analysts are moderately bullish on <a href=\"https://www.tipranks.com/stocks/gb:pson\">PSON stock</a> based on four Buy and two Hold recommendations. The <a href=\"https://www.tipranks.com/stocks/gb:pson/forecast\">Pearson share price forecast</a> is 1,114.50p, which is 5.7% higher than the current level. </p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2024/07/shutterstock_1903456444-750x406.jpg",
            "link": "https://www.tipranks.com/news/global-markets/uk-stocks-pearsons-revenue-and-profit-decline-in-first-half-confirms-guidance",
            "author": "Kirti Tak",
            "pub_date": "2024-07-29 22:39:34",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1236248,
            "title": "Australian Stocks: Fortescue Shares Fall as Capital Group Offloads AU$1.9B Stake",
            "description": "<p></p>\n<p>The sale follows Fortescue’s recent announcement of its decision to scale back its goal of becoming a major player in green hydrogen. As part of this move, the company plans to reduce its global workforce by about 700 jobs and pause its ambitious 2030 hydrogen production goals.&nbsp;Analysts at Macquarie warned that the shift in Fortescue’s green energy strategy might diminish its share price premium compared to competitors.</p>\n<p>Fortescue is a mining company focused on iron ore and green energy. Over the last five days, FMG stock has lost 13.4% in trading, triggered by its quarterly update and the stake sale news. </p>\n<h2 class=\"wp-block-heading\"><strong>Fortescue’s June Quarter Update</strong></h2>\n<p>Last week, Fortescue reported its quarterly update for the quarter that ended on June 30, delivering an expectational performance. It achieved record iron ore shipments of 53.7 Mt (million tonnes), marking a 10% year-over-year increase. For FY24, the total shipments reached 191.6 Mt. The performance also highlighted the efficiencies realized through the company’s recovery plan after the <a href=\"https://www.tipranks.com/news/global-markets/fortescue-share-price-down-on-iron-ore-cars-derailment\">iron ore cars derailment in December 2023</a>.</p>\n<p>Looking forward, Fortescue aims to achieve shipments in the range of 190 Mt to 200 Mt in FY25.</p>\n<h2 class=\"wp-block-heading\"><strong>Is Fortescue a Good Buy?</strong></h2>\n<p>Despite the record numbers, Fortescue shares have experienced volatility. This is because the company is a commodity producer and is heavily influenced by fluctuations in commodity prices.</p>\n<p>Analysts have a bearish outlook on <a href=\"https://www.tipranks.com/stocks/au:fmg\">FMG stock</a>, as reflected in its Moderate Sell rating. According to TipRanks, the stock has received five Sell and six Hold recommendations. The average <a href=\"https://www.tipranks.com/stocks/au:fmg/forecast\">Fortescue share price</a> target is AU$20.25, which is 10.5% above the current trading levels.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2024/07/shutterstock_2336173471-750x406.jpg",
            "link": "https://www.tipranks.com/news/global-markets/australian-stocks-fortescue-shares-fall-as-capital-group-offloads-au1-9b-stake",
            "author": "Kirti Tak",
            "pub_date": "2024-07-30 16:51:02",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1238217,
            "title": "UK Stocks: Standard Chartered’s Q2 Results Drive Record Buyback; Shares Gain",
            "description": "<p></p>\n<p>Standard Chartered, or StanChart, is a multinational banking group, operating in 53 markets globally.</p>\n<h2 class=\"wp-block-heading\"><strong>StanChart Q2 Review: Major Highlights</strong></h2>\n<p>In the second quarter, Standard Chartered’s operating income grew by 4% year-over-year to $4.7 billion at constant currency. Among its segments, operating income from its Wealth Solutions increased by 27% at ccy, driven by higher affluent clients.</p>\n<p>On the other hand, the bank’s net interest income dropped by 18% (at ccy) to $1.6 billion, as the advantage from higher interest rates diminished.</p>\n<p>In terms of outlook, StanChart upgraded its income growth forecast and now expects a more than 7% increase in operating income in 2024. The bank had previously projected operating income growth at the upper end of the 5%-7% range, excluding one-time items. Further, it upheld its net interest income forecast for 2024, expecting it to be between $10 billion and $10.25 billion at constant currency.</p>\n<p>Additionally, StanChart aims to return $5 billion to its shareholders by 2026.</p>\n<h2 class=\"wp-block-heading\"><strong>Is Standard Chartered a Buy, Hold, or Sell?</strong></h2>\n<p>Post-results, analysts from Goldman Sachs and Morgan Stanley confirmed their Buy ratings on STAN stock. Analysts are upbeat after the bank’s Q2 results, given its strong capital position, and a positive outlook.</p>\n<p>On TipRanks, <a href=\"https://www.tipranks.com/stocks/gb:stan\">STAN stock</a> has a Moderate Buy rating, backed by six Buy and four Hold recommendations. The <a href=\"https://www.tipranks.com/stocks/gb:stan/forecast\">Standard Chartered share price forecast</a>&nbsp;is 976.45p, which is 26.6% higher than the current trading level.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2024/07/shutterstock_2426399701-750x406.jpg",
            "link": "https://www.tipranks.com/news/global-markets/uk-stocks-standard-chartereds-q2-results-drive-record-buyback-shares-gain",
            "author": "Kirti Tak",
            "pub_date": "2024-07-30 21:48:13",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1238503,
            "title": "UK Stocks: Diageo (DGE) Shares Slump as FY24 Profits Drop",
            "description": "<p></p>\n<p>Despite the disappointing results, the company increased its full-year dividend for FY24 by 5% to 103.48 cents per share.</p>\n<p>Diageo owns a portfolio of around 200 well-known brands, including Baileys, Smirnoff, Tanqueray, Guinness, and many others.</p>\n<h2 class=\"wp-block-heading\"><strong>Cautious Environment Dampens Diageo’s Numbers</strong></h2>\n<p>Overall, Diageo’s sales volume declined 3.5% during the year amid a cautious consumer environment. Among its regions, the company’s performance was hit the most in the Latin America and Caribbean region (LAC), with a decline of 21.1% in organic net sales. This was mainly affected by the need to reduce excess inventory in the LAC region to align with the current market trends.</p>\n<p>Excluding this region, the company’s organic net sales increased by 1.8%, driven by growth in Africa, Asia Pacific, and Europe.</p>\n<p>Among its brands, Guinness showed strong momentum in Europe with a 22% growth in organic net sales.</p>\n<p>The company’s CEO, Debra Crew, described the year as “challenging” for the company and the industry as a whole. She also highlighted a record productivity savings of nearly $700 million during the year.</p>\n<h2 class=\"wp-block-heading\"><strong>Is Diageo a Buy, Hold, or Sell?</strong></h2>\n<p>Overall, analysts maintain a cautious outlook on Diageo stock, as the company has indicated that it expects challenges to continue in FY25.</p>\n<p>According to TipRanks’ consensus, <a href=\"https://www.tipranks.com/stocks/gb:dge\">DGE stock</a> has received a Hold rating based on a total of 12 recommendations from analysts. This includes five Buy, three Hold, and four Sell recommendations. The <a href=\"https://www.tipranks.com/stocks/gb:dge/forecast\">Diageo share price target</a> is 2,949.03p, which is 21.4% above the current trading levels.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2024/07/shutterstock_2420688745-750x406.jpg",
            "link": "https://www.tipranks.com/news/global-markets/uk-stocks-diageo-dge-shares-slump-as-fy24-profits-drop",
            "author": "Kirti Tak",
            "pub_date": "2024-07-30 22:37:07",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1240512,
            "title": "French Stocks: Airbus H1 Profit Falls; Space Charges Eclipse Revenue Growth",
            "description": "<p></p>\n<p>Airbus Group is a leading European aircraft manufacturer, catering to the commercial, defense, and space sectors.</p>\n<h2 class=\"wp-block-heading\"><strong>Insights from Airbus’ H1 Results</strong></h2>\n<p>Airbus’ first-half performance was mainly impacted by a €989 million charge in its Space Systems business. As a result, adjusted EBIT for its Defence and Space segment dropped to negative €807 million from €78 million a year ago.</p>\n<p>Additionally, in its Commercial Aircraft segment, the company increased investments to ramp up its jetliner production line while tackling supply chain challenges. Adjusted EBIT for Airbus’ commercial aircraft activities decreased to €1.95 billion from €2.26 billion in H1 2023.</p>\n<p>For the full year, Airbus confirmed its outlook for 770 aircraft deliveries. Last month, <a href=\"https://www.tipranks.com/news/airbus-otceadsy-declines-after-slashing-fy24-forecast\">the company reduced its FY24 forecast</a> to 770 from its previous outlook of 800 deliveries. Airbus’ challenges reflect the broader issues in the aerospace industry such as supply chain disruptions and labor shortages.</p>\n<p>Additionally, the company expects its adjusted EBIT to be around €5.5 billion in 2024.</p>\n<h2 class=\"wp-block-heading\"><strong>Analysts Stay Bullish</strong></h2>\n<p>Following the results, analyst Chloe Lemaire from Jefferies confirmed a Buy rating on Airbus stock, predicting a 20% upside. He stated that the company kept its guidance unchanged even with the charge in the Space sector, suggesting confidence in its business. Lemaire believes that the company’s resilience in a challenging environment supports his bullish stance. </p>\n<p>Similarly, RBC Capital analyst Kenneth Herbert reiterated a Buy rating on AIR stock and expects 35% upside.</p>\n<h2 class=\"wp-block-heading\"><strong>Is Airbus Stock a Good Buy?</strong></h2>\n<p>Based on 14 recommendations, <a href=\"https://www.tipranks.com/stocks/de:air\">AIR stock</a> has received a Moderate Buy rating on TipRanks. This includes 10 Buys, three Holds, and one Sell recommendation. The <a href=\"https://www.tipranks.com/stocks/de:air/forecast\">Airbus share price target</a>&nbsp;is €159.60, which represents a potential favourable change of 20% in the share price. </p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2024/02/shutterstock_486304546-750x406.jpg",
            "link": "https://www.tipranks.com/news/global-markets/french-stocks-airbus-h1-profit-falls-space-charges-eclipse-revenue-growth",
            "author": "Kirti Tak",
            "pub_date": "2024-07-31 14:10:44",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1241134,
            "title": "Australian Stocks: Rio Tinto Gains on H1 Profit Growth",
            "description": "<p></p>\n<p>Rio Tinto holds a diverse portfolio of commodities with operations in 35 countries worldwide.</p>\n<h2 class=\"wp-block-heading\"><strong>More on Rio Tinto’s H1 Results</strong></h2>\n<p>In the first half, Rio Tinto’s underlying EBITDA (earnings before interest, tax, depreciation, and amortization) increased by 3% to $12.1 billion.</p>\n<p>Among its commodities, copper’s underlying EBITDA rose 67% to $1.8 billion, while aluminium EBITDA grew by 38% to $1.6 billion. However, due to weaker prices, iron ore EBITDA declined by 10% to $8.8 billion.</p>\n<p>During the first half, Rio Tinto witnessed a 6% jump in its average realized copper prices. The price for this metal has surged, driven by huge demand in electric vehicles and energy transition. Looking ahead, the company is set to increase its copper equivalent production by about 2% this year. Also, it aims to achieve approximately 3% compound annual growth rate (CAGR) through its existing operations between 2024 and 2028.</p>\n<p>Additionally, Rio Tinto announced an interim dividend of 1.77 per share, maintaining its 50% payout policy. This equates to a payment of $2.9 billion, similar to the previous year.</p>\n<h2 class=\"wp-block-heading\"><strong>Rio Tinto to Retain Dual Listing</strong></h2>\n<p>Furthermore, Rio Tinto’s CEO, Jakob Stausholm, clarified that the company will not abandon its dual listing in London and Sydney, as this would reduce shareholder value. In May 2024, UK-based activist hedge fund Palliser Capital urged Rio Tinto to discontinue its primary listing in London, arguing that this would address the undervaluation resulting from the dual listing.</p>\n<h2 class=\"wp-block-heading\"><strong>Are Rio Tinto Shares a Good Buy?</strong></h2>\n<p>According to TipRanks, <a href=\"https://www.tipranks.com/stocks/au:rio\">RIO stock</a> has received a Moderate Buy rating based on 11 recommendations, of which seven are Buy. The <a href=\"https://www.tipranks.com/stocks/au:rio/forecast\">RIO share price forecast</a> is AU$140.21, which is 19.8% above the current trading level.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2024/07/shutterstock_2180430397-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/global-markets/australian-stocks-rio-tinto-gains-on-h1-profit-growth",
            "author": "Kirti Tak",
            "pub_date": "2024-07-31 16:46:44",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1241440,
            "title": "French Stocks: L’Oréal Sales Growth Hit by China Weakness",
            "description": "<p></p>\n<p>Based in France, L’Oréal&nbsp;is a global cosmetic brand that offers a wide range of makeup, haircare, and skincare products.</p>\n<h2 class=\"wp-block-heading\"><strong>China Weakness Weighs on L’Oréal</strong></h2>\n<p>In the second quarter, L’Oréal recorded a 2.4% decline in like-for-like sales in North Asia, predominantly in mainland China. This decline followed a 1.1% drop in the first quarter sales. However, it was offset by the company’s favourable performance in other regions. North America saw a 3.4% increase in sales, compared to a 12.3% growth in Q1 2024. Meanwhile, sales from Europe grew 9.7% compared to 12.6% in the previous quarter.</p>\n<p>Among L’Oréal’s divisions, growth was led by its Dermatological Beauty segment, which witnessed a like-for-like sales increase of 10.8% in the second quarter. This was followed by the Consumer Products division at 6.7% growth.</p>\n<p>Additionally, the company’s operating profit rose by 8.0% year-over-year to €4.6 billion in the first half. This represented a margin of 20.8%, up by 10 basis points compared to the first half of the previous year.</p>\n<h2 class=\"wp-block-heading\"><strong>Is L’Oréal Stock a Buy?</strong></h2>\n<p>Following the first-half results, analysts gave mixed opinions on LOR stock. L’Oréal stock received two Hold, one Buy, and one Sell rating on Tuesday.</p>\n<p>Jefferies analyst Molly Wylenzek, who maintained a Sell rating, stated that regional weakness would remain a concern for the company. She also noted that, although operating margins increased, there was a notable decrease in advertising and promotion spending. This might affect future sales.</p>\n<p>Overall, <a href=\"https://www.tipranks.com/stocks/fr:or\">OR stock</a> has received a Moderate Buy rating on TipRanks, backed by 11 recommendations from analysts. The<a href=\"https://www.tipranks.com/stocks/fr:or/forecast\"> L’Oréal share price forecast</a> is €443.90, which is 11.6% above the current trading levels.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2024/07/shutterstock_2165302775-750x406.jpg",
            "link": "https://www.tipranks.com/news/global-markets/french-stocks-loreal-sales-growth-hit-by-china-weakness",
            "author": "Kirti Tak",
            "pub_date": "2024-07-31 18:25:00",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1628107,
            "title": "Intel (NASDAQ:INTC) Gears Up For CES",
            "description": "<p></p>\n<p>The word from<em> PC World</em> says that, for Intel, it will be all about Arrow Lake, which will be exhibited pretty much right alongside AMD’s Strix Halo lineup. More specifically, Intel will be showing off the new Core H line, as well as the Core HX lineup for gaming laptops, a particular thrill for PC gamers everywhere.</p>\n<p>However, Intel will have a serious fight on its hands as AMD’s lineup includes not only the Strix Halo, but also the latest versions of the Ryzen 9000X3D processors as well. And, there is even some word that Qualcomm <a data-ticker=\"QCOM\" href=\"https://www.tipranks.com/stocks/qcom\">(QCOM)</a> may have <a href=\"https://www.tipranks.com/news/qualcomms-qcom-strategic-moves-and-legal-battle-in-the-face-of-an-ai-era\">something to show</a> at the big event; there is not much advance word about this one, but it is a safe bet that it will have something to show off somewhere at CES.</p>\n<h2 class=\"wp-block-heading\"><strong>Rising Popularity at AMD</strong></h2>\n<p>What also will be little help to Intel is that chip buyers are increasingly turning their attention to AMD. A survey from Steam, detailed at <em>Tweaktown</em>, revealed that AMD is “poaching buyers from Intel.” In fact, the survey noted, AMD silicon is now found in 38.73% of Steam PCs. Considering that, back in October, AMD was only 33.77% of the field, that should give Intel serious pause.</p>\n<p>The biggest reason, the report notes, is that Intel’s <a href=\"https://www.tipranks.com/news/intel-nasdaqintc-augments-lg-laptops-faces-challenges\">constant issues with desktop processors</a> are coming back to haunt it, and in a very big way. Between the “erosion of faith” caused by faulty processors, and the very real potential of more such problems hitting later, the end result is that users simply trust Intel hardware less than they used to, and are making buying decisions accordingly.</p>\n<h2 class=\"wp-block-heading\"><strong>Is Intel a Buy, Hold or Sell?</strong></h2>\n<p>Turning to Wall Street, analysts have a Hold consensus rating on INTC stock based on one Buy, 21 Holds and five Sells assigned in the past three months, as indicated by the graphic below. After a 55.46% <a href=\"https://www.tipranks.com/stocks/intc\">loss in its share price</a> over the past year, the <a href=\"https://www.tipranks.com/stocks/intc/forecast\">average INTC price target</a> of $24.53 per share implies 19.43% upside potential.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/01/intel-shutterstock_2396877947-750x406.jpg",
            "link": "https://www.tipranks.com/news/global-markets/intel-nasdaqintc-gears-up-for-ces",
            "author": "Steve Anderson",
            "pub_date": "2025-01-04 04:03:59",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1747593,
            "title": "META Stock Draws Attention from Hedge Funds",
            "description": "<p></p>\n<p>For the latest updates on Meta’s company announcements, follow <a href=\"https://www.tipranks.com/stocks/meta/stock-news\">Meta News &amp; Insights</a> on TipRanks.</p>\n<h2 class=\"wp-block-heading\"><strong>Hedge Funds Boost Their Stake in Meta</strong></h2>\n<p>Among the 30 hedge funds that recently increased their investments in Meta, here are the five that added the most shares, ranked in descending order.</p>\n<p><strong>Altimeter Capital Management&nbsp;– </strong>Altimeter Capital, led by Brad Gerstner, recently made a notable move in Meta, <a href=\"https://www.tipranks.com/news/company-announcements/altimeter-capital-boosts-stake-in-meta-platforms\">increasing its stake by 421,815 shares</a>.</p>\n<p><strong>Egerton Capital (UK) LLP – </strong>Egerton Capital boosted its holdings by 227,047 shares in Meta. Egerton Capital (UK) LLP is a <a href=\"https://www.tipranks.com/experts/hedge-funds/john-armitage\">five-star-rated hedge fund managed by John Armitage</a>.</p>\n<p><strong>Davis Selected Advisers –</strong> Davis Selected Advisers, under the leadership of Chris Davis, recently expanded its stake in Meta by adding 222,289 shares.</p>\n<p><strong>Bridgewater Associates, LP –</strong> Bridgewater Associates also increased its position in Meta, <a href=\"https://www.tipranks.com/news/company-announcements/bridgewater-associates-increases-stake-in-meta-platforms\">adding 181,114 shares to its holdings</a>.</p>\n<p><strong>Antipodes Partners Ltd. – </strong>Antipodes Partners Ltd, led by Jacob Mitchell, increased its holdings in Meta by 148,322 shares.</p>\n<h2 class=\"wp-block-heading\"><strong>Hedge Funds Trim Positions in META Stock</strong></h2>\n<p>On the other hand, some hedge funds have reduced their stakes in META stock. Here are three hedge funds that have recently sold over 100,000 shares of META.</p>\n<p><strong>Lone Pine Capital LLC&nbsp;–</strong> <a href=\"https://www.tipranks.com/experts/hedge-funds/steve-mandel\">Five-star-rated hedge fund Lone Pine Capital</a>, led by Steve Mandel, recently made a notable move by reducing its holdings by 145,593 shares in Meta.</p>\n<p><strong>Woodline Partners – </strong>Similarly, Michael Rockefeller’s Woodline Partners LP, decreased its stake in Meta, reducing its holdings by 119,958 shares.</p>\n<p><strong>Fisher Asset Management LLC – </strong>Fisher Asset Management LLC, led by Ken Fisher, <a href=\"https://www.tipranks.com/news/company-announcements/fisher-asset-management-reduces-stake-in-meta-platforms-3\">reduced its holdings in Meta by 110,040 shares.</a></p>\n<h2 class=\"wp-block-heading\"><strong>TipRanks Provides Key Tools for Tracking Hedge Fund Activity</strong></h2>\n<p>Investors seeking strong returns may benefit from following stocks that hedge funds are actively buying. A useful resource for this is the <a href=\"https://www.tipranks.com/experts/hedge-funds\">Top Hedge Fund Managers tool</a>, which evaluates hedge fund managers and ranks them based on their success rates, average returns, and the reliability of their trades.</p>\n<p>Additionally, TipRanks provides insights into <a href=\"https://www.tipranks.com/stocks/meta/hedge-funds\">Hedge Fund Trading Activity </a>for all the stocks, highlighting their recent trades and an overall confidence signal.</p>\n<h2 class=\"wp-block-heading\"><strong>Is Meta a Good Stock to Buy Now?</strong></h2>\n<p>Meta has seen remarkable returns for investors since hitting a low in 2022, with its stock consistently reaching new highs in 2025. The recent surge came after the company <a href=\"https://www.tipranks.com/news/meta-earnings-meta-platforms-financial-results-top-wall-street-forecasts\">announced an impressive Q4 revenue and earnings report</a>. Year-to-date, META stock has gained 26%.</p>\n<p>Overall, Wall Street has a Strong Buy consensus rating on <a href=\"https://www.tipranks.com/stocks/meta\">META stock</a> based on 44 Buys, three Holds, and one Sell recommendation. The average&nbsp;<a href=\"https://www.tipranks.com/stocks/meta/forecast\">META stock price target&nbsp;</a>of $764.61 implies a 4% upside potential.</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/02/shutterstock_2303237423-750x406.jpg",
            "link": "https://www.tipranks.com/news/global-markets/meta-stock-draws-attention-from-hedge-funds",
            "author": "Kirti Tak",
            "pub_date": "2025-02-17 19:25:43",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        }
    ]
}