{
    "data": [
        {
            "id": 2989061,
            "title": "A Unique Company Offering an ‘Attractive Entry Point,’ Says Rosenblatt About Palantir Stock",
            "description": "<html><head></head><body><p>“N of 1” is a term <strong>Palantir (<a href=\"https://www.tipranks.com/stocks/pltr/forecast\">NASDAQ:PLTR</a>)</strong> CEO Alex Karp uses to describe the company as a unique player in the <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> software market with no direct competitors.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>It’s a bold, almost arrogant way of saying they see themselves as totally unmatched, a way of signaling that, in Karp’s view, no other company delivers comparable value.</p>\n<p>Is it justified? Rosenblatt analyst John McPeake seems to think so. “Yes, Palantir Really Is an ‘N of 1’… With a “rule of 40” (4Q revenue growth of 70% plus adjusted operating margin of 57%) of 127% and 720bp of rev growth acceleration in 4Q, Palantir is indeed the ‘N of 1’ that CEO Alex Karp claims,” the analyst said. &nbsp;</p>\n<p>Palantir blends its proprietary infrastructure software with “best-in-class technology practitioners” to deliver fast, high-value solutions for enterprises and governments worldwide. McPeake says he has seen the company grow from a loss-making, services-focused startup in the early 2000s into a software leader with repeatable solutions, now generating 84% gross margins and 51% operating margins. “In enterprise software, we think Palantir will add more free cash flow dollars in 2026 than any software company except for SAP,” McPeake further added. “We think Palantir is currently the only stack-agnostic company in technology that can provide an integrated enterprise platform for the rapid deployment of AI.”</p>\n<p>Palantir’s momentum has been driven by close partnerships with governments and defense agencies, along with fast, high-value deployments at major global enterprises, including the U.S. DoD, the CIA, BP, Merck, and General Mills. McPeake’s conversations with several customers suggest there is still significant expansion potential within their existing base. The company’s “biggest moat” lies in the synergy between its “polymathic engineering team” and its extensive, mission-critical, battle-tested infrastructure and integration software. With strong demand from both traditional IT modernization and emerging enterprise AI projects, McPeake sees Palantir as well-positioned to achieve double-digit top- and bottom-line growth over the next decade.</p>\n<p>Famously, Palantir’s valuation is often mentioned as a turn-off for some. Indeed, a review of the biggest wealth-generating technology companies since 1981 shows that, even with its trailing twelve-month price-to-sales ratio dropping from a peak of 153x to 75x, Palantir remains an outlier.</p>\n<p>But McPeake thinks the valuation is justified. “If one looks at the companies that have created the most value in technology when they were a similar size to Palantir, none of them was able to grow as fast as Palantir is forecasted to grow in year 8 (equivalent to Palantir’s guidance in 2026),” the analyst explained. Moreover, at least two of those companies – Facebook and Google – relied on major transformative acquisitions midway through that period, while Palantir’s growth has been entirely organic.</p>\n<p>Given the stock has declined by 34.4% from last year’s highs, McPeake thinks the shares now offer an “attractive entry point.” As such, McPeake initiated coverage of PLTR stock with a Buy rating, backed by a $150 price target. Should the figure be met, investors will be pocketing returns of 10% a year from now. (To watch McPeake’s track record, <a href=\"https://www.tipranks.com/experts/analysts/john-mcpeake\">click here</a>)</p>\n<p>The Street’s average target is actually a more exuberant $188.82, a figure that points toward 12-month gains of 39%. On the rating front, based on a mix of 14 Buys, 4 Holds and 2 Sells, the stock claims a Moderate Buy consensus rating. (<a href=\"https://www.tipranks.com/stocks/pltr/forecast\">See Palantir stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/pltr-new-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/a-unique-company-offering-an-attractive-entry-point-says-rosenblatt-about-palantir-stock",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-27 22:23:42",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2988252,
            "title": "Keep On Buying Broadcom Shares, Says Oppenheimer Ahead of F1Q Results",
            "description": "<html><head></head><body><p><strong>Broadcom (<a href=\"https://www.tipranks.com/stocks/avgo/forecast\">NASDAQ:AVGO</a>)</strong> will finally step up to the earnings plate next week, with the chip giant slated to release its fiscal first quarter (January) results on Wednesday (March 4).</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>As was evident in the market’s downbeat reaction to Nvidia’s outstanding report, leading chipmakers are out of favor right now, even when putting on estimate-trouncing performances.</p>\n<p>It remains to be seen whether Broadcom will buck the trend, but in any case, Oppenheimer’s Rick Schafer, an analyst ranked among the top 1% on Wall Street, expects the company to beat Street expectations.</p>\n<p>Schafer sees the results exceeding the Street’s F1Q revenue and EPS estimates of $19.2 billion and $2.02, as well as the F2Q (April) forecasts of $20.4 billion and $2.15, driven primarily by <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a>-related demand.</p>\n<p>Schafer sees the <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/chips-stocks\">Semiconductor</a> segment, which represents 61% of sales, increasing 12% quarter-over-quarter and 51% year-over-year. AI-related revenue is expected to rise 27% sequentially and 103% YoY. &nbsp;Non-AI semiconductors, which account for 42% of the Semiconductor segment, are projected to decline 11% QoQ and remain flat YoY. Wireless trends are seasonally softer, while Apple has shifted to its in-house N1 wireless chip across all iPhone 17 SKUs. For the upcoming iPhone 18 cycle, Schafer believes Broadcom will take over the UHB PAD component previously supplied by Qorvo, representing a share gain for the company. Additionally, a potential foldable iPhone with Touch ID could increase Broadcom’s chip content per device.</p>\n<p>Software, which accounts for 39% of the mix, is expected to drop 2% QoQ and increase 1% YoY, with growth of approximately 13% anticipated in FY26. Schafer believes infrastructure and security software are less exposed to AI-driven disruption compared with application software peers. VMware (infrastructure), Symantec (security), and CA Technologies (infrastructure) provide mission-critical core software that is deeply embedded within enterprise IT environments, resulting in high switching costs for customers.</p>\n<p>Schafer sees potential upside to his $50 billion AI revenue estimate for FY26 as additional purchase orders come through. The ASIC customer base includes Alphabet, Meta Platforms, TikTok U.S., Anthropic, and a fifth unnamed customer generating more than $1 billion. Key customer Alphabet could deploy 3.5 million TPU units this year, with the potential to double that volume in CY27, while TPU deployments are also broadening to support large language models beyond Google’s internal workloads. Anthropic, already a $10 billion TPU customer, has committed an additional $11 billion for the second half of 2026.</p>\n<p>“AVGO boasts the No. 2 AI franchise (after NVDA), leading the market in AI ASIC with seven projects announced,” the 5-star analyst summed up. “Sustainable growth and cash return supported by core AI ASIC/networking, wireless, broadband, server/storage, and software franchises. We remain long-term buyers.”</p>\n<p>Schafer’s Outperform (i.e., Buy) is backed by a $450 price target, implying the stock will gain 40% over the coming months. (To watch Schafer’s track record, <a href=\"https://www.tipranks.com/experts/analysts/rick-schafer\">click here</a>)</p>\n<p>The Street’s average target is almost the same as Schafer’s; at $452.32, the figure makes room for 12-month returns of 41%. All told, based on a mix of 28 Buys and 2 Holds, the analyst consensus rates the stock a Strong Buy. (<a href=\"https://www.tipranks.com/stocks/avgo/forecast\">See AVGO stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2679891509-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/keep-on-buying-broadcom-shares-says-oppenheimer-ahead-of-f1q-results",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-27 22:00:00",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2988119,
            "title": "2 ‘Perfect 10’ Stocks the Street Thinks You Shouldn’t Ignore",
            "description": "<html><head></head><body><p>Sometimes, it seems that the markets don’t know what to do. We’re seeing gains one day, losses the next, and then more gains. The Q4 earnings have been solid, which is always good to see, and while GDP has slowed, it remains positive. We’re still waiting to see how the ripples will spread from the Supreme Court’s decision on President <a data-autolink=\"true\" href=\"https://www.tipranks.com/stocks/djt\">Trump</a>’s tariff policies.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>In all, it’s a macro picture that gives support to both the bulls and the bears – and at times like this, what investors really need is a clear sign, a signal that this stock is the one to buy, and that stock is the one to avoid. Fortunately, there are plenty of such signals to choose from.</p>\n<p>One of the best comes from the <a href=\"https://www.tipranks.com/screener/top-smart-score-stocks\">Smart Score</a>, an <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a>-powered data tool from TipRanks. The <a data-autolink=\"true\" href=\"https://www.tipranks.com/screener/top-smart-score-stocks\">Smart Score</a> gathers and collates the volumes of raw information put out by the markets every day – and puts that information to work. It uses that data to rate every stock in the public markets – and give each one a score, based on a set of factors that is known to correlate with future outperformance. The score is set on a simple, intuitive scale of 1 to 10 – with the ‘Perfect 10’ indicating stocks that the data says are solid.</p>\n<p>It’s a good signal. And when Wall Street’s analysts are in-line with it, putting their own ‘Buy’ recommendations on Perfect 10 stocks, that is a dual signal that should definitely be more compelling to discerning investors.</p>\n<p>So let’s do just this. We’ve used the TipRanks database to pull up the details on two ‘Perfect 10’ stocks that are also getting high ratings from the analysts. Here they are.</p>\n<p><strong>Accenture</strong> (<a href=\"https://www.tipranks.com/stocks/acn/forecast\"><strong>ACN</strong></a>)</p>\n<p>The first ‘Perfect 10’ on today’s list is Accenture, an IT services and consulting company with a global footprint and a strong bent toward AI and data sciences. Accenture offers business and enterprise clients the services they need to reinvent the ways they remain relevant to customers. From cloud and cybersecurity to AI and data, to marketing, learning, and finance – Accenture can build all of these, and more.</p>\n<p>To do this, Accenture brings together the combined expertise of a large, worldwide workforce, over 780,000 strong, and matches it with proprietary tech platforms and assets, and deep knowledge of the full ecosystem in today’s corporate world and its combination of digital tech and business.</p>\n<p>Accenture, with its $121 billion market cap and global reach, has the resources to become the ‘reinvention partner of choice’ for some of today’s biggest business players. The company’s partners include such major names as SAP, Microsoft, AWS, Oracle, and Salesforce.</p>\n<p>The company has found great success in this approach, and that can be seen from its fiscal 2025 results. In that fiscal year, the last with full data on record, Accenture devoted $3.3 billion to ventures &amp; acquisitions, research &amp; development, and learning &amp; development; in all, it was a large investment in the company’s own future. In addition, Accenture brought in $69.7 billion in annual revenue and returned $8.3 billion in cash to shareholders, mainly through its common-stock dividend.</p>\n<p>In December, Accenture reported its results for fiscal 1Q26. The company generated $18.7 billion in revenue, for a 6% year-over-year increase, and beat the forecast by over $210 million. At the bottom line, the company’s non-GAAP EPS of $3.94 was up 10% year-over-year and was 22 cents per share better than expected.</p>\n<p>Morgan Stanley’s James Faucette, in covering this stock, notes that most of any headwinds are already accounted for – and that Accenture has a sound path forward. He writes, “We think 1) market fears around potential Gen AI disruption and 2) DOGE impact are now largely baked into ACN’s current valuation at 19x FY27 EPS; further, we think M&amp;A and ecosystem partnerships are growth levers. We believe estimates have likely bottomed and that future revisions are skewed to the upside, driven by lower <a data-autolink=\"true\" href=\"https://www.tipranks.com/economic-indicators\">interest rates</a> and more industry clarity on AI investment path. Our growth estimates (FY26: +5%; FY27: +7% ) sit well above consensus growth figures… With a 4.5:1 Bull-Bear skew, we find ACN compelling at current valuation levels (~13% discount to S&amp;P 500).”</p>\n<p>Faucette’s Overweight (Buy) rating comes with a $320 price target that points to a one-year gain for the stock of 54%. (To watch Faucette’s track record, <a href=\"https://www.tipranks.com/experts/analysts/james-faucette\">click here</a>.)</p>\n<p>Overall, these shares get a Moderate Buy rating from the Street’s analyst consensus, based on 17 reviews that include 12 Buys and 5 Holds. The stock is selling for $207.38 right now, and its $293.60 average target price implies a 41.5% upside by this time next year. (See <a href=\"https://www.tipranks.com/stocks/acn/forecast\"><strong>ACN stock forecast</strong></a>.)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/TipRanks-0804-750x406-1.jpg",
            "link": "https://www.tipranks.com/news/article/2-perfect-10-stocks-the-street-thinks-you-shouldnt-ignore",
            "author": "Michael Marcus",
            "pub_date": "2026-02-27 19:15:18",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2980961,
            "title": "‘Heading Much Lower’: Investor Sees More Downside Ahead for XRP",
            "description": "<html><head></head><body><p>People often bemoan the fact cryptocurrencies offer little real-world use. But that is not a problem <strong>XRP (<a href=\"https://www.tipranks.com/cryptocurrency/xrp-usd\">XRP-USD</a>)</strong> faces. The token was created to function as a bridge currency within the Ripple Payments network, enabling banks to process cross-border transfers instantly and at relatively low cost.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Last year, XRP reached a fresh all-time high, climbing to $3.65 per token in July. Since then, though, it has dropped 60.5% as part of the wider downturn across the <a data-autolink=\"true\" href=\"https://www.tipranks.com/cryptocurrency\">crypto</a> market.</p>\n<p>The question now is whether its role in facilitating cross-border payments sets the scene for a comeback.</p>\n<p>Investor Anthony Di Pizio is skeptical that will be the case. “Although XRP’s use-case should, in theory, drive long-term upside, it’s facing some structural issues that might be difficult to overcome,” said the investor. “If history is any guide, these headwinds might fuel even more&nbsp;<em>downside</em>&nbsp;instead.”</p>\n<p>Cross-border bank transfers are often slow and expensive, largely because institutions rely on different systems, including the SWIFT (Society for Worldwide Interbank Financial Telecommunication), which can require intermediaries to complete a transaction. Ripple Payments was designed to address that inefficiency by enabling banks to communicate and settle directly, making transfers near-instant and low cost. XRP was introduced as a bridge currency within the network, allowing, for example, a U.S. bank to send XRP instead of dollars to avoid foreign exchange friction. Transaction costs are negligible, typically just 0.00001 tokens, or a fraction of $0.01.</p>\n<p>However, XRP’s role is not essential. Ripple Payments also supports fiat transfers, meaning network growth does not automatically translate into higher demand for XRP. “That’s a key reason why it tends to decline sharply during selloffs in the broader crypto markets – its performance is still very much determined by speculative investors,” Di Pizio explained.</p>\n<p>Banks also tend not to hold bridge currencies, immediately converting them into local currency, and XRP’s volatility adds balance sheet risk. That dynamic became more pronounced after Ripple introduced its stablecoin, Ripple USD, in late 2024. With minimal price fluctuation, Ripple USD offers a more stable alternative for institutions, potentially reducing the need for XRP in cross-border transactions.</p>\n<p>Prior to last year’s high, XRP’s previous peak came in 2018, after which the token lost more than 90% of its value within months and then spent most of the following five years below $1. Di Pizio thinks a “similar outcome is in progress right now.”</p>\n<p>Because Ripple Payments does not generate steady, structural demand for XRP, its price remains heavily influenced by speculative trading. Unless the token develops a compelling new use case that drives consistent adoption, it is likely to remain vulnerable to sharp selloffs during periods of broader crypto market uncertainty, limiting its prospects for “long-term value creation.”</p>\n<p>With that in mind, Di Pizio’s forecast is a downbeat one. “If we simply follow history, I think XRP will be trading at somewhere between $0.30 and $0.50 five years from now,” the investor summed up. “That assumes its 2025 high remains the peak for the foreseeable future, and that the decline reaches a similar magnitude to the 2018 decline with no meaningful recovery thereafter.” (To watch Di Pizio’s track record, <a href=\"https://www.tipranks.com/experts/bloggers/anthony-di-pizio\">click here</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2676291157-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/heading-much-lower-investor-sees-more-downside-ahead-for-xrp",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-27 06:00:00",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2980946,
            "title": "CoreWeave Stock Earnings Are Coming – Here’s What This Top Analyst Expects",
            "description": "<html><head></head><body><p><strong>CoreWeave (<a href=\"https://www.tipranks.com/stocks/crwv/forecast\">NASDAQ:CRWV</a>)</strong> is set to announce its 4Q25 results today after the close, the readout coming at a rocky moment for <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a>-related stocks. Even so, CoreWeave seems to be positioned on the right side of the trade as investor appetite continues to lean toward companies that own and operate AI-focused data centers, and that is where CoreWeave’s value proposition lies. To wit, year-to-date, the shares have climbed 37%.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>It’s all about triple-digit revenue growth at the rapidly expanding AI cloud infrastructure specialist, and that metric will be a focus for Wall Street. Revenue is anticipated to increase by 101% to $1.5 billion.</p>\n<p>However, Evercore’s Amit Daryanani, an analyst ranked among the top 2% on Wall Street, believes the company can beat that figure given what he views as a “de-risked setup.” Recall that in the prior quarter management reduced its CY25 revenue guide to account for temporary delays in delivering powered-shell data center capacity in Q4.</p>\n<p>He also sees potential to outperform the Street’s $138 million EBIT forecast, though EPS may be harder to model accurately as CRWV continues investing to scale operations.</p>\n<p>For the December quarter, Daryanani thinks investor attention will center on the schedule for powered-shell data center deliveries, progress in locking in incremental long-term capacity and the funding environment – with the broadened NVIDIA partnership viewed as a supportive factor – as well as the read-through for CY26 revenue.</p>\n<p>Recent reporting referencing internal memos about a “chip delivery milestone” at a facility in Denton, Texas, indicated that more than 16,000 GPUs were operational by late December and that total data center capacity could approach roughly 850 MW by year-end. Against that backdrop, the analyst thinks the Q1 Street revenue forecast of about $2.3 billion appears attainable. Daryanani sees the Q4 backlog landing in the mid-to-high $50 billion range, largely unchanged from Q3, as the company prioritizes securing additional data center capacity, with revenue primarily constrained by supply rather than demand.</p>\n<p>Additional topics investors will be monitoring include the transition from Blackwell to Rubin and how the ramp timing could affect revenue; availability of powered-shell data center capacity, including updates on self-built facilities; and the strategy to generate revenue from software offerings such as SUNK and Mission Control by selling them to other cloud providers. Overall, while strong demand and the debate over GPU useful life – with several data points suggesting GPUs can remain productive for more than 10 years – are well understood, the 5-star analyst thinks attention has increasingly shifted toward CRWV’s ability to secure the capacity required to sustain future expansion.</p>\n<p>All told, Daryanani maintained an Outperform (i.e., Buy) rating on the shares, backed by a $160 price target that points toward 12-month returns of 65%. (To watch Daryanani’s track record, <a href=\"https://www.tipranks.com/experts/analysts/amit-daryanani\">click here</a>)</p>\n<p>The rest of the Street’s ratings splits into an even 8 Buys and Holds, each, all culminating in a Moderate Buy consensus rating. At $118.57, the average target implies shares will gain 22% over the one-year timeframe. (<a href=\"https://www.tipranks.com/stocks/crwv/forecast\">See CRWV stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/coreweave-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/coreweave-stock-earnings-are-coming-heres-what-this-top-analyst-expects",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-27 01:39:03",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2982579,
            "title": "AI Companions Could Make Apple Stock an AI Winner, Says J.P. Morgan",
            "description": "<html><head></head><body><p>We’ve got Generative <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a>, Agentic AI, Embodied AI, Multimodal AI, to name but a few AI combos. You can also add AI Companions to the list, and the one company that stands to benefit from these is the one tech giant yet to fully get its AI game in order. That would be <strong>Apple (<a href=\"https://www.tipranks.com/stocks/aapl/forecast\">NASDAQ:AAPL</a>)</strong>, of course, often accused of being an AI laggard with no well-defined AI strategy.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>However, J.P. Morgan’s Samik Chatterjee, an analyst ranked among the top 1% on Wall Street, thinks the company is well-positioned to make the most of this opportunity.</p>\n<p>Consumer technology is in the early stages of a “structural shift” toward AI-native personal companion devices. According to several press reports, Apple is developing several AI companion form factors, including smart glasses, wearable AI pins, and smart home assistants. “We view a potential foray into AI Companions to be important for Apple on both defensive and offensive fronts, to firstly defend its wide moat in Personal Computing devices, and secondly to position itself better in the new category of Personal devices – AI Companions,” the 5-star analyst said.</p>\n<p>Chatterjee thinks Apple’s long-standing strengths, including its tightly integrated product ecosystem and “uncompromised focus” on privacy, are likely to remain key draws for consumers adopting personal AI Companions. The company is well placed to build on and expand what these companions can do, tapping into the power of its other devices – not just the wearables – to handle heavier AI processing, while also enabling seamless access to a broad range of services that are already in use. Over time, those services should incorporate additional AI features and connect smoothly with the new Companion devices.</p>\n<p>Chatterjee believes that the launch of a personalized Siri, capable of maintaining “conversational context” on Apple’s AI Companions, will be a key factor in their potential success. This includes how well the system integrates with apps and leverages multimodal inputs across voice, text, and images. Moreover, embedding AI functionality with context drawn from the user’s existing devices and native apps – such as email, notes, messages, contacts, and Safari – could be a major differentiator, giving Apple’s companions an edge over standalone devices from third-party providers. “We believe that launch of personalized Siri is highly likely in 2026, particularly given recent partnership with Google to leverage the foundational Gemini models, and while AI Companion devices are likely to be highlighted in 2026, we expect a more material volume ramp starting in 2027,” Chatterjee further expounded.</p>\n<p>Looking at volume and revenue, Chatterjee forecasts Apple’s AI Companions reaching 50 million units across the full range of devices by the end of the decade, generating roughly $25 billion in hardware revenue alone. Expanding adoption beyond Apple’s current installed base could also open up opportunities for standalone services monetization. To put this in perspective, $25 billion is more than two-thirds of the present revenue from the Wearables business. When combining potential hardware and services profits, Chatterjee estimates these AI companions could contribute around 5% to Apple’s EPS by FY30.</p>\n<p>All told, Chatterjee reiterated an Overweight (i.e., Buy) rating on the shares, backed by a $325 price target. Should the figure be met, investors will be pocketing returns of 20% a year from now. (To watch Chatterjee’s track record, <a href=\"https://www.tipranks.com/experts/analysts/samik-chatterjee\">click here</a>)</p>\n<p>16 other analysts join Chatterjee in the bull camp while an additional 9 Holds and 1 Sell add up to a Moderate Buy consensus rating. The forecast calls for 12-month gains of 13%, considering the average target clocks in at $307.55. (<a href=\"https://www.tipranks.com/stocks/aapl/forecast\">See Apple stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/aaa-76-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/ai-companions-could-make-apple-stock-an-ai-winner-says-j-p-morgan",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-27 00:53:37",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2982200,
            "title": "Nvidia Stock Is Down but This Top Analyst Keeps Street-High Price Target Following Blowout Earnings",
            "description": "<html><head></head><body><p>In what appeared to be almost a given, <strong>Nvidia (<a href=\"https://www.tipranks.com/stocks/nvda/forecast\">NASDAQ:NVDA</a>)</strong> delivered the goods in its fiscal fourth quarter report, handily beating Street estimates and guiding above expectations.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>But that just won’t do these days. In a bizarre kind of way, that kind of outstanding performance has become par for the course for the chip giant, and investors’ reaction to the print has been a negative one, with shares down 5% in Thursday’s trading as of writing. Right now, the market seems reluctant to reward anything <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a>-related, no matter the strength on display.</p>\n<p>The Street’s biggest NVDA bull, however, has no such issues. “We view the risk/reward positive post a beat/raise quarter,” said Evercore’s Mark Lipacis, an analyst ranked among the top 1% on Wall Street.</p>\n<p>Lipacis thinks the stock will outperform eventually as investors gain clarity on two key concerns. The first is whether CapEx growth can continue beyond 2027. In short, Lipacis thinks it can. While many liken today’s AI spending to the Internet bubble of 2000, Lipacis points out two crucial distinctions: first, the Internet was a medium “looking for an app,” whereas AI is the application in search of compute cycles; second, internet infrastructure spending happened before returns were realized, while AI investment is being funded by actual returns. For instance, AI spending has driven a 35%-90% rise in revenue per employee over the past three years at hyperscalers, reducing costs in both software and headcount. The analyst believes AI-driven savings on $60 trillion in global OpEx are already financing current AI investments. In other words, AI CapEx isn’t entirely new spending – it’s largely a reallocation, shifting money from enterprise OpEx to the CapEx of hyperscalers, neoclouds, model developers, and enterprises. With current hyperscale CapEx at $1 trillion, less than 2% of global OpEx, Lipacis thinks there is “more to go.”</p>\n<p>The second concern is whether demand for AI tokens can sustain its “parabolic growth.” Here, too, Lipacis believes it can. Agentic AI represents a “change in the paradigm” for compute demand. In prior computing eras, such as PCs or smartphones, demand was constrained by the number of people – 8 billion people can only purchase so many devices. With Agentic AI, multiple autonomous agents can operate simultaneously on behalf of individuals or businesses, interacting with other agents in parallel. This creates virtually unlimited demand for AI tokens. “Agentic AI has only just started, we expect parabolic growth demand for tokens will continue,” the 5-star analyst summed up.</p>\n<p>Bottom line, Lipacis maintained an Outperform (i.e., Buy) rating on the shares, alongside his Street-high price target of $352, implying the stock will gain 90% in the year ahead. (To watch Lipacis’ track record, <a href=\"https://www.tipranks.com/experts/analysts/mark-lipacis\">click here</a>)</p>\n<p>Turning to the general Street view, NVDA stock’s Strong Buy consensus rating is based on 36 Buys vs. 1 Hold and Sell, each. At $272.65, the average target offers 12-month upside of 47%. (<a href=\"https://www.tipranks.com/stocks/nvda/forecast\">See Nvidia stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2629179007-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/nvidia-stock-is-down-but-this-top-analyst-keeps-street-high-price-target-following-blowout-earnings",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-26 23:33:48",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2980082,
            "title": "These 2 Beaten-Down Stocks Could Stage a Comeback, Says Oppenheimer",
            "description": "<html><head></head><body><p>So much is going on, it’s hard to know where to start. There are always doomsayers, but recent economic data can’t be pleasing them. Q4 earnings are better than predicted, and with some 85% of the S&amp;P-listed companies having reported, we can see that revenues are up almost 9% and earnings are up more than 12%.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Quarterly GDP growth has slowed, but remains sound at 1.4%. Analysts expect a bump when the Q1 numbers come in and the effects of the understated Federal Government shutdown finish rippling through.</p>\n<p>The big news, however, was the Supreme Court decision striking down most of President <a data-autolink=\"true\" href=\"https://www.tipranks.com/stocks/djt\">Trump</a>’s tariff regime. That was the wildcard, and we still don’t know how it will affect the game. The President has already indicated that he’ll simply levy a global blanket <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/stocks-hurt-by-trump-tariffs\">tariff</a> of at least 10%. In the meantime, businesses and importers who have already paid some $170 billion in aggregate tariffs to the US Treasury will be looking to pull some of that back.</p>\n<p>Watching this situation from Oppenheimer, chief investment strategist John Stoltzfus sees reason for optimism – and a place to look for sound stock picks. He writes, “Many market participants are increasingly recognizing that indeed uncertainty remains at the core of the day-to-day life of the markets as it does in the lives of its participants. Periods of price volatility offer opportunity ‘to catch babies thrown out with the bath water’&nbsp;in periods of market downdrafts and present opportunities to respond rather than opt for knee jerk reactions.”</p>\n<p>The stock analysts at Oppenheimer are running with this thesis – they’ve picked out beaten-down stocks that appear ready to bounce back in a resilient market environment, and their notes make interesting reading. Let’s take a look at two of their choices, and with some help from the <a href=\"https://www.tipranks.com/dashboard\">TipRanks database</a>, we can see whether the general Street consensus aligns with the Oppenheimer analysts’ view. &nbsp;</p>\n<p><strong>Freshworks</strong> (<a href=\"https://www.tipranks.com/stocks/frsh/forecast\"><strong>FRSH</strong></a>)</p>\n<p>The first stock on our list of Oppenheimer picks is a software-as-a-service company, Freshworks. Founded in 2010 in India, Freshworks builds and delivers software systems designed to ‘uncomplicate’ enterprise users’ IT and customer service systems. IT and customer service are two of the vital digital functions in any modern enterprise, and Freshworks uses <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> and intuitive management to simplify them both.</p>\n<p>That approach has earned the company a solid audience. Freshworks boasts that it has over 74,000 customers in more than 120 countries; that last year, it saved its customers over 1.3 million work-hours in support workflows; and that its AI agents and copilots deliver measurable and significant improvements in productivity times and resolutions.</p>\n<p>Freshworks can claim some major names on its customer list, including S&amp;P Global, Klarna, Forbes, and Bridgestone. The company can also boast solid earnings and a trend of rising revenues. Nevertheless, the stock is down 40.5% year-to-date.</p>\n<p>Much of that loss tracks back to the general threats facing the enterprise software sector. Competition is fierce in the industry, and the emergence of AI, especially agentic and generative AI models, is both a promise and a threat. The promise is that these technologies will open new vistas of opportunity for increased profits; the threat is that current customers will start to adopt the new AI models in-house and reduce the demand for SaaS operators’ products.</p>\n<p>For now, though, the company is reporting solid results. In 4Q25, the last period reported, Freshworks’ revenue came to $222.7 million, up more than 14% year-over-year and beating the forecast by a $4 million margin. The company’s bottom line of $0.14 per share in non-GAAP measures was 3 cents per share better than expected.</p>\n<p>Those strong results form the starting point for Oppenheimer’s Brian Schwartz, who writes of the software firm, “Freshworks delivered a good quarter in 4Q25. The quarter strength was driven by momentum across the EX business and AI products. 4Q25 results also show a record gross margin, and the top-line outperformance flowed through to higher profits. Negatively, 4Q and 2026 guidance show down operating margins as management invests for future growth. Also, 104% constant-currency NRR in 4Q and 105% 1Q guide indicates a meaningful recovery in expansions activity is further out, and may feed an AI bear narrative on Freshworks’ seat-based model. Bottom Line: Freshworks is showing good consistency in revenue growth and profit margins, and generating a lot of cash. In our view, the latter supports management instituting greater capital returns to shareholders given low multiples and strong balance sheet.”</p>\n<p>The analyst goes on to rate FRSH stock as Outperform (Buy), with a $15 price target that indicates room for 106% upside potential in the next 12 months. (To watch Schwartz’s track record, <a href=\"https://www.tipranks.com/experts/analysts/brian-schwartz\">click here</a>.)</p>\n<p>Right now, Freshworks has 12 recent analyst reviews on file, and the 6-6 split between Buy and Hold gives the stock its Moderate Buy consensus rating. The shares are priced at $7.28, and their $12.89 average price target implies a 77% gain by this time next year. (See <a href=\"https://www.tipranks.com/stocks/frsh/forecast\"><strong>FRSH stock forecast</strong></a>.)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2622678831-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/these-2-beaten-down-stocks-could-stage-a-comeback-says-oppenheimer",
            "author": "Michael Marcus",
            "pub_date": "2026-02-26 19:27:23",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2973802,
            "title": "Last Minute Thought: Top Analyst Chimes in on Nvidia Stock as Earnings Loom",
            "description": "<html><head></head><body><p>Once the market action comes to a halt today, all eyes will be on <strong>Nvidia (<a href=\"https://www.tipranks.com/stocks/nvda/forecast\">NASDAQ:NVDA</a>)</strong>. The chip powerhouse is set to release its fiscal fourth-quarter results amid a cautious mood around <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a>, and as the world’s most valuable company, its report is seen as a key gauge for the AI hardware sector.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>In the last three months, discussions have intensified over whether ASICs could serve as a more cost-efficient alternative to GPUs, spurred by Google’s use of its in-house ASIC (TPU) to train the Gemini 3 large language model.</p>\n<p>Yet, HSBC analyst Frank Lee does not believe this has had a game-changing impact on Nvidia. “We believe that the demand for GPUs remains intact and expect GPUs to account for the bulk of hyperscalers’ capex,” he said on the matter.</p>\n<p>During the same period, hyperscalers’ 2026 capex estimates were raised by about $159 billion to $679 billion. Lee believes this additional spending is driven by sharply higher memory prices and does not indicate that hyperscalers are redirecting their capital spending from GPUs to ASICs. Meanwhile, Street revenue forecasts for major memory companies have also been increased by roughly $157 billion over the same period. As there has been no adjustment in CoWoS capacity allocation, Lee’s GPU revenue projections remain unchanged for now.</p>\n<p>As for the results, Lee anticipates Nvidia will report Q4 revenue of $68.0 billion, which is 5% higher than the guide and 3% above Visible Alpha (VA) consensus estimates of $65 billion and $66 billion, respectively. With the GB300 continuing to ramp up into FY27e, Lee forecasts 1QFY27 revenue of $74.0 billion, 3% above VA consensus of $71.8 billion. He sees revenue surpassing expectations despite ongoing uncertainty around China exports, with Lee’s estimates excluding any revenue from China.</p>\n<p>Additionally, Lee thinks server CPU could potentially be a “new narrative.” Amid the recent surge in server CPU demand fueled by the growth of agentic AI, Nvidia unveiled a groundbreaking agreement with Meta for a large-scale rollout of its Grace CPUs, with Vera CPUs expected to follow in the future. “It remains too early to quantify the opportunity but this could potentially drive a re-examination of datacenter revenue estimates,” said the analyst.</p>\n<p>With the March GTC event approaching, Lee anticipates attention will return to Nvidia’s AI GPU roadmap, including the ramp of GB300 and the next-generation Rubin, which is on track to scale in 2H26. The analyst also remains optimistic about the AI GPU total addressable market expanding beyond traditional hyperscalers. His FY27e and FY28e datacenter revenue forecasts of $351 billion and $434 billion remain 12% and 8% above Street estimates, respectively.</p>\n<p>Bottom line, Lee maintained a Buy rating on the shares, although he lowered his price target from $320 to $310, reflecting a revision of the target PE from 30x to 29x (this adjustment is based on the company’s five-year historical average PE, which has now fallen to 29x). Lee’s new target factors in 12-month returns of 57%. (To watch Lee’s track record, <a href=\"https://www.tipranks.com/experts/analysts/frank-lee-cfa\">click here</a>)</p>\n<p>Barring one NVDA bear, all of Lee’s colleagues are also bulls, with the additional 32 Buys all naturally coalescing to a Strong Buy consensus rating. Going by the $268.57 average target, a year from now, shares will be changing hands for a 36% premium. (<a href=\"https://www.tipranks.com/stocks/nvda/forecast\">See Nvidia stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/NVDA-0220-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/last-minute-thought-top-analyst-chimes-in-on-nvidia-stock-as-earnings-loom",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-26 04:30:00",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2974568,
            "title": "Is the AMD Deal Good or Bad for Meta Stock? BofA Has Its Say",
            "description": "<html><head></head><body><p><strong>Meta Platforms (<a href=\"https://www.tipranks.com/stocks/meta/forecast\">NASDAQ:META</a>)</strong> has signaled it doesn’t intend to hold back on <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> infrastructure spend, with its multi-year agreement with AMD aimed at increasing data center compute capacity.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>The deal includes up to 6 GW of AMD Instinct GPU capacity, with initial rollouts anticipated in 2H26. Total potential spending from Meta is expected to reach tens of billions. </p>\n<p>Under the terms of the deal, AMD granted Meta a performance-based warrant covering as many as 160 million shares of its common stock. The warrant vests in stages linked to Instinct GPU shipment targets, beginning with the first 1 GW delivered and continuing in additional tranches as Meta expands purchases toward the full 6 GW. Vesting also depends on AMD meeting certain stock price thresholds, and Meta’s ability to exercise the warrant is subject to the achievement of specified technical and commercial milestones.</p>\n<p>AMD shares jumped in response to the news, but what does the deal do for Meta? BofA’s Justin Post, an analyst ranked among the top 2% on Wall Street, looks at both the positives and negatives here.</p>\n<p>On the plus side, there is “supplier diversification,” as a multi-vendor approach should strengthen “pricing leverage” and contribute to lower long-term compute costs. Second, the warrant structure offers potential financial upside: if AMD delivers operationally and its share price exceeds the required vesting levels, Meta could “realize meaningful equity value,” effectively offsetting a portion of its infrastructure spending. Lastly, securing infrastructure supply at scale positions Meta with the flexibility to extend beyond its core advertising business over time into AI subscriptions, enterprise solutions, or broader developer ecosystems.</p>\n<p>On the other hand, there are risks involved. The deal could keep capital spending elevated for an extended period, possibly through 2026–2029, limiting the company’s ability to adjust investments in the short to medium term. Rapid advances in AI chip technology also create a risk that newer architectures could outperform the GPUs Meta has committed to, meaning the capacity could become “economically suboptimal.”</p>\n<p>Additionally, higher fixed costs, combined with revenues still largely tied to the cyclical advertising market, could put pressure on margins if economic conditions weaken. While there is also a chance the partnership could influence supply from Nvidia, the 5-star analyst thinks this risk is likely small, given that most major hyperscalers are moving toward sourcing from multiple suppliers.</p>\n<p>All told, Post still rates META stock a Buy, while his $885 price objective implies shares will gain 37% over the one-year timeframe. (To watch Post’s track record, <a href=\"https://www.tipranks.com/experts/analysts/justin-post\">click here</a>)</p>\n<p>This stock gets plenty of support elsewhere on the Street; based on a mix of 39 Buys and 4 Holds, the analyst consensus rates the shares a Strong Buy. At $864.62, the average target factors in 12-month returns of 33%. (<a href=\"https://www.tipranks.com/stocks/meta/forecast\">See Meta stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2722944483-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/is-the-amd-deal-good-or-bad-for-meta-stock-bofa-has-its-say",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-26 00:48:43",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2974342,
            "title": "AWS Growth Potential Is Underestimated, Says Top Analyst About Amazon Stock",
            "description": "<html><head></head><body><p><strong>Amazon (<a href=\"https://www.tipranks.com/stocks/amzn/forecast\">NASDAQ:AMZN</a>)</strong> shares have dropped 5.5% since its fourth-quarter earnings earlier this month, underperforming the S&amp;P 500, which has gained 1% over the same period. The depressed sentiment reflects investor concerns over the company’s high spending, especially on <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a>, and whether it will generate strong returns.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>However, looking at the stock’s current situation, BofA’s Justin Post, an analyst ranked among the top 2% on Wall Street, thinks there are various ways sentiment can improve.</p>\n<p>This could happen if adoption of Trainium chips rises and new AI partnerships are announced. Progress in developing Amazon’s own large language models could also boost investor confidence.</p>\n<p>But one specific area Post homes in on as a potential driver of sentiment is AWS. The cloud computing platform has doubled its power capacity since 2022, and during the 4Q25 earnings call, Amazon reported that it added 3.9 gigawatts in 2025 alone, with plans to double capacity again by 2027. This expansion contributed to an acceleration in revenue growth, rising from 17% year-over-year in 2Q25 to 24% in 4Q25, and Post’s capacity projections indicate that AWS could drive future revenue growth above current Street estimates. Microsoft has also noted that capacity additions often serve as a revenue guide, further boosting Post’s confidence, while 4Q25 agreements with OpenAI and the US government suggest Amazon is well-positioned to compete for AI capacity deals moving forward.</p>\n<p>Post’s analysis (based on Amazon’s commentary and historical capex data) suggests AWS could expand its power capacity to over 31 GW by the end of 2027, up from roughly 15 GW in 3Q25. If revenue per added GW remains steady at $5.4 billion, Post thinks AWS could see revenues of $164 billion in 2026 and $209 billion in 2027. This implies upside of 2% in 2026 and 5% in 2027 vs. Street estimates of $161 billion and $199 billion, translating to 27% and 28% growth for those years, above the Street’s 25% and 24%. “While revenue yields on capacity could be impacted by shifts to AI workloads and competitive pricing, we think favorable demand trends will support revenues,” the 5-stat analyst said.</p>\n<p>Post does point out the risks to these estimates. He reckons hyperscalers will invest $1.2 trillion in capex over the next two years, up from $534 billion in 2024–2025, which could push data center construction costs higher and create excess industry capacity. This unprecedented expansion is likely to increase input costs – JLL estimates data center construction expenses have grown about 7% annually – and could lead to more competitive pricing, putting pressure on industry revenues.</p>\n<p>That, however, does not affect Post’s bullish stance. The analyst maintained a Buy rating on the shares, backed by a price objective of $275. The implication for investors? Upside of 31% from current levels. (To watch Post’s track record, <a href=\"https://www.tipranks.com/experts/analysts/justin-post\">click here</a>)</p>\n<p>While 3 of Post’s colleagues remain on the sidelines for now, with an additional 39 Buys, AMZN stock claims a Strong Buy consensus rating. The forecast calls for 12-month returns of 34%, considering the average target clocks in at $282.21. (<a href=\"https://www.tipranks.com/stocks/amzn/forecast\">See Amazon stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2703732263-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/aws-growth-potential-is-underestimated-says-top-analyst-about-amazon-stock",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-25 23:26:32",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2972288,
            "title": "ACHR or JOBY: Legendary Investor Dmitry Balyasny Loads Up on One Top Flying-Taxi Stock",
            "description": "<html><head></head><body><p>Every investor looks at the market and wonders what to buy. That’s normal. It’s tempting to look to the experts for inspiration, and that’s also normal. And few experts have more to offer retail investors than the market’s legendary investors. These are ones who have built themselves up, sometimes from humble beginnings, to control tens of billions in assets, to dominate the hedge markets.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Dmitry Balyasny typifies this breed. Originally from the Soviet Union, his family brought him to the US when he was 7. He started his career in financial trading in 1994, and in 2001 he founded his fund, Balyasny Asset Management, BAM. Today, Balyasny’s fund boasts some $32 billion in total AUM, and over 2,000 professionals working out of 20-plus global offices.</p>\n<p>In a recent interview, Balyasny made an interesting observation: that people are the most difficult issue to navigate in the financial trading business. As for market issues, he had a simple solution for difficulties: “You could just exit a position,” he said.</p>\n<p>So, let’s take a look at two of Balyasny’s positions, one that he’s exited and one that he’s opened. These are both companies focused on electric VTOL aircraft – a hot topic that aims to bring flying taxis to life. Balyasny’s positions involve <strong>Archer Aviation (<a href=\"https://www.tipranks.com/stocks/achr/forecast\">NYSE:ACHR</a>) </strong>and <strong>Joby Aviation (<a href=\"https://www.tipranks.com/stocks/joby/forecast\">NYSE:JOBY</a>)</strong>, two companies at the leading edge of this industry – and his actions may bring some light to bear on which stock is the better buy.</p>\n<p><strong>Archer Aviation</strong></p>\n<p>Archer Aviation, the first flying taxi stock we’ll look at here, was founded in 2018, and aims to develop an all-electric, short-hop air taxi for urban commuter routes – it describes the ‘target route’ as one which will take an hour or more by surface transport but can be reduced to a 10-minute hop or less by air. The trip from downtown Manhattan to Newark Airport is used by the company as an example.</p>\n<p>Archer’s prototype aircraft is dubbed ‘Midnight,’ and it features a battery-powered multi-rotor design to carry a pilot and four passengers, plus luggage, on a 20- to 50-mile route at speeds of up to 150 miles per hour. The Midnight uses 12 rotors mounted on the wing; the forward rotors can tilt between level and vertical modes for take-off and landing operations. The use of multiple rotors is a redundancy-based safety feature.</p>\n<p>The company is currently advancing its Midnight aircraft through FAA regulatory processes for certification, with the aim of getting it cleared for commercial service. In the meantime, Archer is also making arrangements to start services in various cities around the country. Two recent examples: in December, Archer announced its plans for an air taxi network in Metropolitan Miami, to link the cities of Miami, West Palm Beach, Boca Raton, and Fort Lauderdale, and to connect the major international air travel hubs of Miami International Airport, Fort Lauderdale-Hollywood International Airport, and Palm Beach International Airport. This announcement was followed two weeks later by an announcement that Archer will be launching air taxi trials in California, Texas, Florida, Georgia, and New York under the White House’s eVTOL Integration Pilot Program (eIPP), a joint program of the Department of Transportation (DOT) and the Federal Aviation Administration (FAA).</p>\n<p>We should also note that during 3Q25, Archer had sufficient resources to purchase LA’s Hawthorne Airport for $126 million in cash and finished the quarter with over $1.6 billion in cash and liquid assets on hand.</p>\n<p>When we turn to Dimitry Balyasny, we find that the hedge fund legend bought big into Archer recently. During 3Q25, he opened a position in this air taxi company, buying 1,276,177 shares; at current prices, this position is worth almost $9.2 million.</p>\n<p>Needham analyst Chris Pierce covers Archer and is impressed by the company’s sound position, realistic plans to expand, and its means to execute those plans. He writes of Archer, “With substantial balance sheet liquidity, ACHR retains flexibility to fund internal commercialization initiatives, advance its Georgia manufacturing ramp, and pursue targeted tuck ins across IP and composites, including defense adjacent opportunities. While OEM remains the core value driver vs peers levered to longer dated air taxi network operations, we view ACHR’s forward leaning posture (spanning defense, civil, public normalization efforts, and disciplined certification) as increasingly differentiated. Net, while timelines remain long and patience is required, the setup continues to favor companies with capital and regulatory credibility, and ACHR continues to check those boxes.”</p>\n<p>Pierce rates ACHR as a Buy, with a $10 price target that implies a one-year upside potential of 39%. (To watch Pierce’s track record, <a href=\"https://www.tipranks.com/experts/analysts/chris-pierce\">click here</a>.)</p>\n<p>Overall, Archer’s Moderate Buy consensus rating is based on 3 recent analyst reviews that include 2 Buys and 1 Hold. The stock is priced at $7.19, and its $11.50 average target price points to a 60% gain over the coming year. (See <a href=\"https://www.tipranks.com/stocks/achr/forecast\"><strong>ACHR stock forecast</strong></a>.)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/Balyasny-evtol-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/achr-or-joby-legendary-investor-dmitry-balyasny-loads-up-on-one-top-flying-taxi-stock",
            "author": "Michael Marcus",
            "pub_date": "2026-02-25 19:35:58",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2972101,
            "title": "Buy Into an Emerging AI Infrastructure Leader, Says Top Analyst About AMD Stock Following Meta Deal",
            "description": "<html><head></head><body><p><strong>Advanced Micro Devices’ (<a href=\"https://www.tipranks.com/stocks/amd/forecast\">NASDAQ:AMD</a>)</strong> new chip deal with Meta got the thumbs up from investors on Tuesday, with the shares surging by 9%.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>AMD disclosed a 6GW agreement with the social media giant, equating to potential <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> chip sales of up to $60 billion. The deal involves AMD’s AI-focused Helios rack-scale systems, featuring the latest MI450 GPUs alongside Verona and Venice Gen6 EPYC CPUs, with initial deliveries slated to begin in the second half of 2026. Both Meta and OpenAI highlighted their early adoption of AMD’s Helios rack-based infrastructure built to OCP specifications, with Meta emerging as the first customer to deploy a customized AMD Instinct GPU tailored to its specific AI workload requirements.</p>\n<p>Under the terms of the deal, Meta will receive 160 million performance-based warrants that vest in stages over a five-year period. AMD noted that each gigawatt of deployed capacity equates to tens of billions of dollars in revenue.</p>\n<p>The equity-for-chips structure is another example of the industry’s circular dealmaking and echoes AMD’s October agreement with OpenAI, which allowed the ChatGPT maker to build a 10% stake in the company over time.</p>\n<p>Looking at the deal, Roth’s Suji Desilva, an analyst ranked among the top 2% on Wall Street, thinks it further cements AMD’s standing in the AI chip industry. “We believe expansion of AMD’s already deep Meta relationship, following a similar OpenAI announcement in October 2025, represents a further step forward in the company’s place as a source of large-scale AI infrastructure,” the 5-star analyst said.</p>\n<p>In what is a highly competitive AI accelerator landscape, Desilva believes AMD benefits from a workload-oriented product roadmap that allows it to position its offerings, when necessary, between a standard merchant GPU solution and a fully customized ASIC alternative.</p>\n<p>Desilva thinks AMD’s chiplet-focused custom GPU, which played a central role in getting Meta on board, amounts to a competitive differentiator, and also sees AMD’s Instinct GPUs, when integrated with its market-leading x86-based EPYC CPU portfolio, as well positioned to address emerging AI demands, particularly those tied to advanced agentic AI and reasoning-driven AI systems.</p>\n<p>“With equity stakes included in both the META and OpenAI deals, we now believe that two major industry players have a vested interest in bringing AMD’s offering to a meaningful share position versus competitive AI infrastructure offerings,” the analyst summed up.</p>\n<p>To this end, Desilva maintained a Buy rating on AMD shares, along with a $300 price target that points toward 12-month returns of 40%. (To watch Desilva’s track record, <a href=\"https://www.tipranks.com/experts/analysts/sujeeva-de-silva\">click here</a>)</p>\n<p>Elsewhere on the Street, the stock claims an additional 22 Buys and 8 Holds, for a Moderate Buy consensus rating. Going by the $285.07 average target, a year from now, shares will be changing hands for a 33% premium. (<a href=\"https://www.tipranks.com/stocks/amd/forecast\">See AMD stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2687199923-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/buy-into-an-emerging-ai-infrastructure-leader-says-top-analyst-about-amd-stock-following-meta-deal",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-25 20:01:18",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2967460,
            "title": "IonQ Stock to $60? That Remains Wedbush’s Price Target Ahead of Q4 Earnings",
            "description": "<html><head></head><body><p><strong>IonQ (<a href=\"https://www.tipranks.com/stocks/ionq/forecast\">NYSE:IONQ</a>)</strong> shares, like those of its <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/quantum-computing\">quantum computing</a> peers, are suffering a bit of a come down in 2026’s hype-averse stock market. &nbsp;</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>2025’s hype has died down somewhat as investor concerns around long-term commercialization prospects and capital rotating away from more speculative tech names have all shaped the current landscape. Year-to-date, then, the stock has shed 30%.</p>\n<p>That said, shares tilted into the green at the open of Tuesday’s session after the quantum computing company announced it secured a government contract under the Missile Defense Agency’s Scalable Homeland Innovative Enterprise Layered Defense initiative tied to the Golden Dome. IonQ did not disclose the specific value of its award but said the overall contract carries a ceiling of $151 billion. More than 2,400 companies are eligible to compete for future task orders issued under the SHIELD IDIQ contract structure.</p>\n<p>Investors will be hoping that the company’s Q4 earnings tomorrow (Feb 25) after the market close can further help shift sentiment.</p>\n<p>Heading into the print, Wedbush analyst Antoine Legault believes the odds are in favor of that happening. Given the sharp pullback, the analyst thinks “expectations are somewhat low,” and anticipates that any positive technological or financial development will be “well received by the market.”</p>\n<p>Specifically, Legault anticipates further updates on the timeline and development progress of the company’s upcoming 256-qubit system. Legault thinks the call is likely to center on qualitative and technical developments rather than detailed financial commentary, although he does expect management to outline its 2026 organic and inorganic revenue outlook, like IonQ did in 4Q24. As has often happened on prior earnings calls, there is also the possibility that the company makes additional announcements alongside the results.</p>\n<p>As for any M&amp;A news, Legault is looking for additional detail on the proposed acquisition of <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/chips-stocks\">semiconductor</a> foundry SkyWater Technology, particularly regarding the expected closing timeline, as well as updates on the January acquisition of Seed Innovations, a software and R&amp;D firm, and the previously announced November acquisition of Skyloom. Recall that when IonQ disclosed its proposed SkyWater transaction at the end of January, it indicated that full-year 2025 revenue was tracking toward the high end or potentially above its $106 million to $110 million guidance range. Legault is calling for $109.7 million for the full year, including $41.6 million in Q4. &nbsp;</p>\n<p>Still, Legault thinks financial performance is secondary to technological execution and believes that new customer wins and broader <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a>-driven market momentum will “continue to be the main driver of share performance in the near-term.”</p>\n<p>Bottom line, Legault maintained an Outperform (i.e., Buy) rating on the shares, backed by a $60 price target. That implies the stock will gain 93% in the year ahead. (To watch Legault’s track record, <a href=\"https://www.tipranks.com/experts/analysts/antoine-legault\">click here</a>)</p>\n<p>That exuberant target is actually below the Street’s average, which lands at $72.75, and factors in a one-year gain of 134%. On the rating front, based on a mix of 7 Buys and 3 Holds, the analyst consensus rates the stock a Moderate Buy. (<a href=\"https://www.tipranks.com/stocks/ionq/forecast\">See IONQ stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2693584201-1-1-750x406-1.webp",
            "link": "https://www.tipranks.com/news/article/ionq-stock-to-60-that-remains-wedbushs-price-target-ahead-of-q4-earnings",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-25 02:00:10",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2967193,
            "title": "Qualcomm Will Rise Again, Says Loop Capital – Here’s Why the Stock Is a Buy Now",
            "description": "<html><head></head><body><p><strong>Qualcomm (<a href=\"https://www.tipranks.com/stocks/qcom/forecast\">NASDAQ:QCOM</a>)</strong> shares have underperformed the chip sector on a year-to-date, 1-year, 3-year, and 5-year basis, and while you can point to various reasons why that has been the case, there is one that is far more obvious than the others.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>“The company is not a data center <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> beneficiary,” says Loop Capital analyst Gary Mobley, who does go on to add positively, “at least not yet.”</p>\n<p>So far this year, the shares have declined by 18%, with the underperformance driven by a “perfect storm of circumstances.” That said, Mobley points out that memory chips are unlikely to remain in short supply indefinitely, and the smartphone market should eventually stabilize after the initial disruption. “When we see relief,” opined the 5-star analyst, “QCOM shares should benefit.”</p>\n<p>The general view is that meaningful additional memory capacity will not come online until 2028, framing the base-case timeline for the NAND and DRAM shortage. While memory availability could stay tight and pricing elevated in the intermediate term, thereby constraining smartphone supply and demand dynamics, Mobley makes the case that supply chains typically adjust and find “some sort of equilibrium” over time. Earlier this year, Chinese smartphone OEMs tightened inventory controls as the memory shortage became more pronounced. But over time, these OEMs may gradually relax inventory discipline as the ecosystem adapts to ongoing memory constraints and a structurally higher bill of materials.</p>\n<p>Furthermore, by this point next year, Qualcomm’s sales exposure to Samsung should be comping against a steady 75% share, rather than reflecting the step-down from 100% share seen this year. In addition, its chip shipments to Apple are expected to represent less than 10% of total revenue by then, excluding any QTL patent licensing revenue collected from Apple.</p>\n<p>Finally, within that same timeframe, investors are likely to have greater conviction in the outlook for FY29, where Automotive and IoT revenue could approach or potentially surpass Handset revenue for the first time, marking a “milestone in QCOM’s diversification path.”</p>\n<p>Against the backdrop of this potential shift in sentiment, and given the year-to-date decline in QCOM shares, Mobley has now upgraded his rating from Hold to Buy. Mobley’s $185 price target implies shares will climb 28% higher in the months ahead. (To watch Mobley’s track record, <a href=\"https://www.tipranks.com/experts/analysts/gary-mobley\">click here</a>)</p>\n<p>On a side note, Mobley thinks the company will hold an analyst day in June, when the company should outline progress in expanding non-smartphone revenue streams and offer additional detail on its data center roadmap, including platforms such as AI200 and AI250. Ahead of the event, he thinks it is probable that Qualcomm announces another data center customer, adding to HUMAIN.</p>\n<p>So, that’s the Loop view, but what does the rest of the Street have in mind for this chipmaker? Based on an additional 9 Buys, 12 Holds and 1 Sell, the analyst consensus rates the stock a Moderate Buy. Going by the $163.65 average target, the shares will gain 12.5% in the months ahead. (<a href=\"https://www.tipranks.com/stocks/qcom/forecast\">See Qualcomm stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2684321629-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/qualcomm-will-rise-again-says-loop-capital-heres-why-the-stock-is-a-buy-now",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-25 00:28:52",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2966825,
            "title": "‘Buy the Dip,’ Says Jefferies Following IBM Stock Meltdown",
            "description": "<html><head></head><body><p><strong>International Business Machines (<a href=\"https://www.tipranks.com/stocks/ibm/forecast\">NYSE:IBM</a>) </strong>became the latest name to get an <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a>-related kick in the teeth on Monday, when the stock recorded its biggest one-day drop since 2000, the year its shares plunged during the broader collapse of the dot-com bubble.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Shares cratered by 13% after Anthropic reignited investor worries that AI coding tools might disrupt long-standing COBOL workloads. In a blog post, Anthropic pointed to COBOL functionality in its Claude Code platform, sparking renewed concern over AI’s potential to impact IBM’s traditional business lines. Anthropic emphasized that hundreds of billions of COBOL lines are still active in daily operations across sectors like finance, airlines, and government, and suggested that AI can now handle analysis tasks that previously made system upgrades slow and costly. Because COBOL is essential to critical systems such as payment processing and financial infrastructure – areas where IBM has historically been a key player – the news intensified fears that AI could reduce demand for legacy COBOL services.</p>\n<p>While investors fled on the prospect of more AI disruption, Jefferies analyst Brent Thill is more sanguine, pointing out that IBM is “already disrupting itself.” It is doing so by “productizing AI-native modernization tools” designed to tackle the key issues in its install base, including a dwindling pool of COBOL developers and the complexity of decades-old business logic. Its watsonx Code Assistant for Z has been in use for over two years (generally available in 4Q23) and eases the typical hurdles of mainframe modernization by leveraging generative AI to convert COBOL into Java, interpret production code, and update applications while maintaining essential logic. Thill thinks that integrating these capabilities directly into the Z platform gives IBM a structural edge over general-purpose code assistants, which may be capable but lack native access to mainframe data, tools, and operational context. “More broadly,” Thill added,&nbsp;“IBM&nbsp;is positioning itself to live in a multi‑model, agentic world by partnering with providers like Anthropic, OpenAI and others. Those agents ultimately need to be infused into enterprise data &amp; hybrid cloud architectures, where&nbsp;IBM&nbsp;differentiates through its data layer, connectors, and platform integration.”</p>\n<p>Essentially, Thill says IBM remains a “software-driven story” with several long-term growth opportunities across hybrid cloud, AI, automation, and data. While mainframe software contributes significantly due to its strong margins and stability – making up roughly 23% of total revenue and 29% of software revenue in CY25 – it is not the “linchpin of&nbsp;IBM’s broader software reacceleration narrative.” The company’s goal of sustaining software growth above 10% is being fueled by expansions in areas such as Red Hat, watsonx, automation, and data platforms, which go far beyond the Z mainframe. “We view the sell-off as a near-term sentiment overhang on legacy services rather than an existential or structural risk,” the analyst summed up.</p>\n<p>To this end, Thill maintained a Buy rating on IBM shares, while his $370 price target points toward 12-month returns of 66%. (To watch Thill’s track record, <a href=\"https://www.tipranks.com/experts/analysts/brent-thill\">click here</a>)</p>\n<p>11 other analysts join Thill in the bull camp, while an additional 5 Holds and 1 Sell all add up to a Moderate Buy consensus rating. The forecast calls for 12-month returns of 51%, considering the average target clocks in at $337.53. (<a href=\"https://www.tipranks.com/stocks/ibm/forecast\">See IBM stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2068727069-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/buy-the-dip-says-jefferies-following-ibm-stock-meltdown",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-24 22:02:38",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2965041,
            "title": "Will a PayPal Sale Go Ahead? Analysts Offer Thoughts on Latest Rumors",
            "description": "<html><head></head><body><p><strong>PayPal (<a href=\"https://www.tipranks.com/stocks/pypl/forecast\">NASDAQ:PYPL</a>)</strong> shares were in focus on Monday, with trading briefly paused due to volatility before the stock finished the session up 6%.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>The move followed a Bloomberg report indicating that the payments firm has drawn takeover interest after a prolonged period of underperformance. Bloomberg News, citing people familiar with the matter, said the company has met with banks in response to unsolicited approaches from potential buyers. At least one major competitor is reportedly evaluating a bid for the entire business, while other parties are said to be exploring the acquisition of select PayPal assets. The report added that the discussions remain at an early stage and may not lead to a deal. PayPal has not commented on the matter.</p>\n<p>The stock has faced sustained pressure in recent years, now sitting 86% below its 2021 peak. Earlier this month, shares declined 20% after the company issued a soft 2026 profit outlook, announced a CEO transition to replace Alex Chriss, and continued to grapple with intense competition across the digital payments landscape.</p>\n<p>Looking at the situation, Mizuho analyst Dan Dolev says it is not surprising that interest is emerging at the current valuation, and believes the takeover attention “highlights PayPal’s intrinsic value.”</p>\n<p>“In our view at ~7x 2027E consensus EPS (vs. 20x+ 5-year avg.), PYPL is deeply undervalued given that it is one of four globally recognized payment networks alongside V/MA/AXP, has nearly $2tn of volumes including a 2-sided network with nearly 440mn active accounts and the most prominent US P2P network (Venmo) and a growing BNPL practice,” the analyst explained.</p>\n<p>Dolev maintained an Outperform (i.e., Buy) rating on the shares, backed by a $60 price target that points toward 12-month returns of 36%. (To watch Dolev’s track record, <a href=\"https://www.tipranks.com/experts/analysts/dan-dolev\">click here</a>)</p>\n<p>For Raymond James analyst Madison Suhr, the most probable buyers are likely to be mega-cap tech companies such as GOOG, META, MSFT, AMZN, and AAPL. Stripe, which is privately held, could also represent a strategic fit, although it is unclear whether such a transaction would be feasible given the limited publicly available financial information on the company.</p>\n<p>However, Suhr is skeptical the deal will make it across the finish line. “In our view,” said the analyst, “a PE takeout is unlikely as this would likely be a $50B+ check size, and the ultimate exit strategy isn’t clear to us. Moreover, we estimate a mid-teens IRR at a $55 takeout price, which is not very compelling given elevated risks with the deal. That said, we acknowledge potential suitors may look to chop the business up or buy certain assets such as Venmo.”</p>\n<p>While a full sale of the company is unlikely, Suhr also thinks the reported interest is not surprising given the stock’s current valuation. For now, Suhr remains on the sidelines with a Market Perform (i.e., Neutral) rating with no fixed price target in mind.</p>\n<p>Most other analysts are also on the fence here; based on a mix of 26 Holds, 5 Buys and 4 Sells, the analyst consensus rates the stock a Hold. Going by the $51.29 average target, shares will climb 16% higher in the months ahead. (<a href=\"https://www.tipranks.com/stocks/pypl/forecast\">See PYPL stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2690858207-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/will-a-paypal-sale-go-ahead-analysts-offer-thoughts-on-latest-rumors",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-24 20:30:00",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2965204,
            "title": "2 Dividend Stocks Yielding 10%+ at Rock-Bottom Levels; Truist Says ‘Buy’",
            "description": "<html><head></head><body><p>What are the elements of the best investment? That’s the question that every investor needs to answer – and the answer can make the difference between a good portfolio and a great portfolio. Some investors will swear by dividend investing, others will ‘buy the dip,’ while still others will follow the top-rated analysts.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>And this is why, when stocks start showing all of those traits, they deserve a closer look. Truist analyst Arren Cyganovich, who is rated by <a href=\"https://www.tipranks.com/dashboard\">TipRanks</a> among the top 5% of Wall Street’s experts, has recently picked out some high-yielding dividend shares – and both also show depressed share prices. It’s a trifecta of ‘Buy’ signals.</p>\n<p>The depressed share price offers an attractive point of entry; a high dividend yield – over 10% in these cases – promises a solid return on the purchase; and the top-ranked analyst’s imprimatur shows that these stocks are standing out from the pack.</p>\n<p>Keeping that in mind, let’s look at these two underperforming high-yield div stocks and see why the Truist expert is saying ‘Buy.’</p>\n<p><strong>Ares Capital Corporation</strong> (<a href=\"https://www.tipranks.com/stocks/arcc/forecast\"><strong>ARCC</strong></a>)</p>\n<p>We’ll start with a look at Ares Capital Corporation, a business development company, or BDC, that has been in operation since 2004. BDCs like Ares play a vital economic role, providing capital and financing to the small- and mid-sized businesses that tend to drive the US economy. In the years since its founding, Ares has put together what it describes as a balanced portfolio. As of December 31, 2025, this investment portfolio included 603 companies backed by 254 private equity sponsors. By fair value, the portfolio was worth $29.5 billion.</p>\n<p>Of Ares’ portfolio, more than half – some 60.5%, to be exact – is composed of first lien senior secured loans, and another 5% is in second lien senior secured loans. The remaining third of the portfolio consists of various instruments, including preferred equity securities and senior subordinated loans. A large portion of the portfolio, 23.8%, is in the software and services sector; health care equipment and services make up 11.3%, and commercial and professional services account for 9.4%. Overall, the portfolio features a diverse array of investment sectors and geographic exposure.</p>\n<p>Ares works to build a portfolio of high-quality borrowers that generate sound long-term returns. That strategy has allowed the company to consistently maintain a strong dividend payout. The company has been paying regular quarterly dividends since 2004 and has, at times, supplemented those with special dividends. The current dividend, scheduled to be paid on March 31, is set at 48 cents per common share. The annualized rate of $1.92 gives a forward yield of 10%.</p>\n<p>In its 4Q25 report, the most recent quarterly results released, Ares reported top-line revenue of $793 million. This was up 4.5% year-over-year, although it missed the forecast by $840,000. On the bottom line, Ares reported non-GAAP EPS of 50 cents per share – enough to fully cover the dividend and in line with pre-release expectations. We should note here that Ares’ stock is down 18% over the last 12 months.</p>\n<p>The Truist view is set out by Arren Cyganovich, who addresses investor fears, and lays out a case for buying in, writing following the recent earnings release: “With peaking concern about software exposure (24% of ARCC’s portfolio) management’s tone was confident both in the recent performance of its investments and the near- to medium-term outlook. While investors remain skeptical about the long-term outlook for software, we are more in ARCC’s camp seeing this more as a slow burn than a near-term fundamental impact to BDC portfolios – especially one with the long-term investing track record of ARCC… We believe that with two more cuts likely this year ARCC should be able to cover the dividend with earnings. Any potential near-term shortfalls can be covered by spillover taxable income estimated to be $1.38 per share.”</p>\n<p>Cyganovich rates ARCC shares as a Buy, and his $23 price target implies a one-year upside of 21%. Adding in the dividend yield, we’re looking at a potential total return of 31% by this time next year. (To watch Cyganovich’s track record, <a href=\"https://www.tipranks.com/experts/analysts/arren-cyganovich\">click here</a>.)</p>\n<p>ARCC shares have a Strong Buy consensus rating, based on four unanimously positive recent analyst reviews. The stock is priced at $19.05, and its $21.75 average price target suggests it will gain 14% by this time next year. (See <a href=\"https://www.tipranks.com/stocks/arcc/forecast\"><strong>ARCC stock forecast</strong></a>.)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2258242151-2-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/2-dividend-stocks-yielding-10-at-rock-bottom-levels-truist-says-buy",
            "author": "Michael Marcus",
            "pub_date": "2026-02-24 19:00:06",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2961321,
            "title": "Wells Fargo Upgrades Alphabet Stock Due to Multiple AI-Related Opportunities",
            "description": "<html><head></head><body><p><strong>Alphabet’s (<a href=\"https://www.tipranks.com/stocks/googl/forecast\">NASDAQ:GOOGL</a>)</strong> <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> positioning has improved considerably in the past year, and the market has acknowledged that fact. To wit, even while the shares have been unable to gain traction in 2026’s choppy market, it has been the strongest Mag 7 performer, gaining 76% over the past 12 months.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>Now it seems even prior skeptics are getting on board. Wells Fargo analyst Ken Gawrelski had taken a more balanced view of the stock’s prospects, but he has now officially changed his tune.</p>\n<p>Gawrelski has just upgraded his rating from Equal Weight (i.e., Neutral) to Overweight (Buy) and has also raised his price target from $354 to $387, suggesting the stock will gain 23% in the year ahead. (To watch Gawrelski’s track record, <a href=\"https://www.tipranks.com/experts/analysts/ken-gawrelski\">click here</a>)</p>\n<p>“Capacity is king,” says the analyst, who sees “multiple new opportunities to capitalize on Google’s leadership in compute capacity, distribution and consumer data.”</p>\n<p>Gawrelski forecasts that Google will expand its compute capacity to 35GW by 2028, up from 15GW at the end of 2025, extending its capacity lead over other hyperscalers. The analyst notes that hyperscaler ambitions increasingly appear constrained by compute capacity. As this market dynamic continues over the medium term, Gawrelski expects Google will strengthen its competitive edge by further extending its capacity lead over peers. The analyst believes this growth in capacity will allow Google to “fulfill its ambitions” across GCP (Google Cloud) and its search, agentic, and autonomous businesses.</p>\n<p>To match his projected capacity growth, Gawrelski has raised his already well-above-consensus GCP estimates. The analyst now forecasts 2026 GCP revenue will grow 60% year-over-year, 11% above Street estimates, with 2027 and 2028 growth at 42% and 28% year-over-year, respectively, 16% and 12% above consensus. These forecast adjustments reflect the ongoing supply/demand imbalance in the industry, which indicates that supply “dictates revenue opportunity.” Gawrelski reckons GCP capacity will increase from 7.6GW in 2025 to 16.9GW by 2028. As a result, his cloud operating income estimates for FY26 and FY27 are now 10–15% above Street expectations.</p>\n<p>Gawrelski also factors into his projections a Gemini consumer subscription business he expects will reach $12 billion in ARR by the end of 2027, up from $4 billion at the end of 2025. There’s also potential upside from the Apple Siri partnership, likely contributing in 2027 or later, and possibly from TPU sales, although the analyst expects those to remain limited over the next few years since compute capacity is “highly strategic.” While the AI search transition remains a risk, with ChatGPT’s share holding steady around 13% since July 2025, Google has some breathing room to manage the shift. And what looked like a zero-sum game for engagement in early 2025 – market search instances up 9% while total Google (including Gemini) grew 3–4% – has now turned into a growing market, with search instances up 37% and total Google up 24% in January 2026.</p>\n<p>“Finally,” Gawrelski summed up, “count us as impressed by the accelerated pace of product innovation post conclusion of the DOJ search remedy hearing.”</p>\n<p>So, that’s the Wells Fargo view, but what does the rest of the Street make of Alphabet’s prospects? Based on a mix of 27 Buys and 6 Holds, the analyst consensus rates the stock a Strong Buy. The average target stands at $382.81, suggesting shares will gain 22% in the months ahead. (<a href=\"https://www.tipranks.com/stocks/googl/forecast\">See GOOGL stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/GOOGL-0229-2-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/wells-fargo-upgrades-alphabet-stock-due-to-multiple-ai-related-opportunities",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-24 02:10:23",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 2960687,
            "title": "Novo Nordisk Stock Falls After Disappointing Drug Trial Results, but Is It a Buy Now? BofA Weighs In",
            "description": "<html><head></head><body><p>The week is off to a bad start for <strong>Novo Nordisk (<a href=\"https://www.tipranks.com/stocks/nvo/forecast\">NYSE:NVO</a>)</strong> investors. Shares of the Danish drugmaker are taking a severe beating in Monday’s session, with the stock down by 15% as of writing.</p><p></p><h3 style=\"text-decoration: underline; text-decoration-color: #1e77f9;\"><a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\">Claim 50% Off TipRanks Premium</a></h3><ul style=\"padding-top: 5px;\"><li>Unlock <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> hedge fund-level data </a> and <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> powerful investing tools </a> for smarter, sharper decisions \n</li><li> Stay ahead of the market with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/checkout/v2?subscription=tipranks-premium-yearly&amp;llf=rss&amp;coupon=INTRO50P&amp;checkoutPage=checkoutv2\"> the latest news and analysis </a> and maximize your portfolio's potential</li></ul><p></p>\n<p>The drop came in the wake of underwhelming results for Novo Nordisk’s new obesity treatment, representing another setback for the struggling pharma giant.</p>\n<p>In the REDEFINE 4 trial, CagriSema, the company’s once-weekly injection, achieved an average weight loss of 23% after 84 weeks, compared with 25.5% for tirzepatide, the active ingredient in Eli Lilly’s successful drugs Mounjaro and Zepbound. Novo’s latest obesity therapy combines a new molecule, cagrilintide, with semaglutide, the component behind its blockbuster drugs Ozempic and Wegovy. The findings from the late-stage study add further scrutiny on Novo, which has ceded ground to Lilly in the pivotal US market.</p>\n<p>The sharp drop follows another decline earlier this month, when the company projected that net sales and profits could decline by as much as 13% this year, pointing in part to lower US pricing tied to an agreement with the <a data-autolink=\"true\" href=\"https://www.tipranks.com/stocks/djt\">Trump</a> administration aimed at reducing consumers’ drug costs.</p>\n<p>While the results seem to have taken the market by surprise, BofA analyst Sachin Jain says this is a “scenario we’d been uniquely flagging.”</p>\n<p>“We’ve been vocal that consensus c$14bn peak CagriSema sales could need revisiting, which we now see as high probability post-inferiority for REDEFINE-4,” the analyst said. “Moreover, we also note limited efficacy advantage in diabetes is a risk to consensus CagriSema forecasts, with recent REIMAGINE-2 data only showing a c0.1-0.2% HbA1c delta for CagriSema vs sema 2.4mg (Ozempic).”</p>\n<p>As such, Jain thinks the weaker-than-anticipated CagriSema readout likely “raises the bar” on oral semaglutide sales, even though the launch has started strongly. Essentially, if CagriSema were to generate limited or no revenue in 2028E, roughly $7 billion in oral semaglutide sales would be needed to compensate, implying average weekly total prescriptions of about 450,000, broadly in line with current Zepbound prescription volumes.</p>\n<p>The initial rollout of oral semaglutide has exceeded forecasts, with prescription trends running “well ahead of expectations.” Physician feedback on Novo’s oral semaglutide indicates it could capture around 50% market share, underpinning a peak sales opportunity of approximately $12 billion, based on BofA’s recent survey work. That said, Jain thinks several variables are likely to influence the rollout. These include the post-Orforglipron (LLY’s oral drug) PDUFA decision on April 10th and whether that supports a broader global expansion vs. a more limited US and select EU strategy; the prospect of “injectable cannibalisation,” with clinicians estimating that such transitions account for 43% of uptake; and questions around treatment duration and dose escalation, as doctors continue to “flag persistence issues.”</p>\n<p>“Our two key areas of concern (FY26 guidance and potential for REDEFINE-4 inferiority) have now played out negatively,” Jain summed up, although that does not alter his stance. The analyst maintained a Neutral rating on the shares along with a $55.30 (350 DKK) price objective. That said, the figure now makes room for solid gains of 38% over the next year. (To watch Jain’s track record, <a href=\"https://www.tipranks.com/experts/analysts/sachin-jain\">click here</a>)</p>\n<p>3 of Jain’s colleagues join him on the sidelines, yet with an additional 4 Buys and 1 Sell, the analyst consensus rates the stock a Moderate Buy. Going by the $56 average target, a year from now shares will be changing hands for a 40% premium. (<a href=\"https://www.tipranks.com/stocks/nvo/forecast\">See NVO stock forecast</a>)</p>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2026/02/shutterstock_2568017857-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/novo-nordisk-stock-falls-after-disappointing-drug-trial-results-but-is-it-a-buy-now-bofa-weighs-in",
            "author": "Marty Shtrubel",
            "pub_date": "2026-02-23 23:41:25",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        }
    ]
}