{
    "data": [
        {
            "id": 1703087,
            "title": "Wall St Eyes 54% Upside in NVDA Stock as Options Traders Capitalize",
            "description": "<html><head></head><body><p>Despite China’s DeepSeek model disrupting the broader <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">artificial intelligence</a> ecosystem, Nvidia <a data-ticker=\"NVDA\" href=\"https://www.tipranks.com/stocks/nvda\">(NVDA)</a> remains the underlying hardware king. Therefore, the red ink imposed on NVDA stock would appear to be a discounted opportunity — an <a href=\"https://www.tipranks.com/news/time-to-double-down-says-investor-about-nvidia-stock\">opinion shared by top analysts and investors</a>. So, the argument isn’t about whether NVDA is an exciting bullish opportunity. Rather, the question is how best to capitalize on NVDA.</p><p></p><h3 style=\"text-decoration: underline;\">Maximize Your Portfolio with Data Driven Insights:</h3><ul style=\"padding-top: 5px;\"><li>Leverage the power of <a data-link=\"article_promo\" href=\"https://www.tipranks.com/screener/top-smart-score-stocks\">TipRanks' Smart Score</a>, a data-driven tool to help you uncover top performing stocks and make informed investment decisions. </li><li>Monitor your stock picks and compare them to top Wall Street Analysts' recommendations with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\"> Your Smart Portfolio</a></li></ul><p></p>\n<p>On a fundamental level, questions exist about the supposed ultra-low-cost nature of the DeepSeek algorithm. Further, the idea that China is about to launch an <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> paradigm shift could be misleading. Major enterprises like Microsoft <a data-ticker=\"MSFT\" href=\"https://www.tipranks.com/stocks/msft\">(MSFT)</a> and Meta Platforms <a data-ticker=\"META\" href=\"https://www.tipranks.com/stocks/meta\">(META)</a> are supply-constrained regarding their AI hardware needs. According to reports, they want to significantly expand their capital expenditures to boost their machine-intelligence capabilities.</p>\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><a href=\"https://www.tipranks.com/stocks/nvda\"><img decoding=\"async\" loading=\"lazy\" width=\"798\" height=\"407\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA4.jpg\" alt=\"\" class=\"wp-image-1704255\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA4.jpg 798w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA4-300x153.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA4-768x392.jpg 768w\" sizes=\"(max-width: 798px) 100vw, 798px\"></a></figure></div>\n<p>The average price target of Wall Street analysts is $180 per share, which suggests around 54% upside to come. However, bullish investors can harness a particular options strategy to replicate big payouts over weeks, not years.</p>\n<p>I’m bullish on a rebound in NVDA stock and continue to believe it will deliver strong returns for shareholders. However, there is a cleaner way of gaining exposure to the tech/AI theme and NVDA stock while generating even more substantial returns than traditional stock investing.</p>\n<h2 class=\"wp-block-heading\"><strong>Understanding the Statistical Context Behind NVDA Stock</strong></h2>\n<p>The first order of business is to recognize the short-term nature of options trading. Unlike the underlying security, options are classified as “wasting assets” because they all eventually expire worthless. Therefore, if you wager on so-called cheap options — or options far out the money — you effectively engage in binary transactions: you are either winning or losing.</p>\n<p>Moreover, the progression of time exponentially reduces the option’s premium value as it nears expiration, which tends to mean options traders think short-term. Therefore, focusing on optionable securities like NVDA isn’t about broader fundamentals but pricing behaviors based on statistical trends.</p>\n<p>Primarily, the key element that makes NVDA stock attractive to options traders is its upward bias. Statistically, when considering data over the trailing five years, traders who enter a position at the beginning of the week have a 56.98% chance of being profitable by the end of it. Over four weeks, the long odds improve to just over 66%.</p>\n<p>In other words, outside of a truly compelling reason to be contrarian, the numbers favor taking a shot on NVDA stock.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA-stock-probability-gambit.jpg\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA-stock-probability-gambit-1024x576.jpg\" alt=\"\" class=\"wp-image-1703089\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA-stock-probability-gambit-1024x576.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA-stock-probability-gambit-300x169.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA-stock-probability-gambit-768x432.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA-stock-probability-gambit.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>However, the market operates with human emotions, and responses can vary depending on fluctuations in the fear-greed continuum. Last week, NVDA stock incurred a loss of 3.79%. Whenever NVDA loses up to 5% of value over one week, there’s a 67.53% chance that the equity will have landed in positive territory by the end of the fourth subsequent week.</p>\n<p>Stated differently, there’s evidence that investors tend to buy the dip during sizable declines (for the record, negative weeks over the past five years in NVDA carry a median loss of 3.7%). This framework provides all the more evidence that speculators are justified in wanting to buy Nvidia at a discount.</p>\n<h2 class=\"wp-block-heading\"><strong><strong>Options Traders Smell Blood</strong></strong></h2>\n<p>Viewing Nvidia stock pricing data in no other context aside from the temporal — NVDA may reach $134.36 over the next four weeks, assuming the positive scenario materializes. If the negative scenario occurs, there is a statistical risk that NVDA could fall to $111.79, according to the options chain expiring Feb. 28. From a dynamic perspective, NVDA is on pace to hit $133.70 per share in an optimistic scenario or fall to $111.79 in an adverse scenario. With this market intelligence, investors can execute a bullish options strategy called the bull call spread.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/nvda/options-chain\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"514\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA3-1024x514.jpg\" alt=\"\" class=\"wp-image-1704248\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA3-1024x514.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA3-300x150.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA3-768x385.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA3.jpg 1240w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>Under a bull spread, the trader buys a call option and simultaneously sells a call at a higher strike price (for the same expiration date). The idea is to use the credit received from the short call to partially offset the debit paid for the long call.</p>\n<p>To be sure, the sale of the short call necessarily caps the reward at the representative strike price. However, the benefit is that the net cash outlay to enter the bullish position is discounted. Further, this discounting lowers the threshold to breakeven, improving the speculator’s odds of success compared to a call-only acquisition.</p>\n<p>Now, the beauty of the bull spread comes in the form of the reward. If NVDA stock reaches $134, that’s a decent 11.6% return. However, if you only wager a thousand dollars on NVDA, the nominal reward would be $116. In contrast, the bull spread can offer far better rewards, depending on the specific transaction.</p>\n<h2 class=\"wp-block-heading\"><strong>Options Allow Ideal Blend of Risk and Reward</strong></h2>\n<p>One of the reasons why investors tend to shy away from multi-leg options strategies like the bull call spread is due to the plethora of available spreads. How does one know which spread to pick?</p>\n<p>Let me tell you a little secret: it’s just like soccer.</p>\n<p>In the beautiful game, you improve your scoring chances by committing more players to the attack. At the same time, you leave yourself vulnerable to a counterattack. If you’re worried about conceding a goal, you can take speculative long shots without committing too many players to the attack, although the chances of success are low.</p>\n<p>In <a href=\"https://www.tipranks.com/stocks/nvda/options-chain\">the options arena</a>, the 111/134 bull call spread (buy the $111 call, sell the $134 call) for the options chain expiring Feb. 28 would be an example of a high-commitment attack. As of Monday’s close, the net debit required stood at $895 for the chance to earn $1,405 (a payout of 156.98%).</p>\n<p>So long as NVDA stock doesn’t drop below $111 by Feb. 28, traders may be able to salvage some intrinsic value out of the long call. However, if Nvidia implodes (i.e., the market’s devastating counterattack), the trader will lose the entire net debit paid to enter the trade.</p>\n<p>On the other hand, you can select the 132/134 bull spread. This trade only requires a $60 cash outlay for the chance to earn $140, or a payout of 233.33%. However, NVDA stock must reach $134 just to break even. Since both the long and short calls are well out of the money, there’s a strong chance you will lose the entire net debit paid.</p>\n<p>Still, it may be worthwhile to take that potshot because NVDA stock has such a strong upward bias.</p>\n<h2 class=\"wp-block-heading\"><strong>Is NVDA a Strong Buy?</strong></h2>\n<p>Turning to Wall Street, NVDA stock has a Strong Buy consensus rating based on 37 Buy, three Hold, and zero Sell ratings. The average NVDA price target is $179.81 per share, implying a 54.13% upside potential. Currently, NVDA may just be the most Buy-rated stock in the U.S.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/nvda/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"447\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA-1024x447.jpg\" alt=\"\" class=\"wp-image-1703565\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA-1024x447.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA-300x131.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA-768x335.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA.jpg 1231w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/nvda/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"268\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA2-1024x268.jpg\" alt=\"\" class=\"wp-image-1703566\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA2-1024x268.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA2-300x79.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA2-768x201.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/NVDA2.jpg 1219w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a><figcaption class=\"wp-element-caption\"><strong><a href=\"https://www.tipranks.com/stocks/nvda/forecast\">See more NVDA analyst ratings</a></strong></figcaption></figure>\n<h2 class=\"wp-block-heading\"><strong>Optional Method of Gaining Exposure to Bullish NVDA Stock</strong></h2>\n<p>NVDA stock took a hit last week due to concerns over China’s DeepSeek AI model, but the selloff could be an opportunity in disguise. Despite the noise, NVDA remains the dominant tech hardware player, and history suggests investors tend to buy the dip. The numbers support a bullish outlook, with statistical trends pointing to a likely rebound in the coming weeks.</p>\n<p>Rather than simply following Wall St guidance and buying stock outright, options traders can take advantage of NVDA’s upside potential through a bull call spread. This approach leverages the stock’s upward bias while limiting risk. Depending on the chosen strike prices, traders can position themselves for a substantial payout if NVDA trades higher. Ultimately, it’s about structuring the trade like a calculated offensive play—balancing risk and reward based on market probabilities.</p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-1\">Disclosure</a>.</p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/02/shutterstock_2554602387-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/wall-st-eyes-54-upside-in-nvda-stock-as-options-traders-capitalize",
            "author": "Joshua Enomoto",
            "pub_date": "2025-02-04 18:14:59",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1701114,
            "title": "American Airlines (AAL) Stock to Fly in 2025 Despite Wall St Turbulence",
            "description": "<html><head></head><body><p>Wall Street’s reaction to American Airlines’ <a data-ticker=\"AAL\" href=\"https://www.tipranks.com/stocks/aal\">(AAL)</a> Q4 earnings numbers was reactionary at best, briefly halting the airline’s long and steady climb since August 2024. After publishing its <a href=\"https://www.tipranks.com/news/company-announcements/american-airlines-reports-strong-2024-financials\">Q4 figures on January 23</a>, the market clipped AAL’s wings, with the stock now trading ~10% lower and 3% lower since the start of the year. </p><p></p><h3 style=\"text-decoration: underline;\">Maximize Your Portfolio with Data Driven Insights:</h3><ul style=\"padding-top: 5px;\"><li>Leverage the power of <a data-link=\"article_promo\" href=\"https://www.tipranks.com/screener/top-smart-score-stocks\">TipRanks' Smart Score</a>, a data-driven tool to help you uncover top performing stocks and make informed investment decisions. </li><li>Monitor your stock picks and compare them to top Wall Street Analysts' recommendations with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\"> Your Smart Portfolio</a></li></ul><p></p>\n<p>The airline’s conservative outlook for the current quarter surprised many, especially since analysts had expected brighter forecasts. Yet I believe that focusing solely on management’s guidance risks overlooking some tangible progress American Airlines has made. There are compelling reasons to think AAL’s rally has more mileage, from record revenues to accelerated debt reduction. For this reason, I remain bullish on AAL stock despite its recent sell-off.</p>\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><a href=\"https://www.tipranks.com/stocks/aal\"><img decoding=\"async\" loading=\"lazy\" width=\"792\" height=\"425\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/AAL.jpg\" alt=\"\" class=\"wp-image-1702383\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/AAL.jpg 792w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL-300x161.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL-768x412.jpg 768w\" sizes=\"(max-width: 792px) 100vw, 792px\"></a></figure></div>\n<h2 class=\"wp-block-heading\"><strong>Wall Street Disappointment Creates Buy-the-Dip Opportunity</strong></h2>\n<p>American Airlines posted an adjusted net income of $609 million, or $0.86 per share, for Q4. Although that figure was a positive surprise in isolation, the company’s guidance for the first quarter of FY2025 left much to be desired. Management projected an adjusted loss per share between $0.20 and $0.40 for the quarter, which landed below most analysts’ estimates.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/aal/earnings\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"263\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-30-1024x263.png\" alt=\"\" class=\"wp-image-1701555\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-30-1024x263.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-30-300x77.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-30-768x197.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-30.png 1355w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>Caution in the aviation sector often emerges from a mix of rising costs and uncertain demand. For American Airlines, labor expenses were indeed a notable culprit, as non-fuel unit costs grew 5.7% year-over-year in Q4, largely due to higher compensation from recent union agreements. Additionally, the airline indicated a seasonally soft start to 2025, with capacity down about 3% in January and February before picking up in March. Considering all of that, it becomes clear why AAL’s uneven demand pattern probably spooked investors with brighter expectations.</p>\n<p>Another red flag for some analysts was the airline’s conservative capacity strategy. American Airlines plans to grow full-year capacity by low single digits, which raised questions about whether it can maintain pricing power in an increasingly competitive environment. With travel patterns still evolving in the post-pandemic era, I would argue that investors might have hoped for a bolder approach to capturing market share.</p>\n<h2 class=\"wp-block-heading\"><strong>Several Upbeat Developments Spell Elevation for AAL</strong></h2>\n<p>Despite management’s conservative tone, I see plenty to like under AAL’s hood. The airline reported a record Q4 revenue of $13.7 billion, marking a 4.9% year-over-year increase and beating consensus estimates by $280 million. For this reason, I believe the underlying demand for air travel remains strong. Travel is seasonal, not linear. The seasonably soft start to 2025 is probably attributed to a month-over-month correction and not necessarily softening performance overall.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/aal/financials/balance-sheet\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"392\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/AAL4-1024x392.jpg\" alt=\"\" class=\"wp-image-1702459\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/AAL4-1024x392.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL4-300x115.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL4-768x294.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL4.jpg 1236w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>Moreover, American Airlines scored a major win in debt reduction, reaching its goal of cutting $15 billion from its total debt (from peak levels) a full year early. Given how critical debt management is in such a capital-intensive industry, I find this to be a significant leading indicator. By strengthening its balance sheet faster than expected, AAL puts itself in a better position to weather short-term turbulence and invest in future growth opportunities, even if concerns over a soft start to 2025 persist.</p>\n<h2 class=\"wp-block-heading\"><strong>Attractive Valuation at Temporarily Depressed Levels</strong></h2>\n<p>Although AAL’s long-term up-trend took a brief pause last week following Wall Street’s negative reaction, American Airlines’ shares are still up ~80% over the past six months. Yet, the stock looks attractively priced from a forward-looking perspective. Specifically, consensus EPS stands at $2.38 for FY2025 and $3.07 for FY2026, implying annual growth rates of 21.6% and 28.8%, respectively. At these estimates, AAL trades at a forward P/E ratio of around 7.1x for 2025 and just 5.5x for 2026.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/aal/earnings\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"300\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/AAL5-1024x300.jpg\" alt=\"\" class=\"wp-image-1702460\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/AAL5-1024x300.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL5-300x88.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL5-768x225.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL5.jpg 1224w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>To me, these ratios suggest the market is underappreciating the airline. It’s true that airlines often trade at seemingly depressed multiples due to cyclical pressures, including fuel price volatility, labor negotiations, and broader economic headwinds. Nevertheless, American Airlines expects to generate a record free cash flow of $1.90 billion this year. Along with the ongoing debt reduction, the airline has a strong foundation that warrants a modestly more optimistic valuation, in my view.</p>\n<h2 class=\"wp-block-heading\"><strong>Is American Airlines (AAL) Stock a Buy or a Sell?</strong></h2>\n<p>Despite the initial cautious reaction post-earnings, analysts seem optimistic about AAL’s investment case. Over the past three months, American Airlines has gathered 10 Buy, seven Hold, and zero Sell ratings, obtaining a Moderate Buy consensus on Wall Street. Currently,&nbsp;AAL stock carries an average price target of $21.56 per share, implying a 28% upside potential from current price levels.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/aal/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"343\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/AAL2-1024x343.jpg\" alt=\"\" class=\"wp-image-1702414\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/AAL2-1024x343.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL2-300x100.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL2-768x257.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL2.jpg 1227w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/aal/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"268\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/AAL3-1024x268.jpg\" alt=\"\" class=\"wp-image-1702416\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/AAL3-1024x268.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL3-300x79.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL3-768x201.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/AAL3.jpg 1217w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a><figcaption class=\"wp-element-caption\"><strong><a href=\"https://www.tipranks.com/stocks/aal/forecast\">See more AAL analyst ratings</a></strong></figcaption></figure>\n<p>If you haven’t yet decided which analyst you should trust to buy or sell AAL stock, the most accurate and profitable analyst covering the stock (on a one-year timeframe) is&nbsp;<a href=\"https://www.tipranks.com/experts/analysts/michael-linenberg\">Michael Linenberg from Deutsche Bank</a> <a data-ticker=\"DB\" href=\"https://www.tipranks.com/stocks/db\">(DB)</a>. He features an average return of 10.4% per rating and a 56% success rate.</p>\n<h2 class=\"wp-block-heading\"><strong>AAL Set for Uplift as Investors Rediscover Long-Term Value</strong></h2>\n<p>Despite Wall Street’s temper tantrum reaction, I see American Airlines as a stock with more fuel left in the tank. The company’s record revenues, accelerated debt reduction, and attractive valuation all point to tangible progress. While near-term challenges exist, the market’s skepticism creates an opportunity given the stock’s compelling forward multiples. </p>\n<p>With <a data-autolink=\"true\" href=\"https://www.tipranks.com/stocks/djt\">Trump</a> tariff worries also affecting sentiment and casting doubt over consumer spending, now could be the time to look beyond the short-term market noise to realize that AAL is a long-standing market performer that has weathered tougher storms. Not only is the stock likely to rejoin its long-term uptrend, but its single-digit forward multiples should offer plenty of room for maneuvering for value investors.</p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-1\">Disclosure</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/02/shutterstock_604235543-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/american-airlines-aal-stock-to-fly-in-2025-despite-wall-st-turbulence",
            "author": "Nikolaos Sismanis",
            "pub_date": "2025-02-04 18:06:10",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1698673,
            "title": "Dolby Laboratories (DLB) Forges Partnerships and Sounding Sharp for Q1 of 2025",
            "description": "<html><head></head><body><p>Audio pioneer Dolby Laboratories <a data-ticker=\"DLB\" href=\"https://www.tipranks.com/stocks/dlb\">(DLB)</a> has made significant strides recently. The company has partnered with brands such as Harmon Kardon, Samsung <a data-ticker=\"SMSN\" href=\"https://www.tipranks.com/stocks/smsn\">(SMSN)</a>, and Amazon <a data-ticker=\"AMZN\" href=\"https://www.tipranks.com/stocks/amzn\">(AMZN)</a> to incorporate Dolby technologies into their products. Dolby has made its mark in the automotive industry by working with Texas Instruments and doubling its auto manufacturer collaborations, thus introducing Dolby Atmos to more vehicles worldwide. At the recent CES (Consumer Electronics Show), the company showcased Dolby Visions thanks to a strategic partnership with Samsung Display. </p><p></p><h3 style=\"text-decoration: underline;\">Maximize Your Portfolio with Data Driven Insights:</h3><ul style=\"padding-top: 5px;\"><li>Leverage the power of <a data-link=\"article_promo\" href=\"https://www.tipranks.com/screener/top-smart-score-stocks\">TipRanks' Smart Score</a>, a data-driven tool to help you uncover top performing stocks and make informed investment decisions. </li><li>Monitor your stock picks and compare them to top Wall Street Analysts' recommendations with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\"> Your Smart Portfolio</a></li></ul><p></p>\n<p>Financially, Dolby is off to a strong start for Fiscal year 2025, exceeding top-and-bottom-line expectations. Further, Dolby provided optimistic estimates for its second quarter and full year. The stock appears reasonably priced, making it a potentially attractive option for income-seeking investors.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/dlb\"><img decoding=\"async\" loading=\"lazy\" width=\"962\" height=\"606\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-77.png\" alt=\"\" class=\"wp-image-1704200\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-77.png 962w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-77-300x189.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-77-768x484.png 768w\" sizes=\"(max-width: 962px) 100vw, 962px\"></a></figure>\n<h2 class=\"wp-block-heading\"><strong>Dolby Continues to Expand Its Lineup</strong></h2>\n<p>Dolby Laboratories is a leading provider of hardware and software products for cinema, television, broadcast, and entertainment industries, including digital cinema servers, cinema processors, and loudspeakers.</p>\n<p>The company’s offerings extend to immersive audio and video experiences with key technologies like Dolby Atmos and Dolby Vision. Dolby Laboratories has its footprint in the premium cinema space with Dolby Cinemas, which harmonize Dolby Vision, Dolby Atmos, and unique Dolby theater design. Dolby.io, its next-generation SaaS product, is aimed at interactive and immersive real-time engagement for live events, especially sports.</p>\n<h2 class=\"wp-block-heading\"><strong>Dolby Technology for Everyone</strong></h2>\n<p>Dolby Laboratories continues to expand its presence in the high-tech audio and visual market. Several top partners at the CES announced new products incorporating Dolby technology. Notably, brands such as Harmon Kardon, Samsung, Amazon, Hisense <a data-ticker=\"HISEF\" href=\"https://www.tipranks.com/stocks/hisef\">(HISEF)</a>, TCL <a data-ticker=\"TCLHF\" href=\"https://www.tipranks.com/stocks/tclhf\">(TCLHF)</a>, Panasonic <a data-ticker=\"PCRFF\" href=\"https://www.tipranks.com/stocks/pcrff\">(PCRFF)</a>, Sharp <a data-ticker=\"SHCAY\" href=\"https://www.tipranks.com/stocks/shcay\">(SHCAY)</a>, RCA, ASUS <a data-ticker=\"ASUUY\" href=\"https://www.tipranks.com/stocks/asuuy\">(ASUUY)</a>, and Dell <a data-ticker=\"DELL\" href=\"https://www.tipranks.com/stocks/dell\">(DELL)</a>, all have integrated Dolby Vision and Dolby Atmos in their new array of products. Dolby is working with Samsung Display, Texas Instruments <a data-ticker=\"TXN\" href=\"https://www.tipranks.com/stocks/txn\">(TXN)</a>, and Pioneer in the automobile sector to bring innovative technologies to more vehicles. Similarly, the social media app Xiaohongshu, known as RedNote in the U.S., and Amazon’s Fire TV Omni Mini-LED now support Dolby technology.</p>\n<p>Dolby confirms that it has doubled the number of auto manufacturers from 10 to more than 20, supporting Dolby Atmos in 2025. Partners include industry leaders such as Cadillac <a data-ticker=\"CADIF\" href=\"https://www.tipranks.com/stocks/cadif\">(CADIF)</a>, Li Auto, Mercedes-Benz <a data-ticker=\"MBGAF\" href=\"https://www.tipranks.com/stocks/mbgaf\">(MBGAF)</a>, Polestar <a data-ticker=\"PSNY\" href=\"https://www.tipranks.com/stocks/psny\">(PSNY)</a>, Rivian <a data-ticker=\"RIVN\" href=\"https://www.tipranks.com/stocks/rivn\">(RIVN)</a>, Volvo Cars <a data-ticker=\"VLVLY\" href=\"https://www.tipranks.com/stocks/vlvly\">(VLVLY)</a>, and Sony Honda <a data-ticker=\"SONY\" href=\"https://www.tipranks.com/stocks/sony\">(SONY)</a> Mobility. These collaborations have resulted in new vehicles featuring Dolby Atmos, as seen in the 2025 Cadillac OPTIQ’s 19-speaker AKG audio system. Dolby also works with automotive SoC and DSP suppliers like Analog Devices, Inc. <a data-ticker=\"ADI\" href=\"https://www.tipranks.com/stocks/adi\">(ADI)</a>, MediaTek, NXP Semiconductors <a data-ticker=\"NXPI\" href=\"https://www.tipranks.com/stocks/nxpi\">(NXPI)</a>, and Texas Instruments to expand its audio technologies into more cars.</p>\n<h2 class=\"wp-block-heading\"><strong>Robust Financial Growth</strong></h2>\n<p>Dolby Laboratories experienced robust growth in FY25’s first quarter, with<a href=\"https://www.tipranks.com/stocks/dlb/financials\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/dlb/financials\"> total revenue reaching $357 million</a>, a substantial increase from the prior year’s $316 million. The company reported GAAP net income of $68 million, or $0.70 per diluted share, representing a slight step up from FY24’s first quarter GAAP net income of $67 million, or $0.69 per diluted share. Non-GAAP net income measured at $111 million or <a href=\"https://www.tipranks.com/stocks/dlb/earnings\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/dlb/earnings\">$1.14 per diluted share</a>, compared to the previous year’s $99 million, or $1.01 per diluted share.</p>\n<p>Dolby announced <a href=\"https://www.tipranks.com/stocks/dlb/dividends\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/dlb/dividends\">a cash dividend of $0.33 per share</a> to be paid on February 19, 2025, to stockholders on record as of February 11, 2025.</p>\n<p>Looking ahead, Dolby forecasts second-quarter Fiscal 2025 revenues to range between $355 million and $385 million. GAAP gross margins are projected to be around 89%, while non-GAAP figures are estimated at roughly 91%. For the full fiscal year 2025, Dolby anticipates total revenue to land between $1.33 billion and $1.39 billion. GAAP and non-GAAP gross margins are projected at approximately 87% and 90%, respectively, with operating expenses expected to range from $915 million to $925 million on a GAAP basis and from $765 million to $775 million on a non-GAAP basis. Diluted earnings per share are anticipated to vary from $2.39 to $2.54 on a GAAP basis and from $3.99 to $4.14 on a non-GAAP basis.</p>\n<h2 class=\"wp-block-heading\"><strong>Analysts Are Bullish</strong></h2>\n<p>The stock has been upward, climbing over 14.50% in the past three months. It trades near the high end of its 52-week price range of $66.35 – $85.30 and shows ongoing positive price momentum as it trades above the <a href=\"https://www.tipranks.com/stocks/dlb/technical-analysis\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/dlb/technical-analysis\">major moving averages</a>. It trades at a relatively reasonable price, based on its P/E ratio of 21.31x compared to the Information Technology sector average of 25.18x.</p>\n<p>Analysts following the company have been bullish on the stock. &nbsp;Based on the recent recommendations of two analysts, Dolby Laboratories is rated a moderate buy overall. The <a href=\"https://www.tipranks.com/stocks/dlb/forecast\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/dlb/forecast\">average price target for DLB stock is $100.00</a>, representing a potential upside of 18.85% from current levels.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/dlb/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"908\" height=\"579\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-78.png\" alt=\"\" class=\"wp-image-1704202\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-78.png 908w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-78-300x191.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-78-768x490.png 768w\" sizes=\"(max-width: 908px) 100vw, 908px\"></a></figure>\n<p><strong><a href=\"https://www.tipranks.com/stocks/dlb/forecast\">See more DLB analyst ratings</a></strong></p>\n<h2 class=\"wp-block-heading\"><strong>Bottom Line on Dolby Laboratories</strong></h2>\n<p>Dolby Laboratories has grown substantially, establishing strong partnerships with major brands and expanding its influence in the automotive industry. This progress has primarily been driven by successfully integrating its technologies into a wide range of products. With the company’s robust financial performance exceeding expectations for FY 2025’s first quarter and advantageous projections for the upcoming year, DLB stock appears a promising option for investors seeking income.</p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-1\">Disclosure</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/02/DLB-Image-2-750x406.jpg",
            "link": "https://www.tipranks.com/news/dolby-laboratories-dlb-forges-partnerships-and-sounding-sharp-for-q1-of-2025",
            "author": "Casey Dylan, CIMA",
            "pub_date": "2025-02-04 17:22:52",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1698652,
            "title": "Why Virtu Financial (VIRT) Deserves Your Attention",
            "description": "<html><head></head><body><p>Virtu Financial <a data-ticker=\"VIRT\" href=\"https://www.tipranks.com/stocks/virt\">(VIRT)</a>, a leading market-making and liquidity services provider, reported significant growth, beating top-and-bottom-line expectations for the fourth quarter. Virtu has also been expanding its footprint in the <a data-autolink=\"true\" href=\"https://www.tipranks.com/cryptocurrency\">cryptocurrency</a> sector, optimistically looking forward to new regulatory tailwinds in 2025. The stock is up over 155% in the past year and shows no signs of slowing. In addition to the strong financial results, Virtu’s dividend yield of roughly 2.5% and attractive valuation make it a potentially attractive target for value-oriented income investors.</p><p></p><h3 style=\"text-decoration: underline;\">Maximize Your Portfolio with Data Driven Insights:</h3><ul style=\"padding-top: 5px;\"><li>Leverage the power of <a data-link=\"article_promo\" href=\"https://www.tipranks.com/screener/top-smart-score-stocks\">TipRanks' Smart Score</a>, a data-driven tool to help you uncover top performing stocks and make informed investment decisions. </li><li>Monitor your stock picks and compare them to top Wall Street Analysts' recommendations with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\"> Your Smart Portfolio</a></li></ul><p></p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/virt\"><img decoding=\"async\" loading=\"lazy\" width=\"966\" height=\"605\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-75.png\" alt=\"\" class=\"wp-image-1703895\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-75.png 966w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-75-300x188.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-75-768x481.png 768w\" sizes=\"(max-width: 966px) 100vw, 966px\"></a></figure>\n<h2 class=\"wp-block-heading\"><strong>An Award Winning Service Provider</strong></h2>\n<p>Using advanced technology, Virtu provides market-making and trading solutions infrastructure to provide liquidity for financial services. Clients utilizing Virtu’s services can trade on hundreds of venues across more than 50 countries, spanning various asset classes such as global equities, ETFs, foreign exchange, futures, fixed income, and a wide array of commodities. Furthermore, Virtu boasts an integrated, multi-asset analytics platform, offering pre and post-trade services, data products, and compliance tools.</p>\n<p>The company has reported strong results for its recent <a data-autolink=\"true\" href=\"https://www.tipranks.com/cryptocurrency\">crypto</a> growth initiative despite market volumes and spot crypto <a data-autolink=\"true\" href=\"https://www.tipranks.com/etf\">ETFs</a> being down by almost 20% compared to Q1 of 2024. This success has been attributed mainly to the investments in its crypto capabilities during the second and third quarters of the year. Virtu’s strategy to expand its global crypto footprint was instrumental in capturing significant opportunities in the fourth quarter.</p>\n<p>In addition to the crypto initiative, Virtu plans to enhance its ETF block offering further to attract more clients and distribute liquidity more broadly. The company believes regulatory changes in 2025 will present another expansion opportunity for Virtu’s market-making and execution services.</p>\n<p>Virtu has recently been recognized with multiple accolades at The TRADE Leaders in Trading Awards, including Best Access to Market and Best Dark Pool Capabilities. The company’s broker-neutral, multi-asset-class execution management system, Virtu Triton EMS, received recognition for its user experience, adaptability, and service for large clients in the UK and Europe.</p>\n<h2 class=\"wp-block-heading\"><strong>Impressive Top-and-Bottom-line Growth</strong></h2>\n<p>The company recently posted impressive fourth-quarter financial results. <a href=\"https://www.tipranks.com/stocks/virt/financials\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/virt/financials\">Revenue grew by 55.7% year-over-year to $834.3 million</a>. Trading income increased by 104%, bringing the total to $544 million. The net income for the quarter was $176.1 million, a marked improvement from the $6.7 million net income of the previous year. This resulted in <a href=\"https://www.tipranks.com/stocks/virt/earnings\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/virt/earnings\">earnings per share (EPS) of $1.14</a>, which beat consensus projections by $0.25.</p>\n<p>For the full Fiscal year of 2024, total revenue increased by 25.4% to $2.876 billion, compared to $2.293 billion for 2023. Trading income rose by 40.0%, totaling $1.822 billion. The year’s net income was $534.5 million, compared to $263.9 million for 2023. This led to basic and diluted earnings per share of $2.98 and $2.97, respectively, a considerable increase from the $1.42 earnings per share of 2023.</p>\n<p>As of the end of 2024, the company reported $914.0 million in cash, cash equivalents, and restricted cash. The outstanding total long-term debt was reported to be $1.767 billion.</p>\n<p>The company announced <a href=\"https://www.tipranks.com/stocks/virt/dividends\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/virt/dividends\">a quarterly dividend of $0.24 per share</a>, equating to a forward yield of 2.47%, payable on March 17 to shareholders of record as of January 28.</p>\n<h2 class=\"wp-block-heading\"><strong>Wall Street Remains Cautiously Optimistic</strong></h2>\n<p>The stock has continued its upward trajectory, climbing over 12.25% in 2025. It trades at the top of its 52-week price range of $16.02 – $39.60 and demonstrates ongoing positive price momentum by trading above the <a href=\"https://www.tipranks.com/stocks/virt/technical-analysis\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/virt/technical-analysis\">major moving averages</a>. Yet, despite the growth in share price, it continues to appear relatively attractively valued based on its P/S ratio of 1.58x versus the Financials sector average of 3.18x.</p>\n<p>Analysts following the company have been cautiously optimistic about VIRT stock. For example, Piper Sandler’s <a href=\"https://www.tipranks.com/experts/analysts/patrick-moley\">Patrick Moley</a>, a five-star analyst according to Tipranks’ ratings, recently reiterated an Overweight rating on the shares and raised the price target to $40 (from $35), noting a more relaxed regulatory outlook for 2025, as well as a lower potential rate environment, further emboldening trading activity.</p>\n<p>Virtu Financial is rated a Moderate Buy overall, based on the recent recommendations of nine analysts. Their <a href=\"https://www.tipranks.com/stocks/virt/forecast\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/virt/forecast\">12-month average price target for VIRT stock is $38.13</a>, representing a potential downside of -4.32% from current levels.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/virt/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"903\" height=\"690\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-76.png\" alt=\"\" class=\"wp-image-1704062\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-76.png 903w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-76-300x229.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-76-768x587.png 768w\" sizes=\"(max-width: 903px) 100vw, 903px\"></a></figure>\n<h2 class=\"wp-block-heading\"><strong>Bottom Line on VIRT Stock</strong></h2>\n<p>Virtu Financial has showcased strong growth while beating top-and-bottom-line expectations for Q4. Notably, its investments in crypto offerings have paid off, even against a backdrop of market volumes and spot crypto ETFs dipping. With a foot in crypto and other financial services, Virtu Financial is geared to offer more than just market-making and liquidity services. The company’s technological prowess, financial performance, and forward-thinking strategy suggest ongoing growth potential into the foreseeable future. Given its upside potential, solid dividend yield, and attractive valuation, VIRT may be an appealing option for value-oriented income investors.</p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-1\">Disclosure</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/02/VIRT-Image-2-750x406.jpg",
            "link": "https://www.tipranks.com/news/why-virtu-financial-virt-deserves-your-attention",
            "author": "Casey Dylan, CIMA",
            "pub_date": "2025-02-04 17:06:56",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1698155,
            "title": "Cloud Slowdown Cannot Tame Microsoft (MSFT) Stock Bulls",
            "description": "<html><head></head><body><p>The question on investors’ lips following Microsoft’s <a data-ticker=\"MSFT\" href=\"https://www.tipranks.com/stocks/msft\">(MSFT)</a> earnings call last week is: are substantial capital investments in <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> infrastructure justified when growth and margins don’t reflect improvements?</p><p></p><h3 style=\"text-decoration: underline;\">Maximize Your Portfolio with Data Driven Insights:</h3><ul style=\"padding-top: 5px;\"><li>Leverage the power of <a data-link=\"article_promo\" href=\"https://www.tipranks.com/screener/top-smart-score-stocks\">TipRanks' Smart Score</a> a data driven tool to help you uncover top performing stocks and make informed investment decisions. </li><li>Monitor your stock picks and compare them to top Wall Street Analysts' recommendations with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\"> Your Smart Portfolio</a></li></ul><p></p>\n<p>Although I’m a long-term bull and reiterate my optimistic stance following the tech giant’s results, the stock has been in limbo over the past six months. Some impatient investors have abandoned ship, struggling to acquiesce to the narrative that Microsoft’s market performance and investment cases are compelling.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/msft\"><img decoding=\"async\" loading=\"lazy\" width=\"793\" height=\"623\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT.jpg\" alt=\"\" class=\"wp-image-1699318\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT.jpg 793w, https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT-300x236.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT-768x603.jpg 768w\" sizes=\"(max-width: 793px) 100vw, 793px\"></a></figure>\n<p>Overall, I view <a href=\"https://www.tipranks.com/news/microsoft-msft-loses-200b-in-market-value-after-cloud-unit-disappoints\">MSFT’s earnings results from last week with optimism</a>, given the company is backed by strong commercial bookings and sustained demand for AI services. Given the robust revenue growth and margins, I believe these ongoing investments are enough to support a long-term bullish outlook on Microsoft, which boasts some of the best-in-class business fundamentals of any sector.</p>\n<h2 class=\"wp-block-heading\">Another Strong Quarter for Microsoft</h2>\n<p>Overall, my bullishness on Microsoft remains firm after another solid quarter was reported, which marked the tenth consecutive earnings beat. <a href=\"https://www.tipranks.com/news/msft-earnings-microsoft-stock-falls-on-weak-cloud-computing-growth\">Microsoft delivered EPS of $3.23</a> when Wall Street was expecting $3.11.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/msft/earnings\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"725\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/Image-01-02-25-at-16.06-1024x725.jpeg\" alt=\"\" class=\"wp-image-1698156\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/Image-01-02-25-at-16.06-1024x725.jpeg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/Image-01-02-25-at-16.06-300x212.jpeg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/Image-01-02-25-at-16.06-768x544.jpeg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/Image-01-02-25-at-16.06.jpeg 1322w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>Additionally, Microsoft reported revenues of $69.9 billion, up 12% year-over-year and $823 million above the consensus estimate. Based on its three segments, the one that grew the most was the Intelligent Cloud business, which jumped 19%. In the consolidated results, gross margins reached 69%—arguably one of the best gross margins among any businesses in the world—while Microsoft’s operating profit margin jumped to 45% with a total operating income of $31.7 billion. Again, very few businesses can boast such sturdy results.</p>\n<p>On the operational side, Microsoft reported commercial booking revenues grew year-over-year by 67% in FYQ2. Even with seemingly rock-solid numbers, it wasn’t enough to please the markets, as MSFT stock shed ~6% post-earnings.</p>\n<h2 class=\"wp-block-heading\">What Matters Most for MSFT</h2>\n<p>Arguably, a great chunk of Microsoft’s 31.5x forward earnings multiple is directly related to its progress with AI implementation, particularly in its most profitable segment today—the cloud business. The Intelligent Cloud segment has been one of the main drivers of the almost 75% share price appreciation over the last two years.</p>\n<p>However, the big reason for skepticism after Microsoft’s results was precisely two key issues regarding the cloud business. The first was that revenue growth from Azure and other cloud services fell from 33% in FYQ1 to 31% in FYQ2. The second point was that the guidance for FYQ3 was for growth between 31% and 32%, still below what MSFT recorded two quarters ago.</p>\n<p>According to Microsoft’s management team, the explanation for this has nothing to do with weakening demand for AI services but rather two factors: (1) challenges in non-AI components, where companies are trying to balance the migration of their work with adopting AI workloads. There is a challenge in adjusting investments, and this process often takes time and impacts results; and (2) the capacity limit affecting the performance of the segment, which still needs more infrastructure to sustain growth—even though the long-term infrastructure investments made in recent years are still not enough.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/msft/financials/income-statement\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"394\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT5-1024x394.jpg\" alt=\"\" class=\"wp-image-1699358\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT5-1024x394.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT5-300x115.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT5-768x295.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT5.jpg 1233w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>The other topic of concern was Microsoft Cloud margins. The outlook for FYQ3 implies margins of 69%, which would be the lowest margins since FYQ2 2024. It’s worth noting that in FYQ1, the cloud division’s gross margins had already fallen quarter-over-quarter from 73% to 71%, and now, in FYQ2, margins were at 70%. </p>\n<p>Management argues that the margin drop correlates with the impact of scaling the AI infrastructure. However, the reality is that investors were disappointed to see $22.6 billion in capital expenditure supporting AI initiatives in the three months when margins and growth rates have been impacted. Even though the funding comes from free cash flow (which also fell 29% year-over-year thanks to these AI spendings) and not from extra debt.</p>\n<h2 class=\"wp-block-heading\">Rising RPOs and Bookings Back Ongoing AI Investment</h2>\n<p>Contributing to my bullish thesis on Microsoft, although the cloud results show an inevitable slowdown, I’m still very encouraged by the overall context. The company has been spending on developing its business clearly because it is seeing a customer response. This is quite evident when we look at the remaining commercial performance obligations (RPO), which are currently soaring, partly due to AI.</p>\n<p><span style=\"box-sizing: border-box; margin: 0px; padding: 0px;\">Microsoft’s RPOs are currently at $298 </span>billion, an&nbsp;increase of&nbsp;$39 billion from FYQ1 and about $76 million higher compared to last year, showing very robust rates of increase. So, we see tangible results in RPOs which supports the case for continued investment in AI infrastructure.</p>\n<h2 class=\"wp-block-heading\">Is Microsoft a Buy, Hold, or Sell?</h2>\n<p>Although Microsoft’s earnings report displeased the market, the bullish consensus prevails.</p>\n<p>On TipRanks, the stock carries a Strong Buy consensus rating based on 28 Buy, three Hold, and zero Sell ratings over the past three months. Notably, not a single analyst rates MSFT as a Sell despite last week’s earnings call stumble. Currently, MSFT’s average price target of $508.68 per share implies a 22.5% upside potential from current levels.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/msft/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"351\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT2-1024x351.jpg\" alt=\"\" class=\"wp-image-1699329\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT2-1024x351.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT2-300x103.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT2-768x263.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT2.jpg 1237w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/msft/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"268\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT3-1024x268.jpg\" alt=\"\" class=\"wp-image-1699330\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT3-1024x268.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT3-300x79.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT3-768x201.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/MSFT3.jpg 1229w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a><figcaption class=\"wp-element-caption\"><strong><a href=\"https://www.tipranks.com/stocks/msft/forecast\">See more MSFT analyst ratings</a></strong></figcaption></figure>\n<p>It’s worth noting that although there were no downgrades, there were four price target trims, the most significant of which came from Wolfe Research analyst <a href=\"https://www.tipranks.com/experts/analysts/alex-zukin\">Alex Zukin</a>, who downgraded his price target from the previous $515 to $475. According to the analyst, he points out that Microsoft shares “are likely range bound until such time as either execution or capacity improves.”</p>\n<h2 class=\"wp-block-heading\">MSFT Continues to Offer Superb Exposure to the Tech Market</h2>\n<p>Microsoft’s quarterly results showed that the company struggled to sustain its high revenue growth rates and margins, particularly in the cloud. However, most of these challenges were unrelated to demand, which, in my view, is key to supporting the case for continued infrastructure investments. This demand is clearly demonstrated by the solid growth in RPOs. </p>\n<p>As a result, short-term market skepticism seems misplaced, and a long-term buy-and-hold strategy appears to be the more reasonable approach for Microsoft stock. Moreover, MSFT is still trading at a 7% discount in early trade this week, making this tech giant a strong buy-the-dip contender in early 2025.</p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-2\">Disclosure</a></p>\n<p><a href=\"https://www.tipranks.com/legal/disclaimer\">Disclaimer</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/02/shutterstock_2550404749-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/cloud-slowdown-cannot-tame-microsoft-msft-stock-bulls",
            "author": "Bernard Zambonin",
            "pub_date": "2025-02-03 17:52:59",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1692408,
            "title": "Quantum Computing Heats Up But is IONQ Stock Overcooked?",
            "description": "<html><head></head><body><p>Investors are always on the lookout for the next big thing, and following the success of <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> in recent years, it’s no surprise to see stocks in the <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/quantum-computing\">quantum computing</a> space soaring. IonQ <a data-ticker=\"IONQ\" href=\"https://www.tipranks.com/stocks/ionq\">(IONQ)</a> has emerged as one of the frontrunners in the space, but I fear that realizing sustainable profits is still a long way off for this quantum computing specialist.</p><div><h3 style=\"text-decoration: underline;\">Maximize Your Portfolio with Data Driven Insights:</h3><ul><li>Leverage the power of <a data-link=\"article_promo\" href=\"https://www.tipranks.com/screener/top-smart-score-stocks\">TipRanks' Smart Score</a> a data driven tool to help you uncover top performing stocks and make informed investment decisions. </li><li>Monitor your stock picks and compare them to top Wall Street Analysts' recommendations with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\"> Your Smart Portfolio</a></li></ul></div>\n<p>While the company’s trapped-ion technology is often considered a significant improvement from superconductors, there is still plenty of uncertainty to iron out, meaning that the lofty valuation is precariously poised. I’m optimistic that the technology can lead to meaningful success in the long term, but for now, I’m bearish, mainly on the thesis that the&nbsp;285%&nbsp;surge over the past year is rather excessive and that bullish investor sentiment is overcooked.</p>\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><a href=\"https://www.tipranks.com/stocks/ionq\"><img decoding=\"async\" loading=\"lazy\" width=\"791\" height=\"624\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ.jpg\" alt=\"\" class=\"wp-image-1698165\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ.jpg 791w, https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ-300x237.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ-768x606.jpg 768w\" sizes=\"(max-width: 791px) 100vw, 791px\"></a></figure></div>\n<h2 class=\"wp-block-heading\">Is IonQ’s Business Model Sufficient?</h2>\n<p>While quantum computing has been around for a few years, there are still only a handful of publicly traded companies. Unlike the computers we currently use daily, quantum computing leverages a concept called qubits, which can exist in multiple states simultaneously. This complex but incredibly exciting idea enables a range of performance improvements exponentially faster than current capabilities. IonQ differentiates itself from others with trapped-ion technology, which theoretically enables a further range of complex improvements, including longer coherence times (how long the computation can operate) and improved qubit connectivity (the ability for the technology to talk to itself while processing).</p>\n<p>Competition in the space is naturally fierce, with mega-caps such as Google <a data-ticker=\"GOOGL\" href=\"https://www.tipranks.com/stocks/googl\">(GOOGL)</a> and IBM <a data-ticker=\"IBM\" href=\"https://www.tipranks.com/stocks/ibm\">(IBM)</a> looking to build out capabilities alongside more nimble start-ups such as Rigetti Computing <a data-ticker=\"RGTI\" href=\"https://www.tipranks.com/stocks/rgti\">(RGTI)</a> and D-Wave Systems <a data-ticker=\"QBITS\" href=\"https://www.tipranks.com/stocks/qbits\">(QBITS)</a>. Of course, this battle could dominate the market for years as technology advances, but breakthroughs are notoriously unpredictable and require enormous resources. </p>\n<p>IBM and Google have demonstrated some capabilities in quantum error correction, which looks to minimize the number of errors conducted in processing. IonQ is still somewhat untested in this area, and with one eye on practical execution at commercial levels, investors will want to see proof that trapped-ion systems are indeed the way forward.</p>\n<h2 class=\"wp-block-heading\">IonQ’s Financial Sustainability Puts Valuation into Doubt</h2>\n<p>Despite being one of the larger companies in the space, at a market cap of $8.4 billion, a look at the balance sheet shows it is a long way from profits. Management has secured some impressive contracts in the last few years, including a $54.4 million USAF Research Lab deal, but this does not come cheaply, with operating costs rising 36% in the last year, now at $65.5 million. This has led to a <a href=\"https://www.tipranks.com/stocks/ionq/earnings\">net loss of $54.5 million in Q3</a>, significantly worse than the $44.8 million Q3 loss in the previous year. While losses are to be expected with emerging technology, especially in the initial stages, investors will be looking for signs that the technology has some earnings potential at scale rather than just being an experiment for several companies. </p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/ionq/earnings\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"251\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1408-1024x251.png\" alt=\"\" class=\"wp-image-1697355\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1408-1024x251.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1408-300x74.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1408-768x189.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1408.png 1181w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>The company holds some decent cash reserves at $36 million, far outweighing the debt of just under $4 million, but I’d be keeping an eye on the burn rate of the business, which could eventually lead to share dilution as more financing is required. This has been significant in previous years and could potentially be a major barrier to investor confidence, with shares losing value with each dilution.</p>\n<h2 class=\"wp-block-heading\">IonQ Risks Exceed Shareholder Rewards</h2>\n<p>There are many technical barriers to be overcome before IonQ’s technology becomes commercially viable at scale. High error rates and difficulty maintaining coherence make commercialization a much longer-term objective, with developing prototypes and proofs-of-concept far more likely to be at the center of management’s mind. Nvidia CEO Jensen Huang recently poured cold water on the excitement at CES, stating that <em>“</em>useful quantum computers may still be 20–30 years away.” While some argue that this is an exaggeration, from an investor perspective, with uncertain revenues, likely dilution, and high cash burn, there are plenty of reasons to be concerned. </p>\n<p><span style=\"box-sizing: border-box; margin: 0px; padding: 0px;\">In current market conditions,&nbsp;<a href=\"https://www.tipranks.com/stocks/ionq/similar-stocks\" target=\"_blank\" rel=\"noopener\">IonQ has multiple market peers</a></span>,&nbsp;including firms with larger balance sheets and greater resources that could quickly mop up market share. IonQ has made some interesting acquisitions to develop a reputation as a leader in the sector, with a wide range of patents and advanced technology. However, whether this is enough to take on the giants of the tech space remains to be seen.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/ionq/similar-stocks\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"334\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1410-1024x334.png\" alt=\"\" class=\"wp-image-1697376\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1410-1024x334.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1410-300x98.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1410-768x251.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1410.png 1182w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<h2 class=\"wp-block-heading\">Is IonQ Stock a Buy?</h2>\n<p>After a 300% rally, it’s no surprise that many analysts remain cautious about the next few quarters. Many insiders and cautious investors will be tempted to trim their positions after such a run, especially considering the valuation concern. </p>\n<p>Despite the company’s various risks, Wall Street is optimistic about IONQ stock. On TipRanks, the stock carries a Moderate Buy consensus rating based on four Buy, two Hold, and zero Sell ratings over the past three months. Notably, not a single analyst rates IONQ as a Sell.</p>\n<p>Currently, IonQ carries an average price target of $44.20 per share, implying a 12% upside potential from current levels.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/ionq/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"421\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ2-1024x421.jpg\" alt=\"\" class=\"wp-image-1698175\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ2-1024x421.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ2-300x123.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ2-768x316.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ2.jpg 1271w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/ionq/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"272\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ3-1024x272.jpg\" alt=\"\" class=\"wp-image-1698176\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ3-1024x272.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ3-300x80.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ3-768x204.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/IONQ3.jpg 1222w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a><figcaption class=\"wp-element-caption\"><strong><a href=\"https://www.tipranks.com/stocks/ionq/forecast\">See more IONQ analyst ratings</a></strong></figcaption></figure>\n<h2 class=\"wp-block-heading\">IonQ is Overpriced and Underisked</h2>\n<p>IonQ is undoubtedly an exciting company at the forefront of some amazing technology, but with no clear path to profitability, an uncertain timeline, and a high valuation, it feels too risky a bet for me at current levels.</p>\n<p>The quantum computing potential is vast, but until management can demonstrate its ability to commercialize its products at scale, I’m apprehensive about initiating a long position in IonQ stock after such an extended bull run. I’ll be keeping a watchful eye on how quantum computing develops, intending to bet on a particular horse further into the race. As a reasonably cautious investor, I consider investing in embryonic sectors with any significant weight unwise. I rate this quantum computing pioneer as a Hold until I see more meat on the bone of its market strategy over the coming quarters.</p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/02/shutterstock_1228219351-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/quantum-computing-heats-up-but-is-ionq-stock-overcooked",
            "author": "Gordon Best",
            "pub_date": "2025-02-03 17:28:22",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1699790,
            "title": "Ex-Dividend Date Nearing for These 10 Stocks – Week of February 3, 2025",
            "description": "<html><head></head><body><p>This week, several&nbsp;<a href=\"https://www.tipranks.com/compare-stocks/dividend-stocks\">dividend stocks</a>&nbsp;are trading close to their 52-week lows. Here is a list of ten such stocks that are also reaching their ex-dividend dates this week. To become eligible for the next payout, investors will have to buy these stocks before their ex-dividend dates arrive.</p><div><h3 style=\"text-decoration: underline;\">Maximize Your Portfolio with Data Driven Insights:</h3><ul><li>Leverage the power of <a data-link=\"article_promo\" href=\"https://www.tipranks.com/screener/top-smart-score-stocks\">TipRanks' Smart Score</a> a data driven tool to help you uncover top performing stocks and make informed investment decisions. </li><li>Monitor your stock picks and compare them to top Wall Street Analysts' recommendations with <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\"> Your Smart Portfolio</a></li></ul></div>\n<p>You can buy them at a discounted price now, and benefit from their dividend payouts later. See TipRanks’&nbsp;<a href=\"https://www.tipranks.com/calendars/dividends/2024-11-25\">Dividend Calendar</a>&nbsp;for the full scope of information about dividends and payment dates.</p>\n<p>Here is this week’s list: <a data-ticker=\"DMLP\" href=\"https://www.tipranks.com/stocks/dmlp\">(DMLP)</a>, <a data-ticker=\"NVEC\" href=\"https://www.tipranks.com/stocks/nvec\">(NVEC)</a>, <a data-ticker=\"O\" href=\"https://www.tipranks.com/stocks/o\">(O)</a>, <a data-ticker=\"BPRN\" href=\"https://www.tipranks.com/stocks/bprn\">(BPRN)</a>, <a data-ticker=\"SLB\" href=\"https://www.tipranks.com/stocks/slb\">(SLB)</a>, <a data-ticker=\"FUL\" href=\"https://www.tipranks.com/stocks/ful\">(FUL)</a>, <a data-ticker=\"ARTNA\" href=\"https://www.tipranks.com/stocks/artna\">(ARTNA)</a>, <a data-ticker=\"AWK\" href=\"https://www.tipranks.com/stocks/awk\">(AWK)</a>, <a data-ticker=\"STZ\" href=\"https://www.tipranks.com/stocks/stz\">(STZ)</a>, <a data-ticker=\"PKOH\" href=\"https://www.tipranks.com/stocks/pkoh\">(PKOH)</a></p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://blog.tipranks.com/wp-content/uploads/2025/02/Exdiv2.3-1.png\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"1024\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/Exdiv2.3-1-1024x1024.png\" alt=\"\" class=\"wp-image-1699792\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/Exdiv2.3-1-1024x1024.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/Exdiv2.3-1-300x300.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/Exdiv2.3-1-150x150.png 150w, https://blog.tipranks.com/wp-content/uploads/2025/02/Exdiv2.3-1-768x768.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/Exdiv2.3-1-1536x1536.png 1536w, https://blog.tipranks.com/wp-content/uploads/2025/02/Exdiv2.3-1-188x188.png 188w, https://blog.tipranks.com/wp-content/uploads/2025/02/Exdiv2.3-1.png 1800w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/02/shutterstock_2556040323-750x406.jpg",
            "link": "https://www.tipranks.com/news/ex-dividend-date-nearing-for-these-10-stocks-week-of-february-3-2025",
            "author": "Gilan Miller-Gertz",
            "pub_date": "2025-02-03 16:54:44",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1628107,
            "title": "Intel (NASDAQ:INTC) Gears Up For CES",
            "description": "<html><head></head><body><p>For those not familiar, next week will play host to one of the greatest gadget bacchanals on the face of the Earth: the Consumer Electronics Show (CES). And this annual event in Las Vegas brings with it a look at all manner of new and exciting gadgets. Chip stock Intel <a data-ticker=\"INTC\" href=\"https://www.tipranks.com/stocks/intc\">(INTC)</a> will be there, and it is already preparing to go toe to toe with rival Advanced Micro Devices <a data-ticker=\"AMD\" href=\"https://www.tipranks.com/stocks/amd\">(AMD)</a>. Investors are impressed, and Intel picked up nearly 2% in Friday afternoon’s trading.</p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<p>The word from<em> PC World</em> says that, for Intel, it will be all about Arrow Lake, which will be exhibited pretty much right alongside AMD’s Strix Halo lineup. More specifically, Intel will be showing off the new Core H line, as well as the Core HX lineup for gaming laptops, a particular thrill for PC gamers everywhere.</p>\n<p>However, Intel will have a serious fight on its hands as AMD’s lineup includes not only the Strix Halo, but also the latest versions of the Ryzen 9000X3D processors as well. And, there is even some word that Qualcomm <a data-ticker=\"QCOM\" href=\"https://www.tipranks.com/stocks/qcom\">(QCOM)</a> may have <a href=\"https://www.tipranks.com/news/qualcomms-qcom-strategic-moves-and-legal-battle-in-the-face-of-an-ai-era\">something to show</a> at the big event; there is not much advance word about this one, but it is a safe bet that it will have something to show off somewhere at CES.</p>\n<h2 class=\"wp-block-heading\"><strong>Rising Popularity at AMD</strong></h2>\n<p>What also will be little help to Intel is that chip buyers are increasingly turning their attention to AMD. A survey from Steam, detailed at <em>Tweaktown</em>, revealed that AMD is “poaching buyers from Intel.” In fact, the survey noted, AMD silicon is now found in 38.73% of Steam PCs. Considering that, back in October, AMD was only 33.77% of the field, that should give Intel serious pause.</p>\n<p>The biggest reason, the report notes, is that Intel’s <a href=\"https://www.tipranks.com/news/intel-nasdaqintc-augments-lg-laptops-faces-challenges\">constant issues with desktop processors</a> are coming back to haunt it, and in a very big way. Between the “erosion of faith” caused by faulty processors, and the very real potential of more such problems hitting later, the end result is that users simply trust Intel hardware less than they used to, and are making buying decisions accordingly.</p>\n<h2 class=\"wp-block-heading\"><strong>Is Intel a Buy, Hold or Sell?</strong></h2>\n<p>Turning to Wall Street, analysts have a Hold consensus rating on INTC stock based on one Buy, 21 Holds and five Sells assigned in the past three months, as indicated by the graphic below. After a 55.46% <a href=\"https://www.tipranks.com/stocks/intc\">loss in its share price</a> over the past year, the <a href=\"https://www.tipranks.com/stocks/intc/forecast\">average INTC price target</a> of $24.53 per share implies 19.43% upside potential.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/intc/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"775\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/Screenshot-2025-01-03-at-15-00-50-Intel-INTC-Stock-Forecast-Price-Targets-and-Analysts-Predictions-1024x775.png\" alt=\"\" class=\"wp-image-1628128\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/Screenshot-2025-01-03-at-15-00-50-Intel-INTC-Stock-Forecast-Price-Targets-and-Analysts-Predictions-1024x775.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/Screenshot-2025-01-03-at-15-00-50-Intel-INTC-Stock-Forecast-Price-Targets-and-Analysts-Predictions-300x227.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/Screenshot-2025-01-03-at-15-00-50-Intel-INTC-Stock-Forecast-Price-Targets-and-Analysts-Predictions-768x581.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/Screenshot-2025-01-03-at-15-00-50-Intel-INTC-Stock-Forecast-Price-Targets-and-Analysts-Predictions.png 1535w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p><a href=\"https://www.tipranks.com/stocks/intc/forecast\"><strong>See more INTC analyst ratings</strong></a></p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-1\" target=\"_blank\" rel=\"noreferrer noopener\">Disclosure</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/01/intel-shutterstock_2396877947-750x406.jpg",
            "link": "https://www.tipranks.com/news/global-markets/intel-nasdaqintc-gears-up-for-ces",
            "author": "Steve Anderson",
            "pub_date": "2025-01-04 04:03:59",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1698151,
            "title": "SiriusXM Surges with Strong Q4 Earnings and Strategic Partnerships",
            "description": "<html><head></head><body><p>Sirius XM Holdings <a data-ticker=\"SIRI\" href=\"https://www.tipranks.com/stocks/siri\">(SIRI)</a> beat top-and-bottom-line expectations by reporting strong performance in Q4 of 2024 with $2.19 billion in quarterly revenue and $8.7 billion for the entire year. The company’s growth was fueled by subscriber acquisition and churn metrics improvements, largely due to enhanced automotive trials and new partnerships with Tesla <a data-ticker=\"TSLA\" href=\"https://www.tipranks.com/stocks/tsla\">(TSLA)</a> and Rivian <a data-ticker=\"RIVN\" href=\"https://www.tipranks.com/stocks/rivn\">(RIVN)</a>. Even though the satellite radio market isn’t growing significantly, SiriusXM continues reducing operating expenses and capital expenditures, which has resulted in notable earnings growth. </p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<p>The stock trades at a discount, making it a potentially attractive option for value-oriented investors, which is likely why Warren Buffett’s Berkshire Hathaway ($BRK.A) ($BRK.B) is among its largest shareholders.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/siri\"><img decoding=\"async\" loading=\"lazy\" width=\"697\" height=\"396\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/SIRI-Stock-Chart-2-2-25.png\" alt=\"\" class=\"wp-image-1698152\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/SIRI-Stock-Chart-2-2-25.png 697w, https://blog.tipranks.com/wp-content/uploads/2025/02/SIRI-Stock-Chart-2-2-25-300x170.png 300w\" sizes=\"(max-width: 697px) 100vw, 697px\"></a></figure>\n<h2 class=\"wp-block-heading\"><strong>An Updated Strategic Plan</strong></h2>\n<p>SiriusXM is a major player in the North American audio entertainment sector and has a diverse range of products. At its core, it offers a flagship subscription-based entertainment service alongside ad-supported and premium music streaming services from Pandora. Its portfolio also encompasses an expansive podcast network and business and advertising solutions. The company’s content offering reaches a monthly audience of approximately 167 million listeners.</p>\n<p>The company recently announced an updated strategic plan, which refocuses SiriusXM’s attention on its main subscription business. It aims to utilize the strength of its advertising business across its portfolio, increase overall efficiency, and maintain robust margins with a focus on free cash generation and shareholder returns.</p>\n<p>The company is targeting an incremental $200 million in annualized savings by the end of 2025. It plans to reduce its debt by approximately $700M in 2025 and commit to its existing quarterly dividend.</p>\n<h2 class=\"wp-block-heading\"><strong>Earnings Beating Expectations</strong></h2>\n<p>For the fourth quarter, SiriusXM reported <a href=\"https://www.tipranks.com/stocks/siri/financials\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/siri/financials\">revenue of $2.19 billion</a>, outperforming analysts’ forecasts by $20 million. The company reported full-year revenue of $8.70 billion with an adjusted EBITDA of $2.73 billion and a free cash flow of $1.02 billion. SiriusXM’s subscriber base decreased, ending the year with 33 million subscribers. Despite the decrease in subscribers, the company maintained a stable adjusted EBITDA margin of 31% and enjoyed a slight increase in the Pandora segment’s revenue driven by advertising and subscription revenue gains.</p>\n<p>The company posted A net loss of $2.08 billion, mainly attributed to a significant non-cash impairment charge recorded in Q3. The GAAP <a href=\"https://www.tipranks.com/stocks/siri/earnings\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/siri/earnings\">earnings per share (EPS) of $0.83</a> beat expectations by $0.12.</p>\n<p>The Board of Directors posted a quarterly cash dividend of $0.27 per share, payable on February 25, 2025, for the stockholders of record as of the close of business on February 7, 2025.</p>\n<h2 class=\"wp-block-heading\"><strong>Analysts Take a Cautious Stance</strong></h2>\n<p>The stock has been downward, shedding over 60% in the past three years. Yet, the recent positive earnings news has helped to catalyze the stock up over 9% in the past week.&nbsp;It trades near the low end of its 52-week price range of $20.47 – $53.50 but shows positive price momentum as it trades above the <a href=\"https://www.tipranks.com/stocks/siri/technical-analysis\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/siri/technical-analysis\">20-day (22.35) and 50-day (23.48) moving averages</a>. The stock trades at a discount based on its P/S ratio of 0.93x compared to the Communication Services sector sector average of1.3x.</p>\n<p>Analysts following the company have taken a cautious stance on SIRI stock. Sirius XM Holdings is rated a Hold overall, based on the recent recommendations of 11 analysts. Their <a href=\"https://www.tipranks.com/stocks/siri/forecast\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/siri/forecast\">average 12-month price target for SIRI stock is $24.47</a>, representing a potential upside of 1.92% from current levels.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/siri/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"909\" height=\"698\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-11.png\" alt=\"\" class=\"wp-image-1698586\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-11.png 909w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-11-300x230.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-11-768x590.png 768w\" sizes=\"(max-width: 909px) 100vw, 909px\"></a></figure>\n<p><strong><a href=\"https://www.tipranks.com/stocks/siri/forecast\">See more SIRI analyst ratings</a></strong></p>\n<h2 class=\"wp-block-heading\"><strong>SIRI in Summary</strong></h2>\n<p>SiriusXM has recently delivered strong financial performance, attributed to increased subscriber acquisition and success with automotive trials and partnerships. The company is focusing on its core subscription business, aiming to boost overall efficiency while generating free cash and rewarding its shareholders. Despite a downward trend over the past three years, the recent earnings news has sparked positive price momentum in the stock. SIRI offers a potentially attractive option for value-oriented investors.</p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-1\">Disclosure</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/02/SIRI-Image-3-750x406.jpg",
            "link": "https://www.tipranks.com/news/siriusxm-surges-with-strong-q4-earnings-and-strategic-partnerships",
            "author": "Casey Dylan, CIMA",
            "pub_date": "2025-02-02 22:06:22",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1692797,
            "title": "Levi Strauss & Co (LEVI) Posts Impressive Q4 Financial Results, But Soft Forward Guidance",
            "description": "<html><head></head><body><p>Despite the pressures of global economic uncertainty, Levi Strauss &amp; Co. <a data-ticker=\"LEVI\" href=\"https://www.tipranks.com/stocks/levi\">(LEVI)</a> has delivered accelerated revenue growth, strong cash flow, and better-than-expected results. The company has reported Q4 results that beat Wall Street’s expectations, with revenue of $1.84 billion, a 12% increase year-over-year, and earnings of $0.50 per share, marking a 3.7% rise over analysts’ consensus estimates. Looking to the future, the company anticipates a softer environment in 2025, reflecting the negative impact of a stronger dollar on sales. The company predicts a 1% to 2% fall in revenue in FY25, leading to adjusted earnings between $1.20 and $1.25 per share. </p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<p>This is less than the expected earnings of $1.37 per share. However, Levi’s expects its adjusted EBIT margin to broaden to 11.1% from 10.9% last year and is forecasting organic net revenue growth of 3.5% to 4.5%. The stock appears reasonably valued, though it may languish until the company posts more positive news. Investors may want to look for a better entry point.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/levi\"><img decoding=\"async\" loading=\"lazy\" width=\"781\" height=\"444\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-8.png\" alt=\"\" class=\"wp-image-1698574\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-8.png 781w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-8-300x171.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-8-768x437.png 768w\" sizes=\"(max-width: 781px) 100vw, 781px\"></a></figure>\n<h2 class=\"wp-block-heading\"><strong>Sharpened Focus on Core Brands</strong></h2>\n<p>Levi Strauss &amp; Co. is one of the iconic brand-name apparel companies globally. It designs and markets jeans, casual wear, and related accessories for men, women, and children. The company’s brand portfolio includes notable names such as Levi’s, Dockers, Signature by Levi Strauss &amp; Co., and Beyond Yoga brands.</p>\n<p>Leveraging a vast distribution network, Levi Strauss &amp; Co. sells products in more than 110 countries worldwide. This network encompasses chain retailers, department stores, online platforms, and approximately 3,000 brand-dedicated stores and shop-in-shops.</p>\n<p>The company’s focus for 2025 is to expedite growth across its regional markets, notably North America and Europe. It is also set to leverage emerging opportunities in rapidly developing regions like Latin America and Asia Pacific while maintaining stability in Greater China. Additionally, an ongoing strategy exists to explore a potential sale of the Dockers brand. Conversely, there is a level of confidence within the company about Beyond Yoga’s future, with expectations that the brand could one day achieve a billion-dollar status.</p>\n<h2 class=\"wp-block-heading\"><strong>Strong Financial Results Reported</strong></h2>\n<p>The company recently reported strong fourth-quarter financial results, exceeding expectations. <a href=\"https://www.tipranks.com/stocks/levi/financials\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/levi/financials\">Revenue reached $1.84 billion</a>, outperforming predictions by $110 million. Regionally, net revenues saw growth in all areas on a net basis and an organic basis (which excludes the impacts of foreign exchange rates) – Americas (12% reported, 9% organic), Europe (15% reported, 6% organic), Asia (9% reported and organic), and other brands (10% reported, 5% organic). Direct-to-consumer revenues also grew significantly, by 19% on a reported basis and 14% on an organic basis, accounting for 45% of total organic net revenues in Q4.</p>\n<p>Operating margin was 11.5%, an increase from 9.2% in Q4 2023, and gross margin rose to 61.3% from 57.8% the previous year, setting a new company record. The increase in gross margin was due to lower product costs, favorable channel mix, and higher full-price sales. Net income increased to $183 million, up from $127 million in Q4 2023, with adjusted net income at $202 million compared to $179 million the previous year. The company’s<a href=\"https://www.tipranks.com/stocks/levi/earnings\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/levi/earnings\"> earnings per share were $0.50</a>, an increase compared to $0.44 in Q4 2023, beating expectations by $0.02.</p>\n<p>For the full Fiscal year of 2024, reported net revenues stood at $6.4 billion, a 3% increase from FY 2023. The operating margin was 4.2%, and gross margin was 60%. Net income was $211 million, with adjusted net income at $503 million, up from $441 million in FY 2023. The company also generated a record adjusted free cash flow of $671 million and returned $289 million in capital to shareholders, a 45% increase from the prior year.</p>\n<p>The company has <a href=\"https://www.tipranks.com/stocks/levi/dividends\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/levi/dividends\">declared a $0.13 per share quarterly dividend</a>, equating to a forward yield of 2.87%. It will be payable on Feb. 28 for shareholders of record on Feb. 12.</p>\n<p>Following fourth-quarter earnings, LEVI’s management has offered forward guidance for 2025, with organic net revenue projected to grow by 3.5% to 4.5%. The adjusted EBIT margin is anticipated to expand to 10.9-11.1%.Adjusted diluted earnings per share are expected to be between $1.20 and $1.25, including effects such as a 20-cent headwind from foreign currency fluctuations and higher tax rates.</p>\n<h2 class=\"wp-block-heading\"><strong>Readjusting Price Targets</strong></h2>\n<p>Analysts following the company have been constructive on LEVI stock, but the soft forward guidance has caused many to revise and adjust 12-month price targets. For example, Guggenheim’s <a href=\"https://www.tipranks.com/experts/analysts/robert-drbul\">Robert Drbul</a>, a four-star analyst according to Tipranks’ ratings, lowered the price target on LEVI stock to $20 (from $23) while maintaining a Buy rating, noting its reduced FY25 EPS estimate.</p>\n<p>Levi Strauss &amp; Co. is rated a Moderate Buy overall, based on the recent recommendation of 10 analysts. The <a href=\"https://www.tipranks.com/stocks/levi/forecast\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/levi/forecast\">average price target for LEVI stock is $20.45</a>, representing a potential upside of 7.46% from current levels.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/levi/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"911\" height=\"698\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-9.png\" alt=\"\" class=\"wp-image-1698578\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-9.png 911w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-9-300x230.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-9-768x588.png 768w\" sizes=\"(max-width: 911px) 100vw, 911px\"></a></figure>\n<p><strong><a href=\"https://www.tipranks.com/stocks/levi/forecast\">See more LEVI analyst ratings</a></strong></p>\n<h2 class=\"wp-block-heading\"><strong>Bottom Line on LEVI</strong></h2>\n<p>Despite facing global economic headwinds, Levi Strauss &amp; Co. has demonstrated its resilience by delivering accelerated revenue growth, robust cash flow, and impressive Q4 results, surpassing expectations. The brand’s global presence and focus on expanding in various regions position it well for future growth despite a forecasted softer environment in 2025. As an iconic brand, LEVI stock appears reasonably priced, with the potential for growth once more positive news emerges. In the interim, investors might want to hold off and look for better entry points.</p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-1\">Disclosure</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/01/LEVI-Image-3-750x406.jpg",
            "link": "https://www.tipranks.com/news/levi-strauss-co-levi-posts-impressive-q4-financial-results-but-soft-forward-guidance",
            "author": "Casey Dylan, CIMA",
            "pub_date": "2025-02-02 21:41:00",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1692415,
            "title": "Hess Midstream Sports a 7% Dividend Yield and Is Under CVX’s Radar",
            "description": "<html><head></head><body><p>Over the past year, Hess Midstream <a data-ticker=\"HESM\" href=\"https://www.tipranks.com/stocks/hesm\">(HESM)</a> shares have experienced remarkable growth, with a 33% increase and a 7.38% dividend yield. This growth has been fueled by impressive quarterly results, beating revenue and earnings expectations, with increases in production and throughput volumes. Hess Midstream’s outlook remains optimistic, with stable leverage, significant EBITDA growth, and anticipated buyback potential by 2025. The new <a data-autolink=\"true\" href=\"https://www.tipranks.com/stocks/djt\">Trump</a> administration mantra of “drill baby, drill” suggests an environment of healthy growth for the industry overall. </p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<p>Investors should closely monitor Chevron’s ($ CVX) potential acquisition of Hess, as this move could likely provide a premium for shareholders.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/hesm\"><img decoding=\"async\" loading=\"lazy\" width=\"702\" height=\"405\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/HESM-Chart-1-30-25.png\" alt=\"\" class=\"wp-image-1692417\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/HESM-Chart-1-30-25.png 702w, https://blog.tipranks.com/wp-content/uploads/2025/01/HESM-Chart-1-30-25-300x173.png 300w\" sizes=\"(max-width: 702px) 100vw, 702px\"></a></figure>\n<h2 class=\"wp-block-heading\"><strong>Business Model Offers Long-term Stability</strong></h2>\n<p>Hess Midstream is a fee-based midstream company that owns, operates, and develops a wide range of midstream assets. These assets primarily serve Hess and its third-party customers. The company deals with oil, gas and produced water handling assets, predominantly situated in the Bakken and Three Forks Shale plays in the North Dakota Williston Basin area.</p>\n<p>The company operates in three main areas: gathering, processing, and terminating. The gathering segment employs an expansive pipeline network, enabling efficient transportation of natural gas and crude oil. The processing branch runs state-of-the-art facilities such as the Tioga Gas Plant and the LM4 Joint Venture, offering a total capacity of over 600 MMcf/d. Meanwhile, the terminaling sector manages the storage, transportation, and export of crude oil and NGLs.</p>\n<p>Hess Midstream’s business model is entirely fee-based, with fixed minimum volume commitments until 2026. This structure helps mitigate the uncertainties of fluctuating commodity prices and underpins a consistent earnings stream, strengthening the midstream companies’ stability. Its revenue stream is bolstered by long-term commercial contracts extending to 2033, with potential for further extensions.</p>\n<h2 class=\"wp-block-heading\"><strong>Q4 Top-and-Bottom-line Beats</strong></h2>\n<p>Hess Midstream reported better-than-anticipated <a href=\"https://www.tipranks.com/stocks/hesm/financials\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/hesm/financials\">revenues for the fourth quarter of $395.9 million</a>, higher than the $356.5 million in Q4 2023, primarily due to a boost in physical volumes. The company also recognized increased total operating costs and expenses from $146.4 million in Q4 2023 to $152.9 million in Q4 2024 due to pass-through electricity and produced water trucking and disposal costs.</p>\n<p>After deduction for noncontrolling interests, the net income was $172.1 million, or <a href=\"https://www.tipranks.com/stocks/hesm/earnings\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/hesm/earnings\">$0.68 per share</a>, beating consensus expectations by $0.09. Adjusted EBITDA stood at $298.2 million, and net cash from operating activities was $258.5 million in Q4 2024.</p>\n<p>For the full year of 2024, the company reported a net income of $659 million and Adjusted EBITDA of $1.136 billion. As of year-end 2024, cash and cash equivalents were recorded at $4.3 million, and the company’s debt was roughly $3.5 billion, representing a leverage of about 3.1x Adjusted EBITDA.</p>\n<p>The company announced <a href=\"https://www.tipranks.com/stocks/hesm/dividends\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/hesm/dividends\">a quarterly cash distribution of $0.7012</a> per Class A share for Q4 2024, marking a 10% rise compared to Q3 2024 and a 55% increase in distribution per share since the first quarter of 2021.</p>\n<p>Management has issued forward guidance for 2025 and anticipates net income between $715 million and $765 million. The projected Adjusted EBITDA is expected to fall between $1.235 billion and $1.285 billion. The company also forecasts a Gross Adjusted EBITDA Margin of about 75% for 2025. The firm aims to reduce its leverage to below its 3x Adjusted EBITDA long-term target by the end of 2025.</p>\n<h2 class=\"wp-block-heading\"><strong>Analysts Are Constructive</strong></h2>\n<p>HESM stock has been on an extended uptrend, climbing over 77% in the past three years. It trades at the high end of its 52-week price range of $32.15 – $41.61 and shows no signs of slowing, as it bullishly trades above <a href=\"https://www.tipranks.com/stocks/hesm/technical-analysis\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/hesm/technical-analysis\">major moving averages</a>. It seems relatively reasonably valued on a P/FCF basis with a 4.67x ratio compared to the Energy sector average of 5.23x.</p>\n<p>Analysts following the company have been constructive on HESM stock. Based on the recent recommendations of two analysts, Hess Midstream is rated a moderate buy overall. The <a href=\"https://www.tipranks.com/stocks/hesm/forecast\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/hesm/forecast\">average price target for HESM stock is $44.00</a>, representing a potential upside of 8.62% from current levels.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/hesm/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"914\" height=\"699\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-4.png\" alt=\"\" class=\"wp-image-1698276\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-4.png 914w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-4-300x229.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-4-768x587.png 768w\" sizes=\"(max-width: 914px) 100vw, 914px\"></a></figure>\n<p><strong><a href=\"https://www.tipranks.com/stocks/hesm/forecast\">See more HESM analyst ratings</a></strong></p>\n<h2 class=\"wp-block-heading\"><strong>HESM Stock in Review</strong></h2>\n<p>Hess Midstream has forged a compelling value proposition with the stock’s impressive 33% year-on-year growth and a healthy dividend yield to boot. A sturdy mix of promising quarterly results, potentially huge buyback plans, and an industry landscape encouraging growth have all led to a strong trajectory. While potential changes like the speculated Chevron acquisition warrant vigilance, the current projections for HESM stock suggest it’s an attractive option for income-oriented investors seeking growth at a reasonable price.</p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-1\">Disclosure</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/01/HESM-Image-3-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/hess-midstream-sports-a-7-dividend-yield-and-is-under-cvxs-radar",
            "author": "Casey Dylan, CIMA",
            "pub_date": "2025-02-02 15:53:14",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1698132,
            "title": "Seeking Up to 13% Dividend Yield? Analysts Suggest 2 Dividend Stocks to Buy",
            "description": "<html><head></head><body><p>The bull market that has been charging for the past year has seen a surge in volatility recently. The Chinese startup DeepSeek released its latest <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> model, R1, and shook up the tech world with claims that the new AI consumes just a fraction of the computing power as existing big-name AIs and has been much cheaper to develop<a> </a>– but gives comparable results. This rattled AI-related stocks as investors scrambled to gauge the impact of a low-cost, high-efficiency competitor shaking up the industry.</p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<p>This development came alongside the most recent Federal Reserve statements, which hinted that the central bank will not be cutting <a data-autolink=\"true\" href=\"https://www.tipranks.com/economic-indicators\">interest rates</a> this month. This was not completely unexpected – but it does imply that rates will remain elevated for longer than market watchers had hoped.</p>\n<p>That’s the background behind investors’ efforts to build a portfolio that can weather any market conditions. That’s where <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/dividend-stocks\">dividend stocks</a> come in. The best ones offer a steady income stream, with yields that not only beat <a data-autolink=\"true\" href=\"https://www.tipranks.com/economic-indicators/inflation-rate\">inflation</a> but also outshine current interest rates<a>.</a></p>\n<p>We’ve opened up the <a href=\"https://www.tipranks.com/\">TipRanks database</a> to find two such dividend stocks – stocks with dividend yields that reach as high as 13%. In addition, the shares we’ll look at here have been tagged by some of Wall Street’s analysts as potential winners for 2025. Let’s give them a closer.</p>\n<p><strong>MFA Financial</strong> <strong>(</strong><a href=\"https://www.tipranks.com/stocks/mfa/forecast\"><strong>MFA</strong></a><strong>)</strong></p>\n<p>First up is a real estate investment trust (REIT), MFA Financial. MFA operates as a specialty finance company, investing shareholder money in residential mortgage loans and mortgage-backed securities (MBSs), as well as other real estate assets. The company conducts its activities through direct purchase of properties and by financing loans on mortgages. MFA’s portfolio totals $10.5 billion, with the largest part, $4.2 billion, being in non-QM residential mortgage loans. In addition, the company has substantial positions in residential transitional loans and single-family rental loans. Together, these three segments make up $8 billion of the company’s investment portfolio.</p>\n<p>Being a REIT, MFA is required by tax regulations to return profits directly to shareholders, and like most of its peers the company uses dividends as a means of compliance. MFA last declared its dividend payment on December 11, and the payout went out on January 31 at a rate of 35 cents per common share. This marked the ninth quarter in a row with the dividend at this level. The $1.40 annualized payment per common share gives a forward yield of 13.3%.</p>\n<p>The company supports its dividend policy through its real estate activities. In the last reported quarter, 3Q24, MFA’s net interest income came to $50.6 million. While up almost 10% year-over-year, this figure missed the forecast by $6.57 million. The company’s bottom line was reported as a non-GAAP EPS of 37 cents. This was 4 cents per share lower than had been expected – but it was also a strong reversal of the 64-cent per share EPS loss reported in 3Q23. MFA’s distributable earnings per share also came to 37 cents, and directly supports the company’s dividend payment.</p>\n<p>In his coverage of this stock for Janney, analyst Jason Stewart explains that he likes MFA for its exposure to MBS assets, as well as its likely trajectory given today’s mortgage market. Stewart says of the company and its position, “Historically, investors have fared well capitalizing on government intervention as non-economic participants in markets. Thematically, investment in the high-quality, liquid agency MBS market at current economic returns is attractive and MFA has been opportunistically growing the agency MBS portfolio. Mortgage spreads are wider than long-term averages and likely to tighten as fixed income volatility declines, driving MFA’s book value higher.&nbsp;MFA shares are trading at a steep discount to current GAAP BVPS and&nbsp;economic BVPS. We expect mid-single-digit growth in BVPS and multiple expansion toward economic book value.”</p>\n<p>Stewart quantifies his position with a Buy rating, and a $14 price target that points toward a one-year upside potential for the stock of 33%. With the dividend return added in, that one-year return may reach as high as 46%. (To watch Stewart’s track record, <a href=\"https://www.tipranks.com/experts/analysts/jason-stewart\">click here</a>)</p>\n<p>This stock gets a Moderate Buy rating from the Street consensus, based on 5 reviews that include 3 Buys and 2 Holds. The shares are priced at $10.50 and their $12.55 average target price implies a 12-month gain of 19.5%. (See <a href=\"https://www.tipranks.com/stocks/mfa/forecast\"><strong>MFA stock forecast</strong></a>)</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image.png\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"553\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-1024x553.png\" alt=\"\" class=\"wp-image-1698133\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-1024x553.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-300x162.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-768x415.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-750x406.png 750w, https://blog.tipranks.com/wp-content/uploads/2025/02/image.png 1207w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p><strong>Apple Hospitality REIT</strong> <strong>(</strong><a href=\"https://www.tipranks.com/stocks/aple/forecast\"><strong>APLE</strong></a><strong>)</strong></p>\n<p>Next on our list is Apple Hospitality REIT, a company with a narrow focus on real estate in the leisure industry. Specifically, Apple has built up a portfolio of hotels, upscale properties with a focus on maximizing guest rooms. The company’s hotels are spread across 37 states in 86 markets. In all, Apple owns 221 hotels with more than 29,700 guest rooms. Brands in the company’s portfolio include such names as Marriott, Courtyard by Marriott, Hampton by Hilton, and Hyatt House.</p>\n<p>Apple’s properties are widespread. The company has 22 hotels in Florida, 26 in Texas, and another 26 in California. Apple even owns properties in Portland, Maine, and Anchorage, Alaska. The key point: the company’s properties are located in places with strong demand, close access to guest amenities, and a track record of delivering consistent performance.</p>\n<p>Turning to that performance, we find that Apple realized revenues of $378.84 million from its properties in 3Q24. This was up 5.7% year-over-year, although it came in just under expectations, missing by some $800,000. Apple reported funds from operations, a key metric for REITs, of 45 cents per share. This was in line with the forecasts and matched the 3Q23 result.</p>\n<p>Apple’s results were more than strong enough to support the company’s common share dividend, which is paid out monthly rather than quarterly. The dividend for February was declared in January 17 for 8 cents per common share. This annualizes to 96 cents per common share and gives a forward yield of 6.14%.</p>\n<p>This stock has come to the attention of Dany Asad from Bank of America, who sees several reasons for an upbeat view on APLE—starting with the old standby of the real estate market, location. He writes, “We are upgrading Apple Hospitality from Neutral to Buy as 1) location, geographic and segment mix all skew favorably to this select service portfolio, 2) capital needs are limited given the low average age of the assets and 3) its dividend yield is above peers.”</p>\n<p>Getting deeper into the details, the BofA analyst adds, “Apple is one of the most capital efficient companies in our REIT coverage, with capex as a % of revenue at 6% (vs peers at 9%). Its average effective age of hotels of 4-5 years is stable since 2019, meaning low deferred maintenance. High margins, low leverage and lower capex drives attractive Adjusted FFO, a strong and well covered dividend and should allow APLE to go on offense if the hotel M&amp;A environment accelerates in 2025.”</p>\n<p>Asad gives APLE shares a Buy rating and a price target of $17 that suggests a 10% gain on the one-year horizon. With the annualized dividend yield, the total return is likely to exceed 16%. (To watch Asad’s track record, <a href=\"https://www.tipranks.com/experts/analysts/dany-asad\">click here</a>)</p>\n<p>Overall, this stock has a Moderate Buy consensus rating, based on 7 reviews that show a breakdown of 5 to Buy and 2 to Hold. The shares are trading for $15.44 and have an average price target of $17.50, implying a potential one-year gain of 13%. (See <a href=\"https://www.tipranks.com/stocks/aple/forecast\"><strong>APLE stock forecast</strong></a>)</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-1.png\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"548\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-1-1024x548.png\" alt=\"\" class=\"wp-image-1698134\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/02/image-1-1024x548.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-1-300x161.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-1-768x411.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/02/image-1.png 1207w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>To find good ideas for stocks trading at attractive valuations, visit TipRanks’&nbsp;<a href=\"https://www.tipranks.com/stocks-to-buy\">Best Stocks to Buy</a>, a tool that unites all of TipRanks’ equity insights.</p>\n<p><em>Disclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment.</em><em></em></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/06/shutterstock_2191181355-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/seeking-up-to-13-dividend-yield-analysts-suggest-2-dividend-stocks-to-buy-2",
            "author": "Michael Marcus",
            "pub_date": "2025-02-01 19:01:56",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1695470,
            "title": "‘Golden Age of Investing’: Top Analysts Select 2 Stocks to Buy Now",
            "description": "<html><head></head><body><p>It’s a new year, and a new presidential administration, making this a good time to break out the crystal ball and try to see just where things are headed. Mary Ann Bartels, market strategist from Sanctuary Wealth, is doing just this – and she sees a potential ‘Golden Age of Investing’ taking shape over the next few years.</p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<p>Specifically, she believes that the S&amp;P 500 may reach as high as 13,000 by 2030 – which would translate to a gain of 113%. Backing her stance, Bartels says, “We believe this is fundamentally driven by the productivity gains from <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> and a strong U.S. economy, aided by maintaining lower corporate taxes, lower interest rates, and the ongoing stimulus from the Biden Administration’s pieces of legislation that allows companies to continue to post strong earnings growth.”</p>\n<p>Looking at stock market history, Bartels thinks we are in the “early stages of the boom and that the equity market will not peak until 2029-2030.”</p>\n<p>Against this optimistic outlook, some of Wall Street’s top analysts – stock experts rated by <a href=\"https://www.tipranks.com/\">TipRanks</a> among the upper 5% of their peers – are running with the bullish view and weighing in on the stocks that investors should buy now. These are Buy-rated shares, and these 5-star analysts see double-digit upside in them. Let’s take a closer look.</p>\n<p><strong>Twilio, Inc.</strong> <strong>(</strong><a href=\"https://www.tipranks.com/stocks/twlo/forecast\"><strong>TWLO</strong></a><strong>)</strong></p>\n<p>We’ll start with Twilio, a tech and software firm operating in the cloud computing world. Twilio’s platform and tools allow its clients to make the best use of their data and their communications, to move their own customers along the path from sales to marketing to growth. The platform adds intelligence and security to customer service at every level, to drive a real-time, personalized experience through customer engagement. It’s business communications and marketing all in one, solving the problems that come along with our digital economy.</p>\n<p>The success of Twilio’s platform can be seen in the numbers it generates. In 2023, the last full year with data available, the company’s software tools facilitated 19.9 billion voice calls, handled 167 billion messages sent or received, sent out 1.9 trillion emails, and verified over 4.8 billion customers. Twilio boasts that more than 300,000 brands trust its platform for customer engagement, including such major names as Shopify, Dell, and AirBnB. Twilio’s stock has seen strong gains recently, and the company has a market cap of almost $23 billion<strong>.</strong></p>\n<p>The strong recent gains have come on the strength of Twilio’s AI tools. The company has integrated AI tech into its platform in several modes, most prominently in the form of Assistants that allow users to automate platform functions.</p>\n<p>A quality product and strong demand are typically the ingredients of a successful company, and Twilio has seen both revenues and earnings trend upwards in recent years. The company’s 3Q24 quarterly report, the last released, showed a top line of $1.13 billion, up 10% year-over-year and beating the forecast by $40 million. The EPS figure, $1.02 by non-GAAP measures, was 16 cents per share better than had been expected.</p>\n<p>For 5-star analyst Kash Rangan of Goldman Sachs, key points here are Twilio’s record of recent successes and its ability to continue delivering for investors.</p>\n<p>“Following multiple years of growth compression and several strategic actions, we believe Twilio is now hitting an inflection point both in terms of narrative and fundamentals,” Rangan opined. “Twilio’s major cost reduction initiatives and ongoing efficiency measures support strong FCF generation ahead, complemented by our view for an inflecting growth profile. We believe Twilio can observe a positive revision cycle on both top and bottom-line against a conservative initial CY25 guide of +7-8% with usage trends inflecting and growth accelerating to &gt;10% in F2H24 (vs. +7% organic in F1H)… Twilio’s turnaround story is firmly underway with potential for solid upside to Revenue/FCF in CY25 at what we view to be a still compelling entry point of 21x EV/FCF (CY26).”</p>\n<p>Rangan’s comments back up his Buy rating on TWLO shares, while his $185 price target points toward a gain of 26% on the one-year horizon. (To watch Rangan’s track record, <a href=\"https://www.tipranks.com/experts/analysts/kash-rangan\">click here</a>)</p>\n<p>Overall, Twilio holds a Moderate Buy consensus rating, derived from 24 recent analyst reviews: 16 Buys, 6 Holds, and 2 Sells. That said, at $148.35, the stock has surpassed its average price target of $136.57, implying a potential 8% downside in the near term. It will be interesting to see whether analysts downgrade their ratings or update their targets shortly. (See <a href=\"https://www.tipranks.com/stocks/twlo/forecast\"><strong>TWLO stock forecast</strong></a>)</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1384.png\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"555\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1384-1024x555.png\" alt=\"\" class=\"wp-image-1695490\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1384-1024x555.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1384-300x163.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1384-768x417.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1384-750x406.png 750w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1384.png 1204w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p><strong>Semtech Corporation</strong> <strong>(</strong><a href=\"https://www.tipranks.com/stocks/smtc/forecast\"><strong>SMTC</strong></a><strong>)</strong></p>\n<p>Next on our list is Semtech, one of the smaller <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/chips-stocks\">semiconductor</a> chip companies – but one with a twist. Semtech specializes in developing chips for use in IoT, mobile devices, and data centers – in short, the company focuses on combining high performance with mobility, backed up by reliable connections to strong data centers. Semtech describes itself as promoting ‘smaller, faster, and smarter electronics,’ meeting the needs of both consumers and businesses.</p>\n<p>Towards this end, Semtech has put together a product line to meet the needs of wireless RF, circuit protection, signal integrity, broadcast video, professional AV, cellular IoT solutions, and power management – all applications involved in mobile connectivity. Semtech’s work is deeply connected to some of the fastest-growing areas in the electronics field, and is at the leading edge of mobile connectivity.</p>\n<p>No tech company can ignore AI, and Semtech has been making moves to enter that rapidly expanding market. The company has put several AI-capable products on the market, mainly for data center networking.</p>\n<p>Semtech cannot compare to the chip industry giants in size – it has a market cap of $5.8 billion – but it has seen both earnings and revenues take an upward trend in recent quarters. The last quarterly report, covering fiscal 3Q25, showed a top line of $236.8 million, up 18% year-over-year and $4.74 million better than had been anticipated. The company’s bottom line figure, a non-GAAP EPS of 26 cents, was 3 cents over expectations. In addition, the company reported record net sales in its data center segment, which were up 58% quarter-over-quarter to reach $43.1 million.</p>\n<p>This stock has caught the eye of UBS analyst Timothy Arcuri, who is rated #8 overall by TipRanks. Arcuri first takes note of Semtech’s connection to AI, writing, “Semtech is an analog company making inroads into AI data center networking thanks to a key content win for SMTC’s CopperEdge product in Nvidia’s Blackwell platform, and Nvidia is pushing hard to ramp a similar fiber product (LPO) later this year. Blackwell’s CopperEdge SAM alone is $100MM, while AMD/hyperscalers and an estimated 30MM annual LPO units should be additive to this. Beyond the data center, Semtech’s other analog businesses should see reasonable smartphone units and what should be a strong year of Industrial cyclical recovery.”</p>\n<p>Looking ahead, the high-ranked analyst goes on to explain why he believes that SMTC shares are primed for gains: “Street estimates for $76/103MM of F25/F26 Signal Integrity segment growth look low (UBSe $212/220MM), while a recent refinancing is not yet reflected in consensus and a possible portfolio rationalization could be the impetus for the market to reconsider Semtech’s valuation. In all, we think estimates and multiples are on their way up…”</p>\n<p>Arcuri puts a Buy rating on Semtech’s stock and complements that with a one-year price target of $85, suggesting a gain of 27.5% for the shares. (To watch Arcuri’s track record, <a href=\"https://www.tipranks.com/experts/analysts/timothy-arcuri\">click here</a>)</p>\n<p>All in all, among 12 recent analyst reviews, the sentiment heavily favors the bulls, with an 11-to-1 split in favor of Buy over Hold, resulting in a Strong Buy consensus rating. Currently trading at $67.69, the stock carries an average price target of $77.70, suggesting a 15% gain over the coming year. (See <a href=\"https://www.tipranks.com/stocks/smtc/forecast\"><strong>SMTC stock forecast</strong></a>)</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1385.png\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"555\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1385-1024x555.png\" alt=\"\" class=\"wp-image-1695493\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1385-1024x555.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1385-300x162.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1385-768x416.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1385-750x406.png 750w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1385.png 1202w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>To find good ideas for stocks trading at attractive valuations, visit TipRanks’<a>&nbsp;</a><a href=\"https://www.tipranks.com/stocks-to-buy\">Best Stocks to Buy</a>, a tool that unites all of TipRanks’ equity insights.</p>\n<p><em>Disclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment.</em></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2023/01/Top-Analysts-0411-768x4171-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/golden-age-of-investing-top-analysts-select-2-stocks-to-buy-now",
            "author": "Michael Marcus",
            "pub_date": "2025-01-31 19:07:48",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1688506,
            "title": "Leaked GTA 6 Release Date Puts Pressure on Take-Two (TTWO) to Deliver",
            "description": "<html><head></head><body><p>Take-Two Interactive <a data-ticker=\"TTWO\" href=\"https://www.tipranks.com/stocks/ttwo\">(TTWO)</a> is at a historical crossroads. With <em>Grand Theft Auto VI (GTA 6) </em>scheduled for release later this year, the company’s management is under tremendous pressure to meet illustrious expectations from both customers and investors.</p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<p>Unofficial reports referencing a retail store in Uruguay suggest <em>GTA 6</em>, one of the most anticipated video games in history, will be released on 25 September 2025.</p>\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><a href=\"https://www.tipranks.com/stocks/ttwo\"><img decoding=\"async\" loading=\"lazy\" width=\"786\" height=\"617\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO.jpg\" alt=\"\" class=\"wp-image-1692811\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO.jpg 786w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO-300x235.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO-768x603.jpg 768w\" sizes=\"(max-width: 786px) 100vw, 786px\"></a></figure></div>\n<p>The gaming industry is more competitive than ever, with soaring development budgets and increasing customer demands. While the company is working on plenty of other titles, there is little doubt that the next <em>GTA</em> is the cash cow for Rockstar Games and its parent company, Take-Two (TTWO). </p>\n<p>However, with a massive reliance on its flagship title remaining and with speculators pushing up the share price in advance of the release, there is little room for error for TTWO’s management. The closer we get to the release date, the more the stock becomes a gamble rather than an investment, so I am cautiously placing a Sell rating on TTWO until further clarity is provided.</p>\n<h2 class=\"wp-block-heading\"><strong>It Take-Two to Tango</strong></h2>\n<p>The firm has a stellar reputation as one of the best gaming companies ever, but I worry that this is built upon only a handful of highly successful franchises. Most will know TTWO because of <em>GTA</em>, but titles like<em> Red Dead Redemption, Mafia,</em> and several NBA games are also under its brand umbrella.</p>\n<p>I’m also concerned about the dependence on franchise games, which can quickly fade as new gamers enter the market. Management has put steps in place to mitigate this by acquiring mobile gaming giant Zynga. However, results have been underwhelming so far. The transition has been problematic, with various integration challenges and struggles to exacerbate the existing intense competition.</p>\n<p>While <a href=\"https://www.tipranks.com/stocks/ttwo/financials\">TTWO has a decent level of revenue diversification</a>, <em>GTA Online </em>remains the major powerhouse driving revenues. The game has been operating for over a decade; a new <em>GTA 6</em> release could undermine this revenue source despite creating a new one. Given the reliance on <em>GTA</em> players, I worry that some market saturation is inevitable. The possibility of the game being a complete flop is also a distinct possibility and is seemingly being ignored by most investors and gaming commentators. Take-Two’s past history and success have raised the bar and expectations, but can the company meet them?</p>\n<h2 class=\"wp-block-heading\"><strong>TTWO Headed for Gaming Industry Headwinds</strong></h2>\n<p>The gaming industry faces several headwinds, including declining consumer spending and shifting player engagement. This may be improved by a new game release, but gamers are now highly conscious of the aggressive monetization tactics being used by all gaming companies. They may be reluctant to devote as much loose change to these games going forward.</p>\n<p>With a hefty market cap of $33 billion, I have worries that TTWO will struggle to maintain its illustrious performance history. Moreover, delays in development or perceived quality issues before the release date could enormously damage TTWO’s share price. Investing in a company with such sensitivity to consumer sentiment can be perilous.</p>\n<h2 class=\"wp-block-heading\"><strong>GTA Gamer Fatigue Could Scupper TTWO</strong></h2>\n<p>A glance at <a href=\"https://www.tipranks.com/stocks/ttwo/earnings\">TTWO’s earnings report </a>shows that management is confident that the current strategy will succeed beyond <a href=\"https://www.tipranks.com/stocks/ttwo/earnings\">next week’s major release on February 6th</a>, but I’m not sure there is much evidence to support this. The trends are all moving in the right direction regarding the report, with solid revenue numbers and net bookings on the rise, but I worry that <em>GTA</em> gamer fatigue could set in, dampening long-term sales. Gamers are increasingly skeptical of predatory microtransactions in games, and the regulators are aggressively working against pay-to-win mechanics, which proved to be a significant boost for some releases. Relying on these tactics is not as lucrative as it once was.</p>\n<p>From my perspective, the Zynga acquisition has not proved its worth. At nearly $13 billion, management made this huge move to break into an oversaturated, unpredictable, but highly lucrative market. The synergy management was aiming for between console and mobile experiences has not been realized, raising concerns that this segment could be far less lucrative than TTWO expected.</p>\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><a href=\"https://www.tipranks.com/stocks/ttwo/financials/balance-sheet\"><img decoding=\"async\" loading=\"lazy\" width=\"612\" height=\"441\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO3.jpg\" alt=\"\" class=\"wp-image-1692842\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO3.jpg 612w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO3-300x216.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO3-105x77.jpg 105w\" sizes=\"(max-width: 612px) 100vw, 612px\"></a></figure></div>\n<p>At the same time, the company’s broader pipeline has yet to show that it can build reliable blockbuster income from other releases. With operating expenses in the form of development costs soaring each year, I don’t know how much confidence can be put in banking on the longevity of franchises going forward as an investor. Markets have guided for about $982-992 million in expenses for Q2 2025, but this was well over $1 billion in reality, raising further pressure on management to recoup such enormous investments. </p>\n<h2 class=\"wp-block-heading\"><strong>Record TTWO Stock Price Leaves Little for New Investors</strong></h2>\n<p>I would suggest caution for existing or potential investors as we get closer to the release of<em> GTA 6. </em>While this will likely be a massive commercial success when released, any development missteps, technical glitches, or consumer backlash could be a disaster for the company’s financials. </p>\n<p>The broader sector is seeing a general downturn as people struggle with a rising cost of living. Even such a cultural juggernaut may struggle to garner much momentum, especially if the cost of the game is potentially over $100, as many are reporting. </p>\n<p>With a <a href=\"https://www.tipranks.com/stocks/ttwo/financials\">P/S ratio of 5.97</a>, elevated earnings expectations are already reflected in the share price. With profits sliding of late, the company is now severely in the red, and I fear that investors may not stick around if the <em>GTA</em> bonanza fails to be the silver bullet many are hoping for.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/ttwo/financials/income-statement\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"395\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO2-1-1024x395.jpg\" alt=\"\" class=\"wp-image-1692833\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO2-1-1024x395.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO2-1-300x116.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO2-1-768x296.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO2-1.jpg 1233w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<h2 class=\"wp-block-heading\"><strong>Is Take-Two (TTWO) a Good Stock to Buy Now?</strong></h2>\n<p>Despite my bearish stance, most Wall Street analysts are expecting an upward re-rating of TTWO over the next 12 months. Currently, 17 analysts are rating TTWO as a Buy; one analyst considers it a Hold, while zero analysts have rated TTWO as a Sell. The average price target on TTWO stock is $205.83 per share, equating to around 8.2% upside potential over the next 12 months.</p>\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-large\"><a href=\"https://www.tipranks.com/stocks/ttwo/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"349\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO4-1024x349.jpg\" alt=\"\" class=\"wp-image-1692852\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO4-1024x349.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO4-300x102.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO4-768x262.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO4.jpg 1235w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure></div>\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-large\"><a href=\"https://www.tipranks.com/stocks/ttwo/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"269\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO5-1024x269.jpg\" alt=\"\" class=\"wp-image-1692855\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO5-1024x269.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO5-300x79.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO5-768x202.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/TTWO5.jpg 1229w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a><figcaption class=\"wp-element-caption\"><strong><a href=\"https://www.tipranks.com/stocks/ttwo/forecast\">See more TTWO analyst ratings</a></strong></figcaption></figure></div>\n<h2 class=\"wp-block-heading\"><strong>Take-Two Faces Precarious 2025 as Expectations Mount</strong></h2>\n<p>I fully expect the next few years to be exciting for Take-Two, with some genuinely excellent anticipated releases. However, from an investor perspective, many of TTWO’s endearing features have been highlighted multiple times, but its risks have not. </p>\n<p>With so much speculation surrounding the stock and so many things that could spoil the party, sentiment is brittle. Given the heightened uncertainty, cautious investors will seek better opportunities elsewhere. In contrast, risk-tolerant investors may want some exposure to one of the most significant cultural events in modern entertainment history despite the share price trading at just under all-time highs of around $200 per share.</p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/01/shutterstock_2397428743-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/leaked-gta-6-release-date-puts-pressure-on-take-two-ttwo-to-deliver",
            "author": "Gordon Best",
            "pub_date": "2025-01-31 03:01:50",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1688159,
            "title": "Archer Aviation Boards Midnight Express to Higher Highs in 2025",
            "description": "<html><head></head><body><p>Archer Aviation&nbsp;<a data-ticker=\"ACHR\" href=\"https://www.tipranks.com/stocks/achr\">(ACHR)</a>&nbsp;has soared 81% over the past year, significantly outperforming benchmark indices. As the maker of the electric-powered aircraft Midnight, ACHR has captured not only consumers’ imagination but also investors’ attention. As investors ask what the future holds for ACHR and the broader air mobility segment, consumers are asking when they can buy their first vehicle and how much it will cost.</p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<p>The answer to both is coming up.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/achr\"><img decoding=\"async\" loading=\"lazy\" width=\"783\" height=\"418\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR3.jpg\" alt=\"\" class=\"wp-image-1691572\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR3.jpg 783w, https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR3-300x160.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR3-768x410.jpg 768w\" sizes=\"(max-width: 783px) 100vw, 783px\"></a></figure>\n<p>Given the company’s high-risk, high-reward nature, I view it as a compelling investment at current levels backed by strong strategic alliances and several incoming price catalysts from the defense sector. If the big defense sector players are going long on Archer, maybe so should I.</p>\n<h2 class=\"wp-block-heading\"><strong>Introducing the Future of Urban Mobility</strong>: <strong>eVTOL</strong></h2>\n<p>Electric vertical takeoff and landing vehicles (eVTOLs) are positioned to revolutionize urban transportation. Functionally similar to helicopters, they offer vertical takeoff and landing without requiring runways. </p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://archer.com/\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"319\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ArcherMidnight-1024x319.jpg\" alt=\"\" class=\"wp-image-1691327\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ArcherMidnight-1024x319.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/ArcherMidnight-300x94.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/ArcherMidnight-768x240.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/ArcherMidnight-1536x479.jpg 1536w, https://blog.tipranks.com/wp-content/uploads/2025/01/ArcherMidnight.jpg 1754w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>However, they are quieter, emission-free, and more environmentally friendly. These all-electric aircraft could serve as future air taxis, reducing travel times from hours to mere minutes in densely populated cities worldwide.</p>\n<h2 class=\"wp-block-heading\"><strong>Archer Levitates Into a $5 Billion Opportunity</strong></h2>\n<p>According to <em>Mordor Intelligence</em>, the total addressable market for urban air mobility is expected to reach $5 billion by 2030, growing at an impressive 23% per year over the next five years. Given this potential, ACHR has already secured a market capitalization of around $4 billion despite generating no revenue thus far.</p>\n<p>Archer Aviation has yet to report revenues as it awaits regulatory approvals. However, the company is rapidly ramping up production of its eVTOL Midnight. The aircraft holds significant growth potential in both commercial and defense sectors. </p>\n<p>ACHR is in the final phase of the FAA’s Phase-4 type certification process and expects to begin reporting revenues as early as this year. Moreover, ACHR has secured over $6 billion in pre-orders for Midnight, positioning itself for substantial growth once commercialization begins.</p>\n<p>However, one cannot completely ignore the challenges that may not make the aspirational growth projections a reality. They include regulatory approvals, the need for dedicated takeoff and landing infrastructure, safety concerns associated with new air mobility technology, and the possibility of incurring higher costs than traditional urban transportation solutions like Uber and Lyft. Potential shareholder dilution due to the <a href=\"https://www.tipranks.com/stocks/achr/financials\">recent doubling of authorized shares</a> is also an issue.</p>\n<h2 class=\"wp-block-heading\"><strong>Several <strong>Defense Sector</strong> Price Catalysts for ACHR in 2025</strong></h2>\n<p>Archer’s new business unit, Archer Defense, has attracted investor interest, particularly following the recent political changes in the U.S. White House. Donald Trump’s pro-defense stance will assist companies like ACHR with future commercialization opportunities. It makes sense then that ACHR’s production is ramping up. The company completed its high-volume manufacturing facility in Georgia, with production expected to begin in early 2025. The facility will scale two aircraft per month by year-end, with a long-term target of 650 aircraft annually by 2030.</p>\n<p>Notably, ACHR’s defense business advisory board includes prominent retired military leaders, such as Lieutenant General (Ret) Scott Howell. While defense contracts may take time to materialize, they could significantly boost ACHR’s long-term revenue and earnings growth.</p>\n<h2 class=\"wp-block-heading\"><strong>Strategic Partnerships Fuel Near-Term Expansion</strong></h2>\n<p>Impressively, ACHR has won several meaningful partnerships across the world. It has collaborated with American defense technology company Anduril to develop a hybrid aircraft for the defense sector. ACHR has also partnered with Soracle, the joint venture between Japan Airlines and Sumitomo Corporation, to commence air mobility services in Japan. Its Midnight aircraft has secured an order of around $500 million, with Soracle taking ACHR’s total order book to a reassuring $6 billion, considering ACHR’s embryonic developmental stage.</p>\n<p>ACHR is also collaborating with the Abu Dhabi Investment Office to commence commercial air taxi services in the UAE toward the end of 2025. It’s unsurprising to see A<a href=\"https://www.tipranks.com/stocks/achr/ownership\">CHR having a high percentage of institutional&nbsp;owners</a>. Notably, the ACHR’s ownership structure is a mix of institutional, retail, and individual investors. Approximately&nbsp;22.61%&nbsp;of the company’s stock is owned by institutional investors,&nbsp;34.74%&nbsp;by insiders, and 42.66% by public companies and individual investors.</p>\n<p>If the smart money likes ACHR, regulatory hurdles will likely fall quickly.</p>\n<h2 class=\"wp-block-heading\"><strong>How High Can Archer Aviation Stock Go?</strong></h2>\n<p>Despite the company’s various risks, Wall Street is optimistic about Archer Aviation stock. On TipRanks, the stock carries a Strong Buy consensus rating based on six Buy, two Hold, and zero Sell ratings over the past three months. Notably, not a single analyst rates ACHR as a Sell.</p>\n<p>Currently, Archer Aviation’s average price target of $11.38 per share implies an almost 26% upside potential from current levels.</p>\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https://www.tipranks.com/stocks/achr/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"351\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR-1024x351.jpg\" alt=\"\" class=\"wp-image-1691397\" style=\"aspect-ratio:2.9223300970873787;width:840px;height:auto\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR-1024x351.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR-300x103.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR-768x263.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR.jpg 1231w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/achr/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"265\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR2-1024x265.jpg\" alt=\"\" class=\"wp-image-1691448\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR2-1024x265.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR2-300x78.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR2-768x199.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/ACHR2.jpg 1237w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a><figcaption class=\"wp-element-caption\"><a href=\"https://www.tipranks.com/stocks/achr/forecast\"><strong>See more ACHR analyst ratings</strong></a></figcaption></figure>\n<h2 class=\"wp-block-heading\"><strong>Midnight Could Put ACHR Skybound</strong></h2>\n<p>Archer Aviation has the potential to shape the future of urban air mobility. While it faces regulatory and operational challenges, its strategic alliances and strong growth roadmap make it an attractive investment for risk-tolerant investors. The company’s flagship design, Midnight, has the hallmarks of becoming the classic first model, which later generations look back upon to know what the first one looked like — similar to how the Ford Model A set the standard for automobiles back in 1903.</p>\n<p>Weighing up the risks and rewards, I see ACHR as a high-risk, high-reward opportunity worth considering at current levels. As the company builds up its customer base and eVTOL technology is gradually adopted worldwide, the risk of owning this stock will decline and eventually become like owning Ford or Toyota shares. Getting in at the ground floor of this technology being commercialized could be the best decision long-term value investors can make.</p>\n<p>Read full&nbsp;<a href=\"https://www.tipranks.com/legal/disclosure-1?ref=blog\">Disclosure</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/01/shutterstock_2191549325-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/archer-aviation-boards-midnight-express-to-higher-highs-in-2025",
            "author": "Devina Lohia",
            "pub_date": "2025-01-30 21:19:48",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1690563,
            "title": "TipRanks’ Perfect 10 Picks: 2 Top-Scoring Stocks That Could Be Hidden Gems",
            "description": "<html><head></head><body><p>After two years of bullish momentum, DeepSeek proved that the market is still vulnerable to sudden disruptions, reminding investors to be selective with their stock choices. You can’t predict when a black swan will appear, but you can strengthen your portfolio with resilient picks that deliver returns in any market environment.</p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<p>To make this easier, TipRanks developed the <a href=\"https://www.tipranks.com/screener/top-smart-score-stocks\">Smart Score</a> – an AI-powered tool designed to uncover strong investment opportunities. Using natural language processing, it sifts through vast amounts of market data, analyzing insights from thousands of traders, stocks, and millions of daily transactions to identify high-quality picks.</p>\n<p>The <a data-autolink=\"true\" href=\"https://www.tipranks.com/screener/top-smart-score-stocks\">Smart Score</a> makes it simple for you by using that data to rate every stock against a set of factors that are known to correlate with share outperformance. Then, it gives each stock a score – a single digit on a scale of 1 to 10 – with the ‘Perfect 10’ denoting the hidden gems, the nuggets of gold in the stream of stock data.</p>\n<p>Against this backdrop, we’ve opened up the Smart Score to find two of these top-scoring stocks that deserve a closer look. Let’s dive in.</p>\n<p><strong>ADTRAN Holdings</strong> <strong>(</strong><a href=\"https://www.tipranks.com/stocks/adtn/forecast\"><strong>ADTN</strong></a><strong>)</strong></p>\n<p>The first ‘Perfect 10’ stock on our list, Adtran, works in the telecom field. The company provides networking and communications equipment in both the domestic US markets and on the global scene. Adtran operates in 68 countries and gives its customers solutions for voice, data, video, and internet communications. It can work with a wide range of the network infrastructures operating around the world. These include fiber optic and aggregated networks, open optical networking, and residential and business connection solutions. The company also provides cloud software solutions and network infrastructure maintenance.</p>\n<p>Based in Huntsville, Alabama, and in the telecom business since 1985, the company has a market cap of ~$764 million, while its clients include private individuals, enterprise clients, and government entities.</p>\n<p>Adtran has a strong product line and a solid market position, but the company did see revenues and earnings fall in 3Q24. In that report, the company’s top line came to $227.7 million, down 16.4% year-over-year, while the non-GAAP earnings slipped from 18 cents per share to 5 cents per share in that period.</p>\n<p>It’s important to note that the telecom industry, like many others, is highly cyclical and that those cycles can bring opportunities for investors. Maintenance schedules need to be followed, networks need periodic upgrades, and new technology can bring wholesale replacements of existing infrastructure.</p>\n<p>Craig-Hallum analyst Christian Schwab, who is counted among the top 3% of his peers by TipRanks, sees this as a net-plus for Adtran.</p>\n<p>“We believe there is a meaningful upside opportunity in Adtran shares given the company’s positioning as a supplier of networking and communications equipment ahead of a multiyear trend of substantial fiber investments, rip-and-replace opportunities, emerging operating leverage and earnings power, and a strengthening balance sheet,” the 5-star analyst opined. “We believe as the company heads into 2025, coming off the recent market bottom, with a strong fundamental fiber investment backdrop, a multi-year path to annual revenue of $1.2+ billion and low double-digit operating margins can become more evident to investors, at which point we calculate the company can drive annual EPS of ~$1.00.”</p>\n<p>Given this potential, Schwab rates ADTN shares as a Buy, with a $15 price target that points toward a one-year gain of 53%. (To watch Schwab’s track record, <a href=\"https://www.tipranks.com/experts/analysts/christian-schwab\">click here</a>)</p>\n<p>There are six recent analyst reviews on record for Adtran shares, and they are unanimously positive for a Strong Buy consensus rating. The stock is priced at $9.82, and its average price target, $11.45, indicates room for a 16.5% gain in the coming year. (See <a href=\"https://www.tipranks.com/stocks/adtn/forecast\"><strong>ADTN stock forecast</strong></a>)</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1334.png\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"673\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1334-1024x673.png\" alt=\"\" class=\"wp-image-1690567\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1334-1024x673.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1334-300x197.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1334-768x505.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1334.png 1203w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p><strong>Workiva, Inc. (</strong><a href=\"https://www.tipranks.com/stocks/wk/forecast\"><strong>WK</strong></a><strong>)</strong></p>\n<p>Next on our list of top-scoring stocks is Workiva, a company offering its customers a cloud-based software platform for business data analysis. It’s vital in business to keep the left hand informed of what the right hand is doing – and that’s what Workiva’s platform is designed to do. The company boasts that it enables transparent reporting, with a ‘fit-for-purpose’ tech solution that streamlines processes, connects teams to their data and to their peers’ data, and ensures consistency of reporting formats. And it does all of this using an audit-ready cloud platform that is both controlled and secure. The company’s platform is available through the popular SaaS subscription model.</p>\n<p>In business since 2008, and headquartered in Iowa, Workiva today boasts a market cap of $6.2 billion. The company employs over 2,400 people out of 19 offices around the world, and claims that its software tools are in use by more than 6,000 customers in 180 countries.</p>\n<p>Workiva’s revenues have been trending upwards over the past several quarters, and this continued in the company’s last financial release, for 3Q24. Revenues in that quarter came to $186 million, up 17.7% year-over-year and some $3.42 million better than had been anticipated. At the bottom line, the company reported a non-GAAP EPS of 21 cents; while this missed the forecast by 2 cents per share, it was a strong turnaround from the 65-cent net EPS loss reported in the prior-year quarter. In the company’s investor letter, the CEO noted that Q3 saw strong demand, a high volume of account expansion deals, and record bookings.</p>\n<p>This stock has caught the eye of Raymond James analyst Brian Peterson, another expert counted in the top 3% of the Street’s analysts. Peterson is impressed by Workiva’s ability to bring in new bookings, and its potential to expand subscriptions and revenues.</p>\n<p>“We believe that the accelerating bookings dynamics observed in 3Q24 can continue and drive an acceleration in subscription revenue over the next 12 months. This dynamic coupled with positive (albeit early) commentary around the company’s multi-pronged approach to revamping its go-to-market organization (medium term tailwind), gives us confidence in the company’s ability to achieve its 2027 revenue target of $1.1-1.2 billion that we do not believe is reflected in the stock today,” Peterson stated. “Ultimately, we are hard-pressed to find a quality SaaS name with accelerating growth (&gt;20% subscription growth) and a medium term growth catalyst that still trades at a discount to the broader group, and see the potential for both estimates to come up and multiple expansion in 2025.”</p>\n<p>Peterson rates WK shares as Outperform (i.e., Buy), and he complements that with a $135 price target that suggests a one-year upside potential of 34%. (To watch Peterson’s track record, <a href=\"https://www.tipranks.com/experts/analysts/brian-peterson\">click here</a>)</p>\n<p>Like Adtran above, Workiva boasts a unanimously Strong Buy consensus rating, this one based on 8 Buy recommendations from the Street. The stock’s $100.47 trading price and $128 average target price together imply that the shares have a gain of ~27.5% in store for the year ahead. (See <a href=\"https://www.tipranks.com/stocks/wk/forecast\"><strong>WK stock forecast</strong></a>)</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1337.png\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"683\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1337-1024x683.png\" alt=\"\" class=\"wp-image-1690576\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1337-1024x683.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1337-300x200.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1337-768x512.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1337.png 1209w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>To find good ideas for stocks trading at attractive valuations, visit TipRanks’<a>&nbsp;</a><a href=\"https://www.tipranks.com/stocks-to-buy\">Best Stocks to Buy</a>, a tool that unites all of TipRanks’ equity insights.</p>\n<p><em>Disclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment.</em></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2022/08/TipRanks-0804-1-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/tipranks-perfect-10-picks-2-top-scoring-stocks-that-could-be-hidden-gems",
            "author": "Michael Marcus",
            "pub_date": "2025-01-30 19:02:47",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1689695,
            "title": "Applied Industrial Technologies (AIT) Smashes Quarterly Expectations, Analysts Are Bullish",
            "description": "<html><head></head><body><p>Applied Industrial Technologies <a data-ticker=\"AIT\" href=\"https://www.tipranks.com/stocks/ait\">(AIT)</a> announced top-and-bottom-line beats for Q2 of FY2025. This comes on the heels of the strategic acquisition of Hydradyne, a leading provider of fluid power solutions, along with various industrial macro data points showing signs of improvement, signals potential further upside on the horizon. With a recent 24% increase in the quarterly cash dividend, AIT may be an attractive option for income-oriented investors seeking growth.</p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/ait\"><img decoding=\"async\" loading=\"lazy\" width=\"779\" height=\"398\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1330.png\" alt=\"\" class=\"wp-image-1690242\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1330.png 779w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1330-300x153.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1330-768x392.png 768w\" sizes=\"(max-width: 779px) 100vw, 779px\"></a></figure>\n<h2 class=\"wp-block-heading\"><strong>Building a Leading Market Position</strong></h2>\n<p>Applied Industrial Technologies is a global distributor and service provider of industrial motion and control technologies, which include bearings, power transmission, fluid power, flow control, and automation solutions. The company’s services focus on enhancing the performance and cost efficiency of customers’ major capital equipment and production infrastructure, emphasizing technical expertise, comprehensive aftermarket support, and service capabilities.</p>\n<p>While customer demand has slightly increased recently, the company still faces a challenging macro environment, interest rate uncertainties, and varying end-market demand. On a positive note, various industrial macro data points show signs of improvement, and a less strict regulatory agenda under the new <a data-autolink=\"true\" href=\"https://www.tipranks.com/stocks/djt\">Trump</a> administration offers potential opportunities in many of the company’s legacy end markets.</p>\n<h2 class=\"wp-block-heading\"><strong>AIT Targets Growth Through Investments</strong></h2>\n<p>Management has recently initiated a concerted effort to position the company for more substantial growth through continuous investment in sales tools, operational systems, and technical talent. This also includes the recent strategic acquisition of Hydradyne.</p>\n<p>Hydradyne is a prominent provider of fluid power solutions. The acquisition is anticipated to strengthen Applied’s leading position in fluid power distribution in the U.S., leveraging Hydradyne’s technical expertise and product range across hydraulics, pneumatics, electromechanical systems, instrumentation, filtration, and fluid conveyance.</p>\n<p>Hydradyne, which employs nearly 500 associates across 33 locations in the Southern U.S., will help expand Applied’s footprint while enhancing its current fluid power service and solutions portfolio. With about 30% of Hydradyne’s sales linked to repair, engineering, and design, the acquisition aims to enhance customer offerings and boost cross-selling and market penetration. The combined technical teams will be better positioned to seize growth opportunities in emerging end markets and commercial applications.</p>\n<p>The acquisition is expected to contribute around $260 million in sales and $30 million in EBITDA before anticipated synergies in the first year. The company also anticipates it will be accretive to EPS, excluding transaction-related expenses and purchase accounting adjustments.</p>\n<h2 class=\"wp-block-heading\"><strong>Better-than-anticipated Recent Results</strong></h2>\n<p>Applied Industrial Technologies has announced its Fiscal 2025 second-quarter results. <a href=\"https://www.tipranks.com/stocks/ait/financials\" data-type=\"link\" data-id=\"https://www.tipranks.com/stocks/ait/financials\">Revenue of $1.1 billion</a> surpassed expectations, exceeding estimates by $20 million. Although net sales of $1.1 billion reflect a 0.4% year-over-year decrease, EBITDA rose by 3.3% year-over-year, reaching $135.1 million. Applied’s operating cash flow totaled $95.1 million, and free cash flow amounted to $89.9 million.</p>\n<p>The company reported a 6.7% increase in net income from the prior-year adjusted EPS, totaling $93.3 million or <a href=\"https://www.tipranks.com/stocks/ait/earnings\">$2.39 per share</a>, exceeding analyst expectations by $0.18.</p>\n<p>Applied announced that it would raise its <a href=\"https://www.tipranks.com/stocks/ait/dividends\">quarterly dividend by 24% to $1.48 per share</a>, the 16th increase since 2010.</p>\n<p>Management has offered revised fiscal guidance for 2025, projecting EPS in the range of $9.65 to $10.05, compared to the earlier projection of $9.25 to $10.00. Sales growth is now expected to be between 1% and 3%, a significant improvement from the previous guidance of a decline of 2.5% to an increase of 2.5%. EBITDA margins are predicted to land between 12.2% and 12.4%, slightly higher than the previously estimated 12.1% to 12.3%.</p>\n<h2 class=\"wp-block-heading\"><strong>Analysts Are Bullish</strong></h2>\n<p>The stock has been trending upward, climbing over 40% in the past year. It trades near the upper end of its 52-week price range of $176.32 – $282.98 and shows positive price momentum by trading above the <a href=\"https://www.tipranks.com/stocks/ait/technical-analysis\">20-day (254.07) and 200-day (223.05) moving averages</a>. With a P/S ratio of 2.17x, it appears relatively richly valued compared to the Industrials sector average of 1.55x.</p>\n<p>Analysts following the company have been bullish on AIT stock. Based on the recent recommendations of six analysts, Applied Industrial Technologies is rated a strong buy overall. The <a href=\"https://www.tipranks.com/stocks/ait/forecast\">average price target for AIT stock is $303.00</a>, which represents a potential upside of 19.08% from current levels.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/ait/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"344\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/AIT-Analyst-Chart-1-30-25-1024x344.png\" alt=\"\" class=\"wp-image-1689697\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/AIT-Analyst-Chart-1-30-25-1024x344.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/AIT-Analyst-Chart-1-30-25-300x101.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/AIT-Analyst-Chart-1-30-25-768x258.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/AIT-Analyst-Chart-1-30-25-1536x515.png 1536w, https://blog.tipranks.com/wp-content/uploads/2025/01/AIT-Analyst-Chart-1-30-25.png 1645w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<h2 class=\"wp-block-heading\"><strong>Final Analysis on AIT</strong></h2>\n<p>Applied Industrial Technologies’ recent impressive performance, bolstered by the strategic acquisition of Hydradyne, is shaking things up in the industrial tech sector. The company has exceeded expectations for its top-and-bottom lines for Q2 of FY2025. This, combined with an optimistic macro environment and a generous 24% increase in the quarterly cash dividend, positions AIT as a potentially solid option for income-oriented investors seeking growth.</p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-1\">Disclosure</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/01/AIT-Image-750x406.jpg",
            "link": "https://www.tipranks.com/news/applied-industrial-technologies-ait-smashes-quarterly-expectations-analysts-are-bullish",
            "author": "Casey Dylan, CIMA",
            "pub_date": "2025-01-30 16:57:40",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1686461,
            "title": "‘Biggest Digital Boom Since the Internet’s Dawn’: JMP Pounds the Table on 2 Digital Infrastructure Stocks",
            "description": "<html><head></head><body><p>It’s been a little over 30 years since the internet entered the public consciousness, and began changing the way that we approach business, education, work, and entertainment. In that time, we’ve witnessed the dot-com boom and bust, the rise of social media, and, more recently, the explosion of artificial intelligence.</p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<p>Backing this fast-growing digital front end is a rapidly expanding infrastructure network – comprising data centers, fiber-optic cables, cell towers, and other essential facilities and hardware that make our digital connections possible.</p>\n<p>Covering the digital infrastructure expansion from JMP, analyst Greg Miller writes: “We are in the midst of the largest digital infrastructure spend since the creation of the internet. Over the course of the next five years, we expect well over $1.0 trillion in digital infrastructure spending that will become the backbone of AI, cloud, and edge compute, and likely a wide variety of other applications we have yet to conceive.”</p>\n<p>“We believe we are in the early stages of elevated digital infrastructure spending for the next several years that will likely lead to positive estimate revisions, as well as multiple expansion for the stocks in the digital infrastructure universe,” the analyst added.</p>\n<p>With that in mind, Miller highlights several digital infrastructure stocks that could see double-digit gains. Using the <a href=\"https://www.tipranks.com/\">TipRanks database</a>, we’ve looked up the details on two of these picks – both rated as Strong Buys by the Street. Let’s dive in.</p>\n<p><strong>DigitalBridge Group</strong> <strong>(</strong><a href=\"https://www.tipranks.com/stocks/dbrg/forecast\"><strong>DBRG</strong></a><strong>)</strong></p>\n<p>The first stock we’ll look at is DigitalBridge. Over the past several years, this company has transformed itself from a REIT with a collection of real estate assets related to digital networking into a C-corp, focusing on investing shareholder and partner money into the digital world. Today, DigitalBridge is a global investment firm and asset manager, investing in digital infrastructure firms and taking both ownership and operational positions in its investment targets. DigitalBridge’s investment activity is organized across five verticals that are essential to the digital economic expansion: cell towers, data centers, edge infrastructure, fiber networks, and small cells.</p>\n<p>The company is based in Boca Raton, Florida—but its business footprint is global. DigitalBridge has offices in key locations around the world, including New York and Los Angeles in the US, along with London and Singapore overseas. The company has $88 billion in assets under management, and its portfolio contains investments in 45 digital infrastructure companies.</p>\n<p>DigitalBridge last reported financial results for 3Q24, and in that quarter, the company missed expectations on revenues. The top line came to $76 million, some $23.15 million below the forecast. At the bottom line, the company realized 6 cents per share in distributable earnings, a nickel per share better than had been anticipated.</p>\n<p>In his coverage of DigitalBridge, JMP’s Greg Miller notes that the company’s shift of its business model was not as smooth as had been planned at the outset, but also that, with the shift in the background now, the company is on track to realize gains going forward. He writes, “Despite the rocky start that involved a longer transition and different form than what we had originally anticipated, further compounded by the fact that fee-related earnings targets will take longer to achieve, we believe 2025 will represent a breakout year for Digital Bridge… While the stock has underperformed the broader market since new management has taken over, we believe the company has in fact reorganized the building blocks of a previously troubled company that will produce results that translate to an outperformance in the stock.”</p>\n<p>Miller’s comments back up his Outperform (i.e., Buy) rating on DBRG, while his price target of $16 implies a one-year upside potential of 53%. (To view Miller’s track record, <a href=\"https://www.tipranks.com/experts/analysts/gregory-j-miller\">click here</a>)</p>\n<p>The 10 recent analyst reviews on record for DigitalBridge split 9 to 1 in favor of Buy over Hold, giving the stock its Strong Buy consensus rating. The shares are priced at $10.46 and their $16.70 average price target, slightly more bullish than the JMP view, suggests that the stock will gain 59.5% in the next 12 months. (See <a href=\"https://www.tipranks.com/stocks/dbrg/forecast\"><strong>DBRG stock forecast</strong></a>)</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1273.png\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"565\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1273-1024x565.png\" alt=\"\" class=\"wp-image-1686492\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1273-1024x565.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1273-300x166.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1273-768x424.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1273.png 1207w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p><strong>Equinix</strong> <strong>(</strong><a href=\"https://www.tipranks.com/stocks/eqix/forecast\"><strong>EQIX</strong></a><strong>)</strong></p>\n<p>Equinix, the next stock on our list, is a global leader in the market for colocation data centers. These are data centers with rack space and server facilities available for rent – allowing tenants access to large-scale, high-end data center infrastructure without needing to maintain the hardware themselves. Equinix operates as a real estate investment trust, or REIT, owning and managing a portfolio of data centers around the world and leasing out space to its clients.</p>\n<p>Data centers are big business, fueled by the <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> boom, the expansion of cloud computing, and increasing demand for high-speed computing – and Equinix is right there in the middle of it. The company’s global footprint includes data center properties across the Americas, in Europe, East Asia, Australia, India, the Middle East, and Africa. In all, Equinix has more than 260 data centers in 73 of the world’s major urban areas.</p>\n<p>The company boasts that it can offer its customers secure and scalable data center services, and customers are taking the firm up on that. Equinix has more than 10,000 customers leasing space in its facilities, including well over 300 of the Fortune 500 companies.</p>\n<p>On the financial front, Equinix’ 3Q24 results were dissapointing. The top-line revenue figure of $2.2 billion was up almost 7% year-over-year – but missed the forecast by $10 million. The quarterly funds from operations (FFO, a key metric for REITs) came to $6.36 per share, up 39 cents from the year-ago quarter – but missing the forecast by 9 cents. At the same time, however, the company’s earnings headline boasted of 87 consecutive quarters of revenue growth.</p>\n<p>Checking in with Miller at JMP, we find the analyst focused on that last point – the extended period of revenue growth – as the base for his upbeat take on the stock. He says of Equinix, “There are very few names we have covered over the decades that have driven double-digit revenue growth for well over a decade after many viewed the business as maturing. With a resurgence in activity levels of companies again pulling selective applications from public cloud solutions, we expect demand to continue. While most of the AI-related deployments have been focused on machine learning, with less of a need for super low latency, we believe the next wave of AI deployments will increasingly focus on data centers like that of Equinix for that very reason.”</p>\n<p>Miller rates EQIX shares as Outperform (i.e., Buy), and he gives the stock a price target of $1,200 to show its potential for a 32% share price increase in the coming year.</p>\n<p>Equinix has picked up 22 recent Wall Street reviews, including 18 rated as Buy and 4 rated as Hold, for that coveted Strong Buy consensus. The shares are currently priced at $906.81; their $1,027.90 average target price indicates that the stock has room to grow 13% by this time next year. (See <a href=\"https://www.tipranks.com/stocks/eqix/forecast\"><strong>EQIX stock forecast</strong></a>)</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1274.png\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"549\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1274-1024x549.png\" alt=\"\" class=\"wp-image-1686493\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/image-1274-1024x549.png 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1274-300x161.png 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1274-768x412.png 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/image-1274.png 1204w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>To find good ideas for stocks trading at attractive valuations, visit TipRanks’&nbsp;<a href=\"https://www.tipranks.com/stocks-to-buy\">Best Stocks to Buy</a>, a tool that unites all of TipRanks’ equity insights.</p>\n<p><em>Disclaimer: The opinions expressed in this article are solely those of the featured analyst. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment.</em></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/01/shutterstock_1062915266-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/biggest-digital-boom-since-the-internets-dawn-jmp-pounds-the-table-on-2-digital-infrastructure-stocks",
            "author": "Michael Marcus",
            "pub_date": "2025-01-29 18:56:49",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1683149,
            "title": "Resist Temptation to Buy the Dip in ARM Stock",
            "description": "<html><head></head><body><p>Aspirational CPU manufacturer Arm Holdings <a data-ticker=\"ARM\" href=\"https://www.tipranks.com/stocks/arm\">(ARM)</a> stock plummeted earlier this week as the <a href=\"https://www.tipranks.com/news/everyones-obsessed-with-deepseek-but-its-business-as-usual-for-quantum-computing\">DeepSeek saga</a> wiped billions from Western tech firm valuations. As the dust settles, the question is: should investors buy the dip in ARM stock?</p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<p>Regardless of the macro-political shadow, the events unfolding on our screens do not alter my broader thesis about the tech revolution. I see the tech stock selloff as broadly overdone. However, that doesn’t mean I expect a recovery in all futuristic tech stocks across the board. There will be winners and losers from the cornucopia of events unfolding in the tech/<a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">AI</a> sector right about now, and I don’t see ARM as one of the winners.</p>\n<p>I see shareholder value to be found elsewhere in the tech space rather than in Arm Holdings. Despite this week’s 10% share price correction, I would counsel restraint for tech-focused buy-the-dip bargain hunters eyeing a long position in ARM.</p>\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.tipranks.com/stocks/arm\"><img decoding=\"async\" loading=\"lazy\" width=\"792\" height=\"618\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ARM3.jpg\" alt=\"\" class=\"wp-image-1686271\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ARM3.jpg 792w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM3-300x234.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM3-768x599.jpg 768w\" sizes=\"(max-width: 792px) 100vw, 792px\"></a></figure>\n<p><span style=\"box-sizing: border-box; margin: 0px; padding: 0px;\">Given its hard-to-justify valuation, <a href=\"https://www.tipranks.com/news/arm-holdings-expensive-even-if-the-most-optimistic-tech-forecasts-are-correct\">I’ve been bearish on ARM for months</a></span>, with this week’s events further corroborating my bearish position on this dippy stock.</p>\n<h2 class=\"wp-block-heading\"><strong>ARM Caught in DeepSeek Crossfire</strong></h2>\n<p>ARM stock slumped on Monday as the DeepSeek saga piled pressure onto tech stocks, with shares in the British chip designer tumbling 10%, before recovering somewhat in after-hours trading. This decline came amid a broader wave of selling in the <a data-autolink=\"true\" href=\"https://www.tipranks.com/compare-stocks/artificial-intelligence\">artificial intelligence</a> (AI) sector, triggered by the success of Chinese startup DeepSeek’s language model. </p>\n<p>The selloff occurred just days after <a href=\"https://www.tipranks.com/news/stargate-project-trumps-500-billion-gamble-unites-tech-rivals-in-new-ai-arms-race\">the Stargate Project</a> was first announced — a $500 billion, four-year initiative to build AI infrastructure in the U.S. Importantly for ARM investors, the Stargate Project involves Arm Holdings and its parent company, SoftBank <a data-ticker=\"SFTBY\" href=\"https://www.tipranks.com/stocks/sftby\">(SFTBY)</a>, as key collaborators and funding partners.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/arm/advanced-chart?ticker=SFTBY&amp;ticker=CLS&amp;ticker=CRDO\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"447\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ARM4-1024x447.jpg\" alt=\"\" class=\"wp-image-1686287\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ARM4-1024x447.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM4-300x131.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM4-768x335.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM4-1536x671.jpg 1536w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM4.jpg 1624w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<p>The sell-off in ARM stock was nowhere near as pronounced as in other parts of the market. Personal stock favorites of mine, Celestica <a data-ticker=\"CLS\" href=\"https://www.tipranks.com/stocks/cls\">(CLS)</a> and Credo Technology <a data-ticker=\"CRDO\" href=\"https://www.tipranks.com/stocks/crdo\">(CRDO)</a> shed nearly 30% as <a href=\"https://www.tipranks.com/stocks/arm/advanced-chart?ticker=SFTBY&amp;ticker=CLS&amp;ticker=CRDO\">investors fled from AI infrastructure en masse</a>. </p>\n<p>If one were looking to buy some dips, companies like NVDA, CLS, and CRDO would be far better options than ARM, in my opinion.</p>\n<h2 class=\"wp-block-heading\"><strong>What Does Cheaper AI Mean for ARM?</strong></h2>\n<p>The DeepSeek revelation, if taken at face value, presents significant challenges for ARM. As a chip designer, ARM’s business model relies heavily on licensing its designs to manufacturers for various devices, including those used in AI applications. DeepSeek’s achievement of creating a highly competitive AI model at 2% of the regular cost and with fewer chips due to U.S. export restrictions, threatens to disrupt the status quo in AI development.</p>\n<p>Cheaper manufacturing methods reduce demand for high-performance, specialized AI chips, potentially impacting ARM’s sales and licensing revenue. The industry may shift towards more efficient, cost-effective solutions, forcing ARM to adapt its designs to meet new requirements. Furthermore, Nvidia’s <a data-ticker=\"NVDA\" href=\"https://www.tipranks.com/stocks/nvda\">(NVDA)</a> endorsement of DeepSeek’s approach lends credibility to this new direction, potentially accelerating the trend toward cheaper development.</p>\n<p>With this in mind, ARM may need to pivot its strategy, focusing on designing chips optimized for efficiency and cost-effectiveness rather than raw power. This shift could require significant R&amp;D re-investment and a reevaluation of ARM’s product roadmap to remain competitive in the rapidly evolving AI chip market.</p>\n<h2 class=\"wp-block-heading\"><strong>DeepSeek Questions Remain Unanswered</strong></h2>\n<p>Specific questions remain unanswered concerning DeepSeek’s breakthrough development. First among those is whether the Chinese company could access more advanced chips. CEO of Scale AI, Alexandr Wang, told Bloomberg TV at Davos that DeepSeek likely had access to around 50,000 H100 chips. The H100, which has not been approved for sale in China by the U.S. government, reportedly costs around $27,000-40,000.</p>\n<p>This suggests that Chinese entities are evading sanctions. Moreover, commentators have pointed out that Singapore is one of Nvidia’s largest clients, with 22% of billings coming from the country in Q3. This seems inexplicably large for a small, gas-dependent city-state, and these Singaporean orders may represent a backdoor to China.</p>\n<p>Why is this important for investors? If DeepSeek built its AI model on copious numbers of H100 chips, it would reinforce the thesis that the world needs more high-powered chips and data centers to advance AI. </p>\n<h2 class=\"wp-block-heading\"><strong>Lofty ARM Valuation is Unsustainable</strong></h2>\n<p>My bearish stance is based on <a href=\"https://www.tipranks.com/stocks/arm/financials\">ARM’s lofty valuation from key metrics</a>. The company’s forward price-to-earnings (P/E) ratio of 93.5x is significantly higher than the IT sector median of 25.2x, representing a 271.8% premium. Similarly, ARM’s price-to-earnings-to-growth (PEG) ratio of 2.84 is 55.5% above the sector median. These elevated multiples suggest investors are pricing in substantial long-term growth expectations. To top it off, its current P/E ratio is an eye-watering 269.</p>\n<p>Compared to historical averages, ARM’s current valuation is also stretched. The company’s forward P/E ratio has fluctuated, reaching as high as 108.7x in June 2024. While the current forward P/E is lower than recent peaks, it remains considerably above sector norms, indicating a potentially overvalued status in the current market. Even when accounting for the firm’s ultra-impressive margins, the valuation is hard to justify.</p>\n<h2 class=\"wp-block-heading\"><strong>What is the Future Price of ARM Stock?</strong></h2>\n<p>On TipRanks, ARM stock carries a Moderate Buy rating based on 14 Buy, four Hold, and one Sell ratings assigned by analysts over the past three months. The&nbsp;average ARM stock price target&nbsp;is $157.20, implying approximately 5% upside potential over the next 12 months.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/arm/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"333\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ARM-1024x333.jpg\" alt=\"\" class=\"wp-image-1686231\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ARM-1024x333.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM-300x98.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM-768x250.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM.jpg 1279w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a></figure>\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.tipranks.com/stocks/arm/forecast\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"268\" src=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ARM2-1024x268.jpg\" alt=\"\" class=\"wp-image-1686232\" srcset=\"https://blog.tipranks.com/wp-content/uploads/2025/01/ARM2-1024x268.jpg 1024w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM2-300x78.jpg 300w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM2-768x201.jpg 768w, https://blog.tipranks.com/wp-content/uploads/2025/01/ARM2.jpg 1220w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></a><figcaption class=\"wp-element-caption\"><a href=\"https://www.tipranks.com/stocks/arm/forecast\"><strong>See more ARM analyst ratings</strong></a></figcaption></figure>\n<h2 class=\"wp-block-heading\"><strong>Strong ARM Insufficient to Warrant Heavy Portfolio Lift</strong></h2>\n<p>Despite ARM’s leading market position, early-mover advantage, and pioneering market aspirations, I remain strongly bearish on the stock given that its inflated valuation metrics far exceed sector norms, implying substantial long-term growth may be more challenging to achieve than first thought. </p>\n<p>While the company is integral to AI infrastructure development, disruptive competition from DeepSeek and potential shifts toward cost-efficient solutions will likely restrict meaningful future growth. At current multiples, the stock is overvalued and vulnerable to a growing number of risks, including from the political sphere of influence, which further muddies the waters in a sector already riddled with asymmetric market risks.</p>\n<p>I consider ARM a decent company, but considering its sector and the technology it has developed, other market players perform better from a shareholder perspective. Therefore, I remain bullish on the big tech themes, actively changing life as we know it, but somewhat bearish on ARM Holdings.</p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-1\">https://www.tipranks.com/legal/disclosure-1</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/01/shutterstock_2141093553-750x406.jpg",
            "link": "https://www.tipranks.com/news/article/resist-temptation-to-buy-the-dip-in-arm-stock",
            "author": "James Fox",
            "pub_date": "2025-01-29 18:32:21",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 1686094,
            "title": "Using TipRanks’ Dividend Calculator for Effective Investment Planning",
            "description": "<html><head></head><body><p>Making wise investment choices requires a lot of research, planning, and analysis. Using resourceful investment planning tools such as a dividend calculator can simplify the investors’ stock-picking process. <a href=\"https://www.tipranks.com/tools/dividend-calculator\">TipRanks’ Dividend Calculator</a> can act as an essential tool that aims to ease investors’ investment journey, especially for those looking to earn regular income by investing in <a href=\"https://www.tipranks.com/dividends/best-high-dividend-stocks\">high-yield dividend stocks</a>.</p><div><h3 style=\"text-decoration: underline;\">Invest with Confidence: </h3><ul><li>Follow <a data-link=\"article_promo\" href=\"https://www.tipranks.com/experts/analysts\">TipRanks' Top Wall Street Analysts</a> to uncover their success rate and average return. </li><li>Join thousands of data-driven investors – Build your <a data-link=\"article_promo\" href=\"https://www.tipranks.com/smart-portfolio/holdings\">Smart Portfolio</a> for personalized insights. </li></ul></div>\n<h2 class=\"wp-block-heading\"><strong>Why Are Dividends Important?</strong></h2>\n<p>Dividends are important to ensure a steady return/income on your portfolio. Dividends are regular monthly/quarterly/semi-annual/annual cash payments made to shareholders. Companies often reward shareholders by sharing a part of their profits as dividends with investors. &nbsp;</p>\n<p>Dividends are especially important for investors who want to earn regular income to meet their financial obligations. It is advisable to have at least a few dividend-paying stocks to diversify and safeguard your portfolio. What’s even better is that dividends are received as a reward over and above the share price appreciation from the stock’s price movement. Dividends also imply that the company has a healthy business and strong balance sheet, which enables regular payouts.</p>\n<p>An investor can compare the dividend yields of stocks to understand which one offers a better return. The dividend yield is calculated by dividing the annual dividend by the stock’s current price. Since companies pay dividends on a per share basis, it becomes easier to compare payouts and understand your returns as a proportion of your investment.</p>\n<h2 class=\"wp-block-heading\"><strong>Features of TipRanks’ Dividend Calculator</strong></h2>\n<p>The TipRanks’ Dividend Calculator is loaded with all the essential features that make it an effective financial tool. The tool helps investors calculate potential dividend income over a period of time from a particular stock. Investors also get the option to customize the number of shares, investment amount, holding period, expected dividend yield, distribution frequency, and expected dividend increase as well as the option to select DRIP (Dividend Reinvestment Plan).</p>\n<p>An investor has to simply provide these basic inputs and the calculator does the rest for you. You will see all the required fields in a tabular format, including the expected annual dividend, annual contribution, and year-end stock price.</p>\n<h2 class=\"wp-block-heading\"><strong>Benefits of Using TipRanks Dividend Calculator</strong></h2>\n<p>Having understood the basics of dividends and why we must include dividend-paying stocks in our portfolio, now let’s quickly understand the benefits of using the TipRanks Dividend Calculator tool.</p>\n<ul>\n<li><strong>Determine Potential Income from Investments</strong> – You can easily calculate the potential income from dividend-paying stocks. This helps plan and manage your financial goals since dividends act as a supplementary source of income.</li>\n<li><strong>Compare and Analyze Stocks</strong> – You can calculate the potential dividend yields of dividend-paying stocks and compare them. This analysis helps investors understand which stock is best aligned with their financial objectives.</li>\n<li><strong>Portfolio Management and Shuffle</strong> – Calculating dividend income and yields of different stocks can help to evaluate their effective returns. By studying this, you can decide to exit/increase/add a particular stock to your portfolio, thus aiding in efficient portfolio management.</li>\n<li><strong>Effective Tax Planning</strong> – Ordinary dividend payments are taxable in the U.S. Investors can use the TipRanks dividend calculator to understand the potential tax implications in their jurisdictions by inputting the correct dividend tax rate. The tool allows you to understand any tax liabilities that may arise in the future. This information is important for effective tax planning and minimizing tax liabilities. &nbsp;</li>\n<li><strong>Managing Risk</strong> – Although dividend-paying companies are considered financially sound, the dividend calculator can help you understand the potential risk arising from the increase or decrease of future dividend payments from the stocks. &nbsp;</li>\n<li><strong>Planning Retirement Income</strong> – Investors nearing their retirement age could include more dividend-paying stocks in their portfolios to plan effectively for their retirement. A steady dividend income can help meet your retirement goals and smoothen your retirement journey. You can use the TipRanks Dividend Calculator to compare and analyze high dividend-yielding stocks.</li>\n</ul>\n<h2 class=\"wp-block-heading\"><strong>Ending Thoughts</strong></h2>\n<p>Investors can leverage the TipRanks Dividend Calculator to understand the potential returns from their investments and assess all the benefits discussed above. A dividend calculator is one of the most efficient financial planning tools that enables efficient investment planning. Having said that, dividends are just one part of the investment story. Investors must undertake thorough research and financial analysis of stocks before investing in them. TipRanks offers a wide array of stock analysis tools and ideas that can aid in your investment journey.</p>\n<p><a href=\"https://www.tipranks.com/tools/dividend-calculator?ticker=MO&amp;sharePrice=53.45&amp;numberOfShares=100&amp;holdingPeriod=10&amp;expectedDividendYield=7.8100000000000005&amp;distributionFrequency=4&amp;annualContribution=0&amp;dividendTaxRate=0&amp;investmentAmount=5345&amp;expectedAnnualDi\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Use TipRanks’ Dividend Calculator to maximize your dividend income</strong></a></p>\n<p><a href=\"https://www.tipranks.com/legal/disclosure-1?ref=blog\">Disclosure</a></p>\n</body></html>",
            "image": "https://blog.tipranks.com/wp-content/uploads/2025/01/shutterstock_2467412829-750x406.jpg",
            "link": "https://www.tipranks.com/news/using-tipranks-dividend-calculator-for-effective-investment-planning",
            "author": "Sheryl Sheth",
            "pub_date": "2025-01-29 17:33:14",
            "source": "tipranks_others",
            "kind": 1,
            "language": "en"
        }
    ]
}