{
    "data": [
        {
            "id": "69a2d8ccf3bac3b7e4e77249",
            "title": "新華社發文談十五五時期香港發展方向　需拓展歐美市場聚焦國家科技戰略需求",
            "description": "新華社發表文章，提及香港在「十五五」時期的發展方向，提到在貿易方面，要不斷拓展歐美市場，而創科方面，則要聚焦國家科技戰略需求，協助突破關鍵核心技術。\n\n「十五五」規劃建議中提出，要鞏固提升香港國際金融、航運、貿易中心地位，支持香港建設國際創新科技中心。新華社發文，就這四大中心在這五年如何發展提出方向。\n\n在國際金融中心方面，要進一步深化香港與內地互聯互通，豐富離岸人民幣業務，優化證券市場，開拓海外新資金，發展香港國際黃金交易中心。\n\n在國際航運中心方面，要求香港完成構建港口智慧系統，積極推動航運產業鏈轉型升級。\n\n在國際貿易中心方面，要求加快構建高增值供應鏈服務中心，不斷開拓歐美市場，進一步強化與「一帶一路」國家貿易機制對接。\n\n國際創新科技中心方面，要求香港深度融入粵港澳大灣區國際科技創新中心建設，聚焦人工智能(AI)、生命健康等國家科技戰略需求，補足內地前沿領域的基礎研究弱項，助力國家關鍵核心技術突破，努力成為國家原始創新重要策源地。\n\n文章又稱在這五年，香港經濟社會發展的各項措施要主動對接國家「十五五」規劃，全面推進金融、創科發展雙引擎建設，並同世界各地展開更廣泛、更緊密的交流合作，引進及培養國家急需的前沿領域高端科研人才。",
            "link": "https://news.tvb.com/sc/finance/69a2d8ccf3bac3b7e4e77249",
            "pub_date": "2026-02-28 20:25:51",
            "source": "tvb",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": "69a26fc6f3bac3b7e4e4022a",
            "title": "財政預算案2026｜陳茂波：轉撥外匯基金不會常態化　政府有多種收入支持",
            "description": "《財政預算案》提出，從外匯基金轉撥1,500億元，支持北都及基建發展。財政司司長陳茂波指，未來數年經濟前景明朗，撥款不會常態化。\n\n《財政預算案》推出多項措施，加速推動北部都會區發展。為應付龐大工程費用，相隔42年再次動用外匯基金，分兩年轉撥1,500億元發展基建。\n\n被問及若外匯基金出現虧損，未來兩年是否照樣轉撥，財政司司長陳茂波這樣回應。\n\n財政司司長陳茂波說：「整個中期預測，除了1,500億元分兩年轉撥，其實沒有其他轉撥預計在內。同時即使沒有其他轉撥，我們壓縮開支增長，同時適度增加收入，未來數年，加上做基建，部分用市場資金通過發債，其實我們相當穩健，目前看不到有需要，要再做經常性轉撥。」\n\n政府過往收益主要靠賣地，以往多達逾千億元。今年推出九幅私人住宅地，預計收入亦僅180億元。陳茂波指盈餘估算偏向保守，亦有多種收入支持，不需一定倚賴賣地。\n\n陳茂波指：「我們未來數年測算，就算地價跟過往比較，低於歷史平均數，通過招商引資及不同優惠政策，吸引更多企業來，就會轉化成利得稅、薪俸稅。基礎建設投資，通過適度發債支持，確保我們有足夠財政空間，應對萬一市場波動，或外圍環境特殊變化，在『組合拳』中手段多很多。」\n\n對於有市民認為「派糖」力度不足，陳茂波指今年增加了免稅額，市民可長遠受惠。",
            "link": "https://news.tvb.com/sc/finance/69a26fc6f3bac3b7e4e4022a",
            "pub_date": "2026-02-28 13:16:04",
            "source": "tvb",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": "69a2693cf3bac3b7e4e3d22c",
            "title": "澳門減辣未能扭轉樓價跌勢　有學者認為居民入市態度仍審慎",
            "description": "澳門自今年起樓市減辣，刺激上月私人住宅物業成交按年急增四成，不過，樓價未能扭轉跌勢。有學者認為居民入市態度仍然審慎。\n\n澳門今年元旦起，總值600萬澳門元以下的住宅物業成交豁免印花稅，以及上調樓按比例上限至八成。\n\n最新統計顯示，一月份私人住宅成交有384宗，按年急增四倍。價格方面，每平方米是69,241澳門元，按年跌近約百分之3.7。數據反映樓市未能恢復價量齊升，有地產業界認為，市場仍然需要時間才能恢復信心。\n\n中原地產澳門及珠海橫琴資深董事何兆恆說：「其實是比較向好的數字，當然我們有擔心，始終過去幾年有不少人供款能力變弱，導致有債務或急切要賣的業主，都仍然存在，需要時間消化。未必可令到樓市有馬上反彈的跡象。」\n\n澳門居民去年12月銀行存款逾8,000億澳門元，按月增加百分之1.2。有學者認為，數據反映居民傾向儲蓄為主，入市買「磚頭」的態度仍然審慎。\n\n澳門經濟學會會長劉本立指出：「澳門總存款(按年)增加百分之七，反而貸款較低沉，減少了一點，反映暫時來說居民的消費和投資上，情願多儲蓄，消費和投資上採取較為審慎的態度。」\n\n劉本立又認為總體來說，澳門經濟平穩向好，但仍須要審慎關注外部環境變化，與內部發展不平衡所帶來的挑戰。",
            "link": "https://news.tvb.com/sc/finance/69a2693cf3bac3b7e4e3d22c",
            "pub_date": "2026-02-28 12:31:42",
            "source": "tvb",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": "69a14b2df3bac3b7e4da3d5e",
            "title": "美國新關稅會否引發貿易夥伴反擊？四大風險恐引爆新戰線｜財經．延伸閱讀",
            "description": "過去一年，從日本到英國，多國為逃避美國總統特朗普的關稅大棒，紛紛向華府作出重大讓步，以換取貿易協議。然而，隨著美國最高法院的裁決及特朗普推出新的關稅計劃，全球貿易格局瞬間重塑，這些協議所帶來的優勢已大不如前。這是否意味著美國的貿易夥伴將開始退出協議，甚至引發新一輪全球貿易戰？\n\n根據《彭博經濟研究》的基準預測，大多數國家短期內仍會遵守協議，畢竟特朗普手中還握有其他貿易工具，但隨著新關稅的實施，部分國家可能出現抵觸情緒，甚至引發新的貿易摩擦，以下是市場密切關注的四大風險：\n\n（一）歐盟叫停審批程序　美歐貿易協議面臨「流產」\n\n美國最高法院作出裁決及特朗普宣布替代性關稅後，歐洲議會以需要進一步釐清美國關稅計劃為由，暫停歐美貿易協議的審批程序。歐盟評估後發現，美國新關稅實施後，累積關稅稅率將導致部分商品，如塑料和化學品等的關稅，超過協議中約定的15%上限。\n\n雖然《彭博經濟研究》估計受影響的貿易額有限，但如果華盛頓方面執意實施這些關稅，歐盟極有可能不會批准該協議，屆時將引發新的貿易摩擦。\n\n（二）印度推遲磋商　5,000億美元採購承諾恐生變\n\n在最高法院宣布裁決約三周前，印度才與華盛頓達成臨時貿易框架。然而，新德里方面目前已推遲旨在最終敲定協議的對美磋商。該協議中的部分條件，例如要求印度採購5,000億美元美國商品，對印度政府而言將付出巨大政治代價。\n\n《彭博經濟研究》指出，許多商品的關稅稅率目前已經降至10%，若同意協議中18%的稅率，在印度國內將很難被接受。分析預計，印度將繼續與美國談判，但會試圖重新協商條款，例如爭取降低關稅稅率，或擴大美國市場准入。然而，任何被視為拖延的行為都可能引發特朗普的報復，他曾威脅要對行動不夠迅速的政府採取行動。\n\n（三）中國成最大受益者之一　但若關稅回升將強力反制\n\n中國被認為是美國最高法院裁決的最大受益者之一，其關稅稅率從約31%降至21%，這增強了北京維持中美貿易休兵的動力。然而，《彭博經濟研究》警告，如果華盛頓試圖利用特朗普擁有的多種選項，將對華關稅恢復到裁決前的水平，北京方面可能會視其為新一輪升級，並果斷實施反制措施。\n\n（四）日韓巨額投資承諾　或隨關稅升級而放緩\n\n作為與美國貿易協議的一部分，日本和南韓分別承諾向美國投資5,500億美元和3,500億美元，但這些承諾可能需要數年才能兌現，目前日本僅宣布了360億美元投資。兩國政府目前均表示將遵守現有協議，但同時強調不希望關稅稅率超出協議條款。\n\n《彭博經濟研究》認為，如果特朗普的新關稅計劃大幅提高稅率，可能促使兩國尋求重新談判協議條款，或放緩後續投資，此舉將面臨美國報復及雙邊關係廣泛惡化的風險。",
            "link": "https://news.tvb.com/sc/finance/69a14b2df3bac3b7e4da3d5e",
            "pub_date": "2026-02-28 09:01:33",
            "source": "tvb",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": "69a2343ff3bac3b7e4e23307",
            "title": "美元匯價自去年十月以來首錄單月升幅",
            "description": "美元匯價自去年十月以來，首次錄得單月升幅。\n\n反映美元兌六隻主要貨幣的美匯指數，收市報97.646，跌百分之0.15，但全月計，就升百分之0.67。相反，歐元自去年十月以來，首次錄得單月跌幅。\n\n美元兌日圓單日微跌，全月計就升超過百分之0.4。利率期貨市場預期，美國聯邦儲備局直至六月，都會維持利率不變。",
            "link": "https://news.tvb.com/sc/finance/69a2343ff3bac3b7e4e23307",
            "pub_date": "2026-02-28 08:36:00",
            "source": "tvb",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": "69a23456f3bac3b7e4e233e7",
            "title": "比特幣回落至65000美元水平",
            "description": "美國新公布通脹數據較預期高，比特幣回落至65,000美元水平。\n\n比特幣一度跌穿65,000美元，低見64,954美元，目前就在66,000美元以下徘徊，跌幅逾百分之2。\n\n有業內人士表示，比特幣已有多個星期在區間上落，但波幅正在上升，因為交投量減少。比特幣近月一直在62,000，至70,000美元上落。",
            "link": "https://news.tvb.com/sc/finance/69a23456f3bac3b7e4e233e7",
            "pub_date": "2026-02-28 08:36:00",
            "source": "tvb",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": "69a22ce5f3bac3b7e4e1f643",
            "title": "新世界發展表示業績會隨市況好轉逐步改善",
            "description": "新世界發展表示，業績會隨著市況好轉，逐步改善。\n\n新世界發展行政總裁黃少媚稱：「未來我們會繼續優化營運效率，繼續努力提升賣樓成績，以及經常性收益，嚴格管理開支，繼續做到穩中有進，我有信心在市況好轉後，盈利表現會逐步改善。大家都應該知道，地產行業周期比較長，所以策略成果都需要較長時間，才可以完全顯示出來。」",
            "link": "https://news.tvb.com/sc/finance/69a22ce5f3bac3b7e4e1f643",
            "pub_date": "2026-02-28 08:06:50",
            "source": "tvb",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": "69a21ef9f3bac3b7e4e1831e",
            "title": "花旗下調美股評級　指不利因素包括特朗普政策反覆無常",
            "description": "瑞銀下調美國股市評級，由「增持」降至「基準」配置，原因是過去多年，推動美股的關鍵因素正開始減弱。\n\n瑞銀的報告提到，美元風險是主要隱憂，預計歐元兌美元在今年首季末，將升至1.22水平，美元的結構性下行風險正在增加。按歷史數據，美元貿易加權指數每跌一成，美股便會跑輸大市約百分之4。\n\n此外，過往支持美國強勢的企業回購行動，亦正在失去優勢，美股的股東總收益率，即股息加上回購，現僅為歐洲的一半。而在政治上，美國總統特朗普反覆無常的政策，正是另一項不利因素。",
            "link": "https://news.tvb.com/sc/finance/69a21ef9f3bac3b7e4e1831e",
            "pub_date": "2026-02-28 08:01:37",
            "source": "tvb",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": "69a14b4bf3bac3b7e4da3f31",
            "title": "日揆提名兩「再通脹」學者入央行　市場解讀：加息步伐或放慢｜財經．延伸閱讀",
            "description": "日本首相高市早苗政府再有新動作，她提名兩位主張「再通脹」的學者加入日本央行政策委員會，市場即時解讀為當局對快速加息態度審慎，消息一度刺激日圓回落。\n\n首相首次直接影響央行　提名兩學者立場鮮明\n\n日本政府本周三宣布，提名青山學院大學教授佐藤綾野和中央大學教授淺田統一郎，接替即將卸任的審議委員野口旭和中川順子。其中，野口的五年任期將於3月結束，中川的任期則於6月屆滿。\n\n這是高市早苗上任以來，首次有機會直接影響日本央行九人貨幣政策的委員會組成。市場參與者一直密切注視她在月初取得選舉勝利後的經濟方針，而這次提名兩位與「再通脹」經濟政策相關的學者，即時引發市場震盪。\n\n學者解讀：強烈信號顯示對加息謹慎\n\n瑞銀證券日本公司首席經濟學家Masamichi Adachi對此表示驚訝，形容兩人都是「徹頭徹尾的再通脹主義者」。他認為，在當前日圓疲軟和通脹問題持續，市場正討論應否進一步加息之際，高市選擇這兩位候選人，充分反映其強烈的政策立場。\n\n認識兩位被提名人的前日本央行委員原田泰亦指，二人都認為從貨幣和財政兩方面支持經濟至關重要。他分析，兩人可能認為在通脹數據預期放緩情況下，很難找到繼續加息的理由。原田泰補充，新成員初期未必會左右委員會意見，但隨著時間推移，他們的想法或會逐漸引起其他成員共鳴。\n\n市場解讀：「鴿派」立場明確　但干預風險有限\n\n市場普遍認為，高市此舉是追隨其導師、已故前首相安倍晉三的腳步。安倍在任期間，曾大量提名再通脹主義者進入央行。分析指出，雖然此次提名不太可能動搖央行在經濟條件允許時提高利率的意圖，但由於投資者試圖解讀高市的政策信號，令這次提名較以往更受關注。\n\n澳洲聯邦銀行策略師Carol Kong表示，市場可能認為這兩位接任者的政策立場，會比即將卸任的成員略為「鴿派」。不過她亦指出，日圓的拋售幅度有限，長期日債孳息率的波動亦較溫和，這意味市場並不十分擔憂高市會直接干預日本央行的獨立政策。\n\n值得留意的是，本周二已有當地媒體報導，高市上周與日本央行行長植田和男會面時，曾表達對進一步加息的擔憂，消息已令日圓當日兌美元一度下跌1.1%，足見市場對任何有關加息步伐的信號都極為敏感。",
            "link": "https://news.tvb.com/sc/finance/69a14b4bf3bac3b7e4da3f31",
            "pub_date": "2026-02-28 08:01:37",
            "source": "tvb",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": "69a22670f3bac3b7e4e1c050",
            "title": "本港二手樓價連升五周",
            "description": "本港二手樓價連升五周。\n\n中原城市領先指數最新報149.41點，按周比較，升百分之0.01。\n\n四區樓價中，港島上升百分之1.67。新界西、新界東和九龍都錄得跌幅。\n\n編制指數的機構表示，新春後樓市二手成交活躍，多個新盤部署開售，加上部分貨尾提價，相信樓價將再向上突破。",
            "link": "https://news.tvb.com/sc/finance/69a22670f3bac3b7e4e1c050",
            "pub_date": "2026-02-28 07:41:04",
            "source": "tvb",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}