{
    "data": [
        {
            "title": "大市點睇｜美科技巨頭發債引恐慌　港股跟跌　有訊號暗示反彈在即？",
            "description": "<div class=\"post-body\" id=\"gallery-lightbox\">\n\n\n<p>【點新聞報道】港股今日（26日）為恒指期貨結算日，高開低收見偏軟。早上三大指數齊跟高開後，恒指再度觸及關口至高見27024，最多升258點。而國企指數和科技指數齊以最高位開出。近高位欠缺承接力，各指數在收窄升幅後齊回落倒跌。午後跌勢加劇，齊逐步向下擴大跌幅。恒指最多跌超過392點。而國指及科指則齊跌至低位收市。</p>\n<p>恒指收盤報26381，跌384點或1.437%。國企指數報8814，跌220點或2.440%。科技指數報5108，跌151點或2.874%。全日成交總額2592億港元。</p>\n<p>回顧市況，怡發證券高級分析師張穎群表示，今日為港股期指結算日，恒指早段曾高見27024。但在沉重的沽壓下再失守關口，並回落倒跌至近低位收市。科指跌幅超過2.8%。大型科技持續弱勢，整體跌幅更高至3%至4%。</p>\n<p><strong>由於外國電力供應明顯不足，大型基金或機構齊看好中資電力股</strong>，因此帶動相關板塊在逆市中造好。東方電氣（01072）股價曾高見41.54元，升幅迫近16%。哈爾濱電氣（01133）則創52周新高27.92元。其他股份亦見錄得超過7%的升幅。</p>\n<p>而創新藥股份在經過多日炒作後亦跟大市向下調整。個別股份跌幅接近8%。大型金融企業，包括銀行、保險及券商等板塊同跟大市下滑。張穎群提到，昨天公布的財政預算案提出，香港電動汽車的首次登記稅寬免在3月到期後，將不會延續。該消息拖累電動車板塊全面下挫，跌幅約4%至5%。</p>\n<p>周內科技指數連跌3日，累跌超過276點，並創自2025年7月以來的低位。自10月的高位回落超過23%，弱勢極為明顯。張穎群指出，<strong>這主要是因為美國的大型科技企業正積極地發行頗大金額的債券，導致券商、基金或投資者憂慮會否出現AI泡沫。</strong>再加上目前正在港交所上市中的科技企業，大部分仍處於研發周期，有個別企業更未見有盈利。不過，從近期的報告或消息中可見，已有多家企業已踏入銷售過程中，訂單總額更見明顯的增長，因此料在稍後的業績公布後，科技股能夠重回升軌。</p>\n<p>（點新聞記者章芸菲報道）</p>\n</div>",
            "link": "https://www.dotdotnews.com/a/202602/26/AP69a02314e4b0c32d4f69e429.html",
            "pub_date": "2026-02-26 18:41:27",
            "source": "dotdotnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "業績丨希慎全年基本溢利按年升28.3%　本港商舖租金顯著上升",
            "description": "<div class=\"post-body\" id=\"gallery-lightbox\">\n\n\n<p>【點新聞報道】希慎興業（00014）今日（26日）公布2025年全年業績。受惠於出售竹林苑住宅單位的公平值收益所帶動，希慎基本溢利25.1億元，按年升28.3%，經常性基本溢利19.2億元，跌1.9%，全年純利3.2億元。每股盈利31仙，維持派第二次中期息81仙。希慎股價績前逆市靠穩，升0.3%，破頂高見23.3元。</p>\n<p>期內，希慎營業額按年增長1.6%至34.6億元，商舖營業額17.27億元，增長2.6%。截至期末，香港商舖出租率錄得95%，增加3個百分點，希慎指，去年續約、租金檢討及新出租物業的租金水平，維持顯著上升趨勢，而人流及租戶銷售方面均錄得強勁增長，表現優於整體香港市場。</p>\n<p>去年寫字樓組合收入15.08億元，微升0.1%，但單計香港寫字樓收入錄得14.07億元，跌2.3%。希慎指，香港寫字樓市場持續面對挑戰，續約、租金檢討及新出租物業的平均租金水平仍然向下，該集團已提供靈活租賃方案、裝修支援及提早續約等。</p>\n<p>希慎主席利蘊蓮在業績報告表示，正堅守嚴謹策略，專注於高效執行、嚴格的時間與成本控制，以及審慎的風險管理，並稱利園區優化計劃已步入重大「收成期」，多個奢華品牌經全新裝修和擴建後已重新開業，進一步鞏固利園區表現。</p>\n<p>她指出，將優先去槓桿並把資本重新配置至策略性重點領，早前已啟動一項為期五年的資本循環計劃，釋放成熟住宅資產的價值，將資本重新部署至策略重點領域，並透過去槓桿化優化集團資本結構。她指，受惠於豪華住宅市場氣氛持續改善，年內已完成80億元資本循環目標的26%，即收取21億元，並已就額外16億元的出售所得款項訂立合約，並預期於2026年完成交易。</p>\n<p>利園八期為希慎與華懋集團於加路連山道合資進行的策略性發展項目，上蓋工程於年內取得滿意進展，封頂儀式已於2025年11月舉行。項目預計將於2026年內竣工。</p>\n</div>",
            "link": "https://www.dotdotnews.com/a/202602/26/AP69a01094e4b0c32d4f69e217.html",
            "pub_date": "2026-02-26 17:30:21",
            "source": "dotdotnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "港交所全年多賺36%　日均成交創歷史新高",
            "description": "<div class=\"post-body\" id=\"gallery-lightbox\">\n\n\n<p>【點新聞報道】港交所（00388）公布截至去年12月底全年業績。其去年純利按年增加36%，至177.54億元，每股基本盈利14.05元。第二次中期息每股派6.52元，增加33%；全年派息12.52元，按年增加35%。</p>\n<p>單計去年第四季，純利43.35億元，按年增20%；收入及其他收益為73.1億元，按年上升15%。另外，上季港股日均成交增加逾兩成至2298億元，全年日均成交則上升90%至2498億元，創歷史新高。</p>\n<p>新股市道活躍，去年共有119家公司上市，其中兩家公司更躋身全球新股集資額首5位，全年集資額達2,869億元，按年大升2.2倍，現時尚有逾400家新股排隊等候上市。</p>\n<p>港交所行政總裁陳翊庭表示，地緣政治日趨多極化之際，全球投資者都想透過亞洲市場多元化配置資產和管理風險，港交所將把握機會持續推動證券市場改革，擴大多元資產生態圈。</p>\n</div>",
            "link": "https://www.dotdotnews.com/a/202602/26/AP69a0002de4b0c32d4f69e061.html",
            "pub_date": "2026-02-26 16:16:17",
            "source": "dotdotnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "寶馬與寧德時代合作　聚焦電池供應鏈協同降碳",
            "description": "<div class=\"post-body\" id=\"gallery-lightbox\">\n\n\n<p>【點新聞報道】德國總理梅爾茨近日訪華。期間，隨行的寶馬集團（BMW）董事長Oliver Zipse與寧德時代在北京簽署合作諒解備忘錄，內容聚焦動力電池供應鏈協同降碳，降低電動汽車全生命周期碳足跡，推動雙方可持續發展與科技創新合作升級。</p>\n<p>Oliver Zipse表示，德國總理此次訪華釋放出堅持對話、深化合作的明確信號，為寶馬與中國夥伴拓展合作奠定基礎。面對全球性挑戰，國際社會更應加強溝通、增進互信，堅持開放合作。他指出，汽車產業高度依賴全球協作，德中可攜手引領電動化、智能化技術變革。</p>\n<p>本次合作中，寶馬與寧德時代將圍繞電池護照數據跨境開展試點，深化碳足跡核算、可信數據交互等合作，依託Catena-X數據生態推動技術標準統一，助力產業長期穩定發展。</p>\n<p>2025年中國再度成為德國最大貿易夥伴，汽車產業是德中經貿合作的核心支柱之一。2026年中國進入「十五五」規劃開局之年，消費升級與高端出行需求增長，為寶馬帶來新機遇。</p>\n<p>Oliver Zipse表示，中國是全球最大汽車市場與重要創新高地，企業必須扎根中國、深耕中國。時值農曆馬年，寶馬將繼續秉持「在中國，為中國，與中國共進」的戰略，深化在華布局，與中國夥伴攜手創新、共促發展。</p>\n<p>寶馬2010年以來在沈陽生產基地累計投資超1200億元，打造全球領先智能製造與創新中心。寶馬目前已在華設立4大研發創新基地與3家軟件公司，今年4月北京車展將全球首發首款國產新世代車型——新世代BMW iX3長軸距版，進一步深化本土化戰略。</p>\n</div>",
            "link": "https://www.dotdotnews.com/a/202602/26/AP699fc89fe4b0c32d4f69dc03.html",
            "pub_date": "2026-02-26 12:15:14",
            "source": "dotdotnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "三大指數高開　加密貨幣概念股集體衝高",
            "description": "<div class=\"post-body\" id=\"gallery-lightbox\">\n\n\n<p>【點新聞報道】隔夜美股三大指數收漲，英偉達財報亮眼，帶動亞太股市早盤齊漲。港股三大指數今日（26日）高開，恒指漲0.95%，國指漲0.49%，恒生科技指數漲0.46%。大型科技股普遍上漲但漲幅波動不大，非洲最大鋰礦出口國津巴布韋宣布「斷供」，鋰電池板塊大漲，天齊鋰業漲超6%，贛鋒鋰業漲5.5%；行業龍頭英偉達財報亮眼，半導體存儲概念股活躍。</p>\n<p>加密市場回暖，比特幣一度上觸7萬美元，加密貨幣概念股（IP000002.IP）、ETF集體衝高，藍港互動（08267）、歐科雲鏈（01499）漲近7%，新火科技控股（01611）漲超5%；FA南方以太幣（03068）、博時以太幣（03009）、嘉實以太幣（03179）漲超8%，博時比特幣（03008）、嘉實比特幣（03439）漲超5%。另外，煤炭股走低，海運股、建材水泥股、重型機械股普遍下跌。</p>\n</div>",
            "link": "https://www.dotdotnews.com/a/202602/26/AP699fb2c7e4b0c32d4f69d988.html",
            "pub_date": "2026-02-26 10:45:37",
            "source": "dotdotnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "長和系賣掉英國電網業務　套現超1107億元",
            "description": "<div class=\"post-body\" id=\"gallery-lightbox\">\n\n\n<p>【點新聞報道】長實集團今日（26日）在港交所公告，長實附屬公司、電能實業附屬公司等就出售UK POWER NETWORKS訂立協議。長建、電能及長實分別持有UK POWER NETWORKS的40%、40%及20%的股權。</p>\n<p>據報道，就長建及電能出售UKPN股份及股東債務票據的基本代價分別為42.19億英鎊（相等於約443億港元），即合共886億港元；就長實出售UKPN股份及股東債務票據基本代價則為21.09億英鎊（相等於約221.5億港元），即3間公司出售UKPN股份及股東債務票據基本代價合共1107.5億港元。</p>\n<p>長江集團主席李澤鉅表示，長江集團將繼續尋求投資及發展機會，放眼於現有及新開發市場（包括英國及其他地區），物色受規管行業以及擁有長期穩定合同的項目，及其他具備優厚潛力的業務。</p>\n<p>長江基建聯席董事總經理甄達安表示，這宗交易是一個重要里程碑。自UKPN於2010年被長江基建收購後，扭轉了該電網的表現，不論在營運和財務上均大有進益。集團對於UKPN在成為長江集團成員後的轉變和長足發展感到欣喜和自豪。</p>\n</div>",
            "link": "https://www.dotdotnews.com/a/202602/26/AP699fae76e4b0c32d4f69d945.html",
            "pub_date": "2026-02-26 10:25:36",
            "source": "dotdotnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "預算案｜轉撥外匯基金投資收入發展北都　金管局指有能力維持本港貨幣及金融體系穩定健全",
            "description": "<div class=\"post-body\" id=\"gallery-lightbox\">\n\n\n<p>【點新聞報道】財政司司長陳茂波新一份財政預算案中建議，根據《外匯基金條例》，在不影響外匯基金保持香港貨幣金融體系穩定健全的前提下，從外匯基金把1500億元，在未來兩個財政年度每年轉撥750億元至基本工程儲備基金，以支持北都及其他基建項目。金管局回覆傳媒查詢時表示，有能力亦有信心繼續按《外匯基金條例》，維持本港貨幣及金融體系穩定和健全。</p>\n<p>金管局指，《外匯基金條例》第8條對從外匯基金轉撥款項到政府其他基金定下明確規定，包括轉撥相當不可能對外匯基金履行維持貨幣金融穩定的能力有不利影響，以及須確保外匯基金資產不少於尚未履行的各項責任總和的105%。</p>\n<p>外匯基金於2025年錄得逾3300億港元的投資收入，向政府作出轉撥後，外匯基金累計盈餘仍較2024年底有所增長，升至逾7800億港元。外匯基金持有4200多億美元的龐大外匯儲備，達貨幣基礎1.6倍，是支持聯繫匯率制度和金融系統穩定的堅實基礎。</p>\n</div>",
            "link": "https://www.dotdotnews.com/a/202602/25/AP699ee270e4b0c32d4f69cf91.html",
            "pub_date": "2026-02-25 19:55:35",
            "source": "dotdotnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "預算案｜T+1結算、百億創科產業引導基金……一文睇金融市場利好政策",
            "description": "<div class=\"post-body\" id=\"gallery-lightbox\">\n\n\n<p>【點新聞報道】香港特區政府財政司司長陳茂波今日（25日）在立法會發表2026至2027財政年度政府財政預算案。其中提出多項金融市場改革措施，涵蓋一級市場、二級市場及多個資產領域，這些舉措將進一步鞏固香港作為全球領先國際金融中心的地位。此次改革措施覆蓋廣泛，從港股交易制度優化、人民幣產品體系擴容，到數字資產監管完善與債券市場電子化升級，幾乎全面覆蓋本地投資者日常參與的各個市場板塊。以下為與香港股市及投資者最密切相關的重點內容整理：</p>\n<p><strong>T+1結算成焦點 交易生態重塑</strong></p>\n<p>陳茂波表示，已要求香港交易及結算所有限公司檢視上市規定，並於上半年就推動「T+1」結算周期的具體實施方案諮詢市場。同時推進多項制度改革，包括修訂「同股不同權」上市要求、便利海外發行人第二上市、優化IPO流程、為生物科技及特專科技企業提供更大上市彈性、完善結構性產品上市框架、改革每手買賣單位，以及年內推出無紙證券市場制度。</p>\n<p>「若將交收時間縮短，有助投資者的資金回籠，港股的交投有機會提升。」<strong>香港股票分析師協會主席鄧聲興認為，</strong>由於目前大部分投資者的股票已存放在CCASS，未有再需要「T+2」，「若香港日後實行『T+1』，將有助香港證券市場全面實行無紙化。」他又認為，香港銀行「轉數快」及銀行的轉賬系統，已對「T+1」準備就緒，相信香港的銀行體系，已可迎接「T+1」。</p>\n<p><strong>百億創科產業引導基金 硬科技IPO潛在動力</strong></p>\n<p>陳茂波表示，政府計劃推出100億元「創科產業引導基金」，投向生命健康科技、人工智能及機械人等策略性新興產業。政府正甄選基金經理，以期基金年內開始運作。同時已要求港交所檢視上市規定，便利及吸引更多航天企業來港上市。</p>\n<p><strong>德勤中國華南區主管合夥人歐振興指，</strong>航天產業作為國家戰略與商業創新的關鍵交匯點，其高研發強度與長投資周期的特性，正需要香港發揮國際金融中心優勢，提供更多元的融資渠道與風險管理支持。</p>\n<p><strong>3月發首批穩定幣牌照 數字資產進入發牌年代</strong></p>\n<p>陳茂波提到，政府將於3月發出首批穩定幣發行人牌照，並於年內提交數字資產政策條例草案，為交易及託管服務建立發牌制度。監管機構將在保障投資者前提下，推動數字資產市場流動性，並設立加速器支援創新。</p>\n<p><strong>老虎證券(香港)首席運營官王珊表示，</strong>政府對虛擬資產及穩定幣發行人的清晰監管方針，為業界注入了強心針。Web 3.0與傳統金融的深度融合，將是香港資本市場未來的核心增長引擎。</p>\n<p><strong>優化稅制　吸引家辦和基金落戶　</strong></p>\n<p>香港單一家族辦公室突破3300間，新一份財政預算案優化相關稅制，擴闊合資格投資資產定義，將數字資產、貴金屬及特定大宗商品納入可獲利得稅寬減的範圍。</p>\n<p><strong>羅兵咸永道亞太區金融服務稅務主管合夥人何潤恒表示，</strong>此舉不僅提升香港對基金的吸引力，更支持黃金產業發展。</p>\n<p><strong>國債期貨擬在港推出 衍生產品層次升級</strong></p>\n<p>最新一份財政預算案提到，政府將積極與內地協商研究，加快推動國債期貨在香港上市，同時將REITs納入互聯互通機制、把人民幣交易櫃台納入港股通，並持續優化「債券通」運行安排。</p>\n<p>有分析認為，國債期貨若落地，將填補本港利率對沖工具空白；REITs納入互聯互通，或為本地房託引入更多北水；人民幣櫃台納入港股通，有助提升雙櫃台股份成交活躍度。</p>\n<p><strong>人民幣資金池擴至2000億元 加速豐富離岸產品</strong></p>\n<p>人民幣業務資金安排總額已倍增至2000億元人民幣，政府亦會定期發行不同年期人民幣債券、完善離岸人民幣收益率曲線、強化短中期利率定價功能，並吸引更多發行人來港發行人民幣債務工具。</p>\n<p>隨着人民幣資產配置渠道增加，將有利本地投資者分散匯率風險；而收益率曲線完善，則將提升債券市場定價透明度。</p>\n<p><strong>債券電子交易平台下半年登場 固定收益市場電子化</strong></p>\n<p>政府下半年將推出債券電子交易平台以提升二級市場流動性，同時會持續發行代幣化債券，並透過「數碼債券資助計劃」鼓勵市場參與。去年第四季發行的代幣化債券規模達100億元，並已引入代幣化央行貨幣交收選項。</p>\n<p>分析指債券交易電子化有助降低交易成本，提升透明度。代幣化債券發展，為香港固定收益市場帶來技術升級機遇。</p>\n<p>（點新聞記者葉紫翎、章芸菲整理報道）</p>\n</div>",
            "link": "https://www.dotdotnews.com/a/202602/25/AP699eccfee4b0c32d4f69ccc1.html",
            "pub_date": "2026-02-25 18:21:10",
            "source": "dotdotnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "大市點睇｜恒指高開高走升175點　上海樓市新政引內房股集體上揚",
            "description": "<div class=\"post-body\" id=\"gallery-lightbox\">\n\n\n<p>【點新聞報道】港股今日（25日）高開高走略見回穩。三大指數早段齊跟高開後，曾遇沽壓而收窄部分升幅。僅科指曾跌18點。但近低位有支持而再同向上擴大升幅，並持續在附近橫行。午後滙豐銀行（00005）公布年內第4季度業績，稅前盈利多賺兩倍至68億美元，連同派息45美仙，齊優於預期。帶動股價高見142.70元。同時刺激港股續向上抽升。恒指高見26870，最多升近280點。而國企指數和科技指數則分別最多升98點及55點。隨後齊收窄部分升幅，科指更倒跌至收市。</p>\n<p>恒指收盤報26765，升175點或0.660%。國企指數報9034，升26點或0.298%。科技指數報5260，小跌10點或0.194%。全日成交總額2367億港元。</p>\n<p>財政司司長陳茂波今日發表2026年度的財政預算案。陳茂波表示，預計在25/26年度內政府經營賬戶將由預計有670億赤字轉為錄得29億盈餘。而整體內容為由外匯基金撥款1500億作北部都會投資、建議增加多項免稅額，及多項照顧低層的措施。對此，怡發證券高級分析師張穎群表示，<strong>預算案未見明顯刺激港股，午後市場僅由滙豐銀行（00005）公布遠勝預期的業績帶動回穩。</strong></p>\n<p>上海住房城鄉建設管理連同市財政局、市稅務局，及市公積金管理等齊發出通告，推出多項放寬及優化的政策，當中包括下調房屋限購、縮短納社保或個稅年期，及合條件可增購房屋等。該消息刺激在港交所內的內房股造好，整體升幅約在4%至6%。</p>\n<p>另有大型券商發出研究報告表示，<strong>有色金屬、小金屬及稀土等礦石產品，已由近期的互有炒作而轉變成戰略價值的重估，因而預期在估值或盈利上有極大的強化。</strong>張穎群提到，此消息刺激相關股份齊向上抽升。稀美資源（09936）股價升幅超過兩成至創出52周新高。而金潯資源（001231）、佳鑫國際（03858）和力勤資源（02245）齊錄得明顯升幅。</p>\n<p>今日港股略見淡靜，恒指最多曾升近280點，但最終收窄至升175點，而科指則倒跌10點收市，成交額輕微減至2367億元。股市反映似見欠缺方向，投資者則利用個別股份的好消息而炒作。</p>\n<p>值得一提的是，<strong>美國有大型券商表示，目前當地市場正處於極高的槓桿風險，情況似近2008年的金融風暴海嘯前夕。</strong>張穎群指出，這似乎令到投資者憂慮而未敢過分進取。不過，相信影響港股僅屬短暫，待外圍消息明朗化後，恒指將繼續向上造好。</p>\n<p>（點新聞記者章芸菲報道）</p>\n</div>",
            "link": "https://www.dotdotnews.com/a/202602/25/AP699ec9fde4b0c32d4f69cc35.html",
            "pub_date": "2026-02-25 18:12:02",
            "source": "dotdotnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "解讀｜豪宅稅大增50%　推9幅住宅地　專家拆解預算案如何「穩樓價」與「填庫房」",
            "description": "<div class=\"post-body\" id=\"gallery-lightbox\">\n\n\n<p>【點新聞報道】財政司司長陳茂波今日（25日）公布2026至2027年度財政預算案。預算案提出，新財政年度將推出9幅住宅用地，預計可提供約2.2萬個單位，同時繼續不推售一般商業用地，並調整一億元以上住宅物業交易印花稅稅率。</p>\n<p><strong>住宅用地增供應 業內稱貼合市場復甦</strong></p>\n<p>預算案顯示，2026至2027年度計劃將推9幅住宅用地，料可提供約2.2萬個單位。</p>\n<p>美聯物業住宅部行政總裁布少明向記者表示，此次推出約2.2萬個單位的住宅用地屬合適水平。當前樓市復甦速度較快，去年樓價上升，市場普遍預計今年升幅會進一步提高。他進一步指出，過往數年市道偏弱，政府推地減少、部分地塊流標，未來供應存在收緊可能，此次增加土地供應可有效補充此前的供應「真空」，穩定市場供應並增加庫房收入。</p>\n<p>香港置業王品弟亦在接受記者採訪時指出，政府推出9幅住宅用地是因應市場需求，近年住宅市場逐步轉好，成交量及成交價逐步上升，此舉反映政府對後市有信心，亦為市場未來提供更多選擇。</p>\n<p>關於相關安排對樓價的影響，布少明認為，在美國減息、經濟向好、股市向好等利好背景下，預計今年樓市有約10%升幅，而增加住宅用地供應有助市場平穩。</p>\n<p>戴德梁行執行董事及香港研究部主管鄧淑賢表示，潛在推9幅住宅地有助穩定市場預期及供應釋放，避免後市供應斷層，但未必會立即搶高樓價。她提到，影響樓價仍然有很多其他因素，包括經濟走向、成交量、利率走勢、就業情況、入境人才置業及租住需求，以及市場庫存消化速度等。</p>\n<p><strong>繼續停推商業用地 專家：以消化存量穩定市場</strong></p>\n<p>預算案公布2026至2027年度政府繼續不推售一般商業用地。對此，王品弟表示，政府續不推商業地非常合理。當前商業市場低迷，即使推出用地亦可能流標，對市場不利，因此不推亦屬正常行動。</p>\n<p>鄧淑賢亦同意政府因應市場供求不推售一般商業用地。她指出，截至去年第四季末為止，香港整體甲廈待租率約20.3%，暫緩推售商業地可讓市場逐漸消化現時空置樓面有助穩定寫字樓市場，惟政府宜定期檢視市場情況，適時重售商業地塊。</p>\n<p><strong>專家建議優化人才置業安排 稱豪宅稅調整合理</strong></p>\n<p>此次預算案公布的印花稅調整亦是關注點之一。陳茂波表示，在開源方面，秉持「能者多付」的原則，1億元以上的住宅物業交易印花稅稅率，將由4.25%調高至6.5%，影響約0.3%的住宅物業交易，估計每年可增加約10億元收入。措施將於條例修訂草案獲通過後，明日（26日）開始生效。</p>\n<p>戴德梁行執行董事及香港資本市場部主管高偉雄對此表示，政府提高一億元以上住宅物業交易印花稅稅率，高偉雄認為，基於「能者多付」原則，此次調整屬理性水平，但短期內或令部分潛在買家暫緩入市。他相信市場調整後，豪宅市場交投仍能維持熱度，建議政府未來繼續審慎調整豪宅稅率，避免削弱香港樓市吸引力。</p>\n<p>中原地產亞太區副主席兼住宅部總裁陳永傑指，政府意識到豪宅物業交投轉熱，但事實上億元成交宗數多年來佔香港整體私人住宅成交不足1%，而且供應匱乏，屬頂流級別物業，買家非富則貴，即使是次提高億元物業的交易印花稅，料對該類物業買家以至全港整體物業市場影響不大。</p>\n<p>同時他提到，於市況向好和頂級豪宅供應罕有的大前題下，料億元物業業主不會因印花稅增加，而減價出售手持豪宅。</p>\n<p>人才流入對樓市影響亦不容忽視，惟此次預算案未見協助來港人才置業的具體安排。高偉雄建議，政府可適度下調投資門檻，擴闊合資格投資物業範圍，可審慎將部分住宅物業納入計算，同時檢視外來投資者銀行融資與按揭限制，提升資金靈活性，吸引國際資本與高端人才長期落戶香港。</p>\n<p>（點新聞記者章芸菲報道）</p>\n</div>",
            "link": "https://www.dotdotnews.com/a/202602/25/AP699ec904e4b0c32d4f69cc1a.html",
            "pub_date": "2026-02-25 18:06:50",
            "source": "dotdotnews",
            "kind": 1,
            "language": "zh-HK"
        }
    ]
}