{
    "data": [
        {
            "title": "Summit SD Sets New U.S. Benchmark for Pharmaceutical Distribution with HDA GDP Accreditation",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>LEE'S SUMMIT, Mo. — </strong></span><p><a href=\"https://summitsd.com/\" rel=\"nofollow\">Summit SD</a> announced today that it has become the first distributor in the United States to receive Good Distribution Practices (GDP) accreditation from the <a href=\"https://hda.org/\" rel=\"nofollow\">Healthcare Distribution Alliance (HDA)</a>, marking a significant milestone in the company’s commitment to quality, supply chain integrity, and patient safety.</p><p><br/>The HDA's Pharmaceutical Cargo Security Coalition (PCSC) GDP Accreditation Program was established to strengthen the U.S. pharmaceutical supply chain by promoting consistent, globally aligned distribution practices that protect product quality, enhance security, and reduce risk throughout the lifecycle of healthcare products. Summit SD’s accreditation reflects its alignment with HDA’s mission to advance safe, efficient, and trusted healthcare distribution across the industry.</p><p><br/>GDP accreditation recognizes organizations that demonstrate adherence to rigorous standards across quality management systems, personnel training, risk mitigation, documentation, and secure handling of healthcare products. By meeting these criteria, Summit SD reinforces its role as a leader in advancing best practices within the U.S. distribution landscape and supporting a resilient, patient focused supply chain.<br/><br/>“<i><strong>This accreditation speaks to the high standards our team upholds every day</strong></i>,” said Cassie McLaughlin, Director of Quality &amp; Regulatory Affairs at Summit SD. “<i><strong>As the first U.S. distributor to achieve HDA’s GDP accreditation, we are proud to align our operations with globally recognized practices that protect product integrity and strengthen trust across the pharmaceutical supply chain. Ultimately, everything we do is driven by one purpose— delivering safe, reliable products to patients and trusted service to our partners.</strong></i>”<br/><br/>Summit SD views GDP accreditation as a foundation for continued investment in quality systems, workforce development, and operational excellence. As HDA continues to lead the industry toward stronger, more consistent distribution standards, Summit SD remains committed to supporting that mission through transparency, accountability, and continuous improvement.</p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20260226-summit-sd-sets-new-us-benchmark-for-pharmaceutical-distribution-with-hda/",
            "pub_date": "2026-02-27 03:26:29",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Precis Announces New Process Engineering Leadership",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>AMBLER, Pa. — </strong></span><p><a href=\"https://precisengineering.com/\" rel=\"nofollow\">Precis Engineering + Architecture</a>, an award-winning design firm with offices in Ambler, Pa., and Cary, N.C., has named two new directors in its Ambler, Pa., headquarters. The firm hired <a href=\"https://precisengineering.com/leadership/jonathan-busam/\" rel=\"nofollow\">Jonathan Busam</a> as Director – Process Engineering and promoted <a href=\"https://precisengineering.com/leadership/van-zhao/\" rel=\"nofollow\">Van Zhao</a> from Process Engineering Manager to Director – Process Technology.</p><p>Formerly a senior director of manufacturing, facilities maintenance, and engineering for DSM-Firmenich Biomedical, Busam brings two decades of client-side engineering and process optimization skills to his role.</p><p>“Jonathan’s ability to look holistically at processes and facilities will better inform the Precis design approach,” said Precis Principal – PA Operations <a href=\"https://precisengineering.com/leadership/josh-capparella/\" rel=\"nofollow\">Josh Capparella, PE, LEED AP BD+C</a>. “We are excited to have his leadership and valued client perspective.”</p><p>“I am excited to collaborate with the current team, elevate process engineering, and drive innovative market solutions,” said Busam. “I look forward to leveraging our collective strengths both to enhance our existing client relationships and to unlock new opportunities to offer a competitive edge.”</p><p>Busam spent 20 years leading new product development and engineering across biomedical manufacturing and R&amp;D environments. He has managed large-scale projects, led cross-functional teams, and implemented advanced technologies to enhance product offerings and streamline production. He brings this client-side global perspective to his role leading the Precis process engineering group and integrating process services with the rest of the firm’s engineering and architecture disciplines.</p><p>Busam holds a B.S. in Chemistry from Widener University and continued studies in polymer science and engineering at Lehigh University. He is a member of the American Chemical Society. Busam lives with his family in Kennett Square, Pa.</p><p>Zhao has nearly 20 years of consulting engineering experience. She joined Precis in 2023 and has provided technical leadership over the full spectrum of life sciences process engineering, from gene therapy and vaccine manufacturing to APIs and automation. In her new role, Zhao serves as a subject matter expert, providing process support for fill-finish technologies, potent compound isolators, CIP/SIP systems, flammable materials storage and distribution, and other complex issues. Her leadership ensures project alignment with standards and specifications and supports successful project execution.</p><p>“Engineering projects are long journeys, and lasting results come from strong partnerships,” said Zhao. “I believe in leading with integrity, building trust from day one, and working side-by-side with clients and teammates to reach the finish line together.”</p><p>“We value Van’s expertise and look forward to her continued technical leadership within the process engineering group,” added Capparella.</p><p>Zhao holds a B.S. in Chemical Engineering from Drexel University and is an active member of the International Society for Pharmaceutical Engineering (ISPE), American Society of Mechanical Engineers Bioprocessing Equipment Program (ASME BPE), and American Institute of Chemical Engineers (AIChe). She lives with her family in Conshohocken, Pa.</p><p>The roles strengthen Precis’ ability to deliver integrated engineering and architecture solutions that support the complex needs of pharmaceutical, biotechnology, life sciences, and mission-critical clients.</p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20260224-precis-announces-new-process-engineering-leadership/",
            "pub_date": "2026-02-25 04:51:00",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Drugs from China are reshaping biotech. Track the licensing deals here.",
            "description": "<div class=\"article-body add-drop-cap\">\n<p>The makeup of the world’s pharmaceutical pipeline is changing. China’s fast-growing biotechnology industry is a big reason why. </p>\n<p>Over the past decade, China’s government has sought to upgrade the country’s drugmaking capabilities. Its efforts birthed a burgeoning ecosystem of homegrown companies and science parks that mirror — and even rival —  U.S. hubs in Boston and San Francisco. Lower costs and regulatory flexibility have helped China’s biotech startups move faster than their U.S. counterparts, producing a sprawling inventory of drug prospects. While many are designed to be superior versions of medicines either on the market or in development elsewhere, more and more are innovative, challenging the U.S.’s long-held biotech advantage. </p>\n\n<p>Large pharma companies and venture capital investors have taken note. Many are licensing experimental drugs from China, either to add to their drug portfolios or build new biotechs around. The shift has been rapid, with dealmaking spiking in recent years. According to analysts, licensing agreements were on a record pace in 2025. Fully one-third of the industry’s licensing spending in 2025 involved drugs sourced from China, per the investment bank Jefferies.</p>\n<p>These deals reveal important insights about the types of medicines drugmakers and investors want in their portfolios. With this database, we’re tracking deals from 2025 onward in which China-based drugmakers licensed to U.S. and European companies rights to human therapeutics. We show the companies involved, the financial terms of their alliances and details about the medicines and drug targets. </p>\n<p>If we’ve missed a deal, or there’s any additional information you’d like to see, please reach out and let us know.</p>\n<p><a href=\"#database\"><strong>Jump to database</strong></a></p>\n<p><a href=\"#methodology\"><strong>Jump to methodology</strong></a></p>\n<div class=\"break-grid-medium chart-pad\" id=\"chart-section\">\n<div class=\"col-chart-section-wrapper\">\n<div class=\"ed-chart ed-chart__datawrapper\" data-source=\"snorkel-form\">\n<h4 class=\"ed-chart__title\">Bispecific and trispecific drugs are a frequent target</h4>\n<div class=\"col-chart-parent\">\n<div class=\"ed-chart__sub\">Licensing agreements announced in 2025</div>\n<iframe aria-label=\"Bar Chart\" data-external=\"1\" frameborder=\"0\" height=\"193\" id=\"datawrapper-chart-CwG02\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://datawrapper.dwcdn.net/CwG02/1/\" style=\"width: 0; min-width: 100% !important; border: none\" title=\"\"></iframe><script type=\"text/javascript\">\r\n               !(function () {\r\n                  \"use strict\";\r\n                  window.addEventListener(\"message\", function (a) {\r\n                     if (void 0 !== a.data[\"datawrapper-height\"]) {\r\n                        var e = document.querySelectorAll(\"iframe\");\r\n                        for (var t in a.data[\"datawrapper-height\"])\r\n                           for (var r, i = 0; (r = e[i]); i++)\r\n                              if (r.contentWindow === a.source) {\r\n                                 var d = a.data[\"datawrapper-height\"][t] + \"px\";\r\n                                 r.style.height = d;\r\n                              }\r\n                     }\r\n                  });\r\n               })();\r\n            </script></div>\n<div class=\"ed-chart ed-chart__datawrapper\" data-source=\"snorkel-form\">\n<h4 class=\"ed-chart__title\">Cancer, immune disease drugs are drawing the most interest</h4>\n<div class=\"col-chart-parent\">\n<div class=\"ed-chart__sub\">Licensing agreements announced in 2025</div>\n<iframe aria-label=\"Bar Chart\" data-external=\"1\" frameborder=\"0\" height=\"193\" id=\"datawrapper-chart-zZrTv\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://datawrapper.dwcdn.net/zZrTv/1/\" style=\"width: 0; min-width: 100% !important; border: none\" title=\"\"></iframe><script type=\"text/javascript\">\r\n                  !(function () {\r\n                     \"use strict\";\r\n                     window.addEventListener(\"message\", function (a) {\r\n                        if (void 0 !== a.data[\"datawrapper-height\"]) {\r\n                           var e = document.querySelectorAll(\"iframe\");\r\n                           for (var t in a.data[\"datawrapper-height\"])\r\n                              for (var r, i = 0; (r = e[i]); i++)\r\n                                 if (r.contentWindow === a.source) {\r\n                                    var d =\r\n                                       a.data[\"datawrapper-height\"][t] + \"px\";\r\n                                    r.style.height = d;\r\n                                 }\r\n                        }\r\n                     });\r\n                  })();\r\n               </script></div>\n<div class=\"ed-chart ed-chart__datawrapper\" data-source=\"snorkel-form\">\n<h4 class=\"ed-chart__title\">Deals typically involve early-stage drug candidates</h4>\n<div class=\"col-chart-parent\">\n<div class=\"ed-chart__sub\">Licensing agreements announced in 2025</div>\n<iframe aria-label=\"Bar Chart\" data-external=\"1\" frameborder=\"0\" height=\"149\" id=\"datawrapper-chart-Xck2P\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://datawrapper.dwcdn.net/Xck2P/1/\" style=\"width: 0; min-width: 100% !important; border: none\" title=\"\"></iframe><script type=\"text/javascript\">\r\n                     !(function () {\r\n                        \"use strict\";\r\n                        window.addEventListener(\"message\", function (a) {\r\n                           if (void 0 !== a.data[\"datawrapper-height\"]) {\r\n                              var e = document.querySelectorAll(\"iframe\");\r\n                              for (var t in a.data[\"datawrapper-height\"])\r\n                                 for (var r, i = 0; (r = e[i]); i++)\r\n                                    if (r.contentWindow === a.source) {\r\n                                       var d =\r\n                                          a.data[\"datawrapper-height\"][t] +\r\n                                          \"px\";\r\n                                       r.style.height = d;\r\n                                    }\r\n                           }\r\n                        });\r\n                     })();\r\n                  </script></div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div class=\"break-grid-medium\" id=\"database\">\n<div class=\"ed-chart ed-chart__datawrapper\" data-source=\"snorkel-form\">\n<h4 class=\"ed-chart__title\">Licensing deals involving China-developed drugs</h4>\n<div class=\"ed-chart__sub\">Database includes deals announced in 2025 and 2026 that involve a China-based biotechnology firm licensing a drug candidate or candidates to biopharmaceutical companies located in the U.S. or Europe.</div>\n<iframe aria-label=\"Table\" data-external=\"1\" frameborder=\"0\" height=\"1750\" id=\"datawrapper-chart-ZTFPS\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://datawrapper.dwcdn.net/ZTFPS/1/\" style=\"width: 0; min-width: 100% !important; border: none\" title=\"\"></iframe><script type=\"text/javascript\">\r\n       !(function () {\r\n          \"use strict\";\r\n          window.addEventListener(\"message\", function (a) {\r\n             if (void 0 !== a.data[\"datawrapper-height\"]) {\r\n                var e = document.querySelectorAll(\"iframe\");\r\n                for (var t in a.data[\"datawrapper-height\"])\r\n                   for (var r, i = 0; (r = e[i]); i++)\r\n                      if (r.contentWindow === a.source) {\r\n                         var d = a.data[\"datawrapper-height\"][t] + \"px\";\r\n                         r.style.height = d;\r\n                      }\r\n             }\r\n          });\r\n       })();\r\n    </script></div>\n</div>\n<div class=\"ed-secondary-content-box\" id=\"methodology\">\n<h4>Methodology</h4>\n<p>For this database, BioPharma Dive compiled deals announced in 2025 and 2026 through which China-based drugmakers licensed out innovative human medicines to biotech or pharmaceutical companies in the U.S. or Europe. </p>\n<p>We screened for these deals in company press releases, analyst reports and on social media sites like LinkedIn. We eliminated those that didn’t meet our criteria, including alliances that don’t mention any specific drug candidates or partnerships between two China-based companies. We also excluded deals involving generic drugs or biosimilars.</p>\n<p>We generally used a deal’s most advanced program to determine the therapeutic area of focus, treatment type and stage of development at the time of a deal’s announcement. We categorized phase of development by the latest stage underway at the time of a deal.</p>\n<p>Therapeutic areas cover a large number of diseases and, in some cases, overlap. In most cases, when companies identified more than one therapeutic area with equal priority, we classified them as working on “multiple” therapeutic areas. Companies that identified multiple areas, but prioritized one over others were classified under that priority area.</p>\n</div>\n<p><em>Ned Pagliarulo contributed reporting.</em></p>\n</div>",
            "link": "https://www.biopharmadive.com/news/china-biotech-drug-licensing-deals-pipeline/758283/",
            "pub_date": "2026-02-26 06:26:18",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Small and mighty: single-domain antibodies pack a biological punch",
            "description": "<div class=\"large medium article-body\">\n<h4><span><span><span><strong>What are VHH antibodies?</strong></span></span></span></h4>\n<p><span><span><span>VHH antibodies, single<span>‑</span>domain antibodies (sdAbs) or nanobodies, are tiny, highly stable antibody fragments. They are gaining attention, because they combine powerful biological activity with unique structural advantages that traditional antibodies don’t have. They’re small, stable and highly engineerable, which makes them ideal for both therapeutic and diagnostic applications. However, while they offer strong advantages for biological development, they also introduce complexities for development and manufacturing.</span></span></span></p>\n\n\n<p><span><span><span><span><span>The discovery of the distinctive structure of heavy-chain-only antibodies in species belonging to the Camelidae family in 1989 sparked interest in their variable antigen-binding domain (VHH).</span></span> Caplacizumab (Cablivi®), the first FDA-approved VHH therapeutic in 2019, opened the door to many more programs. By the end of 2025, that momentum resulted in five globally approved VHH therapeutics and more than 49 sequences advancing into clinical development.</span></span></span></p>\n<p><span><span><span>In addition to indicators of growing clinical confidence and investment in next-generation biologics, the global VHH antibody market is growing, with CAGR estimates around 15%. This growth is driven by their promise for use in applications such as oncology, immunology and diagnostic imaging.</span></span></span></p>\n<p><span><span><span>VHH antibodies have been shown to accelerate progress from concept to clinic when supported by the right development infrastructure. This infrastructure is key, as they differ fundamentally from conventional antibodies, and so they bring distinct challenges in discovery, humanization, expression and analytical characterization. However, there are differences in structure that give VHH antibodies their potential. </span></span></span></p>\n<h4><span><span><span><strong>What’s so different about VHH structure?</strong></span></span></span></h4>\n<p><span><span><span>VHH antibodies differ from traditional antibodies in several critical ways:</span></span></span></p>\n<p><span><span><span><strong><em>Small size - </em></strong><span>VHHs are extremely small (12–15 kDa), about one‑tenth the size of conventional IgGs, allowing them to reach cryptic epitopes, penetrate tissues more effectively and even cross certain biological barriers such as the blood–brain barrier.</span></span></span></span></p>\n<p><span><span><span><strong><em>Simple but stable structure - </em></strong>VHHs consist of a single variable domain, making folding straightforward. They exhibit exceptional thermal and chemical stability, enabling use across challenging formulation conditions, including respiratory and digestive environments. This inherent stability also supports robust, efficient manufacturability.</span></span></span></p>\n\n<p><span><span><span><strong><em>Flexible engineering - </em></strong>The lack of a light chain gives VHHs exceptional design flexibility for multi<span>‑</span>specific formats. Their unique paratope geometry creates an adaptable scaffold, enabling modular use as building blocks for complex therapeutics. VHHs can be readily fused with effector domains, including enzymes, toxins and Fc regions, to create highly functional, customizable molecules.</span></span></span></p>\n<p><span><span><span><strong><em>Low-cost manufacturing - </em></strong>Unlike conventional monoclonal antibodies that require mammalian expression, VHHs can be produced in simpler systems such as <em>E. coli</em> and yeast. This flexibility significantly shortens production timelines and can reduce overall process development costs.</span></span></span></p>\n<h4><span><span><span><strong>What are the challenges for VHH development and manufacturing?</strong></span></span></span></h4>\n<p><span><span><span>As an emerging technology, VHH therapeutics do not yet have the well‑established CMC pathways available for IgGs. Full‑length antibodies, by contrast, are supported by decades of GMP practice and clearly defined regulatory standards. This lack of clarity can prolong the development time for VHHs. </span></span></span></p>\n<p><span><span><span>Despite the maturity of library‑based VHH discovery methods, challenges persist in library generation and diversity. These include sequence diversity loss, difficulty conducting functional assays and the considerable time required.</span></span></span></p>\n<p><span><span><span>Process development and manufacturing challenges can include issues around platform fit and expression systems, due to the differences in the host system used. Scaling the process is often challenging as the small size of the VHHs increases their risk of loss during filtration and ultrafiltration. In addition, tailored analytical methods may be required. </span></span></span></p>\n\n<h4><span><span><span><strong>Where next for VHH antibodies?</strong></span></span></span></h4>\n<p><span><span><span>VHH (single<span>‑</span>domain) antibodies already have strong scientific momentum, but commercial success depends on:</span></span></span></p>\n<ul>\n<li><span><span><span>Discovery quality - VHH success begins with producing high<span>‑</span>quality binders that match or surpass full<span>‑</span>length antibodies</span></span></span></li>\n<li><span><span><span>Engineering robustness - well<span>‑</span>engineered VHHs can outperform IgGs on size, tissue penetration, and manufacturability, with careful design</span></span></span></li>\n<li><span><span><span>Manufacturability - VHHs promise lower cost of goods sold (COGS), but only if manufacturing is optimized</span></span></span></li>\n<li><span><span><span>Regulatory clarity – clear regulatory pathways and comparability frameworks will be essential</span></span></span></li>\n</ul>\n<p><span><span><span>VHH antibodies: they’re not just small; they are modular engineering platforms. The only limit is our imagination!</span></span></span></p>\n</div>",
            "link": "https://www.biopharmadive.com/spons/small-and-mighty-single-domain-antibodies-pack-a-biological-punch/811314/",
            "pub_date": "2026-02-26 06:26:18",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Health Management Academy(THMA) Announces their Spring 2026 Oncology Conference, “Oncology Forum,” to Unite Industry and Health System Leaders in Strategic Dialogue",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>ARLINGTON, Va. — </strong></span><p>The Health Management Academy(THMA) announces their <a href=\"https://hmacademy.com/ind-convening/oncology-forum\" rel=\"nofollow\">2026 oncology conference, the Oncology Forum</a>, taking place May 6-8, 2026, in Fort Lauderdale, Florida. This exclusive forum brings together senior oncology service line executives from leading health systems and commercial leaders from the pharmaceutical and broader life sciences sector to engage in candid, strategic discussions that advance oncology care, access, and execution.</p><p>The Oncology Forum is tailored for leaders who influence pathway governance, treatment sequencing, formulary positioning, utilization management, and real-world adoption of oncology innovations. Held in an immersive, retreat-style environment with a strict 1:1 health system-to-industry ratio, the conference is designed to foster deep, actionable insight and trusted partnerships.</p><p>The 2026 Oncology Forum will feature structured discussions and networking opportunities that address the most pressing challenges in oncology care delivery and adoption, including:</p><ul><li><strong>Pathway Governance and Prescribing Behavior:</strong> How clinical and operational priorities inform real-world prescribing decisions and uptake.</li><li><strong>Access Execution and Market Dynamics:</strong> Trends in access control, utilization management, and formulary strategy.</li><li><strong>Operational Implementation:</strong> Aligning operational rollout across diverse health system settings to support complex therapy adoption.</li></ul><p>The Health Management Academy’s Oncology Forum stands apart from larger, traditional conferences by prioritizing depth over breadth. Attendance is curated to ensure meaningful contribution and relevance, enabling industry leaders to gain perspective that directly informs commercialization strategy, field execution planning, and cross-functional alignment.</p><p><strong>Event Details:</strong><br/> <strong>• What:</strong> Oncology Forum: 2026 Oncology Conference<br/> <strong>• When:</strong> May 6-8, 2026<br/> <strong>• Where:</strong> Fort Lauderdale, Florida<br/> <strong>• Who Should Attend:</strong> Senior oncology service line, clinical, operational, and commercial leaders from health systems and the pharmaceutical and life sciences industries</p><p>Participants will join peers from organizations that shape oncology care delivery and adoption, collectively exploring emerging care models, navigational strategies for complex therapies such as CAR-T and precision oncology, and integrated approaches to pharmacy and clinical collaboration.</p><p>For more details on the Oncology Forum and to apply for attendance, visit:<a href=\"https://hmacademy.com/ind-convening/oncology-forum?utm_source=chatgpt.com\" rel=\"nofollow\"> https://hmacademy.com/ind-convening/oncology-forum</a></p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20260223-the-health-management-academythma-announces-their-spring-2026-oncology-co-1/",
            "pub_date": "2026-02-24 22:01:18",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Health Management Academy Announces Cardiovascular Forum, an Exclusive Cardiology Conference for Service Line Leaders and Industry Executives",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>ARLINGTON, Va. — </strong></span><p>The Health Management Academy (THMA) today announced its upcoming <a href=\"https://hmacademy.com/ind-convening/cardiovascular-forum\" rel=\"nofollow\"><strong>Cardiovascular Forum</strong></a>, an invitation-only cardiology conference designed to bring together Cardiovascular Service Line Leaders from the nation’s leading health systems and select Pharmaceutical partners.</p><p>The retreat-style Forum will take place May 6-8, 2026, in Ft Lauderdale, FL, continuing THMA’s long-standing model of executive convening that prioritizes peer exchange, candid dialogue, and long-term partnership over transactional networking.</p><p>Unlike traditional cardiology conferences built around exhibit halls and promotional sessions, THMA’s Cardiovascular Forum is intentionally structured as a closed-door executive experience. The goal is to create the conditions for real discussion among decision-makers responsible for cardiovascular strategy, operations, quality, and growth across large health systems.</p><p><strong>Executive-Level Focus on Service Line Strategy</strong></p><p>The Cardiovascular Forum is part of THMA’s broader Executive Convening portfolio, which since 1998 has brought together peer communities across the C-suite and service line leadership.</p><p>These Forums operate as retreat-style meetings with:</p><ul><li>100% member-driven content topics</li><li>Transparent peer discussion</li><li>Ongoing virtual engagement between in-person meetings</li><li>A trusted environment for relationship building beyond commerce</li></ul><p>The Cardiovascular Forum follows this same structure, tailored to the unique operational and strategic demands of cardiovascular care.</p><p>Topics commonly explored within the cardiovascular community include:</p><ul><li>Service line growth strategy</li><li>Structural heart and advanced procedural expansion</li><li>Workforce and physician alignment</li><li>Digital and AI integration in cardiovascular operations</li><li>Quality improvement and outcomes measurement</li><li>Capital allocation and site-of-care optimization</li></ul><p>By focusing on the service line level, the Forum addresses the layer of decision-making where adoption, implementation, and operationalization of innovation actually occur.</p><p><strong>Designed for Pharmaceutical Leaders Engaging Cardiovascular Service Lines</strong></p><p>For pharmaceutical and life sciences teams, cardiovascular adoption decisions are rarely made by a single prescriber. They are shaped by multidisciplinary service line governance, operational feasibility, and financial performance considerations.</p><p>The Cardiovascular Forum provides visibility into how these decisions are discussed and evaluated at scale.</p><p>For industry leaders responsible for commercial strategy, market access, medical affairs, and service line engagement, understanding how cardiovascular leaders prioritize innovation can meaningfully inform go-to-market planning and partnership strategy.</p><p>As one industry executive noted in a recent THMA Forum:</p><p><i>“The intimate setting that THMA creates allows my team to have meaningful interactions with CXOs who are true influencers across our pipeline.”</i></p><p>For more information about the Cardiovascular Forum or to inquire about participation, visit:<br/><a href=\"https://hmacademy.com/ind-convening/cardiovascular-forum\" rel=\"nofollow\">https://hmacademy.com/ind-convening/cardiovascular-forum</a></p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20260218-the-health-management-academy-announces-cardiovascular-forum-an-exclusive/",
            "pub_date": "2026-02-19 22:06:42",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Biotech M&A is accelerating. Track the deals that are happening here.",
            "description": "<section class=\"body\">\n<div class=\"with-drop-cap\">\n<p class=\"body-text\">In the business of drug development, deals can be just as important as scientific breakthroughs. Many of today's most lucrative medicines, from the life-saving cancer treatment Keytruda to the anti-inflammatory agent Enbrel, might not have become so without mergers and acquisitions.</p></div>\n<p class=\"body-text\">The end of the last decade brought record highs in pharmaceutical M&amp;A as larger companies turned again and again to young biotechs for innovation. Often, these deals focused on cancer, rare diseases and immune system disorders — areas of drug research that were seeing major victories in clinical trials and huge profits for treatments that made it to market.</p>\n<p class=\"body-text\">2021 and 2022 were much quieter for dealmaking, as <a href=\"https://www.biopharmadive.com/news/ftc-pharma-mergers-biotech-antitrust-competition/625592/\">new challenges</a> and then rising interest rates weighed on negotiations. But there have been signs of a rebound. Pharma companies are keen to expand in areas like obesity, while stocking up on newer technologies like <a href=\"https://www.biopharmadive.com/news/pfizer-seagen-acquisition-cancer-drug-adc-deal/627976/\">antibody-drug conjugates</a>. Even neuroscience, which large drugmakers <a href=\"https://www.biopharmadive.com/news/pharma-neuroscience-retreat-return-brain-drugs/570250/\">previously abandoned</a>, is drawing investment again.</p>\n<!-- desktop ad -->\n\n<!-- mobile ad -->\n\n<p class=\"body-text\">BioPharma Dive is tracking M&amp;A activity below. The database, which shows drugmaker buyouts that have happened since 2018 and were valued at $50 million or more in upfront consideration, will be regularly updated.</p>\n<p class=\"body-text\">Click on an acquiring company to pull up more information, and scroll to the bottom of the page to read how this information was collected and organized. If there's anything we've missed, or any additional information you'd like to see, please <a href=\"/cdn-cgi/l/email-protection#dcb6beb9b0b09cb5b2b8a9afa8aea5b8b5aab9f2bfb3b1\">reach out</a> and let us know.</p>\n<p class=\"body-text\"><em>Editor's note: If tables or values do not display, please try clearing your browser's cache and reloading the page.</em></p>\n</section>",
            "link": "https://www.biopharmadive.com/news/biotech-pharma-deals-merger-acquisitions-tracker/604262/",
            "pub_date": "2026-02-24 01:45:53",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI is slashing jobs across industries. Will pharma be next?",
            "description": "<div class=\"large medium article-body\">\n<p>Super Bowl ads have long been a cultural bellwether, and at this year’s big game, AI was a top trend with about <a href=\"https://www.adweek.com/brand-marketing/super-bowl-revealed-ai-messaging-crisis/\">23% of commercials</a> related to the technology.</p>\n<p>Like any impactful innovation, AI has led to lots of handwringing, from concerns about the <a href=\"https://www.unep.org/news-and-stories/story/ai-has-environmental-problem-heres-what-world-can-do-about\">heavy environmental toll</a> of AI data centers to the potential negative effects on <a href=\"https://www.npr.org/2026/01/14/nx-s1-5674741/ai-schools-education\">children’s cognitive growth</a>. For workers across industries, the threat of job losses also remains heavy. </p>\n<p>As large corporations pursue greater efficiency and bottom-line growth, AI is replacing human workers at an astonishing clip. Amazon <a href=\"https://www.cnn.com/2026/01/28/tech/amazon-layoffs-ai\">announced 16,000 layoffs</a> last month after it already <a href=\"https://www.cnn.com/2025/10/28/business/amazon-layoffs\">axed 14,000 jobs earlier in the year.</a></p>\n\n\n<p>“As we roll out more generative AI and agents, it should change the way our work is done. We will need fewer people doing some of the jobs that are being done today, and more people doing other types of jobs,” <a href=\"https://www.aboutamazon.com/news/company-news/amazon-ceo-andy-jassy-on-generative-ai\">Amazon CEO Andy Jassy</a> wrote in June 2025.</p>\n<p>Despite this worrying shift, biopharma will likely be spared from such losses for now.</p>\n<p>“I wouldn't say that AI is necessarily replacing jobs one-for-one,” said Jae Yoo, executive director of EPM Scientific, a recruitment firm specializing in pharma, biotech and R&amp;D hiring. “It's rehousing and reshaping the types of jobs that are now coming in.”</p>\n<p>A recent poll of industry executives echoed that sentiment, with pharma’s C-suite <a href=\"https://www.pharmavoice.com/news/c-suite-pharma-future-ai-drug/808885/\">leaders reporting</a> that they don’t think AI will lead to major job losses.</p>\n<p>“Rather than replacing jobs, AI creates new roles and elevates existing ones, making curiosity, creativity and critical thinking essential skills for the future,” according to <a href=\"https://www.pfizer.com/news/announcements/accelerating-innovation-pfizers-2025-ai-festival\">Pfizer’s December announcement</a> of its second annual AI Festival.</p>\n<h3 class=\"standard-heading\">Reshaping the job landscape</h3>\n<p>Although biotech job losses <a href=\"https://www.pharmavoice.com/news/layoffs-biopharma-2026-drug-pharma/810386/\">have surged</a>, last year’s spike hasn’t necessarily been linked to AI. </p>\n<p>In fact, AI has added jobs at some Big Pharma companies. Eli Lilly announced it’s working with Nvidia to build an <a href=\"https://blogs.nvidia.com/blog/lilly-ai-factory-nvidia-blackwell-dgx-superpod/\">“AI factory for drug discovery”</a> and <a href=\"https://url.us.m.mimecastprotect.com/s/2gkZCv2YjAf2920LySziJIQYkzb?domain=investor.lilly.com\" rel=\"noopener noreferrer\" target=\"_blank\">co-innovation lab in San Francisco</a> that will create new scientific and technical roles.</p>\n<p>AI hiring is also top of mind for the life sciences industry, with <a href=\"https://www.pharmavoice.com/news/ai-expertise-pharma-hiring-need-eli-lilly/749194/\">more than half of surveyed biotech execs</a> saying that AI experts are among the top three roles they need to fill in the coming years. The search for AI talent is especially critical as life sciences companies invest in and build more in-house AI teams.</p>\n\n<div class=\"hide-small show-large\" id=\"desktop-inline-signup\"></div>\n<p>“I'm seeing more in-house analytics buildouts versus in previous years where they would outsource a lot of these to vendors,” Yoo said. “Instead of using one person to oversee a vendor, they'll create that team internally.”</p>\n<p>Pharma job titles are also being reshaped by AI, creating hybrid roles that merge several functions and capabilities, such as commercial analytics and market access.</p>\n<p>“AI is allowing a lot of companies to transform some roles and make them more productive, versus hiring routine and repetitive rules-based positions,” Yoo said. “Our clients are asking us more for cross-functional skill sets than maybe a technical expert in just one area.”</p>\n<p>Yoo pointed to one company that combined departments after adding AI capabilities, requiring employees to work more cross-functionally.</p>\n<p>“You can call it restructuring, but there was not a single employee that was displaced,” he said.</p>\n<h3 class=\"standard-heading\">Where AI skills are in demand</h3>\n<p>Drug discovery is the biggest area where life sciences companies will not only add AI functions but jobs as well, Yoo said.</p>\n<p>“AI is allowing companies to discover therapies and drugs at a fraction of the cost that it took before, and a fraction of the resources. So there's a booming demand for AI and [machine learning] engineering talent, specifically in discovery,” he said.</p>\n<p>Commercial analytics roles are also in high demand, with a need for workers who can analyze commercial data and real-world evidence.</p>\n<p>“Any positions and departments that directly affect time-to-market and any type of regulatory success is going to remain in high demand,” he said. “That cross-functional piece, I think, is going to be really important.”</p><div class=\"show-small hide-large\" id=\"mobile-inline-signup\"></div><section class=\"storylines-carousel-wrapper hide-small show-large\" id=\"desktop-carousel\"></section>\n<p>Whether AI will eventually lead to major job losses in pharma remains to be seen, but for now Yoo believes the industry’s broader focus beyond revenue will help it retain jobs that are being lost in other industries.</p>\n<p>“At companies like Amazon or any tech company, there's more of a bottom line that you have to prioritize,” he said. “Whereas in pharma, you're prioritizing therapies, drugs and patients.”</p>\n</div>",
            "link": "https://www.biopharmadive.com/news/ai-biotech-pharma-jobs-layoffs-amazon-nvidia-pharma/812635/",
            "pub_date": "2026-02-24 01:45:53",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Biotech startups are built on venture capital. Track funding rounds here.",
            "description": "<div class=\"article-body add-drop-cap\">\n<p>Drug development is an expensive, risky endeavor. Biotechnology companies just starting out are many years away from seeing profits, if ever. So more often than not, a startup’s success turning science into medicines can come down to how much money it raises. That’s where venture capitalists step in, investing many millions of dollars for stakes in newly formed companies.</p>\n<p>Young drugmakers rely on these private partners to survive until they can reach major milestones like entering clinical testing, or going public. And over the past two decades, they’ve had more and more help. The amount of money put into biotech has climbed considerably, resulting in the creation of hundreds of new companies.</p>\n\n<p>Tracking that investment can reveal important patterns, showing how different drug types or diseases rise or fall out of favor with investors. BioPharma Dive built this database to help make that larger picture clear.</p>\n<p>We’ve focused on a group of 26 venture capital firms that are highly active in creating new drug developers. In the database below, we’ve collected funding rounds involving those firms, a ledger of investment that we’ll update regularly.</p>\n<p>If we’ve missed anything, or there’s additional information you’d like to see, please <a href=\"/cdn-cgi/l/email-protection#a3869193c1caccd3cbc2d1cec28dc7cad5c68dc6c7cad7ccd1d0e3cacdc7d6d0d7d1dac7cad5c68dc0ccce\">reach out and let us know</a>.</p>\n<p><a href=\"#database\"><strong>Jump to database</strong></a></p>\n<p><a href=\"#methodology\"><strong>Jump to methodology</strong></a></p>\n<div class=\"ed-chart ed-chart__datawrapper\" data-source=\"snorkel-form\">\n<h4 class=\"ed-chart__title\">RA Capital, Arch are among the most active biotech investors</h4>\n<div class=\"ed-chart__sub\">Number of funding rounds involving each venture firm by year</div>\n<iframe aria-label=\"Split Bars\" data-external=\"1\" frameborder=\"0\" height=\"648\" id=\"datawrapper-chart-toUUb\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://datawrapper.dwcdn.net/toUUb/1/\" style=\"width: 0; min-width: 100% !important; border: none;\" title=\"Investments by firm by year\"></iframe><script data-cfasync=\"false\" src=\"/cdn-cgi/scripts/5c5dd728/cloudflare-static/email-decode.min.js\"></script><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r=0;r<e.length;r++)if(e[r].contentWindow===a.source){var i=a.data[\"datawrapper-height\"][t]+\"px\";e[r].style.height=i}}}))}();\r\n              </script></div>\n<p><em>Editor's note: The following visualizations compare full-year data from 2022-2024, as well as year-to-date figures for 2025, which will be updated as more venture rounds are added into the database.</em></p>\n<div class=\"break-grid-medium chart-pad\" id=\"chart-section\">\n<div class=\"col-chart-section-wrapper\">\n<div class=\"ed-chart ed-chart__datawrapper\" data-source=\"snorkel-form\">\n<h4 class=\"ed-chart__title\">Investment in biologic drugmakers has risen</h4>\n<div class=\"ed-chart__sub\">Total venture investment, by year, in biotechs developing drugs of each type</div>\n</div>\n<div class=\"col-chart-parent\"><iframe aria-label=\"Multiple Columns\" data-external=\"1\" frameborder=\"0\" height=\"232\" id=\"datawrapper-chart-NBkH4\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://datawrapper.dwcdn.net/NBkH4/5/\" style=\"width: 0; min-width: 100% !important; border: none;\" title=\"Modality\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}}))}();\r\n</script></div>\n<div class=\"chart-caption chart-caption-single-chart\">\n<p>Note: Sizable investments of $3 billion and $1 billion, respectively, in Altos Labs and Xaira Therapeutics account for large portions of funding to companies classified under \"drug discovery.\"</p>\n</div>\n<div class=\"ed-chart ed-chart__datawrapper\" data-source=\"snorkel-form\">\n<h4 class=\"ed-chart__title\">In 2025, immune diseases are drawing the lion's share of investments</h4>\n<div class=\"ed-chart__sub\">Total venture investment, by year, in biotechs developing drugs for each category of disease</div>\n</div>\n<div class=\"col-chart-parent\"><iframe aria-label=\"Multiple Columns\" data-external=\"1\" frameborder=\"0\" height=\"232\" id=\"datawrapper-chart-yNVGN\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://datawrapper.dwcdn.net/yNVGN/5/\" style=\"width: 0; min-width: 100% !important; border: none;\" title=\"Therapeutic aka Disease area\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}}))}();\r\n</script></div>\n<div class=\"chart-caption chart-caption-single-chart\">\n<p>Note: Data on eye, lung and infectious diseases are not shown, nor are data on rounds involving companies that either didn't disclose their therapeutic focus or had multiple of equal priority.</p>\n</div>\n<div class=\"ed-chart ed-chart__datawrapper\" data-source=\"snorkel-form\">\n<h4 class=\"ed-chart__title\">Investment is shifting toward later-stage biotechs</h4>\n<div class=\"ed-chart__sub\">Total venture investment, by year, in biotechs at each phase of clinical testing</div>\n</div>\n<div class=\"col-chart-parent\"><iframe aria-label=\"Multiple Columns\" data-external=\"1\" frameborder=\"0\" height=\"247\" id=\"datawrapper-chart-h3nhV\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://datawrapper.dwcdn.net/h3nhV/3/\" style=\"width: 0; min-width: 100% !important; border: none;\" title=\"Stage\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}}))}();\r\n</script></div>\n<div class=\"ed-chart ed-chart__datawrapper\" data-source=\"snorkel-form\">\n<h4 class=\"ed-chart__title\">Funding rounds are generally larger in 2025</h4>\n<div class=\"ed-chart__sub\">Median value of venture rounds, by year, for biotechs at each phase of clinical testing</div>\n</div>\n<div class=\"col-chart-parent\"><iframe aria-label=\"Multiple Columns\" data-external=\"1\" frameborder=\"0\" height=\"232\" id=\"datawrapper-chart-sSoxh\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://datawrapper.dwcdn.net/sSoxh/4/\" style=\"width: 0; min-width: 100% !important; border: none;\" title=\"Stage - Median\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}}))}();\r\n</script></div>\n<div class=\"ed-chart ed-chart__datawrapper\" data-source=\"snorkel-form\">\n<h4 class=\"ed-chart__title\">Securing $100 million in a single round is now common</h4>\n<div class=\"ed-chart__sub\">Median value of venture rounds, by year and by series</div>\n</div>\n<div class=\"col-chart-parent\"><iframe aria-label=\"Multiple Columns\" data-external=\"1\" frameborder=\"0\" height=\"232\" id=\"datawrapper-chart-xuzbT\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://datawrapper.dwcdn.net/xuzbT/4/\" style=\"width: 0; min-width: 100% !important; border: none;\" title=\"Round - Median\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}}))}();\r\n</script></div>\n<div class=\"chart-caption chart-caption-single-chart\">\n<p>Note: A number of companies announced multiple rounds jointly, such as for a combined Series A and Series B. Those rounds are not visualized above.</p>\n<p>Charts: Julia Himmel/BioPharma Dive</p>\n</div>\n</div>\n</div>\n<p><em>Editor’s note: Search by biotech or investor name in the text box at top left. Filter by specific year, series or stage of investment, as well as sort by round size using the drop-down menus. Clicking any underlined term in the main database at right will filter by that term. Click the down arrow at far right to expand the information displayed for each round.</em></p>\n<p><em>If the data do not display below, please try clearing your browser’s cache and reloading the page. If you still have issues, email <a href=\"/cdn-cgi/l/email-protection#6a4f585a0803051a020b18070b440e031c0f440f0e031e0518192a03040e1f191e18130e031c0f44090507\">BioPharma Dive editors</a> for further troubleshooting.</em></p>\n<div class=\"break-grid-medium vc-database\" id=\"database\">\n<div class=\"placeholder\">\n<p>Loading...</p>\n</div>\n</div>\n<div class=\"ed-secondary-content-box\" id=\"methodology\">\n<h4>Methodology and limitations:</h4>\n<p>For this database, BioPharma Dive compiled venture fundraising rounds for private biotechnology companies developing human medicines. We screened for rounds involving at least one of a group of 26 highly active venture capital firms involved in company creation.</p>\n<p>This group was selected by comparing data from SVB, HSBC, William Blair and Bay Bridge Bio that identified the most active biotech venture capital firms in 2023 and 2024 (SVB, HSBC, William Blair), 2022 (SVB), 2021 (SVB) and in 2018 to 2023 (Bay Bridge Bio). Investment activity in those lists was defined by the number of fundraising rounds in which each firm participated that year.</p>\n<p>We then eliminated firms that were primarily a “crossover” investor. That yielded a list of 26 venture capital firms.</p>\n<p>This core group of 26 firms is narrow by definition. But the activity of these firms provides a meaningful snapshot of investment trends in the industry. Over time, we plan to expand on this initial database by adding in more firms that meet our target focus.</p>\n<p>This database is similarly limited by time. We focused on rounds that were completed and announced on or after Jan. 1, 2022. This captures a period of time in which the biotech sector experienced a downturn after a record high and the sector’s subsequent recovery. We also plan to add historical data from prior to Jan. 1, 2022 in later updates.</p>\n<p>For each round identified, we collected information on the relevant company’s drugmaking modality and therapeutic area of focus, as well as the company’s stage of development and lead investors, if not one of the core group of 26 firms.</p>\n<p>We generally used a company’s lead program to determine its modality, therapeutic area of focus and stage of development at the time of each round’s completion. The only exceptions to this are companies that inherited a late-stage candidate, but identified an earlier candidate as their priority and reason for raising funds. We categorized companies’ phase of development by the latest stage begun at the time of financing. So a company raising money to start a Phase 2 clinical trial that it hadn’t yet begun would be classified as in Phase 1.</p>\n<p>The modalities listed are broadly defined and may not precisely describe an individual company’s experimental drug(s). They were chosen to better show overall trends in investment activity. “Drug discovery,” as a category, is meant to indicate those companies exploring new areas of science broadly, rather than focusing on a specific type of medicine.</p>\n<p>Similarly, therapeutic areas cover a large number of diseases and, in some cases, such as with rare conditions, overlap with others. Common diseases that didn’t fit in the categories listed, such as those primarily affecting the heart, lungs, kidneys and endocrine system, were classified under “other.” When companies identified more than one therapeutic area with equal priority, we classified them as working on “multiple” therapeutic areas. Those that identified multiple areas, but prioritized one over others were classified under that priority area.</p>\n<p>The nomenclature of venture capital rounds is fairly consistent, but some firms did not identify whether their round was seed or Series A, B, C, etc. In those cases, we classified the round as “undisclosed.” Extensions, expansions, or other add-on raises to an earlier Series round are noted, but not classified separately.</p>\n<p>Nearly all rounds were announced in U.S. dollars. A handful were priced in euros or other foreign currencies, which we converted to dollars using exchange rate data from the relevant country’s central bank on the day the round was announced.</p>\n<p>We organized rounds by the date they were announced, which in some cases is much later than when the round was actually raised if a company was initially operating in stealth. We did this for consistency, and to better match when a round’s existence was public knowledge. </p>\n<p>BioPharma Dive will update this database as rounds that meet our screening criteria are announced, but there may be some delay in when new rounds are added.</p>\n</div>\n</div>",
            "link": "https://www.biopharmadive.com/news/biotech-venture-capital-funding-startup-tracker/726829/",
            "pub_date": "2026-02-21 01:24:38",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FDA reverses course on Moderna’s flu vaccine",
            "description": "<div class=\"large medium article-body\">\n<p>The Food and Drug Administration has reversed its prior decision and will review Moderna’s experimental flu vaccine application for potential approval under a revised regulatory approach.</p>\n<p>Last week, the FDA rejected the company’s application, citing issues with the comparator chosen in clinical testing. Moderna said Wednesday that, following a so-called Type A meeting, the agency <a href=\"https://feeds.issuerdirect.com/news-release.html?newsid=8923338804483797&amp;symbol=MRNA\">agreed to review</a> the approval application for mRNA-1010, with a deadline of Aug. 5.</p>\n<p>Moderna hopes to secure an FDA nod based on age. It’s seeking traditional approval for adults aged 50 to 64 years old, and accelerated approval for those 65 and older. The company also said it agreed to conduct a post-marketing study in older adults. If approved, the shot could be available to that population for the 2026-27 flu season.</p>\n<p>\"We appreciate the FDA's engagement in a constructive Type A meeting and its agreement to advance our application for review,\" said Stéphane Bancel, CEO of Moderna.</p>\n<p>Vaccine makers have faced an uncertain market under the leadership of Robert F. Kennedy Jr., a vaccine skeptic who has heavily questioned the safety and efficacy of several shots.</p>\n\n\n<p>Moderna has been especially hit. Reeling from lowered sales of its COVID-19 vaccine, the company has been heavily scrutinized for its use of messenger RNA technology. Under Kennedy’s leadership, the Health and Human Services Department <a href=\"https://www.biopharmadive.com/news/hhs-terminates-millions-funding-moderna-contract-bird-flu-mrna/749254/\">canceled</a> <a href=\"https://www.biopharmadive.com/news/kennedy-mrna-vaccines-barda-hhs-cancel-contracts/756953/\">millions of dollars</a> in government contracts for mRNA vaccine research. Meanwhile, the FDA set <a href=\"https://www.biopharmadive.com/news/fda-covid-booster-approval-framework-makary-prasad-nejm/748580/\">stricter approval standards </a>for COVID shots and issued narrow approvals, while the Centers for Disease Control and Prevention softened recommendations for the vaccines.</p>\n<p>As a result of the challenging climate, Moderna said it would <a href=\"https://www.youtube.com/shorts/b73mDuoEMps\">no longer invest</a> in late-stage trials for vaccines and is shifting its <a href=\"https://www.biopharmadive.com/news/moderna-fourth-quarter-2025-financial-earnings/812211/\">focus to oncology.</a></p>\n<p>Last week, in an unorthodox move, the company publicly shared the “refusal-to-file” letter that rejected its application. The FDA’s top vaccine official, Vinay Prasad, signed the letter and stated Moderna’s Phase 3 trial testing mRNA-1010 was not “adequate and well-controlled.” Moderna immediately requested a meeting to discuss the candidate’s future.</p>\n<p>The move sparked backlash from the industry, as reports said Prasad <a href=\"https://www.wsj.com/health/healthcare/why-the-fda-blocked-modernas-new-flu-shot-84fdaab6?st=NFFubx&amp;reflink=desktopwebshare_permalink\">overruled agency reviewers</a> in rejecting the application.</p>\n<p>In a Wednesday note to clients, TD Cowen analyst Tyler Van Buren wrote that he believes this backlash led the agency to “quickly find an acceptable solution.” He highlighted the “remarkably short turnaround for a Type A meeting,” which typically doesn’t happen for 30 to 60 days after a refuse to file letter is received.</p>\n<p>Some analysts are still skeptical of the move. Mani Foroohar, in his own note, argued the FDA reversal is a “meaningful positive ... though uncertainty remains.”</p>\n\n<div class=\"hide-small show-large\" id=\"desktop-inline-signup\"></div>\n<p>“It remains to be seen how this more assertive approach to the FDA ultimately impacts the review outcome for mRNA-1010, details of a post-marketing study, and — most financially important for Moderna — approval path for the combo flu/COVID vaccine,” Foroohar added.</p>\n<p>In an email to BioPharma Dive, HHS Spokesman Andrew Nixon said the “FDA will maintain its high standards during review and potential licensure stages as it does with all products.”</p>\n<p>Shares for Moderna were up more than 8% at certain points Wednesday morning.</p>\n<p><em>Editor's Note: This story has been updated to include a statement from HHS.</em></p>\n</div>",
            "link": "https://www.biopharmadive.com/news/fda-reverses-course-review-moderna-approval-application-influenza-/812432/",
            "pub_date": "2026-02-21 01:24:39",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        }
    ]
}