{
    "data": [
        {
            "title": "Stable and Vibrant: PSI CRO Announces 15% Growth and Ultra-Low Staff Turnover",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>ZUG, Switzerland — </strong></span><p><strong>ZUG, SWITZERLAND, 30 January 2025 — </strong>PSI CRO AG, a global Swiss-based CRO, has announced completing 2024 with commendable operational and financial results, reaching its revenue goals exactly as planned and demonstrating a <strong>15% growth over the previous year</strong>. PSI is the only fully independent and privately owned CRO of its size. Currently, the company reports 3,000 full-time employees in 56 countries. <strong>2025 will be PSI’s 30th year in business. </strong></p><p>PSI is recognized as a remarkably stable CRO in an industry known for its unpredictability. Since the company’s establishment in 1995 in Switzerland, PSI has remained entirely independent, always growing organically, with the unchanging management team focused on solving the industry’s biggest and largely unaddressed problem of poor patient enrollment.  </p><p>“For every study protocol that comes across our desk we need to examine and address a variety of intrinsic circumstances that are prone to affect patient enrollment. Only by learning to see and predict the many inconspicuous factors affecting enrollment by country, by region, by county, by state, by site, can we speak of the ability to operationalize effective enrollment strategies. I am proud to say that we are getting better and better at that,” says Nick Sinackevich, PSI’s President. “In our quest for enabling predictable enrollment of studies of any size and complexity, we made substantial progress with putting in place multilayered site support systems and establishing indication-specific referral networks,” adds Sinackevich. </p><p>2024 was the year in which PSI’s key operational differentiator – <strong>on-time project delivery – remained above 90%. </strong></p><p>PSI additionally reported their staff turnover rate dropped to a single-digit number of 9% globally, a sign of unwavering stability and robust corporate culture. </p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20250203-stable-and-vibrant-psi-cro-announces-15-growth-and-ultra-low-staff-turnov-1/",
            "pub_date": "2025-02-03 23:15:29",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New Survey Reveals Pervasive Concerns About Pharma Supply Chain Security Risks",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>BOSTON — </strong></span><p>Pharmaceutical executives are near unanimous (with 68% strongly agreeing and 31% somewhat agreeing) in their concern about a marked increase in theft, fraud, and/or attacks in the pharmaceutical supply chain, according to a new survey from BioPharma Dive’s studioID and <a href=\"https://www.tive.com/\">Tive</a>, the global leader in supply chain and logistics visibility technology. </p><p>The 115 survey respondents — comprised primarily of pharmaceutical, biologics, and medical device manufacturers — identified inadequate real-time visibility into the location and condition of goods as a critical vulnerability, contributing to incidents such as product tampering, theft, and compromised cold chain integrity. This is of particular concern as therapies that require ultracold temperatures ranging from -70°C to -196°C account for an ever-larger portion of shipments.</p><p>A substantial 92% of respondents agree that the level of risk in pharma/life sciences supply chains has increased over the past two years, and 94% expect risk to be even higher two years from now. </p><p>Those beliefs stem from a steady stream of reports on in-transit security incidents. The United States, for example, has seen a significant increase in hijacked shipments, says Alex Guillen, global SME, life science and pharma at Tive. In many cases, bad actors are hacking systems and pushing out new addresses to drivers — who make the deliveries without knowing anything is amiss. “There is more and more sophistication in the way that the systems are being hacked,” he says. </p><p>In the face of such events, many pharma supply chain executives are taking steps to increase visibility into the location and condition of goods in transit — and are seeing results. Companies that have implemented real-time shipment visibility and condition monitoring are seeing several benefits to their supply chain operations, including improved on-time, in-full delivery rates (79%) and the ability to identify routing or condition issues in real time (76%). </p><p>Other key findings of the research:</p><ul><li><strong>Multiple issues face pharma goods in transit</strong>. The most common in-transit security issues are product tampering and repackaging (57%), damage due to mishandling or improper temperature control (44%), in-transit theft/fraud (35%), and diversion or misrouted shipments (30%).</li><li><strong>In-transit security is subject to multiple risks</strong>. The most significant sources of risk are inadequate security processes (43%), maintaining cold chain integrity from manufacturing to end delivery (42%) and cyberattacks (35%). </li><li><strong>Pharma needs greater visibility into the location and condition of their sensitive goods.</strong> Nearly half (49%) of respondents say inadequate visibility into shipment conditions is their company’s biggest visibility challenge, followed closely by inaccurate or limited visibility data from transportation providers (47%). </li><li><strong>Improving processes and visibility are top risk-reduction strategies.</strong> Respondents cited the most effective strategies to reduce risk as updating security processes (71%), improving supply chain visibility (70%), strengthening oversight of supplier compliance (53%) and consolidating transportation providers (48%).</li><li><strong>Pharma execs are investing in in-transit visibility</strong>. Real-time visibility software and trackers (83%) are most widely used, however, many report using legacy methods such as email (80%), document-based tracking (77%), and phone calls (75%) — all of which are prone to errors and delays.</li></ul><p>Pharma executives responding to the survey were nearly unanimous (96%) that the ability to independently verify the accuracy of supplier-provided visibility data is critical to ensure a secure supply chain, and (93%) say this independently verified data has improved relationships with their customers.</p><p>“Independent verification enables pharma companies to get an accurate, end-to-end view of shipments in transit, while partners can only account for their portion,” Tive’s Guillen explains. “The key part is to pair real-time visibility with a control tower so we can intervene to prevent potential damage or loss of the shipment.”</p><p>The survey report details the steps those in the pharma supply chain are taking to mitigate the increasing risk of goods in transit, as well as the top criteria they use to guide investment decisions. </p><p> </p><p><strong>Survey Methodology</strong></p><p>Tive collaborated with Supply Chain Dive’s studioID to conduct the online survey in September, 2024, receiving responses from 115 respondents in transportation/logistics, quality control, operations, supply chain management/procurement and related roles, primarily at pharmaceutical, biologics, and medical device manufacturers. They responded to a series of multiple-choice questions about their assessment of risk of goods in transit in the pharmaceutical supply chain, as well as their beliefs and experiences in mitigating risk through measures to improve visibility. </p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20250114-new-survey-reveals-pervasive-concerns-about-pharma-supply-chain-security-ri/",
            "pub_date": "2025-01-31 05:45:23",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Biotech IPOs are the industry’s lifeblood. Track how they’re performing.",
            "description": "<section class=\"body\">\n<div class=\"with-drop-cap\">\n<p class=\"body-text\">Initial public offerings make the biotechnology industry tick. Stock listings give young companies the funding they need to develop their drugs, and their venture backers an opportunity to earn a return.</p></div>\n<p class=\"body-text\">For much of the past decade, biotechs found Wall Street receptive to their pitches. Public investment, drawn in by scientific advances and company successes, bolstered generations of new drugmakers.</p>\n<p class=\"body-text\">IPO activity reached a peak in 2021, when more than 100 biotechs priced an initial offering and together raised nearly $15 billion. But that momentum came to a halt in 2022 as stock prices of newly public companies plummeted amid a sector-wide downturn. The pace of IPOs stalled and, last year, only 24 drugmakers priced initial share sales.</p>\n<!-- desktop ad -->\n\n<!-- mobile ad -->\n\n<p class=\"body-text\">Emerging biotechs now face a tougher road to public markets. Which will make it? Which create value and which fail? What types of companies earn the best returns? Who are their investors?</p>\n<p class=\"body-text\">Biopharma Dive is tracking these questions in the database below, which will be updated regularly. If we've missed anything, or there's any additional information you'd like to see, please <a href=\"/cdn-cgi/l/email-protection#8babe9e2e4fbe3eaf9e6eaa5efe2fdeea5eeefe2ffe4f9f8cbe2e5effef8fff9f2efe2fdeea5e8e4e6\">reach out and let us know</a>.</p>\n<p class=\"body-text\"><em>Editor's note: Click on a company to pull up more information, and scroll to the bottom of the page to read how this information was collected and organized. If tables or values do not display below, please try clearing your browser's cache and reloading the page.</em></p>\n</section>",
            "link": "https://www.biopharmadive.com/news/biotech-ipo-performance-tracker/587604/",
            "pub_date": "2025-01-31 06:05:26",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cargo to drop lead CAR-T therapy, lay off staff after study setback",
            "description": "<div class=\"large medium article-body\">\n<h3>Dive Brief:</h3>\n<ul>\n<li>Cell therapy developer Cargo Therapeutics will scrap its top program and lay off half of its staff after study results showing the treatment, which was being tested in a form of lymphoma, doesn’t have a “competitive risk-benefit profile,” the company <a href=\"https://investors.cargo-tx.com/news-releases/news-release-details/cargo-therapeutics-provides-corporate-update-and-anticipated\">announced Wednesday</a>.</li>\n<li>Cargo said safety concerns observed in Phase 2 testing of the therapy, firi-cel, spurred it to conduct an immediate data analysis. The company found 18% of treatment recipients experienced an immune reaction graded as severe or worse. Additionally, the remission rate associated with firi-cel, which was initially 43%, fell to 18% after three months, Cargo said.</li>\n<li>Cargo will now focus on other research, including a different kind of therapy heading into early testing, while evaluating “strategic options.” The company, which raised <a href=\"https://www.biopharmadive.com/news/cargo-therapeutics-ipo-car-t-cancer/699239/\">$281 million</a> in an initial public offering in November 2023, lost three quarters of its share value after the announcement.</li>\n</ul>\n\n\n<h3>Dive Insight:</h3>\n<p>Cargo had been hoping firi-cel might prove helpful for people with large B-cell lymphoma who relapse after CAR-T therapies like Kymriah or Yescarta. Its treatment engineers patients’ immune cells to go after a different protein flag, CD22, than those therapies.</p>\n<p>Academic work out of Stanford University scientists — which have been testing a similar type of cell therapy — had given Cargo and its investors reason for optimism. Data <a href=\"https://ash.confex.com/ash/2024/webprogram/Paper198544.html\">reported in December</a> showed remission rates that supported the potential for a “durable benefit” in firi-cel’s Phase 2 trial, William Blair analyst Sami Corwin wrote in a research note in December.</p>\n<p>The study results disclosed Wednesday, then, were “unexpected,” said Gina Chapman, Cargo's CEO, in a statement. The treatment’s lack of durability, and “higher-than-expected occurrence and severity” of immune-related side effects, fell short of the company’s expectations, she added.</p>\n<p>Cargo will present further details at a medical meeting. Those specifics, such as patients’ baseline characteristics and CD22 expression levels, could help explain firi-cel’s fleeting effects, Corwin wrote on Thursday.</p>\n<p>In the meantime, Cargo has reset its strategy. A second program called CGR-023, which modifies immune cells to express receptors for three proteins — CD19, CD20 and CD22 — was cleared by U.S. regulators earlier this month to begin human testing. Cargo claims targeting this trio of proteins could be useful in treating a “broad range” of B-cell malignancies and give more patients the opportunity for long-lasting remissions.</p>\n<p>It’s also researching, preclinically, a type cell therapy made from the cells from donors instead of individual patients.</p>\n<p>In parallel, Cargo is evaluating strategic options, a process that often results in a sale or merger. The company “should consider a reverse merger” given its “valuable” cash reserves, wrote Jefferies analyst Michael Yee.</p>\n<p>The company had about $368 million on hand at the end of 2024 and <a href=\"https://www.sec.gov/Archives/edgar/data/1966494/000095017024125369/crgx-20240930.htm\">170 full-time employees</a> last year, according to regulatory filings. The layoffs should extend its cash runway into the middle of 2028.</p>\n<p>Cargo isn’t the only recent biotech IPO to report a significant setback. Since October, <a href=\"https://www.biopharmadive.com/news/neumora-depression-drug-data-results-stock-navacaprant/736263/\">Neumora Therapeutics</a>, <a href=\"https://www.biopharmadive.com/news/alto-depression-study-failure-stock-biotech/730774/\">Alto Neuroscience</a> and <a href=\"https://www.biopharmadive.com/news/bioage-azelaprag-tirzepatide-study-2-stop-obesity/734931/\">BioAge Labs</a> have lost most of their share value following disappointing study results.</p>\n</div>",
            "link": "https://www.biopharmadive.com/news/cargo-therapeutics-layoffs-firi-cel-study-results/738706/",
            "pub_date": "2025-01-31 06:05:26",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Upperton Pharma Completes Build of New £7million Sterile Manufacturing Facility",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>NOTTINGHAM, United Kingdom — </strong></span><p>The new facility is in addition to its existing 50,000 sq. ft facility, <a href=\"https://upperton.com/about-us/our-facilities/\">Trent Gateway</a>, and the purpose-built facility has been designed specifically in line with the revised EU GMP Annex-1 regulations. The 7,000 sq. ft facility will support the manufacturing of aseptic and terminally sterilised small-volume liquids and powders for parenteral, nasal and pulmonary delivery.</p><p>The new facility has the capability to support formulation development, clinical manufacture and analytical testing, with batch sizes of up to 2,000 vials, pre-filled syringes and pre-filled cartridges for liquid formulations and pre-sterilized powders.</p><p>The expansion is a natural progression for <a href=\"https://upperton.com\">Upperton</a> who already develops and manufactures small molecule and biological, non-sterile, oral, nasal and pulmonary dosage forms from early development to late-stage clinical manufacture for global biotech and pharmaceutical companies. </p><p>Nikki Whitfield, Chief Executive Officer, said, “We are delighted to complete the build of our sterile facility. The combined experience of our leadership team in sterile facility builds and subsequent operations ensure that we are ideally placed as a CDMO partner of choice for small to mid-sized biotech and pharma looking to get into the clinic quickly with fast access to sterile manufacturing services.”</p><p>The sterile facility will feature two cleanrooms with advanced VHP isolation technology and carry out GMP manufacturing of sterile drug products making use of existing full-service formulation development and quality control laboratories.</p><p>Jon Austwick, Director of Quality &amp; Compliance, said: “This expansion illustrates our continued investment in our capabilities to support drug developers to scale and accelerate the path to delivering safe and effective medicines to patients. The facility has been built with the highest level of quality and is a testament to our internal teams and build vendor who have worked tirelessly over the past 12 months to bring our vision to life”. </p><p>This investment in <a href=\"https://upperton.com/services/sterile-processing-aseptic-drug-manufacturing/\">sterile drug product manufacturing</a> enhances the existing service offering from Upperton, which provides formulation development across a broad range of dosage forms, clinical trial supply, and late-stage manufacturing for non-sterile dosage forms for both small molecules and biologics.</p><p>Whilst the commissioning of the facility, along with the installation and validation of new equipment continues, Upperton will utilise existing expertise within their research &amp; development and analytical teams to support the pre-formulation and stability studies for early proof-of-concept products for parenteral, nasal and pulmonary delivery. </p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20250129-upperton-pharma-completes-build-of-new-7million-sterile-manufacturing-faci/",
            "pub_date": "2025-01-29 22:00:34",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Schrödinger Selects Sapio Sciences to Enhance In Silico Drug Discovery from Plasmid to Structure",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>BALTIMORE — </strong></span><p><strong>BALTIMORE, MD, January 28, 2025</strong> — <a href=\"https://www.sapiosciences.com/?utm_campaign=5510975-2025-media-communications&amp;utm_source=sapio-sciences-press-release&amp;utm_content=home\">Sapio Sciences</a>, the science-awareTM <a href=\"https://www.sapiosciences.com/products/lab-informatics-platform/\">lab informatics platform</a>, today announced that Schrödinger, a global leader in computational chemistry, has adopted the Sapio Platform to improve data management, enhance lab efficiency, and accelerate the discovery of novel molecules. By deploying Sapio’s unified informatics platform, including <a href=\"https://www.sapiosciences.com/products/lims/?utm_campaign=5510975-2025-media-communications&amp;utm_source=sapio-sciences-press-release&amp;utm_content=lims\">Sapio LIMS</a> and <a href=\"https://www.sapiosciences.com/products/electronic-lab-notebook/?utm_campaign=5510975-2025-media-communications&amp;utm_source=sapio-sciences-press-release&amp;utm_content=eln\">Sapio ELN</a>, Schrödinger is transforming its recently acquired wet lab operations, integrating data, and streamlining workflows.</p><p>Schrödinger established its internal wet lab after acquiring a contract research organization (CRO) in 2021. However, the lab’s reliance on manual, paper-based processes posed significant challenges in scalability, traceability, and operational efficiency. Transitioning to Sapio’s no-code informatics platform has provided a scalable, flexible solution that simplifies operations and accelerates scientific progress.</p><p>Dr. Rajesh Kumar, Senior Director of Drug Discovery at Schrödinger, commented: “Sapio’s solution has allowed us to digitize critical lab functions, improve efficiency, and ensure seamless sample traceability across our research and discovery processes. By unifying data and automating workflows, we’re able to focus on advancing our research with greater speed and confidence.”</p><p>Since adopting the Sapio Platform, Schrödinger has realized several key benefits, including:</p><ul><li><strong>Improved visibility across the discovery process:</strong> Researchers now have a clear, real-time view of every stage, optimizing resource use and improving overall efficiency.</li><li><strong>Comprehensive data traceability:</strong> Detailed documentation of lab activities simplifies audits, accelerates regulatory filings, and ensures full compliance.</li><li><strong>Optimized resource allocation:</strong> Access to historical data enables better planning, budgeting, and distribution of resources across multiple projects.</li><li><strong>Long-term knowledge retention:</strong> A centralized knowledge base allows scientists to easily retrieve critical data, supporting ongoing and future research initiatives.</li></ul><p>Mike McCartney, Chief Commercial Officer at Sapio Sciences, commented: “Schrödinger’s adoption of the Sapio Platform highlights the increasing demand for configurable informatics solutions that unify complex lab environments. By eliminating data silos and improving lab efficiency, we’re enabling Schrödinger to accelerate drug discovery and drive innovation.”</p><p>The full story on the Schrödinger implementation can be found <a href=\"https://www.sapiosciences.com/resource/schrodinger-accelerates-in-silico-discovery-from-plasmid-to-structure/\">here</a>. </p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20250128-schrodinger-selects-sapio-sciences-to-enhance-in-silico-drug-discovery-from/",
            "pub_date": "2025-01-28 22:45:27",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Model Medicines Unveils Generative AI, Multi-Modal Therapeutic Pipeline Breakthrough, Demonstrating End-To-End Drug Discovery Capabilities",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>LA JOLLA, Calif. — </strong></span><p>Model Medicines, a pioneering biotech company focused on developing first-in-class therapeutics with artificial intelligence (AI), today announced the release of its latest scientific pre-print, titled <a href=\"https://www.biorxiv.org/content/10.1101/2025.01.17.633620v1\"><i>\"GALILEO™ Generatively Expands Chemical Space and Achieves One-Shot Identification of a Library of Novel, Specific, Next-Generation Broad-Spectrum Antiviral Compounds at High Hit Rates</i>.”</a> This preprint showcases the Generative AI, New Chemical Entity (NCE), Multi-Modal Modeling, One-Shot Identification, and Library-Scale Hit-Rate capabilities of its proprietary GALILEO™ platform. Taken together with three previously released pre-prints, Model Medicines has now publicly demonstrated its end-to-end drug discovery capabilities—novel target and Mechanism of Action(MoA) discovery, novel chemical discovery, and preclinical Proof-of-Concept (PoC) against a first-in-class Target Product Profile (TPP) at unprecedented hit-rates (100%) leveraging Generative-AI, Multi-Modal Models and a 0/1-Shot Discovery Approach.</p><p><strong>Generative AI Drug Discovery</strong></p><p>The current paper underscores the critical need for the deployment of innovative drug discovery platforms capable of engineering precise solutions for diseases with high-unmet medical need when traditional, dogmatic approaches fail. The GALILEO™ platform uniquely enables the generation of vast chemical libraries, while discovering libraries of novel, specific and potent potential therapeutics. </p><p>Key findings from the paper include:</p><p><strong>Generative AI: </strong>A solution space of over 50 Trillion compounds was generated and explored by the GALILEO™ model for this study.</p><p><strong>New Chemical Entities</strong>: The NCE library reported in the manuscript demonstrates significant chemical novelty, with low structural similarity to both MDL-001 and known antivirals such as Beclabuvir.</p><p><strong>Multi-Modal Models:</strong> A multi-modal discovery approach was implemented that engineered-in potency against the novel target and engineered-out a specific off-target interaction. The NCE library displayed specificity improvements of up to 15,000-fold relative to MDL-001 (see Figure). </p><p><strong>Hit Rates &amp; One-Shot Approach: </strong>All 12 compounds in the NCE library discovered by GALILEO™ using a One-Shot approach, from the 50T compound solution space, exhibited antiviral activity against Hepatitis C Virus (HCV) and/or human Coronavirus 229E at therapeutic relevant concentrations in vitro—a 100% hit rate.</p><p><strong>Efficiency:</strong> GALILEO™'s Generative AI, Multi-Modal, One-Shot approach achieved these results in a fraction of the time and cost of traditional discovery methods, highlighting its potential to revolutionize drug development pipelines.</p><p>“This research exemplifies the promise of AI-driven, end-to-end drug discovery,” said Dr. Daniel Haders, CEO of Model Medicines and corresponding author. “From target identification through to the creation of novel chemical entities to Proof-of-Concept validation, GALILEO™ integrates biology, chemistry, and computational power to engineer entirely new therapeutic opportunities with unprecedented speed and precision.”</p><p><strong>A Multi-Generational Success Story</strong></p><p>Building on its two prior discoveries—<a href=\"https://www.biorxiv.org/content/10.1101/2024.03.29.587401v3\">the identification of the novel, broadspectrum RdRp Thumb-1 target</a> and <a href=\"https://www.biorxiv.org/content/10.1101/2025.01.13.632836v2\">the discovery of a novel-acting, first-in-class broad-spectrum antiviral, MDL-001, published with Icahn School of Medicine at Mount Sinai, and University of California, San Diego researchers </a>—Model Medicines has now leveraged its proprietary, multi-modal, generative AI, 0/1 Shot platform to transform and accelerate drug discovery. The GALILEO™ platform achieved unprecedented precision in identifying first-in-class therapeutics, including, as demonstrated in the newest preprint, the next-generation of broad-spectrum antivirals.</p><ol><li><strong>Novel Target Discovery: </strong>Leveraging the GALILEO™ platform’s advanced bioinformatics and multimodal AI capabilities, Model Medicines identified <strong>RdRp Thumb-1</strong>, a previously unrecognized, conserved allosteric and cryptic pocket of viral RNA-dependent RNA polymerase (RdRp), as a novel, broad-spectrum target with paradigm changing treatment potential. Read the full preprint - <a href=\"https://www.biorxiv.org/content/10.1101/2024.03.29.587401v3\">Discovery of RdRp Thumb-1 as a Novel Broad-SpectrumAntiviral Family of Targets and MDL-001 as a Potent Broad-Spectrum Inhibitor Thereof</a>.</li><li><strong>Discovery of Novel-Acting Therapeutic, MDL-001</strong>: From this target, Model Medicines developed <strong>MDL-001</strong>, a first-in-class, best-in-class broad-spectrum antiviral with exceptional safety, ADME and potency properties. Preclinical and clinical studies in conjunction with Icahn School of Medicine at Mount Sinai, and University of California, San Diego researchers demonstrated MDL-001’s ability to inhibit numerous RNA viruses, including Coronaviridae (SARS-CoV-2, alpha-hCoV, beta-hCoV), Flaviviridae (HCV), Caliciviridae (Norovirus) and Orthomyxoviridae (H1N1, Influenza B), relative to a stringent TPP. Read the full preprint - <a href=\"https://www.biorxiv.org/content/10.1101/2025.01.13.632836v2\">MDL-001: An Oral, Safe and Well Tolerated Broad-Spectrum Inhibitor of Viral Polymerases</a>.</li><li><strong>New Chemical Entity Discovery using Generative, Multi-Modal AI: GALILEO™</strong>  generated and explored a solution space of over 50 Trillion compounds. A Multi-Modal, One-Shot approach rapidly identified a library of 12 NCEs from this space. These NCEs, distinct from existing antiviral drugs, achieved 100% hit rates in experimental validation, demonstrating broad-spectrum antiviral activity and high specificity. Read the full preprint - <a href=\"https://www.biorxiv.org/content/10.1101/2025.01.17.633620v1\">GALILEO Generatively Expands Chemical Space and Achieves One-Shot Identification of a Library of Novel, Specific, Next Generation Broad-Spectrum Antiviral Compounds at High Hit Rates</a></li><li><strong>Next-Generation, Precision Engineered Pharmaceutical Solutions: </strong>Model Medicines will continue to evolve its generative-AI GALILEO™ platform by systematically adding complimentary discovery models, expanding our multi-modal solution space and allowing us to further precision engineering and molecular optimizations of therapeutic candidates across potency, safety and ADME variable space. Through this next phase of development, Model Medicines aims to engineer the next-generation Thumb-1-targeting NCEs through precise molecular modifications and expand the chemical solution space for this program. This engineered expansion underscores the precision of the GALILEO™ platform, which continues to evolve as a next-generation tool for transformative drug discovery against the world's most intractable diseases. </li></ol><p><strong>A New Era of AI-Driven Drug Discovery</strong></p><p>In a recent paper, <a href=\"https://ascpt.onlinelibrary.wiley.com/doi/10.1002/cpt.3542\">“Progress, Pitfalls, and Impact of AI-Driven Clinical Trials</a>” authored by Wilczok at Duke University and Insilico Medicine’s Alex Zhavoronkov, the authors advocate for companies to develop diverse, end-to-end capabilities, rather than focus on a singular model of discovery. With this newest preprint, Model Medicines is among the few companies to demonstrate tangible results in all three AI-driven drug discovery model paradigms reported in the paper: repositioning, designing compounds for established targets, and creating entirely new chemical entities for novel targets.</p><p>Model Medicines’ GALILEO™ platform is delivering breakthroughs beyond antivirals. The company is advancing its pipeline to address unmet medical needs in oncology, rare diseases, and other therapeutic areas. With IND-enabling studies underway, Model Medicines is now moving compounds towards the clinic.</p><p>The company is also exploring partnership opportunities to expand GALILEO™'s application, driving innovation across therapeutic domains and addressing the unmet needs of patients worldwide.</p><p>In the coming weeks, Model Medicines plans to advance the identified NCEs into preclinical studies to evaluate pharmacokinetics, safety, and efficacy across diverse viral families. Additionally, they plan to leverage GALILEO™ further to optimize lead compounds and explore additional chemical spaces for next-generation therapeutics.</p><p><strong>VIROMME, A Model Medicines Endeavor (MEE) </strong></p><p>The company recently announced the Model Medicines Endeavor (MME) program, a strategic approach to developing indication-specific spin-out programs to tackle urgent healthcare challenges by leveraging the company’s advanced AI-driven drug discovery platform. VIROMME is the first of Model Medicines’ indication-specific spin-outs, focusing exclusively on infectious diseases. By leveraging MDL-001 and the novel library of 12 NCEs, VIROMME aims to rapidly develop life-saving antivirals targeting the RdRp Thumb-1 site. Learn more at <a href=\"http://www.viromme.com\">www.viromme.com</a> </p><p><strong>Preprints</strong></p><p><a href=\"https://www.biorxiv.org/content/10.1101/2025.01.17.633620v1\"><i>GALILEO Generatively Expands Chemical Space and Achieves One-Shot Identification of a Library of Novel, Specific, Next Generation Broad-Spectrum Antiviral Compounds at High Hit Rates</i></a></p><p><a href=\"https://www.biorxiv.org/content/10.1101/2025.01.13.632836v1\"><i>MDL-001: An Oral, Safe, and Well-Tolerated Broad-Spectrum Inhibitor of Viral Polymerases</i></a></p><p><a href=\"https://www.biorxiv.org/content/10.1101/2024.03.29.587401v3\"><i>Discovery of RdRp Thumb-1 as a novel broad-spectrum antiviral family of targets and MDL-001 as a potent broad-spectrum inhibitor thereof</i></a></p><p><a href=\"https://www.biorxiv.org/content/10.1101/2024.03.22.586314v4\"><i>ChemPrint: An AI-Driven Framework for Enhanced Drug Discovery</i></a></p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20250128-model-medicines-unveils-generative-ai-multi-modal-therapeutic-pipeline-bre/",
            "pub_date": "2025-01-28 22:15:24",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fortis Life Sciences Strengthens Executive Team with Key Appointments",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>BOSTON — </strong></span><p>Fortis Life Sciences®, a global leader in reagent and service solutions for life sciences and diagnostics, has added two seasoned executives to its senior leadership team. Darcy Birse has been appointed General Manager of the Antibody Solutions Business Unit, and Emily Moran has been appointed General Manager of the Cell &amp; Gene Therapy Solutions Business Unit. </p><p>“We are pleased to welcome Darcy and Emily to Fortis,” said Dave King, CEO of Fortis Life Sciences. “Their exceptional leadership, strategic insight, and extensive industry expertise will further enhance our capabilities, empowering us to deliver cutting-edge, high-quality solutions to our life sciences and diagnostics customers across the globe.”</p><p><strong>Darcy Birse – General Manager, Antibody Solutions</strong><br/>Darcy will lead the Antibody Solutions business, which includes the Bethyl Laboratories, Abcore, and Arista Biologicals brands. As General Manager, Darcy will drive growth and innovation across the antibody portfolio to support customer applications, including drug discovery, spatial biology, and immunodiagnostics.</p><p>Darcy was most recently CEO of Culture Biosciences. Prior to that, he served as CCO at Cell Signaling Technology (CST), and before that, held executive roles at GE Healthcare Life Sciences and Lonza Pharma. Darcy holds a BSc in Chemistry from Dalhousie University, earned a D.E.A. in Structural Biology in Strasbourg, France, obtained a PhD in Physics from Joseph Fourier University/EMBL in Grenoble, France, and completed his EMBO post-doctoral research in Biochemistry at Stockholm University, Sweden. </p><p>“I am thrilled to join Fortis Life Sciences and bring together technology and innovation to best serve our customers and improve healthcare outcomes,” added Mr. Birse. </p><p><strong>Emily Moran – General Manager, Cell &amp; Gene Therapy Solutions </strong></p><p>Emily Moran will oversee the Cell &amp; Gene Therapy Solutions business, including its flagship brand, Vector Biolabs. In her role, Emily will focus on delivering innovative viral R&amp;D solutions and high-quality reagents to support critical advancements in cell and gene therapy.</p><p>Emily most recently served as SVP, Manufacturing and MS&amp;T for Cell, Viral, and Plasmid Manufacturing at SK Pharmteco, formerly the Center for Breakthrough Medicines. Prior to that, Emily served as Head of Viral Vector Manufacturing at Lonza and across multiple operational and quality roles at Sanofi. She has a BS in Biology from Ursinus College and an MBA in Project Management from the New York Institute of Technology. </p><p>Ms. Moran added, “I am truly excited to join Fortis Life Sciences and contribute to delivering exceptional products and services that drive progress and accelerate breakthroughs in cell and gene therapy drug discovery—and beyond.”</p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20250123-fortis-life-sciences-strengthens-executive-team-with-key-appointments-1/",
            "pub_date": "2025-01-27 22:00:36",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UNH Franklin Pierce School of Law Launches Mostly Online Health and Life Sciences Specialization",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>CONCORD, N.H. — </strong></span><p><strong>Concord, NH (January 17, 2025)</strong> – The University of New Hampshire Franklin Pierce School of Law is expanding its focus on specialized legal education with the fall 2025 launch of a new concentration in Health and Life Sciences Law. Adding to the current concentration in Intellectual Property (IP), Technology, and Information Law, <a href=\"https://law.unh.edu/academics/degrees-certificates/hybrid-jd\">Hybrid JD</a> students may pursue the new Health and Life Sciences focus which will highlight the intersection of healthcare, science, IP, and business law. The expanded interdisciplinary and experiential course offerings will help prepare graduates for advanced careers in an expanding global economy.</p><p>The Health and Life Sciences Law curriculum will address the development, distribution, and regulation of biological products and services, including biotech, biologics, and pharmaceuticals. Instructors will train students to become subject-matter experts and strategic thinkers<i> </i>through exploration of the connected pathways of business, IP, healthcare delivery, ethics, and regulatory planning to drive sustainable strategies from ideation to implementation.</p><p>“We have a tradition of innovation at UNH Franklin Pierce and in our health law and policy program. We are excited to expand our concentration in the Hybrid JD to incorporate the critical legal issues facing patients, providers, and businesses in the drug and device industry,” says Professor <a href=\"https://law.unh.edu/person/lucy-hodder\">Lucy Hodder</a>, director of the Health and Life Sciences programs. “Our goal is to teach students to develop pathways to sustainable solutions in our healthcare and life sciences innovation space.”</p><p>The mostly online Hybrid JD at UNH Franklin Pierce is aimed at professionals with experience in IP, technology, healthcare, life sciences, and related fields. The need for lawyers with IP and/or life sciences law experience exists in many industries, such as healthcare and medicine, tech and biopharma, business and entrepreneurship, as well as within government and policy driven organizations.</p><p>“Employers increasingly want to hire law graduates who have domain knowledge so they can hit the ground running. We have led the way in non-residential, specialized legal education for more than five years with our unique focus on IP and tech law,” says UNH Franklin Pierce Dean Megan Carpenter. “Now, we have expanded our focus on specialized legal education to launch the careers of the next leaders in health and life sciences law.”  </p><p>The American Bar Association-approved non-residential JD launched in fall 2019 allows students to remain in their jobs and homes while earning their JD by requiring only 3-5 days of residency each quarter. The curriculum is designed to be year-round, 10 semesters total, lasting 3.5 years. The mostly online JD includes devoted full-time faculty resources, student services, curriculum, academic support, and admissions standards. To learn more, visit <a href=\"https://law.unh.edu/academics/degrees-certificates/hybrid-jd\">https://law.unh.edu/hybridjd</a>. </p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20250121-unh-franklin-pierce-school-of-law-launches-mostly-online-health-and-life-sc/",
            "pub_date": "2025-01-21 23:40:23",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Industry-First Solution Revolutionizes CGT Sterile Processing",
            "description": "<div class=\"content__text\">\n<span class=\"content__text__location\"><strong>ROSEVILLE, Minn. — </strong></span><p>As cell and gene therapies (CGT) rapidly expand, there is a growing need for more efficient sterile processing techniques. <strong>To provide CGT manufacturers with alternatives to using cumbersome biosafety cabinets or tube welding to maintain sterility, </strong><a href=\"https://www.cpcworldwide.com/biopharma?utm_source=Nano-PR&amp;utm_medium=Media&amp;utm_campaign=CPC_CTA\"><strong>CPC</strong></a><strong> </strong><a href=\"https://www.cpcworldwide.com/biopharma?utm_source=Nano-PR&amp;utm_medium=Media&amp;utm_campaign=CPC_CTA\"><strong>(Colder Products Company</strong></a><strong>) introduces the smallest aseptic connector available. </strong></p><p><strong>The innovative </strong><a href=\"https://www.cpcworldwide.com/Biopharma/MicroCNX/MicroCNX\"><strong>MicroCNX® Nano Series</strong></a> connectors help maintain sterility in CGT processes using 1/8- or 1/16-inch tubing and <strong>launches today</strong> at the Advanced Therapies Week meeting in Dallas.</p><p>“Cell therapy and gene therapy are advancing quickly, but the industry has had to rely on older techniques like biosafety cabinets or tube welding for sterile processing,” said Troy Ostreng, senior product manager for CPC’s biopharmaceutical business. <strong>“Now, CGT processing assemblies that include the MicroCNX Nano connector allow users to easily click together the connector halves to create a sterile flow path.</strong> <strong>It is a major advancement for CGT applications.</strong>\"</p><p>CGT manufacturers rely on 1/8-inch and 1/16-inch flow paths to move cells efficiently, with minimal turbulence, and to help reduce holdup volume, so the connection method needs to contribute to these goals. Tube welding requires extra tubing on either side of the weld, which is a source of holdup volume.</p><p>Welding 1/16-inch tubes together also requires time-consuming precision to ensure the tubing’s flow path remains open after clamping and heat application. Any offset of the tubing at the weld point can lead to leakage and/or contamination risk. In contrast, <strong>the Nano Series does not require extra tubing, and the connectors can be quickly joined outside of a biosafety cabinet.</strong></p><p>“Just like single-use technologies have significantly advanced biopharmaceutical processing, we believe <strong>small-format aseptic connectors are the future of CGT sterile processing,</strong>” said Ostreng. “MicroCNX Series products offer a faster, more efficient approach to creating sterile closed systems.”</p><p>The Nano connector’s small size also allows it to <strong>fit directly into the freeze cassettes </strong>used in CGT product cryopreservation. The connectors <strong>can be frozen to -190°C</strong>, which supports cell health during storage and transport. The new product’s termination and flow path are made from polyphenylsulfone (PPSU), a high-performance polymer that is chemically compatible with harsh chemicals used in cryopreservation like dimethyl sulfoxide (DMSO).</p><p>Like earlier MicroCNX products, the MicroCNX Nano Series is compatible with tubing types that are commonly used in developing advanced therapies including silicone, thermoplastic elastomer (TPE), and polyvinyl chloride (PVC).</p><p>For more information about the performance and versatility of the MicroCNX Nano Series connectors or any of the other innovative connection solutions CPC offers, visit booth #215 or <a href=\"https://www.cpcworldwide.com/Biopharma/MicroCNX?utm_source=Nano-PR&amp;utm_medium=Media&amp;utm_campaign=MCNXbrand_CTA\">cpcworldwide.com/MicroCNX</a></p>\n</div>",
            "link": "https://www.biopharmadive.com/press-release/20250117-industry-first-solution-revolutionizes-cgt-sterile-processing-1/",
            "pub_date": "2025-01-21 20:50:24",
            "source": "biopharmadive",
            "kind": 1,
            "language": "en"
        }
    ]
}