{
    "data": [
        {
            "id": "50b4e79a-e1e6-41c8-94a4-a2fd85dc7834",
            "title": "BOJ will only have little room to raise interest rates further - ANZ",
            "description": "<p class=\"text-align-justify\">While a lot of focus on the BOJ is turning to the outcome of the spring wage negotiations in the weeks ahead, ANZ is one to argue that the bigger picture outlook might be one that limits the scope for the central bank to stay on the tightening path. And the firm argues that it won't be from a shake up of the BOJ board nor pressure from the government. Instead, it is the very nature of inflation dynamics in Japan.</p><p class=\"text-align-justify\">ANZ forecasts that inflation pressures in Japan will begin to soften this year and are looking for core prices to ease back down towards the 2% level. As such, that will challenge the BOJ mandate of having to be able to \"sustain\" core inflation at that threshold. The firm notes that:</p><p class=\"text-align-justify\"><em>\"There is much to consider in Japan’s economic outlook. However, in coming months we expect domestic economic conditions will be consistent with gradual disinflation through 2026. Headline Consumer Price Index inflation was 1.5% y/y in January, and we forecast it will average 1.7% this year. We expect core inflation (2.4% y/y) will come down gradually, closer to 2.0%. We are of the view that the BOJ needs to proceed cautiously with respect to further tightening.</em></p><p class=\"text-align-justify\"><em>We forecast only one more 25 bps rate rise this year, as Japan gradually moves away from the zero lower bound, taking the policy rate to 1.00%.\"</em></p><p class=\"text-align-justify\">That's slightly on the conservative side as opposed to market pricing, with traders currently seeing ~46 bps of rate hikes from the BOJ by year-end.</p><p class=\"text-align-justify\">If there is really going to be just one more rate hike left by the BOJ, they might want to get a move on with <a href=\"https://investinglive.com/centralbank/boj-up-against-the-clock-in-delivering-the-next-rate-hike-20260226/\" target=\"_blank\" rel=\"follow\">the opportunity window likely to narrow further</a> once we get past March and even more so after June.</p>",
            "link": "https://investinglive.com/CentralBanks/boj-will-only-have-little-room-to-raise-interest-rates-further-anz-20260227",
            "pub_date": "2026-02-27 19:43:31",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "109ee2c1-f6da-43e7-8b35-047c960ba1cf",
            "title": "USDCAD consolidates around monthly highs as traders await US NFP and USMCA news",
            "description": "<h2 class=\"MsoNormal\">FUNDAMENTAL\nOVERVIEW</h2><p><strong><u>USD:</u></strong></p><p>The US dollar continues to\nbounce around as macro and geopolitical uncertainty is keeping the market\nrangebound. The greenback strengthened yesterday after early reports suggested\nthe third round of US–Iran talks had broken down, with Iran reportedly\nrejecting US demands. Later in the day, however, new headlines indicated that\nthe discussions had actually made significant progress and that another round was\nscheduled for next week. The USD eventually gave back the gains. </p><p>The potential US-Iran\nmilitary escalation and the future Fed’s interest rates path remain the biggest\nrisks for the US dollar. A military escalation will likely boost the greenback\non severe risk-off mood. A hawkish repricing of interest rate expectations on\nstronger US data would also have a positive effect on the USD. Fed’s Waller\nplaced a great deal on next week’s NFP report.</p><p><strong><u>CAD:</u></strong></p><p>On the CAD side, nothing\nhas changed as the BoC remains in neutral mode and traders await new\ndevelopments on the USMCA review front. </p><p>Yesterday, Dominic LeBlanc,\nwho is the Canadian minister responsible for US-Canada trade, said that private\ngovernment to government conversations on USMCA are \"not\ndiscouraging\". Regarding separate bi-lateral deals, he said there have\nalways been bilateral arrangements between the three countries. </p><p>The signals have been\nmixed, but overall, slightly positive. The market is pricing some chances of a\nrate cut by year-end but those remain low. The economic data has been\nsupportive of such stance with the labour market stabilising and core inflation\nhovering a bit above the 2.5% mid-point of the BoC 2-3% target range. </p><h2 class=\"MsoNormal\">USDCAD TECHNICAL\nANALYSIS – DAILY TIMEFRAME</h2><p>On the daily chart, we can\nsee that USDCAD pulled all the way back to the monthly high around the 1.3725\nlevel and stalled as the market got stuck in a consolidation. We can expect the\nsellers to lean on the 1.3725 resistance and the major downward trendline to\nposition for a drop into new lows. The buyers, on the other hand, will look for\na upside breakouts to increase the bullish bets into the 1.3900 handle next.</p><h2 class=\"MsoNormal\">USDCAD TECHNICAL\nANALYSIS – 4 HOUR TIMEFRAME</h2><p>On the 4 hour chart, we can\nsee the recent price action formed a potential head and shoulders pattern near\nthe monthly high with the neckline standing around the 1.3650 level. The buyers\nwill likely continue to step in around the neckline with a defined risk below\nit to keep pushing into new highs, while the sellers will look for a break\nlower to increase the bearish bets into the 1.3500 handle next.</p><h2 class=\"MsoNormal\">USDCAD TECHNICAL\nANALYSIS – 1 HOUR TIMEFRAME</h2><p>On the 1 hour chart, there’s\nnot much we can add here as the buyers will have a better risk to reward setup around\nthe neckline, while the sellers will either wait for a break below the neckline\nor above the resistance. The red lines define the <a href=\"https://investinglive.com/Education/trading-tip-know-the-average-daily-range-adr-20220207/\">average daily range</a> for today. </p><h2>UPCOMING CATALYSTS</h2><p class=\"MsoNormal\"><a href=\"https://investinglive.com/EconomicCalendar\">Today</a> we conclude the week with the Canadian GDP and the US PPI data but\ncontinue to watch out for US-Iran headlines ahead of the weekend.</p>",
            "link": "https://investinglive.com/forex/usdcad-consolidates-around-monthly-highs-as-traders-await-us-nfp-and-usmca-news-20260227",
            "pub_date": "2026-02-27 19:30:22",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "48a885a8-0e14-4cac-9c38-7ee081ff6df1",
            "title": "Oil prices remain supported amid US-Iran uncertainty; traders likely to hedge into weekend",
            "description": "<h2 class=\"MsoNormal\">FUNDAMENTAL\nOVERVIEW</h2><p>Oil prices surged yesterday\nafter early reports suggested the third round of US–Iran talks had broken down,\nwith Iran reportedly rejecting US demands. Later in the day, however, new\nheadlines indicated that the discussions had actually made significant progress\nand that another round was scheduled for next week. The prices pulled back on\nthe news but eventually rebounded as traders hedged into the weekend risk as\nyou never know with Trump. This kind of back-and-forth is keeping the market\nrangebound near the highs with a bullish skew.</p><p class=\"MsoNormal\">If a military conflict were to erupt, oil prices would likely spike\nsharply, particularly due to the risk of disruption in the Strait of Hormuz, a\ncritical chokepoint for global energy supplies. Conversely, a clear sign of US\nmilitary de-escalation or a breakthrough in negotiations between Washington and\nTehran would likely be needed for prices to retreat toward the $60 level. For now, elevated geopolitical tensions are expected to keep the oil market\nwell supported.</p><h2 class=\"MsoNormal\">CRUDE OIL\nTECHNICAL ANALYSIS – DAILY TIMEFRAME</h2><p>On the daily chart, we can\nsee that crude oil continues to consolidate around the highs as US-Iran tensions\npersist. We can expect the sellers to continue to step in around the 66.43\nresistance with a defined risk above it to target a drop back into the 62.36\nsupport. The buyers, on the other hand, will look for a break higher to\nincrease the bullish bets into the 70.50 level next.</p><h2>CRUDE OIL TECHNICAL\nANALYSIS – 4 HOUR TIMEFRAME</h2><p>On the 4 hour chart, we can\nsee the price probed below the mid-range support around the 64.14 level but\neventually rebounded. There’s not much we can add here as the sellers will\ncontinue to step in around the resistance, while the buyers will look for a\nbreakout.</p><h2>CRUDE OIL TECHNICAL\nANALYSIS – 1 HOUR TIMEFRAME</h2><p>On the 1 hour chart, we can\nsee the price broke above the minor downward trendline and pulled back to\nretest it before another push to the upside. The price action remains mostly\nrangebound so there could be many false breaks. From a risk management perspective,\nthe sellers continue to have a better risk to reward setup around the highs, while\nthe buyers around the 62.36 support. The red lines define the <a href=\"https://investinglive.com/Education/trading-tip-know-the-average-daily-range-adr-20220207/\">average daily range</a> for today.</p><h2 class=\"MsoNormal\">UPCOMING CATALYSTS</h2><p class=\"MsoNormal\"><a href=\"https://investinglive.com/EconomicCalendar\">Today</a> we conclude the week with the US PPI report but continue to watch out\nfor US-Iran headlines ahead of the weekend.</p>",
            "link": "https://investinglive.com/commodities/oil-prices-remain-supported-amid-us-iran-uncertainty-traders-likely-to-hedge-into-weekend-20260227",
            "pub_date": "2026-02-27 18:23:17",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "8b102be8-4fb2-4902-ae86-4e37af4af976",
            "title": "Major currencies not up to much as we get into the final stretch of the week",
            "description": "<p class=\"text-align-justify\">The broader market sentiment is one that looks to be more cautious, especially with the sudden hit in Wall Street overnight. In the end, US stocks ended lower but it could've been worse. Tech shares led the declines as the S&amp;P 500 fell by 0.5% and Nasdaq by 1.0%, while the Dow closed flat.</p><p class=\"text-align-justify\">That's keeping traders on edge with major currencies also not up to much today. The changes are light and besides sizing up the overall risk mood as well as geopolitical and trade headlines, there are other individual factors in play for some major currencies.</p><p class=\"text-align-justify\">Here's a look at the changes among dollar pairs so far on the day:</p><p class=\"text-align-justify\">It's really not hinting at much with the broader market focus hinging on a couple of factors as we look to wrap up the week/month.</p><p class=\"text-align-justify\"><strong><u>USD</u></strong><br>- Geopolitical tensions remain a key risk element, with eyes on US-Iran mostly<br>- Traders are also still digesting tariff plans by the US administration, although there is more time to take all of that in<br>- Overall risk mood also remains on edge after tech shares took a knock yesterday, failing to gather courage from Nvidia earnings<br>- Month-end flows also in consideration ahead of the London fix later today</p><p class=\"text-align-justify\"><strong><u>EUR</u></strong><br>- Large option expiries at 1.1800 likely to help lock in EUR/USD until US trading</p><p class=\"text-align-justify\"><strong><u>JPY</u></strong><br>- Intervention risks continue to stay in play as USD/JPY keeps above 155.00 and rebounds above 156.00 on the day</p><p class=\"text-align-justify\"><strong><u>GBP</u></strong><br>- A knock back yesterday saw GBP/USD test the 200-day moving average, so that remains the key level in focus<br>- Political risks come back into the picture after Labour was humiliated in the Gorton and Denton by-election</p><p class=\"text-align-justify\"><strong><u>CHF</u></strong><br>- Geopolitics is the key thing to watch, in case it triggers a more risk-off mood<br>- Likewise, heavier selling in equities and risk trades could also be the trigger to underpin the franc</p><p class=\"text-align-justify\"><strong><u>CAD</u></strong><br>- GDP data in focus but all eyes will stay on the oil market (Middle East tensions) as an indirect influence</p><p class=\"text-align-justify\"><strong><u>AUD &amp; NZD</u></strong><br>- Trading sentiment will ride on the dollar mood but mostly on broader market sentiment as well<br>- As such, geopolitical risks and any risk-off triggers will be the key thing to watch before the weekend; positioning plays included</p>",
            "link": "https://investinglive.com/forex/major-currencies-not-up-to-much-as-we-get-into-the-final-stretch-of-the-week-20260227",
            "pub_date": "2026-02-27 17:30:25",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "79d6896d-a5bb-45d9-a68d-bd056a558e78",
            "title": "Weekend risk could keep a lid on the Nasdaq as US-Iran tensions persist. What's next?",
            "description": "<h2 class=\"MsoNormal\">FUNDAMENTAL\nOVERVIEW</h2><p>The Nasdaq sold off\nyesterday after early reports suggested the third round of US–Iran talks had\nbroken down, with Iran reportedly rejecting US demands. Later in the day,\nhowever, new headlines indicated that the discussions had actually made\nsignificant progress and that another round was scheduled for next week. This\nkind of back-and-forth on the macro and geopolitical front is keeping most\nmarkets rangebound.</p><p>Right now, the main risks\nfor the Nasdaq are a potential US–Iran military escalation and a hawkish\nrepricing of Fed interest rate expectations.</p><p>On the rates side, the\nmarket is still pricing in about 57 bps of easing by year-end. This outlook could\nbe at risk of a hawkish repricing on further improvement in the US labour\nmarket data. In fact, Fed Governor Waller said that he would consider holding\nrates steady if we see another strong NFP report like January’s. That makes\nnext Friday’s data especially important as solid numbers could weigh on\nequities in the short term as traders dial back expectations for rate cuts.</p><p>The bigger risk, though, is\ngeopolitical. If a military conflict between the US and Iran were to break out,\noil prices would likely surge. That would represent a negative shock to the\nglobal economy and raise stagflation concerns. The initial market reaction\nwould almost certainly be a sharp move toward risk aversion, with equities\nselling off hard as growth expectations deteriorate. </p><p>To sum up, there are lots\nof downside risks at the moment with little reasons for a rally into new\nall-time highs. The macro backdrop remains broadly supportive, with easing\ninflation and a resilient labour market, but that picture could shift quickly. Traders\nwill need to stay nimble. </p><h2 class=\"MsoNormal\">NASDAQ TECHNICAL\nANALYSIS – DAILY TIMEFRAME</h2><p>On\nthe daily chart, we can see the\nNasdaq has been trading in a wide range\nsince October of last year. Such long consolidations generally lead to big\ntrending moves once the price breaks out. Until then, the market participants\nwill continue to play the range. </p><h2 class=\"MsoNormal\">NASDAQ TECHNICAL\nANALYSIS – 4 HOUR TIMEFRAME</h2><p>On\nthe 4 hour chart, we got a\nbreakout of the 24,700-25,127 range on Wednesday, but all the gains were eventually\npared back yesterday on the US-Iran tensions. We now have an upward trendline defining\nthe bullish structure on this timeframe. The buyers will likely lean on the\ntrendline with a defined risk below the 24,700 support to keep pushing into new\nhighs, while the sellers will look for a break below the trendline and the\nsupport to increase the bearish bets into the 24,200 level next. </p><h2 class=\"MsoNormal\">NASDAQ TECHNICAL\nANALYSIS – 1 HOUR TIMEFRAME</h2><p>On the 1 hour chart, there’s\nnot much we can add here as the buyers will have a better risk to reward setup\naround the trendline and the 24,700 support, but another break above the 25,127\ncould see the buyers piling in for a move back into the 25,500 level. The\nsellers, on the other hand, will likely step in around the 25,127 level with a\ndefined risk above it to position for a break below the trendline. The red\nlines define the <a href=\"https://investinglive.com/Education/trading-tip-know-the-average-daily-range-adr-20220207/\">average daily range</a> for today. </p><h2>UPCOMING CATALYSTS</h2><p class=\"MsoNormal\"><a href=\"https://investinglive.com/EconomicCalendar\">Today</a> we conclude the week with the US PPI report but continue to watch\nout for US-Iran headlines.</p>",
            "link": "https://investinglive.com/stocks/weekend-risk-could-keep-a-lid-on-the-nasdaq-as-us-iran-tensions-persist-whats-next-20260227",
            "pub_date": "2026-02-27 17:15:20",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "8eca699a-5daa-41d4-84da-4978601c6e28",
            "title": "XBTFX Unveils xPRO — Created for Traders, Engineered for the Trading Future",
            "description": "<h2>No Longer Market Complexity, But Solutions</h2><p><a href=\"https://xbtfx.com/page/xpro-platform-trading\">xPRO</a> employs modern design philosophies and trading features that make the overall experience feel extremely powerful and intuitive. Instead of layering on more complex features, the system is designed with clarity and ease of use in mind – reimagining what a trading platform can do.</p><h3>Modern Front-End Design</h3><p>Designed on the latest trends in user experience for 2025, xPRO provides a clean, responsive interface and an easy-to-navigate, clutter-free design.</p><h3>TradingView Charts</h3><p>Integrated TradingView Charts allow traders to use highly advanced technical analysis tools. Such functionality includes the use of custom indicators and improved graph clarity.</p><h3>Multi-Asset &amp; Multi-Market Access</h3><p>XPRO allows hassle-free trading in forex, stocks, commodities, and cryptocurrency CFDs, with real-time market feeds and comprehensive charting.</p><h3>Cross-Margin Flex</h3><p>By engaging in cross-margin transactions, it is possible to optimize the allocation of funds across positions and asset classes.</p><h3>Perpetual Swap Support</h3><p>These perpetual contracts, with no expiry dates, offer greater flexibility for traders in implementing their cryptocurrency and derivatives market strategies.</p><h2>One Ecosystem, Multiple Trading Styles</h2><p>Every trading xPRO adds a new pillar to the existing MetaTrader 5 and cTrader environments in the XBTFX network. Each tool is designed with a specific trading tactic in mind – from creating automated trading strategies to day trading — and they all share the common benefits of straight-through processing, high liquidity, and transparent terms.</p><p>In addition, XBTFX provides:</p><p>Multiple solutions for funding, involving cryptocurrencies and transactions in different blockchains</p><ul><li><p><a href=\"https://xbtfx.com/page/crypto-forex-trading-platforms-copytrading\">Copy trading solutions</a> for passive income methods</p></li><li><p>Islamic ECN accounts for Sharia law-compliant trading</p></li><li><p>Demo Accounts for Risk-Free Practice</p></li><li><p>Institutional-level liquidity that assures stable and fair execution</p></li></ul><h2>Pursuing the XBTFX Vision</h2><p>Right from the start, the primary goal of XBTFX has been to connect the conventional financial world with the digital assets market. The agility of the XBTFX brand in response to market variability has emerged as one of its core strengths.</p><p>The launch of xPRO is a giant leap forward in that journey – one that not only cements XBTFX’s commitment to innovation but also its pledge to be grounded in transparency and reliability.</p><p>xPRO has been rolled out progressively since October of last year, or rather, October of the year 2025, to eligible clients of XBTFX.</p><h2>About XBTFX</h2><p><a href=\"https://xbtfx.com/\" target=\"_blank\" rel=\"follow\">XBTFX</a> is a licensed STP brokerage that provides trading on global financial markets across a range of instruments, including forex, cryptocurrencies, stocks, commodities, and CFDs. It uses MetaTrader 5, cTrader, and xPRO trading platforms to support retail and institutional traders.</p><p>The Financial Services Authority supervises it, and it has high levels of compliance and strong protections for traders, which XBTFX maintains are highly regarded among its international traders.</p><p>For more info, visit: <a href=\"https://xbtfx.com\" target=\"_blank\" rel=\"nofollow\">XBTFX.com</a></p>",
            "link": "https://investinglive.com/Education/xbtfx-unveils-xpro-created-for-traders-engineered-for-the-trading-future-20260224",
            "pub_date": "2026-02-24 21:11:25",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "b7053a3e-4ae4-4d56-9caa-cd55b5c8dca4",
            "title": "Bavaria February CPI +1.9% vs +2.1% y/y prior",
            "description": "<p class=\"text-align-justify\">The other readings released around the same time (updated on the go):</p><ul><li>North Rhine Westphalia CPI +1.8% vs +2.0% y/y prior</li><li>Saxony CPI +% vs +2.3% y/y prior</li><li>Baden-Wuerttemberg CPI +% vs +2.1% y/y prior</li></ul>",
            "link": "https://investinglive.com/news/bavaria-february-cpi-19-vs-21-yy-prior-20260227",
            "pub_date": "2026-02-27 17:00:12",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "f140ac9d-375b-44cd-a33f-c466f4547cee",
            "title": "Gold remains supported amid US-Iran uncertainty, but downside risks linger with NFP next",
            "description": "<h2 class=\"MsoNormal\">FUNDAMENTAL\nOVERVIEW</h2><p>Gold got stuck in another\nconsolidation as the bullish momentum remains weak amid conflicting signals. Yesterday,\nit looked like the third round of US-Iran talks went bad as we got reports of\nIran rejecting US demands. The markets went into risk-off, eventually\nsupporting gold prices. </p><p>Later on, we got reports\nthat the <a href=\"https://www.reuters.com/world/middle-east/us-iran-nuclear-talks-resume-geneva-against-backdrop-military-threat-2026-02-26/\">talks\nmade significant progress</a> and another round was scheduled for next week. This\npush and pull is keeping most market rangebound, including gold. </p><p>Overall, the market might\nremain supported in the short-term amid some uncertainty, but I don’t see\nmaterial changes to justify a rally back to all-time highs, at the moment. The\nreal risks remain a potential US-Iran military escalation which could take gold\nprices to new highs or a hawkish repricing on stronger US data which would have\na negative effect on the market. </p><p>Fed’s Waller mentioned that\nhe would change his dovish stance in case the strong January’s jobs data is\nrepeated in February, so next week’s NFP report is going to be a key risk event\nfor gold. </p><h2 class=\"MsoNormal\">GOLD TECHNICAL\nANALYSIS – DAILY TIMEFRAME</h2><p>On the daily chart, we can\nsee that gold is creeping higher, but the momentum remains weak with many\nconsolidations along the way. There’s not much we can glean from this timeframe,\nso we need to zoom in to see some more details.</p><h2>GOLD TECHNICAL ANALYSIS – 4\nHOUR TIMEFRAME</h2><p>On the 4 hour chart, we can\nsee the price is consolidating above the key 5100 zone as traders await new\ncatalysts to pick a direction. From a risk management perspective, the buyers\nwill have better risk to reward opportunities around the 5100 support and the\nminor upward trendline to position for a rally into new all-time highs. The\nsellers, on the other hand, will want to see the price breaking below the\ntrendline to open the door for a drop back into the 4600 level next.</p><h2>GOLD TECHNICAL ANALYSIS – 1\nHOUR TIMEFRAME</h2><p>On the 1 hour chart, there’s\nnot much we can add here as the buyers will likely continue to step in around the\nsupport and the trendline, while the sellers will wait for the break of the\ntrendline to gain more conviction for new lows. The red lines define the <a href=\"https://investinglive.com/Education/trading-tip-know-the-average-daily-range-adr-20220207/\">average daily range</a> for today. </p><h2 class=\"MsoNormal\">UPCOMING CATALYSTS</h2><p class=\"MsoNormal\"><a href=\"https://investinglive.com/EconomicCalendar\">Today</a> we conclude the week with the US PPI report but continue to watch\nout for US-Iran headlines.</p><iframe data-media-id=\"bc8fd379-02aa-4a29-b526-d26c7ef34105\" src=\"https://www.youtube.com/embed/et7S62SXWDc\" allowfullscreen=\"\" width=\"560\" height=\"315\"></iframe>",
            "link": "https://investinglive.com/commodities/gold-remains-supported-amid-us-iran-uncertainty-but-downside-risks-linger-with-nfp-next-20260227",
            "pub_date": "2026-02-27 16:28:09",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "c556aad7-6d1a-4806-9e06-bb24a4d50209",
            "title": "Spain February preliminary CPI +2.3% vs +2.2% y/y expected",
            "description": "<ul><li>Prior +2.3%</li><li>HICP +2.5% vs +2.3% y/y expected</li><li>Prior +2.4%</li></ul><p class=\"text-align-justify\">The main thing to watch is core annual inflation and that is seen at 2.7%, a step up from the 2.6% reading in January. The trend for core prices is looking rather dicey for Spain as it is moving upwards since the middle of last year (graph below). And besides Germany, this remains another spot in which price pressures are keeping the ECB on their toes for now.</p><p class=\"text-align-justify\">The data here won't be one to compel the ECB to move away from the sidelines any time soon. Now, let's watch for German state readings to see what that has to offer later in the day. EUR/USD is up 0.2% to 1.1818 currently, with the dollar slightly softer to start the session.</p>",
            "link": "https://investinglive.com/news/spain-february-preliminary-cpi-23-vs-22-yy-expected-20260227",
            "pub_date": "2026-02-27 16:00:48",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "724982a8-70c7-4f5f-942b-190d11af6ea5",
            "title": "Switzerland Q4 GDP +0.1% vs +0.2% q/q expected",
            "description": "<ul><li>Prior -0.5%; revised to -0.4%</li></ul><p>More to come..</p>",
            "link": "https://investinglive.com/news/switzerland-q4-gdp-01-vs-02-qq-expected-20260227",
            "pub_date": "2026-02-27 16:01:29",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "0235d4ca-d02b-43fe-8d76-28915cf05697",
            "title": "XM Secures CMA License, Strengthening Its Regulatory Footprint in Kenya",
            "description": "<p>Globally renowned broker <a href=\"https://www.xm.ke/\">XM</a>, with over 15 million clients worldwide, has officially obtained a license from the Capital Markets Authority (CMA) of Kenya. This achievement marks a significant milestone in XM’s strategic expansion across Africa and reinforces its commitment to providing a secure and regulated trading environment for local investors. </p><p>The granting of the CMA license reflects XM’s dedication to operating under the highest regulatory standards. By aligning with Kenya’s robust financial framework, XM aims to build long-term trust and offer Kenyan traders a transparent, client-first experience backed by local oversight. </p><p><em><strong>“Kenya represents a dynamic and rapidly growing financial market, and receiving authorization from the CMA is a testament to our commitment to regulatory excellence and market leadership,” </strong></em>said Menelaos Menelaou, co-Chief Executive Officer of XM. <em><strong>“We are proud to enhance our presence in Kenya, providing local traders with direct access to our world-class ecosystem of products and award-winning services under a robust, locally recognized regulatory framework.”</strong></em></p><p>The new license allows XM to deepen its presence in the region, offering traders in Kenya direct access to its established global ecosystem of over 1,400 products, comprehensive educational resources, and world-class support. The authorization ensures that all operations within the country adhere to the strict compliance and investor protection standards set by the Authority. </p><p>Through its dedicated website, <a href=\"https://www.xm.ke\" rel=\"nofollow\">www.xm.ke</a>, Kenyan clients can now enjoy a seamless onboarding process and benefit from superior trading conditions, including fast execution, stable leverage, year-round bonuses, and a wide array of products and trading tools designed to help them trade with confidence. </p><p>Traders of all levels are welcome to join XM and open an account in minutes. </p><p>#CMAKenyaLicenseXM</p><h3>About XM </h3><p>XM is an internationally established trading and investment firm, with over 15 million clients, from over 190 countries. Armed with multiple international licenses, XM offers competitive services for retail traders, investors, and affiliates.   </p><p>With over 15 years of serving clients, XM has proven to be fair, trustworthy, and dependable. Traders can access over 1,400 instruments across all devices. The award-winning broker is known for its wide range of products, excellent support, and outstanding education.  </p><p><strong>Risk Warning:</strong> Online Forex/CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. Retail investor accounts lose money when trading Derivatives with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money. Please consider XM’s Risk Disclosure. </p><p><strong>Disclaimer</strong><strong>:</strong> Promotions and bonuses are not available for accounts registered under XM's EU-based entity. Specific regions may be excluded. The XM Group operates globally under various entities, so products, services, and features listed here vary between XM entities.  For further information, please visit the XM website.</p>",
            "link": "https://investinglive.com/Education/xm-secures-cma-license-strengthening-its-regulatory-footprint-in-kenya-20260224",
            "pub_date": "2026-02-24 20:11:11",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "9c318ce0-939a-4ed8-82d4-8a2370c058a2",
            "title": "France Q4 final GDP +0.2% vs +0.2% q/q prelim",
            "description": "<ul><li>Prior +0.5%</li></ul><p>More to come..</p>",
            "link": "https://investinglive.com/news/france-q4-final-gdp-02-vs-02-qq-prelim-20260227",
            "pub_date": "2026-02-27 15:45:08",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "c51fa4aa-c20a-40cf-8ef2-a607c5584ed6",
            "title": "France February preliminary CPI +1.0% vs +0.8% y/y expected",
            "description": "<ul><li>Prior +0.3%</li><li>HICP +1.1% vs +0.7% y/y expected</li><li>Prior +0.4%</li></ul><p>More to come..</p>",
            "link": "https://investinglive.com/news/france-february-preliminary-cpi-10-vs-08-yy-expected-20260227",
            "pub_date": "2026-02-27 15:45:25",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "0354ac82-b46b-4571-834e-318863553f07",
            "title": "Sterling set to be haunted by the political ghost",
            "description": "<p class=\"text-align-justify\">UK political developments are looking set to return into the picture, especially with the latest happening in Manchester. The Gorton and Denton by-election saw a rather seismic result, with Labour losing a seat that they have held for nearly a century.</p><p class=\"text-align-justify\">For some context, the by-election was triggered after MP Andrew Gwynne resigned due to \"significant ill health\". He was sitting as an independent after having been suspended by the Labour party.</p><p class=\"text-align-justify\">Starmer has already seen his support and popularity dwindle immensely and he grew even more unpopular in blocking Andy Burnham from running as the Labour candidate for the by-election. This was because Burnham looks to be deemed as a threat to Starmer, in trying to use this bid as a passage back to Westminster. Oof.</p><p class=\"text-align-justify\">In any case, the results were rather damning:</p><ul><li>Green (Hannah Spencer) - 40.6% (<strong>+27.4% swing</strong>)</li><li>Reform (Matt Goodwin) - 28.7% (<strong>+14.6% swing</strong>)</li><li>Labour (Angeliki Stogia) - 25.4% (<strong>-25.4% swing</strong>)</li></ul><p class=\"text-align-justify\">Yes, Labour didn't even finish second in a seat that they claimed a majority less than two years ago. It's pretty much a collapse and this is akin to a referendum on Starmer's leadership basically. Is this the tipping point for Starmer? Time will tell but it potentially could be.</p><p class=\"text-align-justify\">As political instability and a more messy political scene domestically starts to come back into the picture, the pound might find itself in a bit of trouble up ahead. That especially as UK economic conditions have been flagging at best in recent months.</p><p class=\"text-align-justify\">Now, Starmer isn't going to resign and put things in chaos. However, a leadership transition looks to be in order at some point. So, it's best to be prepared for that.</p><p class=\"text-align-justify\">Since hitting highs of around 1.3850 in late January, GBP/USD has struggled to keep afloat and is down 1.5% in February. That effectively also erases the gains seen in January more or less.</p><p class=\"text-align-justify\">And from the charts, we are moving towards a critical juncture with the pair now inching closer again towards a test of its 200-day moving average (blue line). Hold above that and the bias keeps more bullish for the pair. But break below that, and the bias shifts to being more neutral with eyes on key support at the 100-day moving average (red line) next.</p><p class=\"text-align-justify\">Looking ahead, there's two ways to look at this. A leadership transition and political instability might see the BOE want to maintain order and keep monetary policy steady. That so as not to shake things up all too much.</p><p class=\"text-align-justify\">However, just be reminded that their mandate remains more focused on inflation and the economy. If the latter continues to struggle further this year with price pressures not exactly worsening and showing mild signs of easing (still not as much as hoped though), that might be enough to trigger the BOE to act regardless.</p><p class=\"text-align-justify\">That especially since a messier political scene will weigh on business and overseas investments to the UK. Hence, that will also weigh on economic output as things trickle down.</p><p class=\"text-align-justify\">At the balance, I'd wager the more chaotic political scene would be a net negative for the pound in the short-term. So, that will be a key factor to consider for the currency outlook as we get into the weeks/months ahead.</p>",
            "link": "https://investinglive.com/forex/sterling-set-to-be-haunted-by-the-political-ghost-20260227",
            "pub_date": "2026-02-27 15:36:48",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "54b660e9-9701-4f57-8e4b-1aa601589337",
            "title": "What are the main events for today?",
            "description": "<h2>EUROPEAN SESSION</h2><p>In the European session, the main highlight is going to be the German inflation data both the state readings and the national CPI. We will also get the French and Spanish inflation figures, but the German data is generally more market-moving because it carries more weight in the Eurozone CPI calculations. The German CPI Y/Y is expected at 2.0% vs 2.1% prior.</p><p>We also have the French and Swiss Q4 GDP reports, but these will be the final readings, so they won't be market-moving and won't change anything for the respective central banks. </p><h2>AMERICAN SESSION</h2><p>In the American session, the focus will turn to the Canadian GDP and the US PPI. The Canadian GDP for December is expected at 0.1% vs 0.0% prior. The data is very unlikely to change anything for the BoC at this point as the central bank wait for more recent data and especially the USMCA developments. </p><p>The US PPI Y/Y is expected at 2.6% vs 3.0% prior, while the Core PPI Y/Y is seen at 3.0% vs 3.3% prior. Several of PPI specific sub-components feed into PCE calculations, so we will get more precise PCE forecasts after the data. Right now, analysts see the Core PCE in January to have risen around 0.3% due to stubborn service-sector costs.</p><h2>CENTRAL BANK SPEAKERS</h2><ul><li>13:00 GMT/08:00 ET - BoE's Pill (hawkish - voter)</li></ul>",
            "link": "https://investinglive.com/news/what-are-the-main-events-for-today-20260227",
            "pub_date": "2026-02-27 15:34:35",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "90c86f14-d6bc-4aec-85a4-e283ddd9352b",
            "title": "Germany January import price index +1.1% vs -0.1% m/m prior",
            "description": "<p>More to come..</p>",
            "link": "https://investinglive.com/news/germany-january-import-price-index-11-vs-01-mm-prior-20260227",
            "pub_date": "2026-02-27 15:00:29",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "159f76d5-2aec-407b-8b96-0a2584926ebb",
            "title": "FX option expiries for 27 February 10am New York cut",
            "description": "<p class=\"text-align-justify\">There is just one to take note of on the day, as highlighted in <strong>bold </strong>below.</p><p class=\"text-align-justify\">That being for EUR/USD at the 1.1800 level. The expiries keep nearby the confluence of the key hourly moving averages, seen at 1.1795-00 currently. As such, that might at least help to keep price action more locked in around the figure level in European morning trade. That at least until we get to US trading and the expiries roll off.</p><p class=\"text-align-justify\">The only real risk in the session ahead would be from euro area CPI data, in which we will see the likes of France, Spain, and Germany all reporting. So barring any surprise headlines on geopolitics and trade, that will be the only focus. If there aren't any major outliers in the data, price action might well remain more muted in sticking to the expiries level above.</p><p class=\"text-align-justify\">Besides that, just keep in mind that month-end flows are also in consideration. But personally, I'd eye any moves closer to the London fix to be more certain of the impact of that towards price action on the day. Just something to be watchful about.</p><p class=\"text-align-justify\">For more information on how to use this data, you may refer to this post <a href=\"https://investinglive.com/Education/!/forexlive-education-option-contracts-their-impact-and-how-to-trade-off-them-20161116/\" target=\"_blank\" rel=\"nofollow\" class=\"article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link\">here</a>.</p><p class=\"text-align-justify\"><em>Head on over to <a href=\"https://www.investinglive.com/\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link article-link\">investingLive</a> (formerly ForexLive) to get in on the know!</em></p>",
            "link": "https://investinglive.com/Orders/fx-option-expiries-for-27-february-10am-new-york-cut-20260227",
            "pub_date": "2026-02-27 14:41:04",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "5da16fdf-f69b-484c-b78d-674ffbb0c134",
            "title": "China's Politburo: Development process of latest 'five-year plan' is \"extremely unusual\"",
            "description": "<ul><li class=\"text-align-justify\">Development process during the 14th 'five-year plan' period is \"extremely unusual and extraordinary\"</li><li class=\"text-align-justify\">China's economic strength and comprehensive national strength has jumped to a whole new level</li><li class=\"text-align-justify\">To make greater efforts to protect and improve people's livelihood</li><li class=\"text-align-justify\"><strong>To continue to expand domestic demand, optimise supply conditions</strong></li><li class=\"text-align-justify\"><strong>Will implement more active and promising macro policies</strong></li><li class=\"text-align-justify\">And also enhance forward-looking and targeted coordination of policies</li><li class=\"text-align-justify\">To adhere to the tone of seeking progress while maintaining stability</li><li class=\"text-align-justify\">And also coordinate the overall situation domestically and abroad</li><li class=\"text-align-justify\">To focus on stabilising employment, enterprises, markets, and expectations</li><li class=\"text-align-justify\"><strong>Necessary to continue to implement a more active fiscal policy, moderately loose monetary policy</strong></li><li class=\"text-align-justify\"><strong>To strengthen the coordination between reform measures and macro policies</strong></li><li class=\"text-align-justify\">To strengthen construction of the government itself, firmly establish and practice the correct view of political performance</li></ul><p class=\"text-align-justify\">The headlines in <strong>bold </strong>are what I would deem as notable but the overall message is one that we've seen repeated for quite a while now. The biggest challenge for China since the property market crash has been trying to revive domestic demand conditions. And until today, that remains one of the government's biggest hurdles in trying to get the local economy to prosper again.</p><p class=\"text-align-justify\">The outline of needing to pursue more proactive fiscal policy and \"moderately loose\" monetary policy reaffirms the overall dual policy direction that Beijing has been sticking to in recent years. So, there's no changes there as we look to 2026.</p><p class=\"text-align-justify\">Besides that, China is also making it clear that they also focused on market developments - especially when it comes to the yuan currency and the dollar. We've already seen a glimpse of that earlier in the day <a href=\"https://investinglive.com/centralbank/pboc-cuts-fx-risk-reserve-ratio-to-0-slowing-yuan-appreciation-20260227/\" target=\"_blank\" rel=\"follow\">here</a> but they might have to do more if the greenback continues to weaken this year.</p><p class=\"text-align-justify\">As a reminder, a weaker Chinese yuan was <a href=\"https://investinglive.com/news/is-this-beijings-first-line-of-defense-against-trump-20241203/\" target=\"_blank\" rel=\"follow\">China's first line of buffer</a> against Trump and his tariffs. As such, an even weaker dollar pretty much neutralises the playing field. A struggling dollar in that respect maximises the pain from tariffs and hurts competition from other countries more.</p>",
            "link": "https://investinglive.com/news/chinas-politburo-development-process-of-latest-five-year-plan-is-extremely-unusual-20260227",
            "pub_date": "2026-02-27 13:48:10",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "fe5800f9-caa5-47ef-9a59-d6b8fb0ed4cd",
            "title": "Heads up: Germany states' CPI readings due later today",
            "description": "<p class=\"text-align-justify\">German inflation remains one of, if not the key sticking point for the ECB in trying to sort out monetary policy setting. Price pressures in Europe's largest economy hasn't dropped off enough to allow for the central bank to take more steps in lowering interest rates further. And late last year, there were still stagflation concerns for the most part.</p><p class=\"text-align-justify\">On that final point, a lot of the fears have been allayed in the past two months at least. The German economy has held up well with a notable recovery in the manufacturing sector especially. Adding to that, we are seeing price pressures ease back slightly as well. That being said, German core annual inflation continues to keep well above the 2% threshold.</p><p class=\"text-align-justify\">The January reading saw core prices stick at 2.5%, with services inflation once again staying rather stubborn. Service prices were seen up 3.2% compared to the same month a year ago, rising at an above-average rate still. As such, that's keeping policymakers on their toes and alongside a somewhat similar picture in Spain is putting the central bank on the sidelines currently.</p><p class=\"text-align-justify\">Looking to the February estimates, German headline inflation is expected to keep thereabouts again as in January. Headline annual inflation is estimated at 2.0%, marginally lower from the 2.1% reading last month. The EU-harmonised estimate is expected to be the same at 2.1%.</p><p class=\"text-align-justify\">But again, all eyes will be on the core annual inflation estimate. And that will be the one that will matter most when viewing the report today.</p><p class=\"text-align-justify\">Besides that, just be wary of the monthly figures with it expected to show another increase of 0.5% in January. If realised, that will mark the biggest monthly jump in headline prices since April 2024.</p><p class=\"text-align-justify\">Here's the agenda for today:</p><ul class=\"text-align-start vertical-align-baseline\"><li class=\"vertical-align-baseline\"><strong class=\"vertical-align-baseline\">0900 GMT - North Rhine Westphalia</strong></li><li class=\"vertical-align-baseline\"><strong class=\"vertical-align-baseline\">0900 GMT - Hesse</strong></li><li class=\"vertical-align-baseline\"><strong class=\"vertical-align-baseline\">0900 GMT - Bavaria</strong></li><li class=\"vertical-align-baseline\"><strong class=\"vertical-align-baseline\">0900 GMT - Baden Wuerttemberg</strong></li><li class=\"vertical-align-baseline\"><strong class=\"vertical-align-baseline\">0900 GMT - Saxony</strong></li><li class=\"vertical-align-baseline\"><strong class=\"vertical-align-baseline\">1300 GMT - Germany national preliminary figures</strong></li></ul><p class=\"vertical-align-baseline text-align-justify\">Do note that the releases don't exactly follow the schedule at times and may be released a little earlier or later.</p>",
            "link": "https://investinglive.com/news/heads-up-germany-states-cpi-readings-due-later-today-20260227",
            "pub_date": "2026-02-27 13:29:33",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "34953da5-6d5b-4dfe-8442-e8ab4ecbb996",
            "title": "investingLive Asia-Pacific FX news wrap: PBoC cools yuan gains",
            "description": "<ul><li><a href=\"https://investinglive.com/centralbank/japans-katayama-flags-fx-urgency-as-takaichi-fiscal-push-keeps-yen-pressured-20260227/\">Japan’s Katayama flags FX “urgency” as Takaichi fiscal push keeps yen pressured</a></li><li><a href=\"https://investinglive.com/centralbank/usdcny-rebounds-as-pboc-scraps-fx-risk-reserve-ratio-to-cool-yuan-rally-recap-20260227/\">USD/CNY rebounds as PBOC scraps FX risk reserve ratio to cool yuan rally - recap</a></li><li><a href=\"https://investinglive.com/centralbank/japan-capital-cpi-slips-under-boj-target-in-policy-test-20260227/\">Japan capital CPI slips under BOJ target in policy test</a></li><li><a href=\"https://investinglive.com/centralbank/usdcny-usdcnh-jump-as-pboc-cuts-fx-rrr-to-zero-cooling-yuan-gains-20260227/\">USD/CNY &amp; USD/CNH jump as PBoC cuts FX RRR to zero, cooling yuan gains</a></li><li><a href=\"https://investinglive.com/centralbank/pboc-sets-usd-cny-reference-rate-for-today-at-69228-vs-estimate-at-68428-20260227/\">PBOC sets USD/ CNY reference rate for today at 6.9228 (vs. estimate at 6.8428)</a></li><li><a href=\"https://investinglive.com/centralbank/pboc-cuts-fx-risk-reserve-ratio-to-0-slowing-yuan-appreciation-20260227/\">PBOC cuts FX risk reserve ratio to 0%, slowing yuan appreciation</a></li><li><a href=\"https://investinglive.com/news/uk-consumer-confidence-falls-to-three-month-low-and-car-production-drops-8-20260227/\">UK consumer confidence falls to three-month low and car production drops 8%</a></li><li><a href=\"https://investinglive.com/news/more-japan-data-january-retail-sales-beat-and-industrial-production-miss-20260226/\">More Japan data: January retail sales beat and industrial production miss</a></li><li><a href=\"https://investinglive.com/centralbank/japan-inflation-ebbing-tokyo-area-core-cpi-slows-below-2-first-time-since-october-2024-20260226/\">Japan inflation ebbing. Tokyo area core CPI slows below 2%, first time since October 2024</a></li><li><a href=\"https://investinglive.com/stocks/netflix-shares-just-jumped-circa-13-just-scored-a-free-us28bn-payout-20260226/\">Netflix shares just jumped circa 13%, just scored a free US$2.8bn payout</a></li><li><a href=\"https://investinglive.com/news/block-shares-jump-25-after-ai-driven-layoffs-job-loss-floodgates-to-open-wide-20260226/\">Block shares jump ~25% after AI-driven layoffs; Job loss floodgates to open wide</a></li><li><a href=\"https://investinglive.com/stocks/nvidia-gets-fresh-wall-street-backing-jpmorgan-lifts-target-to-265-ubs-flags-ai-upside-20260226/\">NVIDIA gets fresh Wall Street backing. JPMorgan lifts target to 265, UBS flags AI upside</a></li><li><a href=\"https://investinglive.com/news/investinglive-americas-market-news-wrap-nvidia-shares-sink-after-earnings-20260226/\">investingLive Americas market news wrap: Nvidia shares sink after earnings</a></li><li><a href=\"https://investinglive.com/stock-market-update/us-stocks-indices-snap-2-day-up-streak-nvidiachip-stocks-tumble-20260226/\">US stocks indices snap 2-day up streak. Nvidia/chip stocks tumble</a></li><li><a href=\"https://investinglive.com/stocks/jack-dorseys-block-cutting-4000-employees-reducing-workforce-by-nearly-50-shares-jump-20260226/\">Jack Dorsey’s Block cutting 4,000 employees, reducing workforce by nearly 50%. Shares jump</a></li></ul><p>At a glance:</p><ul><li data-start=\"146\" data-end=\"213\"><p data-start=\"148\" data-end=\"213\">Tokyo core CPI slipped below 2%, but core-core inflation firmed</p></li><li data-start=\"214\" data-end=\"268\"><p data-start=\"216\" data-end=\"268\">Yen traded in subdued ranges despite inflation dip</p></li><li data-start=\"269\" data-end=\"343\"><p data-start=\"271\" data-end=\"343\">PBOC cut FX risk reserve ratio to 0%, trimming RMB support; yuan eased</p></li><li data-start=\"344\" data-end=\"414\"><p data-start=\"346\" data-end=\"414\">Block shares surged ~25% after announcing AI-driven workforce cuts</p></li><li data-start=\"415\" data-end=\"465\"><p data-start=\"417\" data-end=\"465\">Netflix walked from Warner bid; shares rallied</p></li><li data-start=\"466\" data-end=\"534\"><p data-start=\"468\" data-end=\"534\">Pakistan–Afghanistan tensions escalated with airstrikes on Kabul</p></li></ul><p data-start=\"550\" data-end=\"955\">Inflation in Japan’s capital moderated in February, with core prices slipping below the Bank of Japan’s 2% target for the first time in 16 months, though underlying momentum remained firm. The core-core measure, which strips out fresh food and energy, continued to track above 2%, broadly consistent with the BOJ’s guidance that inflation would temporarily slow before reaccelerating on steady wage gains.</p><p data-start=\"957\" data-end=\"1186\">The yen traded in a subdued range session, mirroring broader calm across major FX pairs. </p><p data-start=\"1188\" data-end=\"1637\">The Chinese yuan, however, was more active. The People’s Bank of China cut the FX risk reserve ratio to 0%, reversing a tool previously used to support the currency. Raising the ratio makes it more expensive to short the RMB via forwards, while today’s move removes some of that support at the margin. By lowering hedging costs, the decision may encourage greater forward activity and modestly trim appreciation pressure, prompting the yuan to ease. In another move the Bank set the refernce rate more than 800 points away from the modelled estimate, a record wide gap. </p><p data-start=\"1188\" data-end=\"1637\">In corporate news, Block announced it will cut more than 4,000 roles, reducing headcount from over 10,000 to just under 6,000. Management framed the move as a deliberate shift toward smaller, AI-enabled teams. Investors welcomed the restructuring alongside earnings, sending shares roughly 25% higher after hours.</p><p data-start=\"1954\" data-end=\"2171\">Meanwhile, Netflix said it would not raise its offer for Warner Bros. Discovery’s studio and streaming assets, effectively clearing the way for Paramount Skydance’s revised bid. Netflix shares rallied on the decision.</p><p data-start=\"2173\" data-end=\"2464\">Geopolitical tensions intensified. Pakistani airstrikes reportedly hit Kabul hours after Afghanistan-linked attacks on Pakistan, with Islamabad’s defence minister declaring the two neighbours at “open war,” adding another fault line to an already fragile global backdrop. </p><p data-start=\"2173\" data-end=\"2464\">In UK politcs the Greens won a by-election, the result is being described in media as a blow to PM Starmer. Indeed, the governong party candidate came in third place. </p>",
            "link": "https://investinglive.com/news/investinglive-asia-pacific-fx-news-wrap-pboc-cools-yuan-gains-20260227",
            "pub_date": "2026-02-27 12:31:38",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        }
    ]
}