{
    "data": [
        {
            "id": "fb7a377a-88fe-4fd3-82d9-163675bbd1cc",
            "title": "Trump: Not happy with Iran but more talks expected on Friday",
            "description": "<p>US Pres. Trump is speaking on Iran and says:</p><ul><li>Not happy with Iran, but were talks expected Friday.</li><li>Has not made a decision on Iran and not happy with how they negotiate.</li><li>Iran cannot have nuclear weapon.</li><li>There may or may not be a regime change in Iran.</li><li>Wants to make a deal with Iran.</li><li>Asked about using military force in Iran, \"don't want to but sometimes you have to</li><li>Iran isn't saying the golden words \"No nuclear weapon\"</li></ul>",
            "link": "https://investinglive.com/news/trump-not-happy-with-iran-but-more-talks-expected-on-friday-20260227",
            "pub_date": "2026-02-28 01:43:34",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "9d08a5bd-caec-4679-b313-7a3bcd3a573d",
            "title": "Atlanta Fed GDPNow growth estimate for Q1 3.0% versus 3.1% last",
            "description": "<p>The Atlanta Fed GDPNow growth estimate for Q1 dipped to 3.0% from 3.1% last. In their own words</p><blockquote>The GDPNow model estimate for real GDP growth (seasonally adjusted annual rate) in the first quarter of 2026 is <strong>3.0 percent</strong> on February 27, down from 3.1 percent on February 24. After this morning’s releases from the US Census Bureau and the US Bureau of Labor Statistics, the nowcasts of first-quarter real gross private domestic investment growth and real government expenditures growth decreased from 8.5 percent and 1.6 percent, respectively, to 7.9 percent and 1.5 percent.</blockquote><p>The next GDPNow update is <strong>Monday, March 2</strong>. Please see the \"Release Dates\" tab below for a list of upcoming releases.</p>",
            "link": "https://investinglive.com/news/atlanta-fed-gdpnow-growth-estimate-for-q1-30-versus-31-last-20260227",
            "pub_date": "2026-02-28 01:38:45",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "8eca699a-5daa-41d4-84da-4978601c6e28",
            "title": "XBTFX Unveils xPRO — Created for Traders, Engineered for the Trading Future",
            "description": "<h2>No Longer Market Complexity, But Solutions</h2><p><a href=\"https://xbtfx.com/page/xpro-platform-trading\">xPRO</a> employs modern design philosophies and trading features that make the overall experience feel extremely powerful and intuitive. Instead of layering on more complex features, the system is designed with clarity and ease of use in mind – reimagining what a trading platform can do.</p><h3>Modern Front-End Design</h3><p>Designed on the latest trends in user experience for 2025, xPRO provides a clean, responsive interface and an easy-to-navigate, clutter-free design.</p><h3>TradingView Charts</h3><p>Integrated TradingView Charts allow traders to use highly advanced technical analysis tools. Such functionality includes the use of custom indicators and improved graph clarity.</p><h3>Multi-Asset &amp; Multi-Market Access</h3><p>XPRO allows hassle-free trading in forex, stocks, commodities, and cryptocurrency CFDs, with real-time market feeds and comprehensive charting.</p><h3>Cross-Margin Flex</h3><p>By engaging in cross-margin transactions, it is possible to optimize the allocation of funds across positions and asset classes.</p><h3>Perpetual Swap Support</h3><p>These perpetual contracts, with no expiry dates, offer greater flexibility for traders in implementing their cryptocurrency and derivatives market strategies.</p><h2>One Ecosystem, Multiple Trading Styles</h2><p>Every trading xPRO adds a new pillar to the existing MetaTrader 5 and cTrader environments in the XBTFX network. Each tool is designed with a specific trading tactic in mind – from creating automated trading strategies to day trading — and they all share the common benefits of straight-through processing, high liquidity, and transparent terms.</p><p>In addition, XBTFX provides:</p><p>Multiple solutions for funding, involving cryptocurrencies and transactions in different blockchains</p><ul><li><p><a href=\"https://xbtfx.com/page/crypto-forex-trading-platforms-copytrading\">Copy trading solutions</a> for passive income methods</p></li><li><p>Islamic ECN accounts for Sharia law-compliant trading</p></li><li><p>Demo Accounts for Risk-Free Practice</p></li><li><p>Institutional-level liquidity that assures stable and fair execution</p></li></ul><h2>Pursuing the XBTFX Vision</h2><p>Right from the start, the primary goal of XBTFX has been to connect the conventional financial world with the digital assets market. The agility of the XBTFX brand in response to market variability has emerged as one of its core strengths.</p><p>The launch of xPRO is a giant leap forward in that journey – one that not only cements XBTFX’s commitment to innovation but also its pledge to be grounded in transparency and reliability.</p><p>xPRO has been rolled out progressively since October of last year, or rather, October of the year 2025, to eligible clients of XBTFX.</p><h2>About XBTFX</h2><p><a href=\"https://xbtfx.com/\" target=\"_blank\" rel=\"follow\">XBTFX</a> is a licensed STP brokerage that provides trading on global financial markets across a range of instruments, including forex, cryptocurrencies, stocks, commodities, and CFDs. It uses MetaTrader 5, cTrader, and xPRO trading platforms to support retail and institutional traders.</p><p>The Financial Services Authority supervises it, and it has high levels of compliance and strong protections for traders, which XBTFX maintains are highly regarded among its international traders.</p><p>For more info, visit: <a href=\"https://xbtfx.com\" target=\"_blank\" rel=\"nofollow\">XBTFX.com</a></p>",
            "link": "https://investinglive.com/Education/xbtfx-unveils-xpro-created-for-traders-engineered-for-the-trading-future-20260224",
            "pub_date": "2026-02-24 21:11:25",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "76ef42ce-8d62-44b1-87a8-cb3aaf59ad3c",
            "title": "Iran strikes loom large over today's trade",
            "description": "<p>There is no sense over-analyzing price action today across markets. Yes, there is the usual software anxiety in stock markets but the overarching theme across bonds, FX, commodities and precious metals is simple -- angst about US strikes on Iran.</p><p>That thinking has US 10-year yields below 4% for the first time since November while oil prices are up more than 2%. It's also lent a bid to precious metals and the US dollar, though (unsurprisingly) the loonie and Swiss franc are top performers. </p><p>Now, no one really knows what will happen in the Middle East. Clearly, Trump is at least trying to put maximum pressure on negotiations via a massive US military build up in the region. Yesterday, various reports said negotiations were positive but we didn't hear that from the only person who matters: Trump.</p><p>At the same time, what people are saying matters much less than what they're doing and the US has evacuated bases near Iran while moving massive amounts of steel to the region. </p><p>I would highlight a pair of news items in the past hour or so, both of which have trimmed oil's gain:</p><p><strong>1)  US Secretary of State Marco Rubio announced a March 2-3 trip to Tel Aviv.</strong></p><p>Would he be doing that at the same time bombs were falling? I tend to think not and others might argue that the announcement of the trip is meant as a diversion to get Iran to lower its guard.</p><p><strong>2) JD Vance spoke to ABC and said any actions would be limited.</strong></p><p>\"The idea that we’re going to be in a Middle Eastern war for years with \nno end in sight -- there is no chance that will happen,\" Vance told the \nPost. He described the range of options as strikes that would \"ensure \nIran isn’t going to get a nuclear weapon\" or actions that could lead to a\n diplomatic solution.</p><p>The nuclear bit is particularly notable as there is nothing there about regime change or about crippling Iran's oil exports. Yes, Iran could be forced to shut in via circumstances and could try to shut the Strait of Hormuz but I don't think they will take that course of action if they don't sense a US effort to topple the regime.</p><p>All that said, Trump is about the least-predictable person in history so this could go in any direction. I don't fault those buying bonds in this environment but the long history of Middle East strikes and wars arguing for selling oil as the dust settles.</p>",
            "link": "https://investinglive.com/news/iran-strikes-loom-large-over-todays-trade-20260227",
            "pub_date": "2026-02-28 00:42:35",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "2476c230-ea40-4c6d-92a0-cac1223141b0",
            "title": "Nasdaq Technicals: Nasdaq index failed to extend above key MAs. Bias is lower.",
            "description": "<iframe data-media-id=\"d3dfba62-dfab-427e-b036-7ced02ec785f\" src=\"https://www.youtube.com/embed/9GrKRMmN2ak\" allowfullscreen=\"\" width=\"560\" height=\"315\" nuan_newframe=\"true\"></iframe><p data-start=\"175\" data-end=\"446\">The <strong data-start=\"179\" data-end=\"195\">NASDAQ index</strong> pushed to a high on Monday but failed to extend above its <strong data-start=\"254\" data-end=\"289\">falling 100-hour moving average</strong>, a rejection that triggered a sharp move lower. The decline reached Tuesday’s weekly low near <strong data-start=\"384\" data-end=\"394\">22,193</strong>, aligning with the top of a key swing support area.</p><p data-start=\"448\" data-end=\"793\">A subsequent rebound carried the index back above the <strong data-start=\"502\" data-end=\"529\">100-hour moving average</strong>, briefly increasing the bullish bias. However, momentum stalled at the <strong data-start=\"601\" data-end=\"628\">200-hour moving average</strong>, where buyers turned into sellers, leading to another sharp decline yesterday. Today, downside pressure continues, with the index trading lower by roughly <strong data-start=\"784\" data-end=\"792\">0.8%</strong>.</p><h3 data-start=\"795\" data-end=\"815\">What comes next?</h3><p data-start=\"817\" data-end=\"1100\">For buyers to regain control, the price must <strong data-start=\"862\" data-end=\"930\">move back above and hold the 100-hour moving average near 22,851</strong>. Even then, upside momentum would still need confirmation through a break above the <strong data-start=\"1015\" data-end=\"1060\">falling 200-hour moving average at 23,117</strong>, which remains the key technical pivot.</p><p data-start=\"1102\" data-end=\"1418\">On the downside, initial support comes in near <strong data-start=\"1149\" data-end=\"1159\">22,461</strong>, the low from last week. Below that level lies a broader swing support zone between <strong data-start=\"1244\" data-end=\"1265\">21,949 and 22,461</strong>. The lower boundary of this area also aligns with the <strong data-start=\"1320\" data-end=\"1380\">38.2% retracement of the rally from the May 23, 2025 low</strong>, increasing its technical importance.</p><p data-start=\"1420\" data-end=\"1681\">Sellers hold the near-term advantage, but additional downside progress is still needed to strengthen the bearish bias. For now, the <strong data-start=\"1552\" data-end=\"1601\">200-hour moving average remains the key pivot</strong>, separating a more bearish outlook from a potential return to bullish momentum.</p>",
            "link": "https://investinglive.com/technical-analysis/nasdaq-technicals-nasdaq-index-failed-to-extend-above-key-mas-bias-is-lower-20260227",
            "pub_date": "2026-02-28 00:45:42",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "008b088a-15f9-44d5-b9f9-ed87b650a1e6",
            "title": "Silver sprints higher, gains more than 5%",
            "description": "<p>Silver is up nearly 6% as it looks to break out of a recent range.</p><p>These are the best levels since the crushing rout on January 30. Notably, that was the final trading day of January and this is the final trading day of February. </p><p>The chart suddenly looks more promising as it breaks above the early February highs.</p><p>This will mark the 10th consecutive month of gains in silver as it benefits both from the USD debasement trade along with industrial electrification demand.</p><p>The gains are impressive today given that we had so much volatility last month and what looked like a blow-off top. Instead, silver steadied early in February and is now marching back higher. </p><p>That suggests insatiable demand for silver and previous metals. Gold prices were lower earlier but have turned around and are up $50 to $5236 in what will be the all-time highest weekly close for gold (if it holds).</p><p>Today's US PPI report raised some fresh questions about the Fed's ability to cut rates. In addition, oil prices are up 3% today in a move that will add further inflation pressure to the March pipeline data (and beyond). The oil move is highly conditional on what happens in Iran so keep a close eye on that.</p><p>Should the US get significantly involved in Iran -- particularly if it looks like it be an operation for many months -- then I would expect further large bids in gold and precious metals. </p><p>\"The idea that we’re going to be in a Middle Eastern war for years with no end in sight -- there is no chance that will happen,\" Vance told the Post. He described the range of options as strikes that would \"ensure Iran isn’t going to get a nuclear weapon\" or actions that could lead to a diplomatic solution.</p><p>Just now, US Secretary of State Marco Rubio announced a March 2-3 trip to Tel Aviv and that looks like a sign that nothing is imminent, though with war nothing is certain.</p>",
            "link": "https://investinglive.com/commodities/silver-sprints-higher-gains-more-than-5-20260227",
            "pub_date": "2026-02-27 23:58:13",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "08bce416-245d-4dcc-bac3-98a79f10e589",
            "title": "USDCAD Technicals: USDCAD extends to new lows for the day and tests the low for the week",
            "description": "<iframe data-media-id=\"46168146-c052-41ce-95e0-02def00312f0\" src=\"https://www.youtube.com/embed/EbglL3wqr0U\" allowfullscreen=\"\" width=\"560\" height=\"315\" nuan_newframe=\"true\"></iframe><p data-start=\"165\" data-end=\"360\">The <strong data-start=\"169\" data-end=\"216\">USDCAD moved lower in the latest hourly bar</strong>, testing Monday’s low near <strong data-start=\"244\" data-end=\"254\">1.3649</strong>. The break lower has been modest so far, but <strong data-start=\"300\" data-end=\"329\">sellers remain in control</strong> as downside pressure persists.</p><p data-start=\"362\" data-end=\"730\">Earlier in the session, the pair briefly moved higher following the <strong data-start=\"430\" data-end=\"445\">PPI release</strong>, but that rally quickly faded after the price tested the <strong data-start=\"503\" data-end=\"540\">100-hour moving average at 1.3686</strong>, which was closely aligned with the <strong data-start=\"577\" data-end=\"616\">200-hour moving average near 1.3680</strong>. The failure against this moving average cluster reinforced resistance and helped trigger the renewed move lower.</p><p data-start=\"732\" data-end=\"919\">For buyers to regain control, the price must <strong data-start=\"777\" data-end=\"844\">break and hold above both the 100- and 200-hour moving averages</strong>. Until that occurs, the technical bias remains tilted toward the downside.</p><p data-start=\"921\" data-end=\"1153\">On the downside, a sustained move below <strong data-start=\"961\" data-end=\"987\">Monday’s low at 1.3649</strong> would open the door for further selling, targeting <strong data-start=\"1039\" data-end=\"1049\">1.3630</strong> initially, followed by a broader swing support zone from mid-February surrounding the <strong data-start=\"1136\" data-end=\"1152\">1.3600 level</strong>.</p><p data-start=\"1155\" data-end=\"1327\">Sellers are now pressing their advantage. The key question is whether they can maintain momentum and <strong data-start=\"1256\" data-end=\"1326\">expand what has been a relatively tight trading range for the week</strong>.</p>",
            "link": "https://investinglive.com/technical-analysis/usdcad-technicals-usdcad-extends-to-new-lows-for-the-day-and-tests-the-low-for-the-week-20260227",
            "pub_date": "2026-02-27 23:22:01",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "0235d4ca-d02b-43fe-8d76-28915cf05697",
            "title": "XM Secures CMA License, Strengthening Its Regulatory Footprint in Kenya",
            "description": "<p>Globally renowned broker <a href=\"https://www.xm.ke/\">XM</a>, with over 15 million clients worldwide, has officially obtained a license from the Capital Markets Authority (CMA) of Kenya. This achievement marks a significant milestone in XM’s strategic expansion across Africa and reinforces its commitment to providing a secure and regulated trading environment for local investors. </p><p>The granting of the CMA license reflects XM’s dedication to operating under the highest regulatory standards. By aligning with Kenya’s robust financial framework, XM aims to build long-term trust and offer Kenyan traders a transparent, client-first experience backed by local oversight. </p><p><em><strong>“Kenya represents a dynamic and rapidly growing financial market, and receiving authorization from the CMA is a testament to our commitment to regulatory excellence and market leadership,” </strong></em>said Menelaos Menelaou, co-Chief Executive Officer of XM. <em><strong>“We are proud to enhance our presence in Kenya, providing local traders with direct access to our world-class ecosystem of products and award-winning services under a robust, locally recognized regulatory framework.”</strong></em></p><p>The new license allows XM to deepen its presence in the region, offering traders in Kenya direct access to its established global ecosystem of over 1,400 products, comprehensive educational resources, and world-class support. The authorization ensures that all operations within the country adhere to the strict compliance and investor protection standards set by the Authority. </p><p>Through its dedicated website, <a href=\"https://www.xm.ke\" rel=\"nofollow\">www.xm.ke</a>, Kenyan clients can now enjoy a seamless onboarding process and benefit from superior trading conditions, including fast execution, stable leverage, year-round bonuses, and a wide array of products and trading tools designed to help them trade with confidence. </p><p>Traders of all levels are welcome to join XM and open an account in minutes. </p><p>#CMAKenyaLicenseXM</p><h3>About XM </h3><p>XM is an internationally established trading and investment firm, with over 15 million clients, from over 190 countries. Armed with multiple international licenses, XM offers competitive services for retail traders, investors, and affiliates.   </p><p>With over 15 years of serving clients, XM has proven to be fair, trustworthy, and dependable. Traders can access over 1,400 instruments across all devices. The award-winning broker is known for its wide range of products, excellent support, and outstanding education.  </p><p><strong>Risk Warning:</strong> Online Forex/CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. Retail investor accounts lose money when trading Derivatives with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money. Please consider XM’s Risk Disclosure. </p><p><strong>Disclaimer</strong><strong>:</strong> Promotions and bonuses are not available for accounts registered under XM's EU-based entity. Specific regions may be excluded. The XM Group operates globally under various entities, so products, services, and features listed here vary between XM entities.  For further information, please visit the XM website.</p>",
            "link": "https://investinglive.com/Education/xm-secures-cma-license-strengthening-its-regulatory-footprint-in-kenya-20260224",
            "pub_date": "2026-02-24 20:11:11",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "d7900b0e-4986-4d06-a4e4-fdd77bd71b33",
            "title": "US December construction spending +0.3% vs +0.3% expected",
            "description": "<ul><li>Prior was +0.5%</li></ul><p>Given the jumps in shares of CAT and DE, there better be some construction spending in the pipeline.</p>",
            "link": "https://investinglive.com/news/us-december-construction-spending-03-vs-03-expected-20260227",
            "pub_date": "2026-02-27 23:00:13",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "7b71b763-36e0-4f09-bc36-a089045e5321",
            "title": "Tech sector under pressure: Energy and healthcare offer a safe haven",
            "description": "<h2>Sector Overview</h2> <p>The stock market today showcases a complex tapestry of trends and fluctuations. The <strong>technology sector</strong> is under significant pressure, with major players like Microsoft (MSFT) down by <em>2.63%</em> and Nvidia (NVDA) witnessing a <em>2.24%</em> decline. Notably, Broadcom (AVGO) is also down by <em>3.11%</em>, pointing towards a widespread downturn within the tech space.</p> <p>On a brighter note, <strong>energy</strong> stocks like Exxon Mobil (XOM) surged by <em>1.78%</em>, and Chevron (CVX) rose by <em>1.54%</em>, buoying investor sentiment toward this sector. The <strong>healthcare sector</strong> reflected some resilience with Eli Lilly (LLY) and Johnson & Johnson (JNJ) both inching upwards by <em>0.26%</em> and <em>0.23%</em> respectively.</p> <h2>Market Mood and Trends</h2> <p>Investor sentiment today is predominantly bearish across technology, with negative news driving the downturn. Meanwhile, stability in the healthcare and robust performance in energy stocks suggest investors are seeking refuge in traditionally \"safer\" sectors during volatile periods. Consumer confidence seems to waver, as highlighted by a <em>0.52%</em> drop in Google (GOOGL) and a deeper <em>1.91%</em> decline in Meta Platforms (META). However, Netflix (NFLX) bucks the trend, showing an impressive <em>8.61%</em> gain, possibly reflecting strong quarterly performance or strategic announcements.</p> <h2>Strategic Recommendations</h2> <p>Given today's dynamics, investors might consider re-evaluating exposure to the tech sector while looking to diversify within <strong>energy and healthcare</strong>. These sectors are currently displaying signs of stability and potential growth. Assessments of stocks like XOM and LLY could be favorable given their recent performance. Conversely, maintain caution around highly volatile tech stocks until clearer trends emerge. As always, staying informed with real-time data is crucial for navigating such a mixed market environment. Visit <a href=\"https://www.investinglive.com\">InvestingLive.com</a> for continual updates and analysis.</p>",
            "link": "https://investinglive.com/stock-market-update/tech-sector-under-pressure-energy-and-healthcare-offer-a-safe-haven-20260227",
            "pub_date": "2026-02-27 22:46:39",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "a244cdb7-4cde-4070-ba88-4faadd952865",
            "title": "USDCHF Technicals: USDCHF moves lower to a new low for the week",
            "description": "<iframe data-media-id=\"e3a45fbf-b605-4bc8-9c00-9b5fc6a2b629\" src=\"https://www.youtube.com/embed/SvWnz0AAy5M\" allowfullscreen=\"\" width=\"560\" height=\"315\" nuan_newframe=\"true\"></iframe><p data-start=\"172\" data-end=\"651\">The <strong data-start=\"176\" data-end=\"228\">USDCHF is moving lower in North American trading</strong>, pressured by a softer US dollar backdrop as risk sentiment deteriorates. US equities opened sharply lower, with the <strong data-start=\"346\" data-end=\"368\">S&amp;P 500 down 0.78%</strong> and the <strong data-start=\"377\" data-end=\"401\">NASDAQ falling 1.08%</strong>. At the same time, <strong data-start=\"421\" data-end=\"486\">US yields are declining despite higher-than-expected PPI data</strong>, signaling markets are looking past inflation strength for now. The <strong data-start=\"555\" data-end=\"597\">10-year yield is down 4.2 basis points</strong>, with the <strong data-start=\"608\" data-end=\"650\">2-year yield lower by a similar amount</strong>.</p><h3 data-start=\"653\" data-end=\"674\">Technical picture</h3><p data-start=\"675\" data-end=\"996\">From a technical perspective, today’s upside attempt stalled near the <strong data-start=\"745\" data-end=\"806\">converged 100- and 200-hour moving averages around 0.7740</strong>, where sellers stepped in decisively. That rejection gave sellers the green light, with downside momentum beginning late in the European morning session and extending into early US trading.</p><p data-start=\"998\" data-end=\"1329\">The pair is now testing a <strong data-start=\"1024\" data-end=\"1081\">lower channel trendline and swing support near 0.7692</strong>. A sustained break below this level would increase the bearish bias and shift focus toward the <strong data-start=\"1177\" data-end=\"1218\">February 12–13 swing lows near 0.7669</strong>. Below that, the next downside targets come in at the <strong data-start=\"1273\" data-end=\"1328\">January 28 and February 10 swing lows around 0.7629</strong>.</p><h3 data-start=\"1331\" data-end=\"1365\">What would disappoint sellers?</h3><p data-start=\"1366\" data-end=\"1663\">A move back above <strong data-start=\"1384\" data-end=\"1394\">0.7708</strong>, defined by swing lows from Monday and yesterday’s trading, would weaken the immediate bearish momentum. A break above that level could trigger short covering and open the door for a rotation back toward the <strong data-start=\"1603\" data-end=\"1662\">converged 100- and 200-hour moving averages near 0.7740</strong>.</p>",
            "link": "https://investinglive.com/technical-analysis/usdchf-technicals-usdchf-moves-lower-to-a-new-low-for-the-week-20260227",
            "pub_date": "2026-02-27 22:40:37",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "90b6f0ca-488a-4bf7-9781-7c899304a674",
            "title": "Software slump leads pre-market retreat",
            "description": "<p data-path-to-node=\"3\">U.S. equity futures are under pressure this morning, with the Nasdaq (NQ) and S&amp;P 500 (ES) both down 0.9%, while the Russell 2000 (RTY) is lagging further with a 1.3% drop. While the \"Magnificent 7\" are seeing modest declines led by Microsoft (-2.5%), the real story is a violent resumption of selling in the software sector.</p><p data-path-to-node=\"4\">Investors are increasingly wary of companies transitioning their business models toward AI, punishing any signs of slowing growth or margin compression in exchange for long-term AI positioning.</p><p data-path-to-node=\"4\">On CNBC this morning, they ran a pair of comments from software markers highlighting how \"something changed\" in December with regards to the capability of models in replacing coders. One of those was Block, which is up 15% today after laying off 40% of staff. Everyone is taking that as a sign of what's to come.</p><p data-path-to-node=\"7\">The software sector is seeing some of its sharpest single-day declines of the year, driven by a \"show-me\" attitude from investors regarding AI monetization.</p><ul data-path-to-node=\"8\"><li><p data-path-to-node=\"8,0,0\">Duolingo (DUOL) -27%: The language-learning giant is the morning's biggest casualty. Despite beating Q4 numbers, the stock is cratering on weak 2026 guidance. Management is pivoting toward a \"growth over profit\" strategy, investing heavily in free-user experience and AI features (like Video Call) to scale to 100 million DAUs. The market, however, is fixated on the projected EBITDA margin compression (from 29.5% to 25%) and slowing bookings growth.</p></li><li><p data-path-to-node=\"8,1,0\">Zscaler (ZS) -13%: Even a \"beat and raise\" wasn't enough for the cybersecurity firm. While ZS topped estimates, investors were disappointed by the organic growth metrics. Much of the upside was attributed to the Red Canary acquisition rather than core organic acceleration, sparking fears of a \"growth ceiling\" in a crowded security market.</p></li><li><p data-path-to-node=\"8,2,0\">Intuit (INTU) -3.1%: The financial software leader posted a robust quarter with 17% revenue growth, but a disappointing outlook for the upcoming quarter has weighed on shares. Investors are cautious about the high debt load used to fund AI initiatives and the slower-than-expected return to double-digit growth for the Mailchimp segment.</p></li></ul><p data-path-to-node=\"4\">While \"SaaS\" (Software as a Service) is struggling, the \"Picks and Shovels\" of AI continue to show diverging paths based on their balance sheets. </p><p data-path-to-node=\"4\">Today's winner is Dell, up 11% on stellar Q4 results fueled by a massive backlog in AI servers. Dell remains a primary beneficiary of the hardware build-out.</p><p data-path-to-node=\"4\">On the flip side, CoreWeave is down 11.5% on a wider than expected loss and $30 billion capex plan.</p><p data-path-to-node=\"4\">Finally, NFLX shares are up 8.6% after bowing out of the race for Warner Brothers and taking a $2.8 billion break fee.</p>",
            "link": "https://investinglive.com/stocks/software-slump-leads-pre-market-retreat-20260227",
            "pub_date": "2026-02-27 22:13:00",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "42d41982-d3ee-41b7-8adc-b945b469274d",
            "title": "Canada Q4 GDP -0.6% vs 0.0% expected",
            "description": "<ul><li>Prior was +2.6%</li><li>GDP -0.2% q/q vs +0.6% prior</li><li>Real GDP increased 1.7% in 2025</li></ul><p>The number might not be as bad as it looks as the fourth quarter decrease was largely due to withdrawals of business \ninventories following inventory accumulations in the third quarter.</p>",
            "link": "https://investinglive.com/news/canada-q4-gdp-06-vs-00-expected-20260227",
            "pub_date": "2026-02-27 21:32:45",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "846bdaa2-cf22-4d61-be38-fafb1a07a4f8",
            "title": "US January PPI final demand Y/Y +2.9% vs +2.6% expected",
            "description": "<ul><li>Prior YoY was +3.0% (revised to x.x%)</li><li>PPI M/M +x.x% vs 0.3% expected</li><li>Prior +0.5% (revised to x.x%)</li></ul><p>Core PPI</p><ul><li>Core PPI Y/Y +x.x% vs +3.0% expected</li><li>Prior +3.3% (revised to x.x%)</li><li>Core PPI M/M +x.x% vs +0.3% expected</li><li>Prior Core PPI MoM +0.7% (revised to x.x%)</li></ul><h2>WHAT THE US PPI MEASURES?</h2><p>The Producer Price Index (PPI) is an economic indicator that measures the average change over time in the selling prices received by domestic producers for their output. In simpler terms, it tracks inflation from the perspective of the seller/business rather than the consumer like the Consumer Price Index (CPI).</p>",
            "link": "https://investinglive.com/news/us-january-ppi-final-demand-yy-29-vs-26-expected-20260227",
            "pub_date": "2026-02-27 21:30:12",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "3ee92c45-e9c5-4de2-a2f5-ebfb9fe69900",
            "title": "The USD is little changed to start the NA session.  What next technically?",
            "description": "<iframe data-media-id=\"69026544-f0e3-4d64-85b8-3562ebd06f42\" src=\"https://www.youtube.com/embed/h5XGI6RSKa0\" allowfullscreen=\"\" width=\"560\" height=\"315\" nuan_newframe=\"true\"></iframe><p>TGIF.</p><p data-start=\"197\" data-end=\"564\">The USD is little changed to start the North American session as traders await the US <strong data-start=\"283\" data-end=\"319\">January PPI report at 8:30 AM ET</strong>. Expectations are for a <strong data-start=\"344\" data-end=\"366\">+0.3% MoM increase</strong>, while the <strong data-start=\"378\" data-end=\"428\">YoY rate is forecast to ease to 2.6% from 3.0%</strong>. The dollar is trading mixed against the major currency pairs — <strong data-start=\"493\" data-end=\"523\">EURUSD, USDJPY, and GBPUSD</strong> — as markets look for the next catalyst.</p><h3 data-start=\"566\" data-end=\"576\">EURUSD</h3><p data-start=\"577\" data-end=\"757\">The <strong data-start=\"581\" data-end=\"591\">EURUSD</strong> has moved back above its <strong data-start=\"617\" data-end=\"676\">converged 100- and 200-hour moving averages near 1.1800</strong>, a level that now serves as the key barometer for both buyers and sellers today.</p><p data-start=\"759\" data-end=\"1141\">If buyers can maintain control above those moving averages, the next upside focus shifts toward the <strong data-start=\"859\" data-end=\"911\">50% midpoint of the 2026 trading range at 1.1830</strong>, an area that capped gains yesterday. Monday’s high at <strong data-start=\"967\" data-end=\"977\">1.1834</strong> reinforces this resistance zone. A sustained break above both levels would strengthen the bullish bias and open the door toward <strong data-start=\"1106\" data-end=\"1116\">1.1860</strong>, followed by <strong data-start=\"1130\" data-end=\"1140\">1.1890</strong>.</p><p data-start=\"1143\" data-end=\"1401\">On the downside, a move back below the hourly moving averages would shift attention to a swing support area between <strong data-start=\"1259\" data-end=\"1280\">1.1760 and 1.1778</strong>. A break below that region would target the <strong data-start=\"1325\" data-end=\"1363\">100-day moving average near 1.1693</strong> as the next major downside objective.</p><p data-start=\"1403\" data-end=\"1598\">For the week, the pair has traded within roughly a <strong data-start=\"1454\" data-end=\"1470\">70-pip range</strong>, highlighting a non-trending environment. Such compression typically precedes a larger directional move once a breakout occurs.</p><h3 data-start=\"1600\" data-end=\"1610\">USDJPY</h3><p data-start=\"1611\" data-end=\"1868\">The <strong data-start=\"1615\" data-end=\"1625\">USDJPY</strong> moved lower during the Asian-Pacific session and briefly dipped below its <strong data-start=\"1700\" data-end=\"1736\">100-hour moving average (155.76)</strong>, but downside momentum quickly faded. The pair rebounded and stalled against a swing resistance area between <strong data-start=\"1846\" data-end=\"1867\">156.20 and 156.28</strong>.</p><p data-start=\"1870\" data-end=\"2128\">Heading into North American trading, the <strong data-start=\"1911\" data-end=\"1960\">100-hour moving average acts as close support</strong>, while the swing area above serves as resistance. Traders will look for a decisive break on either side, with momentum likely following the direction of that breakout.</p><h3 data-start=\"2130\" data-end=\"2140\">GBPUSD</h3><p data-start=\"2141\" data-end=\"2361\">The <strong data-start=\"2145\" data-end=\"2155\">GBPUSD</strong> has traded in a choppy range today. During the early European session, sellers leaned against the <strong data-start=\"2254\" data-end=\"2313\">converged 100- and 200-hour moving averages near 1.3508</strong>, triggering a rotation lower toward <strong data-start=\"2350\" data-end=\"2360\">1.3475</strong>.</p><p data-start=\"2363\" data-end=\"2658\">On the downside, the <strong data-start=\"2384\" data-end=\"2420\">200-day moving average at 1.3445</strong> remains the key technical level. The pair has tested this moving average five times recently, producing only modest breaks (about 8 pips) without sustained momentum. A clearer bearish bias requires a firm break and hold below this level.</p><p data-start=\"2660\" data-end=\"2840\">On the topside, a move back above <strong data-start=\"2694\" data-end=\"2704\">1.3508</strong> would shift momentum back toward buyers, targeting resistance near <strong data-start=\"2772\" data-end=\"2782\">1.3537</strong>, followed by swing resistance zones at <strong data-start=\"2822\" data-end=\"2839\">1.3582–1.3590</strong>.</p>",
            "link": "https://investinglive.com/technical-analysis/the-usd-is-little-changed-to-start-the-na-session-what-next-technically-20260227",
            "pub_date": "2026-02-27 21:16:28",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "7fe49a3f-444d-425a-a48b-94a76f90c448",
            "title": "Germany February preliminary CPI +1.9% vs +2.0% y/y expected",
            "description": "<ul><li>Prior +2.1%</li><li>HICP +2.0% vs +2.1% y/y expected</li><li>Prior +2.1%</li><li>Core CPI Y/Y +2.5% vs +2.5% prior</li></ul><p>We have slight misses here but that was pretty much expected after the softer German states readings <a href=\"https://investinglive.com/news/bavaria-february-cpi-19-vs-21-yy-prior-20260227/\" target=\"_blank\" rel=\"follow\">here</a>. Having said that, the core measure matched the prior reading. The data won't change anything for the ECB.</p>",
            "link": "https://investinglive.com/news/germany-february-preliminary-cpi-19-vs-20-yy-expected-20260227",
            "pub_date": "2026-02-27 21:00:08",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "1c51353c-ae3a-42a4-9cf8-a51f88308131",
            "title": "investingLive European markets wrap: Dollar steady, risk trades on edge amid cautious mood",
            "description": "<p>Headlines:</p><ul><li><a href=\"https://investinglive.com/commodities/gold-remains-supported-amid-us-iran-uncertainty-but-downside-risks-linger-with-nfp-next-20260227/\">Gold remains supported amid US-Iran uncertainty, but downside risks linger with NFP next</a></li><li><a href=\"https://investinglive.com/commodities/oil-prices-remain-supported-amid-us-iran-uncertainty-traders-likely-to-hedge-into-weekend-20260227/\">Oil prices remain supported amid US-Iran uncertainty; traders likely to hedge into weekend</a></li><li><a href=\"https://investinglive.com/forex/major-currencies-not-up-to-much-as-we-get-into-the-final-stretch-of-the-week-20260227/\">Major currencies not up to much as we get into the final stretch of the week</a></li><li><a href=\"https://investinglive.com/news/bavaria-february-cpi-19-vs-21-yy-prior-20260227/\">Bavaria February CPI +1.9% vs +2.1% y/y prior</a></li><li><a href=\"https://investinglive.com/news/france-february-preliminary-cpi-10-vs-08-yy-expected-20260227/\">France February preliminary CPI +1.0% vs +0.8% y/y expected</a></li><li><a href=\"https://investinglive.com/news/spain-february-preliminary-cpi-23-vs-22-yy-expected-20260227/\">Spain February preliminary CPI +2.3% vs +2.2% y/y expected</a></li><li><a href=\"https://investinglive.com/news/france-q4-final-gdp-02-vs-02-qq-prelim-20260227/\">France Q4 final GDP +0.2% vs +0.2% q/q prelim</a></li><li><a href=\"https://investinglive.com/news/switzerland-q4-gdp-01-vs-02-qq-expected-20260227/\">Switzerland Q4 GDP +0.1% vs +0.2% q/q expected</a></li><li><a href=\"https://investinglive.com/news/chinas-politburo-development-process-of-latest-five-year-plan-is-extremely-unusual-20260227/\">China's Politburo: Development process of latest 'five-year plan' is \"extremely unusual\"</a></li></ul><p>Markets:</p><ul><li>US dollar steady, little changed; CHF leads, GBP lags on the day</li><li>European equities steady, mostly little changed</li><li>S&amp;P 500 futures lower by 0.4%, Nasdaq futures down 0.5%</li><li>WTI crude oil up over 2% to $66.87</li><li>Gold flat at $5,186 while silver is up 1% to $89.69</li><li>US 10-year yields down 3 bps to 3.997%</li><li>Bitcoin down 2.2% to $65,949</li></ul><p class=\"text-align-justify\">It was a relatively slower session with markets staying on edge as we approach the closing stages of the week/month.</p><p class=\"text-align-justify\">Geopolitical tensions remain in focus as traders and investors await further developments between the US and Iran ahead of the weekend. That is making for a more guarded mood in general, with the dollar holding steadier while risk trades stay on the defensive. Meanwhile, oil prices are staying underpinned with WTI crude up over 2% near the week's highs at $66.87.</p><p class=\"text-align-justify\">In the major currencies space, there wasn't much action to take note of. The dollar is keeping little changed mostly and more mixed with the bigger news being from Asia trading when <a href=\"https://investinglive.com/centralbank/pboc-cuts-fx-risk-reserve-ratio-to-0-slowing-yuan-appreciation-20260227/\" target=\"_blank\" rel=\"follow\">China stepped in to slow the yuan appreciation</a> by making it cheaper to buy up the dollar. That didn't translate to much influence in Europe though.</p><p class=\"text-align-justify\">EUR/USD is flat around 1.1803 with large option expiries in play at the 1.1800 mark. Meanwhile, GBP/USD is flat at 1.3475 despite political risks coming in as Labour were humiliated by the Gordon and Denton by-election results. Then, USD/JPY is down slightly by 0.2% to 155.83 but there wasn't anything in it with the pair ranging near the 156.00 mark on the session.</p><p class=\"text-align-justify\">Looking to equities, major indices in Europe kept a steadier mood with light changes and a more mixed showing. The selloff in Wall Street yesterday was largely due to tech shares and we're seeing that continue again today. US futures are keeping lower across the board with S&amp;P 500 futures down 0.4% and Nasdaq futures down 0.5% currently.</p><p class=\"text-align-justify\">As for precious metals, there wasn't much in it either with gold flat at $5,186 and silver just up a little over 1% to $89.69 on the day.</p><p class=\"text-align-justify\">All eyes are staying on geopolitical developments, US stock market sentiment, as well as month-end flows in looking to wrap up the week.</p>",
            "link": "https://investinglive.com/news/investinglive-european-markets-wrap-dollar-steady-risk-trades-on-edge-amid-cautious-mood-20260227",
            "pub_date": "2026-02-27 20:31:10",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "9ece86a0-a866-4ff8-8f53-414333b05914",
            "title": "How have interest rate expectations changed after this week's events?",
            "description": "<p><strong>Rate cuts by year-end</strong></p><ul><li><strong>Fed:</strong> 59 bps (98% probability of no change at the upcoming meeting)</li><li><strong>BoE: </strong>52 bps (84% probability of <em>rate cut</em> at the upcoming meeting)</li><li><strong>ECB:</strong> 8 bps (99% probability of no change at the upcoming meeting)</li><li><strong>BoC:</strong> 9 bps (96% probability of no change at the upcoming meeting)</li><li><strong>SNB:</strong> 8 bps (89% probability of no change at the upcoming meeting)</li></ul><p><strong>Rate hikes by year-end</strong></p><ul><li><strong>BoJ:</strong> 46 bps (87% probability of no change at the upcoming meeting)</li><li><strong>RBA:</strong> 43 bps (83% probability of no change at the upcoming meeting)</li><li><strong>RBNZ:</strong> 28 bps (99% probability of no change at the upcoming meeting)</li></ul><p>You can find last week's market pricing <a href=\"https://investinglive.com/news/how-have-interest-rate-expectations-changed-after-this-weeks-events-20260220/\" target=\"_blank\" rel=\"follow\">here</a>.</p><p>It's been a pretty lacklustre week amid limited news and data releases. Therefore, it shouldn't be surprising to see very small changes in in market pricing. </p><p>The most notable moves were seen on BoJ and RBA side. We got a slightly dovish repricing for the BoJ after a <a href=\"https://investinglive.com/forex/japanese-yen-falls-on-report-that-takaichi-voiced-concerns-to-ueda-on-boj-rate-hikes-20260224/\" target=\"_blank\" rel=\"follow\">Mainichi report </a>revealed that Japanese PM Takaichi opposed further rate hikes during her meeting with Governor Ueda last week.</p><p>Following the higher than expected <a href=\"https://investinglive.com/centralbank/australia-cpi-beats-estimates-lifting-rba-hike-odds-and-boosting-aussie-dollar-20260225/\" target=\"_blank\" rel=\"follow\">Australian monthly CPI</a>, traders firmed up expectations for a back-to-back RBA rate hike in March but the probabilities fell a little after <a href=\"https://investinglive.com/centralbank/the-australian-dollar-weakens-as-rbas-bullock-signals-patience-on-judging-policy-20260225/\" target=\"_blank\" rel=\"follow\">Governor Bullock</a> called for patience.</p><p>Finally, we got a slightly dovish repricing for the Fed despite strong US data this week. This was most likely caused by the stock market weakness amid persistent US-Iran tensions as the US macro picture remains solid.</p>",
            "link": "https://investinglive.com/CentralBanks/how-have-interest-rate-expectations-changed-after-this-weeks-events-20260227",
            "pub_date": "2026-02-27 20:34:42",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "50b4e79a-e1e6-41c8-94a4-a2fd85dc7834",
            "title": "BOJ will only have little room to raise interest rates further - ANZ",
            "description": "<p class=\"text-align-justify\">While a lot of focus on the BOJ is turning to the outcome of the spring wage negotiations in the weeks ahead, ANZ is one to argue that the bigger picture outlook might be one that limits the scope for the central bank to stay on the tightening path. And the firm argues that it won't be from a shake up of the BOJ board nor pressure from the government. Instead, it is the very nature of inflation dynamics in Japan.</p><p class=\"text-align-justify\">ANZ forecasts that inflation pressures in Japan will begin to soften this year and are looking for core prices to ease back down towards the 2% level. As such, that will challenge the BOJ mandate of having to be able to \"sustain\" core inflation at that threshold. The firm notes that:</p><p class=\"text-align-justify\"><em>\"There is much to consider in Japan’s economic outlook. However, in coming months we expect domestic economic conditions will be consistent with gradual disinflation through 2026. Headline Consumer Price Index inflation was 1.5% y/y in January, and we forecast it will average 1.7% this year. We expect core inflation (2.4% y/y) will come down gradually, closer to 2.0%. We are of the view that the BOJ needs to proceed cautiously with respect to further tightening.</em></p><p class=\"text-align-justify\"><em>We forecast only one more 25 bps rate rise this year, as Japan gradually moves away from the zero lower bound, taking the policy rate to 1.00%.\"</em></p><p class=\"text-align-justify\">That's slightly on the conservative side as opposed to market pricing, with traders currently seeing ~46 bps of rate hikes from the BOJ by year-end.</p><p class=\"text-align-justify\">If there is really going to be just one more rate hike left by the BOJ, they might want to get a move on with <a href=\"https://investinglive.com/centralbank/boj-up-against-the-clock-in-delivering-the-next-rate-hike-20260226/\" target=\"_blank\" rel=\"follow\">the opportunity window likely to narrow further</a> once we get past March and even more so after June.</p>",
            "link": "https://investinglive.com/CentralBanks/boj-will-only-have-little-room-to-raise-interest-rates-further-anz-20260227",
            "pub_date": "2026-02-27 19:43:31",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "109ee2c1-f6da-43e7-8b35-047c960ba1cf",
            "title": "USDCAD consolidates around monthly highs as traders await US NFP and USMCA news",
            "description": "<h2 class=\"MsoNormal\">FUNDAMENTAL\nOVERVIEW</h2><p><strong><u>USD:</u></strong></p><p>The US dollar continues to\nbounce around as macro and geopolitical uncertainty is keeping the market\nrangebound. The greenback strengthened yesterday after early reports suggested\nthe third round of US–Iran talks had broken down, with Iran reportedly\nrejecting US demands. Later in the day, however, new headlines indicated that\nthe discussions had actually made significant progress and that another round was\nscheduled for next week. The USD eventually gave back the gains. </p><p>The potential US-Iran\nmilitary escalation and the future Fed’s interest rates path remain the biggest\nrisks for the US dollar. A military escalation will likely boost the greenback\non severe risk-off mood. A hawkish repricing of interest rate expectations on\nstronger US data would also have a positive effect on the USD. Fed’s Waller\nplaced a great deal on next week’s NFP report.</p><p><strong><u>CAD:</u></strong></p><p>On the CAD side, nothing\nhas changed as the BoC remains in neutral mode and traders await new\ndevelopments on the USMCA review front. </p><p>Yesterday, Dominic LeBlanc,\nwho is the Canadian minister responsible for US-Canada trade, said that private\ngovernment to government conversations on USMCA are \"not\ndiscouraging\". Regarding separate bi-lateral deals, he said there have\nalways been bilateral arrangements between the three countries. </p><p>The signals have been\nmixed, but overall, slightly positive. The market is pricing some chances of a\nrate cut by year-end but those remain low. The economic data has been\nsupportive of such stance with the labour market stabilising and core inflation\nhovering a bit above the 2.5% mid-point of the BoC 2-3% target range. </p><h2 class=\"MsoNormal\">USDCAD TECHNICAL\nANALYSIS – DAILY TIMEFRAME</h2><p>On the daily chart, we can\nsee that USDCAD pulled all the way back to the monthly high around the 1.3725\nlevel and stalled as the market got stuck in a consolidation. We can expect the\nsellers to lean on the 1.3725 resistance and the major downward trendline to\nposition for a drop into new lows. The buyers, on the other hand, will look for\na upside breakouts to increase the bullish bets into the 1.3900 handle next.</p><h2 class=\"MsoNormal\">USDCAD TECHNICAL\nANALYSIS – 4 HOUR TIMEFRAME</h2><p>On the 4 hour chart, we can\nsee the recent price action formed a potential head and shoulders pattern near\nthe monthly high with the neckline standing around the 1.3650 level. The buyers\nwill likely continue to step in around the neckline with a defined risk below\nit to keep pushing into new highs, while the sellers will look for a break\nlower to increase the bearish bets into the 1.3500 handle next.</p><h2 class=\"MsoNormal\">USDCAD TECHNICAL\nANALYSIS – 1 HOUR TIMEFRAME</h2><p>On the 1 hour chart, there’s\nnot much we can add here as the buyers will have a better risk to reward setup around\nthe neckline, while the sellers will either wait for a break below the neckline\nor above the resistance. The red lines define the <a href=\"https://investinglive.com/Education/trading-tip-know-the-average-daily-range-adr-20220207/\">average daily range</a> for today. </p><h2>UPCOMING CATALYSTS</h2><p class=\"MsoNormal\"><a href=\"https://investinglive.com/EconomicCalendar\">Today</a> we conclude the week with the Canadian GDP and the US PPI data but\ncontinue to watch out for US-Iran headlines ahead of the weekend.</p>",
            "link": "https://investinglive.com/forex/usdcad-consolidates-around-monthly-highs-as-traders-await-us-nfp-and-usmca-news-20260227",
            "pub_date": "2026-02-27 19:30:22",
            "source": "investinglive",
            "kind": 1,
            "language": "en"
        }
    ]
}