{
    "data": [
        {
            "title": "中小盘策略专题：资本市场赋能“专精特新”，加快发展新质生产力",
            "description": "<div class=\"abstruct-info\">\n<p>　　2024年“专精特新”支持政策在深度与广度上进一步提升</p><p>　　2024年“专精特新”政策体系持续完善，强调推动“专精特新”企业高质量发展。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn【慧博投研资讯】</a></font>2024年7月，党的二十届三中全会审议通过《决定》，强调“构建促进专精特新中小企业发展壮大机制”；9月，第六批专精特新“小巨人”企业名单公示；12月，专精特新中小企业发展大会顺利召开，河南、浙江、福建等省市相继出台“专精特新”政策。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn（慧博投研资讯）</a></font>2024年“专精特新”支持政策的深度与广度进一步提升：一是政策目标由“增量”转向“提质”；二是数字化改造受关注，强调“专精特新”企业“应改尽改”；三是金融支持力度显著提升，“专精特新”企业融资渠道持续拓宽；四是服务与要素保障逐渐系统化，探索建立专精特新赋能体系。</p><p>　　多层次资本市场持续发力服务“专精特新”战略</p><p>　　2024年多层次资本市场继续发力，支持“专精特新”企业发展壮大。截至2024年末，共计1044家专精特新“小巨人”在A股上市，1096家“小巨人”在新三板挂牌，975家“小巨人”在区域股权市场挂牌展示，资本市场服务“专精特新”的梯度逐渐成型。企业融资方面，2024年近八成新上市公司为“专精特新”企业，超五成为专精特新“小巨人”。企业发展方面，2024年前三季度“专精特新”上市公司共实现营收2.32万亿元，同比增长3.73%，高于A股平均增速。分板块看，主板是“专精特新”企业主要的再融资渠道，定增募资额占比超五成；创业板是“专精特新”企业的主要上市目的地，2024年“专精特新”企业IPO数量居各板块首位；科创板“专精特新”企业创新能力突出，前三季度研发费用率高达13.22%，科创板“小巨人”平均发明专利授权数超71项；北交所“专精特新”含量高，超八成公司为“专精特新”企业，超五成为“小巨人”；新三板与区域股权市场充分发挥“蓄水池”作用，助力“专精特新”企业登陆A股市场。</p><p>　　“专精特新”企业已成为发展新质生产力的“排头兵”</p><p>　　“专精特新”企业是推进新型工业化、发展新质生产力的重要生力军。在新时代下培育新质生产力，“专精特新”企业应持续提升经营质量、提高市值管理水平，进而推动自身实现高质量发展。一方面，“专精特新”企业遵循新质生产力的发展思路，以创新为“灵魂”，推动战新产业强链补链，着力提升经营质量。工信部数据显示，截至2024年末，超八成“小巨人”企业分布在战新产业链上，超九成是国内外知名大企业的配套供应商，固基强链作用突出。2024年前三季度，“小巨人”上市公司总营收近万亿元，同比增长8.23%，增速显著领先A股市场；近八成实现盈利，超四成实现净利润正增长，经营质量持续提升。另一方面，“专精特新”企业合理利用并购重组、股权回购、股权激励等市值管理方式，推动公司质量和投资价值稳步提高。2024年“小巨人”上市公司在并购重组市场的活跃度不断提高，发生重大重组事件15起；已完成的股权回购规模超250亿元，同比增长超300%；实施股权激励计划超900项，同比增长超500%。</p><p>　　风险提示：政策超预期变化、流动性大幅收紧等。</p><p>　　</p> <p>来源: 开源证券</p></div>",
            "pub_date": "2025-02-05 13:54:25",
            "link": "https://www.hibor.com.cn/data/ab9380200c1655e9f3b3d0fef9c7a81a.html",
            "author": "hibor",
            "source": "hibor",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "医药行业周报：24Q4基金分析，创新药、并购重组等强逻辑个股获增持",
            "description": "<div class=\"abstruct-info\">\n<p>　　医药基金持仓分析：医药生物总市值占比总体持续下降。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn【慧博投研资讯】</a></font>2015Q1-2021Q2，医药生物总市值占全A总市值比例总体上持续提高，在2021Q2达到最高点10%；2021Q3-2024Q4，该比例总体维持向下趋势，2024Q4比例为6.2%，已低于18年水平。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn（慧博投研资讯）</a></font></p><p>　　医药生物基金重仓占比跌至低点。公募基金医药配置持续走低，2024Q4再度跌破至18年以来新低。2024Q4公募基金重仓总市值29579亿元，医药基金重仓总市值2538亿元，占比自2024Q1的13.6%调整至8.6%，公募持仓占比再创18年以来新低，配置水平低迷。</p><p>　　医药重仓标的及增减持情况分析：1）重仓市值排名来看，创新药、医疗器械仍为核心重仓配置板块。2024Q4医药基金重仓排名前五包括迈瑞医疗、恒瑞医药、药明康德、联影医疗、爱尔眼科；医药子版块分布来看，重仓前20中，化药及创新药共7家、医疗器械5家、CXO共3家。2）增持排名来看，创新药、强个股逻辑标的增持较多。2024Q4公募重仓医药增持排名前五的标的为人福医药、药明康德、贝达药业、联影医疗、昆药集团。其中创新药增持个股依旧较多，贝达、康弘、华东、科伦博泰等7家创新药公司位居前增持排名20，并购逻辑相关的人福、昆药位居前列，药明系三家标的均在榜上，医疗器械板块上榜4家。3）减持排名来看，此前上行较大及体量较大的标的减持相对较多。2024Q4公募医药减持排名前五的标的包括恒瑞医药、迈瑞医药、泰克医药、爱尔眼科、科伦药业，减持前5大标的均在持仓市值总量前7。</p><p>　　行情回顾：本周（2025年1月20日-2025年1月24日）申万医药生物板块指数上涨0.09%，跑输沪深300指数0.45%，医药板块在申万行业分类中排名第13位；2025年初至今申万医药生物板块指数下跌3.75%，跑赢沪深300指数1.16%，在申万行业分类中排名第20位。本周涨幅前五的个股为健友股份（12.61%）、奥赛康（12.01%）、祥生医疗（11.06%）、海泰新光（8.61%）、润达医疗（7.80%）。</p><p>　　整体投资策略及配置思路：随着央行政策和政治局会议后的股市情绪恢复，我们看好的4大主线: 1）超跌白马和港股，2）短期有积极变化、市净率较低，3）基本面扎实的企业，4）24H2业绩预期（wind一致预期）高增速的企业。子领域包含创新药、中药、原料药、部分医疗器械等。</p><p>　　月度投资组合：康方生物、再鼎医药、康诺亚、和黄医药、人福医药、兴齐眼药、昆药集团、开立医疗、山东药玻、浙江医药、热景生物。</p><p>　　风险提示：行业政策风险；供给端竞争加剧风险；市场需求不及预期风险。</p> <p>来源: 德邦证券</p></div>",
            "pub_date": "2025-02-05 12:57:20",
            "link": "https://www.hibor.com.cn/data/f53faea74202d2af14b32237fde4b790.html",
            "author": "hibor",
            "source": "hibor",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "社会服务行业春节数据解读暨2月投资策略：黄金周出行热度不减，入境游、下沉消费结构亮点突出",
            "description": "<div class=\"abstruct-info\">\n<p>　　黄金周出行热度不减，入境游、下沉消费结构亮点突出</p><p>　　假期港/美股行情回顾：假期港股消费龙头、美股AI+教育领涨。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn【慧博投研资讯】</a></font>节前A股收盘至今（2025.1.28-2.4）恒生科技涨6.2%，节后开盘首日港股震荡，但次日即因关税渐进式加征而大涨，叠加春节出行热度不减、假期国产模型持续升温，港股消费龙头、AI+教育应用方向整体领涨。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn（慧博投研资讯）</a></font></p><p>　　春节消费总览：春运期间居民出行热度不减，春节黄金周在高基数下呈现韧性。2025春运前21天全社会跨区域人员流动量同比增长7.7%，其中铁路、民航客流各增长6.7%、6.3%，与节前预测相符。春节假期跨区域流动量同比增长0.8%，考虑去年春节假期从初一起8天，今年从除夕起8天，参考历史数据除夕和初一一般出行人次偏少，由此带来并不低的基数；同口径初一-初七客流增长6.2%，出行韧性再获验证。</p><p>　　结构亮点：跨境游、反向小城旅游、返乡下沉消费成为假期出行亮点。1、跨境游景气度延续，外国人入境游订单翻倍式增长。根据携程平台数据，春节假期跨境游整体订单同比去年增长三成，其中入境游门票订单同比去年增长180%，入境游酒店订单同比增长超6成（2024年10-11月外国人入境客流增长45%）。2、非遗热门小城表现突出。2024年年底“春节——中国人庆祝传统新年的社会实践”被列入人类非物质文化遗产代表作名录，携程平台上汕头、莆田、开封、黄山春节旅游订单同比增幅达两至四成。3、返乡带动县城下沉消费好于全国大盘。去哪儿数据显示，今年春节县城酒店预订量同比增长四成，其中高星酒店预订同比去年春节翻番，预订占比超连锁和低星酒店。</p><p>　　子行业：景区整体相对平稳，本地消费客流景气。景区：部分景区天气因素扰动叠加去年基数不低，整体自然景区客流表现相对平稳，其中峨眉山表现相对突出。演艺：春节假期宋城演艺13大千古情春节总场次增长约6%，西安、上海项目表现突出，其他有所回落。酒店：春节市场预计整体呈现“价格平稳、地域分化”的特点，其中小众目的地的酒店市场增长显著，山西忻州、云南临沧预订量同比增长超50%。免税：春节前五天三亚国际免税城累计接待超30万人次，大年初四单日客流突破7.6万人次。本地消费：假期前三天全国900多个商圈客流量比去年春节同期增加21%，假期前四天商务部重点监测零售餐饮销售额同比增长5%，电影票房创新高，以旧换新带动家电、3C等消费品双位数增长。</p><p>　　投资建议：春节黄金周数据在去年高基数下平稳增长再次验证居民出游意愿与出行韧性，结构上下沉消费活力好于整体，免签政策叠加首个非遗春节带动假期入境游高景气，后续国内居民消费力修复与入境旅游在政策提振下均存在较大潜力。目前经济环境和市场风格下建议配置携程集团-S、美团-W、海底捞、同庆楼、学大教育、天立国际控股、亚朵、同程旅行、北京人力、峨眉山A等；中线优选中国中免、美团-W、华住集团-S、学大教育、携程集团-S、海底捞、天立国际控股、同程旅行、北京人力、BOSS直聘、科锐国际、锦江酒店、同庆楼、行动教育、宋城演艺、百胜中国、九毛九、粉笔、海南机场、米奥会展、传智教育、君亭酒店、王府井、峨眉山A、天目湖、三特索道、黄山旅游、广州酒家、首旅酒店、中青旅、奈雪的茶等。</p><p>　　风险提示：宏观、疫情等系统性风险；政策风险；收购低于预期、股东减持风险、市场资金风格变化等。</p> <p>来源: 国信证券</p></div>",
            "pub_date": "2025-02-05 11:45:50",
            "link": "https://www.hibor.com.cn/data/ec1cac6cdc3f3946c100d3647c23891f.html",
            "author": "hibor",
            "source": "hibor",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "建筑材料行业深度报告：居住产业链2024Q4公募基金持仓仍处低位，建筑、建材行业有所增配",
            "description": "<div class=\"abstruct-info\">\n<p>　　投资要点</p><p>　　我们筛选了198支居住产业链A股（其中地产行业52支、建筑行业92支、建材行业54支）作为样本标的，并进一步细分为3大类10个二级行业（基建地产前周期：房地产开发、设计咨询、基建房建、水泥；基建地产后周期：玻璃玻纤、装修、装修建材、房地产服务；其他：其他材料、专业工程），进行2024年四季度产业链行情回顾和公募基金重仓持股分析。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn【慧博投研资讯】</a></font></p><p>　　行业持仓：我们选取了股票型基金中的普通股票型基金（剔除被动指数型基金和指数增强型基金）、混合型基金中的偏股混合型、平衡混合型和灵活配置型基金作为样本基金。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn（慧博投研资讯）</a></font></p><p>　　居住产业链重仓持股市值占A股比仍处于历史低位，建筑、建材有所加仓。本季度全部A股中居住产业链（申万新分类下地产、建筑、建材行业）基金重仓持股市值占A股比为2.14%，环比上一季度-0.32pct，超配比例-2.10%（近10年百分比排位44%），环比上一季度-0.21pct。</p><p>　　建筑、建材行业有所增配。申万新分类下地产、建筑、建材行业本季度基金重仓持股市值占A股比分别为0.96%、0.63%、0.55%（近10年百分比排位分别为3%、49%、13%），环比上一季度分别-0.55pct、+0.17pct、+0.06pct，地产、建材行业基金重仓持股市值占A股比处于10年以来相对低位；地产、建筑和建材行业超配比例分别为-0.46%、-1.45%、-0.19%（近10年百分比排位分别为41%、74%、46%），环比上一季度分别-0.40pct、+0.10pct、+0.09pct，建筑、建材行业低配比例均略有缩小。在一级行业的分析中加入轻工、家电行业进行对比。轻工行业本季度基金重仓持股市值占流通盘比为0.97%，环比上一季度+0.09pct；家电行业本季度基金重仓持股市值占流通盘比为5.41%，环比上一季度0.07pct。轻工、家电行业本季度重仓持股市值占流通盘比位于近10年的百分比排名分别为8%、85%。</p><p>　　自主划分的二级行业中，其他材料、专业工程、玻璃玻纤有所加仓，房地产开发减仓较多。基金重仓持股市值占流通盘比环比上一季度增加最多的三个子行业分别为其他材料（+0.32pct）、专业工程（+0.26pct）、玻璃玻纤（+0.24pct），减少最多的三个子行业分别为房地产开发（-1.76pct）、房地产服务（-0.10pct）、设计咨询（-0.09pct）。基金重仓持股市值占流通盘比近10年百分比排位最高的三个子行业分别为水泥（95%）、专业工程（67%）、基建房建（62%），近10年百分比排位最低的三个子行业分别为装饰装修（0%）、装修建材（13%）、设计咨询（13%）。进一步在二级子行业的分析中加入家居、厨电子行业对比。家居行业本季度基金重仓持股市值占流通盘比为2.08%，环比上一季度0.19pct；厨电行业本季度基金重仓持股市值占流通盘比为1.12%，环比上一季度-0.13pct。家居、厨电行业本季度重仓持股市值占流通盘比位于近10年的百分比排名分别为10%、8%。</p><p>　　建筑、建材行业持仓集中度有所下降。申万新分类下地产、建筑、建材行业中获公募基金重仓持有的股票共有99支（占全行业37%），环比上一季度+8支，持仓集中度下降。其中，申万分类下地产、建筑和建材行业获样本基金重仓持有的股票分别为34支、42支、23支（占各自行业的33%、25%、32%），环比上季度分别-2支、+7支、+3支。</p><p>　　个股持仓：</p><p>　　（1）个股持仓市值：本季度居住产业链公募基金重仓持仓总市值前五的股票依次是保利发展（52.1亿元）、中国建筑（34.0亿元）、招商蛇口（28.9亿元）、海螺水泥（28.0亿元）、鸿路钢构（22.5亿元）。</p><p>　　房地产行业前五的股票分别为保利发展（52.1亿元）、招商蛇口（28.9亿元）、滨江集团（11.1亿元）、万科A（7.1亿元）、金地集团（7.0亿元），建筑行业前五的股票分别为中国建筑（34.0亿元）、鸿路钢构（22.5亿元）、金诚信（10.7亿元）、隧道股份（5.0亿元）、中国化学（4.3亿元），建材行业前五的股票分别为海螺水泥（28.0亿元）、三棵树（16.7亿元）、中国巨石（6.2亿元）、东方雨虹（6.2亿元）、兔宝宝（5.6亿元）。</p><p>　　（2）个股持仓变动：按基金重仓持股占流通盘比计算，环比上一季度加仓幅度前五名依次为志特新材（+4.69pct）、鸿路钢构（+3.99pct）、濮耐股份（+3.46pct）、华图山鼎（+1.89pct）、龙元建设（+1.69pct）；减仓幅度前五名依次为华发股份（-3.80pct）、城建发展（-3.68pct）、金地集团（-2.72pct）、长海股份（-2.69pct）、滨江集团（-2.34pct）。其中，房地产行业：按基金重仓持股占流通股比计算，环比上一季度加仓幅度前五名依次为南都物业（+0.44pct）、新大正（+0.34pct）、金融街（+0.32pct）、张江高科（+0.31pct）、华侨城A（+0.19pct）；减仓幅度前五名依次为华发股份（-3.80pct）、城建发展（-3.68pct）、金地集团（-2.72pct）、滨江集团（-2.34pct）、保利发展（-1.63pct）。建筑行业：按基金重仓持股占流通股比计算，环比上一季度加仓幅度前五名依次为鸿路钢构（+3.99pct）、华图山鼎（+1.89pct）、龙元建设（+1.69pct）、三联虹普（+0.71pct）、东华科技（+0.56pct）；减仓幅度前五名依次为安徽建工（-0.73pct）、隧道股份（-0.50pct）、中材国际（-0.49pct）、中国中铁（-0.15pct）、建发合诚（-0.09pct）。建材行业：按基金重仓持股占流通股比计算，环比上一季度加仓幅度前五名依次为志特新材（+4.69pct）、濮耐股份（+3.46pct）、瑞尔特（+0.93pct）、塔牌集团（+0.86pct）、海螺水泥（+0.53pct）；减仓幅度前五名依次为长海股份（-2.69pct）、江山欧派（-2.32pct）、赛特新材（-1.60pct）、科顺股份（-1.51pct）、伟星新材（-1.13pct）。</p><p>　　风险提示：地产信用风险失控、政策定力超预期、数据统计存在允许范围内偏差的可能。</p><p>　　</p> <p>来源: 东吴证券</p></div>",
            "pub_date": "2025-02-05 11:28:24",
            "link": "https://www.hibor.com.cn/data/cf0bca646ec35dc6980294de8065c269.html",
            "author": "hibor",
            "source": "hibor",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "电力设备与新能源行业人形机器人深度报告之六：从电动车复盘看机器人行情演绎，奇点已至，万亿空间",
            "description": "<div class=\"abstruct-info\">\n<p>　　◆电动车行情波澜壮阔三部曲：从主题到兑现，投资分化。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn【慧博投研资讯】</a></font>1）2010-2014年0-1纯主题投资：消息催化，涨幅空间1倍，沾边普涨（电池电机电控充电桩），特斯拉映射标的领涨；2）2015-2017年1-10初期放量行情：政策推动放量，涨幅2-3倍，供应紧缺环节领涨（电池、资源和材料）；3）2019年底-2021年底10-n确定性放量大行情：车型推动放量，涨幅10倍，格局好、壁垒高的龙头成长为大市值公司（电池、材料、核心零部件）。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn（慧博投研资讯）</a></font></p><p>　　◆当前人形机器人相当于2012-2014年电动车，处于0-1放量前夕。从特斯拉电动化看，1）2004-2008年Roadster的时代：对标2022-2024年人形机器人测试阶段；2）2012-2015年的Model SX时代：对标2025-2026年人形机器人tob端放量阶段，实现品牌积累及规模化量产；3）2017-至今的Model 3Y时代：对标2027年人形toc端放量阶段。从销量端看，2012-2014年中国和美国电动车均突破万台销售，初步起量，而机器人在2025年也将实现1.5-2万辆（中国人形机器人1万+、特斯拉0.5万台），实现0-1。</p><p>　　◆人形机器人与电动车相当有十万亿空间，且0-1过程加速，同时投资主线放大至1+N。全球制造业从业人员4亿人，生活服务从业人员6亿人，按照制造业机器人渗透率16%、服务业机器人渗透率10%，1.5台机器人替代1个工位，且预计其他领域新增1.5亿台需求，对应全球人形机器人每年新增需求0.8亿台，单台价格12万/台，对应市场空间10万亿元。同时，有电动车成功经验在前，且软硬件具备基础（汽车和工控供应链、智驾和大模型），初期放量速度快于电动车。并且，电动车与机器人均由特斯拉引领，初创公司和人工智能在人形机器人领域布局激进，与特斯拉差距缩小，如华为、英伟达、智元、宇树等，投资主线从1放大至1+N。</p><p>　　◆从普涨收敛至绑定龙头、价值高、壁垒高环节领涨。我们最看好三个方向：1）绑定龙头供应链：特斯拉人形机器人进展最确定，产品性能软硬件最优，放量最早，特斯拉供应链弹性最大。其次为潜力厂商，如英伟达、华为（或提供整体解决方案授权方式）、智元、宇树等。2）壁垒最高的核心环节：零部件来看，壁垒排序滚柱丝杠&gt;传感器&gt;谐波减速器&gt;空心杯电机。3）产业趋势和方向：灵巧手方案变化、传感器方案变化</p><p>　　◆投资建议：机器人当前类比2014年电动车，即将量产，开启10年产业大周期，强烈看好板块！1）T链：首推确定性龙头Tier1【三花智控】【拓普集团】，Tier2【鸣志电器】【绿的谐波】【双环传动】，关注【北特科技】【浙江荣泰】【五洲新春】【斯菱股份】【大业股份】【震裕科技】等；2）HW链：推荐【雷赛智能】【赛力斯】【富临精工】，关注【兆威机电】【蓝黛科技】【禾川科技】【豪能股份】【科力尔】【埃夫特】【拓斯达】等。3）NV链：推荐【伟创电气】【科达利】等。4）宇树：推荐【曼恩斯特】，关注【长盛轴承】【卧龙电驱】【奥比中光】。</p><p>　　◆风险提示：量产进展不及预期；产业链降本不及预期；行业关键技术突破不及预期；市场竞争加剧</p> <p>来源: 东吴证券</p></div>",
            "pub_date": "2025-02-05 11:16:40",
            "link": "https://www.hibor.com.cn/data/d784d695a367df743fc8234cc5dc6c27.html",
            "author": "hibor",
            "source": "hibor",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "建筑材料行业跟踪周报：科技逐渐自信，地产链或迎来估值修复",
            "description": "<div class=\"abstruct-info\">\n<p>　　本周（2025.1.20–2025.1.27，下同）：本周建筑材料板块（SW）涨跌幅1.31%，同期沪深300、万得全A指数涨跌幅分别为0.54%、0.88%，超额收益分别为-1.85%、-2.19%。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn【慧博投研资讯】</a></font></p><p>　　大宗建材基本面与高频数据：（1）水泥：本周全国高标水泥市场价格为406.5元/吨，较上周-4.0元/吨，较2024年同期+41.2元/吨。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn（慧博投研资讯）</a></font>较上周价格持平的地区：长三角地区、华北地区、华东地区、西北地区；无较上周价格上涨的地区；较上周价格下跌的地区：长江流域地区（-4.3元/吨）、泛京津冀地区（-6.7元/吨）、两广地区（-15.0元/吨）、东北地区（-6.7元/吨）、中南地区（-11.7元/吨）、西南地区（-6.0元/吨）。本周全国样本企业平均水泥库位为56.3%，较上周-1.1pct，较2024年同期-10.5pct。全国样本企业平均水泥出货率（日发货率/在产产能）为13.3%，较上周18.9pct，较2024年同期-17.1pct。（2）玻璃：卓创资讯统计的全国浮法白玻原片平均价格为1396.0元/吨，较上周+11.7元/吨，较2024年同期-645.2元/吨。卓创资讯统计的全国13省样本企业原片库存为3789万重箱，较上周-126万重箱，较2024年同期+815万重箱。（3）玻纤：无碱粗纱市场价格基本稳定，市场走货逐步放缓。本周无碱池窑粗纱市场价格基本稳定，各池窑厂春节假期前，走货逐步放缓，前期部分贸易商少量备货，但社会库存整体尚处低位，多数深加工厂资金压力较大下，备货意向一般。电子纱市场价格弱稳维持，多数厂出货进一步放缓。本周电子纱市场价格无调整，个别企业成交维持灵活成交操作。</p><p>　　周观点：（1）长期以来，科技卡脖子成为中等收入陷阱的同义词。但中国科技产业持续逆流而上，春节期间大火的DEEPSEEK、宇树机器人将成为国人科技自信的标志性产品。既然科技已突破，那中等收入陷阱的迷思也应当破除。地产链的估值也将被修复。仍然首选居住产业链的消费端公司，例如兔宝宝、欧派家居、北新建材、箭牌家居、奥普科技、伟星新材、公牛集团、萤石网络等。其次是利空出尽的工程材料公司，例如坚朗五金、三棵树、东方雨虹等，再次是财政加杠杆的方向也值得关注，西南水利建设相关的民爆和水泥公司，供给侧比较集中，例如易普力、华新水泥等。（2）在相当长的时间里，地产链将经历去产能的磨底出清过程。转型压力和IPO政策收紧增加了并购重组双方的意愿，但年初的对价差异较为明显。随着全年业绩落地和经济预期统一，双方对价差异有望明显收窄。类似于1999年和2015年，资本市场对并购重组的认可也是推波助澜的作用。我们建议关注存在并购重组预期的个股，或者已经公告持有新兴产业资产的个股，例如上海港湾（控股钙钛矿卫星组件）、诚邦股份（控股存储模组资产）、上峰水泥（参股半导体芯片资产）等等。（3）全球范围内中国将逐渐增加话语权和提供公共产品，中国企业也将获得加快参与全球建设的机会。而且美元降息趋势下，新兴地区经济建设有望进入快车道，工业投资、基础设施建设将升温。综合新兴国家收入占比以及本土化的能力和技术实力，推荐上海港湾、中材国际、中国交建、米奥会展（与中小盘、社服共同覆盖）。另外，在脱钩断链和可能的高关税政策下，关注以欧美为主要消费地且海外产能占比高的公司，例如爱丽家居、中国巨石、匠心家居等。</p><p>　　大宗建材方面：水泥：（1）节前随着市场需求临近尾声，水泥价格跌幅明显收窄，个别区域如广东珠三角地区为了稳定盈利，企业主动推涨价格，欲以涨止跌。但节前行业库存保持历史同期中低位水平，有望为年后复工价格反弹奠定良好基础，可关注节后复工实物需求释放以及实际错峰执行时间等情况。（2）中期来看，水泥行业大面积亏损状态有望持续强化供给侧控制力度。结合错峰方案优化及实物需求企稳，四季度供需平衡效果已有显著改善，价格底部反弹幅度可观，我们认为将对2025年供给侧自律控制形成正反馈，盈利中枢有望较2024年反弹。（3）水泥企业市净率估值处于历史底部。中期财政政策发力也有望支撑实物需求止跌企稳，行业景气低位为进一步的整合带来机遇。9月生态环境部就碳市场工作方案征集意见，水泥行业年底有望被纳入全国碳市场，我们认为初期虽然对成本曲线影响有限，但有望改变后段企业预期。结合产能置换办法修订以及产能产量管控等产业政策的进一步出台，有望加速过剩产能出清和行业整合。（4）龙头企业综合竞争优势凸显，中长期有望受益于行业格局优化，估值有望迎来修复，推荐全国和区域性龙头企业：海螺水泥、华新水泥、上峰水泥、冀东水泥，建议关注天山股份、塔牌集团等。</p><p>　　玻纤：（1）中期粗纱盈利底部向上。行业盈利仍处底部区域，二三线企业普遍处于亏损状态，行业低盈利将持续制约产能投放节奏，需求侧国内风电、热塑等领域继续增长，行业供需平衡修复有持续性，行业景气有望呈现震荡上行态势，若国内基建及海外需求超预期，中低端产品上涨空间有望进一步打开。（2）随着风电、热塑产品提价逐步落实，中低端品类企业挺价意愿强，阶段性仍需观察新增产能释放情况，中高端产品占比更高的龙头企业盈利改善幅度更大。（3）中长期落后产能出清、玻纤成本的下降也为新应用的拓展和渗透率的提升提供催化剂，随着风电、新能源车等领域用量持续增长，光伏组件边框等新兴应用领域持续拓展，行业容量有望持续增长，产品结构的调整有利于龙头构筑新的壁垒，盈利稳定性也将提升。（4）当前龙头估值处于历史低位，供需平衡修复、结构性盈利提升有望推动估值修复。推荐中国巨石，建议关注中材科技、山东玻纤、长海股份、国际复材、宏和科技等。</p><p>　　玻璃：春节淡季浮法产线冷修有望加快，行业供需矛盾将得到缓解，叠加当前下游社会库存仍处较低水平，部分投机性需求释放，阶段性价格企稳反弹，我们认为应进一步观察产线冷修释放情况，供给收缩幅度决定后续价格反弹持续性和空间。中期供需平衡仍面临需求下行压力，但浮法玻璃龙头享有硅砂等资源等中长期成本优势，享受超额利润，有望受益于行业产能的出清，叠加光伏玻璃等多元业务的成长性，继续推荐旗滨集团，建议关注南玻A等。</p><p>　　装修建材方面：近期板块表现有所反复，仍处在磨底阶段，市场对地产链的需求担忧仍未有改变，对地产数据改善预期也较弱，此前政治局会议表态“要促进房地产市场止跌回稳”，政策拐点之下我们认为后续房地产政策有望继续加码；此前化债、保交楼等政策，对地产链上信用和资产负债表的修复影响积极。从基本面来看，市场需求仍较弱，特别是竣工需求，预计四季度收入端仍承压，部分品类市场价格竞争有所缓解，低基数下部分公司收入端有望企稳，而成本端原材料价格平稳，关注毛利率拐点。参考消费建材板块历史经验和当前的竞争态势来看，在地产行业资金缓和+信心从底部逐渐恢复的阶段，部分公司或将率先借助渠道领先布局、经营效率优势或融资加杠杆等进一步提升份额、进入新的扩张周期，发货或订单增速的拐点可作为右侧信号。推荐北新建材、兔宝宝、伟星新材、箭牌家居、东方雨虹等，建议关注垒知集团、中国联塑、三棵树等。</p><p>　　风险提示：地产信用风险失控、政策定力超预期。</p><p>　　</p> <p>来源: 东吴证券</p></div>",
            "pub_date": "2025-02-05 10:27:36",
            "link": "https://www.hibor.com.cn/data/6d816e4b08831b6c1f97e79da28c606b.html",
            "author": "hibor",
            "source": "hibor",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "机械设备行业：工程机械海外市场分析之非洲，中资企业对外投资进程加速，矿山+基建需求增长未来可期",
            "description": "<div class=\"abstruct-info\">\n<p>　　投资要点</p><p>　　◆中非工程机械贸易伙伴关系持续加深。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn【慧博投研资讯】</a></font>2019-2024年我国出口非洲（中国外交部公示的非洲54个国家/地区）工程机械金额快速增长，从2019年47.8亿元增长至2024年的178.8亿元，期间CAGR达30%。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn（慧博投研资讯）</a></font>2024年，我国出口非洲工程机械金额达179亿人民币，同比增长50%。从占比来看，非洲占我国工程机械出口金额比例再创新高，2024年出口金额占比达17%。综合来看，非洲市场在我国工程机械出口结构中的占比越来越高，显示出非洲市场对我国工程机械的需求不断增长，同时也反映了我国工程机械在非洲市场的竞争力和影响力在不断提升。</p><p>　　◆矿业开发+城镇化驱动，中大型工程机械需求旺盛。非洲拥有全球近2/3的矿产储备，且具备充足的动力去推动矿产资源开发以参与国际分工。矿业的开发带动非洲经济增长的同时大幅推进非洲基础设施建设，尤其是在交通、能源和城市化项目中。非洲以矿业+基建投资带动的工程机械需求主要集中于中大型挖掘机、推土机，产品均价高、盈利能力出色，带来广阔的市场空间。</p><p>　　◆ “一带一路”合作深化，中国企业加速非洲投资进程。随着“一带一路”倡议的深入推动，中国企业加大在非洲的投资比重，与非洲国家在基础设施建设领域的合作日益紧密，共同推动非洲的工业化进程，也为中国工程机械企业在非洲的长期发展奠定了坚实的基础。随着我国工程机械主机厂海外渠道布局的持续推进，产品力的不断提升，近年来龙头主机厂在非洲地区均实现快速增长。我们认为，这主要受益于①中国挖掘机产品的品质得到了国际市场的认可，这为在非洲市场的推广和销售打下了坚实的基础；②中国矿山机械的不断突破为非洲市场尤其是矿山机械市场提供了更多可能性；③在“一带一路”倡议的背景下，中国企业有机会参与到非洲的基础设施建设中。展望未来，随着中国品牌海外渠道的持续开拓和产品力的逐渐验证，看好国内主机厂出口非洲地区长期市场空间。</p><p>　　◆投资建议：2024年国内龙头主机厂均于非洲地区实现高速增长，结合国内主机厂积极的海外开拓意愿和非洲矿业开采&amp;城镇化带动的市场本身的扩张趋势，我们认为非洲工程机械市场有望成为国内主机厂未来数年实现业绩增长的核心驱动力量之一。推荐三一重工、中联重科、柳工、山推股份、恒立液压。</p><p>　　◆风险提示：行业周期波动，基建及地产项目落地不及预期，政策不及预期，地缘政治加剧风险。</p> <p>来源: 东吴证券</p></div>",
            "pub_date": "2025-02-05 10:05:40",
            "link": "https://www.hibor.com.cn/data/bddbfc2fc1044a97f18f36cde4b0617b.html",
            "author": "hibor",
            "source": "hibor",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "商贸零售行业快评：消费增长新范式思考系列，破局“降级与内卷”的增长新模型，从老铺黄金和毛戈平谈起",
            "description": "<div class=\"abstruct-info\">\n<p>　　事项：</p><p>　　近两年来，老铺黄金和毛戈平等国内高端品牌在大环境承压下持续呈现逆势高速增长，打破了当前市场主流的“消费降级”和“内卷式竞争”的论调，两者与国内同业差异化的品牌定位，商业模式及经营杠杆，均有着一定的研究和参考意义。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn【慧博投研资讯】</a></font></p><p>　　国信零售观点：首先，虽然宏观环境波动带来了一定的消费力承压，但在当前国内消费品供给日益丰富以及需求结构多元化的背景下，一个产品的价值已不能简单在同品类赛道下去比较，老铺与毛戈平的高定价均是基于特定客群和特定场景的定位，通过精细化打磨的产品和服务，强化消费者认同，最终形成强有力的品牌忠诚度和竞争壁垒，从而带来业绩增长空间的确定性。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn（慧博投研资讯）</a></font></p><p>　　其次，不同于此前的加盟开店以及电商获客两种经营杠杆模式，老铺黄金与毛戈平依托强品牌和强服务，实现了公域裂变获客与私域成交沉淀的结合，既保障了营销传播裂变效率，也提升了盈利能力，从而带来当前业绩的高成长性。</p><p>　　最后，由于两者的特殊品牌定位和差异化经营模式，所带来的在当前环境下较为稀缺的增长确定性和高成长性。我们认为在定价过程中应更多考虑其自身远期空间的测算来判断，而淡化同品类但模式传统的同业标的估值基准，并在后续基于其潜在竞争格局变化，用户群体需求变化以及自身品牌力变化来进行修正。</p><p>　　整体来看，我们继续看好老铺黄金以及毛戈平等国内细分高端品牌，通过前期坚守定位下积累的品牌优势，并在当前通过差异化经营杠杆实现破圈式增长，从而在目前的消费市场环境下，独具高增长的稀缺性。</p><p>　　风险提示：</p><p>　　消费行业持续承压；行业竞争环境恶化，价格战影响企业利润；品牌出现公共舆情事件影响品牌力。</p> <p>来源: 国信证券</p></div>",
            "pub_date": "2025-02-05 09:24:47",
            "link": "https://www.hibor.com.cn/data/28065691ec553e2306c3328048008b56.html",
            "author": "hibor",
            "source": "hibor",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "建筑装饰行业研究周报：专项债券发行提速，关注低估值央国企蓝筹",
            "description": "<div class=\"abstruct-info\">\n<p>　　考核体系持续优化，关注央国企并购重组机会</p><p>　　2024年12月23日至24日，国务院国资委召开中央企业负责人会议，结合当前形势任务，国务院国资委研究决定，2025年“一利五率”经营指标体系总体稳定、个别优化，“一利”仍为利润总额，用“营业收现率”替换“营业现金比率”，总要求是“一增一稳四提升”，即利润总额稳定增长，资产负债率保持总体稳定，净资产收益率、研发经费投入强度、全员劳动生产率、营业收现率同比提升。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn【慧博投研资讯】</a></font>要切实抓好国有企业经济布局优化和结构调整，聚焦主责主业，加快国有资本“三个集中”，加大力度推进战略性重组和专业化整合，推动重点产业提质升级。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn（慧博投研资讯）</a></font>要切实抓好国有企业改革深化提升行动高质量完成，推动中国特色现代企业制度落深落实，深化企业三项制度改革，以穿透式监管为抓手完善监管体系，国务院国资委将深入推进“一业一策、一企一策”考核，聚焦科技创新强化出资人政策支持，健全全级次穿透式监管体系，更好发挥在构建新型生产关系中的重要作用。</p><p>　　专项债加速发行，再融资专项资金逐步到位</p><p>　　截至1月22日，我国1月新增专项债发行额约1980亿元，已超过24年1月发行的568亿元，目前已披露的25年一季度新增专项债发行计划超过4800亿元，考虑到此前在24年末，国务院办公厅提出将在10个省份开展专项债券项目“自审自发”试点背景下，25Q1专项债加速发行及使用效率的提升有望对基建投资起到带动作用。1月全国已有15个省市公告发行再融资专项债置换存量隐性债务，合计发行2349亿元，我们认为资金到位后建筑企业报表仍有较大的改善空间（冲回减值、节约利息、修复估值、提振分红），25年政府或将更加关注央企，央企在逆周期调控中或将发挥更大作用。</p><p>　　行情回顾</p><p>　　根据总市值加权平均统计，本周（0119-0204）建筑指数下跌0.14%，沪深300板块上涨0.50%，子板块中仅央国企蓝筹居多的房建和基建公司分别录得0.67%、0.23%的正收益。本周涨幅居前的标的有：宝鹰股份（+10.13%）、垒知集团（+10.08%）、正和生态（+9.99%）、华建集团（+5.83%）、大千生态（+3.87%）。</p><p>　　投资建议</p><p>　　我们认为25年基建投资结构性和区域性特征明显，真实需求主导的水利投资、铁路和航空等重大交通领域建设、城市综合管廊等领域或有望保持较高增长，经济发达区域基建仍保持高增长，重视三条主线投资机会，1）主线一：沿基建+化债+破净价值提升布局板块机会；2）主线二：关注顺周期专业工程的潜在高弹性；3）主线三：聚焦海外高景气区域，重点关注高质量出海国际工程板块。</p><p>　　风险提示：基建&amp;地产投资超预期下行；央企、国企改革提效进度不及预期；城中村改造落地不及预期。</p><p>　　</p> <p>来源: 天风证券</p></div>",
            "pub_date": "2025-02-04 23:25:36",
            "link": "https://www.hibor.com.cn/data/6e886efd6ec2e11b6fb99bb3dc750a28.html",
            "author": "hibor",
            "source": "hibor",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "医药生物行业跟踪周报：2025年哪些医药股会取得显著超额收益？",
            "description": "<div class=\"abstruct-info\">\n<p>　　投资要点</p><p>　　春节期间美股生物技术XBI指数4个交易日微涨0.23%，其中MESO、CORT等个股涨幅较大；港股生物科技指数涨幅基本持平，其中荃信生物、和铂医药涨幅领先。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn【慧博投研资讯】</a></font>春节前周、年初至今A股医药指数涨幅分别为0.07%、-3.77%，相对沪深300的超额收益分别为-0.05%、-0.78%；A股医药春节前周原料药（+1.00%）、化药（+0.88%）、医药商业（+0.81%）等股价涨幅较大，中药（-1.68%）、医疗器械（-0.46%）等股价跌幅较大；春节前周A股涨幅居前健友股份（+12.87%）、南卫股份（+11.78%）、润达医疗（+9.00%），跌幅居前长药控股（-21.99%）、双成药业（-18.01%）、赛托生物（-15.39%）。<font style=\"display:none;\"><a href=\"https://www.hibor.com.cn/\">https://www.hibor.com.cn（慧博投研资讯）</a></font></p><p>　　2025年医药板块能否具有超额收益？截至目前医药板块跌幅约3.8%、处于中位数位置，医药板块仍有望走出显著超额的原因为：1、仿制药及类似物采集影响边际减弱。2024年针对中药、耗材及第十批集采落地，集采影响全部扩面，但2025年500个品种的集采目标进入尾声。另外1月27日医保局印发《按病种付费医疗保障经办管理规程》，重点强调加强按病种付费与医疗服务价格改革、集采、国谈等协同，同时做好即时结算等方面内容。2、医疗商业保险很可能催化创新药大行业。医保局积极推动丙类目录征求意见很可能一季度落地，有助于商保大发展。3、Q4持仓结构再创新低。医药板块4年连续下跌，其占全A比例从2021年的10%下降至今6%、非医药公募基金Q4医药持仓估计约5%，市值增加最多的为人福医药、药明康德、贝达药业、联影医疗、昆药集团等。4、医药估值水平颇具吸引力。我们预测2025年医药板块PE约21倍，其中医药行业、中药、医疗器械估值分别为11倍、17倍、20倍，处于较低水平。综上分析，重点推荐创新药、中药、CXO及医疗器械等板块。</p><p>　　具体思路：1）创新药领域：百利天恒、信达生物、益方生物、三生国健、奥赛康、百济神州、海思科、和黄医药、亚盛医药、迪哲医药、泽璟制药-U、恒瑞医药等；2）中药领域：佐力药业、江中药业、华润三九、济川药业、马应龙、方盛制药等；3）CXO及科研服务领域：药明康德、药明合联、康龙化成、凯莱英等；4）高端制剂领域：人福医药、恩华药业、苑东生物等；5）临床及仿制药CRO：诺思格、泰格医药等6）GLP1产业链领域：诺泰生物、博瑞医药等；7）CGM领域：鱼跃医疗、三诺生物等；8）原料药领域：奥锐特、千红制药、华海药业、普洛药业等；9）医疗耗材领域：惠泰医疗、大博医疗、三友医疗等；10）仿创药领域：人福医药、恩华药业、仙琚制药、苑东生物、信立泰等；11）科研服务领域：药康生物、奥浦迈、百普赛斯等。</p><p>　　风险提示：药品或耗材降价超预期；医保政策风险等；产品销售及研发进度不及预期</p><p>　　</p> <p>来源: 东吴证券</p></div>",
            "pub_date": "2025-02-04 22:34:45",
            "link": "https://www.hibor.com.cn/data/e26baf2db2a84abc89bba64a637577b9.html",
            "author": "hibor",
            "source": "hibor",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}