{
    "data": [
        {
            "title": "<![CDATA[Pharmaceutical Executive Daily: FDA Approves Braftovi]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Welcome to <em>Pharmaceutical Executive</em> Daily, your quick briefing on the top news shaping the pharmaceutical and life sciences industry.</p><p class=\"\">In today’s <em>Pharmaceutical Executive</em> Daily, the FDA approves Braftovi for mutant metastatic colorectal cancer, Novo Nordisk and GSK announce major deal activity in a mergers and acquisitions roundup, and UK regulators confiscate thousands of doses of illegal weight-loss medicines.</p><p class=\"\">The FDA has approved Braftovi for patients with BRAF V600E-mutant metastatic colorectal cancer. The decision expands treatment options in a genetically defined subset of colorectal cancer, reinforcing the continued momentum behind biomarker-driven oncology strategies and combination therapy approaches in advanced disease.</p><p class=\"\">In deal news, Novo Nordisk has entered a $2 billion partnership with Vivtex, further strengthening its pipeline through external innovation. Meanwhile, GSK announced a $950 million acquisition of 35Pharma Inc., signaling continued appetite for targeted bolt-on acquisitions to expand specialty and pipeline assets. Together, the transactions reflect sustained strategic investment as large pharmaceutical companies seek to offset competitive pressures and future revenue gaps.</p><p class=\"\">Finally, the Medicines and Healthcare products Regulatory Agency has confiscated approximately 2,000 doses of illegal weight-loss drugs in a recent enforcement action. The move underscores growing regulatory vigilance as demand for weight-management therapies surges and unauthorized or counterfeit products proliferate in both online and offline markets.</p><p class=\"\">Thanks for listening to <em>Pharmaceutical Executive</em> Daily. For more updates and in-depth analysis, visit PharmExec.com.</p><p class=\"\"></p> </div>",
            "link": "https://www.pharmexec.com/view/daily-fda-approves-braftovi",
            "pub_date": "2026-02-26 01:52:37",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Medicines and Healthcare Products Regulatory Agency Confiscates 2,000 Doses of Illegal Weight-Loss Drugs: Report ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Britain’s medicines regulator intensified its crackdown on illegal weight-loss drug manufacturing, carrying out a second major enforcement operation in four months as global demand for obesity treatments fuels a surge in counterfeit and unregulated products.</p><p class=\"\">On Feb. 25, Britain’s Medicines and Healthcare products Regulatory Agency (MHRA) announced raids on two locations in Lincolnshire and Nottinghamshire, seizing almost 2,000 doses of illegal weight-loss drugs and manufacturing equipment.<sup class=\"text-inherit\">1</sup></p><p class=\"\">The operation follows a record seizure in October, when the agency dismantled what it described as the U.K.’s first illicit weight-loss medicine manufacturing facility.<sup class=\"text-inherit\">2</sup></p><p class=\"\"></p><h1 class=\"pb-4 pt-2 text-3xl\">What was found in the most recent raid?</h1><p class=\"\">The most recent raid uncovered medicines labelled as containing tirzepatide and retatrutide, alongside packaging materials and commercial vehicles. Both tirzepatide and retatrutide mimic hormones that suppress appetite and regulate blood sugar.<sup class=\"text-inherit\">1</sup></p><p class=\"\">According to Reuters, the crackdown underscores escalating enforcement action against illegal manufacturers exploiting surging global demand for weight-loss treatments, as regulators and pharmaceutical companies grapple with the growth of counterfeit and unregulated drugs trafficked online and through underground networks.</p><h1 class=\"pb-4 pt-2 text-3xl\">What was found in the raids from October?</h1><p class=\"\">In October, the MHRA announced what it called the world’s largest seizure of unlicensed weight-loss medicines, dismantling a factory in central England that produced jabs labelled as containing the ingredient in Mounjaro.<sup class=\"text-inherit\">2</sup></p><p class=\"\">The agency seized 2,000 injection pens labelled as containing tirzepatide, the active ingredient in Eli Lilly’s Mounjaro and Zepbound, as well as retatrutide, an experimental obesity drug still in trials. Tens of thousands of empty pens and raw chemicals were also confiscated.<sup class=\"text-inherit\">2</sup></p><p class=\"\">The MHRA said the factory was the first of its kind discovered in Britain.</p><p class=\"\">“This is a victory in the fight against the shameless criminals who are putting lives at risk by peddling dangerous and illegal weight-loss jabs to make a quick buck,” health minister Wes Streeting said in a statement.</p><p class=\"\">“These unregulated products, made with no regard for safety or quality, posed a major risk to unwitting customers.”</p><h1 class=\"pb-4 pt-2 text-3xl\">Why is there an increase in illegal weight-loss drugs?</h1><p class=\"\">Global pharmaceutical companies and regulators have raised alarms over the rapid spread of counterfeit and unregulated weight-loss drugs as demand surges worldwide. In Britain, the National Health Service prescribes weight-loss medicines only to patients who meet specific criteria. Those seeking private prescriptions can face costs of hundreds of pounds per month.<sup class=\"text-inherit\">2</sup></p><p class=\"\">In the United States, FDA Commissioner Marty Makary released a statement on X stating that the agency is expected to begin moving  copycat drugs promoted as alternatives to approved therapies, reinforcing the agency’s stance that unapproved products pose potential risks when marketed at scale.</p><p class=\"\">The MHRA’s back-to-back operations signal a sustained enforcement push as authorities attempt to curb criminal networks capitalizing on one of the fastest-growing segments of the pharmaceutical market.</p><p class=\"\"></p><h1 class=\"pb-4 pt-2 text-3xl\">Sources</h1><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">UK Drug Regulator Seizes 2,000 Doses of Illegal Weight-Loss Drugs in Latest Crackdown <em>Reuters </em>February 25, 2026 </li><li class=\"ml-8 list-decimal\">UK seizes record haul of illegal weight-loss drugs in factory raid October 24, 2025 </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/medicines-healthcare-products-regulatory-agency-confiscates-2000-doses-illegal-weight-loss-drugs-report",
            "pub_date": "2026-02-26 00:56:23",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Pharma Mergers and Acquisitions Roundup: Novo Nordisk Enters $2.1 Billion Partnership with Vivtex, GSK Enters $950 Million Acquisition Agreement with 35Pharma Inc. ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Biopharmaceutical companies this week announced significant strategic transactions aimed at expanding capabilities in oral biologics and strengthening pipelines in high-need cardiopulmonary diseases, underscoring continued investment in next-generation protein therapeutics and differentiated drug-delivery platforms.</p><h1 class=\"pb-4 pt-2 text-3xl\">What are the details of Novo Nordisk and Vivtex’s partnership?</h1><p class=\"\">Novo Nordisk and Vivtex Corporation have entered into a partnership agreement to develop next-generation oral biologic medicines for obesity, diabetes and associated comorbidities.</p><p class=\"\">Under terms of the agreement, Vivtex is set to license select oral drug-delivery technologies to Novo Nordisk, while also being eligible to receive upfront consideration, research funding and milestone payments totaling up to $2.1 billion, along with tiered royalties on future product sales.<sup class=\"text-inherit\">1</sup></p><p class=\"\">“Novo Nordisk has been at the forefront of innovation in protein and peptide engineering for several decades, and not least within oral formulation of peptides. We launched the first-ever oral biologic more than five years ago and have recently launched the world’s first oral biologic for obesity,” said Brian Vandahl, senior vice president, Therapeutics Discovery, at Novo Nordisk. “We continue to push the boundaries of science through both internal and external innovation to fulfil our mission of treating millions more people living with obesity and diabetes and their associated comorbidities.”</p><p class=\"\">The collaboration is designed to allow for oral delivery of biologic drug candidates that are traditionally limited to injectable administration due to poor gastrointestinal absorption.<sup class=\"text-inherit\">1 </sup>The partnership combines Novo Nordisk’s expertise in peptide and protein therapeutics with Vivtex’s proprietary gastrointestinal screening and formulation platform.</p><p class=\"\">“Making biologics oral has been one of the most difficult challenges in drug delivery,” said Thomas von Erlach, Ph.D., CEO and co-founder of Vivtex. “Vivtex was founded to systematically solve this problem by integrating high-throughput experimentation with computational and AI-enabled analytics. Partnering with Novo Nordisk allows us to apply our platform across important metabolic disease areas, with the goal of enabling oral therapies that would otherwise require injection.”</p><p class=\"\">Following research and formulation selection, Novo Nordisk is set to assume responsibility for global development, regulatory activities, manufacturing, and commercialization of any resulting products.<sup class=\"text-inherit\">1</sup></p><h1 class=\"pb-4 pt-2 text-3xl\">Why did GSK acquire 35Pharma for $950 million?</h1><p class=\"\">In a separate transaction, GSK has entered an agreement to acquire 35Pharma Inc. which includes HS235, an investigational medicine that has completed Phase I healthy volunteer clinical trials, with studies set to begin in pulmonary arterial hypertension (PAH) and pulmonary hypertension due to heart failure with preserved ejection fraction (PH-HFpEF).<sup class=\"text-inherit\">2</sup></p><p class=\"\">Pulmonary hypertension (PH) is a progressive, life-shortening disease characterized by high blood pressure in the lungs. It affects approximately 82 million people worldwide across multiple forms, with a five-year survival rate of around 50%. By 2032, the global PH therapy market is forecast to reach $18 billion, with activin signalling inhibitors expected to account for half of that total.</p><p class=\"\">HS235 targets the activin receptor signaling pathway and is designed with enhanced selectivity to reduce binding to BMP9 and BMP10, ligands associated with adverse events such as bleeding and telangiectasia.<sup class=\"text-inherit\">2</sup></p><p class=\"\">By potentially lowering bleeding risk, HS235 may address a key limitation in current PH treatment, particularly for patients requiring anticoagulant or antiplatelet therapy.</p><p class=\"\">Tony Wood, chief scientific officer, GSK, said: “Pulmonary hypertension affects millions of people worldwide, yet patients are underserved. We’re delighted to add HS235 to our pipeline, a potential best-in-class medicine with a differentiated profile to reduce risk of bleeding and provide potential metabolic benefits clinically relevant to PH patients. HS235’s potential protective effects on vascular function, alongside potential benefits on fat-derived markers of metabolism and inflammation, also offer new development opportunities within our RI&amp;I portfolio to achieve broader coverage across the metabolic, inflammatory, vascular and fibrotic drivers of multiple chronic diseases that affect the lung, liver and kidney.”</p><p class=\"\">Under the terms of the acquisition agreement, GSK is set to acquire 100% of 35Pharma’s equity for $950 million in cash at closing. The transaction is subject to customary conditions, including regulatory clearances under the Hart-Scott-Rodino Act in the United States and the Competition Act in Canada, as well as a filing under the Investment Canada Act.<sup class=\"text-inherit\">2</sup></p><p class=\"\"></p><h1 class=\"pb-4 pt-2 text-3xl\">Sources</h1><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">Novo Nordisk and Vivtex partner to develop next-generation oral medicines for obesity and diabetes <em>Novo Nordisk </em>February 25, 2026 </li><li class=\"ml-8 list-decimal\">GSK enters agreement to acquire 35Pharma Inc. <em>GSK </em>February 25, 2026 </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/mergers-acquisitions-roundup-novo-nordisk-enters-2-billion-partnership-vivtex-gsk-enters-950-million-acquisition-35pharma-inc-",
            "pub_date": "2026-02-25 22:45:17",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[FDA Grants Full Approval to Braftovi Combination for First-Line BRAF V600E–Mutant Metastatic Colorectal Cancer]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">The FDA has granted full approval to the combination of Braftovi (encorafenib; Pfizer) plus Erbitux (cetuximab) and fluorouracil-based chemotherapy for the treatment of adult patients with metastatic colorectal cancer (mCRC) harboring a <em>BRAF V600E</em> mutation. The regulatory action, which converts the regimen’s  into full approval, was based on progression-free survival (PFS) and overall survival (OS) data from the Phase III BREAKWATER trial (NCT04607421).<sup class=\"text-inherit\">1,2</sup></p><p class=\"\">“This landmark approval, achieved through the robust clinical benefit demonstrated in the BREAKWATER trial, validates that this targeted therapy can impact outcomes for people living with an aggressive, hard-to-treat cancer,” Aamir Malik, executive vice president and chief U.S. Commercial Officer, Pfizer, said in a press release. “As the only targeted combination regimen shown to deliver a significant improvement in certain outcomes for patients with BRAF V600E-mutant metastatic colorectal cancer, Braftovi is uniquely positioned to redefine first-line treatment and establish a new standard of care.”<sup class=\"text-inherit\">1</sup></p><h2 class=\"pb-4 pt-2 text-2xl\"><strong>Regulatory Decision Converts Accelerated to Full Approval in <em>BRAF V600E</em>–Mutant mCRC</strong></h2><p class=\"\">Braftovi plus cetuximab and mFOLFOX6 previously received accelerated approval in December 2024 based on objective response rate (ORR) results from BREAKWATER, were presented at the 2025 American Society of Clinical Oncology Annual Meeting and published in <em>The New England Journal of Medicine </em>(<em>NEJM</em>).<sup class=\"text-inherit\">3</sup></p><p class=\"\">The full approval is supported by statistically significant improvements in PFS and OS from the Phase III portion evaluating Braftovi in combination with cetuximab and mFOLFOX6, as well as additional ORR data from a separate cohort assessing Braftovi plus cetuximab and FOLFIRI.</p><p class=\"\">Scott Kopetz, MD, PhD, FACP, Professor and Deputy Chair of Gastrointestinal Medical Oncology at The University of Texas MD Anderson Cancer Center and co-principal investigator of the BREAKWATER trial, added that the data provide oncologists with the evidence needed to adopt the regimen as a first-line standard of care in this biomarker-defined population.</p><h2 class=\"pb-4 pt-2 text-2xl\"><strong>Braftovi</strong> <strong>Mechanism of Action as a BRAF Kinase Inhibitor</strong></h2><ul class=\"my-2\"><li class=\"ml-8 list-disc\">Braftovi is an oral small molecule kinase inhibitor that selectively targets BRAF V600E.</li><li class=\"ml-8 list-disc\">The agent inhibits aberrant activation of the MAPK signaling pathway (RAS-RAF-MEK-ERK), which is implicated in tumor cell proliferation and survival in several cancers, including colorectal cancer.</li><li class=\"ml-8 list-disc\">BRAF V600E mutations occur in approximately 8% to 12% of patients with mCRC and are associated with poor prognosis and increased mortality risk compared with patients without the mutation.</li></ul><p class=\"\">“Encorafenib is a highly selective, ATP-competitive, small-molecule BRAF inhibitor with antiproliferative and apoptotic activity in tumor cells expressing BRAF V600E mutations and has longer pharmacodynamic activity than other approved BRAF inhibitors,” the authors wrote in <em>NEJM</em>. “In colorectal cancer, BRAF inhibition alone can cause the BRAF pathway to be reactivated by epidermal growth factor receptor (EGFR) owing to feedback loops within the signaling network (also known as rapid pathway feedback reactivation), which attenuates the activity of BRAF inhibitors. The value of targeting BRAF simultaneously with EGFR inhibition to overcome reactivation has been shown previously.”3</p><h2 class=\"pb-4 pt-2 text-2xl\"><strong>BREAKWATER Trial Design and Patient Population</strong></h2><ul class=\"my-2\"><li class=\"ml-8 list-disc\">BREAKWATER is a global, randomized, active-controlled, open-label, multicenter Phase III trial evaluating Braftovi with cetuximab, alone or in combination with mFOLFOX6 or FOLFIRI, in patients with previously untreated BRAF V600E–mutant mCRC.</li><li class=\"ml-8 list-disc\">In the Phase III portion, patients were randomly assigned to receive Braftovi 300 mg orally once daily plus cetuximab and mFOLFOX6 (n=236) or chemotherapy (mFOLFOX6, FOLFOXIRI, or CAPOX) with or without bevacizumab (n=243).</li><li class=\"ml-8 list-disc\">Dual primary endpoints were ORR and PFS as assessed by blinded independent central review (BICR); OS was a key secondary endpoint.</li><li class=\"ml-8 list-disc\">In Cohort 3, patients were randomly assigned to Braftovi plus cetuximab and FOLFIRI (n=73) or FOLFIRI with or without bevacizumab (n=74).</li><li class=\"ml-8 list-disc\">The primary endpoint was ORR by BICR, with PFS and OS as secondary endpoints.</li></ul><h2 class=\"pb-4 pt-2 text-2xl\"><strong>Progression-Free Survival and Overall Survival Outcomes</strong></h2><ul class=\"my-2\"><li class=\"ml-8 list-disc\">At the time of primary PFS analysis, Braftovi plus cetuximab and mFOLFOX6 reduced the risk of disease progression or death by 47% compared with chemotherapy with or without bevacizumab (HR 0.53; 95% CI, 0.41–0.68; p&lt;0.0001).</li><li class=\"ml-8 list-disc\">Median PFS was 12.8 months with the Braftovi combination regimen compared with 7.1 months in the control arm.</li><li class=\"ml-8 list-disc\">In a second interim OS analysis, the Braftovi combination reduced the risk of death by 51% compared with chemotherapy with or without bevacizumab (HR 0.49; 95% CI, 0.38–0.63; p&lt;0.0001).</li><li class=\"ml-8 list-disc\">Median OS improved from 15.1 months in the control arm to 30.3 months with BRAFTOVI plus cetuximab and mFOLFOX6.</li></ul><h2 class=\"pb-4 pt-2 text-2xl\"><strong>Objective Response Results in FOLFIRI Cohort</strong></h2><ul class=\"my-2\"><li class=\"ml-8 list-disc\">In Cohort 3, Braftovi plus cetuximab and FOLFIRI demonstrated a statistically significant improvement in confirmed ORR compared with FOLFIRI with or without bevacizumab (64% vs 39%; odds ratio 2.76; p=0.0011).</li><li class=\"ml-8 list-disc\">Detailed PFS data from this cohort are expected to be presented at an upcoming medical meeting.</li></ul><h2 class=\"pb-4 pt-2 text-2xl\"><strong>Braftovi Safety Profile</strong></h2><ul class=\"my-2\"><li class=\"ml-8 list-disc\">The safety profile of both combination regimens was consistent with the known safety profiles of the individual agents, with no new safety signals identified.</li><li class=\"ml-8 list-disc\">The most common adverse events (AEs) (≥25%) with the mFOLFOX6 regimen included peripheral neuropathy, nausea, fatigue, diarrhea, decreased appetite, rash, vomiting, hemorrhage, abdominal pain, arthralgia, pyrexia, and constipation.</li><li class=\"ml-8 list-disc\">The most common AEs (≥25%) with the FOLFIRI regimen included nausea, diarrhea, fatigue, vomiting, alopecia, constipation, abdominal pain, decreased appetite, and rash.</li><li class=\"ml-8 list-disc\">Permanent discontinuation of Braftovi due to AEs occurred in 14% of patients receiving the mFOLFOX6 regimen and 9% of those receiving the FOLFIRI regimen.</li></ul><p class=\"\">Colorectal cancer remains the third most commonly diagnosed cancer worldwide and the second leading cause of cancer-related death. Approximately 20% of patients present with metastatic disease at diagnosis, and up to half of those with localized disease eventually develop metastases.</p><p class=\"\">The approval of Braftovi-based combination therapy provides a biomarker-driven, first-line treatment option for patients with previously untreated BRAF V600E–mutant metastatic colorectal cancer.</p><p class=\"\"><strong>References</strong></p><p class=\"\">1. U.S. FDA Grants Full Approval to Pfizer’s BRAFTOVI Combination Regimen in First-Line Metastatic Colorectal Cancer. News release. Pfizer. February 24, 2026. </p><p class=\"\">2. A Study of Encorafenib Plus Cetuximab With or Without Chemotherapy in People With Previously Untreated Metastatic Colorectal Cancer. ClinicalTrials.gov. Updated August 14, 2025. Accessed February 25, 2026. </p><p class=\"\">3. Elez E., et al. Encorafenib, Cetuximab, and mFOLFOX6 in BRAF-Mutated Colorectal Cancer. <em>N Engl J Med</em> 2025; DOI: 10.1056/NEJMoa2501912.</p> </div>",
            "link": "https://www.pharmexec.com/view/fda-approval-braftovi-braf-v600e-mutant-metastatic-colorectal-cancer",
            "pub_date": "2026-02-25 22:40:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[How Does FDA's Decision Represent a Broader Regulatory Recalibration?]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> </div>",
            "link": "https://www.pharmexec.com/view/fda-decision-represent-broader-regulatory-recalibration",
            "pub_date": "2026-02-25 19:00:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[FDA Enforcement on Copycat GLP-1's Could Reshape Retail Pharmacy Economics: Q&A with David Graziano]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">David Graziano, head of retail network, GoodRx, discusses the impact of the FDA's enforcement on non-approved GLP-1 drugs, emphasizing the importance of FDA-approved medications and GoodRx's role in providing affordable access. In a conversation with <em>Pharmaceutical Executive</em>, Graziano highlighted GoodRx's value proposition in filling prescription gaps and ensuring predictable reimbursement for independent pharmacies.</p><p class=\"\">A transcript of his conversation with <em>Pharmaceutical Executive </em>can be found below.</p><p class=\"\"></p><p class=\"\"></p><p class=\"\"><em>Pharmaceutical Executive: How do you expect enforcement of FDA’s recent move against non-approved or “copycat” GLP-1’s to impact retail pharmacies and platforms like GoodRx?<br/></em><strong>David Graziano: </strong>I believe, that the ability to gain access to FDA approved medications is wildly important. The opportunity for pharmacies to be able to deliver it to patients and dispense it to patients is important as well, and we want to be able to provide value and access to those FDA approved medications. So, the push and the opportunity that we've been involved in is to bring those medications at a price that patients can afford.</p><p class=\"\"></p><p class=\"\"><em>PE: If compounded GLP-1’s becomes more restricted, what changes do you anticipate in prescription demand, pricing pressure, and retail pharmacy operations?<br/></em><strong>Graziano: </strong>The ability for us to bring affordable GLP-1’s, or more affordable GLP-1’s to market on behalf of our pharma manufacturers that we partner with directly is really the value proposition that's available for patients.</p><p class=\"\">We're bringing a price point that is competitive in the marketplace, allows patients to pick up at retail, so whatever was being done to fill gaps in the past, we believe now we're actually playing a role in filling whatever gap may happen in the future by being in partnership across the value chain, whether it's pharma providing an affordability solution and ultimately having retail access, ubiquitous, almost ubiquitous retail access across the board.</p><p class=\"\"></p><p class=\"\"><em>PE: How does GoodRx address struggles with below-cost reimbursement on high-demand brand drugs, and why is predictable reimbursement becoming essential for pharmacy sustainability?</em><br/><strong>Graziano: </strong>We see independence as a cornerstone of the marketplace and the healthcare journey for patients and in communities, and being able to navigate that having predictable economics associated with the dispensing of medications is important for those independent pharmacies to stay in business.</p><p class=\"\">When I think about the direct contracting relationship that we have through community link, it actually provides value for that independent pharmacist to know that when they dispense a brand medication through GoodRx on behalf of a pharma manufacturer, they actually know what they're going to be paid.</p><p class=\"\">So those predictable economics ensure that they can make payroll in a given week or month. They can ensure that they're staffing appropriately, and they can also procure the medication, actually get it in hand, and not have to tell the patient that they don't have access to it and send them off to another pharmacy, potentially losing that entire pharmacy basket.</p><p class=\"\"><em></em></p><p class=\"\"><em>PE: What strategies should independent pharmacies adopt to remain competitive and retain patients who might otherwise migrate to online platforms?<br/></em><strong>Graziano: </strong>Retail pharmacy is still the fastest way to pick up your medication. So, ensuring that you have the product in stock and on hand, or the prescription in stock and on hand is clearly important.</p><p class=\"\">But again, for an independent or broader chain pharmacy, sometimes getting access to it has been a challenge. So, when we know that we can deliver the value, by that, I mean patients coming in the door to pick up the prescription, ultimately, that should lead to the patient picking up their prescription when they leave their doctor.</p><p class=\"\">In other words, you gain prescription in hand for the patient. Later on that same day, being able to pick up that prescription versus having to go through the platform waiting for it to come in the mail, not sure about cold chain storage and how it's going to get to them. Let's keep it as simple and effective as possible.</p><p class=\"\"></p><p class=\"\"><em>PE: How is the shift in insurance design changing the role of retail pharmacies, and what does it mean for how patients discover and afford therapies like GLP-1s moving forward?<br/></em><strong>Graziano: </strong>It is increasingly complex, both the reimbursement model and what's on and off formulary, as patients don’t understand it and they show up to the counter, and it's a something went bump in the night moment and it turns out it's not covered.</p><p class=\"\">What do I do? Having a solution like GoodRx and having access helps ensure it brings awareness to the patient that there is a solution that can solve that bump in the night moment. This is a great way, and it's not just GLP-1’s.You can think about a whole host of brand medications. We have over 100 brand medications that have buy down offerings that is supported by pharma and ultimately leads to positive reimbursement for the for the retail pharmacy.</p><p class=\"\">So, I think about that sort of broader scope of the landscape, as it allows a pharmacy to bring a solution for those instances where insurance fails and we play a role in filling that gap and filling that hole.</p> </div>",
            "link": "https://www.pharmexec.com/view/fda-enforcement-copycat-glp-reshape-retail-pharmacy-economics-qa-david-graziano",
            "pub_date": "2026-02-25 19:00:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Pharmaceutical Executive Daily: Novo Nordisk Announces Price Reductions for GLP-1 Products]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Welcome to <em>Pharmaceutical Executive</em> Daily, your quick briefing on the top news shaping the pharmaceutical and life sciences industry.</p><p class=\"\">In today’s <em>Pharmaceutical Executive</em> Daily, AbbVie invests $380 million to expand API manufacturing capacity while Bora Pharmaceuticals and GSK enter a five-year manufacturing agreement, Novo Nordisk announces significant price reductions for its leading GLP-1 therapies, and Astellas enters a billion-dollar global collaboration with Vir Biotechnology to advance PSMA-targeting cancer treatments.</p><p class=\"\">AbbVie is investing $380 million to expand its active pharmaceutical ingredient manufacturing capacity, reinforcing the company’s commitment to strengthening supply chain resilience and supporting long-term portfolio growth. In related manufacturing developments, Bora Pharmaceuticals and GSK have entered a five-year manufacturing agreement designed to enhance production capabilities and ensure steady supply. Together, these moves highlight continued industry focus on strategic production partnerships and domestic capacity expansion amid evolving global trade and regulatory pressures.</p><p class=\"\">Novo Nordisk has announced significant price reductions for several of its popular GLP-1 medications, a notable shift in the highly competitive diabetes and obesity market. The move comes as pricing scrutiny intensifies and competition within the GLP-1 category accelerates. Lower list prices may improve patient access while also reshaping competitive dynamics among major players in the rapidly expanding cardiometabolic space.</p><p class=\"\">Finally, Astellas has entered a billion-dollar global collaboration with Vir Biotechnology to advance PSMA-targeting therapies in oncology. The partnership combines Vir’s protein engineering capabilities with Astellas’ global development and commercialization expertise, aiming to accelerate next-generation treatments in prostate cancer. The deal underscores continued big pharma appetite for innovative oncology platforms and strategic external partnerships.</p><p class=\"\">Thanks for listening to <em>Pharmaceutical Executive</em> Daily. For more updates and in-depth analysis, visit PharmExec.com.</p><p class=\"\"></p> </div>",
            "link": "https://www.pharmexec.com/view/daily-novo-nordisk-announces-price-reductions-glp1-products",
            "pub_date": "2026-02-25 01:40:52",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Astellas Pharmaceuticals Enters $1.7 Billion Global Collaboration with Vir Biotechnology to advance PSMA-targeting PRO-XTEN ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Astellas Pharma Inc. and Vir Biotechnology, Inc. have entered into a global strategic collaboration to advance VIR-5500, an investigational PRO-XTEN dual-masked CD3 T-cell engager targeting PSMA for the treatment of prostate cancer.</p><p class=\"\">The companies say the collaboration is intended to accelerate development of VIR-5500 while strengthening Astellas’ oncology pipeline and prostate cancer leadership.<sup class=\"text-inherit\">1</sup></p><p class=\"\">“Astellas is proud to have helped 1.5 million patients with prostate cancer, and we are dedicated to expanding our impact as part of our R&amp;D strategy. Our deep expertise in this disease area, combined with a growing immuno-oncology (IO) pipeline of biologics, including T-cell engagers, uniquely positions us to help advance VIR-5500, a potentially best-in-class T-cell engager for prostate cancer. This strategic collaboration allows Astellas and Vir Biotechnology to combine our expertise and reaffirms our commitment to improving the lives of people with prostate cancer,” said Adam Pearson, chief strategy officer, Astellas.</p><p class=\"\">Despite recent advances, metastatic castration-resistant prostate cancer (mCRPC) remains difficult to treat, with a five-year survival rate of approximately 30%.<sup class=\"text-inherit\">1</sup> Patients who progress to mCRPC often develop therapeutic resistance and face limited treatment options.</p><p class=\"\">VIR-5500 is currently in Phase I development for people with advanced, metastatic prostate cancer (NCT05997615), with the first reported patient being treated back in October 2025.<sup class=\"text-inherit\">2</sup></p><p class=\"\">The investigational therapy combines a bispecific PSMA and CD3 binding T-cell engager with PRO-XTEN masking technology designed to keep the molecule inactive until it reaches the tumor microenvironment, with the goal of reducing off-target effects and improving the therapeutic index.<sup class=\"text-inherit\">1</sup></p><h1 class=\"pb-4 pt-2 text-3xl\">What are the financial terms and commercialization structure?</h1><p class=\"\">Under the terms of the agreement, Vir Biotechnology is set to receive $335 million in upfront and near-term payments, including $240 million in cash, a $75 million equity investment at a 50% premium, and a near-term $20 million milestone.<sup class=\"text-inherit\">1</sup></p><p class=\"\">Development costs will be shared globally, with Astellas responsible for 60% and Vir Biotechnology responsible for 40%.</p><p class=\"\">Vir Biotechnology is also expected to continue the ongoing Phase I trial until responsibility transitions to Astellas, after which Astellas will oversee all development activities. In the United States, Vir Biotechnology will have the option to co-promote VIR-5500 with Astellas, with profit and loss shared equally.<sup class=\"text-inherit\">1</sup></p><p class=\"\">Outside the United States, Astellas will have exclusive commercialization rights.</p><p class=\"\">Vir Biotechnology is also eligible to receive up to $1.37 billion in development, regulatory, and sales milestones, as well as tiered, double-digit royalties on ex-U.S. net sales. Under Vir Biotechnology’s licensing agreement with Sanofi, a portion of certain collaboration proceeds will be shared with Sanofi.<sup class=\"text-inherit\">3</sup></p><p class=\"\">Marianne De Backer, M.Sc., Ph.D., MBA, chief executive officer, Vir Biotechnology, added, “Astellas is an ideal collaborator for the VIR-5500 program given the company's successful track record advancing therapies across the treatment continuum, building blockbuster franchises and delivering value to patients through strategic development alliances with other biotech partners. This collaboration will enable more rapid advancement of VIR-5500 to potentially benefit more people living with prostate cancer. We believe this collaboration reflects confidence in our PRO-XTEN platform, which has broad potential across multiple solid tumor indications.”</p><h1 class=\"pb-4 pt-2 text-3xl\">Sources</h1><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">Astellas and Vir Biotechnology Announce Global Strategic Collaboration to Advance PSMA-targeting PRO-XTEN Dual-masked T-Cell Engager VIR-5500 for the Treatment of Prostate Cancer <em>Astellas Pharma Inc. </em>February 23, 2026 </li><li class=\"ml-8 list-decimal\">Vir Biotechnology Announces First Patient Dosed in Part 3 of Phase 1 Trial of PSMA-Targeting PRO-XTEN® Dual-Masked T-Cell Engager VIR-5500 in Combination with Androgen Receptor Pathway Inhibitors for the Treatment of Metastatic Prostate Cancer <em>Vir Biotechnology </em>October 9, 2025 </li><li class=\"ml-8 list-decimal\">Vir Biotechnology Acts on Expanded Strategy of Powering the Immune System Through Exclusive Worldwide License Agreement with Sanofi for Multiple Potential Best-in-Class Clinical-Stage T-cell Engagers <em>Vir Biotechnology </em>August 1, 2024 </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/astellas-enters-billion-global-collaboration-vir-biotechnology-advance-psma-targeting-pro-xten",
            "pub_date": "2026-02-24 22:52:24",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Novo Nordisk Announces Significant Price Drops for Popular GLP-1 Medications]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Novo Nordisk announced price reductions for three of its most popular medications:<sup class=\"text-inherit\">1</sup></p><ul class=\"my-2\"><li class=\"ml-8 list-disc\">Wegovy</li><li class=\"ml-8 list-disc\">Ozempic</li><li class=\"ml-8 list-disc\">Rybelsus</li></ul><p class=\"\">According to the company, the decrease is part of a move to expand access to the popular medications. Starting on January 1, 2027, the list price for these medications will drop to $675-per-month for each drug.</p><h1 class=\"pb-4 pt-2 text-3xl\">Which doses of GLP-1 medications will be impacted by Novo Nordisk’s price reduction?</h1><p class=\"\">This price will be in effect for the following dosages:</p><ul class=\"my-2\"><li class=\"ml-8 list-disc\">2.4 mg Wegovy injection</li><li class=\"ml-8 list-disc\">25 mg Wegovy tablets</li><li class=\"ml-8 list-disc\">0.5 mg, 1 mg, and 2 mg Ozempic injections</li><li class=\"ml-8 list-disc\">7 to 14 mg Rybelsus tablets</li></ul><p class=\"\">In a press release, Novo Nordisk’s executive vice president of US operations Jamey Millar said, “Lowering the list price of Wegovy® and Ozempic® is the best approach to address the unprecedented opportunity to help more than 100 million people living with obesity and over 35 million people with type 2 diabetes in the United States. Private and public payers, as well as patients, want access and have been calling for lower list prices. Our actions today answer that call and remove cost barriers so the value of Wegovy® and Ozempic® can be realized by more patients. The lower list price is intended to connect more people with our innovative medicines, specifically those whose out-of-pocket costs are linked to list price, such as individuals with high-deductible health plans or co-insurance benefit designs.”</p><p class=\"\">The announcement notes that the price decrease will only impact the list price. Patients purchasing the drugs through direct-to-consumer portals will not be impacted by these changes.</p><p class=\"\">The announcement comes as competition in the GLP-1 space continues to increase for Novo Nordisk. Earlier this month,  revealing a $1.5 billion pre-launch inventory for its weight-loss drug orforglipron. The company is expecting an announcement from FDA on the drug’s approval, and the size of the stockpile reveals how strong Eli Lilly expects that potential launch to be.</p><p class=\"\">Novo Nordisk also took steps to protect its position in the weight-loss market by going after knock-off versions of its drugs. In February, the company successfully took legal action against Hims &amp; Hers to prevent the company from selling unapproved, compounded versions of Wegovy and Ozempic.<sup class=\"text-inherit\">2</sup></p><p class=\"\">In a press release, John F. Kuckelman, senior vice president, group general counsel, global legal, IP, and security for Novo Nordisk, said, “Throughout Novo Nordisk’s 103-year-long history, patient safety has always been our top priority. Hims &amp; Hers is mass marketing unapproved knock-off versions of Wegovy® and Ozempic® that evade the FDA’s gold standard review process––that’s dangerous and deceptive to patients and undermines the scientific innovation and regulatory rigor in place to ensure these treatments are safe and effective. We’ve taken legal action to protect the American public and our intellectual property and will continue to work with regulators, law enforcement, and other key stakeholders to ensure patients have access to FDA approved safe and effective medicines.”</p><p class=\"\">Also in February, Novo Nordisk announced approval from the European Commission for a more effective dose of the injectable form of Wegovy.<sup class=\"text-inherit\">3</sup> The approval allows for a higher dose of 7.2 mg for maintenance in weight loss patients.</p><p class=\"\">Emil Kongshøj Larsen, executive vice president of international operations at Novo Nordisk, said in a press release, “This approval is another important step in helping people living with obesity reach very significant weight loss. The new dose gives healthcare professionals even more flexibility to tailor treatment and help people with obesity achieve their weight loss and health goals.”</p><p class=\"\"></p><h2 class=\"pb-4 pt-2 text-2xl\">Sources</h2><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">Novo Nordisk announces significant reduction in US list price for Wegovy®, Ozempic®, and Rybelsus® (semaglutide medicines), building on continued efforts to expand access. <em>Novo Nordisk</em>. February 24, 2026. </li><li class=\"ml-8 list-decimal\">Novo Nordisk takes legal action against Hims &amp; Hers to protect patients from unsafe, knock-off Wegovy and Ozempic. <em>Novo Nordisk</em>. February 9, 2026. Accessed February 24, 2026. </li><li class=\"ml-8 list-decimal\">Novo Nordisk A/S: The European Commission approves more effective dose of injectable Wegovy for adults with obesity; clinical study showed people lost about 21% of their body weight on average. <em>Novo Nordisk</em>. February 17, 2026. Accessed February 24, 2026. </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/novo-nordisk-significant-price-drops-popular-glp1-medications",
            "pub_date": "2026-02-24 22:45:46",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[ How Should Pharmaceutical Companies Rethink Commercialization and Distribution Strategies?]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> </div>",
            "link": "https://www.pharmexec.com/view/companies-rethink-commercialization-distribution-strategies",
            "pub_date": "2026-02-24 19:00:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        }
    ]
}