{
    "data": [
        {
            "title": "<![CDATA[The Influence of Trump Rx in Pharmacy Benefit Managers, Retail Pharmacies, and Digital Health Platforms]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> </div>",
            "link": "https://www.pharmexec.com/view/influence-trump-rx-pbm-retail-digital-health-platforms",
            "pub_date": "2026-02-27 19:00:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Bringing HIV Prevention DTC: Q&A with Ashley Gildea]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">DTC advertising opened new ways for the pharma industry to communicate directly with patients and patient populations. Ashley Gildea, VP of marketing and US HIV prevention at Gilead, spoke with <em>Pharmaceutical Executive</em> about the new campaign for HIV prevention option Yeztugo and how the industry is ultilizing the DTC advertising space.</p><p class=\"\"></p><p class=\"\"><em>Pharmaceutical Executive: What inspired the new campaign for Yeztugo?<br/></em><strong>Ashley Gildea:</strong> Even with effective prevention tools already available, many people still face barriers such as lack of awareness, limited access and stigma. The campaign is designed to spotlight conversations around HIV prevention, which we believe should be normalized, not whispered about.</p><p class=\"\">In 2024, AIDsVu reported that roughly 600,000 people in the United States used some form of pre-exposure prophylaxis (PrEP). Yet the CDC estimates that up to 2.2 million individuals could potentially benefit from preventive HIV medications. The biggest barriers to wider access include a lack of awareness about PrEP (and who qualifies for it), stigma and misperceptions about the nature of the HIV epidemic.</p><p class=\"\">We’re kicking off the campaign with an ad centered on One2PrEP, a reimagined version of Ciara’s early-2000s hit “1,2 Step” (featuring Missy Elliott). It’s a simple and memorable way to highlight Yeztugo, the first ever, twice-yearly HIV prevention option for a broad range of people and communities.</p><p class=\"\"></p><p class=\"\"><em>PE: What is the goal of the campaign?<br/></em><strong>Ashley Gildea:</strong> With awareness of PrEP lagging, the goal is simple: Help more people learn about their HIV prevention options and empower them to take that next step with their healthcare provider.</p><p class=\"\">This campaign focuses on helping people understand what sets Yeztugo apart – just one office visit every six months – and emphasizes the importance of dosing choices in individuals’ lives. Having a six-month interval between visits not only saves time but also offers a half year of protection. It’s well established that consistent use of PrEP reduces HIV incidence, but adherence is a major challenge. Many people struggle to stick to the schedule with oral medications and other long-acting injectables, which can put them at risk. With Yeztugo offering six months of protection, they will have greater peace of mind.</p><p class=\"\"></p><p class=\"\"><em>PE: What trends are you seeing in DTC Pharma advertising/campaigns?<br/></em><strong>Gildea:</strong> Across DTC pharma, campaigns are increasingly shifting toward more inclusive, purpose-driven approaches that reflect real patient experiences. There’s a growing emphasis on clear, approachable language; culturally relevant storytelling and representation that helps reduce stigma and make health conditions feel more relatable and manageable.</p><p class=\"\">At the same time, brands must use a mix of digital, streaming, traditional media and community-based outreach to reach people where they already are.</p><p class=\"\">Yeztugo brings this shift to life by using culture and music, an inclusive tone and clear messaging, all of which helps position HIV prevention as normal and manageable rather than intimidating or taboo. The campaign is designed to meet people where they are—online, on TV, and within their communities—through a coordinated, multi-channel approach.</p><p class=\"\"></p><p class=\"\"><em>PE: How are Pharma marketing teams reaching patient populations with DTC campaigns?</em><br/><strong>Gildea:</strong> Pharma marketing teams are recognizing the need to connect with patient populations by grounding their DTC campaigns in accessible, culturally relevant messaging. When we meet people where they are, we can make them feel more comfortable speaking up and help bridge the gap between education, open conversation and action. That action is empowering people to talk with their healthcare providers about which HIV prevention option is right for them.</p><p class=\"\"></p><p class=\"\"><em>PE: How is the effectiveness of campaigns like this measured?<br/></em><strong>Gildea:</strong> Effectiveness can be measured by awareness, engagement and action. That means tracking quantitative data on how many people see the ad, visit educational sites like Yeztugo.com and engage with the campaign on social media. </p><p class=\"\">Ultimately, the most critical impact measure is the behavioral shift towards patients proactively discussing their HIV prevention options with their healthcare providers. From a long-term perspective, we hope to reduce stigma while increasing trust and understanding across diverse communities.</p> </div>",
            "link": "https://www.pharmexec.com/view/bringing-hiv-prevention-dtc-ashley-gildea",
            "pub_date": "2026-02-27 19:00:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Pharmaceutical Executive Daily: Alkermes' CEO Succession Plan]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Welcome to <em>Pharmaceutical Executive</em> Daily, your quick briefing on the top news shaping the pharmaceutical and life sciences industry.</p><p class=\"\">In today’s <em>Pharmaceutical Executive</em> Daily, Alkermes outlines its CEO succession plan following Richard Pops’ retirement announcement, leadership changes continue at Sarepta Therapeutics and Rivus Pharmaceuticals, and Boehringer Ingelheim secures an exclusive license for a preclinical small-molecule program.</p><p class=\"\">Alkermes has revealed its CEO succession plan after longtime chief executive Richard Pops announced his retirement. Pops has led the company for decades, overseeing its transition into a diversified neuroscience-focused biopharma. The leadership transition marks a pivotal moment as Alkermes continues advancing its commercial portfolio and pipeline strategy.</p><p class=\"\">In broader leadership news, Sarepta Therapeutics’ CEO has announced plans to retire, while Rivus Pharmaceuticals has appointed a new chief executive to guide its next stage of growth. The moves reflect ongoing executive reshuffling across the biotech sector as companies adapt to shifting capital markets, regulatory dynamics, and pipeline priorities.</p><p class=\"\">Finally, Boehringer Ingelheim has acquired an exclusive license to a preclinical small-molecule program from Sitryx Therapeutics. The agreement strengthens Boehringer’s research portfolio and underscores continued investment in early-stage assets through external innovation partnerships.</p><p class=\"\">Thanks for listening to <em>Pharmaceutical Executive</em> Daily. For more updates and in-depth analysis, visit PharmExec.com.</p> </div>",
            "link": "https://www.pharmexec.com/view/daily-alkermes-ceo-succession-plan",
            "pub_date": "2026-02-27 03:17:26",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Hospital Pharmacy and Supply Chain Leaders Want to Be Heard: Are you Ready to Listen? ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Valerie Bandy and Ryan Rotar, both from Tecsys, examine how hospital pharmacy leaders are reshaping their expectations and prioritizing value-driven partnerships over traditional transactional vendor relationships. They explore the growing shift toward self-distribution and direct purchasing, as well as how transparency and proactive communication are now essential to mitigating logistics risk and safeguarding patient care. This interview stresses technology’s role as a critical enabler of data visibility, empowering manufacturers to build long-term trust through consistent performance and shared accountability. Read this Q&amp;A to learn more about:</p><ul class=\"my-2\"><li class=\"ml-8 list-disc\">How hospital pharmacies evaluate manufacturers and what separates true partners from transactional vendors.</li><li class=\"ml-8 list-disc\">Where direct purchasing changes expectations around risk, communication, logistics, and technology.</li><li class=\"ml-8 list-disc\">Practical ways manufacturers can build trust, improve collaboration, and create long-term financial value with health systems.</li></ul><p class=\"\"></p><p class=\"\"></p> </div>",
            "link": "https://www.pharmexec.com/view/hospital-pharmacy-and-supply-chain-leaders-want-to-be-heard-are-you-ready-to-listen",
            "pub_date": "2026-02-26 23:54:48",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Hospital Pharmacy and Supply Chain Leaders Want to Be Heard: Ready to Listen? ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Watch the video to learn more about:</p><ul class=\"my-2\"><li class=\"ml-8 list-disc\">How hospital pharmacies evaluate manufacturers and what separates true partners from transactional vendors.</li><li class=\"ml-8 list-disc\">Where direct purchasing changes expectations around risk, communication, logistics, and technology.</li><li class=\"ml-8 list-disc\">Practical ways manufacturers can build trust, improve collaboration, and create long-term financial value with health systems.</li></ul> </div>",
            "link": "https://www.pharmexec.com/view/hospital-pharmacy-and-supply-chain-leaders-want-to-be-heard-ready-to-listen",
            "pub_date": "2026-02-26 23:54:48",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Boehringer Ingelheim Acquires Exclusive License from Sitryx Therapeutics for Preclinical Small Molecule Program ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Boehringer Ingelheim acquired an exclusive global license to a preclinical small molecule inhibitor program from Sitryx Therapeutics.</p><p class=\"\">The licensed program, developed by Sitryx, is described as a novel, oral, potentially disease-modifying treatment approach across multiple autoimmune and inflammatory disease indications.<sup class=\"text-inherit\">1</sup></p><p class=\"\">The deal comes as the global burden of autoimmune and inflammatory diseases continues to rise, with millions of patients unable to achieve sustainable disease control on existing therapies, underscoring the need for new mechanisms targeting disease-driving pathways.</p><p class=\"\">“Autoimmune and inflammatory diseases remain areas where innovation is urgently needed. Sitryx’s small molecule inhibitor program brings forward a promising new mechanism that aligns with our focus on advancing first-in-class approaches. Together with Sitryx, we are committed to translating this science into therapies that can meaningfully improve patients’ lives,” said Carine Boustany, head of immunology and respiratory diseases research at Boehringer Ingelheim.</p><p class=\"\">“This collaboration is a major milestone for our company and is a clear validation of the strength of our pipeline and our expertise translating immunometabolic targets into meaningful therapeutic candidates,” said Iain Kilty, chief executive officer of Sitryx. “We are proud to out-license this preclinical program to Boehringer Ingelheim whose global capabilities in immunology and drug development will help position this program to deliver meaningful benefits to patients worldwide.”</p><p class=\"\">Sitryx, a clinical-stage biopharmaceutical company developing oral therapies to restore immune balance, continues to advance its broader pipeline. Its lead candidate, SYX-5219, is a potentially first-in-class oral pyruvate kinase M2 (PKM2) modulator in development for atopic dermatitis.</p><p class=\"\">A recently completed Phase Ia trial in healthy volunteers in the UK showed SYX-5219 was safe and well tolerated, with predictable pharmacokinetics and robust target engagement, as well as a dose-dependent reduction in CCL17/thymus and activation-regulated chemokine (TARC) levels.<sup class=\"text-inherit\">2</sup></p><p class=\"\">A Phase Ib trial in adults with moderate to severe atopic dermatitis has commenced in the United States and Europe, with data expected by year end. A KLH antigen-challenge study in healthy volunteers is also underway to assess early immune response signals.<sup class=\"text-inherit\">2</sup></p><p class=\"\">“A daily oral treatment to rebalance immune function and deliver durable disease remission would be transformative for the treatment of atopic dermatitis. Our latest clinical data for SYX-5219, particularly the strong reduction in the highly disease-relevant Type 2 inflammation biomarker TARC, give us further confidence in the candidate’s differentiated profile. We look forward to the progression of our Phase 1b trial, which is expected to show the first evidence of SYX-5219’s mechanistic and clinical activity in patients and guide the next stages of development,” said Ravi Rao, chief medical officer of Sitryx.</p><p class=\"\"></p><h1 class=\"pb-4 pt-2 text-3xl\">What are the details of the license agreement?</h1><p class=\"\">Under the agreement, Sitryx grants Boehringer exclusive rights to multiple candidates and associated intellectual property within the program, while Boehringer assumes full responsibility for further research, clinical development and commercialization.</p><p class=\"\">Sitryx will receive upfront and near-term payments and is eligible for potential development, regulatory and commercialization milestone payments totaling more than $500 million, in addition to tiered royalties on future sales.<sup class=\"text-inherit\">1</sup></p><p class=\"\"></p><h2 class=\"pb-4 pt-2 text-2xl\">Sources</h2><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">Boehringer Ingelheim licenses novel oral therapeutics program for immune diseases from Sitryx Therapeutics <em>Boehringer Ingelheim </em>February 26, 2026 </li><li class=\"ml-8 list-decimal\">Sitryx advances development of PKM2 modulator SYX-5219 into atopic dermatitis patients following clinical evidence of immunomodulatory activity <em>Sitryx Therapetuics </em>January 26, 2026 </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/boehringer-ingelheim-acquires-exclusive-license-sitryx-therapeutics-preclinical-small-molecule-program",
            "pub_date": "2026-02-26 23:16:29",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Pharma Leadership Roundup: Sarepta Therapeutics CEO Announces Retirement, Rivus Pharmaceuticals Appoints New CEO  ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Executive turnover is once again reshaping the biotechnology sector. Sarepta Therapeutics looks to rebound after a tough 2025, while Rivus Pharmaceuticals signals a new phase of growth with fresh leadership.</p><h1 class=\"pb-4 pt-2 text-3xl\">Sarepta CEO Douglas Ingram plans to step down</h1><p class=\"\">Sarepta said in a regulatory filing that CEO Douglas Ingram is planning to step down by the end of 2026 (or upon the appointment of his replacement) and that the company has commenced a search for a successor. Ingram served as chief executive officer since 2017.<sup class=\"text-inherit\">1</sup></p><p class=\"\">The transition follows what the company described as a  2025. Its gene therapy Elevidys, used to treat a type of muscle disorder, was linked to the deaths of two patients and falling sales.<sup class=\"text-inherit\">3</sup></p><p class=\"\">Last year, FDA asked Sarepta to voluntarily halt shipments of Elevidys and due to an investigation of deaths associated with the therapy. The treatment’s label carries the regulator’s most serious safety warning, along with stringent monitoring requirements after treatment.</p><p class=\"\">Sarepta also announced 500 job cuts and halted development of several gene therapies for limb-girdle muscular dystrophy last year. Shares of the company fell 82% in 2025 and were down about 4% in after-market trading on Wednesday.</p><p class=\"\">“Elevidys has emerged from a challenging year,” Ingram said on Wednesday, adding that the company is executing plans to put it on a potential pathway to make the treatment available to non-ambulatory patients.<sup class=\"text-inherit\">1</sup></p><h1 class=\"pb-4 pt-2 text-3xl\">Rivus appoints Jorge Bartolome as new CEO</h1><p class=\"\">While Sarepta seeks stability, Rivus Pharmaceuticals announced that Jorge Bartolome has been appointed chief executive officer and member of the board, succeeding co-founder Allen Cunningham, who will transition to chief operating officer.<sup class=\"text-inherit\">2</sup></p><p class=\"\">“Rivus is embarking on an important stage of its journey as the company advances two potentially transformative oral medicines targeting MASH, obesity, and associated cardiometabolic diseases,” said Ian F. Smith, co-chair of the board of Rivus Pharmaceuticals. “Jorge’s extensive pharmaceutical background in late-stage drug development and commercialization makes him the ideal leader for Rivus to navigate the unprecedented opportunity to treat MASH, obesity, and its co-morbidities.”</p><p class=\"\">Bartolome brings more than 25 years of leadership experience in the pharmaceutical and biotechnology industry, as he previously served as chief executive officer and director of AreteiaTx, and earlier as president of Janssen Canada, part of Johnson &amp; Johnson, after holding increasingly senior roles over 20 years at GSK.</p><p class=\"\">“I am honored to lead this talented team as we drive Rivus forward as a company with multiple oral therapies to address the growing unmet patient needs in MASH, obesity, and associated cardiometabolic diseases,” Bartolome said. He added that 2026 will be a pivotal year as the company advances HU6 in the Amplify Phase II trial in MASH and prepares its first clinical trial for RV-8451, described as a differentiated oral, muscle-preserving GLP-1, in obesity.</p><h1 class=\"pb-4 pt-2 text-3xl\">Sources</h1><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">Sarepta Therapeutics CEO Ingram to retire by year end <em>Reuters </em>February 26, 2026 </li><li class=\"ml-8 list-decimal\">Rivus Pharmaceuticals Appoints Jorge Bartolome as Chief Executive Officer <em>Rivus Pharmaceuticals </em>February 25, 2026 </li><li class=\"ml-8 list-decimal\">FDA Investigating Deaths Due to Acute Liver Failure Following Treatment with Sarepta’s AAVrh74 Gene Therapies. FDA. July 18, 2025. </li><li class=\"ml-8 list-decimal\">Sarepta Therapeutics Announces Fourth Quarter and Full-Year 2025 Financial Results and Recent Corporate Developments <em>Sarepta Therapeutics </em>February 25, 2026 </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/leadership-roundup-sarepta-therapeutics-ceo-announces-retirement-rivus-pharmaceuticals-appoints-new-ceo",
            "pub_date": "2026-02-26 22:48:45",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Alkermes Reveals CEO Succession Plan Following Richard Pops’ Retirement Announcement]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Alkermes is preparing for a leadership transition after more than three decades under Richard Pops, who is set to step down as chief executive officer on July 31, 2026.</p><p class=\"\">The company’s board has named current chief operating officer Blair Jackson as CEO effective Aug. 1, 2026, with Jackson also expected to join the board at that time.</p><p class=\"\">Following the transition, Pops will remain chairman and serve as an advisor to the executive team.<sup class=\"text-inherit\">1</sup></p><h1 class=\"pb-4 pt-2 text-3xl\">How was Pops’ tenure at Alkermes?</h1><p class=\"\">Pops joined the company back in 1991, four years after its founding, and oversaw its transformation from a 20-person drug delivery start-up into a commercial-stage neuroscience company generating approximately $1.5 billion in annual revenue.<sup class=\"text-inherit\">1</sup></p><p class=\"\">Over the course of his tenure, Alkermes built a portfolio of commercial medicines for serious mental illness and addiction while investing heavily in central nervous system innovation.</p><p class=\"\">“It has been a great honor to serve as CEO of Alkermes alongside so many dedicated colleagues over the years,” Pops said, reflecting on a tenure he described as guided by science, integrity and long-term value creation. “As I prepare to transition the CEO role to Blair later this year, I do so with immense pride in the company we’ve built and conviction in the company’s growth opportunity ahead.”</p><h1 class=\"pb-4 pt-2 text-3xl\">Why did Alkermes decide to make a leadership change?</h1><p class=\"\">Board leadership framed the succession as the result of a deliberate and structured planning process. Andy Wilson, lead independent director, credited Pops with shaping Alkermes’ strategy and culture and expressed confidence in Jackson’s ability to lead the company forward. “With his broad skillset and deep knowledge of the business, we are confident that Blair is the right leader to guide Alkermes into its next chapter of growth and impact,” Wilson said.</p><p class=\"\">Jackson, who has been with Alkermes since 1999, brings more than 25 years of experience spanning scientific, operational and corporate strategy roles. As chief operating officer since 2021, he has overseen global operations, quality, IT, business development and corporate planning.<sup class=\"text-inherit\">1</sup></p><p class=\"\">He played a central role in several strategic moves over the past few years, including the divestment of the oncology business, the sale of the Athlone manufacturing facility and the acquisition of Avadel.<sup class=\"text-inherit\">2</sup></p><p class=\"\">“I am honored to carry forward Alkermes’ legacy of working to address unmet needs of patients living with complex conditions in the neuroscience space,” Jackson said, emphasizing the company’s strong commercial base and advancing pipeline.</p><p class=\"\">As Alkermes pivots deeper into sleep medicine and orexin biology, the leadership transition signals continuity in strategy, even as a new CEO prepares to steer the company into its next chapter.</p><p class=\"\">Alkermes also recently completed an acquisition of Avadel Pharmaceuticals, adding an FDA-approved sleep product and bolstering its commercial capabilities in narcolepsy, moves designed to position the company for its next phase of growth.<sup class=\"text-inherit\">2 </sup>More recently, the company has sharpened its focus on sleep medicine and orexin agonism, an emerging therapeutic category in neuroscience.<sup class=\"text-inherit\">2</sup></p><p class=\"\"></p><h1 class=\"pb-4 pt-2 text-3xl\">Sources</h1><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">Alkermes plc Announces CEO Succession Plan <em>Alkermes PLC. </em>February 25, 2026 </li><li class=\"ml-8 list-decimal\">Alkermes plc Completes Acquisition of Avadel Pharmaceuticals plc, Accelerating Entry Into Sleep Medicine Market <em>Alkermes PLC. </em>February 12, 2026 </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/alkermes-reveals-ceo-succession-plan-following-richard-pops-retirement-announcement",
            "pub_date": "2026-02-26 22:25:43",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Leading in the Psychedelic Space: Q&A with Tarek Rabah]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">New research into psychedelics is unlocking potential new treatments in mental health and nephrology. Osuka America Pharmaceutical’s president and CEO Tarek Rabah spoke with <em>Pharmaceutical Executive</em> about the company’s mission and how its investing in psychedelics and other major areas.</p><p class=\"\"></p><p class=\"\"><em>Pharmaceutical Executive: How has Otsuka been a leader in the psychedelic-inspired medicine space?<br/></em><strong>Tarek Rabah:</strong> At Otsuka, we are passionate about serving healthcare needs worldwide and are committed to discovering treatments for complex diseases. This is foundational to our strategy as we pursue products and solutions that address persistent, unmet needs, in this case for patients living with treatment-resistant depression and PTSD.</p><p class=\"\">Using the same rigorous approach that has guided our CNS innovations for decades, we’re deliberately seeking innovation across this therapeutic area as science evolves, including new modalities and conditions that were previously untreatable. This approach led us to expand into psychedelic-inspired compounds six years ago.</p><p class=\"\">In 2020, Otsuka became the first major pharmaceutical company to invest in psychedelics with COMPASS Pathways, reflecting an early belief in its potential. We deepened that commitment in 2023 with the acquisition of Mindset, enabling us to advance promising compounds.</p><p class=\"\">Today, Otsuka is forging a path of scientific excellence around the development of emerging novel therapies, translating the science of serotonergic agonists to develop new chemical entities with the goal of offering new hope to people living with mental health disorders who may not benefit from existing therapies.</p><p class=\"\">We are working to ensure our health system is ready to keep pace with these treatments so patients can access them when they come to market.</p><p class=\"\"></p><p class=\"\"><em>PE: What is Otsuka’s broader external-innovation and deal-making strategy?<br/></em><strong>Rabah:</strong> At Otsuka, acquisitions and collaborations are an extension of our long-standing commitment to perseverance and clinical excellence. We partner with companies where we believe our expertise can help advance promising innovation and unlock more potential within Otsuka than they could on their own—ultimately maximizing the impact for patients worldwide.</p><p class=\"\"></p><p class=\"\"><em>PE: What is Otsuka’s acquisition strategy?<br/></em><strong>Rabah:</strong> We pursue acquisitions strategically and with the same rigor that has defined Otsuka’s research and development. We prioritize companies that are advancing promising mid- and late-stage compounds that align with our clinical expertise and build on our strong track record of discovering, developing, and commercializing best-in-class and first-and-only medicines.</p><p class=\"\">Company culture is also important, and we look for companies who share our mission to accelerate access to breakthroughs for underserved patients.</p><p class=\"\">This disciplined approach has allowed us to build a portfolio that balances focus with diversification, while also bringing in the talent and capabilities needed to fuel our next phase of growth.</p><p class=\"\">A recent example is our expansion into specialty autoimmune disease through the acquisition of Visterra in 2018, which included VOYXACT® (sibeprenlimab-szsi) that has recently received accelerated approval for reducing proteinuria in adults with primary IgAN at risk for disease progression.</p><p class=\"\"></p><p class=\"\"><em>PE: How will Otsuka leverage legacy in neuroscience?<br/></em><strong>Rabah:</strong> We’ll continue to ensure mental illnesses and brain diseases are approached with the same priority and urgency as physical health and recognized as chronic diseases that warrant early, equitable, and accessible intervention.</p><p class=\"\">From early research to commercialization, our expertise enables us to continue transforming what we can do in neuroscience, especially in serious mental illness. This includes a robust pipeline, including products such as an investigational compound for the treatment of ADHD and an exploratory treatment for major depressive disorder, general anxiety disorder, and schizophrenia. </p><p class=\"\">Going forward, we want to build on this expertise to ensure patients everywhere can access the treatment they need. From breaking down stigma and raising awareness for mental health conditions to addressing systemic barriers to accessing medication, we want to continue leading the charge towards quality mental health care for all patients.</p><p class=\"\"></p><p class=\"\"><em>PE: What is Otsuka’s strategy heading into the 2030’s?<br/></em><strong>Rabah:</strong> The next decade will be the most transformative period in Otsuka’s history. We see a clear opportunity—and responsibility—to invest where unmet need remains high, in CNS and nephrology, as well as moving decisively into immunology and rare disease.</p><p class=\"\">Right now, our autoimmune pipeline has several assets, including both antibody and small molecule compounds, some that target “undruggable” mechanisms. We have a clear roadmap and will continue to invest aggressively, steadily building a solid pipeline to become a next generation autoimmune leader in the next 10 years.</p> </div>",
            "link": "https://www.pharmexec.com/view/leading-psychedelic-space-tarek-rabah",
            "pub_date": "2026-02-26 19:00:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[What is the Reaction to DTC Pharma Advertising?]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> </div>",
            "link": "https://www.pharmexec.com/view/reaction-dtc-advertising",
            "pub_date": "2026-02-26 19:00:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        }
    ]
}