{
    "data": [
        {
            "title": "Pharma Organizations Respond to Proposed Tariffs",
            "description": "<div class=\"blockText_blockContent__TbCXh\"><div class=\"\"><div class=\"figure\" style=\"width:30%;float:right;max-width:525px;margin:0 0 1.5rem 1.5rem;clear:both;cursor:\"><div class=\"flex-none relative text-center\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%271200%27%20height=%27800%27/%3e\" style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\"/></span><img alt=\"Stock.adobe.com\" data-nimg=\"intrinsic\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Stock.adobe.com\"/><noscript><img alt=\"Stock.adobe.com\" data-nimg=\"intrinsic\" decoding=\"async\" loading=\"lazy\" src=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F03b5ef407e63ee22050882614707b2c4f42bf45d-1200x800.jpg%3Ffit%3Dcrop%26auto%3Dformat&amp;w=3840&amp;q=75\" srcset=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F03b5ef407e63ee22050882614707b2c4f42bf45d-1200x800.jpg%3Ffit%3Dcrop%26auto%3Dformat&amp;w=1200&amp;q=75 1x, /_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F03b5ef407e63ee22050882614707b2c4f42bf45d-1200x800.jpg%3Ffit%3Dcrop%26auto%3Dformat&amp;w=3840&amp;q=75 2x\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Stock.adobe.com\"/></noscript></span></div><div class=\"text-gray-500 italic\" id=\"image-caption\"><div class=\"blockText_blockContent__TbCXh\"><p class=\"pb-2\">Stock.adobe.com</p></div></div><div class=\"top-[-100%] block w-[1px] transition-opacity duration-500 ease-in-out opacity-0 overflow-hidden\"><img class=\"m-auto absolute inset-0 max-w-[0%] max-h-[0%] border-[3px] border-solid border-white shadow-[0px_0px_8px_rgba(0,0,0,0.3)] box-border transition ease-in-out duration-500\" src=\"https://cdn.sanity.io/images/0vv8moc6/pharmexec/03b5ef407e63ee22050882614707b2c4f42bf45d-1200x800.jpg?fit=crop&amp;auto=format\"/></div></div><style>\n          #image-caption p{\n            font-size: 12px;\n            max-width: 525px;\n            margin: 0 auto;\n            text-align: center;\n          }\n          </style></div><p class=\"pb-2\">President Donald Trump is set to impose tariffs on a variety of imported goods from China, Canada, Mexico, and possibly other countries. Reuters reported that Trump plans to place tariffs on various items including computer chips and pharmaceuticals.<sup class=\"text-inherit\">1</sup></p><p class=\"pb-2\">The President has argued that his tariffs would have a variety of positive impacts on the United States, such as pushing more companies to produce goods within the country. However, critics of the President say that these tariffs will increase costs for American consumers and even potentially cause disruptions in the availability of goods. For the pharmaceutical industry, this could have far-reaching implications.</p><p class=\"pb-2\">In a press release, president and CEO of the Association for Accessible Medicines John Murphy III said, “The global supply chain for generic and biosimilar medicines is critically important for U.S. patients.<sup class=\"text-inherit\">2</sup> From the base ingredients to the finished products, U.S. medicines rely on a global supply chain that is already stressed and in need of strengthening. Tariffs on products from Canada, Mexico, and China could increase already problematic drug shortages.”</p><p class=\"pb-2\">He continued to discuss the impact the tariffs could have on generic manufacturers, who often operate at lower margins. According to Murphy, the generics market in the US has grown in volume and launches, but sales have actually decreased by $6.4 billion in the past five years. As a result, these manufacturers could struggle to absorb new costs and may be forced to exit markets where they are already struggling.</p><p class=\"pb-2\">“Americans pay less for generics than almost anywhere in the world but are facing growing challenges of drug shortages,” he continued. “The previous Trump Administration opted not to impose tariffs on generic and biosimilar manufactures. AAM and its members urge the Administration to follow their past practice and work with our industry on constructive policies and regulatory reforms that will bolster the resiliency and vibrancy of this critical healthcare market to the benefit of the American economy, lower overall healthcare costs, and keeping America’s patients healthy.”</p><p class=\"pb-2\">The Healthcare Distribution Alliance (HDA) also issued a statement, saying that it believes that strategic investments in domestic manufacturing would result in positive change for the healthcare industry.<sup class=\"text-inherit\">3</sup> However, it also believes that the proposed tariffs would result in creating more challenges than solutions.</p><p class=\"pb-2\">“We respectfully urge caution on instituting tariffs on sectors that will impact medical products,” the HDA said in its statement. “Tariffs on pharmaceuticals would strain the pharmaceutical supply chain and could adversely affect American patients, whether through increased medical product costs or manufacturers leaving the market. Accordingly, we ask the administration to consider establishing exemptions for pharmaceutical products and long implementation timelines to maintain the safe and efficient delivery of approximately 10 million medicines and healthcare products every day.”</p><p class=\"pb-2\">The statement continued, “We are concerned that placing tariffs on generic drug products produced outside the U.S. will put additional pressure on an industry that is already experiencing financial distress. Distributors and generic manufacturers and cannot absorb the rising costs of broad tariffs. It is worth noting that distributors operate on low profit margins - 0.3 percent. As a result, the U.S. will likely see new and worsened shortages of important medications and the costs will be passed down to payers and patients, including those in the Medicare and Medicaid programs.”</p><p class=\"pb-2\">Aside from direct tariffs on pharmaceuticals, tariffs on computer chips and other technologies could strain the industry’s relationship with AI. Some of the proposed tariffs could also significantly impact power prices, which is already a significant cost for AI procedures.</p><p class=\"pb-2\">President Trump has laid out multiple targets for tariffs and has stated a variety of reasons for why he’s implementing these tariffs. At this stage, it’s still unclear what impact these tariffs will have and how the various industries involved will react. The only thing that’s clear is that this issue will likely impact major decisions across the pharma industry for the foreseeable future.</p><p class=\"pb-2\"></p><p class=\"pb-2\"></p><h2 class=\"text-2xl pb-4 pt-2\">Sources</h2><ol class=\"my-2\"><li class=\"list-decimal ml-8\">Trump Tariffs on Chips and Drugs Would Hit U.S. Allies in Asia. <em>Reuters</em>. January 28, 2025. https://www.reuters.com/world/trump-tariffs-chips-drugs-would-hit-us-allies-asia-2025-01-28/</li><li class=\"list-decimal ml-8\">Association for Accessible Medicines Comments on New Tariffs. <em>AAM</em>. February 2, 2025. https://accessiblemeds.org/resources/press-releases/aam-comments-new-tariffs/</li><li class=\"list-decimal ml-8\">HDA Statement on Proposed Tariffs of Pharmaceutical Products. <em>HDA</em>. February 2, 2025. https://www.publicnow.com/view/2525CA83682869F4874B9C804258FAD64F88899A?1738547314</li></ol></div>",
            "link": "https://www.pharmexec.com/view/organizations-respond-proposed-tariffs",
            "pub_date": "2025-02-04 00:13:28",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Future of EDETEK's R&D Cloud",
            "description": "<div class=\"blockText_blockContent__TbCXh\"><div class=\"relative\"><div autoplay=\"\" class=\"brightcove-fluid\"></div></div><p class=\"pb-2\">In this Pharmaceutical Executive video interview, Dr. Shakthi Kumar, Chief Strategy and Business Officer, EDETEK, Inc. further explores <a href=\"https://www.pharmexec.com/view/edetek-unveils-rdcloud-for-clinical-development\" target=\"_blank\">the company's launch of R&amp;D Cloud</a>, emphasizing the platform's open API access, extensive library of pre-built connectors for various data sources, and real-time data and workflow capabilities. </p><p class=\"pb-2\">He highlights key differentiators including the breadth and depth of integrated capabilities (covering the entire clinical trial lifecycle), robust workflow and event management, multi-SSO integration, and a state-of-the-art cloud architecture.<sup class=\"text-inherit\"> </sup></p><p class=\"pb-2\">Future development plans include incorporating AI, expanding connectors, and specializing in additional therapeutic areas. Ultimately, the R&amp;D Cloud aims to provide cost reduction, improved business outcomes (faster trials, real-time insights), and enhanced data quality and compliance for clients.</p><p class=\"pb-2\">A transcription of the conversation is available below.</p><h2 class=\"text-2xl pb-4 pt-2\">Are there future development plans for the R&amp;D Cloud ecosystem?</h2><p class=\"pb-2\">We have very ambitious development plans for the R&amp;D Cloud ecosystem. We continue to invest in a number of areas, and you know, I can probably highlight a few. We are incorporating advanced, of course, artificial intelligence capabilities within the RNA cloud, specifically agentic AI and machine learning technologies to drive better insights and decision making for our clients. So that's something that's ongoing.</p><p class=\"pb-2\">The second one is we are expanding the list of upstream and downstream connectors. This is to make it easy to integrate our R&amp;D Cloud, with other third-party software, and we expect to continue to partner with others. For us partnership is a key tenet of what we want to do, so we will continue to do that. And we will double down and specialize in other therapeutic areas as well. I talked about on cop loss, but next in the line, we're working on CNS and that immunology. So, I think we do believe that that provides, you know, significant benefits to the industry, you know, getting much needed therapies faster to patients. And so those are some of the areas we're looking at right now.</p><h2 class=\"text-2xl pb-4 pt-2\">How does the R&amp;D Cloud translate into tangible benefits for EDETEK's clients?</h2><p class=\"pb-2\">Tangibility comes in three different ways. The first one is the best metric for tangibility is cost reduction, so they can incrementally layer our R&amp;D Cloud offering in. To existing operational environments where there are gaps to really build an ecosystem. So, there is no need to replace an expensive, lift and shift of their existing environments, as well as costly integrations, because our on the cloud already comes prebuilt with over 80 different integrations with major software, so cost reduction is one.</p><p class=\"pb-2\">The second one is in terms of business outcomes. We do believe it has significantly helped our clients to improve the speed and efficiency of clinical trial execution. Miranda, just to give you an overview today, our platform is used by over 100 Life Sciences organizations. We have our conform platform. And eClinical platforms have managed over 3 billion data points, including many, many mega trials. In terms of business outcomes, we're very confident in driving faster study start up, as well as real time data insights and accelerated regulatory submissions, right? So that's kind of driving business outcomes. Is a key benefit to our clients.</p><p class=\"pb-2\">The third one is improved data quality and compliance. The platform, we have robust, you know, validation rules, we have alerts as well as a whole library of checks that we perform on the data that's ingested into the R&amp;D Cloud, which means that the data quality improves, as well as compliance to various regulatory standards, right? Those are kind of three tangible benefits, as I mentioned earlier, we are really excited for our clients that the dream of build your own R&amp;D Cloud is actually becoming a reality, and we here to support it.</p></div>",
            "link": "https://www.pharmexec.com/view/the-future-of-edetek-rdcloud",
            "pub_date": "2025-02-03 19:00:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IMU-856 Shows Promise in Celiac Disease: Histologic Protection and Nutrient Absorption Key to Advancing Trials",
            "description": "<div class=\"blockText_blockContent__TbCXh\"><p class=\"pb-2\"><strong></strong></p><div class=\"relative\"><div autoplay=\"\" class=\"brightcove-fluid\"></div></div><p class=\"pb-2\"><strong>PE: The phase Ib trial demonstrated improvements in histology, symptoms, biomarkers, and nutrient absorption. Which of these findings do you consider most critical for advancing IMU-856 to later-stage trials?</strong></p><p class=\"pb-2\"><strong>Vitt: </strong>IMU-856 is quite unique for GI indications, including celiac disease because it is not immunosuppressive, but it’s able to establish the proper epithelial layer in the gut wall. Therefore, the histologic protection, which even achieves statistical significance by the very small number of patients involved here. The key endpoint is protecting the gut from histologic distraction. It’s also important for the development. </p><p class=\"pb-2\">The second important endpoint is the functional improvement. I think this is something new and so far, not seen with other drugs or concepts, because if you restore the proper layer of cells there, then you also have more viable cells.</p><p class=\"pb-2\">These cells are actively transporting nutrients from the gut wall into the body. For example, one of the functional endpoints was vitamin B12 uptake. We could see that in the patients during the four weeks of treatment that despite receiving gluten and the gluten challenge, there was an improvement in the dose dependent fashion, which we think speaks for the speed and the quality of an onset of action for the driver.</p><p class=\"pb-2\"><strong>Full Interview Summary: </strong>The Phase Ib trial of IMU-856 demonstrated improvements across multiple endpoints, including histology, symptoms, biomarkers, and nutrient absorption. Among these, the most critical finding for advancing the drug to later-stage trials is its ability to restore the gut’s epithelial layer without immunosuppression. The drug achieved statistically significant histologic protection, even with a small patient sample, indicating its potential to preserve gut integrity. Additionally, functional improvements, such as increased vitamin B12 uptake despite gluten exposure, highlight its unique mode of action and rapid onset of efficacy.</p><p class=\"pb-2\">IMU-856 offers a promising solution for celiac disease patients, particularly those at risk of symptom flare-ups due to cross-contamination with small amounts of gluten. By strengthening the gut barrier, the drug could benefit patients with active and severe disease, who often struggle with inadvertent gluten exposure.</p><p class=\"pb-2\">Regarding safety and tolerability, the trial found IMU-856 to be well tolerated with no dose-dependent adverse events or maximum tolerated dose concerns. Chronic toxicology studies have also confirmed its potential for long-term use across various gastrointestinal disorders. The favorable safety profile allows for flexible dosing strategies, with the 160 mg dose already showing strong efficacy. Future studies may explore slight adjustments in dosage to optimize treatment.</p><p class=\"pb-2\">Immunic is positioning itself as a leader in gastrointestinal therapeutics, with celiac disease as the lead indication for IMU-856. However, the drug’s potential extends to conditions like Crohn’s disease, ulcerative colitis, and graft-versus-host disease. It could serve as a combination therapy alongside immunosuppressants in these conditions. With ongoing Phase III programs in neuroinflammation and multiple sclerosis, the company aims to establish itself at the forefront of both gastrointestinal and neuroinflammatory diseases. Collaborations and strategic partnerships will likely play a key role in expanding the drug’s applications.</p></div>",
            "link": "https://www.pharmexec.com/view/imu-856-promise-celiac-disease-histologic-protection-nutrient-absorption-advancing-trials",
            "pub_date": "2025-02-01 03:23:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FDA Approves Axsome Therapeutics’ Symbravo for Migraine with or without Aura",
            "description": "<div class=\"blockText_blockContent__TbCXh\"><div class=\"\"><div class=\"figure\" style=\"width:40%;float:right;max-width:525px;margin:0 0 1.5rem 1.5rem;clear:both;cursor:\"><div class=\"flex-none relative text-center\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%271280%27%20height=%27720%27/%3e\" style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\"/></span><img alt=\"Schlaganfall - Blutversorgung im Gehirn\" data-nimg=\"intrinsic\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Schlaganfall - Blutversorgung im Gehirn\"/><noscript><img alt=\"Schlaganfall - Blutversorgung im Gehirn\" data-nimg=\"intrinsic\" decoding=\"async\" loading=\"lazy\" src=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F310217c15cf2246b35664246708993e55519c20f-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=3840&amp;q=75\" srcset=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F310217c15cf2246b35664246708993e55519c20f-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=1920&amp;q=75 1x, /_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F310217c15cf2246b35664246708993e55519c20f-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=3840&amp;q=75 2x\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Schlaganfall - Blutversorgung im Gehirn\"/></noscript></span></div><div class=\"text-gray-500 italic\" id=\"image-caption\"><div class=\"blockText_blockContent__TbCXh\"><p class=\"pb-2\"><em>Image Credit: Adobe Stock Images/peterschreiber.media</em></p></div></div><div class=\"top-[-100%] block w-[1px] transition-opacity duration-500 ease-in-out opacity-0 overflow-hidden\"><img class=\"m-auto absolute inset-0 max-w-[0%] max-h-[0%] border-[3px] border-solid border-white shadow-[0px_0px_8px_rgba(0,0,0,0.3)] box-border transition ease-in-out duration-500\" src=\"https://cdn.sanity.io/images/0vv8moc6/pharmexec/310217c15cf2246b35664246708993e55519c20f-1280x720.png?fit=crop&amp;auto=format\"/></div></div><style>\n          #image-caption p{\n            font-size: 12px;\n            max-width: 525px;\n            margin: 0 auto;\n            text-align: center;\n          }\n          </style></div><p class=\"pb-2\">The FDA has approved Axsome Therapeutics’ Symbravo (meloxicam and rizatriptan), a novel acute treatment for adults with migraine with or without aura. According to the company, Symbravo employs Axsome’s MoSEIC rapid absorption technology to enhance meloxicam’s bioavailability while combining it with rizatriptan. Data from the Phase III MOMENTUM, INTERCEPT, and MOVEMENT trials showed Symbravo produced statistically significant pain freedom and symptom relief at two hours post-dose, with sustained benefits compared to placebo and rizatriptan alone.<sup class=\"text-inherit\">1</sup></p><p class=\"pb-2\">“A significant proportion of migraine patients experience inadequate efficacy with currently available acute treatments, leading to even greater suffering, and an increased risk of worsening of migraine pain and attack frequency. Results of multiple clinical trials demonstrate that Symbravo can provide rapid and long-lasting freedom from migraine pain, whether treatment is taken early in the attack while the pain is mild, or later in the attack when the pain may be severe. The approval of Symbravo is a long awaited and much welcomed advancement for clinicians and our patients, providing a new, meaningful treatment option,” said Richard B. Lipton, MD, professor of neurology, director, Montefiore Headache Center, Albert Einstein College of Medicine, in a press release.</p><p class=\"pb-2\">Results from the MOMENTUM trial found that found that Symbravo demonstrated statistically significant efficacy over placebo. Additionally, 77% of patients didn’t require rescue medication within 24 hours post dose. A head-to-head comparison with rizatriptan further highlighted Symbravo’s superiority in sustained pain freedom from two to 24 hours, with benefits observed after a single dose.</p><p class=\"pb-2\">Data from the INTERCEPT trial demonstrated results similar to those of the MOMENTUM trial in patients experiencing photophobia, phonophobia, and nausea two hours after dosing. Eighty-five percent of patients in the trial did not require rescue medication within 24 hours post dose.</p><p class=\"pb-2\">The long-term open label MOVEMENT safety trial consisted of 706 patients to determine the long-term safety of Symbravo. Common adverse events included somnolence and dizziness.<sup class=\"text-inherit\">1</sup></p><p class=\"pb-2\">According to a study published in the <em>JAMA Network, </em>approximately 10% of the global population can experience migraines. Additionally, migraines are most prevalent in people between 20 and 50 years of age. Further, it is three times more common in women than in men.<sup class=\"text-inherit\">2</sup> According to the World Health Organization (WHO), children usually experience shorter migraines than adults, although abdominal symptoms are more common.</p><p class=\"pb-2\">WHO estimates that headache disorders as a whole affect approximately 40% of the global population. Additionally, headaches are the third highest cause of disability-adjusted life years globally, behind only stroke and dementia. It is among the three most common neurological conditions in most age groups between five and 80 years of age. Other common forms of headache include tension-type headache, cluster headache, and medication-overuse headache.<sup class=\"text-inherit\">3</sup></p><p class=\"pb-2\">“Today’s approval of Symbravo marks an important milestone for the migraine community by providing a rationally designed novel acute treatment for this debilitating condition. Migraine attacks strike without warning and disrupt the lives of estimated more than 39 million patients in the US alone. Symbravo provides patients and clinicians an important new option which can quickly stop a migraine attack, keep it away, and allow patients to resume their normal activities, with just a single dose. Symbravo demonstrates Axsome’s commitment to developing and delivering differentiated new treatments to improve the lives of patients living with difficult to treat central nervous system disorders,” said Herriot Tabuteau, MD, CEO, Axsome Therapeutics, in the press release.</p><p class=\"pb-2\"><strong>References</strong></p><p class=\"pb-2\">1. Axsome Therapeutics Announces FDA Approval of SYMBRAVO® (meloxicam and rizatriptan) for the Acute Treatment of Migraine with or without Aura in Adults. <em>Axsome Therapeutics. </em>January 30, 2025. Accessed January 31, 2025. https://axsometherapeuticsinc.gcs-web.com/news-releases/news-release-details/axsome-therapeutics-announces-fda-approval-symbravor-meloxicam</p><p class=\"pb-2\">2. What Is Migraine? <em>JAMA. </em>Accessed January 31, 2025. https://jamanetwork.com/journals/jama/fullarticle/2787727#:~:text=Migraine%20affects%20an%20estimated%20more,Are%20Episodic%20and%20Chronic%20Migraine?</p><p class=\"pb-2\">3. Migraine and other headache disorders. <em>WHO. </em>March 6, 2024. Accessed January 31, 2025. https://www.who.int/news-room/fact-sheets/detail/headache-disorders</p></div>",
            "link": "https://www.pharmexec.com/view/fda-approves-axsome-therapeutics-symbravo-migraine-with-without-aura",
            "pub_date": "2025-02-01 02:24:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FDA Approves Vertex Pharmaceuticals’ First-in-Class Non-Opioid Journavx for Moderate-to-Severe Acute Pain",
            "description": "<div class=\"blockText_blockContent__TbCXh\"><div class=\"\"><div class=\"figure\" style=\"width:40%;float:right;max-width:525px;margin:0 0 1.5rem 1.5rem;clear:both;cursor:\"><div class=\"flex-none relative text-center\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%271280%27%20height=%27720%27/%3e\" style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\"/></span><img alt=\"High-resolution illustration of nerve pain across male and female bodies, focusing on areas most affected by nerve-related issues. Pain points are color-coded for clarity on a neutral background. Image Credit: Adobe Stock Images/bird_saranyoo\" data-nimg=\"intrinsic\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"High-resolution illustration of nerve pain across male and female bodies, focusing on areas most affected by nerve-related issues. Pain points are color-coded for clarity on a neutral background. Image Credit: Adobe Stock Images/bird_saranyoo\"/><noscript><img alt=\"High-resolution illustration of nerve pain across male and female bodies, focusing on areas most affected by nerve-related issues. Pain points are color-coded for clarity on a neutral background. Image Credit: Adobe Stock Images/bird_saranyoo\" data-nimg=\"intrinsic\" decoding=\"async\" loading=\"lazy\" src=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F9e21938c153704b0d9dd5ebf5fd33fd7df594180-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=3840&amp;q=75\" srcset=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F9e21938c153704b0d9dd5ebf5fd33fd7df594180-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=1920&amp;q=75 1x, /_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F9e21938c153704b0d9dd5ebf5fd33fd7df594180-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=3840&amp;q=75 2x\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"High-resolution illustration of nerve pain across male and female bodies, focusing on areas most affected by nerve-related issues. Pain points are color-coded for clarity on a neutral background. Image Credit: Adobe Stock Images/bird_saranyoo\"/></noscript></span></div><div class=\"text-gray-500 italic\" id=\"image-caption\"><div class=\"blockText_blockContent__TbCXh\"><p class=\"pb-2\"><em>Image Credit: Adobe Stock Images/bird_saranyoo</em></p></div></div><div class=\"top-[-100%] block w-[1px] transition-opacity duration-500 ease-in-out opacity-0 overflow-hidden\"><img class=\"m-auto absolute inset-0 max-w-[0%] max-h-[0%] border-[3px] border-solid border-white shadow-[0px_0px_8px_rgba(0,0,0,0.3)] box-border transition ease-in-out duration-500\" src=\"https://cdn.sanity.io/images/0vv8moc6/pharmexec/9e21938c153704b0d9dd5ebf5fd33fd7df594180-1280x720.png?fit=crop&amp;auto=format\"/></div></div><style>\n          #image-caption p{\n            font-size: 12px;\n            max-width: 525px;\n            margin: 0 auto;\n            text-align: center;\n          }\n          </style></div><p class=\"pb-2\">The FDA has approved Vertex Pharmaceuticals’ Journavx (suzetrigine), a first-in-class, non-opioid pain signal inhibitor for adults with moderate-to-severe acute pain. According to the company, the treatment selectively targets NaV1.8 channels, offering effective pain relief without evidence of addictive potential, marking the first new class of acute pain medication approved in over 20 years.<sup class=\"text-inherit\">1</sup></p><p class=\"pb-2\">“Today’s approval is a historic milestone for the 80 million people in America who are prescribed a medicine for moderate-to-severe acute pain each year,” said Reshma Kewalramani, MD, CEO, president, Vertex, in a press release. “With the approval of Journavx, a non-opioid, pain signal inhibitor and the first new class of pain medicine approved in more than 20 years, we have the opportunity to change the paradigm of acute pain management and establish a new standard of care.”</p><p class=\"pb-2\">The approval was based on data from two Phase II randomized, double-blind, placebo-controlled trials involving patients experiencing acute pain after abdominoplasty or bunionectomy.<sup class=\"text-inherit\">2</sup></p><p class=\"pb-2\">A total of 303 patients were enrolled in the abdominoplasty trial and 274 in the bunionectomy trial. The primary endpoint was the time-weighted sum of the pain-intensity difference (SPID) over a 48-hour period. Secondary endpoints included the time-weighted SPID between Journavx and placebo over a 24-hour period and the percentages of participants with a reduction in pain of at least 30%, 50%, and 70%.</p><p class=\"pb-2\">In the bunionectomy trial, 90.1% of patients completed the trial, while 81.5% of patients completed the abdominoplasty trial. Compared to placebo, the least-squares mean differences of pain reduction was 37.8 in abdominoplasty and 36.8 in bunionectomy, with a consistent effect over 48 hours.</p><p class=\"pb-2\">Common adverse events (AEs) included nausea, headache, and constipation, with headache occurring in 14% of high-dose patients compared to 6% for placebo patients. No serious AEs were reported as a result of Journavx.</p><p class=\"pb-2\">Despite the trial’s success, there were a number of limitations. including a predominantly female population, use of Journavx as monotherapy for settings in which multimodal analgesia is standard, and the absence of a direct comparison with hydrocodone bitartrate–acetaminophen. Phase III trials aim to further evaluate the treatment’s efficacy against standard analgesics. Measures such as staff training and a double-dummy design were implemented to minimize bias, though no assessment of participant blinding was conducted.<sup class=\"text-inherit\">2</sup></p><p class=\"pb-2\">According to Vertex, approximately 80 million people in the United States receive medicine as a result of acute pain annually. Nearly half are prescribed an opioid to manage their discomfort each year. However, it is not uncommon for these patients to experience opioid use disorder up to a year following treatment, with data showing that around 85,000 people in the United States will develop the condition annually. Currently, patients can be prescribed acetaminophen or nonsteroidal anti-inflammatory drugs as alternatives, but these may have limited efficacy, particularly for moderate-to-severe acute pain.<sup class=\"text-inherit\">3</sup></p><p class=\"pb-2\">“This is an incredible day for patients and physicians alike who now have an approved non-opioid treatment that delivers effective acute pain relief and a favorable safety profile without addictive potential,” said Jessica Oswald, MD, MPH, associate physician in emergency Medicine and pain medicine, San Diego, Vertex acute pain steering committee member, in the press release. “I believe Journavx could redefine the management of pain and become a foundational treatment option for people with all types of moderate-to-severe acute pain, where options aside from opioids have been so desperately needed.”</p><p class=\"pb-2\"><strong>References</strong></p><p class=\"pb-2\">1. Vertex Announces FDA Approval of JOURNAVX™ (suzetrigine), a First-in-Class Treatment for Adults With Moderate-to-Severe Acute Pain. <em>Vertex. </em>January 30, 2025. Accessed January 31, 2025. https://news.vrtx.com/news-releases/news-release-details/vertex-announces-fda-approval-journavxtm-suzetrigine-first-class</p><p class=\"pb-2\">2. Selective Inhibition of NaV1.8 with VX-548 for Acute Pain. <em>The New England Journal of Medicine. </em>Accessed January 31, 2025. https://www.nejm.org/doi/full/10.1056/NEJMoa2209870</p><p class=\"pb-2\">3. The state of pain in America. <em>Vertex. </em>October 8, 2024. Accessed January 31, 2025. https://www.vrtx.com/stories/state-pain-america/</p></div>",
            "link": "https://www.pharmexec.com/view/fda-approves-vertex-pharmaceuticals-first-class-non-opioid-journavx-moderate-severe-acute-pain",
            "pub_date": "2025-02-01 01:37:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Why Frontline Sales Have and Will Continue to be a Foundation for Long-term Career Success",
            "description": "<div class=\"blockText_blockContent__TbCXh\"><div class=\"\"><div class=\"figure\" style=\"width:40%;float:right;max-width:525px;margin:0 0 1.5rem 1.5rem;clear:both;cursor:\"><div class=\"flex-none relative text-center\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%27942%27%20height=%271100%27/%3e\" style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\"/></span><img alt=\"Paul Ollinger is a writer, stand-up comedian, and host of the Reasonably Happy podcast \" data-nimg=\"intrinsic\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Paul Ollinger is a writer, stand-up comedian, and host of the Reasonably Happy podcast \"/><noscript><img alt=\"Paul Ollinger is a writer, stand-up comedian, and host of the Reasonably Happy podcast \" data-nimg=\"intrinsic\" decoding=\"async\" loading=\"lazy\" src=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F0115087be7b6f0a662769336fb8d8f53dd2e7af9-942x1100.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=1920&amp;q=75\" srcset=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F0115087be7b6f0a662769336fb8d8f53dd2e7af9-942x1100.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=1080&amp;q=75 1x, /_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F0115087be7b6f0a662769336fb8d8f53dd2e7af9-942x1100.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=1920&amp;q=75 2x\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Paul Ollinger is a writer, stand-up comedian, and host of the Reasonably Happy podcast \"/></noscript></span></div><div class=\"text-gray-500 italic\" id=\"image-caption\"><div class=\"blockText_blockContent__TbCXh\"><p class=\"pb-2\">Paul Ollinger is a writer, stand-up comedian, and host of the Reasonably Happy podcast.</p></div></div><div class=\"top-[-100%] block w-[1px] transition-opacity duration-500 ease-in-out opacity-0 overflow-hidden\"><img class=\"m-auto absolute inset-0 max-w-[0%] max-h-[0%] border-[3px] border-solid border-white shadow-[0px_0px_8px_rgba(0,0,0,0.3)] box-border transition ease-in-out duration-500\" src=\"https://cdn.sanity.io/images/0vv8moc6/pharmexec/0115087be7b6f0a662769336fb8d8f53dd2e7af9-942x1100.png?fit=crop&amp;auto=format\"/></div></div><style>\n          #image-caption p{\n            font-size: 12px;\n            max-width: 525px;\n            margin: 0 auto;\n            text-align: center;\n          }\n          </style></div><p class=\"pb-2\">Paul Ollinger is a writer, stand-up comedian, and host of the <a href=\"https://podcasts.apple.com/us/podcast/reasonably-happy-with-paul-ollinger/id1452395408\" rel=\"nofollow\" target=\"_self\">Reasonably Happy podcast</a> (fka, Crazy Money). Prior to his pivot to the entertainment industry, Ollinger worked in a variety of sales roles including LAUNCH.com, Yahoo and Facebook (now Meta) where he was vice president of West Coast Sales and one of the first 250 employees. Ollinger earned his MBA from Dartmouth's Tuck School.</p><p class=\"pb-2\"><strong>Q</strong>. For years, recently minted MBA marketing hires for biopharma firms had to first take on a frontline sales position before moving into such HQ-based roles. For some, it was seen as an unnecessary, but required, steppingstone of mundane tactics before taking on a perceived more strategic role within the company. Given your experience working across several different companies, what advice would you give to 2025’s upcoming business school graduates?</p><p class=\"pb-2\"><strong>A. Ollinger</strong>: First, people need to stop placing a scarlet letter on sales roles. A lot of people conflate “sales” with the archetypal “used car salesperson,” but there’s a big difference between scamming some guy on a car lot and providing complex solutions for your clients, and that’s what sales is – solving problems. Taking on sales positions early in my career positioned me to have a job today that I actually enjoy doing.</p><p class=\"pb-2\">Second, strive to secure employment within a sector that is growing and a role in which you actually have an interest. While it seems simple, many business school students follow the lucrative tracks of consulting and finance without truly understanding what these jobs entail.</p><p class=\"pb-2\">For example, unless things have changed dramatically, I would guess that Tuck grads still pursue these two verticals because the compensation is great.<sup class=\"text-inherit\">1</sup> (<em>Note: Per Dartmouth’s recent MBA employment report, nearly 70% of Tuck’s Class of 2024 went into consulting/finance roles. The median starting compensation packages were over $200k</em>.)</p><p class=\"pb-2\">Still, while the pay might be terrific,<sup class=\"text-inherit\">2</sup> you have to envision what the job entails. Talk to young alums who are doing these jobs and figure out if the work sounds compelling. If a job is cranking out spreadsheets or PowerPoint slides for 14 hours per day, maybe it’s not for you.</p><p class=\"pb-2\">When I graduated from Tuck 28 years ago, I had offers from a couple of consulting firms. The money was attractive given that I was $80k in debt—in 1997 dollars—and had maybe $2500 in my checking account. While I had grown up in a nice enough middle-class neighborhood, money was tight. A story that’s humorous in retrospect is from the first time I got a cavity filled. Right as I’m walking into see the dentist, my dad said, “Don’t get the Novocaine, it’s $20.” My dad was the greatest guy ever, but he was so lacking in material desires that sometimes he forgot that other people valued luxuries…like anesthesia.<sup class=\"text-inherit\">3</sup></p><p class=\"pb-2\">Point being, the consulting pay was very tempting to me. But I just wanted to feel excited about my job. And I had a gnawing feeling that I would be unhappy as a consultant. So, in spring of second year, I turned down those offers and started my job search over. It was funny, I actually spoke at our convocation as one of the few new graduates who hadn’t found a job yet. After my speech, I was approached by the then CEO of Procter &amp; Gamble whose son was in my class. He said very nice things about my talk, then asked where I would be working next year.</p><p class=\"pb-2\">“Still working on that,” I replied, deciding not to tell him that I had interviewed with his firm, but had not earned a job offer. A few weeks later, I got an offer from a start-up company in the digital media space, thus beginning a career that would take me to Yahoo and, eventually, Facebook where I was one of the first 250 employees.</p><p class=\"pb-2\">I was one of maybe three or four of my classmates who went into the still nascent internet business, but it paid off immensely. When I graduated from Tuck, Mark Zuckerberg was 13. I had no way of knowing what the future held in store, but because I chose an industry that excited me, I worked hard and with passion. And when the social media firm came calling, I had the skills and network that could contribute a tiny amount to their early success. Because that job went so well, I now enjoy the financial independence that allows me to pursue a job in the creative world.</p><p class=\"pb-2\"><strong>Q</strong>. Why are sales skills important?</p><p class=\"pb-2\"><strong>A</strong>. <strong>Ollinger</strong>: Tuck, like a lot of the top business schools, emphasizes the value of communications for its students. But many of my classmates—especially the quant jock guys headed to Wall Street—considered comms a waste of time. But people forget that when you enter consulting and i-banking, the way you climb the ladder is to close more and more business. You don’t make managing director without proving your ability to bring in the revenue. You have to know how to sell.</p><p class=\"pb-2\">For those MBA graduates starting their biopharma apprenticeships on the front line trying to convince doctors to prescribe prescription medicines, they have to be able to communicate effectively when meeting with busy doctors who likely have decades of scientific education. You have a very limited amount of time to gain this person’s confidence. It can be very stressful, so you have to understand their needs, open strong, and persuade them to your solution in a hurry. It’s not as intuitive as it sounds.</p><p class=\"pb-2\">When I was at Facebook, I led a team that accounted for about 33% of the company’s revenue. The more you bring in, the larger your subsequent goals will be. You have to know how to negotiate with clients but also with internal stakeholders. Forecasting and quota management is an art, as I’ve joked with others.<sup class=\"text-inherit\">4</sup></p><p class=\"pb-2\">Also, while emerging technologies like ChatGPT can help in some ways, you have to be able to communicate on your own in whatever industry you choose. For example, if you cannot crisply convey, in a face-to-face meeting with a CFO, a reason for the consulting or banking engagement to be extended, you are not going to hit your sales target. So my call to action for your student readers is to invest time in those communication classes at your school and think hard before jumping into that first post-MBA role</p><p class=\"pb-2\"><strong>Q</strong>: How does a Tuck MBA lead to a job as a stand-up comedian?</p><p class=\"pb-2\"><strong>A. Ollinger</strong>: I went to business school because I wanted to make more money. By chance, I was asked to host a talent show in the second semester of my first year, and I made fun of my friends for 15 minutes. That was the night I was bit by the comedy bug. All of a sudden, comedy was what I wanted to do, but I had accumulated massive student debt, and I knew I had to pay it off. Through a combination of picking the right industry/function, hard work, and good fortune, I paid it off quickly, and am now able to work as a comedian full-time. Obviously, it took a long time, but it’s a good example of how the decisions you make now will have long-lasting repercussions.</p><p class=\"pb-2\">Good luck to your readers as they pursue their career aspirations.</p><p class=\"pb-2\"><strong>About the Author</strong></p><p class=\"pb-2\"><em>Michael Wong is a part-time Lecturer for the Wharton Communication Program at the University of Pennsylvania. As an Emeritus Co-President and board member of the Harvard Business School Healthcare Alumni Association as well as a Contributing Writer for the MIT Sloan Career Development Office, Michael’s ideas have been shared in the Harvard Business Review and MIT Sloan Management Review.</em></p><p class=\"pb-2\"><strong>References</strong></p><p class=\"pb-2\">1. https://www.tuck.dartmouth.edu/mba/career-services/employment-statistics</p><p class=\"pb-2\">2. https://www.tuck.dartmouth.edu/mba/career-services/employment-statistics</p><p class=\"pb-2\">3. https://www.aol.com/kid-dad-asked-skip-anesthetic-120401179.html</p><p class=\"pb-2\">4. https://www.linkedin.com/pulse/sales-quota-stress-paul-ollinger/</p></div>",
            "link": "https://www.pharmexec.com/view/frontline-sales-foundation-career-success",
            "pub_date": "2025-01-31 21:48:29",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Senior Senators Introduce Bill to Force DTC Drug Advertisements to Include List Price",
            "description": "<div class=\"blockText_blockContent__TbCXh\"><div class=\"\"><div class=\"figure\" style=\"width:30%;float:right;max-width:525px;margin:0 0 1.5rem 1.5rem;clear:both;cursor:\"><div class=\"flex-none relative text-center\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%27460%27%20height=%27307%27/%3e\" style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\"/></span><img alt=\"Stock.adobe.com\" data-nimg=\"intrinsic\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Stock.adobe.com\"/><noscript><img alt=\"Stock.adobe.com\" data-nimg=\"intrinsic\" decoding=\"async\" loading=\"lazy\" src=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2Fdef6c5f2e769ff5e04e0e6a403e665a2885576f2-460x307.jpg%3Ffit%3Dcrop%26auto%3Dformat&amp;w=1080&amp;q=75\" srcset=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2Fdef6c5f2e769ff5e04e0e6a403e665a2885576f2-460x307.jpg%3Ffit%3Dcrop%26auto%3Dformat&amp;w=640&amp;q=75 1x, /_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2Fdef6c5f2e769ff5e04e0e6a403e665a2885576f2-460x307.jpg%3Ffit%3Dcrop%26auto%3Dformat&amp;w=1080&amp;q=75 2x\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Stock.adobe.com\"/></noscript></span></div><div class=\"text-gray-500 italic\" id=\"image-caption\"><div class=\"blockText_blockContent__TbCXh\"><p class=\"pb-2\">Stock.adobe.com</p></div></div><div class=\"top-[-100%] block w-[1px] transition-opacity duration-500 ease-in-out opacity-0 overflow-hidden\"><img class=\"m-auto absolute inset-0 max-w-[0%] max-h-[0%] border-[3px] border-solid border-white shadow-[0px_0px_8px_rgba(0,0,0,0.3)] box-border transition ease-in-out duration-500\" src=\"https://cdn.sanity.io/images/0vv8moc6/pharmexec/def6c5f2e769ff5e04e0e6a403e665a2885576f2-460x307.jpg?fit=crop&amp;auto=format\"/></div></div><style>\n          #image-caption p{\n            font-size: 12px;\n            max-width: 525px;\n            margin: 0 auto;\n            text-align: center;\n          }\n          </style></div><p class=\"pb-2\">Direct-to-consumer advertising can be a controversial topic in the pharma industry. While the US isn’t the only other country to allow this type of marketing, it isn’t common in other high-income countries. While there are arguments for and against this practice, a new proposed bill could have a major impact on this practice in the United States.</p><p class=\"pb-2\">Senators Dick Durbin (D-Illinois) and Chuck Grassley (R-Iowa) introduced the <em>Drug-price Transparency for Consumers (DTC) Act</em>, a bill that would require DTC advertisements for prescription drugs to include the list price of the medication. According to a statement from Durbin, the point of the bill is to provide customers enough information to make informed decisions, while also forcing pharmaceutical companies to alter the decision-making process when it comes to drug pricing.</p><p class=\"pb-2\">In a press release, Durbin explained, “Pharmaceutical advertising is a uniquely American phenomenon that contributes to the astronomical cost of prescription drugs. With billions of dollars in targeted spending, patients are bombarded with commercials for the latest ‘wonder-drug’ but kept in the dark about one crucial factor—price. This practice of pushing patients toward the most expensive drugs drives up the cost of health care while undermining the role of doctors.A healthy dose of transparency is the prescription Big Pharma needs. Senator Grassley and I have introduced the DTC Act to shine light on the real costs of medications in these outrageous commercials.”</p><p class=\"pb-2\">In the same statement, Grassley added, “Knowing what something costs before buying it is just common sense. Disclosing the list price of prescription drugs in advertisements is a no-nonsense way to empower health care consumers to make informed decisions about their care.It also spurs competition, which leads to lower prescription drug costs.”</p><p class=\"pb-2\">It’s worth noting that while many bills are introduced that don’t become laws, this specific proposal is somewhat unique. Not only is it a bipartisan effort, both Senators involved are senior members of their parties. Chuck Grassley is also president pro tempore of the United States Senate, which places him behind just the Vice President and Speaker of the House in the line of succession for the President.</p><p class=\"pb-2\">The following senators have signed on as cosponsors to the bill: Angus King (I-Maine), Joni Ernst (R-Iowa), Tina Smith (D-Minnesota), Peter Welch (D-Vermont), Richard Blumenthal (D-Connecticut), and Tammy Baldwin (D-Wisconsin). The bill is also endorsed by the AARP, AMA, and several other medical major medical associations.</p><p class=\"pb-2\">According to Durbin’s statement, the bill has strong support amongst Americans. A Kaiser survey revealed that 88% of Americans agree that DTC advertising should include the price of the medication.</p><p class=\"pb-2\"></p><h2 class=\"text-2xl pb-4 pt-2\">Source</h2><ol class=\"my-2\"><li class=\"list-decimal ml-8\">Durbin, Grassley Introduce Bill To Crack Down On Prescription Drug Advertisements, Boost Price Transparency. <em>Dick Durbin</em>. January 23, 2025. Accessed January 30, 2025. https://www.durbin.senate.gov/newsroom/press-releases/durbin-grassley-introduce-bill-to-crack-down-on-prescription-drug-advertisements-boost-price-transparency</li></ol></div>",
            "link": "https://www.pharmexec.com/view/grassley-durbin-dtc-price-bill",
            "pub_date": "2025-01-31 19:01:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pharma Pulse 1/31/25: What Round II of Medicare Part D Drug Prices Signify, 2025 Digital Healthcare Outlook & more",
            "description": "<div class=\"blockText_blockContent__TbCXh\"><p class=\"pb-2\"><a href=\"https://www.pharmaceuticalcommerce.com/view/round-ii-medicare-part-d-drug-prices-pharma-industry\" target=\"_blank\"><strong>What Round II of Medicare Part D Drug Prices Signify for the Pharma Industry</strong></a></p><p class=\"pb-2\">In the first part of his video interview with Pharma Commerce Editor Nicholas Saraceno, value &amp; access advisor for Schoonveld Advisory and author of The Price of Global Health, Ed Schoonveld, comments on the future implications of the latest CMS drug price negotiations.</p><p class=\"pb-2\"><a href=\"https://www.managedhealthcareexecutive.com/view/2025-digital-healthcare-outlook-compliance-security-and-collaboration\" target=\"_blank\"><strong>2025 Digital Healthcare Outlook: Compliance, Security and Collaboration</strong></a></p><p class=\"pb-2\">Some regulatory changes are already set to happen this year, but reduced regulation under the new administration could have a ripple effects in healthcare. Meanwhile, artificial intelligence is likely to have pronounced impact on nonclinical workflows in 2025.</p><p class=\"pb-2\"><a href=\"https://www.bloomberg.com/news/articles/2025-01-30/takeda-announces-us-head-kim-to-replace-weber-as-ceo\" rel=\"nofollow\" target=\"_self\"><strong>Takeda Picks First Woman as CEO of Centuries-Old Drugmaker</strong></a></p><p class=\"pb-2\">Julie Kim is set to replace Christophe Weber as the new chief executive officer of Takeda Pharmaceutical Co., becoming the first woman to lead the more than 240-year-old Japanese drugmaker.</p><p class=\"pb-2\"><a href=\"https://www.businesswire.com/news/home/20250130378256/en\" rel=\"nofollow noreferrer noopener\" target=\"_blank\"><strong>Topography Health Survey Shows that Clinical Research Programs Boost Physician Engagement</strong></a></p><p class=\"pb-2\">Topography Health announced findings from a late 2024 survey, targeting US-based healthcare CFOs, COOs, and administrators who are actively managing clinical research programs around the clinical research experience of healthcare practices and systems.</p><p class=\"pb-2\"><a href=\"https://www.linkedin.com/feed/update/urn:li:ugcPost:7290746100083249152/?actorCompanyId=3574274\" rel=\"nofollow noreferrer noopener\" target=\"_blank\"><strong>Miranda Schmalfuhs on LinkedIn</strong></a></p><p class=\"pb-2\">You may have seen my multi-part video interview with Lawrence Werlin, MD, but there was more to our conversation that didn't make the final cut!</p><p class=\"pb-2\">Check out some of those bonus insights in this brand new episode of the <a href=\"https://www.linkedin.com/feed/update/urn:li:ugcPost:7290746100083249152/?actorCompanyId=3574274#\" rel=\"nofollow\" target=\"_self\">Pharmaceutical Executive</a> podcast!</p><p class=\"pb-2\"><em>Have news you want us to share in Pharma Pulse? Reach out to Editor <a href=\"mailto:mschmalfuhs@mjhlifesciences.com\" rel=\"nofollow\" target=\"_self\"><span style=\"text-decoration:underline\">Miranda Schmalfuhs</span></a></em> </p></div>",
            "link": "https://www.pharmexec.com/view/pharma-pulse-1-31-25-",
            "pub_date": "2025-01-31 19:00:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Roundup: Top Pharma Companies Report Q4 Earnings, Highlighting Revenue Trends and Market Shifts",
            "description": "<div class=\"blockText_blockContent__TbCXh\"><div class=\"\"><div class=\"figure\" style=\"width:40%;float:right;max-width:525px;margin:0 0 1.5rem 1.5rem;clear:both;cursor:\"><div class=\"flex-none relative text-center\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%271280%27%20height=%27720%27/%3e\" style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\"/></span><img alt=\"Medicine and money. Vials of antibiotics, white anti-virus tablets, and a medical syringe with a needle. The financing of medicine and the profits of pharmaceutical companies. Image Credit: Adobe Stock Images/Kost9\" data-nimg=\"intrinsic\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Medicine and money. Vials of antibiotics, white anti-virus tablets, and a medical syringe with a needle. The financing of medicine and the profits of pharmaceutical companies. Image Credit: Adobe Stock Images/Kost9\"/><noscript><img alt=\"Medicine and money. Vials of antibiotics, white anti-virus tablets, and a medical syringe with a needle. The financing of medicine and the profits of pharmaceutical companies. Image Credit: Adobe Stock Images/Kost9\" data-nimg=\"intrinsic\" decoding=\"async\" loading=\"lazy\" src=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F36b3d0a9eb1baa200d157517562b81504f02ce67-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=3840&amp;q=75\" srcset=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F36b3d0a9eb1baa200d157517562b81504f02ce67-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=1920&amp;q=75 1x, /_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F36b3d0a9eb1baa200d157517562b81504f02ce67-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=3840&amp;q=75 2x\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Medicine and money. Vials of antibiotics, white anti-virus tablets, and a medical syringe with a needle. The financing of medicine and the profits of pharmaceutical companies. Image Credit: Adobe Stock Images/Kost9\"/></noscript></span></div><div class=\"text-gray-500 italic\" id=\"image-caption\"><div class=\"blockText_blockContent__TbCXh\"><p class=\"pb-2\"><em>Image Credit: Adobe Stock Images/Kost9</em></p></div></div><div class=\"top-[-100%] block w-[1px] transition-opacity duration-500 ease-in-out opacity-0 overflow-hidden\"><img class=\"m-auto absolute inset-0 max-w-[0%] max-h-[0%] border-[3px] border-solid border-white shadow-[0px_0px_8px_rgba(0,0,0,0.3)] box-border transition ease-in-out duration-500\" src=\"https://cdn.sanity.io/images/0vv8moc6/pharmexec/36b3d0a9eb1baa200d157517562b81504f02ce67-1280x720.png?fit=crop&amp;auto=format\"/></div></div><style>\n          #image-caption p{\n            font-size: 12px;\n            max-width: 525px;\n            margin: 0 auto;\n            text-align: center;\n          }\n          </style></div><p class=\"pb-2\">Multiple pharma companies have released their 2024 Q4 earnings, highlighting total sales, operational growth, full-year sales growth, and increased investments.</p><p class=\"pb-2\"><strong><span style=\"text-decoration:underline\">Johnson &amp; Johnson</span></strong></p><p class=\"pb-2\">Earlier this month, Johnson &amp; Johnson (J&amp;J) released its full Q4 earnings report. According to the company, its innovative medicine division grew by 7.5% outside of its COVID-19 vaccine. Treatments that supported this growth included Darzalex (daratumumab), Erleada (apalutamide), Carvykti (ciltacabtagene autoleucel), Tremfya (guselkumab), and Spravato (esketamine). Additionally, MedTech grew by 6.2%, primarily due to electrophysiology products.<sup class=\"text-inherit\">1</sup></p><p class=\"pb-2\">“2024 was a transformative year for Johnson &amp; Johnson, marked by strong growth, an accelerating pipeline and industry-leading investments in innovation,” said Joaquin Duato, chairman, CEO, Johnson &amp; Johnson, in a press release. “As a healthcare company, with a disease-centric approach, we are improving the standard of care in a broad range of diseases with high unmet need, including multiple myeloma, lung cancer, inflammatory bowel disease, and heart failure. With our strong financial foundation, differentiated portfolio and robust pipeline, we are well positioned to sustain the high pace of growth and innovation that is the hallmark of Johnson &amp; Johnson.”</p><p class=\"pb-2\"><strong><span style=\"text-decoration:underline\">Roche</span></strong></p><p class=\"pb-2\">Roche announced that during Q4, group sales grew by 7%; however, this rose to 9% when excluding COVID. The company’s pharmaceuticals division experienced an 8% growth, driven by a strong demand for Vabysmo (faricimab-svoa) for severe eye diseases, Phesgo (pertuzumab/trastuzumab/hyaluronidase) for breast cancer, Ocrevus (ocrelizumab) for multiple sclerosis, and Hemlibra (emicizumab-kxwh) for hemophilia A. Further, the diagnostics division grew by 4%, operating profit rose by 14%, and core earnings per share grew by 7%. However, International Financial Reporting Standards net income declined by 19% as a result of impairment charges related to Flatiron Health and Spark Therapeutics. The company noted key approvals, such as Vabysmo and Columvi (glofitamab-gxbm), the launch of the cobas Mass Spec system, and the acquisition of Poseida Therapeutics.<sup class=\"text-inherit\">2</sup></p><p class=\"pb-2\">“2024 was a strong year for Roche. In the fourth quarter, we continued our very positive momentum for the third consecutive quarter with Group sales growth of 9% (CER). Core earnings per share exceeded the guidance raised at half year,” said Thomas Schinecker, CEO, Roche, in a press release.</p><p class=\"pb-2\"><strong><span style=\"text-decoration:underline\">Teva</span></strong></p><p class=\"pb-2\">This week, Teva announced its second consecutive year of growth, including a 4% increase in revenue, resulting from sales of therapies such as Austedo (deutetrabenazine), Uzedy (risperidone), and Ajovy (fremanezumab), as well as and product rights sales, partially offset by a prior-year $500 million upfront payment for duvakitug. Further, gross profit rose 5% to $8.06 billion, with a margin increase to 48.7% due to favorable product mix. R&amp;D prices increased by 5% while sales and marketing increased to 9%.<sup class=\"text-inherit\">3</sup></p><p class=\"pb-2\">\"2024 marked a transformative year for Teva, resulting in a second consecutive year of growth, driven by our generic products and key innovative products. Focusing on rigorous execution of our Pivot to Growth strategy throughout the year, we continued to achieve important milestones in each of its four pillars, including surpassing the outlook for our key innovative products, growing our generics business across all segments, and accelerating our early-stage innovative pipeline, including the positive Phase IIb results for our duvakitug (anti-Tl1A) asset. These results pave the way for pivotal trials in Crohn’s disease and ulcerative colitis, as well as, potentially, other Immunological and fibrotic indications beyond, in collaboration with our partner, Sanofi,” said Richard Francis, president, CEO, Teva, in a press release.</p><p class=\"pb-2\"><strong><span style=\"text-decoration:underline\">Sanofi</span></strong></p><p class=\"pb-2\">Sanofi announced that in Q4, sales grew by 10.3%. Additionally, new launches rose by 56.5%, with Altuviiio [antihemophilic factor (recombinant), Fc-VWF-XTEN fusion protein-ehtl] providing the most profit in that area. Further, vaccine sales grew by 10.8%. The company also highlighted four regulatory approvals, 21 submission acceptances, and eight positive Phase III readouts in its advanced pipeline. Closing out 2024, approvals for Dupixent (dupilumab) and Kevzara (sarilumab) in the EU were also of note.<sup class=\"text-inherit\">4</sup></p><p class=\"pb-2\">“We achieved double-digit sales growth in 2024 while pursuing the transformation of the company. Innovation was a key driver of our growth as launches already contributed 11 percent of sales, with Beyfortus becoming a blockbuster in its first full year of sales. We exceeded our business EPS guidance. In 2024, we announced an intention to sell a controlling stake in Opella consumer health, which will make Sanofi a focused, science-driven biopharma company. We increased R&amp;D investments and achieved significant progress with our pipeline in 2024, including positive phase 3 study results for new medicines such as rilzabrutinib in rare diseases and tolebrutinib in multiple sclerosis. As we enter 2025, we expect continued, solid growth in sales and a strong rebound in earnings. We are also confident in the mid to long-term growth prospects of Sanofi, supported by ongoing launches, Dupixent (currently expected to reach sales of around €22 billion in 20307, in line with the current ambition), and expected future launches from our pipeline,” said Paul Hudson, CEO, Sanofi, in a press release.</p><p class=\"pb-2\"><strong><span style=\"text-decoration:underline\">Abbott</span></strong></p><p class=\"pb-2\">In Q4 2024, Abbott's sales increased 7.2% on a reported basis and 8.8% organically. This increases to 10.1% when excluding COVID testing-related sales. According to the company, overall sales reached $42.0 billion, up 4.6% on a reported basis and 7.1% organically. The company also revealed 15 success stories from its R&amp;D, including new product approvals and treatment indications.<sup class=\"text-inherit\">5</sup></p><p class=\"pb-2\">\"We finished the year with very strong momentum. Sales growth and earnings per share growth in the fourth quarter were the highest of the year,\" said Robert B. Ford, chairman, CEO, Abbott, in a press release. \"We continued our track record for delivering on our commitments by achieving the upper end of our initial guidance ranges for 2024 and are well-positioned to deliver another year of strong growth in 2025.\"</p><p class=\"pb-2\"><strong>References</strong></p><p class=\"pb-2\">1. Johnson &amp; Johnson reports Q4 2024 and Full-Year 2024 results. <em>Johnson &amp; Johnson. </em>January 22, 2025. Accessed January 30, 2025. https://www.jnj.com/media-center/press-releases/johnson-johnson-reports-q4-2024-and-full-year-2024-results</p><p class=\"pb-2\">2. [Ad hoc announcement pursuant to Art. 53 LR] Roche reports strong 2024 results with 7% sales growth; fourth quarter marks third straight quarter of 9% growth. <em>Roche. </em>January 29, 2025. Accessed January 30, 2025. https://www.roche.com/media/releases/med-cor-2025-01-30</p><p class=\"pb-2\">3. Teva Delivers Second Consecutive Year of Growth; Announces Strong Financial Results in Fourth Quarter and Full Year 2024, Led by Generics Performance and Innovative Portfolio Growth. <em>Teva. </em>January 29, 2025. Accessed January 30, 2025. https://www.tevapharm.com/news-and-media/latest-news/teva-delivers-second-consecutive-year-of-growth-announces-strong-financial-results-in-fourth-quarter-and/</p><p class=\"pb-2\">4. Press Release: Q4 sales growth of 10.3%, 2024 business EPS guidance exceeded, and strong business EPS rebound expected in 2025. <em>Sanofi. </em>January 30, 2025. Accessed January 30, 2025. https://www.sanofi.com/en/media-room/press-releases/2025/2025-01-30-06-30-00-3017713</p><p class=\"pb-2\">5. Abbott Reports Fourth-Quarter and Full-Year 2024 Results; Issues 2025 Financial Outlook. <em>Abbott. </em>Accessed January 30, 2025. https://abbott.mediaroom.com/2025-01-22-Abbott-Reports-Fourth-Quarter-and-Full-Year-2024-Results-Issues-2025-Financial-Outlook</p></div>",
            "link": "https://www.pharmexec.com/view/roundup-top-pharma-companies-q4-earnings-highlighting-revenue-trends-market-shifts",
            "pub_date": "2025-01-31 03:27:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ImmunityBio, BeiGene Strike Deal to Conduct Phase III Trial for Tislelizumab, Anktiva in Advanced or Metastatic Non-Small Cell Lung Cancer",
            "description": "<div class=\"blockText_blockContent__TbCXh\"><div class=\"\"><div class=\"figure\" style=\"width:40%;float:right;max-width:525px;margin:0 0 1.5rem 1.5rem;clear:both;cursor:\"><div class=\"flex-none relative text-center\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%271280%27%20height=%27720%27/%3e\" style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\"/></span><img alt=\"Human lungs x-ray. Abstract illustration. Health, Respiratory system health concept. Breathing. Image Credit: Adobe Stock Images/Karrrtinki\" data-nimg=\"intrinsic\" decoding=\"async\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Human lungs x-ray. Abstract illustration. Health, Respiratory system health concept. Breathing. Image Credit: Adobe Stock Images/Karrrtinki\"/><noscript><img alt=\"Human lungs x-ray. Abstract illustration. Health, Respiratory system health concept. Breathing. Image Credit: Adobe Stock Images/Karrrtinki\" data-nimg=\"intrinsic\" decoding=\"async\" loading=\"lazy\" src=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F283c6f5ff2c713353d0e1650e3feeba803ea348a-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=3840&amp;q=75\" srcset=\"/_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F283c6f5ff2c713353d0e1650e3feeba803ea348a-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=1920&amp;q=75 1x, /_next/image?url=https%3A%2F%2Fcdn.sanity.io%2Fimages%2F0vv8moc6%2Fpharmexec%2F283c6f5ff2c713353d0e1650e3feeba803ea348a-1280x720.png%3Ffit%3Dcrop%26auto%3Dformat&amp;w=3840&amp;q=75 2x\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\" title=\"Human lungs x-ray. Abstract illustration. Health, Respiratory system health concept. Breathing. Image Credit: Adobe Stock Images/Karrrtinki\"/></noscript></span></div><div class=\"text-gray-500 italic\" id=\"image-caption\"><div class=\"blockText_blockContent__TbCXh\"><p class=\"pb-2\"><em>Image Credit: Adobe Stock Images/Karrrtinki</em></p></div></div><div class=\"top-[-100%] block w-[1px] transition-opacity duration-500 ease-in-out opacity-0 overflow-hidden\"><img class=\"m-auto absolute inset-0 max-w-[0%] max-h-[0%] border-[3px] border-solid border-white shadow-[0px_0px_8px_rgba(0,0,0,0.3)] box-border transition ease-in-out duration-500\" src=\"https://cdn.sanity.io/images/0vv8moc6/pharmexec/283c6f5ff2c713353d0e1650e3feeba803ea348a-1280x720.png?fit=crop&amp;auto=format\"/></div></div><style>\n          #image-caption p{\n            font-size: 12px;\n            max-width: 525px;\n            margin: 0 auto;\n            text-align: center;\n          }\n          </style></div><p class=\"pb-2\">ImmunityBio has entered a collaboration and supply agreement with BeiGene to conduct a confirmatory Phase III trial to evaluate the combination of tislelizumab, BeiGene’s PD-1 checkpoint inhibitor (CPI), and ImmunityBio’s Anktiva (nogapendekin alfa inbakicept-pmln) in patients with advanced or metastatic non-small cell lung cancer (NSCLC) who have developed a resistance to CPIs. According to ImmunityBio, the trial will be guided by data from the QUILT 3.055 study, which indicated that Anktiva can restore T-cell function and improve overall survival (OS) in CPI-resistant patients.<sup class=\"text-inherit\">1</sup></p><p class=\"pb-2\">“The challenge oncologists face in the next five years is how to manage the many patients who do not respond to CPI therapy after an initial response,” said Patrick Soon-Shiong, founder, executive chairman, global chief scientific and medical officer, ImmunityBio, im a press release. “Currently, options are limited for these second- and third-line patients with NSCLC whose cancer continues to progress on CPIs. The finding that these ‘cold’ tumors, which have evaded T cells, can now be rendered ‘hot’ through the activation of natural killer cells with Anktiva is exciting. To our knowledge, Anktiva is the first approved cytokine to address low white cell count (lymphopenia), which occurs following chemo-immunotherapy and radiotherapy. On the basis of Anktiva’s mechanism of action of proliferating T cells as well as NK cells, Anktiva has the potential to serve as the foundational cytokine to address loss of activity in the multiple tumors in which CPIs are approved.”</p><p class=\"pb-2\">The ResQ201A-NSCLC trial is expected to enroll approximately 462 patients across multiple sites globally. The trial’s primary endpoint is OS, with key secondary endpoints that include disease control rate, progression-free survival, objective response rate, and safety.</p><p class=\"pb-2\">According to ImmunityBio, Phase I and II data suggest that approach extends median OS beyond historical chemotherapy results, with QUILT 3.055 reporting a median OS of 14.1 months. Additionally, the combination of Anktiva and tislelizumab demonstrated a median OS of 17.1 months in patients with PD-L1 ≥ 50%, while patients who relapsed on checkpoint inhibitor therapy demonstrated a median OS of 19.6 months.<sup class=\"text-inherit\">1</sup></p><p class=\"pb-2\">Statistics from the American Cancer Society indicate that approximately 226,650 people will be diagnosed with lung cancer in the United States this year, with approximately 124,730 deaths. Lung cancer mainly occurs in older people, with a median diagnosis age of 70 years. However, a small number of people can be diagnosed under 45 years of age. Despite being the second most common cancer in the Unites States, it is the leading cause of cancer-related deaths, accounting for more fatalities than colon, breast, and prostate cancers combined. In men, only prostate cancer is more common while in women, only breast cancer is more common.</p><p class=\"pb-2\">Men have a one in 17 chance of developing lung cancer. On the other hand, women have a one in 18 chance, including both smokers and non-smokers.<sup class=\"text-inherit\">2</sup></p><p class=\"pb-2\">“ImmunityBio and BeiGene share a similar vision to advance the next generation of oncology immunotherapies to address unmet needs. We are excited to explore the potential of our PD-1 inhibitor, tislelizumab, in combination with Anktiva,” said John V. Oyler, co-founder, chairman, CEO, BeiGene, in the press release. “I’ve admired Dr. Soon-Shiong’s bold approach to medicine and look forward to working with him and his team as the ResQ201A-NSCLC study gets underway. Together, we hope to help metastatic lung cancer patients who may have few options left.”</p><p class=\"pb-2\"><strong>References</strong></p><p class=\"pb-2\">1. ImmunityBio Announces Collaboration with BeiGene on Confirmatory Phase 3 Trial of ANKTIVA® and PD-1 Checkpoint Inhibitor Combination in Non-Small Cell Lung Cancer. <em>ImmunityBio. </em>January 29, 2025. Accessed January 30, 2025. https://immunitybio.com/immunitybio-announces-collaboration-with-beigene-on-confirmatory-phase-3-trial-of-anktiva-and-pd-1-checkpoint-inhibitor-combination-in-non-small-cell-lung-cancer/</p><p class=\"pb-2\">2. Key Statistics for Lung Cancer. <em>American Cancer Society. </em>Accessed January 30, 2025. https://www.cancer.org/cancer/types/lung-cancer/about/key-statistics.html</p></div>",
            "link": "https://www.pharmexec.com/view/immunitybio-beigene-strike-deal-conduct-phase-iii-trial-tislelizumab-anktiva-advanced-metastatic-non-small-cell-lung-cancer",
            "pub_date": "2025-01-31 01:47:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        }
    ]
}