{
    "data": [
        {
            "title": "<![CDATA[Hospital Pharmacy and Supply Chain Leaders Want to Be Heard: Are you Ready to Listen? ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Valerie Bandy and Ryan Rotar, both from Tecsys, examine how hospital pharmacy leaders are reshaping their expectations and prioritizing value-driven partnerships over traditional transactional vendor relationships. They explore the growing shift toward self-distribution and direct purchasing, as well as how transparency and proactive communication are now essential to mitigating logistics risk and safeguarding patient care. This interview stresses technology’s role as a critical enabler of data visibility, empowering manufacturers to build long-term trust through consistent performance and shared accountability. Read this Q&amp;A to learn more about:</p><ul class=\"my-2\"><li class=\"ml-8 list-disc\">How hospital pharmacies evaluate manufacturers and what separates true partners from transactional vendors.</li><li class=\"ml-8 list-disc\">Where direct purchasing changes expectations around risk, communication, logistics, and technology.</li><li class=\"ml-8 list-disc\">Practical ways manufacturers can build trust, improve collaboration, and create long-term financial value with health systems.</li></ul><p class=\"\"></p><p class=\"\"></p> </div>",
            "link": "https://www.pharmexec.com/view/hospital-pharmacy-and-supply-chain-leaders-want-to-be-heard-are-you-ready-to-listen",
            "pub_date": "2026-02-26 23:54:48",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Hospital Pharmacy and Supply Chain Leaders Want to Be Heard: Ready to Listen? ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Watch the video to learn more about:</p><ul class=\"my-2\"><li class=\"ml-8 list-disc\">How hospital pharmacies evaluate manufacturers and what separates true partners from transactional vendors.</li><li class=\"ml-8 list-disc\">Where direct purchasing changes expectations around risk, communication, logistics, and technology.</li><li class=\"ml-8 list-disc\">Practical ways manufacturers can build trust, improve collaboration, and create long-term financial value with health systems.</li></ul> </div>",
            "link": "https://www.pharmexec.com/view/hospital-pharmacy-and-supply-chain-leaders-want-to-be-heard-ready-to-listen",
            "pub_date": "2026-02-26 23:54:48",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Boehringer Ingelheim Acquires Exclusive License from Sitryx Therapeutics for Preclinical Small Molecule Program ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Boehringer Ingelheim acquired an exclusive global license to a preclinical small molecule inhibitor program from Sitryx Therapeutics.</p><p class=\"\">The licensed program, developed by Sitryx, is described as a novel, oral, potentially disease-modifying treatment approach across multiple autoimmune and inflammatory disease indications.<sup class=\"text-inherit\">1</sup></p><p class=\"\">The deal comes as the global burden of autoimmune and inflammatory diseases continues to rise, with millions of patients unable to achieve sustainable disease control on existing therapies, underscoring the need for new mechanisms targeting disease-driving pathways.</p><p class=\"\">“Autoimmune and inflammatory diseases remain areas where innovation is urgently needed. Sitryx’s small molecule inhibitor program brings forward a promising new mechanism that aligns with our focus on advancing first-in-class approaches. Together with Sitryx, we are committed to translating this science into therapies that can meaningfully improve patients’ lives,” said Carine Boustany, head of immunology and respiratory diseases research at Boehringer Ingelheim.</p><p class=\"\">“This collaboration is a major milestone for our company and is a clear validation of the strength of our pipeline and our expertise translating immunometabolic targets into meaningful therapeutic candidates,” said Iain Kilty, chief executive officer of Sitryx. “We are proud to out-license this preclinical program to Boehringer Ingelheim whose global capabilities in immunology and drug development will help position this program to deliver meaningful benefits to patients worldwide.”</p><p class=\"\">Sitryx, a clinical-stage biopharmaceutical company developing oral therapies to restore immune balance, continues to advance its broader pipeline. Its lead candidate, SYX-5219, is a potentially first-in-class oral pyruvate kinase M2 (PKM2) modulator in development for atopic dermatitis.</p><p class=\"\">A recently completed Phase Ia trial in healthy volunteers in the UK showed SYX-5219 was safe and well tolerated, with predictable pharmacokinetics and robust target engagement, as well as a dose-dependent reduction in CCL17/thymus and activation-regulated chemokine (TARC) levels.<sup class=\"text-inherit\">2</sup></p><p class=\"\">A Phase Ib trial in adults with moderate to severe atopic dermatitis has commenced in the United States and Europe, with data expected by year end. A KLH antigen-challenge study in healthy volunteers is also underway to assess early immune response signals.<sup class=\"text-inherit\">2</sup></p><p class=\"\">“A daily oral treatment to rebalance immune function and deliver durable disease remission would be transformative for the treatment of atopic dermatitis. Our latest clinical data for SYX-5219, particularly the strong reduction in the highly disease-relevant Type 2 inflammation biomarker TARC, give us further confidence in the candidate’s differentiated profile. We look forward to the progression of our Phase 1b trial, which is expected to show the first evidence of SYX-5219’s mechanistic and clinical activity in patients and guide the next stages of development,” said Ravi Rao, chief medical officer of Sitryx.</p><p class=\"\"></p><h1 class=\"pb-4 pt-2 text-3xl\">What are the details of the license agreement?</h1><p class=\"\">Under the agreement, Sitryx grants Boehringer exclusive rights to multiple candidates and associated intellectual property within the program, while Boehringer assumes full responsibility for further research, clinical development and commercialization.</p><p class=\"\">Sitryx will receive upfront and near-term payments and is eligible for potential development, regulatory and commercialization milestone payments totaling more than $500 million, in addition to tiered royalties on future sales.<sup class=\"text-inherit\">1</sup></p><p class=\"\"></p><h2 class=\"pb-4 pt-2 text-2xl\">Sources</h2><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">Boehringer Ingelheim licenses novel oral therapeutics program for immune diseases from Sitryx Therapeutics <em>Boehringer Ingelheim </em>February 26, 2026 </li><li class=\"ml-8 list-decimal\">Sitryx advances development of PKM2 modulator SYX-5219 into atopic dermatitis patients following clinical evidence of immunomodulatory activity <em>Sitryx Therapetuics </em>January 26, 2026 </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/boehringer-ingelheim-acquires-exclusive-license-sitryx-therapeutics-preclinical-small-molecule-program",
            "pub_date": "2026-02-26 23:16:29",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Pharma Leadership Roundup: Sarepta Therapeutics CEO Announces Retirement, Rivus Pharmaceuticals Appoints New CEO  ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Executive turnover is once again reshaping the biotechnology sector. Sarepta Therapeutics looks to rebound after a tough 2025, while Rivus Pharmaceuticals signals a new phase of growth with fresh leadership.</p><h1 class=\"pb-4 pt-2 text-3xl\">Sarepta CEO Douglas Ingram plans to step down</h1><p class=\"\">Sarepta said in a regulatory filing that CEO Douglas Ingram is planning to step down by the end of 2026 (or upon the appointment of his replacement) and that the company has commenced a search for a successor. Ingram served as chief executive officer since 2017.<sup class=\"text-inherit\">1</sup></p><p class=\"\">The transition follows what the company described as a  2025. Its gene therapy Elevidys, used to treat a type of muscle disorder, was linked to the deaths of two patients and falling sales.<sup class=\"text-inherit\">3</sup></p><p class=\"\">Last year, FDA asked Sarepta to voluntarily halt shipments of Elevidys and due to an investigation of deaths associated with the therapy. The treatment’s label carries the regulator’s most serious safety warning, along with stringent monitoring requirements after treatment.</p><p class=\"\">Sarepta also announced 500 job cuts and halted development of several gene therapies for limb-girdle muscular dystrophy last year. Shares of the company fell 82% in 2025 and were down about 4% in after-market trading on Wednesday.</p><p class=\"\">“Elevidys has emerged from a challenging year,” Ingram said on Wednesday, adding that the company is executing plans to put it on a potential pathway to make the treatment available to non-ambulatory patients.<sup class=\"text-inherit\">1</sup></p><h1 class=\"pb-4 pt-2 text-3xl\">Rivus appoints Jorge Bartolome as new CEO</h1><p class=\"\">While Sarepta seeks stability, Rivus Pharmaceuticals announced that Jorge Bartolome has been appointed chief executive officer and member of the board, succeeding co-founder Allen Cunningham, who will transition to chief operating officer.<sup class=\"text-inherit\">2</sup></p><p class=\"\">“Rivus is embarking on an important stage of its journey as the company advances two potentially transformative oral medicines targeting MASH, obesity, and associated cardiometabolic diseases,” said Ian F. Smith, co-chair of the board of Rivus Pharmaceuticals. “Jorge’s extensive pharmaceutical background in late-stage drug development and commercialization makes him the ideal leader for Rivus to navigate the unprecedented opportunity to treat MASH, obesity, and its co-morbidities.”</p><p class=\"\">Bartolome brings more than 25 years of leadership experience in the pharmaceutical and biotechnology industry, as he previously served as chief executive officer and director of AreteiaTx, and earlier as president of Janssen Canada, part of Johnson &amp; Johnson, after holding increasingly senior roles over 20 years at GSK.</p><p class=\"\">“I am honored to lead this talented team as we drive Rivus forward as a company with multiple oral therapies to address the growing unmet patient needs in MASH, obesity, and associated cardiometabolic diseases,” Bartolome said. He added that 2026 will be a pivotal year as the company advances HU6 in the Amplify Phase II trial in MASH and prepares its first clinical trial for RV-8451, described as a differentiated oral, muscle-preserving GLP-1, in obesity.</p><h1 class=\"pb-4 pt-2 text-3xl\">Sources</h1><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">Sarepta Therapeutics CEO Ingram to retire by year end <em>Reuters </em>February 26, 2026 </li><li class=\"ml-8 list-decimal\">Rivus Pharmaceuticals Appoints Jorge Bartolome as Chief Executive Officer <em>Rivus Pharmaceuticals </em>February 25, 2026 </li><li class=\"ml-8 list-decimal\">FDA Investigating Deaths Due to Acute Liver Failure Following Treatment with Sarepta’s AAVrh74 Gene Therapies. FDA. July 18, 2025. </li><li class=\"ml-8 list-decimal\">Sarepta Therapeutics Announces Fourth Quarter and Full-Year 2025 Financial Results and Recent Corporate Developments <em>Sarepta Therapeutics </em>February 25, 2026 </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/leadership-roundup-sarepta-therapeutics-ceo-announces-retirement-rivus-pharmaceuticals-appoints-new-ceo",
            "pub_date": "2026-02-26 22:48:45",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Alkermes Reveals CEO Succession Plan Following Richard Pops’ Retirement Announcement]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Alkermes is preparing for a leadership transition after more than three decades under Richard Pops, who is set to step down as chief executive officer on July 31, 2026.</p><p class=\"\">The company’s board has named current chief operating officer Blair Jackson as CEO effective Aug. 1, 2026, with Jackson also expected to join the board at that time.</p><p class=\"\">Following the transition, Pops will remain chairman and serve as an advisor to the executive team.<sup class=\"text-inherit\">1</sup></p><h1 class=\"pb-4 pt-2 text-3xl\">How was Pops’ tenure at Alkermes?</h1><p class=\"\">Pops joined the company back in 1991, four years after its founding, and oversaw its transformation from a 20-person drug delivery start-up into a commercial-stage neuroscience company generating approximately $1.5 billion in annual revenue.<sup class=\"text-inherit\">1</sup></p><p class=\"\">Over the course of his tenure, Alkermes built a portfolio of commercial medicines for serious mental illness and addiction while investing heavily in central nervous system innovation.</p><p class=\"\">“It has been a great honor to serve as CEO of Alkermes alongside so many dedicated colleagues over the years,” Pops said, reflecting on a tenure he described as guided by science, integrity and long-term value creation. “As I prepare to transition the CEO role to Blair later this year, I do so with immense pride in the company we’ve built and conviction in the company’s growth opportunity ahead.”</p><h1 class=\"pb-4 pt-2 text-3xl\">Why did Alkermes decide to make a leadership change?</h1><p class=\"\">Board leadership framed the succession as the result of a deliberate and structured planning process. Andy Wilson, lead independent director, credited Pops with shaping Alkermes’ strategy and culture and expressed confidence in Jackson’s ability to lead the company forward. “With his broad skillset and deep knowledge of the business, we are confident that Blair is the right leader to guide Alkermes into its next chapter of growth and impact,” Wilson said.</p><p class=\"\">Jackson, who has been with Alkermes since 1999, brings more than 25 years of experience spanning scientific, operational and corporate strategy roles. As chief operating officer since 2021, he has overseen global operations, quality, IT, business development and corporate planning.<sup class=\"text-inherit\">1</sup></p><p class=\"\">He played a central role in several strategic moves over the past few years, including the divestment of the oncology business, the sale of the Athlone manufacturing facility and the acquisition of Avadel.<sup class=\"text-inherit\">2</sup></p><p class=\"\">“I am honored to carry forward Alkermes’ legacy of working to address unmet needs of patients living with complex conditions in the neuroscience space,” Jackson said, emphasizing the company’s strong commercial base and advancing pipeline.</p><p class=\"\">As Alkermes pivots deeper into sleep medicine and orexin biology, the leadership transition signals continuity in strategy, even as a new CEO prepares to steer the company into its next chapter.</p><p class=\"\">Alkermes also recently completed an acquisition of Avadel Pharmaceuticals, adding an FDA-approved sleep product and bolstering its commercial capabilities in narcolepsy, moves designed to position the company for its next phase of growth.<sup class=\"text-inherit\">2 </sup>More recently, the company has sharpened its focus on sleep medicine and orexin agonism, an emerging therapeutic category in neuroscience.<sup class=\"text-inherit\">2</sup></p><p class=\"\"></p><h1 class=\"pb-4 pt-2 text-3xl\">Sources</h1><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">Alkermes plc Announces CEO Succession Plan <em>Alkermes PLC. </em>February 25, 2026 </li><li class=\"ml-8 list-decimal\">Alkermes plc Completes Acquisition of Avadel Pharmaceuticals plc, Accelerating Entry Into Sleep Medicine Market <em>Alkermes PLC. </em>February 12, 2026 </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/alkermes-reveals-ceo-succession-plan-following-richard-pops-retirement-announcement",
            "pub_date": "2026-02-26 22:25:43",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Leading in the Psychedelic Space: Q&A with Tarek Rabah]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">New research into psychedelics is unlocking potential new treatments in mental health and nephrology. Osuka America Pharmaceutical’s president and CEO Tarek Rabah spoke with <em>Pharmaceutical Executive</em> about the company’s mission and how its investing in psychedelics and other major areas.</p><p class=\"\"></p><p class=\"\"><em>Pharmaceutical Executive: How has Otsuka been a leader in the psychedelic-inspired medicine space?<br/></em><strong>Tarek Rabah:</strong> At Otsuka, we are passionate about serving healthcare needs worldwide and are committed to discovering treatments for complex diseases. This is foundational to our strategy as we pursue products and solutions that address persistent, unmet needs, in this case for patients living with treatment-resistant depression and PTSD.</p><p class=\"\">Using the same rigorous approach that has guided our CNS innovations for decades, we’re deliberately seeking innovation across this therapeutic area as science evolves, including new modalities and conditions that were previously untreatable. This approach led us to expand into psychedelic-inspired compounds six years ago.</p><p class=\"\">In 2020, Otsuka became the first major pharmaceutical company to invest in psychedelics with COMPASS Pathways, reflecting an early belief in its potential. We deepened that commitment in 2023 with the acquisition of Mindset, enabling us to advance promising compounds.</p><p class=\"\">Today, Otsuka is forging a path of scientific excellence around the development of emerging novel therapies, translating the science of serotonergic agonists to develop new chemical entities with the goal of offering new hope to people living with mental health disorders who may not benefit from existing therapies.</p><p class=\"\">We are working to ensure our health system is ready to keep pace with these treatments so patients can access them when they come to market.</p><p class=\"\"></p><p class=\"\"><em>PE: What is Otsuka’s broader external-innovation and deal-making strategy?<br/></em><strong>Rabah:</strong> At Otsuka, acquisitions and collaborations are an extension of our long-standing commitment to perseverance and clinical excellence. We partner with companies where we believe our expertise can help advance promising innovation and unlock more potential within Otsuka than they could on their own—ultimately maximizing the impact for patients worldwide.</p><p class=\"\"></p><p class=\"\"><em>PE: What is Otsuka’s acquisition strategy?<br/></em><strong>Rabah:</strong> We pursue acquisitions strategically and with the same rigor that has defined Otsuka’s research and development. We prioritize companies that are advancing promising mid- and late-stage compounds that align with our clinical expertise and build on our strong track record of discovering, developing, and commercializing best-in-class and first-and-only medicines.</p><p class=\"\">Company culture is also important, and we look for companies who share our mission to accelerate access to breakthroughs for underserved patients.</p><p class=\"\">This disciplined approach has allowed us to build a portfolio that balances focus with diversification, while also bringing in the talent and capabilities needed to fuel our next phase of growth.</p><p class=\"\">A recent example is our expansion into specialty autoimmune disease through the acquisition of Visterra in 2018, which included VOYXACT® (sibeprenlimab-szsi) that has recently received accelerated approval for reducing proteinuria in adults with primary IgAN at risk for disease progression.</p><p class=\"\"></p><p class=\"\"><em>PE: How will Otsuka leverage legacy in neuroscience?<br/></em><strong>Rabah:</strong> We’ll continue to ensure mental illnesses and brain diseases are approached with the same priority and urgency as physical health and recognized as chronic diseases that warrant early, equitable, and accessible intervention.</p><p class=\"\">From early research to commercialization, our expertise enables us to continue transforming what we can do in neuroscience, especially in serious mental illness. This includes a robust pipeline, including products such as an investigational compound for the treatment of ADHD and an exploratory treatment for major depressive disorder, general anxiety disorder, and schizophrenia. </p><p class=\"\">Going forward, we want to build on this expertise to ensure patients everywhere can access the treatment they need. From breaking down stigma and raising awareness for mental health conditions to addressing systemic barriers to accessing medication, we want to continue leading the charge towards quality mental health care for all patients.</p><p class=\"\"></p><p class=\"\"><em>PE: What is Otsuka’s strategy heading into the 2030’s?<br/></em><strong>Rabah:</strong> The next decade will be the most transformative period in Otsuka’s history. We see a clear opportunity—and responsibility—to invest where unmet need remains high, in CNS and nephrology, as well as moving decisively into immunology and rare disease.</p><p class=\"\">Right now, our autoimmune pipeline has several assets, including both antibody and small molecule compounds, some that target “undruggable” mechanisms. We have a clear roadmap and will continue to invest aggressively, steadily building a solid pipeline to become a next generation autoimmune leader in the next 10 years.</p> </div>",
            "link": "https://www.pharmexec.com/view/leading-psychedelic-space-tarek-rabah",
            "pub_date": "2026-02-26 19:00:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[What is the Reaction to DTC Pharma Advertising?]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> </div>",
            "link": "https://www.pharmexec.com/view/reaction-dtc-advertising",
            "pub_date": "2026-02-26 19:00:00",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Pharmaceutical Executive Daily: FDA Approves Braftovi]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Welcome to <em>Pharmaceutical Executive</em> Daily, your quick briefing on the top news shaping the pharmaceutical and life sciences industry.</p><p class=\"\">In today’s <em>Pharmaceutical Executive</em> Daily, the FDA approves Braftovi for mutant metastatic colorectal cancer, Novo Nordisk and GSK announce major deal activity in a mergers and acquisitions roundup, and UK regulators confiscate thousands of doses of illegal weight-loss medicines.</p><p class=\"\">The FDA has approved Braftovi for patients with BRAF V600E-mutant metastatic colorectal cancer. The decision expands treatment options in a genetically defined subset of colorectal cancer, reinforcing the continued momentum behind biomarker-driven oncology strategies and combination therapy approaches in advanced disease.</p><p class=\"\">In deal news, Novo Nordisk has entered a $2 billion partnership with Vivtex, further strengthening its pipeline through external innovation. Meanwhile, GSK announced a $950 million acquisition of 35Pharma Inc., signaling continued appetite for targeted bolt-on acquisitions to expand specialty and pipeline assets. Together, the transactions reflect sustained strategic investment as large pharmaceutical companies seek to offset competitive pressures and future revenue gaps.</p><p class=\"\">Finally, the Medicines and Healthcare products Regulatory Agency has confiscated approximately 2,000 doses of illegal weight-loss drugs in a recent enforcement action. The move underscores growing regulatory vigilance as demand for weight-management therapies surges and unauthorized or counterfeit products proliferate in both online and offline markets.</p><p class=\"\">Thanks for listening to <em>Pharmaceutical Executive</em> Daily. For more updates and in-depth analysis, visit PharmExec.com.</p><p class=\"\"></p> </div>",
            "link": "https://www.pharmexec.com/view/daily-fda-approves-braftovi",
            "pub_date": "2026-02-26 01:52:37",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Medicines and Healthcare Products Regulatory Agency Confiscates 2,000 Doses of Illegal Weight-Loss Drugs: Report ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Britain’s medicines regulator intensified its crackdown on illegal weight-loss drug manufacturing, carrying out a second major enforcement operation in four months as global demand for obesity treatments fuels a surge in counterfeit and unregulated products.</p><p class=\"\">On Feb. 25, Britain’s Medicines and Healthcare products Regulatory Agency (MHRA) announced raids on two locations in Lincolnshire and Nottinghamshire, seizing almost 2,000 doses of illegal weight-loss drugs and manufacturing equipment.<sup class=\"text-inherit\">1</sup></p><p class=\"\">The operation follows a record seizure in October, when the agency dismantled what it described as the U.K.’s first illicit weight-loss medicine manufacturing facility.<sup class=\"text-inherit\">2</sup></p><p class=\"\"></p><h1 class=\"pb-4 pt-2 text-3xl\">What was found in the most recent raid?</h1><p class=\"\">The most recent raid uncovered medicines labelled as containing tirzepatide and retatrutide, alongside packaging materials and commercial vehicles. Both tirzepatide and retatrutide mimic hormones that suppress appetite and regulate blood sugar.<sup class=\"text-inherit\">1</sup></p><p class=\"\">According to Reuters, the crackdown underscores escalating enforcement action against illegal manufacturers exploiting surging global demand for weight-loss treatments, as regulators and pharmaceutical companies grapple with the growth of counterfeit and unregulated drugs trafficked online and through underground networks.</p><h1 class=\"pb-4 pt-2 text-3xl\">What was found in the raids from October?</h1><p class=\"\">In October, the MHRA announced what it called the world’s largest seizure of unlicensed weight-loss medicines, dismantling a factory in central England that produced jabs labelled as containing the ingredient in Mounjaro.<sup class=\"text-inherit\">2</sup></p><p class=\"\">The agency seized 2,000 injection pens labelled as containing tirzepatide, the active ingredient in Eli Lilly’s Mounjaro and Zepbound, as well as retatrutide, an experimental obesity drug still in trials. Tens of thousands of empty pens and raw chemicals were also confiscated.<sup class=\"text-inherit\">2</sup></p><p class=\"\">The MHRA said the factory was the first of its kind discovered in Britain.</p><p class=\"\">“This is a victory in the fight against the shameless criminals who are putting lives at risk by peddling dangerous and illegal weight-loss jabs to make a quick buck,” health minister Wes Streeting said in a statement.</p><p class=\"\">“These unregulated products, made with no regard for safety or quality, posed a major risk to unwitting customers.”</p><h1 class=\"pb-4 pt-2 text-3xl\">Why is there an increase in illegal weight-loss drugs?</h1><p class=\"\">Global pharmaceutical companies and regulators have raised alarms over the rapid spread of counterfeit and unregulated weight-loss drugs as demand surges worldwide. In Britain, the National Health Service prescribes weight-loss medicines only to patients who meet specific criteria. Those seeking private prescriptions can face costs of hundreds of pounds per month.<sup class=\"text-inherit\">2</sup></p><p class=\"\">In the United States, FDA Commissioner Marty Makary released a statement on X stating that the agency is expected to begin moving  copycat drugs promoted as alternatives to approved therapies, reinforcing the agency’s stance that unapproved products pose potential risks when marketed at scale.</p><p class=\"\">The MHRA’s back-to-back operations signal a sustained enforcement push as authorities attempt to curb criminal networks capitalizing on one of the fastest-growing segments of the pharmaceutical market.</p><p class=\"\"></p><h1 class=\"pb-4 pt-2 text-3xl\">Sources</h1><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">UK Drug Regulator Seizes 2,000 Doses of Illegal Weight-Loss Drugs in Latest Crackdown <em>Reuters </em>February 25, 2026 </li><li class=\"ml-8 list-decimal\">UK seizes record haul of illegal weight-loss drugs in factory raid October 24, 2025 </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/medicines-healthcare-products-regulatory-agency-confiscates-2000-doses-illegal-weight-loss-drugs-report",
            "pub_date": "2026-02-26 00:56:23",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "<![CDATA[Pharma Mergers and Acquisitions Roundup: Novo Nordisk Enters $2.1 Billion Partnership with Vivtex, GSK Enters $950 Million Acquisition Agreement with 35Pharma Inc. ]]>",
            "description": "<div class=\"w-full _blockContent_s7hzj_1\" id=\"block-content\"> <p class=\"\">Biopharmaceutical companies this week announced significant strategic transactions aimed at expanding capabilities in oral biologics and strengthening pipelines in high-need cardiopulmonary diseases, underscoring continued investment in next-generation protein therapeutics and differentiated drug-delivery platforms.</p><h1 class=\"pb-4 pt-2 text-3xl\">What are the details of Novo Nordisk and Vivtex’s partnership?</h1><p class=\"\">Novo Nordisk and Vivtex Corporation have entered into a partnership agreement to develop next-generation oral biologic medicines for obesity, diabetes and associated comorbidities.</p><p class=\"\">Under terms of the agreement, Vivtex is set to license select oral drug-delivery technologies to Novo Nordisk, while also being eligible to receive upfront consideration, research funding and milestone payments totaling up to $2.1 billion, along with tiered royalties on future product sales.<sup class=\"text-inherit\">1</sup></p><p class=\"\">“Novo Nordisk has been at the forefront of innovation in protein and peptide engineering for several decades, and not least within oral formulation of peptides. We launched the first-ever oral biologic more than five years ago and have recently launched the world’s first oral biologic for obesity,” said Brian Vandahl, senior vice president, Therapeutics Discovery, at Novo Nordisk. “We continue to push the boundaries of science through both internal and external innovation to fulfil our mission of treating millions more people living with obesity and diabetes and their associated comorbidities.”</p><p class=\"\">The collaboration is designed to allow for oral delivery of biologic drug candidates that are traditionally limited to injectable administration due to poor gastrointestinal absorption.<sup class=\"text-inherit\">1 </sup>The partnership combines Novo Nordisk’s expertise in peptide and protein therapeutics with Vivtex’s proprietary gastrointestinal screening and formulation platform.</p><p class=\"\">“Making biologics oral has been one of the most difficult challenges in drug delivery,” said Thomas von Erlach, Ph.D., CEO and co-founder of Vivtex. “Vivtex was founded to systematically solve this problem by integrating high-throughput experimentation with computational and AI-enabled analytics. Partnering with Novo Nordisk allows us to apply our platform across important metabolic disease areas, with the goal of enabling oral therapies that would otherwise require injection.”</p><p class=\"\">Following research and formulation selection, Novo Nordisk is set to assume responsibility for global development, regulatory activities, manufacturing, and commercialization of any resulting products.<sup class=\"text-inherit\">1</sup></p><h1 class=\"pb-4 pt-2 text-3xl\">Why did GSK acquire 35Pharma for $950 million?</h1><p class=\"\">In a separate transaction, GSK has entered an agreement to acquire 35Pharma Inc. which includes HS235, an investigational medicine that has completed Phase I healthy volunteer clinical trials, with studies set to begin in pulmonary arterial hypertension (PAH) and pulmonary hypertension due to heart failure with preserved ejection fraction (PH-HFpEF).<sup class=\"text-inherit\">2</sup></p><p class=\"\">Pulmonary hypertension (PH) is a progressive, life-shortening disease characterized by high blood pressure in the lungs. It affects approximately 82 million people worldwide across multiple forms, with a five-year survival rate of around 50%. By 2032, the global PH therapy market is forecast to reach $18 billion, with activin signalling inhibitors expected to account for half of that total.</p><p class=\"\">HS235 targets the activin receptor signaling pathway and is designed with enhanced selectivity to reduce binding to BMP9 and BMP10, ligands associated with adverse events such as bleeding and telangiectasia.<sup class=\"text-inherit\">2</sup></p><p class=\"\">By potentially lowering bleeding risk, HS235 may address a key limitation in current PH treatment, particularly for patients requiring anticoagulant or antiplatelet therapy.</p><p class=\"\">Tony Wood, chief scientific officer, GSK, said: “Pulmonary hypertension affects millions of people worldwide, yet patients are underserved. We’re delighted to add HS235 to our pipeline, a potential best-in-class medicine with a differentiated profile to reduce risk of bleeding and provide potential metabolic benefits clinically relevant to PH patients. HS235’s potential protective effects on vascular function, alongside potential benefits on fat-derived markers of metabolism and inflammation, also offer new development opportunities within our RI&amp;I portfolio to achieve broader coverage across the metabolic, inflammatory, vascular and fibrotic drivers of multiple chronic diseases that affect the lung, liver and kidney.”</p><p class=\"\">Under the terms of the acquisition agreement, GSK is set to acquire 100% of 35Pharma’s equity for $950 million in cash at closing. The transaction is subject to customary conditions, including regulatory clearances under the Hart-Scott-Rodino Act in the United States and the Competition Act in Canada, as well as a filing under the Investment Canada Act.<sup class=\"text-inherit\">2</sup></p><p class=\"\"></p><h1 class=\"pb-4 pt-2 text-3xl\">Sources</h1><ol class=\"my-2\"><li class=\"ml-8 list-decimal\">Novo Nordisk and Vivtex partner to develop next-generation oral medicines for obesity and diabetes <em>Novo Nordisk </em>February 25, 2026 </li><li class=\"ml-8 list-decimal\">GSK enters agreement to acquire 35Pharma Inc. <em>GSK </em>February 25, 2026 </li></ol> </div>",
            "link": "https://www.pharmexec.com/view/mergers-acquisitions-roundup-novo-nordisk-enters-2-billion-partnership-vivtex-gsk-enters-950-million-acquisition-35pharma-inc-",
            "pub_date": "2026-02-25 22:45:17",
            "source": "pharmexec",
            "kind": 1,
            "language": "en"
        }
    ]
}