{
    "data": [
        {
            "title": "矿山里藏了一桩4000亿的生意",
            "description": "<article class=\"post-body\" data-v-b51fa692=\"\"><p>“轮台九月风夜吼，一川碎石大如斗，随风满地石乱走。”</p><p>在唐代诗人岑参描写新疆的边塞诗里，狂风可以吹起斗大乱石满地乱滚。虽然略有艺术夸张成分，但是新疆气候之恶劣，可见一斑。</p><p>2025年1月，在一年中最冷的时候，亿欧汽车从乌鲁木齐市区出发，向东北方向驾驶250公里。长达4个小时的旅途，虽然没有岑参诗中那么夸张，但沿途皑皑白雪，苍茫裸露的白色大地，确实鲜见生机。</p><p>此行的目的地，是中国新疆的特大型露天煤矿，该矿区东西长4.5公里，南北宽2.5公里，深度达260米。其煤炭资源储量丰富，拥有33.8亿吨的煤炭储量，年产能达4000万吨。</p><p>在如此重要的矿区，非但没有碎石乱走，反而被矿山无人驾驶安排得明明白白。</p><p>抵达矿区以后，亿欧汽车及同行记者乘坐内部车辆进一步深入矿区内部。</p><p>煤矿作业区被规整成梯田般，层层倾斜向下，裸露的灰黑色煤矿表层上覆盖着薄雪。就在这寒风萧瑟的冰天雪地里，搭载着百吨矿石的卡车们井然有序地工作，卡车上印着一行大字——EACON易控智驾。</p><p><img src=\"https://diting-hetu.iyiou.com/async/weixin/G5w9VECY8MG8pwFwivcb\"/></p><p><span style=\"font-size:20px;\"><strong>助力矿区，实现无人驾驶</strong></span></p><p>成立于2018年的易控智驾，多年来专注为矿区提供无人驾驶技术与运输运营服务。就在极寒极热并存的新疆露天矿区，易控智驾已投入了共计700台新能源无人驾驶矿卡，助力矿区实现常态化7*24小时连续无人化生产作业。</p><p>在矿区的一个角落，搭建着一个以太空舱为主体的智能云控中心。</p><p>易控智驾的调度员就在这里工作，通过运作智能云控平台，实时地对矿山生产作业进行智能生产调度、智慧生产监控、生产地图管理以及生产数据管理等。</p><p>智能云控平台具备大规模协同调度的能力，能够实现多采区、多卸点、多编组、多物料类型的全局动态均衡派车。通过平台，调度员能简单明晰地观测到矿区作业情况，然后根据开采区、排土区的作业情况给不同的无人矿卡下达指令，实时动态地进行车辆调度，提高生产运输的效率。</p><p>与此同时，平台还可以将无人机与车辆数据融合，打造实时的三维实景图，并实时给调度员推送车辆故障和告警信息。当遇到车辆故障后，调度员可以直接在平台查看实时现场监控，帮助无人矿卡脱困，保障全流程无人化和作业的连续性。事后还可以调出历史回放，帮助工程师查出故障原因并改进，以更好地提高工程效率和质量。</p><p><img class=\"image_resized\" src=\"https://diting-hetu.iyiou.com/f8b5e34d41a1216def0b3e5b0b70e5ad.jpeg\" style=\"width:100%;\"/></p><p>参观完智能云控中心后，亿欧汽车进一步深入无人矿卡的作业区。在经过几分钟的颠簸路程后，亿欧汽车看到了第一辆易控智驾的无人矿卡。</p><p>在外形上，这辆无人矿卡与普通矿卡并无太大区别，仅仅是驾驶位空空如也。只见它在崎岖不平的道路上匀速前进，稳步地通过直角转弯、U型转弯路段，最后停在了一辆挖机旁，等待货物的装载。在前一辆无人矿车装载完毕，鸣笛离去后。它紧接着倒车入指定区域，配合挖机的工作。两车入换时间不超过20秒。</p><p>整套丝滑驾驶工作的背后，是易控智驾在无人驾驶矿卡软硬件上的努力。</p><p>一方面，无人矿卡的全身布满了传感器，包含了主激光雷达、多个摄像头和毫米波雷达，能够灵敏地感知周边环境，实现了“耳聪目明”。另一方面，易控智驾还给矿卡装上了定位、通信设备，并通过V2X车联网技术，助力无人矿卡会车安全以及更好地与矿山其它工程车辆合作。</p><p>除此之外，易控智驾还打造了无人驾驶新能源线控平台“御石”，通过将线控系统设计标准化，实现线控底盘硬件层与无人驾驶软件层解耦，建立矿山无人驾驶需求的开放式标准线控开发平台。</p><p>经过6年的深耕，目前，易控智驾已与国家能源集团、国家电力投资集团、特变电工、紫金矿业、新疆能源、新疆宜化等多家大型矿企建立深度战略合作，已落地运行1000辆无人驾驶矿卡，累计运行里程超3050万公里。</p><p>1000辆无人矿卡是一个什么概念？公开数据显示，作为全球最著名的Robotaxi企业，谷歌旗下的Waymo拥有无人出租车700辆左右。2024年，在武汉引起轰动的萝卜快跑，其无人驾驶出租车的数量也在700辆左右。已经在美国纳斯达克交易所上市的中国无人驾驶企业文远智行和小马智行，投放的无人驾驶车辆在200辆至300辆左右。 </p><p>所以，在易控智驾战略副总裁林巧看来，1000辆无人驾驶矿卡的投放和运营对于矿山无人驾驶行业和自动驾驶产业来说，都意味着它已经变成了真正的商业化工具，而不再是一个科研项目中的DEMO，“从这两个维度，我认为对于行业是一个非常重大的意义。”</p><p><span style=\"font-size:20px;\"><strong>让人工智能先干“脏活累活”</strong></span></p><p>“光写写PPT有什么意思？” </p><p>在谈及以人工智能的发展时，联想集团高级副总裁、联想创投集团总裁贺志强就认为，以大语言模型为代表的人工智能应该优先解决“脏活累活”。</p><p>他举了一个例子，让自动驾驶实现更安全的驾驶，让产线上的通用机器人能够更好的工作，这就属于“脏活累活”，“如果大模型不能干脏活累活就没意思。” </p><p>然而，对于目前的人工智能产业来说，找到一个具体的垂直领域并完成商业化，并不是一件易事。不论是大模型还是小模型，不论是面向企业用户还是个人消费者，不论是开放场景还是封闭环境，人工智能究竟何时、何地可以完成商业化突破，已经成了所有人关注的焦点。</p><p>目前，在矿山无人驾驶这个“脏活累活”场景中，人工智能的商业化正在加速落地。据亿欧智库测算，到了2030年，中国露天砂石骨料矿、铁矿、煤矿的年运输规模将分别达到2691.7亿元、263.6亿元和914.6亿元，整体智慧矿山自动驾驶的潜在市场空间接近4000亿元。</p><p><img class=\"image_resized\" src=\"https://diting-hetu.iyiou.com/async/weixin/4gE1RQG5QXYGEVXrQFG2\" style=\"width:100%;\"/></p><p>目前，易控智驾已经完成了从科研项目到商业落地的蜕变，并且开始积累自己的数据和运营优势。 </p><p>亿欧汽车获悉，新疆地区常态化运营的无人矿卡单日单车运行时间平均可达22小时，相较于传统有人驾驶矿卡，其单日单车有效运行时长能多出2至3个小时。此外，根据矿方监测，无人驾驶单日单车运输方量为有人驾驶矿卡的1.17倍。</p><p>“我们无人矿卡不能说实现7*24小时连续无人化作业，而是可以达到30*24小时，甚至是365*24小时连续无人化作业。”易控智驾驻场人员说道。无人驾驶矿车是可以全年不间断运营的，包括助力春节期间年产保供。</p><p>据现场人员介绍，在目前这种气候严寒、能见度低、地面湿滑有积雪的天气，人工的驾驶作业是需要停工的，因为有事故发生风险。</p><p>但是对无人驾驶影响不大，它能够通过传感器、导航系统和自动控制技术实现对矿场环境、路况信息以及车辆状态进行监测，有效消除人为操作可能带来的安全隐患，确保矿山的生产安全，减少矿企因不可控风险所导致的法律责任和相关损失。</p><p>“目前矿山运输工人一个月工资大概是1万元。”现场人员告诉亿欧汽车。经估算，采用无人驾驶方案每年可减少司机成本10-15万元/人，百台无人驾驶车辆每年至少可节省司机成本4000万元。</p><p>与此同时，如同新疆矿区地广人稀，极端天气多发，运输工作乏味且面临风险，矿区面临着“招工难，留人难”的问题。而无人驾驶解决方案能够实现矿车“去人化”，矿企仅需配备少量的遥控驾驶员和调度人员即可满足运营需求。</p><p>无人驾驶矿卡可以实现驾驶行为优化，减少不必要的加速和刹车，从而延长轮胎的使用寿命，降低轮胎损耗成本。据相关厂商运营数据，露天矿应用无人驾驶技术后运输成本可降低15%、轮胎寿命可提高40%。这样一来，无人矿车能够实现设备维护成本的下降。</p><p>中国矿山场景下自动驾驶市场近年来高速发展，多家企业已成功将自动驾驶技术应用于国内各地主要矿山。作为具备高科技、高效能、高质量特点的矿山无人驾驶是典型的新质生产力。</p><p>所以，自2020年以来，国家及地方政府共发布20多项政策法规及相关文件，推动矿山无人驾驶技术发展及应用落地。因此，无人驾驶具备了规模化发展的底层支撑与市场需求。 </p><p>中国煤炭工业协会发布的《露天煤矿无人驾驶技术应用发展报告》数据显示，预计2024年露天煤矿无人驾驶矿卡数量达到2500辆，较2023年的1131辆增长超120%。2024年，已然成为中国露天矿无人驾驶商业化元年。 </p><p>其中，易控智驾以42.5%的市场占有率位居行业第一。在这样的背景下，矿企已经对易控智驾提出了更高的要求。林巧就表示，现在矿企已经不再将易控智驾和友商做对比，而是直接和人工驾驶做对比，甚至“人工难以处理的时候，还是希望我们无人驾驶来做。”</p><p>对于未来，林巧认为2025年全国无人驾驶矿卡落地数量将超5000台，无人驾驶在新增矿卡中的渗透率将达到20%。</p><p>为了迎接市场的爆发，易控智驾将进一步明确其战略定位，即以无人驾驶技术为核心，赋能全产业链发展，坚持产品力和服务力双驱动，国内和海外市场齐发力，通过创新型技术和新型产品布局赋能全产业链。</p></article>",
            "link": "https://www.iyiou.com/analysis/202502051089520",
            "pub_date": "2025-02-05 10:30:45",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "雷军严选，这家公司融了数亿元",
            "description": "<article class=\"post-body\" data-v-b51fa692=\"\"><p>从上市到第10万辆SU7下线，小米汽车只用了230天。截止至2024年底，小米SU7销量破13.5万台，超额完成年度目标。</p><p>据亿欧汽车了解，目前小米SU7仍处于“一车难求”的状态。在竞争如此激烈的汽车市场，小米汽车即便是产能跟不上销量，却仍有不少人愿意持币以待。</p><p>小米汽车的“爆卖”也将一些新兴技术和公司带到了公众视野，其中就包括抬头显示系统（Head-Up Display，HUD）及其背后的供应商——泽景科技。近期，亿欧汽车专访了泽景科技董事长兼CEO张涛，与之深入探讨了HUD的市场现状和发展前景。</p><p><span style=\"font-size:20px;\"><strong>“HUD正处于跨越鸿沟的关键时间点”</strong></span></p><p>最早，HUD技术是一种飞行器辅助仪，它能将关键的飞行数据，比如飞行参数、姿态信息等投影至飞行员正前方的透视镜中。这一设计大幅减少了飞行员低头看仪表盘的次数，飞行员可以在保持平视的情况下，同时看到仪表数据和外界环境。</p><p>1988年，通用汽车首次将HUD技术引入汽车领域，在Oldsmobile Cutlass Supreme Indy 500 Pace Car上首次搭载HUD。三年后，丰田汽车也引入了HUD。但这个时候的HUD显示信息有限，定位和功能模糊，仅仅是大牌汽车企业的卖车噱头而已。</p><p>此后20年的时间里，HUD逐渐渗透到高档汽车，并逐渐向信息化和数字化方向发展。随着汽车电动智能化进一步向前，2022年，奔驰首发量产AR-HUD，宣告AR-HUD的智能化时代到来。HUD技术引入到汽车后，驾驶员无需转移视线即可从眼前的挡风玻璃上获取关键行驶信息。</p><p>早期，各个车型还是主要搭载组合抬头显示（C-HUD），其只能提供较为基础的抬头显示功能，本质仍是中控和仪表信息的简单迁移。随后逐渐发展出挡风玻璃抬头显示（W-HUD），该产品实用性较高，可显示车况、ADAS信息等功能，是当下HUD发展主流。再往后发展，增强现实抬头显示（AR-HUD）横空出世，其不仅可以融合智能座舱及ADAS相关功能，也可以为驾驶员带来沉浸式体验。</p><p>“目前，HUD产品正处于跨越鸿沟的关键时间点。”张涛如此告诉亿欧汽车。</p><p>1991年，杰弗里·摩尔（Geoffrey A. Moore）提出“跨越鸿沟理论”，主要研究高科技产品在市场推广过程中如何从早期市场跨越到主流市场。摩尔认为从早期采用者到早期大众之间的过渡尤为关键，因为早期市场和主流市场之间存在一条难以跨越的“鸿沟”。一旦跨越过去，新产品将有望实现大规模的市场渗透；如果没有跨越“鸿沟”，该新技术产品将有可能被市场淘汰。</p><p>新技术产品市场占有率在13.5%及以下的时候，处于产品刚刚起步阶段，这时候的用户是创新者和早期采用者。市场占有率过了34%的时候，新产品则迈入了大众主流市场。换句话说，产品技术市占率处于13.5%至34%期间的时候，正好是“跨越鸿沟”的关键节点。</p><p>目前，HUD正处于这个时间段。</p><p>七年前，中国市场HUD的渗透率堪堪突破1%。随后每年都进行着高速的增长，有研究机构统计显示，2023年底，中国市场HUD渗透率已经提升至12.6%。到了2024年上半年中国乘用车前装HUD渗透率已增长至14.3%。9月，HUD渗透率进一步提升至16.7%。</p><p>“我们预计到了2028年，HUD市场渗透率能达到25%左右。”张涛告诉亿欧汽车，“甚至有人乐观估计中国HUD市场渗透率能达到50%。”</p><p><img class=\"image_resized\" src=\"https://diting-hetu.iyiou.com/async/weixin/Ff3IXxdM6IZfcbAK4HXY\" style=\"width:100%;\"/></p><p><span style=\"font-size:20px;\"><strong>技术降本+体验升级，HUD走向大众市场</strong></span></p><p>在张涛看来，车载HUD市场发展前景广阔，极大可能成功地跨越“鸿沟”，走向大众市场。其原因就在于，HUD可以实现“体验持续上升，成本持续下降”。</p><p>过去，司机如果要看导航指令、车速等关键信息，需要低头10°到25°查看仪表盘。这分散了驾驶员的注意力，使其难以集中注意力观察路面情况和周围环境。有数据显示，当汽车以60km/h的速度行驶，司机2-4秒的分心时间就意味着盲行33-66米，这对交通安全造成了较大的隐患。</p><p>车载HUD的上车，大大降低了驾驶员的低头频率，驾驶员可以将更多注意力放在眼前的道路上。</p><p>此外，在仪表盘和道路之间的不断切换，对于驾驶员来说，不仅消耗精力，还可能导致视觉疲劳。白天外部环境更亮，而车内仪表更暗。驾驶员在两者间进行视线转移的过程中，需要瞳孔、睫状肌、眼部肌肉不断调整来适应亮度、焦距等变化，容易造成眼睛疲劳。HUD的引入，可以减少因视线频繁切换造成的视觉负担，有效减轻驾驶员的视觉疲劳，提升驾驶体验。</p><p>随着HUD产品积极拥抱AR技术，利用增强显示技术的车载AR-HUD能够将虚拟图像与现实场景拟合叠加，为驾驶员提供更加丰富和直观的驾驶信息。除了传统HUD提供的基本导航和速度信息，AR-HUD还能结合高级驾驶辅助系统（ADAS）功能，提供前向碰撞预警、车道偏离预警以及交通标志识别等提示，大幅提升驾驶体验。</p><p>从传统仪表到车载HUD，驾驶安全和驾驶体验上都有了大幅改善，成本却没有增多。</p><p>“和2015年我们第一个HUD项目报价相比，目前我们产品价格已经下降了50%。”张涛说道，“正是因为成本的持续下降，才能助力HUD更好地替代传统仪表，实现市占率的提升。”</p><p>在张涛看来，成本控制对于汽车供应商来说至关重要。泽景科技从成立以来就高度重视成本管控，除了通过设计降本、供应链端降本外，公司每年还与客户一起通过VAVE的方式降本。</p><p>虽然泽景科技在积极地控制成本，但是没有放弃对高质量的追求。“我们公司对质量方面有个底线，低于底线的事情我们坚决不做。质量在短期内可能难以察觉，但从3到5年的时间跨度来看，就能检验出来。”</p><p>成立于2015年泽景科技，经过9年的积累与发展，已受到了资本和市场的广泛认可。</p><p>2024年7月，泽景科技完成超亿元E轮融资，此次融资由头部整车厂CVC众擎资本领投，老股东架桥资本跟投。在此之前，泽景科技已完成多轮融资，融资金额达数亿元。</p><p>截止至2024年第三季度，泽景科技HUD累计交付量突破150万台，合作伙伴包括蔚来、理想、小米、比亚迪、广汽新能源、一汽、奇瑞、长安、吉利、丰田等多家头部车企。</p><p>“我们是车载HUD领域的隐形冠军。”泽景科技告诉亿欧汽车。</p><p><span style=\"font-size:20px;\"><strong> “中国车载HUD已是世界级领先”</strong></span></p><p>目前，泽景科技正积极推动产品出海。公司在日本已有业务合作，同时在接触美国境内业务，并全力推动公司在欧洲的发展。</p><p>1月7日，国际消费类电子产品展览会（CES）在拉斯维加斯会议中心盛大开幕。泽景科技也携其最新HUD系列产品及Inno·Vision座舱：IV1亮相现场。</p><p>“中国在车载HUD领域做的并不是相关产品国产化替代，而是全球引领。”张涛告诉亿欧汽车，“我们能拿到数个国际主流汽车厂HUD订单并且已经量产交付，就说明我们的产品已经做到了世界领先。”</p><p>在张涛看来，中国车载HUD产品能达到目前成就，得益于中国汽车电动智能化的高速发展，而这背后是中国工业多年来的累计迭代。</p><p>在汽车电动智能化时代，汽车已经从过去简单的交通工具变成如今的智能化移动终端。这也预示着过去整车厂所擅长的发动机、变速箱等制造工艺已不能成为当今汽车市场竞争的关键因素，汽车智能化水平则逐渐成为输赢关键的胜负手。</p><p>传统燃油车上搭载的每个功能都有其单独的微控制单元（MCU），由不同的汽车电子厂提供。而汽车的电动化赋予了其整体智能化的可能，电动汽车可以实现域集中式、乃至中央集中式电子电气架构，车内的电子零部件不需要各自为政。对于过去的传统整车厂以及汽车电子厂来说，他们并不熟悉打造这套系统。</p><p>在过去几十年里，中国抢先发力汽车电动智能化。同时，中国在互联网和消费电子领域积累了丰富的技术和经验，这些优势能够直接转化为汽车智能化的发展动力。比如，中国手机行业的技术经验能够被借鉴到汽车领域，使得智能座舱和车机系统的用户体验不断提升。此外，中国企业在大数据、云计算和人工智能等领域的技术积累也为智能汽车发展提供了支持。</p><p>鉴于此，连同车载HUD在内的许多智能化产品都能在世界范围内保持领先地位。</p><p>“根据我们的战略规划，计划在2028年实现出货量达300万台。其中，海外的出货量达60万台。”张涛透露道。</p><p>为了达到这个目标，泽景科技也在紧锣密鼓地做着转变。</p><p>泽景科技深刻意识到AI以及数字化对未来工业生产制造的重要性，并提前开始了布局。在泽景科技的规划中，未来公司将会搭建高自动化的数字化工厂，并积极引入相关人才。“从自动化到信息化，再到数字化和智能化。每个阶段逐一攻破，最终实现人工智能。”张涛说道。</p></article>",
            "link": "https://www.iyiou.com/analysis/202502051089512",
            "pub_date": "2025-02-05 10:30:46",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "这款神药，炒成最火理财产品",
            "description": "<article class=\"post-body\" data-v-b51fa692=\"\"><p>在这个冬天，“抗流感神药”速福达（又称玛巴洛沙韦）频频登上热搜。</p><p>作为罗氏制药与日本盐野义制药公司共同研发的新型抗病毒药物，速福达在2021年4月在中国获批上市，同年被纳入新版医保目录。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/XbuDKZPrJWygaTLaXTOQ\"/><figcaption>在这个冬天，“抗流感神药”速福达频登热搜/图源：小红书@宋松松爱跑山</figcaption></figure><p><strong>如今，速福达以“病程只需吃一次、不良反应较低”的特点，备受市场追捧，甚至意外地火成了中产们的新理财产品。</strong></p><p>在京东健康等电商平台，20mg*2片规格的速福达，单盒售价约230元左右。然而，今年1月初，媒体报道称，多地出现速福达一药难求的情况，一些地方还被炒到近300元/盒。</p><p>需求的激增导致“倒卖者”众多，速福达甚至个别能卖到一盒400多元，仍供不应求。这也难怪有网友在小红书上感叹道：速福达的价格涨得比股票快多了。</p><p>速福达，何以成神？</p><h3><strong>吃一次就见效？</strong></h3><p>从去年12月底到今年1月，国内流感进入高发期，且99%以上为甲流。不少人在社交平台上晒出自己患上甲流后的感受，甚至还有亲属感染甲流后死亡的情况。</p><p>“我32年的人生里，从没因病躺床上疼得直哼哼。”姜禹告诉盐财经记者，他在一次出国旅行中感染上了甲流，在回国的飞机上，便已出现高热的状况。回到家中后，姜禹还出现了流鼻涕、嗓子痛以及四肢酸痛的症状。</p><p>与姜禹同行的友人，也全部“中招”甲流，有人连续三晚高烧到39度，也有人头疼加浑身酸痛，“发烧，烧得人迷糊”。</p><p>姜禹第一时间吃了有“抗流感神药”之称的速福达，两天后，虽然依旧头疼，但其他症状已有所缓解。相比之下，同行友人中有人吃了另一治疗甲流的药物奥司他韦。尽管奥司他韦服用了五天时间，但这位友人花了近十天时间才恢复，远不及姜禹恢复的得快。</p><p>购买速福达后，盐财经记者发现，该药品为单片20毫克两片装，说明书建议将两片药物1次服用。从作用机制来说，速福达是通过抑制流感病毒的RNA聚合酶，抑制流感病毒复制，起到抗病毒作用。</p><p><strong>可以说，速福达的“火热”，很大程度上源于服药次数少。在整个病程中，只需服药1次，是速福达最大的特点。</strong></p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/fFzDclpU4qrASani7tZG\"/><figcaption>速福达药品与其说明书 盐财经记者/摄</figcaption></figure><p>为什么速福达，仅吃1次就有效？</p><p><strong>速福达的活性代谢产物的半衰期长达99.7小时。</strong>半衰期，是衡量药物在机体内代谢速度的一个重要指标。半衰期越长，说明药物维持药效的时间越长。</p><p>通俗点说，速福达在人体内的代谢非常慢，患者服用1次，四到五天之内都可以发挥药效。</p><p>半衰期长，虽然方便患者吃药，但也为患者的健康带来了隐忧与风险——由于药物在体内停留时间长，一旦服用过量，难以快速排除；如果出现药物过敏的情况，或会引发休克等风险。</p><p>与速福达形成鲜明对比的，是另一流感治疗药物奥司他韦，其半衰期仅为6—10小时。不过，虽然奥司他韦半衰期短，但在2024年12月发布的最新版《儿童流感诊疗及预防指南》中，奥司他韦全年龄段可用，需每天2次服用5天。玛巴洛沙韦则需要5岁以上儿童才能使用。</p><p>值得注意的是，速福达与奥司他韦都是处方药，需医生开具处方才能购买。不过，盐财经记者在一些社交平台上看到，有人表示，通过网络平台也可非常方便地买到处方药品，“提前买下有备无患”。</p><p>需要提醒的是，据专家建议，提前服用速福达与奥司他韦，并不能起到有效预防流感的效果，只有确诊流感，才可使用相关药品；另一方面，如果滥用药物，可能也会加速耐药毒株的到来。</p><h3><strong>贵过黄金？</strong></h3><p>所谓“吃一次就见效”的速福达，贵吗？</p><p>价格上，据媒体报道，速福达比普通感冒药贵出不少，医药平台和线下药店的2片装速福达价格在230元至298元之间，比10粒达菲（线上平台显示205元）的价格还贵。一位网友在社交媒体晒出的小票截图显示，其在医院购买的2片装速福达为259元，即每片129.5元。</p><p>更形象来看，以速福达的医保支付价222.36元/盒（20毫克*2片）进行计算，其1g的价格高达5559元，约等于10g黄金。</p><p>这意味着，<strong>速福达的价格贵过了黄金，被人戏称为中产最佳“理财产品”。</strong></p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/bkD7TOV20IrMsQ0gIlBn\"/><figcaption>有网友评论速福达比黄金还贵‍‍‍‍‍‍‍‍</figcaption></figure><p>速福达是罗氏制药推出的原创性新药。行业内对于新药研发有着“研发周期10年，耗资10亿美元，成功率不足10%”的公认定律，原研药不仅研发成本极高，研发时间也长。</p><p>因此，<strong>对于原研药企来说，一款新药的定价，不仅包含其高昂的研发成本，还包括其他失败药物的研发成本。</strong>所以，新药上市，往往价格不会太便宜。</p><p>而原研药的专利保护期通常为20年，在专利保护期内，原研药享有独占权，其他企业不能仿制。目前，<strong>速福达尚在专利保护期内，国内无仿制药。</strong></p><p>另一流感治疗药物奥司他韦，其国内仿制药价格在40—60元之间，是速福达价格的1/4。</p><p>与几块钱就能缓解症状的布洛芬或对乙酰氨基酚相比，有人纳闷，<strong>为什么治疗感冒的药便宜，治疗类似症状的流感药物却这么贵？</strong></p><p>很多人分不清普通感冒与流感的区别。普通感冒不发热或中度发热，而流感常见高热（39度以上），并且全身症状明显。除了感冒会有的咳嗽、流鼻涕、嗓子疼等上呼吸道症状外，流感还会出现头痛、乏力、全身肌肉酸痛等症状。严重时，流感还会引起肺炎、脑膜炎、中耳炎、心肌炎等并发症。</p><p>对于老人、小孩以及孕妇和慢性病患者来说，流感的威胁极大。但很多人并未意识到流感的凶猛，事实上，孕妇在孕早期感染甲流后，孩子畸形而引产；也有儿童在感染甲流后，不到4天便死亡的案例。</p><p>根据世界卫生组织估计，流感每年在全球可导致300万—500万重症病例，约29万—65万人死亡。而由甲流引发的20世纪影响人数最广的“西班牙流感”中，单这一次大流行，就夺去了4000万—5000万人的生命。</p><p><strong>流感并不是由感冒引起的，与普通感冒是完全不同的疾病，因此用药也完全不同。</strong></p><p>虽然流感新药速福达较贵，但国内也有奥司他韦、拉尼米韦等价格较为便宜的仿制药获批。</p><p>另一好消息是，1月21日国家传染病医学中心，复旦大学附属华山医院张文宏团队在感染病领域顶刊《Clinical Microbiology and Infection》上发表了一项关于新型口服抗流感药物ZX-7101A的2/3期临床数据，研究了这种药物在治疗单纯性成人流感中的安全性和有效性。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/V1fgx3vtEPVGuEx3ap4B\"/><figcaption>张文宏团队在感染病领域顶刊《Clinical Microbiology and Infection》上发表的一项关于新型口服抗流感药物ZX-7101A的2/3期临床数据</figcaption></figure><p>据张文宏团队介绍，这款新型口服抗流感药物与玛巴洛沙韦作用机制相同。业内人士表示，该药物有望成为流感明星药“速福达”的国产版本。</p><h3><strong>“神药”被忽视的问题</strong></h3><p>针对流感的抗病毒药物研发，一直是医药行业的研究热点。从1965年三菱田边公司推出的金刚烷胺，到1999年罗氏制药推出的奥司他韦（商品名：达菲），再到2018年罗氏制药研发的玛巴洛沙韦（商品名：速福达）……<strong>近几十年来，流感用药是强生、罗氏、葛兰素史克等跨国行业巨头的兵家必争之地。</strong></p><p>在中国，奥司他韦一直是流感用药的主流选择。</p><p>2001年，奥司他韦原研药“达菲”在中国获批。此后，罗氏制药于2005年和2006年，将奥司他韦先后授权给上海中西三维药业以及东阳光药生产，商品名分别为“奥尔菲”和“可威”。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/0nGFM2yuI0jDVkwtM2sy\"/><figcaption>全球上市的主要抗流感药物/图源：创药网</figcaption></figure><p>然而，东阳光生产的奥司他韦仿制药“可威”后来者居上，在中国的市场份额超过90%。罗氏的原研药“达菲”市场份额只有7%，远不及“可威”。</p><p>罗氏并没“押宝”在奥司他韦这一棵树上。随着奥司他韦专利保护期到期，大批仿制药企一拥而上，罗氏与日本盐野义制药公司共同研发了新型抗病毒药物“速福达”，在中国于2021年上市。</p><p><strong>社交平台有关“只吃一次的流感神药”的炒作，令速福达在中国快速走红，也让罗氏制药目前有关速福达的全球产能都在向中国市场倾斜。</strong></p><p>2024年10月，罗氏制药宣布速福达片剂分包装将在中国上海开展本地化生产，这意味着，速福达的生产供应链将有效缩短。</p><p>速福达成罗氏制药在中国的“吸金法器”。财报显示，2024年上半年，罗氏制药在中国市场销售收入同比增长14%，速福达是促成营收增长的五款药物之一。</p><p>另据医药信息健康平台米内网统计，速福达在中国市场的销售额2022年约为0.6亿元，2023年销售额约5亿元。</p><p><strong>在医药界，有“10亿美元分子”的说法，即一款药年销售额超越10亿美元大关，便可“封神”。尽管并无2024年最新数据，但在此轮流感季中，或许速福达能在中国市场突破年销售额10亿元。</strong></p><p>不过，由于其上市时间较晚，速福达安全性数据与治疗重症患者方面的数据不足，对于孕妇与重症患者来说，优先选择的药物还是奥司他韦。</p><p>需要强调的是，<strong>5岁以下儿童并不被建议使用“速福达”</strong>。中文版药品说明书显示，在儿童患者中，甲型/H1N1和甲型/H3N2病毒感染后，发生与玛巴洛沙韦敏感性下降相关的给药后氨基酸突变的总发生率分别高达24%和65%。</p><p>在美国版速福达2024年12月19日最新发布的说明书中也明确指出，5岁以下儿童不应使用玛巴洛沙韦，主要原因是，该年龄段儿童的耐药率高达40%，5—12岁的儿童耐药率也高达16%。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/6d8oZNE4X5mlRxINoEUu\"/><figcaption>美国版速福达的说明书中明确指出，5岁以下儿童的耐药率高达40%</figcaption></figure><p><strong>然而，相对所谓的神药，在每年流感季到来前，注射疫苗仍然是最经济的手段。</strong></p><p>“接种流感疫苗可以显著降低发病和发生严重并发症的风险。”中国疾病预防控制中心病毒病预防控制所研究员王大燕表示，虽然一般建议大家在流感流行季来临之前接种流感疫苗，但是对我们每个个体而言，只要还没有感染，就可以通过接种流感疫苗来预防流感。</p><p>一位深圳儿科医生也向盐财经记者表示，“预防流感最有效的手段，主要是接种疫苗”。</p><p>但是，<strong>中国流感疫苗接种率远低于欧美国家</strong>。数据显示，中国流感疫苗接种率在3%上下，而在欧美等国，每年约有46%以上的人群接种流感疫苗。</p><p>而只要还处于流感病毒传播活跃期，中国疾控中心传染病处研究员王丽萍表示，接种疫苗就能帮助降低感染风险。现在接种疫苗也不晚。</p></article>",
            "link": "https://www.iyiou.com/news/202502051089517",
            "pub_date": "2025-02-05 10:15:41",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "2025年中国白酒国际化新趋势",
            "description": "<article class=\"post-body\" data-v-b51fa692=\"\"><p>在国内市场竞争加剧及经济波动的情形下，中国白酒企业正在积极开拓国际市场。</p><p>实际上，中国白酒国际化已持续多年，但成果有所反复，国际化战略效果并不理想，既有内因，也有外因干扰。其中，内因包括白酒公司重心仍聚焦国内市场，外因则包括高额的关税、标准不统一、渠道建设跟不上等。</p><p>白酒公司提升国际化战略的背后，是中国白酒市场已从增量阶段进入存量阶段。国家统计局数据显示，2024年1月-12月，中国规模以上工业企业白酒（折65度，商品量）产量累计值为414.5万千升，同比下滑1.8%。2024年前三季度，多家白酒上市公司业绩疲软，已有头部白酒公司业绩出现下滑。</p><p>行业深度调整之际，国际化水平成为投资者衡量白酒公司投资价值的重要指标。有投资人表示，“目前的投资原则是：对于消费行业没有海外业务增长空间的企业，不投；有海外业务增长空间的企业，择时投。”基于市场拓展需求与行业发展趋势，白酒出海已从曾经的选择题，变成现如今很多公司的必选题。</p><h3><strong>国内竞争加剧，全球市场潜力巨大</strong></h3><p>在全球化进程和宏观经济周期的波动影响下，中国白酒行业从增量市场演变至存量市场乃至缩量竞争阶段。这一趋势在2024年三季报中得到了体现，多家上市酒企的业绩增速明显放缓。</p><p>作为白酒龙头的贵州茅台，2024年前三季度营收和归母净利润增速分别为16.95%、15.04%，相对于上年同期的18.48%、19.09%增幅，均有所下滑；五粮液上述增速从双位数降至个位数；洋河股份上述增速更是由双位数增长变为下滑。</p><p>年度数据亦有相同趋势。贵州茅台初步核算，预计2024年公司营业总收入、归母净利润同比增幅分别约为15.44%、14.67%，相对于2023年同期的18.04%、19.16%增幅，均有所下滑。</p><p>中国酒业协会发布的《2024中国白酒产业发展年度报告》指出，包括进口酒在内整个酒类流通市场有近2万亿元规模，从事酒类流通行业的注册企业达940万家，企业之间的竞争日益激烈。</p><p>尽管国内白酒市场竞争日趋加剧，但全球烈酒市场规模依然庞大。据德国数据统计机构Statista数据显示，2023年全球烈酒市场总营收约5253亿美元（约合人民币3.82万亿元）；2023年-2027年，全球烈酒市场营收有望保持4.56%的年均复合增长率。</p><p>虽然中国白酒出口额在2023年增至8.05亿美元，但占比依然较低。2022年威士忌出口占全球酒精饮料出口额的比重已达到15.27%，相比之下，白酒出口额占比仅为0.71%。</p><p>随着白酒企业不断开拓国际市场，中国酒类出海在中国品牌中达到平均速度之上。</p><p>2024年11月，中国贸促会研究院院长赵萍曾在一场行业活动上表示，2024年前三季度，中国酒类出口额同比增速高于同期外贸出口总额的增速，中国酒类出海已在中国品牌中达到平均速度之上。</p><p>中国食品土畜进出口商会酒类进出口商分会数据显示，2024年1月-10月，中国酒类出口总量、出口总额分别为6.2</p><p>亿升、14.9亿美元，同比增速均超6%。其中，白酒是出口酒第一大品类，出口额同比增长14.1%至7.2亿美元（约人民币</p><p>52.42亿元），在出口酒总额中占比约48.4%；出口量同比增长3.3%至1275万升。</p><p>据统计，中国白酒出口额从2015年的4.49亿美元攀升至2023年的8.05亿美元，八年间实现了近乎翻倍的增长。</p><p>中国白酒出海目的地中，按出口额算，中国香港、中国澳门、美国分居前三位。</p><p>中国食品土畜进出口商会酒类进出口商分会数据显示，2024年1月-10月，中国白酒共向93个目的地市场出口。中国香港延续较好增势，出口量增长2.4%，出口额则增长43.4%至2.09亿美元，在所有出口目的地中出口额占比第一，占比将近三成。</p><p>作为白酒出海的“桥头堡”，香港在白酒国际化进程中扮演了重要角色，其不仅是一个核心消费地，也是中国白酒打响品牌的关键地。</p><p>2024年10月，中国香港宣布烈酒税大幅度下降。按照最新关税政策，进口价200港元以上的烈酒，200港元以上部分的税率由100%减至10%；进口价在200港元或以下的烈酒，税率则维持不变。有机构指出，关税的下调，有利于直接激活香港本地的烈酒消费市场，特别是白酒品类。</p><p>除了中国香港，在2024年1月-10月中国白酒出口的前十大目的地中，美国、新加坡、澳大利亚、法国等发达国家的出口额也均有较大幅度的上升。美国的出口额、出口量双增长，出口额直逼中国澳门，位列第三。法国的出口额同比增长127.8%，出口量增长47.1%，两项指标增幅均位居首位。</p><p>2024年是中法建交60周年，巴黎奥运会期间，两国各类交流活动不断，为白酒出口到法国提供了好的应用场景。其余目的地出口份额零散且平均，整体规模偏小，市场开拓潜力较大。</p><h3><strong>开拓市场，白酒出海进入深水区</strong></h3><p>酒企国际营收普遍增长的背后，各大酒企使出浑身解数争相开拓海外市场。</p><p>梳理A股上市酒企的财报发现，贵州茅台、泸州老窖、古井贡酒等七家企业披露了海外营收数据，从2024年中报数据看，七家公司境外收入最高的是贵州茅台，其境外收入同比增长近8%至22.04亿元，占总收入比例为2.4%，占上述A股上市酒企境外总收入比例超九成。</p><p>同样表现突出的是水井坊，2024年上半年其国外收入0.28亿元，占总收入比例为1.64%，同比增长约40.52%，而其2024年前三季度国外销售收入达5098.45万元，同比增长65%。有机构分析指出，水井坊国外销售收入大幅增长，得益于公司背靠国际烈酒集团帝亚吉欧，有一定的海外渠道优势。</p><p>对出海的酒企而言，出海渠道建设是关键。2024年上半年，贵州茅台国外经销商数量106家，与2023年持平，公司营销网络覆盖国内市场及五大洲64个国家和地区。也有酒企调整海外经销商团队，同期泸州老窖境外经销商数量为92家，相对于2023年，净减少12家。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/1qKs7mk2rIad98Ldq12g\"/></p><p>对外交流活动与品牌营销是酒企出海的先行战略。总营收在行业内排名靠前的五粮液、山西汾酒、洋河股份等企业对外交流活动频繁。</p><p>从各酒企的国际化行动上看，五粮液产品出口覆盖全球100余个国家和地区，并在亚太、欧洲、美洲设立三大国际营销中心，实现中免免税门店全覆盖；汾酒海外市场覆盖亚洲、欧洲、美洲等60多个国家和地区，拥有100余家海外经销商，设立超9000家终端店和180多家国外免税店及中国离境免税店；洋河产品已覆盖区域涉及六大洲、80个国家和地区，并在多个国家建设白酒文化体验中心；泸州老窖设立了泸州老窖国际发展（香港）有限公司等三家境外子公司。</p><p>值得注意的是，在出海方面，白酒产区开始抱团讲述产品起源故事。这个特征在白酒产销大省的四川省和贵州省，表现较为明显。</p><p>2024年，由贵州省商务厅主办的“黔酒全球行”相继走进韩国、日本、新加坡、中国香港等国家和地区。其中，在“黔酒全球行”韩国品鉴推介会上，茅台、习酒、珍酒、国台、贵州醇、青酒、匀酒、钓鱼台等贵州优质白酒品牌代表，在现场通过演讲、展示、品鉴等宣推贵州酱香白酒品牌和文化。</p><p>在此之前，“川酒通江海 和美共酒香”2023川酒全球行活动走进澳大利亚、日本等地进行产品推广和品牌宣传。</p><p>上述区域品牌抱团出海，以产区之名对外发声，共同开拓国际市场，有利于扩大中国白酒出海整体势能，亦对单个品牌海外传播有很大帮助。</p><p>借助系列活动或走访交流，中国白酒企业深度考察全球市场，了解当地消费习惯与喜好，加强与当地组织、经销商的合作与交流，是中国白酒出海“深度落地”的必经之路。</p><h3><strong>道阻且长，白酒国际化面临挑战</strong></h3><p>尽管白酒企业在积极拓展国际市场，但中国白酒出海仍面临标准制定、政策法规、销售渠道、合作伙伴、关税税率等挑战。</p><p>首先，市场竞争是白酒出海面临的重要挑战之一。威士忌、白兰地等品类在全球烈酒市场竞争已成规模。全球烈酒市场中，虽然中国是烈酒三大生产国之一，也是最大消费国，但威士忌、白兰地等品类已经占据较高的市场份额，且具有较高的品牌知名度和消费者忠诚度。</p><p>与国内市场的销售规模相比，中国白酒行业出口板块的收入目前仍然较小，仍以内销为主。2016年白酒行业复苏以来，中国白酒企业工作重心仍聚焦于国内市场，出海工作虽然在推进，但海外消费群体依然停留在华人圈，品牌、市场、渠道等方面的投入相对不大。</p><p>国外收入增长的前提是需要企业前期大量的投入。目前，中国多家白酒国际化尚处于品牌先行的初级阶段。虽然多家中国白酒公司喊出国际化从“走出去”到“走进去”，但这仍是一条漫长且充满挑战的道路。</p><p>其次，高企的税收也对白酒出海构成了挑战。不同国家对酒类产品的税收政策差异较大，部分国家对进口烈酒征收高额关税和消费税，增加了白酒的出口成本。</p><p>有券商指出，因国际贸易政策不对等，中国在加入WTO（世界贸易组织）时，将酒类列为普通消费品，而西方国家普遍将酒类商品划分为特殊食品，致使白酒进入其他国家普遍被课以重税。</p><p>跟国内白酒多重征税类似，海外部分国家针对烈酒也有多种税收。以美国为例，中国白酒在美国被统一归类为烈酒，需缴纳关税、所得税、社会保障税等多项税种。高昂的税收不仅削弱了白酒的价格竞争力，也限制了其在国际市场上的推广和销售。</p><p>贵州茅台酒销售公司党委书记、董事长张旭此前曾公开表示，茅台出口的64个国家地区的关税比较高，关税在50%以上，占比近半。其中，关税150%以上的有2个，100%-150%的有10个，50%-100%的有19个。</p><p>2024年10月，山西杏花村汾酒国际贸易有限责任公司总经理张维栋曾公开表示，目前，大多国家的关税在50%以上，印度尼西亚关税高达300%，欧洲一些国家的关税则在80%-100%。“美国、日本关税相对较低，但它们各自的政策、法规特别严谨，中国酒企需要一一考察。”</p><p>各国针对饮酒的不同政策法规，为渠道市场开拓带来挑战。有国家限制酒的消费，也有国家实行许可证制。美国多州普遍规定饮酒年龄为21岁；在印度，关于喝酒的法律可谓是因州而异；在沙特则对饮酒有严格禁令；新加坡几乎所有公共场所都禁止饮酒。</p><p>中国白酒和国外消费者的消费场景不匹配，当地消费者对中国白酒文化和产品了解不够。白酒独特的酿造工艺和饮用文化与西方国家的饮酒习惯存在显著差异。例如，白酒的高酒精度通常在52度-53度，而西方消费者更习惯于酒精度相对较低的饮品，如威士忌的酒精度一般为40度-46度。</p><p>此外，白酒的饮用方式，以及在搭配食物、用餐场景等方面，都与西方餐饮文化存在出入。西方饮酒文化注重餐酒搭配的协调性，而白酒传统的饮用方式和搭配场景在西方较难直接复制。</p><h3><strong>全球市场复苏，白酒出海大有可为</strong></h3><p>挑战之下，仍有机会。全球酒精饮料市场规模的逐渐复苏，为白酒行业提供了新的增长点。据Statista数据显示，2022年全球烈酒市场规模已增长至4844亿美元，2022年后增长步伐加快，预计2025年将达到6031亿美元。中国作为世界三大烈酒生产国之一，白酒出口的潜力巨大，有望在全球市场中占据更大的份额。</p><p>2025年多家酒企计划发力国际市场，拓展新增量，以期迎来中国白酒真正意义上的国际年。</p><p>白酒出海正步入新的发展阶段，国际化策略向产品创新、渠道建设、场景搭建等方向转变。2025年，已有多家知名酒企将出海作为新年的重点工作之一，希望能够通过本地化运营，实现在当地市场扎根。据悉，已有酒企与海外酒企合作开发新品，拓展当地市场。</p><p>对于白酒企业，不仅要“走出去”，打造全球可感知和认同的“价值体系”，还要“请进来”。打造世界级酿造酒产区，以产区作为世界级名酒高品质和高价值的载体是重要的方向。</p><p>通过多元化探索，深入调研国际市场，了解当地消费习惯，打通供应链，让中国白酒文化、白酒消费融入当地消费者习惯（不局限于当地华人）中，并通过品鉴、“白酒+”等方式，开拓新的国际化途径。</p><p>首创证券曾于2023年10月发布报告称，从白酒消费人群基数做白酒消费市场假设推演，预计行业端需求十年后或将下滑10%。“以十年长周期维度来看，白酒的挤压式竞争更加残酷，在战略层面扩大白酒适龄人口（例如国际化）、提升白酒饮用人口比例（例如年轻化、时尚化）等，或将赢得白酒下半程的发展先机。”</p><p>因此，产品创新被白酒企业高度重视。多家头部酒企公司，在适应海外年轻人口味方面，已推出新品。结合海外市场消费者需求和人群特点调整产品结构，白酒企业可能推出更多适合国际消费者的新产品，如低度化、多样化的白酒产品，以及与国际烈酒或其他饮品混合调制的创新产品，如白酒鸡尾酒、酱香拿铁等。而鸡尾酒，作为国际通用饮酒形式，直接降低了海外消费门槛。</p><p>此外，中国白酒可以伴随中餐走出去，与中国川菜、湘菜等不同菜系搭配，通过佐餐酒培育消费习惯。现阶段，白酒海外销售占比很小，专门针对国际化市场打造专属出海产品的企业仍是少数，对于布局出海业务的企业而言，尝试“白酒+餐饮”的形式也是一种选择，多家公司已在开展这种模式。</p><p>同时，数智化也是白酒行业的新趋势。有行业专家指出，传统产业借助数智化提升已成为必然选择，未来智慧酿造将成为白酒行业的新发展趋势。中国酒业协会也将在2025年结合AI新技术等进行推广，积极建设国家级酒文化与产品贸易推广平台，打造白酒“1+N”国际传播模式等。</p><p>借助数字营销创新，白酒企业可以更好地拓展海外市场。TikTok等社交媒体平台的兴起为白酒海外直播带货提供了新的渠道。企业可以通过直播展示白酒的酿造工艺、文化内涵及与美食的搭配方式，吸引海外消费者的关注和购买。</p><p>最后，白酒行业的国际化发展离不开政策的支持。近年来，中国政府出台了一系列政策，鼓励白酒行业积极开拓国际市场，打造具有国际影响力的白酒品牌。</p><p>总体来看，尽管面临文化差异、税收政策以及市场竞争等多重挑战，但全球酒精饮料市场的复苏、政策支持以及对外投资的扩大，为白酒出海带来新的发展机遇。</p><p>未来，“一带一路”倡议的深入推进、中国对外直接投资的规模持续扩大、跨境电商蓬勃发展，都将为中国白酒出海增长带来更多渠道和场景。</p><p>通过市场适应、场景融合、数字营销创新、产品创新以及品牌建设等策略，中国白酒有望在国际舞台上实现突破，提升其全球影响力和竞争力，为行业的发展注入新的活力。</p></article>",
            "link": "https://www.iyiou.com/analysis/202502051089514",
            "pub_date": "2025-02-05 10:15:43",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "未来材料产业周报(01.28 - 02.04) : 我国成功验证第三代半导体材料制造的功率器件",
            "description": "<article class=\"post-body\" data-v-b51fa692=\"\"><h2> * 公司动态 </h2> <blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/90a8706c5796c3a32034055667b11e23\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">我国在太空成功验证第三代半导体材料制造的功率器件</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    财联社2月2日电，以碳化硅（SiC）为代表的第三代半导体材料是我国制造业转型升级的驱动因素和重要保证。记者从中国科学院微电子研究所获悉，我国在太空成功验证了首款国产碳化硅（SiC）功率器件，第三代半导体材料有望牵引我国航天电源升级换代。据中国科学院微电子研究所刘新宇研究员介绍，功率器件是实现电能变换和控制的核心，被誉为“电力电子系统的心脏”，是最为基础、应用最为广泛的器件之一。随着硅基功率器件的性能逼近极限，以碳化硅（SiC）为代表的第三代半导体材料，以其独特优势可满足空间电源系统高能效、小型化、轻量化需求，对新一代航天技术发展具有重要战略意义。\n\n业内专家认为，我国在太空成功验证第三代半导体材料制造的功率器件，标志着在以“克”为计量的空间载荷需求下，碳化硅（SiC）功率器件有望牵引空间电源系统的升级换代，为未来我国在探月工程、载人登月、深空探测等领域提供新一代功率器件。 (新华社)\n    </font>\n</p>\n</blockquote>\n<blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/007a28d1c0df58b106f37df7de150376\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\"> 稀土概念股午后拉升 中国稀土(00769)最高涨超17% 机构看好稀土等战略金属地位提升</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    智通财经APP获悉，稀土概念股午后拉升，中国稀土(00769)一度涨超17%，金力永磁(06680)由跌转涨。截至发稿，中国稀土涨11.84%，报0.425港元，金力永磁涨2.61%，报9.43港元。消息面上，商务部、海关总署4日联合发布公告称，为维护国家安全和利益、履行防扩散等国际义务，经国务院批准，决定对钨、碲、铋、钼、铟相关物项实施出口管制。中信证券此前研报曾指出，我国对于关键金属资源的出口管制有望提升其战略地位，对于维护国家安全和利益具有重要战略意义。该行认为不排除后续出口管制政策或将延续至钨、稀土等战略金属品种的可能性，建议关注相关金属的投资机会。银河证券此前指出，在可能面临新一轮贸易战的情况下，稀土作为我国优势金属，或将被市场预期成为政策上可选择的反制工具，迎来更多的政策支持。\n    </font>\n</p>\n</blockquote>\n<blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/8a8c61d041b13e0fd71fc1b3b56ef70a\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">中信证券：碳纳米管行业拐点将至 国内新产能亟待释放</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    财联社2月2日电，中信证券研报称，碳纳米管是改善锂离子充放电性能和循环寿命的关键导电材料，受益于快充、固态电池、硅负极等新技术渗透率不断提升，碳纳米管迎来用量提升与产品升级，同时具有更好性能的新产品单壁碳纳米管预计即将放量，为行业开启新的成长周期，我们测算2030年碳纳米管行业空间419亿元，其中单壁碳纳米管贡献41%，是行业成长的主要动力。中信证券根据行业需求和俄罗斯单壁管厂商OCSiAl的产能测算，行业将在未来两年形成较大规模的供给缺口，国内新产能亟待释放，行业拐点将至。我们认为国内布局单壁碳纳米管的厂商将充分受益。\n    </font>\n</p>\n</blockquote>\n<blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/61eca3c257c5f6f275c28a6d14af76f6\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">电子科技大学肖波团队《Biomaterials》：柞蚕丝纳米纤维促进糖尿病创面愈合</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    电子科技大学肖波团队在《Biomaterials》期刊发表研究，发现柞蚕丝纳米纤维可通过其内在的RGD序列促进糖尿病创面愈合。该研究指出，糖尿病创面中M1型巨噬细胞和功能紊乱的基质金属蛋白酶（MMP）导致持续炎症反应，阻碍创面愈合。而柞蚕丝纳米纤维能通过激活JAK2-STAT5b和PI3K-Akt信号通路，将M1型巨噬细胞极化为抗炎的M2型，并抑制炎症因子分泌，提高抑炎因子表达。此外，柞蚕丝纳米纤维还能作为竞争性底物抑制MMP降解新生细胞外基质。研究团队采用剪切溶胀处理从柞蚕丝中直接剥离出纳米纤维，制备成海绵状敷料，工艺简单且绿色环保，具有优异的生物相容性和可酶降解性，有助于成纤维细胞迁移与粘附、血管内皮细胞成管排列及巨噬细胞迁移。这一创新策略为糖尿病创面治疗提供了新的无药物解决方案。（摘要由动脉网AI生成）\n    </font>\n</p>\n</blockquote>\n<blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/0e8852312a8d9090454c8dbc5c70e1e6\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">研究发展出光热无线深部脑刺激纳米系统</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    中国科学院陈春英团队开发了一种基于纳米颗粒的光热无线深部脑刺激系统（ATB NPs），用于治疗帕金森病。该系统通过激活神经元内源性表达的热敏TRPV1受体，实现对退化神经元的精准调控。ATB NPs由光热转换模块（金纳米壳AuNSs）、靶向模块（TRPV1抗体）和降解模块（β-syn多肽）组成。在808 nm脉冲近红外激光照射下，ATB NPs能够激活TRPV1受体，引起Ca内流和动作电位产生，并通过自噬途径清除α-突触核蛋白聚集体，从而恢复多巴胺能神经元的功能，改善帕金森病小鼠的运动功能。这项技术具有非侵入性和高空间分辨率的特点，为帕金森病的治疗提供了新的方向。研究成果发表在《科学进展》上。（摘要由动脉网AI生成）\n    </font>\n</p>\n</blockquote>\n<h2> * 行业动态 </h2> <blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/4a011c874a6ea5d7058035592a02ff40\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">25年医考报考材料汇总！</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    2025年医师资格考试临近，报考需准备毕业证书、报名表、学历证明、医师资格考试试用期考核证明、身份证复印件等材料。具体材料以当地最新通知为准。备考2025年考试需找方法，推荐专业老师助您科学备考。医考培训机构选择应看重通过率，通过16年编题积累，帮助医考生精准备考。\n    </font>\n</p>\n</blockquote>\n<blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/449ae7995221b91a30c5b0283a42adfd\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">  梦牌新材料，用匠心做好板筑好家，弘扬国货自信</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    北新建材旗下梦牌新材料于大年初四推出新春文创大礼包活动，包括20套办公三件套。梦牌新材料致力于提供高品质、价格厚道的石膏板产品，弘扬传统文化，推出具有防霉、抗菌、净醛功效的“国色”系列产品。此外，梦牌M系列高端家装功能石膏板具有高强度、高隔音等特点，适用于多种建筑物的内隔墙、天花板等。活动参与方式包括关注北新建材、点赞转发文章、留言祝福，获赞前20名用户将获得大礼包。\n    </font>\n</p>\n</blockquote>\n<blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/aeaea4629cec877e0a18315cd804e669\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">Nat Commun丨清华大学杜娟娟团队通过条形码筛选确定蛋白质递送至肾脏的纳米载体</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    清华大学药学院研究团队在《Nature Communications》上发表研究论文，通过DNA条形码高通量筛选技术，成功构建了具有肾脏靶向特性的纳米胶囊库。该研究通过原位聚合技术，结合不同单体创建了具有独特表面特性的纳米胶囊，并利用雌性小鼠进行体外和体内筛选，发现富含肾脏的纳米胶囊能有效递送过氧化氢酶，减轻顺铂诱导的急性肾损伤。研究提出了一种识别蛋白质递送载体的新方法，为蛋白质治疗药物的应用提供了新的策略。\n    </font>\n</p>\n</blockquote>\n<blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/1daaf596931f236b598ffb6e77a9f4ad\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">美中央司令部：协助伊拉克安全部队打死5名极端组织成员</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    当地时间2月4日，美国中央司令部在社交媒体上发文表示，伊拉克安全部队1月31日在美国中央司令部部队的支持下，在伊拉克基尔库克附近实施精确空袭，打死5名极端组织“伊斯兰国”成员。在袭击后的初步清理中，发现大量自杀式爆炸腰带及其他材料。伊拉克安全部队领导的此次行动是正在进行的“击败伊斯兰国”行动的一部分，旨在破坏和削弱极端组织“伊斯兰国”的能力，摧毁其攻击网络。\n    </font>\n</p>\n</blockquote>\n<h2> * 其他 </h2> <blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/dede96a4b9a1c90ae558736cd8c3e529\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">《Science Robotics》新成果，让软机器人“活”得更久的3D打印</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    《Science Robotics》发表的新研究介绍了一种先进的3D打印技术——原位自由形式液态3D打印（iFL3DP），由新加坡科技设计大学的Pablo Valdivia y Alvarado团队开发。该技术通过直接在软机器人表面打印多材料组件，实现了复杂几何形状的功能升级和维修。具体创新点包括：1）开发了iFL3DP技术，能够制造复杂的多材料组件；2）成功应用于软机器人的功能升级，如添加触须状传感器、抓取机构等，提高了环境交互能力和操作性能；3）简化了维修流程，并通过模块化设计快速更换损坏部件，显著延长了软机器人的使用寿命。这一技术为软机器人的可持续发展提供了有力支持，解决了其生命周期有限和难以维修的问题。（摘要由动脉网AI生成）\n    </font>\n</p>\n</blockquote>\n<blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/cfc83b6eba7edb207d6d5e3c39a3c3ee\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">J Orthop Traumatol：3D打印辅助手术与传统手术治疗骨折的疗效对比研究</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    该研究探讨了3D打印辅助手术与传统手术在骨折治疗中的疗效对比。传统手术依赖X射线、CT和MRI等二维成像技术，但这些技术在处理复杂骨折时存在局限性，可能导致术前规划不佳和术后并发症。相比之下，3D打印技术能够生成精确的三维骨折模型，帮助医生更好地理解骨折形态，并进行手术模拟，优化手术计划，减少不必要的组织损伤。此外，3D打印还能制造个性化植入物和手术工具，提高手术的准确性和成功率。尽管3D打印技术具有显著优势，但也存在成本较高且不适用于所有骨折类型等缺点。总体而言，3D打印在转化医学和骨科中显示出巨大的潜力，有助于将科研成果转化为临床实践，提高骨折治疗效果。（摘要由动脉网AI生成）\n    </font>\n</p>\n</blockquote>\n<blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/82a45e585bea7c6651bfee9c11d6d502\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">未来材料产业周报(01.21 - 01.28) : 上海石化投32亿建碳纤维项目</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    上海石化投资约31.96亿元建设大丝束碳纤维项目，选址内蒙古鄂尔多斯市苏里格经济开发区，旨在降低生产成本，推进产业结构调整。中国稀土子公司中稀永州稀土分离加工项目正式生产运营，具备年处理5000吨离子型稀土精矿分离加工能力。富士胶片计划投资超1000亿日元提高芯片材料产量。富加镓业完成C轮融资，获资本青睐。北方稀土预计2024年归母净利润同比预降54.41%-59.9%。荷兰特文特大学开发室温下制造有序半导体材料新工艺。3D打印肋骨模型助力外科医生手术规划。中国稀土行业协会：稀土价格指数与前一日持平。\n    </font>\n</p>\n</blockquote>\n<blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/f0b6db0ce130ad75e0cfa202d5eafda6\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">Eur J Trauma Emerg Surg：定制植入物结合3D打印钻孔导向技术用于胫骨和股骨干畸形愈合的截骨矫正</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    本文介绍了使用定制植入物结合3D打印钻孔导向技术在胫骨和股骨干畸形愈合的截骨矫正中的应用。股骨或胫骨干畸形愈合可能由于手术治疗继发性移位或骨折复位不理想造成，导致步态模式改变、肌肉疲劳、慢性疼痛等问题，严重影响患者生活质量。传统上，外科医生使用2D X射线图像进行手术规划，但结果难以预测。目前，3D技术越来越多地应用于矫正性截骨手术中，通过CT数据生成三维可视化，并创建3D虚拟手术计划。此外，特定患者植入物（PSI）根据患者的解剖结构量身定制，确保合适的贴合来指导骨重组并提供最佳固定。本研究评估了使用PSI进行下肢长骨复杂矫正截骨术的可行性，并通过量化术后计算机断层扫描的手术准确性，将其结果与3D虚拟可视化和3D打印手术指南进行比较。研究表明，这种新技术能够提高手术准确性和可预测性，改善临床结果。（摘要由动脉网AI生成）\n    </font>\n</p>\n</blockquote>\n<blockquote class=\"delete-flag bulletin-card\" style=\"background-image: none; background-color: initial;\">\n<p><b><a href=\"https://data.iyiou.com/intelligence/details/17bb491b126f234ade429c1a2ed16c49\" rel=\"noopener noreferrer\" target=\"_blank\"><span class=\"edit-link\" style=\"color: #2888D1; font-size: 18px;\">美总统特朗普称希望乌克兰用稀土矿换取援助</span></a>\n</b></p>\n<p>\n<font color=\"#333333\" style=\"line-height: 28px; font-size: 16px; letter-spacing: 1px;\">\n    当地时间2月3日，美国总统特朗普表示，他希望确保获得乌克兰稀土矿的供应，以换取美国继续向该国提供援助。特朗普称，美国正寻求与乌克兰达成协议，乌克兰将用稀土矿产和其他资源来确保美国继续向乌克兰提供援助。\n    </font>\n</p>\n</blockquote>\n<p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202502051089515",
            "pub_date": "2025-02-05 10:00:45",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "“亚培烯”茂金属聚α-烯烃生产技术获得突破，获投近亿元丨亿欧首发",
            "description": "<article class=\"post-body\" data-v-b51fa692=\"\"><p>亿欧独家获悉，亚培烯科技（杭州）有限公司去年完成近亿元融资，<strong>投资方为盛世投资，毅仁资本担任本轮融资独家财务顾问</strong>，资金主要用于亚培烯后续的扩产建设。</p><p>亚培烯是一家全球领先的高端聚烯烃流体产品生产商，主要从事茂金属和后过渡金属催化剂研究开发、茂金属和后过渡金属催化聚烯烃工艺和产品产业化。</p><p><span style=\"color:hsl(0,0%,0%);\">茂金属聚α-烯烃（mPAO）是通过茂金属催化剂催化α-烯烃得到的高端合成润滑油基础油，是<strong>风电、轨道交通、机器人、航空航天等高苛刻领域的关键基础材料</strong>，同时在<strong>高性能发动机润滑油、自动变速箱油、齿轮油、工业润滑油</strong>等应用场景中优势明显。随着人工智能的飞速发展，低黏度聚α-烯烃将日益在<strong>服务器的单相浸没式冷却场景</strong>获得应用。</span></p><p>以新能源混动车为例，用高性能发动机润滑油，能满足高负荷、高温、低温等苛刻条件下的润滑需求，延长发动机寿命；用于自动变速箱油、齿轮油等，可有效提升传动系统的效率和耐用性；用于电机、减速器等，可显著提高冷却效率和有效润滑保护。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/QCJkd9gK3KFuSrI0rAtu.jpeg\"/></figure><p><span style=\"color:hsl(0,0%,0%);\">相比于传统聚α-烯烃(PAO)，采用茂金属催化路线可以起到结构调控作用，得到的茂金属聚α-烯烃（mPAO）优势明显，可实现传统催化路线无法比拟的产品特性。</span></p><p><strong>在性能方面</strong>，具备黏度指数高、低温流动性好、热稳定性与氧化稳定性强、剪切稳定性高、牵引系数低等优势，有助于保持润滑油稳定的黏性，提升润滑油的冷启动和低温流动性能，提高耐久性，延长使用寿命。</p><p><strong>在环保与安全性方面</strong>，具有更长的换油周期，节约能源、减少排放；同时，具有纯净度高、气味低，更适合在高端化妆品中使用。</p><p><strong>在相容性方面</strong>，茂金属聚α-烯烃与多种润滑油添加剂具有优异的协同效应、与其他基础油皆具有良好的相容性，能灵活调配出不同性能的润滑油。</p><p>“随着低空经济、航空航天、高端汽车、风电、机器人等高速发展，对高端润滑油需求增加，茂金属聚α-烯烃能有效满足市场需求，”<strong>亚培烯CEO魏东初博士</strong>介绍，“目前，聚α-烯烃全球用量大约80万吨，作为全球最大的高端制造大国，中国是全球最具潜力的使用大国，市场需求和发展潜力巨大。”</p><p>当然，尽管前景广阔，但就当前来看，茂金属聚α-烯烃市场还面临诸多挑战。魏博士介绍，主要集中在四个方面：</p><p><strong>一是技术门槛较高</strong>，需要先进的茂金属催化剂技术和复杂的聚合工艺，因此也限制了新进入者的数量。</p><p><strong>二是成本较高</strong>，生产工艺复杂且对原材料要求严格，在一定程度上限制了在中低端市场的广泛应用。</p><p><strong>三是市场格局高度集中</strong>，全球茂金属聚α-烯烃市场主要由Chevron Phillips<span style=\"background-color:white;color:#060607;\">（雪佛龙菲利普斯化工公司）</span>、INEOS<span style=\"background-color:white;color:#060607;\">（英力士）</span>、ExxonMobil Chemical（埃克森美孚化工）等少数巨头主导。</p><p>值得一提的是，当前，mPAO技术国产化面临的处境是机遇与挑战并存。<strong>挑战是</strong>茂金属聚α-烯烃长期被“卡脖子”，产业化较难，高度依赖进口，受到海外巨头的制约。</p><p><strong>而机遇是</strong>，我国炼油产能高达9.24亿吨/年，产能和炼油技术位居世界第一，产能严重过剩，“油转化”和“油转特”是大势所趋。采用自主知识产权的乙烯齐聚生产线性α-烯烃以及线性α-烯烃的烯烃制备茂金属mPAO，可有效延伸炼油产业链，增加石油产品的种类和附加值，从根本上解决关键基础原料“卡脖子”的技术壁垒。</p><p>魏博士向亿欧介绍，亚培烯持续投入研发，通过多年技术攻关，<span style=\"color:hsl(210,75%,60%);\"><strong>打破国外技术垄断</strong></span>，开发出高性能的茂金属催化剂，并通过整合上下游产业链，优化原材料供应和生产工艺，大幅降低了生产成本。</p><p>“目前，亚培烯已成为<span style=\"color:hsl(210,75%,60%);\"><strong>全球第一家，且是唯一一家能实现1cst-100000cst内任意粘度等级聚α-烯烃产品精准定制的企业</strong></span>。”魏东初博士表示，“与海外玩家相比，亚培烯在技术专利与知识产权、技术创新、国产化替代、客户资源、产业链布局和规模化生产等方面，形成了较强的竞争力。”</p><p>据亿欧了解，2022年初，亚培烯曾完成龙盛集团、安丰创投、华峰集团投资的1.5亿元人民币A轮融资，主要在浙江化工园区投建了茂金属聚α-烯烃万吨示范工厂，配备<strong>国内最大</strong>的mPAO生产装置，该工厂采用亚培烯自主开发的生产工艺与专用设备，<span style=\"color:hsl(210,75%,60%);\"><strong>率先在国内实现茂金属聚α-烯烃连续稳定产业化</strong></span>。</p><p>就其自主生产工艺来看，亚培烯拥有核心技术优势，主要包括可根据客户需求，优化线性α-烯烃（LAO）碳数分布，生产市场需要的高线性α-烯烃；茂金属催化剂的开发及生产、溶液法工艺开发、聚烯烃产品技术开发及产业化，以及使用茂金属催化的溶液聚合技术平台等。</p><p>2023年，经中国石化联合会鉴定，亚培烯自主开发的乙烯齐聚生产α-烯烃的生产工艺达到国际先进水平。此外，特有的超低黏度mPAO产品生产技术稳居全球领先地位。</p><p>魏博士透露，亚培烯已经规划了扩建高端聚烯烃流体项目，此次融资金额也将主要用于后续的扩产建设，为更大规模的产能扩张和技术升级奠定基础。</p><p>对于此次融资，<strong>魏博士表示</strong>：能在这两年充满挑战的融资市场中成功完成Pre-B轮融资，不仅是对亚培烯技术实力的认可，更是对公司市场前景的坚定看好。亚培烯将以国家需求为导向，以科技创新为己任，致力于突破技术壁垒，持续推动茂金属聚α-烯烃（mPAO）产业化发展。</p></article>",
            "link": "https://www.iyiou.com/analysis/202502051088887",
            "pub_date": "2025-02-05 10:00:47",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "蛇年投资指南",
            "description": "<article class=\"post-body\" data-v-b51fa692=\"\"><p>蛇年来了。一年一度的妙投大预言时间也来了。</p><p>新的一年，就让妙投带着大家一起在A股里翻翻石头，来寻找多一些的确定性吧。</p><p>其实，任何行情下，股市都有赚钱的机会。一个冷知识是，更多人在牛市中亏钱，且亏的更多。毕竟乐观及跟风，会让很多人忽略了平静水面下的暗礁。但熊市，却让人更加审慎的去挖掘确定性。</p><p>今年的妙投大预言，由妙投最懂交易的张博老师和最懂宏观的丁萍老师联袂领衔来拉主框架。我们认为科技创新方向在新的一年，会反复有行情出现。宏观方面，黄金会震荡上行，债市性价比将下降。</p><p>当然，魔鬼在细节中，这篇大预言长达一万多字，值得加个收藏，反复琢磨。如果你想持续在不确定的金融市场，找到投资的确定性，请对妙投加个关注。</p><h3>一、科技创新方向</h3><p>在科技创新方向上，妙投投研团队重点关注：人形机器人、AI+硬件、AI相关产业链如芯片、服务器、液冷等。</p><p>1、  人形机器人，量产在即</p><p>2025年，将是人形机器人量产的元年。</p><p>2025年1月9日，马斯克在CES2025展会上接受视频连线采访并表示，2025年特斯拉计划生产几千台人形机器人。如果进展顺利，2026年特斯拉人形机器人产量将增加10倍，即明年生产5万到10万台人形机器人，然后在2027年再增加10倍，人形机器人有望在2027年迎来几十万至百万级别的大规模量产。此前，特斯拉未曾公布过2026年至2027年人形机器人量产目标。</p><p>特斯拉0ptimus的进步出现跳跃式成长，2024年12月发布的视频显示其在环境感知和自主决策方面的能力得到了显著提升。</p><p>其他海外标杆企业推进产品迭代、开展多场景实训，商业化落地临近。波士顿动力、FigureAI等本体厂商积极推进产品迭代，开展AI融合。同时2024年以来人形机器人陆续在工厂生产端参与简单任务执行，产品可用性进一步升级。2025年人形机器人实训将更加高频和丰富，可执行任务的数量和质量提升，产品快速迭代，更加靠近商业化的可用性和经济性。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/TYQGDhn7grs8uK0Qa8hB\"/></p><p>2024年国内机器人企业依然在持续增加，已有部分厂商实现量产及销售。宇树科技是国内领先的机器人厂商,2024年5月推出UnitreeG1，售价9.9万元起，产品具有超越常人的灵活性，成为市场高度关注的产品。</p><p>优必选的机器人在企业中的应用获得阶段性成果，优必选的WakerS1在第二阶段实训中不仅在智能搬运工作中实现了全新升级，搬运速度提升约25%，还完成了质量检查等新任务。</p><p>智元机器人开启通用机器人商用量产，截至2025年1月6日，机器人累计产量已有1000台，主要应用于交互服务和柔性制造领域。国内规模制造优势下本体产品经济性更优，有望率先实现细分场景商业化闭环。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/jJ6Qc8lo97xRiGDhg11I\"/></p><p>从落地场景来看，人形机器人有望在工业制造、特种作业等场景上率先落地。特斯拉、优必选等人形机器人，卡位汽车制造等赛道，有望率先放量。</p><p>此外，在硬件领域，双足技术已相对成熟，而灵巧手等关节技术将成为下一阶段研发与迭代的核心关注点。</p><p>兆威机电、鸣志电器、雷赛智能等企业正积极进入灵巧手这一领域。一旦这些企业能够加入特斯拉的供应链，其业绩有望实现显著增长。同时，资本市场往往对新技术的突破，会给予更高的估值。这样一来，灵巧手企业将在资本市场上迎来“戴维斯双击”。</p><p>2、AI+硬件，2025会有哪些可预期的机会？</p><p><strong>AI眼镜，消费电子的最大黑马</strong></p><p>百镜大战”愈演愈烈，逐步迈向AR终局MetaRay-Ban2024年销量有望超150万副。第一代智能眼镜Ray-BanStories在2021年9月发布后，直至2023年2月也才售出了30万副，但2023年9月发布的第二代产品MetaRay-Ban，截止到2024年5月，销量突破100万副；预计2024年全年出货量有望超过150万副。而对比行业方面，IDC数据显示2023年全球AR眼镜销量为48万台，智能眼镜销量为101万台，预计2024年行业销量增长的大部分仍由Meta贡献。</p><p>目前AI智能眼镜的发展有如下几个阶段，分别为音频智能眼镜，拍照眼镜，AI智能眼镜和AR眼镜。AI眼镜相比VR/AR等更易让消费者接受，AR/VR眼镜过重的重量、高昂的售价和缺乏“杀手级应用”成为阻碍消费者购买因素。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/yU3aBHOi9E3cQj11HTHd\"/></p><p>Al 大模型正在赋能智能眼镜，AI 大模型使人机交互变得更加简单。AI眼镜可以输入多种模态信息(如语音、视觉和触觉)，多模态大模型通过整合和理解多种输入的信息和数据综合分析，并以更直观的方式输出，使交互方式更加简洁。随着多模态 AI大模型的演进和深度运用，将对可穿智能设备产生深远影响。</p><p>AI 眼镜未来有望打开至少 5000 亿元市场空间，根据wellsenn XR的统计与测算，2024年全球近视眼镜与太阳镜销售量将分别达到7.1、8.3亿副，合计超过 15亿副，并在未来呈现稳健增长趋势。</p><p>与此同时，AI眼镜将给光学、显示、芯片、传感器等带来新的需求。</p><p>光波导技术的创新为AI眼镜提供了更轻薄、更清晰的视觉体验，推动了光学行业的快速发展。而AI眼镜的显示技术也在不断进步，Micro LED等先进技术被广泛应用于AI眼镜中，提升了显示效果和用户体验。</p><p>另外，AI眼镜的快速发展离不开强大的计算和处理能力，SoC（系统级芯片）芯片为AI眼镜提供了核心的计算支持。AI眼镜集成了多种传感器技术，如摄像头、麦克风等，这些传感器的性能直接影响用户的交互体验。</p><p>光波导技术、Micro LED、SOC芯片、传感器等相关厂商，有望跟随AI眼镜放量出现爆发式增长。</p><p><strong>AI耳机：字节进场是个利好</strong></p><p>字节跳动已成功收购开放式耳机品牌Oladance，完成100%控股，标志着字节跳动在AI硬件领域的进一步加码及拓展。该产品可以接入豆包云端大模型，并和手机豆包 APP 无缝衔接。用户无需打开手机即可通过语音与豆包进行互动。0la Friend 在信息查询、旅游出行、英语学习和情感交流等场景中表现出色，能够像朋友一样与用户交流。耳机采用了字节豆包的 Seed-ASR 语音识别技术，能够高精度识别中英文及不同口音。</p><p>Oladance成立于2019年，由前BOSE高管李浩乾与多名BOSE工程师共同创立，公司为首家推出OWS开放式耳机概念及相关专利技术而闻名，并在2021年推出了全开放式OWS系列耳机，此次交易流额为3至5亿元人民币之间。</p><p>通过这次收购，字节跳动不仅获得了Oladance的核心技术，同时也吸纳了一支由前Bose工程师组成的经验丰富的团队，补足了自身在音频技术方面的不足并推动Oladance从可穿戴设备出发向生成式AI服务平台的转型，进一步丰富字节自身的AI生态系统，通过此次收购，字节有望在前景潜力十足的开放式耳机市场中占据有利地位。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/H4im3OhucYikqH35a78W\"/></p><p>3、  AI产业链，各环节走向何处？</p><p>AI相关的投资节奏，可参考西南证券的这张图，总体趋势就是从AI基础设置到AI智能体的渐进。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/BLWBfR6633Iafcyzv55j\"/></p><p><strong>AI服务器需求持续旺盛</strong></p><p>AI服务器需求旺盛，北美四大CSP（谷歌、meta、亚马逊、微软）资本开支上行，持续加码AI服务器及相关投资。24Q3四大CSP“资本开支“（现流流量表口径）总和为575亿美元，同比增长61%，环比增长11%。</p><p>谷歌24Q3资本支出约130亿美元，其中最大的组成部分是对服务器的投资，其次是数据中心和网络设备，预计Q4资本支出将与Q3持平。</p><p>meta24Q3资本支出（包括融资租赁的本流支付）为92亿美元，主要系对服务器、数据中心和网络基础设施的投资，预计2024年全年的资本支出将在380-400亿美元之间，下限较之前的370-400亿美元有所增长，预计2025年的资本支出将大幅增长。</p><p>亚马逊24Q3资本支出为213亿元，预计2024年的资本支出约为750亿美元，大部分支出用于支持对技术基础设施日益增长的需求。</p><p>微软FY25Q1包括融资租赁在内的资本支出为200亿美元，PP&amp;E支付的现流为149亿美元，大约一半的云和AI相关支出继续用于长期资产，其余的云和AI支出主要用于服务器（CPU和GPU）。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/s8K9R5deAgXouNv2HtiJ\"/></p><p>从AI服务器出货量来看，2023年高阶AI服务器出货19.96万台，一般AI服务器出货46.98万台。2024年高阶AI服务器预期出货54.3万台，较2023年成长172%;2024年一般AI服务器预期出货72.5万台，较2023年成长54.2%。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/ICskuLXgFvyYbgBu3Hes\"/></p><p>英伟达于2024年3月GTC大会上发布了GB200服务器，GB200的训练性能提升至4倍，推理能力提升至30倍。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/IbkSPsiuNt7TbEMYVOB9\"/></p><p>NVIDIA推出世界首个高速GPU互连技术NVLink™，提供的速度远超基于PCIe的解决方案，是多GPU系统扩展内存和性能的理想选择。它为处理最大视觉计算工作负载、释放百亿亿次计算能力和万亿参数人工智能模型的全部潜力提供了关键基础。</p><p>GB200NVL72的机架级设计，通过在单个NVIDIANVLink域上连接72个BlackwellGPU，标志着AI超级计算的一次重大进步。这种独特的配置显著减少了传统网络扩展时的通信开销，使得对1.8T参数的模型进行实时推理成为可能，同时将模型训练速度提升了4倍。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/N0cr0qNxoEJxXztzsmVb\"/></p><p>24年12月份，有报道称英伟达GB300服务器正在如火如茶地设计中，预计25年Q2发布、Q3试产。据悉GB300的散热需求更强,主板风扇使用数量更少，这也意味着其液冷散热需求将会更强。</p><p>在芯片侧方面，GB300超级芯片将基于更新的B300GPU，拥有更强的FP4性能。该GPU功耗将从B200的1000W进一步提升至1400W，达到初代B100的两倍;同时HBM内存规格也将升级共计288GB的8堆栈12HiHBM3E。</p><p><strong>芯片将围绕AI爆发</strong></p><p>全球AI产业进入高速发展阶段,超高性能GPU集群、专用AI芯片及数据中心等基础设施的不断提升进一步推动了AI应用场景的创新。</p><p>目前AI服务器通常选用CPU和加速芯片组来满足其庞大算力需求，其中加速芯片包括GPU、FPGA、ASIC等逻辑芯片，GPU由于其具有最强的计算能力同时具备深度学习等能力,目前成为服务器中加速芯片首选。</p><p>与GPU的通用性相比，ASIC在特定任务上展现出更高的效率。ASIC作为专用定制芯片，基于芯片所面向的专项任务，计算能力和计算效率都严格匹配于任务算法，芯片的核心数量，逻辑计算单元和控制单元比例，以及缓存等整个芯片架构也是精确定制的，因此ASIC可以实现极致的体积、功耗。</p><p>TPU（Tensor Processing Units，张量处理单元）是谷歌专为AI定制设计的ASIC，其针对大模型的训练和推理进行了优化。TPU 适合各种使用场景，例如聊天机器人、代码生成、媒体内容生成、合成语音、视觉服务、推荐引擎、个性化模型等。</p><p>博通与客户在架构阶段就展开了深度的战略合作。在XPU设计启动的前几年，完成了关键组件的早期IP投资；并且为后两代XPU同时进行技术、IP和封装投资。</p><p>博通充分利用已经布局完成的XPU平台工程，实现了业界最快的ASIC产品落地时间。XPU平台涵盖了经过10年XPU经验优化的AI设计流程、AI IP、SoC封装等一体化解决方案。博通2024年AI SAM（Serviceable Addressable Market） 约150亿至200亿美元，27年SAM为600亿至900亿美元，SAM将实现4-5倍增长。</p><p>2025年国内芯片行业的增长逻辑在于，国产替代、AI算力及AI端侧爆发驱动市场需求的增长。</p><p>由于进口算力芯片属于阉割版，GPU、ASIC等国内芯片厂商将追赶英伟达等厂商。</p><p>另外，AI算力需求旺盛，AI眼镜、AI PC等AI端侧设备应用即将放量，将给SOC、存储带来新的增长需求。</p><p>以AI眼镜为例，其SoC芯片的价值量在BOM（物料清单）中占比极高，达到60%以上。根据Wellsenn XR的拆机报告，雷朋Meta眼镜的主板电子物料中，高通主控AR1+套片（含WiFi及电源管理芯片）总价占比高达62%。</p><p>随着AI眼镜功能的丰富和续航时间的优化，SoC芯片的升级趋势明确，未来在BOM中的价值量占比有望继续提升。这表明在AI眼镜领域，SoC芯片的需求将在2025年迎来显著增长。</p><p><strong>液冷产业化进程加速</strong></p><p>液冷技术成为支持大规模和生成式AI发展的关键。</p><p>为了满足AI模型的训练和部署需求，数据中心需要大量高性能、高稳定性的算力资源，并需具备智能化的数据管理流程和高效普惠的AI开发平台，以实现基础设施对大模型和生成式AI的全方位支持。</p><p>与传统的风冷系统相比，液冷通过冷却液直接传导和转移热量，实现了更出色的散热效果，能够有效支持高密度、高功率设备的稳定运行，并满足日益增长的计算需求和设备的散热要求。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/lhbHa0lomTYkf0SeETda\"/></p><p>液冷技术主要分为直接液冷（DirectLiquidCooling,DLC）和浸没式液冷（ImmersionCooling）两大类型。直接液冷将冷却液直接引导至设备的热源上，通过冷却板或冷却管道将热量带走；浸没式液冷则将整个设备完全浸泡在绝缘冷却液中，实现更大范围的热传导效果，适用于超高密度和高功率设备的散热。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/5Ws6zLRJJXbFp5B4bSqD\"/></p><p>三大电信运营商推进液冷技术标准化试点。自2012年起，中国移动开始在南方基地试点气液双通道冷板液冷技术，并取得年均PUE保持在1.2以下的成果。</p><p>此后，公司逐步在呼和浩特、河北和山东等地应用冷板式和浸没式液冷技术，进行安全性、节能性等方面的测试。2023年，中国移动在呼和浩特的数据中心启动了液冷的大规模试点，旨在通过大规模应用和技术验证，推动液冷技术的产业化进程，降低数据中心PUE，并进一步建立完善的产业生态。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/HS6vYrbJD783Vfbmvu5U\"/></p><p><strong>铜缆+光模块，哪种技术更优？</strong></p><p>光&amp;铜连接实现数据中心信息互联光与铜助力数据中心信息互联。</p><p>随着云计算、大数据、超高清视频、人工智能、5G行业应用等快速发展，网络访问频率和接入手段不断增加，网络数据流量迅猛增长，对数据中心互连提出更高挑战。数据中心内部互联以基于直调直检方案的光模块（典型场景为TOR到Leaf以及Leaf到Spine）和AOC/铜缆（典型场景为服务器到TOR）为主，在数据中心之间的互联场景中，主要采用光模块进行连接。</p><p>光模块构成了数据中心互连、5G承载网络和全光接入网络的基础单元，主要作用就是实现光纤通信中的光电转换和电光转换功能。</p><p>光模块行业的上游主要包括光芯片、电芯片、光组件企业。光芯片是光模块中完成光电信号转换的直接芯片，占据成本大头（占光模块成本的30%-60%），且高端光芯被海外所垄断，国产产量小，暂不能满足市场需求；而电芯是光模块性能表现的关键器件，能的成本（占光模块成本的18%）占比仅次于光芯，且技术壁垒高，国内自给率仅达5%。</p><p>短距离场景下可通过高速铜缆（DAC/ACC/AEC）和有源光缆（AOC）进行互连。AEC是一种高性能铜缆解决方案，两端均集成了Retimer，随着速率的提升，DAC有效距离被大幅缩短，AEC需求大幅提升。</p><p>AEC优势明显，400G AEC单端功耗约5瓦，相比400G光模块，功耗降幅约50%，较笨重的无源DAC更为轻巧、纤细，可弯曲和卷盘，提升了机架管理和使用效率，寿命长且可靠性极高，可达无源DAC的100倍。有源设计使其无易碎部件，坚固耐用。</p><p><strong>电力产业链中，都谁受益？</strong></p><p>算力领域中电源功率密度随单芯片功耗大幅提升而提升，算力领域中电源、散热都将受益海内外的产业趋势。</p><p>铜连接、液冷、电源变化最大，其中电源功率密度大幅提升，英伟达的H100芯片的TDP最高为700W，B200的TDP最高为1200W，单芯片功耗大幅提升。其次H100每个机架的TDP约为40kW(4组H100的八卡服务器)，而B系列机架的TDP约为120kW，在使用机柜方案后，供电功率大幅增加。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/pVs0TcmJy0qR4AXZx1si\"/></p><p>国产电源、变压器、开关柜下游新增长点出现。配电系统在算力建设中成本较高，包括电源、变压器(配电)、开关柜、UPS、柴油发电机、其他重要的技术趋势还包括BBU和超级电容。在25年电力设备公司在下游数据中心，特别是国内市场大幅度增长的驱动下，获得估值和业绩的提升。</p><p>智算需求对IDC机房提出更高要求，存量机房可能无法满足，将拉动新建机房需求。电力设备、温控设备是IDC机房建设中价值量占比较高的两个环节。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/nAgbFja0L3YNYxR1nVgL\"/></p><p>AI电力能源重点环节：</p><p>1）AI数据中心建设驱动配套电力设备、散热系统的需求上行。①建议关注受益于下游数据中心需求增长的发电设备、电气部件公司，如伊顿、GEVernova；②建议关注热管理企业与大规模数据中心在液冷产品方面的合作进展，如维谛、nVent、摩丁制造。</p><p>2）发电/售电运营商：海外大型数据中心需通过购买清洁能源、核电等保障能源供应，并实现全天候电力大容量，建议关注竞争发电厂和电力运营商CEG、VST、PEG、TLN等。此外，受小型模块化反应堆事件催化，建议关注相关概念股。电力能源板块还受益于美国制造业回流、新能源替换等方向。</p><p>3、低空经济，或加速落地</p><p>低空经济作为新质生产力典型代表之一，顶层设计是重要驱动，机制清晰保障实施推进。2024年是低空经济的规划年，2025年或将进入加速落地年，国家发改委低空经济发展司成立，国家开始统筹规划，国内布局将加快实施落地。</p><p>2025-2027低空经济两大应用场景：文旅新消费、载人(客)运输。</p><p><strong>低空经济+文旅，新消费、大市场</strong></p><p>2024年中央经济工作会议提出2025年要抓好的重点工作中，第一项为大力提振消费提高投资效益，全方位扩大国内需求，包括“创新多元化消费场景，扩大服务消费，促进文化旅游业发展。”第二项以科技创新引领新质生产力发展，建设现代化产业体系中提出“开展新技术新产品新场景大规模应用示范行动。”</p><p>低空经济与文旅市场的结合正可以通过创新消费场景来实现新技术新产品的应用，包括但不限于:依托景区资源开展航空表演、空中游览、旅游专线、景点接驳等低空消费项目，亦可以依托航空小镇、飞行基地提供航空研学服务等。</p><p>eVTOL(电动垂直起降飞行器)是低空经济中的新产品，亦是市场尤为关注的新型低空飞行器。预计在2027年前,文旅市场是其可率先落地商业化的重要场景。其中包括:景区内低空观光游览、景区之间串联、景区与地面交通接驳等，eVTOL的应用初期或在景区内低空观光游览为主。</p><p>根据亿航智能三季度报告披露订单及交付数据:</p><p>2023年10月以来，国内市场主要客户已经累计交付130架，未来意向订单1050架合计达到1180架。主要客户以地方政府(或下属企业)及文旅相关企业为主。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/LfXqPpUT9Kini5wCErWj\"/></p><p><strong>低空经济+载人(客)运输</strong></p><p>根据我国《民航十四五规划》，构建运输航空和通用航空一体两翼、覆盖广泛、多元高效的航空服务体系。通用航空有着成熟发展经验，其“小机型、小航线、小航程”特点，适合开展短途客运服务。</p><p>对于通用航空，要打通航空运输微循环，形成以支线机场为支撑、以通用机场为节点的区域短途运输网络，打造“干-支-通”的航空网络。</p><p>我国19-23年平均每年新增49座机场，2020年更是新增达到93座机场，2023年为新增50座，因此我们认为采取49座年均增长较为合理,即2027年较23年新增196座机场我国通航机场总数量将达到645座，23-27年复合增速9.5%。</p><p>目前多个城市已经对低空经济进行了规划，以重庆为例，计划到2025年，实现低空飞行“县县通”，2024年9月下旬,《重庆市推动低空空域管理改革促进低空经济高质量发展行动方案(2024-2027年)》印发，包括8方面、25项具体任务，明确提出重庆将打造消费业态丰富、产业链条完整、创新生态活跃、通航文化精彩的“低空经济创新发展之城”。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/ZJRNjUi3sSOsM0ykeCVT\"/></p><p>妙投预计2025年，低空经济产业链上会有四个主要环节受益，分别是：主机厂（包括eVTOL、通用飞机、无人直升机）、雷达、航空发动机市场、相关供应链（包括生产制造和服务）。</p><p>4、自动驾驶，主看英伟达</p><p>英伟达，自动驾驶汽车平台NVIDIADRIVEAGX™Hyperion已通过两家业内权威的汽车功能安全和网络安全认证评估机构的行业安全评估，是业内首个也是唯一一个端到端的自动驾驶平台。</p><p>它集成了DRIVEAGX™系统级芯片、参考板设计、NVIDIADriveOS汽车操作系统、传感器套件以及主动安全和L2+驾驶堆栈，为汽车制造商提供了一套完整的自动驾驶解决方案。</p><p>梅赛德斯-奔驰、捷豹路虎、沃尔沃汽车等汽车安全领域的先锋已经开始部署DRIVEHyperion™平台，以提升其自动驾驶车辆的性能和安全性。</p><p style=\"text-align:center;\"><img src=\"https://diting-hetu.iyiou.com/async/weixin/BF94ZOl69FcmMk23OLn9\"/></p><p>5、自主可控：信创有望迎来落地拐点</p><p>信创与其他成长板块不同，一般来说2020年被视为信创元年，这几年里经过党政信创的落地，以及二级市场的充分挖掘，已经过了从0到1的阶段。因此信创板块的投资机会，主要看信创能否持续推进，以及相关上市公司业绩能否兑现。这五年以来的局面表明，无论谁当选美国总统，中美的科技竞争都在不同程度上展开，因此信创的的推进是必然的。</p><p>2023-2024年，信创受制于地方财力，推进速度低于预期。不过目前来看，拐点正在来临。</p><p>伴随着超长期国债以及专项债的发行，地方财政压力将得到缓解。2025年预计财政政策会比2024年更加积极，会有更大规模政府债券发行，帮助地方财力实现恢复。这对于党政信创的落地形成较大支撑。实际上从去年9月开始，党政信创的招标明显加快了，招标信息远多于此前的大半年。因此信创板块也经历了较多涨幅。</p><p>伴随着地方财力的增强，此前市场预期的党政信创下沉预计会更大力度得到兑现，即向县市、乡镇级别继续推进自主可控，成为信创的重要增量来源。</p><p>此外行业信创也有望继续落地。2022年9月底国资委79号文要求2027年底前，全部央国企完成信息化系统的信创改造工作。目前来看金融和电信运营商落地相对较快，其他行业有待于加快部署。因此随着2027年的逐渐临近，行业信创有望加快推进速度。</p><p>因此综合来看，2025年信创有望真正迎来拐点，进入更快的落地阶段，从而给相关上市公司带来业绩增量。</p><p>6、创新药，空间依然大</p><p>在政策支持，以及在恒瑞医药、百济神州等龙头药企的带动下，创新药是2024年医药板块表现较好的一个赛道。产业层面创新药获批加快，对外授权出海金额创新高，也驱动创新药企业绩整体向好发展。</p><p>展望2025年，创新药的发展空间预计还是很大。</p><p>一方面，政策对于创新药的支持仍然在，且医保局在探索商报等渠道拓宽创新药支付渠道、探索建立丙类药品目录等。同时，持续动态调整国家医保药品目录，及时纳入符合条件的创新药品，稳定企业预期；推动定点医疗机构和零售药店做好药品配备，鼓励创新药临床应用。</p><p>另一方面，国内药企出海会继续。主要原因有两个：一是，中国政府在“十四五”规划中强调了创新驱动和国际化的重要性，为创新药企提供了有利的政策环境；二是，国内医保控费的大环境，使得创新药企业面临较大的价格压力，也将驱动药企拓展潜在的海外市场。</p><p>此外，国内药企的造血能力在增强。如百济神州CEO欧雷强在1月份第43届摩根大通大会上透露，预计2025年将实现全年经营利润转正；信达生物董事长俞德超表示，2025年将有多款新药上市驱动业绩增长。除此之外，国内以“仿制药+创新药”业务模式的部分药企，创新药收入已经开始超过仿制药了，如恒瑞医药等，可看到国内创新药企的发展在向良性阶段变化，且将驱动国内药企2025年的业绩增长改善。</p><p>总之，展望2025年，创新药在政策支持和国内药企的自我造血能力在整体变好的情况下，预计仍将会有较大的发展空间。且在有更多利好政策落地，或者药企有管线推进获得积极进展、出海有突破等利好消息下，资本市场预计会更加活跃。</p><p>7、光伏拐点正在酝酿</p><p>当下，光伏行业仍处于产能过剩，各企业普遍亏损。存量产能的出清，是光伏走出底部周期的关键。</p><p>工信部发文定义了PERC、TOPCon的落后产能，建立了“白名单”，并抄送给能源、市场监督等部门。在央企主导的国内集中式光伏市场，落后产能将没有生存空间，逐步出清。</p><p>此外，光伏行业协会组织限价、限产等自律行为。这些措施也将缓解产能过剩的情形。产业链价格有望企稳，光伏企业有望减亏。</p><p>从需求来看，展望2025年，全球光伏需求预计将达492-568 GW，相较2024年的的增长幅度为5-7%。光伏行业的需求进入低增速时代。</p><p>在需求增长，供给侧改革的背景下，光伏行业的拐点也将逐步清晰，有望在2025年年末出现。</p><p>值得注意的是，光伏技术迭代仍在不断升级，工信部对BC电池、HJT电池扩产标准并不高。BC、HJT电池技术有望在2025年实现放量。</p><h3>二、大宗商品方向</h3><p>1、黄金在质疑中不断创新高</p><p>2024年，COMEX黄金从年初的2067.6美元/盎司一路攀升至年末的2638.8美元/盎司，累计上涨了28%。</p><p>展望2025年，黄金继续上涨的确定性依然较强，主要受以下三大因素影响：</p><p>首先，美联储的宽松货币政策：市场普遍预期，美联储将在2025年降息，至少降息50个基点。高盛预测，如果降息幅度达到125个基点，金价可能上涨7%；而降息幅度为25个基点时，金价的涨幅可能会受限。预计2025年底黄金价格有望升至2890美元/盎司。</p><p>其次，美元贬值的潜力：特朗普可能采取政策推动美元贬值，以刺激美国制造业和出口，这将利好黄金价格。</p><p>最后，高赤字率及“去美元化”趋势：美国财政赤字暴增，2024年11月达6242亿美元，同比增长64%。高赤字率和关税政策加剧了全球对美国债务可持续性的担忧，推动各国央行增加黄金储备。东吴证券预计未来几年，央行的黄金购买量将维持在800-1200吨/年，中国央行黄金储备的潜力较大，特别是在人民币贬值时，可能进一步加大黄金储备，以增强外汇储备的抗压能力。</p><p>从节奏上看，黄金价格在2025年下半年可能表现更好。上半年，特朗普政府推进高关税及移民政策可能加剧通胀，抑制美联储降息预期，导致黄金上涨幅度较为保守。</p><p>总而言之，尽管2025年黄金价格大体呈上涨趋势，但相比2024年的“畅行无阻”，2025年的涨幅可能较为温和，甚至出现震荡整理阶段，因为过去的利好因素在后期可能转为短期压力。因此，黄金更适合低吸而非追涨。</p><h3>三、降息受益</h3><p>债市性价比下降，适合做波段</p><p>展望2025年，在宽松预期的背景下，债市依然有机会可寻，但表现不会像2024年那般顺风顺水。除了可能会受股债“跷跷板”的影响，还存在两大问题：</p><p>一是市场早已“抢跑”。市场普遍预计，央行降息的空间在40-50个基点，而在2024年12月，10年期国债收益率已从2%降至1.66%（截至2024年12月31日17:00），下行了34个基点，几乎消耗了降息的预期空间。因此，即使央行按照市场预期降息，债市也不会有太大的上涨空间；</p><p>二是债券利率与资金成本出现倒挂，会让“借短买长”的策略失效。通常情况下，机构通过借入低成本的短期资金，再将其投向长期债券，以赚取利差。但随着债券收益率的急剧下降，许多债券的收益率已经低于融资成本（例如，保险的实际融资成本通常在2%以上），使得这一策略变得越来越不划算。</p><p>整体来说，低利率时代似乎已经不可避免，长债收益率的中枢仍可能继续下行，但这种下行空间已经非常有限，毕竟10年期国债收益率不能无限降低，最低可能会触及1.5%左右。</p><p>当然这也不意味着债市全无机会，只能说更适合采取波段操作。未来，债市更可能进入震荡调整期，甚至出现更多的波动，主要是受政策调控的影响。</p><h3>四、确定趋势不好的产业</h3><p>2025年，猪价会更“惨”</p><p>我们预计2025年生猪供应将保持宽松，猪价延续低迷趋势。原因如下：</p><p>首先，农业部数据显示，我国能繁母猪在2024年4月停止去化，随后连续7个月环比回升，这意味着2025年2月生猪供应将呈现增势。其次，暖冬并未对生产效率造成显著影响，2024年10月和11月仔猪存栏量环比下降仅0.6%，远低于2023年同期5.4%的下降幅度。</p><p>而且，2025年猪价难以像2024年那样出现阶段性上涨。当前市场环境下，养殖户对未来猪价保持谨慎态度，缺乏积极压栏和二次育肥的动力。</p><p>当前行业平均养殖成本已从2023年底的15.7元/kg降至15.5元/kg，理论上，只有当猪价跌至行业的现金流成本（即低于13.5元/kg，行业非现金成本约为2元/kg）时，才会出现现金亏损，并可能促使养殖户主动去化。但截至2025年1月17日，生猪（外三元）价格为15.71元/kg，距离这一现金成本仍有一定空间。</p><p>因此，单纯依靠主动去化无法引发猪周期反转，真正的转机可能源自外部因素，如政策干预或猪病爆发等催化因素。<span style=\"color:hsl(0, 0%, 30%);\"><i>（撰写：妙投研究员张博、丁萍、刘国辉、段明珠、董必政、张贝贝、徐骞）*以上分析讨论仅供参考，不构成任何投资建议。</i></span></p></article>",
            "link": "https://www.iyiou.com/analysis/202502051089511",
            "pub_date": "2025-02-05 09:55:38",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "史上最强春节档：没有黑马，胜负已分？",
            "description": "<article class=\"post-body\" data-v-b51fa692=\"\"><p style=\"text-align:justify;\"><span style=\"color:hsl(0, 0%, 30%);\">作者 | 张语格</span></p><p style=\"text-align:justify;\"><span style=\"color:hsl(0, 0%, 30%);\">编辑 | 趣解商业文娱组</span></p><p style=\"text-align:justify;\">“哪吒2是什么起点爽文”“姬发邓婵玉感情线”……春节档电影正式开映不到半天，便已经攻占了各大热搜话题，各平台充满了网友对新片剧情的讨论。</p><p style=\"text-align:justify;\">随着上映多天，今年春节档的票房格局也逐渐清晰。根据猫眼专业版数据，截至1月31日17:30，主打合家欢的动画电影《哪吒之魔童闹海》（以下简称《哪吒2》）以超14亿元的票房位居榜首，悬疑喜剧电影《唐探1900》和中式神话电影《封神第二部：战火西岐》（以下简称《封神2》）紧随其后，票房分别为11.4亿元和7.1亿元。</p><p style=\"text-align:justify;\">相比之下，在预售阶段遥遥领先的《射雕英雄传：侠之大者》（以下简称《射雕》）显得有些后劲不足，目前票房不足5亿元，位列第四；军事动作片《蛟龙行动》目前垫底，不足2亿元的票房尚不及动画片《熊出没·重启未来》。</p><p style=\"text-align:justify;\">以往来看，越是大的档期，就越容易出现逆袭的黑马；然而，今年各方实力相对均衡的情况下，票房冠军花落谁家，未来是否会有变数？</p><h3 style=\"text-align:justify;\">2025春节档连破纪录，谁夺票房冠军？</h3><p style=\"text-align:justify;\">今年的春节档电影，从预售期间就备受关注。2025电影春节档自19日开启预售当天，便短时间内连续突破预售票房纪录；上映后，大年初一（1月29日）单日票房为18.05亿元，观影人次为3515.12万，创造了新的单日票房和观影人次纪录；其中，《哪吒之魔童闹海》、《唐探1900》、《封神第二部：战火西岐》分别以4.87亿元、4.65亿元、3.83亿元的票房位列票房TOP3。</p><p style=\"text-align:justify;\">今年的春节档影片能在预售阶段就拿下“开门红”，和丰厚的票补政策不无关系。以往春节档都是观众吐槽票价贵，北京、上海等一线城市看场电影八九十元成常态，北方部分县城影院的普通厅，白天时段票价也都在50元以上；今年则不同以往，不仅国家电影局投入了近6亿元的观影消费补贴，各省市和影片发行方也都向观众发放了真金白银的优惠。</p><p style=\"text-align:justify;\">“趣解商业”观察到，预售开启的前两天，北京朝阳区部分影院19.9元就可以看《蛟龙行动》，南京有不少影院《封神2》在大年初一的场次都为19.9元。</p><p style=\"text-align:justify;\">不过，各片丰厚票补的持续时间似乎有限。有不少网友在小红书上表示，现在已经买不到二三十元的票了；“趣解商业”注意到，北京朝阳区某些影院《哪吒2》白天场的票价已经冲到了三位数。</p><p style=\"text-align:justify;\">除了票补，今年春节档能频频破纪录，也和“顶流”主演的号召力有关。例如由徐克导演，肖战、庄达菲主演的《射雕》，预售票房高达3.53亿元，位列中国影史预售票房榜第五，在今年春节档预售票房排名第一。这部武侠电影开盘便能获得如此高的票房成绩，一方面得益于金庸IP的国民度，另一方面还有主演肖战的人气“加持”。</p><p style=\"text-align:justify;\">“趣解商业”了解到，有不少肖战的粉丝不仅真金白银购票支持，有的甚至还会打电话到影院催促排片。电影市场分析师连城易脆表示，粉丝对今年春节档非常积极热情，在预售阶段他们会通过打电话、发短信、发微信等方式去找影城主动要排片，有些语气上还略带威胁，或者直接命令式要求。</p><p style=\"text-align:justify;\">虽然粉丝热情空前，但正式上映前，《射雕》的排片率却一直未居榜首。1月29日，《射雕》的票房和排片占比分别为14.3%和16%；随后两天排片一直未能冲进前三，走势不及预售带来的高预期。</p><p style=\"text-align:justify;\">有从业者表示，有流量演员参与的影片往往预售成绩都不错，但最终票房还是取决于电影的题材和口碑等多重因素。连城易脆认为，一方面今年头部影片多，排片上需要平衡；其次，影院经理也非常害怕退票、空场的情况。“春节期间，影院除了挣票房，还要挣爆米花、可乐等卖品收入。《射雕》大量的粉丝填场，可能会发生‘买了票但人不来’的情况，票房挣到了但不会产生卖品收入。而且以前曾出现过一些粉圈集体退票的情况，影院必须防一手。”</p><p style=\"text-align:justify;\">截至1月31日，《射雕》豆瓣还未开分，但社媒平台上的口碑评论有两极分化的趋势，其中有不少网友吐槽剧情和选角的帖子。</p><p style=\"text-align:justify;\">“趣解商业”注意到，《射雕》由中国电影（600977.SH）主投主控；此前中国电影主控的《志愿军2》，曾拿下2024年国庆档的票房冠军。值得一提的是，今年春节档除了《射雕》，中国电影还参投了悬疑喜剧《唐探1900》和《熊出没・重启未来》。</p><h3 style=\"text-align:justify;\">票房大战背后，哪些公司赚翻了？</h3><p style=\"text-align:justify;\">豆瓣评分是很多影迷选择电影的重要参考指标。大年初二上午，在票房上领先的《哪吒2》《唐探1900》《封神2》豆瓣开分分别为8.5、6.7和6.5，分数排名与票房成绩排名一致。</p><p style=\"text-align:justify;\">《哪吒2》口碑不仅超过了同期对打的影片，豆瓣评分也高于前作，吸引了不少影迷到场支持；这部电影讲述了哪吒重塑肉身后，与龙族在陈塘关大战的故事。两部都看过的网友表示，《哪吒2》是在制作和故事上对第一部的全面升级，“这一部的变身以及兵器运用更燃、更富有想象力，情绪上笑泪兼具，值得二刷。”</p><p style=\"text-align:justify;\">据猫眼专业版数据，截至1月31日16时7分，电影《哪吒之魔童闹海》1月31日单日票房突破4.79亿，超1月30日票房成绩，实现票房逆跌。</p><p style=\"text-align:justify;\">《哪吒2》和前作都是光线传媒（300251.SZ）旗下彩条屋影业主控出品，前作票房高达50.35亿元；猫眼专业版预测显示，第二部的票房最终约49亿元。</p><p style=\"text-align:justify;\">值得一提的是，由于押中《第二十条》等爆款影片，光线传媒2024上半年实现营业总收入13.34亿元，同比增长120%。在光线传媒的待映片单里，《哪吒2》票房潜力高、也是打磨时间最长的项目之一；此次《哪吒2》的高口碑有可能会进一步拉高票房的走势，或许会为光线传媒带来新年的“开门红”。</p><p style=\"text-align:justify;\">作为《哪吒2》主投主控方，光线传媒将获得约40%的票房分账（若按50亿元计算，可分账约18亿元），叠加衍生品授权收益，该片有望贡献超20亿元营收，占公司2024年总营收的50%以上。</p><p style=\"text-align:justify;\">豆瓣评分6.7的《唐探1900》，虽然在口碑上落后于《哪吒2》，但票房却与《哪吒2》相差不大。小红书和豆瓣上很多网友对《唐探1900》褒贬不一，有人认为这部影片推理不足，强上价值很尴尬；有人则认为故事始终围绕一个主题层层推进，拍摄也非常有年代质感，想去电影院二刷。</p><p style=\"text-align:justify;\">一般来说，适合全家一同观看的喜剧片仍是过年刚需。有影视从业者表示，《唐探1900》春节档的优势在于喜剧元素；然而，今年影片“含喜量”整体较低，只有《哪吒2》和《唐探1900》在宣发时强调自身的喜剧属性。</p><p style=\"text-align:justify;\">鉴于前作的出色票房，《唐探1900》作为“唐探宇宙”的第四部，背后站着的出品公司众多。第一出品方为北京壹同传奇影视文化有限公司，由陈思诚担任股东，同样也是爆款电影《消失的她》和《误杀》系列的出品方。</p><p style=\"text-align:justify;\">值得一提的是，万达电影（002739.SZ）与陈思诚关系密切，不仅投资了北京壹同传奇，还几乎参投了陈思诚主导的每部电影，此次在《唐探1900》位列第二出品方。</p><p style=\"text-align:justify;\">Wind数据显示，万达电影的营收与净利润已经连续两个季度同比下滑。1月18日，万达发布2024年业绩亏损预告，2024年公司预计亏损8.5亿元-9.5亿元。公告中提到，业绩下降的主要原因受头部影片供给不足等因素影响，电影市场表现较为低迷，影院经营承压；其次，2024年影视行业整体恢复未达预期，公司对各项资产进行了减值测试并相应计提减值准备约7亿元至8亿元，剔除计提资产减值因素后，公司预计经营亏损约1亿元至1.5亿元。今年春节《唐探1900》的大卖，和整体票房市场不断上涨的热度，或许能为万达电影缓解一些压力。</p><p style=\"text-align:justify;\">除了《唐探1900》，万达电影今年还参投了春节档的常客《熊出没》系列。《熊出没》系列从2014年定档春节后，凭借每年一部新作成为春节档的“常青树”；今年《熊出没・重启未来》仍由华强方特主投主控，猫眼专业版预测该片最终票房约13.72亿元。在此之前，《熊出没》系列电影累计票房已突破75亿元。</p><p style=\"text-align:justify;\">另一大热门电影《封神2》由北京文化（000802.SZ）主投主控，是近两年北京文化的大投资体量的重点项目。目前《封神2》豆瓣评分滑落至6.3，票房成绩位列第三。</p><p style=\"text-align:justify;\">六大新片里，目前在排片和票房上明显落后的是《蛟龙行动》。这部军事大片目前豆瓣尚未开分，但已经有不少观众在评论区吐槽剧情“又尬又乱”。</p><p style=\"text-align:justify;\">连城易脆认为，如今“主旋律战争电影”的红利期已过，《蛟龙行动》本身虽然场面宏大，但是剧情节奏都存在明显问题；同时该片在宣发上也相对保守。猫眼专业版预测显示，《蛟龙行动》最终票房约4.09亿元。</p><p style=\"text-align:justify;\">据“趣解商业”了解，《蛟龙行动》背后的出品方是博纳影业（001330.SZ）；Wind数据显示，博纳影业去年前三季度也出现了营收利润双下滑的情况。目前《蛟龙行动》票房口碑均不乐观，能否替公司回本还是个未知数。</p><p style=\"text-align:justify;\">除了以上主控的影视公司，有不少上市公司也出现在春节档电影的参投方阵容里。例如参投《唐探1900》《熊出没・重启未来》的中国儒意（0136.HK）、猫眼娱乐（1896.HK），参投《射雕》和《熊出没・重启未来》的横店影视（603103.SH）；此外，淘票票及其背靠的阿里影业（1060.HK），也是春节档常客，今年分别参与出品了《封神2》《射雕》和《熊出没・重启未来》。</p><figure class=\"image\"><img alt=\"\" src=\"https://diting-hetu.iyiou.com/test/async/paste/jTTWd2CCDE22w0wEtKxh\"/><figcaption>图源：@做电影的连城易脆</figcaption></figure><h3>微短剧PK电影春节档“长短对打”？</h3><p style=\"text-align:justify;\">在六大影片定档后，很多从业者都表示，今年春节档总票房有望超过去年同期。2024年春节档曾凭借多出一天假期而打破影史记录，而今年假期时长与去年相当。</p><p style=\"text-align:justify;\">不断上涨的票房的确印证着消费者的观影热情；有影评人欣喜地表示，爱看电影的观众又回到电影院了。</p><p style=\"text-align:justify;\">然而，2025春节档这份空前的热度，能否延续到全年还要打上个问号。2024春节档同样创下新高，但全年票房却缩水不少。据万达电影公告数据显示，2024全国电影票房425.02亿元，同比下降 22.6%，观影人次10.1亿，同比下降22.3%。</p><p style=\"text-align:justify;\">连城易脆认为，这与去年行业产能不足有关。“电影生产有周期，2025年产能供给应该会比去年好，例如《刺杀小说家2》《镖人》《东极岛》《酱园弄》《鸣梁海战》等重磅大片都有望今年定档，好莱坞也有《疯狂动物城2》和《阿凡达3》大概率会引进。”</p><p style=\"text-align:justify;\">春节期间一直是文娱产业的关键节点。今年，除了院线电影，飞速发展的短剧行业也打出了“春节档”的概念。</p><p style=\"text-align:justify;\">据“趣解商业”了解，各大视频平台都推出了春节推荐短剧片单：红果短剧从1月22日到2月4日，将上新100余部高品质短剧及短剧演员真人节目《出发吧短剧》；芒果TV发布大芒·元剧场新年片单中，12部短剧将分为横竖屏两个大类释出；抖音主打精品短剧，既有明星阵容也有IP改编，主推的《河豚小姐》由“啥是佩奇”导演张大鹏操刀……</p><p style=\"text-align:justify;\">从片单来看，今年春节档头部短剧的数量已经超过了270部，集齐了家庭、悬疑、玄幻等所有剧集题材。“趣解商业”了解到，短剧头部制作方听花岛今年准备了7部作品上线春节档，包括民国风情、重生穿越、奇幻等多个题材。</p><p style=\"text-align:justify;\">红果短剧的老用户陈颖（化名）表示，今年春节，短剧的故事类型明显丰富了很多，而且阵容也很养眼，自己最喜欢的四个人气男演员居然齐聚在同一部短剧里。</p><p style=\"text-align:justify;\">不过，优质供给增加也意味着更加内卷，想在海量作品中突围拿下爆款播放量也不再容易；再加上付费模式逐渐向免费模式转变，截至目前，各平台短剧还未出现去年“单日消耗破亿”“7天充值破8亿元”的成绩。</p><p style=\"text-align:justify;\">总体而言，今年春节档短剧和电影都做到了百花齐放。事实上，不论内容长短、形式如何，只有坚持内容为王、不断创新，才能在激烈的市场竞争中赢得观众的青睐。对于创作者和出品方而言，也只有在作品上多下功夫，春节档的热度，才能真正延续到全年。</p></article>",
            "link": "https://www.iyiou.com/news/202502051089430",
            "pub_date": "2025-02-05 09:50:40",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "春节海外“走红”：外国人如何嗨翻“中国年”？",
            "description": "<article class=\"post-body\" data-v-b51fa692=\"\"><p style=\"text-align:justify;\"><span style=\"color:hsl(0, 0%, 30%);\">作者 | 沧海明月生</span></p><p style=\"text-align:justify;\"><span style=\"color:hsl(0, 0%, 30%);\">编辑 | 刘景丰</span></p><p style=\"text-align:justify;\">2025年的春节，注定非比寻常。</p><p style=\"text-align:justify;\">刚刚结束的春晚，在全球87个国家136座城市的3508块公共大屏上得到宣介或直播，海外视频观看量达5.2亿次。春晚，已经不只是中国人的年夜“大餐”，更是被越来越多海外观众看到。</p><p style=\"text-align:justify;\">此外，作为中华文化重要符号的“春节”，也在2024年12月被联合国教科文组织正式列入了人类非物质文化遗产代表作名录。这是继2023年12月春节被确定为联合国假日后，再次受到全世界认同。</p><p style=\"text-align:justify;\">春节，作为中国文化自信的彰显，在海外越来越广泛的传播，为全球文化交流注入了新的活力。</p><p style=\"text-align:justify;\">据不完全统计，全球约有近20个国家将春节作为法定节假日，超过五分之一的人口以不同形式庆祝农历新年。</p><p style=\"text-align:justify;\">那么，海外都有哪些国家也在欢度春节？春节文化的全球化正在走入什么样的新阶段？</p><h3 style=\"text-align:justify;\">邻国春节，随处可见的东方特色</h3><p style=\"text-align:justify;\">中华文化，源远流长。</p><p style=\"text-align:justify;\">自问世以来，带有农耕印记的春节文化，展现出了东方文化的内涵与特点，不仅对中国后世影响深远，对于周边国家形成了潜移默化地浸润。</p><p style=\"text-align:justify;\">被誉为“世界幸福指数最高国家”的不丹，位于喜马拉雅山南麓，以其壮丽的自然风光、丰富的文化遗产和淳朴的民风，吸引着无数游客慕名而来。</p><p style=\"text-align:justify;\">春节期间，当地有许多独特的节日活动，是体验这个国度魅力的最佳时机。</p><p style=\"text-align:justify;\">或许是地缘亲近的原因，不丹的春节习俗与中国藏族并无分别。不丹的春节又称“新年”，一般在正月初一到十五之间。</p><p style=\"text-align:justify;\">春节期间，除了祭祀先祖、吃年糕、放鞭炮等常规活动，不丹人也会粉刷房屋、参拜寺庙、悬挂五彩旗、烧松枝、吃酥油茶，还举行传统的射箭和飞镖比赛。</p><p style=\"text-align:justify;\">据说同样风俗的，还有尼泊尔。</p><p style=\"text-align:justify;\">因为崇尚白色，蒙古国视白色为纯洁、吉祥、神圣的象征，因此蒙古国的春节又称作白月节。</p><p style=\"text-align:justify;\">采用独特历法的蒙古国，春节与中国相差半个月左右，通常在正月十五到二月十五之间。</p><p style=\"text-align:justify;\">不只是日期，蒙古国在的春节习俗也展现出浓重的游牧特色。</p><p style=\"text-align:justify;\">每年正月初一，牧民就要在蒙古包上放上三块冰。相传蒙古的拉姆女神会在大年初一骑着骏马从远处来看望百姓，这些冰是供女神之马口渴时饮用的。</p><p style=\"text-align:justify;\">春节期间，蒙古各地都会举办摔跤、赛马、赛骆驼等传统比赛，人马沸腾，场面极为热烈。</p><p style=\"text-align:justify;\">和中国春节一样，蒙古国人也有拜年的习俗，一般是晚辈向长辈拜年，并敬献哈达。拜年时，年少者要把双手托在年长者的胳膊肘下，长辈则亲吻对方面颊，赠送小礼品，并致以最美好的祝福。</p><p style=\"text-align:justify;\">正月初一清晨，蒙古国最大的寺庙甘登寺已经围满了祈福的人群，其中还有总统、议长和总理这样的高层执政者。在为国民祈福后，他们分别前往住在首都乌兰巴托的几位耄耋老人家里拜年。</p><p style=\"text-align:justify;\">日本的春节叫做“旧正月”，即旧历新年。</p><p style=\"text-align:justify;\">在日本，华人占据国民总数的千分之二。因为春节不是法定假期，日本的华人会选择在除夕当天吃团圆饭，拜年时会送两个橘子给对方寓意吉祥。</p><p style=\"text-align:justify;\">受中国传统文化影响，日本冲绳至今仍保留着过春节的习俗。</p><p style=\"text-align:justify;\">农历正月初一早上，一些冲绳人要去自家水井或村落共用的泉水处，打一桶新鲜干净的清水，当地人称之为“若水”，以祈求清洁身心、永葆青春。</p><p style=\"text-align:justify;\">与日本隔海相望的韩国，将农历的大年三十、正月初一和初二定为法定节假日。</p><p style=\"text-align:justify;\">大年初一，全家人起早祭祀，祭礼完毕后全家人一起吃新年的第一餐--“年糕汤”。</p><p style=\"text-align:justify;\">“年糕汤”是韩国最具代表性的春节食品，年糕的白色象征纯洁，而圆形象征太阳和光明。</p><p style=\"text-align:justify;\">大年初一吃年糕，寓意又长了一岁，也是对新一年的美好憧憬。</p><p style=\"text-align:justify;\">吃完年糕汤，会举行“岁拜”，家中晚辈向长辈拜年磕头，感谢父母的养育之恩，祝愿父母健康长寿。</p><p style=\"text-align:justify;\">韩国人在除夕夜也会守岁，家人会聚在一起，享受团圆的时光，直到新年的到来。</p><p style=\"text-align:justify;\">而且他们也像中国一样贴春联，与中国红纸黑字的对联不同的是，韩国的春联要用大白纸写，据说这样显得更醒目些。</p><h3 style=\"text-align:justify;\">东南亚的春节，广式年味呼之欲出</h3><p style=\"text-align:justify;\">明朝中后期，由于人口迅速膨胀，加之政府禁海闭关锁国，导致国际贸易受阻，广东、福建等东南沿海地区的民众生计艰难。</p><p style=\"text-align:justify;\">生死存亡之际，很多广东福建人只得离开故土，以偷渡的方式来到了中南半岛、菲律宾群岛、印尼群岛等地寻求生路。</p><p style=\"text-align:justify;\">当时，这种行为被称之为“下南洋”。在朝廷眼里，这群私自出海谋生的人是天朝弃民，一旦抓获将处以严刑。</p><p style=\"text-align:justify;\">直到19世纪中期，清政府解除海禁后，沿海居民终于可以光明正大地下南洋。如今东南亚华人，基本都是一百多年前下南洋人的后裔。</p><p style=\"text-align:justify;\">因此，庆祝春节的习俗也随着华人漂洋过海，最终在东南亚生根发芽，成为当地重要的节庆活动。</p><p style=\"text-align:justify;\">在华侨众多的泰国，当地人打开春节的方式包括但不限于：大扫除、添新衣、买对联、挂灯笼、穿唐装、团圆饭、祭祖先等。</p><p style=\"text-align:justify;\">各大商场也纷纷张灯结彩，高挂大红灯笼，举办舞龙舞狮、中国民乐演奏等活动。</p><p style=\"text-align:justify;\">尤其是近年来，泰国总理等政要春节会通过录制视频或实地走访的方式，用中文送上春节祝福，更让泰国春节多了几分广式年味。</p><p style=\"text-align:justify;\">以“讨彩头”而闻名的广东福建人，也将这种风俗带到了东南亚。</p><p style=\"text-align:justify;\">在马来西亚，当地人春节就有“捞生”习俗——一个大圆盘里，鱼生为主材，搭配生菜丝、芹菜丝、胡萝卜丝、黄瓜丝、紫包菜等色泽丰富的配菜，再配上白芝麻、花生碎、酸甜酱等调味，多人围桌而立，一起用筷子反复把食材高高“捞”起，同时还不停喊着“身体健康、万事如意、财源广进”等吉祥话。</p><p style=\"text-align:justify;\">在粤语里，“生”与“升”谐音，越捞越“升”，即是对新的一年美好的祝愿。</p><p style=\"text-align:justify;\">有类似习俗的，还有新加坡。</p><p style=\"text-align:justify;\">春节期间，新加坡人也流行串门拜年。客人常带双数桔子或桔子礼盒登门拜访，寓意“好事成双”，而访客临走的时候，主人家也会回赠桔子。</p><p style=\"text-align:justify;\">新加坡人在这期间还会吃一种传统甜点--黄梨挞，即菠萝挞。</p><p style=\"text-align:justify;\">因为黄梨在中国南方一些方言中，音同“旺来”，因此这道甜点寓意来年兴旺。</p><p style=\"text-align:justify;\">作为越南最重要的传统节日，春节也被定为法定假日。</p><p style=\"text-align:justify;\">和中国人一样，越南人一般从腊月初就开始为过春节做准备，置办年货、打扫房间、买年画、贴春联、购置新衣物等。</p><p style=\"text-align:justify;\">常年气候温润的越南，花是必不可少的装饰品。越南北方家庭一般摆桃花，南方家庭则摆黄色的梅花。</p><p style=\"text-align:justify;\">除了上述习俗，广东流行的醒狮、舞龙、灯会等活动，也是东南亚人春节期间喜闻乐见的活动。</p><p style=\"text-align:justify;\">每逢春节来临，新加坡、马来西亚、菲律宾、泰国等地，商场里都会准备中国年味儿十足的主题装饰，街头的庙会、舞龙舞狮、灯会随处可见。</p><h3 style=\"text-align:justify;\">欧美春节，连接东西方的文化纽带</h3><p style=\"text-align:justify;\">在欧美的华人聚居区，春节逐渐从一个“少数族裔的节日”，发展成了全社会共同庆祝的文化盛宴。</p><p style=\"text-align:justify;\">2015年，美国纽约市政府就宣布农历新年为当地公立学校的法定假日。</p><p style=\"text-align:justify;\">位于纽约曼哈顿岛南端的曼哈顿唐人街，是纽约著名的打卡景点。</p><p style=\"text-align:justify;\">春节来临前，这里已经洋溢着春节的氛围：店铺门前都挂上了“新年快乐”的汉字装饰，红色中国结形状的路灯点缀在道路两旁，街道上悬挂着成排的红色、黄色灯笼，上面写着“和”“吉”等汉字，远远望去很是壮观。</p><p style=\"text-align:justify;\">每年曼哈顿唐人街的新春大游行，都是当地的一场声势浩大的文化盛宴。</p><p style=\"text-align:justify;\">2023年的新春大游行持续4个小时，共有150支游行队伍、21辆花车参与，吸引数万民众驻足观看。现场热闹非凡，年味十足。</p><p style=\"text-align:justify;\">2025年曼哈顿唐人街继续举办这一活动，这已经是第二十七届。</p><p style=\"text-align:justify;\">在纽约，除了市中心的曼哈顿唐人街，布鲁克林区唐人街、皇后区唐人街也颇具规模，每年吸引全球各地慕名前来的游客不计其数。</p><p style=\"text-align:justify;\">对此，美国繁荣华埠总会行政总监田士锐就表示，经过多年坚持，唐人街的春节庆祝活动已成为美国东海岸地区有影响力的华人新春庆典。</p><p style=\"text-align:justify;\">位于英国伦敦市中心的唐人街，有个简单直接的名字——“中国城”。</p><p style=\"text-align:justify;\">“中国城”的历史可以追溯到19世纪。起初，这里只是个简陋的集贸市场，主要为停靠于此的华人水手服务，此后100多年间，这里多次经历搬迁、扩充，终于形成了规模。</p><p style=\"text-align:justify;\">上世纪60年代末，大批香港移民抵达伦敦，“中国城”的规模再次得到扩充，店铺种类日益丰富。</p><p style=\"text-align:justify;\">已经在这里经营了几代人的移民逐渐站稳了脚跟，每年春节来临，他们都要组织各种文艺演出以排解思乡之情。</p><p style=\"text-align:justify;\">1985年，“中国城”得到当地政府承认并首次举行春节庆祝活动。</p><p style=\"text-align:justify;\">几年后，“中国城”的街道改为步行街，每条街道都用中英双语标注了街道名称，近百家餐厅、数十家商店、酒吧、理发店、维修店、中医诊所、旅行社、书店等商业场所栉比如鳞。</p><p style=\"text-align:justify;\">春节将近，这里的店铺已经在筹备中国农历新年了：甜品店用金龙、福字、金桔、翠竹等元素作为蛋糕的装饰品；中餐馆从腊八节那天就推出了象征“盆满钵满”的盆菜预订及年夜饭预订服务；各大超市的货架也已摆上年货，酥糖、点心、窗花、挂饰、红包等一应俱全；中文书店还提供写春联的服务，用传统书法给顾客送上祝福。</p><p style=\"text-align:justify;\">2022年，位于中美洲最南端的巴拿马宣布将中国农历新年定为巴拿马全国性节日。与此同时，巴拿马政府还宣称将春节庆祝活动融入巴拿马的国际旅游推介计划。</p><p style=\"text-align:justify;\">为此，巴拿马连续举办了两届“欢乐春节”庆祝活动，活动内容包含中国曲艺表演、华人春晚、新春文化庆典、烟花庆典、中国贺岁电影节和龙舟大赛等。</p><p style=\"text-align:justify;\">除此之外，联合国秘书长每年还会发表春节贺辞，向中国及所有庆祝春节的各国人民致以节日祝福。</p><p style=\"text-align:justify;\">那一刻，春节不仅仅是中国的传统节日，更是连接东西方的文化纽带。</p><h3 style=\"text-align:justify;\">中国春节，为何能辐射全球？</h3><p style=\"text-align:justify;\">春节国际化的背后，离不开文化和经济的双重驱动。</p><p style=\"text-align:justify;\">先说文化驱动。</p><p style=\"text-align:justify;\">自改革开放之后，尤其是21世纪以来，中国成为全球第二大经济体，综合国力有了大幅提高，日益展现出一个开放、文明的大国形象。</p><p style=\"text-align:justify;\">在此基础上，文化吸引力和影响力的飞跃提升，为春节在国际上上传播注入了软实力。</p><p style=\"text-align:justify;\">在当下的全球化时代，春节所蕴含的欢乐、友爱、团结、互助等元素，作为时间标尺与文化符号，也必将被全球大多数国家所包容，并作为多元文化加速融入。</p><p style=\"text-align:justify;\">正如德国著名的历史哲学家斯宾格勒所说：“各种不同的文化都是不同文化灵魂的表现。”</p><p style=\"text-align:justify;\">作为一种民俗文化，春节文化传递出的喜庆感、和平性、包容性、时令性和大众参与性拉近了中国与世界人民的距离。</p><p style=\"text-align:justify;\">再说经济驱动。</p><p style=\"text-align:justify;\">现代宏观经济学之父凯恩斯提出一个理论：“需求决定供给”。</p><p style=\"text-align:justify;\">从这个角度而言，春节国际化有效地带动了世界需求，为全球创造了新供给乃至更多就业机会，使全球经济更具活力。</p><p style=\"text-align:justify;\">来自各方的权威数据，为这一理论提供了支持：</p><p>2024年春节，某支付平台数据显示，春节期间境外游客在中国消费金额同比增长500%，境外游客生意的商家数同比增长560%；旅游杂志《TTG亚洲》称，春节期间中国游客正在重返全球旅游市场；泰国国家旅游局副局长西普拉对卡塔尔半岛电视台表示，中国游客的到来令人鼓舞；意大利国家旅游局局长伊万娜·耶利尼奇说，春节是中国游客到访的高峰期，出境游不仅惠及意大利旅游相关产业，还将为“意大利制造”、零售及餐饮等行业带来机遇；西班牙《国家报》称，中国采取切实举措促进旅游业发展、推动经济和人员交流，“展示出持续扩大对外开放的诚意”。</p><p style=\"text-align:justify;\">无疑，春节国际化是一场利好全球的潮流。</p><p style=\"text-align:justify;\">宏观层面上，春节所蕴含的和平、和睦、和谐的文化精神，有助于践行全球文明倡议、推动人类命运共同体的构建；</p><p style=\"text-align:justify;\">微观层面上，春节也让中国传统文化习俗在国际舞台上有了更广阔的展示空间。</p><p style=\"text-align:justify;\"><strong>一元复始，万象更新。烟火向星辰，所愿皆所成。</strong></p><p style=\"text-align:justify;\"><span style=\"color:hsl(0, 0%, 30%);\"><i>参考资料：</i></span></p><p><span style=\"color:hsl(0, 0%, 30%);\"><i>[1]《世界非遗+1！看看海外还有哪些地方过春节》，新华国际头条</i></span></p><p><span style=\"color:hsl(0, 0%, 30%);\"><i>[2]《“春节”申遗成功，意味着什么？》，人民论坛网</i></span></p><p><span style=\"color:hsl(0, 0%, 30%);\"><i>[3]《中国春节经济如何影响世界？》，中国新闻社</i></span></p><p><span style=\"color:hsl(0, 0%, 30%);\"><i>[4]《世界与中国 | 春节文化增进中西文明交流互鉴》，中国社会科学报</i></span></p></article>",
            "link": "https://www.iyiou.com/news/202502051089431",
            "pub_date": "2025-02-05 09:50:42",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "春节“出海”东南亚：中国年货成必备年味",
            "description": "<article class=\"post-body\" data-v-b51fa692=\"\"><p><span style=\"color:hsl(0, 0%, 30%);\">文｜晓鹏</span></p><p><span style=\"color:hsl(0, 0%, 30%);\">编辑｜嘉辛</span></p><p><span style=\"color:hsl(0, 0%, 30%);\">出品｜增长工场</span></p><p style=\"text-align:justify;\">2025年春节，注定是一个与众不同的春节。</p><p style=\"text-align:justify;\">2024年12月，春节申请非遗成功，从此春节不仅是中国的传统节日、华人的盛会，更成为全球瞩目的文化盛事，吸引着来自世界各地人民的关注。</p><p style=\"text-align:justify;\">尤其是TikTok难民涌入小红书之后，很多美国人在小红书上对中国文化产生了浓厚的兴趣，春节便是代表，外国友人也想加入这场热闹的盛会，纷纷发帖希望我们提供关于“春节怎么过”的照片，分享充满东方韵味的年俗、美食和故事，甚至想在地球的另一边以我们的习惯和形式庆祝春节。</p><p style=\"text-align:justify;\">2025年春节，文旅部历经二十多年打造的对外文化交流品牌——“欢乐春节”将在100多个国家和地区举办中国新年音乐会、新春巡游、新年家庭日、新春庙会等近500场活动，在近20个国家举办“全球彩灯点亮活动”。</p><p style=\"text-align:justify;\">此外，今年，“丝路电商过大年”活动首次举办，这次活动以“春节游中国”“年货出海”“丝路年货购”为主题，推出20项线上线下促消费重点活动。</p><p style=\"text-align:justify;\"><strong>春节正在跨越山海，成为全球文化的一部分。</strong></p><p style=\"text-align:justify;\">当然，要说除了中国之外，年味儿最浓的地方，还得是有更多华人聚集的地方——东南亚。近几年，东南亚的春节氛围越发浓厚，热度直逼国内。过年，最不能少的就是置办年货，来自中国的对联、食品、花卉也持续在东南亚热销。</p><h3 style=\"text-align:justify;\">东南亚人怎么过新年？</h3><p style=\"text-align:justify;\">春节，在越南被称为 “Tet”，是越南最盛大的节日之一，“一年劳碌只为三天大年”是当地的俗语，越南人非常重视春节。</p><p style=\"text-align:justify;\">年味儿从腊月二十三开始的，这和中国北方地区的习俗相似，这一天也是“祭灶节”“灶神节”。传说中，这一天灶王爷要向上天报告人间善恶，为了来年的好福气，百姓们在这一天祈求灶王爷“上天言好事，下界保平安”。</p><p style=\"text-align:justify;\">在越南的传说中，灶王爷是骑着鲤鱼上天庭的，所以在腊月二十三，越南还有放生鲤鱼的习俗。放生鲤鱼也有很多要注意的地方，比如说不能扔鱼，不能直接接触鱼避免鱼受到感染而亡，放生时可以念诵祈愿文。</p><p style=\"text-align:justify;\">接下来就是打扫房屋、布置房屋摆上桃花金桔盆景、扫墓、做美食，到除夕，贴对联、挂灯笼、放鞭炮也是越南春节的习俗。在年夜饭后，越南人一般会去寺庙祠堂拜祭祈福，回家的路上还会随手采摘一根带有绿叶的树枝，这种风俗叫“采绿”，谐音采禄。正月初一至初三是拜年的高峰期，人们会穿着新衣服互相道贺、走亲访友、送红包等。</p><p style=\"text-align:justify;\"><strong>越南过春节不能少了金桔、桃花，马来西亚的春节则不能少了凤梨。马来西亚的华人很多来自福建，在闽南语中，“凤梨”与“旺来”谐音，是一种吉祥水果。拜年时，人们喜欢送橘子，寓意大吉大利。</strong></p><p style=\"text-align:justify;\">马来西亚还是2025年“欢乐春节”全球启动仪式的举办地点，届时将会有1200架无人机编队带来盛大表演，除启动点亮仪式和演出之外，马来西亚吉隆坡活动现场和马六甲还将开展新春嘉年华活动，年货美食、花灯表演、非遗手作等应有尽有。</p><p style=\"text-align:justify;\">马来西亚的春节习俗中，最别具一格的则是捞生。“捞生”又称为“捞鱼生”，是以生鱼条为主材，配上蔬菜丝、水果丝等，再加上花生腰果等干果的特色菜肴，色彩丰富。人们会围坐在一起，用筷子将食材高高捞起，边捞边喊“捞起”“发啊”等吉祥话，寓意风生水起，祈求新的一年好运连连。</p><p style=\"text-align:justify;\"><strong>有传统的年俗，也有现代科技，2025年春节，马来西亚必定热闹非凡。</strong></p><p style=\"text-align:justify;\">捞鱼生习俗在新加坡地区也非常流行。腊八之后，新加坡就步入春节模式了，2025年1月7日（腊八），一名副总理、数名国会议员等开启了点灯仪式，新桥路口八米高的蛇形福树和绚丽的灯瞬间亮了起来。</p><p style=\"text-align:justify;\">腊八之后，年货市场就热闹起来了，从上午9点到晚上11点，一直到除夕下午才结束。过完除夕，人们的目光就转移到“春到河畔”去了。</p><p style=\"text-align:justify;\">“春到河畔”，是1987年为庆祝春节，新加坡旅游局推出的活动，有人称，“春到河畔”就像中国的“央视春晚”一样。</p><p style=\"text-align:justify;\">活动期间，既有丰富的文艺汇演，包括中国各地的民间舞蹈、戏曲、交响乐演奏等，也有书法、绘画、剪纸等传统手工艺展示区，人们可以近距离感受非遗技艺，甚至可以参与制作，还有必不可少的美食。</p><p style=\"text-align:justify;\"><strong>新加坡年味十足，但也崇尚节俭，走亲访友带点橘子就够了，走的时候，主人还会回赠柑橘，这是互赠吉祥的意思。</strong></p><p style=\"text-align:justify;\">相较于越南、马来西亚和新加坡，春节在泰国、菲律宾和印尼等地的影响力稍弱，一般有几个集中区，比如曼谷的唐人街，菲律宾马尼拉的中国城，印尼雅加达唐人街等地区。</p><h3 style=\"text-align:justify;\">年货，还得Made In China</h3><p style=\"text-align:justify;\">Grab集团内对其用户做了调研，在新加坡、马来西亚和越南接受调研的用户中，超过一半预计打算加大春节的支出。</p><p style=\"text-align:center;\"><img alt=\"\" src=\"https://diting-hetu.iyiou.com/test/async/paste/Aw7qpJjblGj3puEAEUKO\"/></p><p style=\"text-align:justify;\">在预算分配方面，用户在餐饮和聚会、食品杂货以及新衣服和服饰方面的分配相当均匀。</p><p style=\"text-align:justify;\">新加坡个人新年预算为1,352新元（合人民币7277元），马来西亚个人新年预算约为1,931令吉（合人民币3196元），越南个人新年预算约为740万越南盾（合人民币2140元）。</p><p style=\"text-align:justify;\"><strong>在购买决策方面，年轻人有了越来越强的话语权，千禧一代已经扛起了大旗，但在越南，也有相当一部分用户还表示，Z世代正在承担这一角色。</strong></p><p style=\"text-align:center;\"><img alt=\"\" src=\"https://diting-hetu.iyiou.com/test/async/paste/BmPvebyKSK6s6VACr2hk\"/></p><p style=\"text-align:justify;\">虽然年轻一代成为主要决策者，但老一辈在年货上的单次支出要高出许多，这可能和年轻一代购买年货途径更广泛，看到喜欢的就下单也有关系。</p><p style=\"text-align:justify;\"><strong>近几年，东南亚市场的电商渗透率迅速提升，短视频、直播、货架等多元方式成为购物的主流。跨境电商平台，也成为东南亚各国人民购置年货的重要途径。</strong></p><p style=\"text-align:justify;\">在春节影响力越来越大的现在，各个跨境电商平台在东南亚地区也推出了营销活动，抓住这波消费旺季。</p><p style=\"text-align:justify;\">TikTok Shop在新加坡举办了为期7天（1月12日——1月18日）的春节购物狂欢活动，包括重点直播间补贴，跨境商家直播支持、跨境商家短视频支持，春节期间，还将在菲律宾、马来西亚、泰国开启促销活动。Lazada在2025越南年货节制定了丰富的营销玩法，包括大促优惠券、包邮项目、平台闪购、超级品牌日以及金币等，在马来西亚和新加坡站点开展A+级别春节营销活动。Shopee也提供了丰富的活动，包括折扣等优惠活动和直播互动、新春游戏等特色活动。</p><p style=\"text-align:justify;\">相较于线上购物，线下的年味儿更足。</p><p style=\"text-align:justify;\"><strong>在胡志明市做装饰品生意的Nguyen Thu Hue女士，从2024年10月开始就采购中国商品，因为中国制造的年货更好卖，利润率还更高。</strong></p><p style=\"text-align:justify;\">中国制造的各种心形、花形、塔形糖果盘，价格在20万—25万越南盾，有中国元素的茶具售价18万越南盾，带着香味的仿真假花的价格约1万越南盾/株。而如果产地在越南，糖果盘和茶具的价格就要50万——100万越南盾，相似的花，在胡志明市也要卖到5—10万越南盾，价格差出一倍还多。</p><p style=\"text-align:justify;\">中国本土的零食也很便宜，麻糬蛋糕、咸蛋饼干、海绵蛋糕、虾酱蛋糕、融化的巧克力蛋糕等才几千越南盾。</p><p style=\"text-align:justify;\">Hue女士提到，越南本土商品的利润率在7%—10%，从中国进口再卖，利润率能达到40%—50%，部分甚至能达到70%—80%。销售电子产品的Thien先生说，他卖中国货每件利润是20%，卖本地货利润只有5%。此外，春节期间，不少小商家的化妆品生意也很好，可以从出售价格更优惠的中国面膜中获得更高利润。</p><p style=\"text-align:justify;\">Hue女士还发现，在春节期间有很多人寻找中国商品出售，许多以前只卖越南商品的人也改变了策略。</p><p style=\"text-align:justify;\"><strong>越南的一家消费品制造企业负责人称，2025年春节中国商品趋势强劲，一方面是因为国内企业有困难，没有实力推出营销方案和折扣策略，另一方面是电商的发展，让中国商品触手可及。</strong></p><p style=\"text-align:justify;\">如果住在两国边境附近，人们还可以来中国的年货市场。比如广西崇左（凭祥）每年举办的中越边关年货节，已经有30多年的传统不光是有中越两国的商品毫无，还有东盟特色产品。</p><p style=\"text-align:justify;\">物美价廉、种类丰富，年货还是要看中国制造。</p></article>",
            "link": "https://www.iyiou.com/news/202502051089375",
            "pub_date": "2025-02-05 09:40:42",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}