{
    "data": [
        {
            "title": "营收、估值暴涨，月之暗面能否打赢AI大战下半场？",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p style=\"text-align:justify;\"><span style=\"color:hsl(0, 0%, 30%);\">作者 | 张语格</span></p><p style=\"text-align:justify;\"><span style=\"color:hsl(0, 0%, 30%);\">编辑 | 趣解商业·AI力场</span></p><p style=\"text-align:justify;\">2026开年，中国大模型行业传来重磅消息：成立仅两年多的月之暗面，最近两个多月内连续完成超12亿美元的融资，估值突破100亿美元，刷新国内企业晋级“十角兽”（估值超100亿美元）的最快纪录，同时创下近一年来国内大模型行业的最高融资纪录；此外，其新一轮100亿至120亿美元估值的融资也已开启。</p><p style=\"text-align:justify;\">从天使轮3亿美元估值到百亿美元身价，月之暗面仅用两年多实现30多倍增长。估值增速破纪录的同时，有媒体报道，月之暗面最近20天的收入，已经超过2025年全年。</p><p style=\"text-align:justify;\">这家年轻的大模型企业，为何收入和估值同时狂飙？在巨头环伺、技术迭代加速的 AI 赛道，它又能否将短暂的爆发，转化为真正可持续的商业壁垒？</p><h3 style=\"text-align:justify;\"><strong>K2.5成增长引擎？</strong></h3><p style=\"text-align:justify;\">月之暗面的主要收入来源，是API调用费用以及C端用户的付费。在20多天前，月之暗面开源了最新的K2.5大模型，月之暗面近期收入暴涨，正是源于K2.5出色的表现。</p><p style=\"text-align:justify;\">作为月之暗面新一代旗舰模型，K2.5在多模态理解、智能体协作与长文本处理上实现了关键跨越：<strong>不仅全面升级图像、文档解析能力，还正式支持视频输入与理解，让模型具备了跨模态的综合推理能力</strong>。</p><p style=\"text-align:justify;\">有从业者表示，以往想要用Kimi克隆带动画效果的网站还只能截图描述，现在直接录一段视频发送给Kimi即可，从结果来看，K2.5物理仿真与程序化动画生成效果确实相当出色。</p><p style=\"text-align:justify;\">在第三方开发者社区中，有开发者对比了Kimi K2.5 和Claude Opus 4.5，后者与GPT-4o、Gemini 1.5 Pro并列为全球大模型的第一梯队，开发者选型时往往以能否达到Claude Opus水平作为参考。评测显示，<strong>K2.5在数学、视觉编程、上下文窗口、网页交互等能力上都胜过后者，同时还拥有更低的价格，对中小开发团队极具吸引力。</strong></p><p style=\"text-align:justify;\">此外，K2.5还落地了自研的Agent Swarm智能体集群架构，可支持多个智能体并行协作。例如用户想要写一份深度调查报告，下达任务后会有不同的智能体专家分步执行：搜索专家找政策文件、市场数据，分析专家处理数据，写作专家输出报告。“趣解商业”注意到，<strong>月之暗面已经根据Kimi的能力规划了不同的会员套餐，要使用Agent集群功能需要开通199元/月或699元/月的会员</strong>。</p><p style=\"text-align:justify;\">如果不使用Agent集群，只是提升K2.5的使用额度，套餐价格分别是49元和99元每月。有报道显示，Kimi用户对此付费意愿相当高，尤其是海外地区，<strong>目前月之暗面的海外收入已经反超国内</strong>。</p><p style=\"text-align:justify;\">实际上，月之暗面最近一个月付费用户暴涨并不是偶然。早在K2.5开源前夕，创始人杨植麟就在公司内部信上表示，海外C端商业化在飞速发展，海外和国内付费用户数平均环比增长超过170%，9-11月海外API收入增长4倍。凭借更强的性能与更亲民的价格，K2.5开园后在海外开发者社区、科技论坛中口碑持续发酵，已经成为OpenRouter上（全球开发者聚合平台），API调用量稳居前列的中国大模型之一。</p><p style=\"text-align:justify;\">模型性能与商业化的巨大突破，源于过去一年月之暗面的战略调整。2025年初，月之暗面退出投流营销大战，选择All in模型能力和Agent。有媒体报道称，决定转向All in模型能力、K2模型开源时，月之暗面算法团队几乎是“抱着必死决心”在投入。</p><p style=\"text-align:justify;\">这种在技术深度探索上的坚决，已经持续到2026年。<strong>杨植麟表示，接下来月之暗面将更加激进地扩增显卡，加速K3模型的训练和研发，在预训练水平上追平世界前沿模型</strong>；同时产品和商业化上聚焦agent，不以绝对用户数量为目标，持续追求智能上限，创造更大的生产力价值，营收规模实现数量级增长。</p><p style=\"text-align:justify;\">可以看到，虽然是初创公司，但凭借技术与商业化的双重底气，月之暗面已经站到全球大模型赛场中央，2026年也将成为Kimi与国内互联网大厂、全球头部模型正面“掰手腕”的一年。</p><h3 style=\"text-align:justify;\"><strong>百亿现金够烧多久？</strong></h3><p style=\"text-align:justify;\">技术和产品上的种种突破，正在给月之暗面带来正向的商业循环。最近三个月内，月之暗面完成了两轮融资，两轮合计吸金超12亿美元。</p><p style=\"text-align:justify;\">“天眼查”显示，2025年12月月之暗面5亿美元的C轮融资由阿里、腾讯、IDG资本投资；2月份新一轮超7亿美元的C+轮融资由阿里、腾讯、五源资本、九安医疗、高榕创投等联合领投，高榕创投等老股东继续加码，投后估值超100亿美元。</p><figure class=\"image\"><img alt=\"\" src=\"https://diting-hetu.iyiou.com/test/async/paste/XAivEIh7YZnoZlU43wp0\"/><figcaption>图源：天眼查截图</figcaption></figure><p style=\"text-align:justify;\">月之暗面100–120 亿美元的估值，在国内大模型赛道已跻身第一梯队，但与已上市的智谱、MiniMax超2500亿港元市值仍有明显差距；横向对比全球头部独角兽，约为OpenAI（7300亿美元）估值的1/66、Anthropic（3800亿美元）估值的1/35。</p><p style=\"text-align:justify;\">2024年，杨植麟曾被传出出售月之暗面股权套现数千万美金，一度被外界质疑是内部不看好公司发展；而如今随着K2、K2.5陆续开源，月之暗面又重新成为一级市场的“香饽饽”，此前的质疑也悄无声息。尤其是<strong>在最近的两轮融资中，都有月之暗面的老股东进行超额认购，</strong>反映了早期投资方对项目的持续押注意愿。</p><p style=\"text-align:justify;\">顺利的融资给月之暗面带来了充裕的现金流，这让月之暗面选择了一条与智谱、MiniMax截然不同的资本路径。去年12月杨植麟在内部信中表示，公司账上还有100亿元现金，“<strong>相比于二级市场，我们判断还可以从一级市场募集更大量资金，所以我们短期不着急上市，也不以上市为目的。当然未来我们计划将上市作为手段来加速AGI。</strong>”参照MiniMax与智谱在招股书中的数据，月之暗面的现金还可支撑3-5年的研发投入。</p><p style=\"text-align:justify;\">月之暗面的核心营收目前高度依赖开发者API调用和付费用户，这种商业模式的护城河，本质上是基座大模型的技术领先性；<strong>一旦技术迭代放缓，开发者便可能会用脚投票，转向性价比更高或能力更强的替代方案</strong>。</p><p style=\"text-align:justify;\">在月之暗面突飞猛进的同时，智谱和Minimax的大模型也在近期交出亮眼答卷。智谱的GLM-5凭借性能优势上调编程套餐定价，依旧供不应求；MiniMax的M2.5最近也登顶 OpenRouter每周/每月排行榜榜首，成为全球首个单周调用量突破3万亿Tokens的模型。</p><p style=\"text-align:justify;\">值得注意的是，<strong>Agent场景同时也是智谱和Minimax重点瞄准的方向</strong>，GLM-5面向 Agentic Engineering打造；M2.5是全球首个为Agent场景原生设计的生产级模型。随着Open claw爆火，2026年AI竞赛的焦点已从“模型性能”转向“Agent实用化”，作为曾经同属“AI六小龙”的智谱、Minimax和月之暗面，在Agent赛道上的正面竞争已无可避免。</p><p style=\"text-align:justify;\">接下来，各互联网大厂也将依托自身生态与流量优势快速切入，通过打通办公、终端、云服务等场景，与Agent OS深度绑定；相比之下，<strong>自有生态薄弱的月之暗面，将同时面临同行紧追与巨头合围的双重压力</strong>。</p><p style=\"text-align:justify;\">对月之暗面而言，K2.5的爆发只是漫长商业化征途的起点，接下来的持久战，考验的不仅是百亿现金的燃烧效率，还有在技术迭代与商业闭环之间找到平衡点的速度。</p></article>",
            "link": "https://www.iyiou.com/news/202602271122716",
            "pub_date": "2026-02-27 18:40:56",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "茅台春节动销猛增20%，白酒能和AI坐一桌了？",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p><span style=\"color:hsl(0, 0%, 30%);\">文丨向善财经</span></p><p>今年的春晚，AI展现了空前的宣传力度，各大厂商，都把今年春晚的宣传看得非常重。</p><p>铺天盖地的宣传，也让大家有了整个春晚都是AI和科技，而传统行业式微的体感。</p><p>事实上，比较反直觉的是，在AI和科技的光辉下，传统的白酒行业不仅没有错过这场营销盛宴，反而力度空前。</p><p><strong>整个春晚，共有8家酒类品牌亮相，仅次于2024年9家白酒登场的龙年春晚。</strong></p><p>看上去，白酒似乎并没有像大家预期的那样，在行业低迷阶段节衣缩食减少投放，反而是加大了投放的力度，以求更高的曝光度。</p><p>高曝光的背后，是酒企为低迷的终端动销蓄力的核心诉求.</p><p>而春节旺季的动销成绩单，既是酒企全年发展的首场大考，更决定了众多白酒企业在历经两年行业低迷后，是否极泰来，还是会继续陷入发展困境。</p><h3><strong>改革元年：“茅五”向左，行业向右</strong></h3><p>看今年的白酒行业，最绕不开的，还是经历了重大调整的贵州茅台。</p><p>改革后的贵州茅台，可以说是一枝独秀，节前节后的动销情况都要优于行业大盘。</p><p>经过对中邮证券、申万宏源、国金证券等券商的调研数据的汇总（注：下文中涉及数据部分均来自券商调研）<strong>，贵州茅台的主力产品飞天茅台，春节期间的动销预计同比增长10-20%+，同时1935/茅台王子等系列的动销增长也很明显。</strong></p><p>回款进度方面快于往年，多数经销商已完成全年计划的35%-40%，甚至已经执行了部分三月份的配额。</p><p>更关键的是，价格稳住了，飞天茅台的批价稳定在1700元，1935等系列酒的价格亦相对稳定，这都给节后批价下滑留足了空间。</p><p>除了贵州茅台之外，<strong>同属于高端区间的五粮液，表现也优于整个行业的平均水平。</strong></p><p>回款方面，其春节的回款进度约40%，整体发货节奏快过去年不少，第八代普五批价也稳定在770-790元区间，表现比较坚挺。</p><p>动销表现则优于行业，普五整体动销预计持平，在河南、江苏等重要的消费区域实现正增长。</p><p>渠道库存方面，仅仅只有一个月的量，这说明和茅台的情况一样，五粮液的社会库存也有所消化，整个渠道的情况非常健康。</p><p>与贵州茅台、五粮液形成鲜明对比的是整个行业大盘，<strong>根据国金证券的数据，预计春节期间全渠道动销量同比下滑约10%-15%，这还是在统计口径包含茅五的情况下。</strong></p><p><strong>当然，“差生”也有分层，不少企业开始逐渐从行业雪崩的阴霾中走了出来，止住了颓势，形成了茅五之下的第一梯队。</strong></p><p>经券商的调研数据汇总，上市公司中迎驾贡酒、古井贡酒、今世缘这些地产酒还有一直表现比较强势的山西汾酒，基本上都处于和上年度持平或者个位数下滑的水平，我们挨个来看。</p><p><strong>今世缘：</strong>回款进度约为30-35%，相对去年是持平的状态；中端产品的价格有一定的压力，比如四开的批价就回落至400元以下。</p><p>而且库存方面偏高，淡雅等产品社会库存累积比较多；动销方面则呈现分化的状态，淡雅、对开等大众价位产品表现较好，四开、V系列等次高端产品承压下滑。</p><p><strong>古井贡酒：</strong>回款进度省内约40%，省外约30%，整体的情况要慢于去年，但因为去年惊艳的表现，其实也可以理解。</p><p>产品价格方面相对稳定，终端算是稳住了，只不过经销商库存压力较大，约为4个月左右；动销结构则同样有分化，古5、古8在县域和乡域市场稳健，古16、古20则受次高端需求疲软影响下滑压力大。</p><p><strong>迎驾贡酒：</strong>这是今年的一匹黑马，回款方面进度良好，部分区域已完成全年50%左右的任务；主力产品洞藏系列库存约1个月左右，相对健康；动销表现十分亮眼，甚至有些超预期，洞6、洞9在宴席市场中动销十分强劲，实现双位数增长。</p><p><strong>山西汾酒：</strong>回款进度约25-30%，与去年相近，而且公司并没有强压回款；产品价格方面，青花20批价回升至375元/瓶以上。</p><p>渠道库存延续了过往的优良传统，去化周期约为1.5-2个月；动销同样呈现区域分化，青花20预计个位数下滑，但玻汾、老白汾等大众亲民的产品增长强劲。</p><p><strong>看完第一梯队，再往下就是依然在泥潭里面打滚的第二梯队，比如洋河股份，舍得、水井坊、酒鬼酒等企业。</strong></p><p>这部分企业的画像相对一致，<strong>它们的主力产品都是次高端白酒</strong>。比如洋河股份，多家券商的调研显示，占了大部分营收的梦之蓝有可能出现20%左右的下滑，舍得、水井坊、酒鬼酒等企业的情况也类似。</p><p>另外，它们的回款进度则普遍都在20%—30%、终端的批价大概率都处于承压的状态、库存普遍处于3个月以上的高位、动销跟随行业10%—20%下滑的幅度。</p><p>总的来说，根据春节期间动销的情况，整个白酒行业的格局，<strong>如果以价格带来区分的话，呈“扁担状”，即中间次高端赛道承压明显，高端、大众产品作为两头，表现回暖。</strong></p><p>以酒企的特性来区分的话，分化更明显了。除了洋河股份和泸州老窖，稳住的都是全国性、区域性的头部企业，行业的集中度还在进一步上升。</p><p><strong>头部企业稳定，也在一定程度上意味着，这一轮下行的洗牌阶段，已经接近尾声。同时，落后的企业追赶的机会也开始变少。</strong></p><p>另外还有个好消息是，从消费者端来看的话，老百姓日常喝白酒的积极性没有减弱，并不像想象中的那么悲观。</p><p>不然没办法解释，飞天茅台在i茅台上的一呼百应，也没办法解释各家酒企200元左右白酒的动销甚至出现了增长。</p><p>说白了，在消费者端，对优质产品的需求其实还在，日常需求甚至还比较稳定，下滑的主要还是商务宴请这块。</p><p>那在当前的市场条件下，怎么触达更多的普通消费者，走进日常饮用的消费场景，自然就成了白酒企业甚至全行业从业者的必修课。</p><h3><strong>白酒重做“女神”，要放下“高冷”</strong></h3><p><strong>从整个动销的数据和茅台的变化来看，想要更全面、更直接地触达消费者，线上化与“去经销商化”可能会成为大方向。</strong></p><p>线上化很好理解，即加强线上化率。</p><p>中国是电商行业最发达的国家，在电商巨头们不断内卷的推动下，电商的大盘甚至还有向上的空间。</p><p>但是，根据《中国酒类电商新零售报告2025》数据，2024年国内酒类线上渗透率仅仅为14%。也就是说，多数酒厂目前还是在用相对闭塞的传统渠道。</p><p>而从茅台动销的数据来看，<strong>增量的用户其实都来自于线上。</strong>在茅台之下，似乎也只有五粮液和山西汾酒，线上化率的进程要高于行业的平均水平。</p><p>天眼查APP显示，完成全国化的酒企中，也只有这两家的业绩可圈可点。</p><p style=\"text-align:center;\"><img alt=\"\" src=\"https://diting-hetu.iyiou.com/test/async/paste/YpEVfPM39Qh1H7t6YPZp\"/></p><p>当然，不能忽视的是，过去的白酒毕竟是靠着经销商起家的，渠道的变化，会影响到利润分配和营销激励的底层逻辑。</p><p>所以，线上化率的提升，也意味着酒企要缓慢的“去经销商化”。</p><p>“去经销商化”，并不是要抛弃经销商渠道，彻底扁平化管理，而是有两层含义：</p><p><strong>第一层，是直面消费者。</strong></p><p>直面消费者，对厂家来说，就有了消费者的一手数据。</p><p>因为消费的群体在变的更加大众化，线上渠道的提升，会让厂家有相对传统渠道而言，更为精准的数据。</p><p>比如哪些年龄，哪些地区的人买了哪些酒？酒的口感到底如何？哪种包装更加讨喜？</p><p>直面消费者，就不需要隔着经销商获取线下没那么科学的统计数据，这就省去了信息流通不准确带来的机会成本。</p><p><strong>第二层，则是让经销商，有厂商的意识。</strong></p><p>怎么理解？过去的经销商，因为市场行情好，用户相对集中，只需要向下分发就行了，属于躺平就能赚钱。</p><p>但现在用户分散了，就需要和厂商一样战斗了。</p><p>说白了，厂商做线上，能倒逼着经销商也做线上，甚至经销商要公域和私域一把抓。不然在厂商线上缓慢增长的过程中，经销商的作用会不断的削弱。</p><p>所以居安思危这件事，可能是现在的经销商都要做的。</p><p>当然，投入到线上的战斗，就一定需要成本，比如投入到短视频，电商平台，开始的阶段肯定需要投入费用和精力。</p><p>但是，模式只要运转开，<strong>一方面，在酒企和经销商的双重努力下，整体线上化率必然会提升，过去担忧的电商平台乱价的现象可能会得到一定的遏制，官方的线上渠道就能打通了。</strong></p><p>而且作为链条中的一环，这也意味着，酒企更离不开他们了。</p><p>另一方面，用户的触达更广泛了，粘性也更强了，有了更多的用户，产品就更好卖了。</p><p>具体怎么做呢？从珍酒李渡吴向东成功的路径来看，信息的交互，其实是非常大的卖点。</p><p>他在短视频平台上展示了一个身价百亿的老总生活化的一面，也输出了很多的观点，本质上，其实就是在出卖自己已有的信息，以获得关注。</p><p>而对经销商来讲，利用自己和消费者的信息差的交互（比如如何品酒，如何买酒，酒厂内幕等等），打造优质的个人IP，无疑会提升自己在消费者以及酒厂两端的的价值。</p><p><strong>更关键的是，对现在的消费者来讲，经过多年的培育，标品的线上官方授权的渠道更保真，更便宜，已经形成了思维定式，大家也更愿意在线上买东西。</strong></p><p>而且，传统的媒介式微，大量生硬的广告投放效果并不好，更多的优质内容才能吸引这部分线上消费的群体。</p><p>比如现在的广告投放，效果远远不如小红书的一篇爆文来的实在，还拿山西汾酒来说，一个消费者自主发起的桂花酒玩法，顶过厂家几千万的投放。</p><p>由此可见，白酒行业的线上化转型，并非酒企单方面的布局，而是需要酒企与经销商的协同发力。</p><p>酒企需要思考如何引导、催动更多经销商打造个人IP，参与到自主线上营销中；经销商则需要主动放下传统思维，拥抱线上渠道，通过内容输出与信息交互，实现与消费者的深度链接。</p><p>可能也只有如此，白酒行业才能真正实现线上化率的提升，完成从“渠道驱动”到“消费者驱动”的转型。</p><p>最后，在资本市场的估值方面，多个名酒的估值，都在低位。</p><p>五粮液14倍PE，山西汾酒16倍PE，贵州茅台20.75倍，古井贡酒的B股，甚至只有7倍PE，中证白酒指数的市盈率也只有18倍。</p><p>未来，经济回暖，能够抓住时代变化重获增长的白酒企业，或许真的需要被关注了。</p><p><span style=\"color:hsl(0, 0%, 30%);\"><i>免责声明：本文基于公司法定披露内容和已公开的资料信息展开评论，文章不构成投资建议。</i></span></p></article>",
            "link": "https://www.iyiou.com/news/202602271122738",
            "pub_date": "2026-02-27 18:40:57",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "豆包、Kimi狂飙，纳米AI为何“静悄悄”？",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p><span style=\"color:hsl(0, 0%, 30%);\">作者丨刘致呈</span></p><p>在过去的一两周里，中国AI完成了一次极具里程碑式的破圈、亮相和下沉。</p><p>先是腾讯、阿里、百度和字节们豪掷近50亿元，用红包大战开启了一场全民AI启蒙运动，让AI真正走进了千家万户。</p><p>然后在这一流量盛宴的催化下，从阶跃星辰上新Step3.5 Flash模型开始，到后来月之暗面、百度、智谱、科大讯飞们跟着扎堆发布新产品，整个春节期间，AI大模型技术竞争的激烈程度也被硬生生推向了顶峰。</p><p>AI商业化的想象力，由此进一步打开。</p><p>智谱在正式推出新一代旗舰大模型GLM-5的同时，宣布对GLM Coding Plan套餐的价格体系进行调整，整体涨幅自30%起。</p><p>至于月之暗面，有公开消息称，在旗下K2.5大模型发布不到一个月，近20天累计收入已超过2025年全年总收入……</p><p>可就是在这样一个历史性的节点上，纳米AI却意外地保持了沉默。</p><p>注意，<strong>沉默不是说纳米AI没有动作。</strong></p><p>事实上，1月29日，360旗下AI漫剧智能体生产平台“纳米漫剧流水线”启动了公开测试；2月14日，纳米漫剧宣布，首批接入Seedance2.0“满血版”，将于年后上线……</p><p>但可惜，这些动作在本轮AI春节狂欢中，更多只是边缘性的应用场景探索，而非战略层面的突破性布局。</p><p>所以和千问、Kimi们对比，纳米AI就不免给人一种凑热闹、打酱油的意思，不仅市场声量有限，而且也不太符合大众认知下周鸿祎在互联网行业中的教父级地位。</p><p>那么此时，360为什么会选择不一样的AI市场节奏呢？</p><h3><strong>纳米AI，出来养家太早了？</strong></h3><p>必须要肯定的是，从AI漫剧的高市场增速和Seedance2.0的表现来看，现在纳米漫剧瞄准的AI工业化制作方向，确实有很大的商业变现想象力。</p><p>但这里有个问题，<strong>纳米漫剧的驱动核心在于对AI技术的整合</strong>，比如对Seedance2.0的调教和搭配运用等，所以其本身的市场竞争壁垒是相对有限的。</p><p><strong>你能做，别人也能做，无非是你抢了个先机，但如果等到一线AI巨头们亲自下场，纳米AI们领先的那点护城河，可能一步就跨过去了。</strong></p><p>就拿有剪映、有Seedance2.0、有红果短剧、有豆包的字节来说，未来踏入AI漫剧的商业化河流，几乎只是时间问题。</p><p>这一点不难想到，毕竟自AI时代以来，颠覆与超越就成了科技圈的家常便饭。</p><p>但既然如此，360为什么还要偏向虎山行？</p><p><strong>一个大胆的猜测是，其希望纳米AI可以提前断奶，自己养活自己，甚至是反过来为360养家。</strong></p><p>毕竟说实在的，<strong>现在做AI大模型，本质上就是在打两场战争：</strong></p><p><strong>一是持续烧钱的战争。</strong></p><p>由于互联网时代的边际成本递减逻辑在AI领域失效了——大模型训练需要集群，推理需要算力，所以用户增长的越多，对应的运营成本也会呈现出线性上升趋势。</p><p>在这方面，虽然截止到去年9月底,360的账上大概还有两三百亿的资金，属于比上（阿里、字节）严重不足、比下（智谱、月之暗面）有余，但是这部分资金储备能撑得起这场AI持久战吗？</p><p>答案并不太乐观。</p><p>主要是过去6年，360的营收增速都在下滑，过去3年归属净利润连续亏损，总计亏损近40亿元。</p><p>天眼查APP显示:去年前三季度，360的营收增速恢复至同比增长8.18%，但归属净利润依然未能扭亏为盈……</p><p style=\"text-align:center;\"><img alt=\"\" src=\"https://diting-hetu.iyiou.com/test/async/paste/PycdM2v50iigCmMBmlNL\"/></p><p>一边是财务持续流血，一边还要打AI持久战，至于融资，在投资市场看不到太多新业务增长想象力的背景下，这条路恐怕也不太好走。</p><p>如此一来，360可能就需要纳米AI们尽早实现商业化变现，去尝试养活自己，为自己，也为集团补贴些家用……</p><p><strong>二是人才争夺的战争。</strong></p><p>这算是以360为代表的传统互联网中厂们最难受的地方。</p><p><strong>比资源调用、比个人成长空间，360抢不过阿里、字节等大厂们的人才虹吸效应；</strong></p><p><strong>比股权激励、比组织架构灵活度、年轻化，360也很难拼得过头部的大模型AI创业公司们。</strong></p><p>再加上业务业绩表现的整体承压，结果就是360们很难吸引到足够多的顶级AI人才，也很难在通用大模型领域做到持续领先，掉队就成为了必然……</p><p>这并非危言耸听，而是当前互联网中厂困境的最真实写照。</p><p>就像今年的这轮大模型发布潮，一个明显的方向变化是，现在很多大模型都开始强调Agent集群+自主规划+工具调用的执行能力。</p><p><strong>这实际上也是去年纳米AI先一步涉足的领域。</strong></p><p>去年8月，纳米AI升级为“多智能体蜂群”，一举成为了全球首个真正迈入L4级别的智能体系统。</p><p>其中，多Agent协同作战的核心逻辑，甚至和Kimi、Manus们都有着几分相似之处。</p><p>但就是在这么一个战略领先的背景下,双方在投资市场上的认可度和声量表现方面却被拉开了巨大差距。</p><p>这很难说没有后续AI资源投入上的差距影响……</p><p><strong>纳米AI的困境，本质上就是360集团资源瓶颈的映射，是整个互联网中厂们的时代困境。</strong></p><p>不过就算如此，我们还是要多说一句，无论纳米AI是否有自己的发展节奏，在AI正不可逆地替代着搜索的大背景下，360还是应该集中精力去加强AI技术根基，去跟上大模型“解决问题”的能力，而不是在此时打出有限的子弹，急于去寻求AI商业化的变现。</p><p>纳米漫剧可以尝试，但这些只是业务枝叶，真正能为360争得下一个时代船票的，还要属纳米AI本身，这才是未来十年的生存根基……</p><h3><strong>纳米AI，不破不立？</strong></h3><p>今年春节有一个很强的分水岭意义：A<strong>I产业从\"技术验证期\"进入了\"市场卡位期\"。</strong></p><p>毕竟，这场AI红包大战带来的，从来都不只是用户认知的普及，更是使用习惯的分化开始——当豆包通过春晚红包将大模型植入数亿用户的手机桌面，当千问AI点外卖成新的生活方式，AI时代的红利窗口期也就进入了关闭的倒计时。</p><p>此时，对360和纳米AI而言，沉默不是金，而是危险信号。</p><p><strong>每一次在超级流量入口的\"静悄悄\"，可能都意味着市场份额的永久性流失，以及未来用户迁移成本的指数级上升。</strong></p><p>所以现在，纳米AI或许也该重新审视一下自己的战略节奏了。</p><p><strong>一是营销不能停，要从\"事件爆发\"转变为\"战略定力\"。</strong></p><p>不可否认，在过去周鸿祎的个人IP带动下，纳米AI确实拥有一定的先天话题度，初期声量甚至可圈可点。</p><p>但遗憾的是，对比百度、字节等玩家们的持续投入，纳米AI后续却出现了\"开局猛、中段虚、春节哑火\"的断层态势，以至于和Kimi们拉开了巨大的市场声量差距。</p><p>这方面，纳米AI可以借鉴一下百度。虽然过去百度经常被诟病\"起大早赶晚集\"，但是在AI方面，其却展现出了恐怖的战略定力：开局投入猛烈，中间从未断档，即便在今年春节的声量不及元宝和千问，却始终保持在牌桌之上，维持了不可或缺的市场存在感。</p><p>这背后的一大考量是，<strong>在AI这种低替换成本的市场中，有时候，存在感本身就是一种护城河。</strong></p><p><strong>就像你去买一瓶水，同样的价钱、同样的品质，大部分人下意识都会选择那个打广告最多，或者最为熟知的品牌，而不是另一个不知名的小品牌，这就是用户心智营销所带来的价值壁垒。</strong></p><p><strong>当用户习惯了你的存在，你就成了那个“虽然不一定最好，但第一个想到”的选择。</strong></p><p>AI也是如此，在当前市场卡位期，纳米AI也需要保持营销耐力，在质疑声中持续造血，在静默期坚持发声，将AI品牌的构建从\"话题事件\"升级为\"长期资产\"，从而用时间换空间，在保持用户认知不掉队的同时，为产品技术层面争取到更多的成长发育空间。</p><p><strong>二是找到自己的生态位。</strong></p><p>其实面对大厂的挤压，纳米AI们并非没有机会，但前提是要放弃全能幻想，接受生态位现实。</p><p><strong>就像春节档电影的“熊出没”效应那样，在历年大制作、大阵容的贺岁片冲击下，虽然熊出没电影很少拿过票房冠军，但是只要上映，基本都能斩获不错的成绩表现。</strong></p><p>比如今年，据猫眼专业版数据，《熊出没·年年有熊》预测内地总票房达到10.95亿元。而截至发稿前，熊出没系列影片累计票房已经超过了90亿元。</p><p>原因之一就在于，<strong>熊出没电影找准了自己的生态位，瞄准的始终都是合家欢赛道、有小孩的家庭消费群体，所以在人们有钱有闲的春节档就可以实现票房的旱涝保收。</strong></p><p>AI行业也是如此。在全面竞争中，现在即便是强如阿里也只是选中了AI+服务消费路线，想要把千问变成本地生活与电商的智能入口；腾讯元宝发力的是社交+内容；Kimi瞄准的是开发者服务市场……</p><p>而理论上，纳<strong>米AI的生态位应该是\"安全AI\"</strong>——利用360在安全领域二十年的技术纵深，做最可信的企业级AI、端侧隐私计算模型，或是垂直行业的安全大脑。</p><p>不过此时，360和纳米AI也必须要回答一个问题：当用户选择AI时，为什么会为了\"安全\"而放弃豆包或文心的生态便利？</p><p>如果不能将安全能力转化为不可替代的差异化体验，生态位就只是PPT上的概念……</p><p><strong>三是独立融资。</strong></p><p>从前边的分析不难看出，对纳米AI来说，现在360已经不算是一个完美的钱袋子了。</p><p>甚至由于组织熵增问题的存在，后者还会反过来影响AI业务组织架构的灵活性。</p><p>所以此时，<strong>像百度昆仑芯那样彻底独立出去，就成了摆在纳米AI面前的一个最优解。</strong></p><p>未来也只有独立融资、独立估值、独立运营，纳米AI们才可能摆脱\"中厂预算\"的束缚，引入战略投资者（而非单纯的财务投资），真正参与大模型的军备竞赛。</p><p>当一家公司无法主要靠创始人讲故事就能获得用户时，它自然就学会靠资本、技术和组织力说话……</p><p>如此观之，<strong>2026年春节确实是分水岭，但分水岭从不意味着胜负已分。</strong></p><p>它只意味着，潮水将开始向不同的方向流淌。</p><p>而对于纳米AI，我们也不妨怀着一份审慎的期待:</p><p>就像冬日里的种子，不被看见，不等于不曾生长。春天的意义，不在于谁先发芽，而在于谁能活过冬天。</p></article>",
            "link": "https://www.iyiou.com/news/202602271122803",
            "pub_date": "2026-02-27 18:35:53",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "全球第四储能巨头，带病闯关港股",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p><span style=\"color:hsl(0, 0%, 30%);\">作者｜周松</span></p><p>在欧美仍多发大规模停电噩梦之际，又一家<strong>便携式储能独角兽</strong>走到了资本市场的门口。</p><p>便携式储能独角兽企业深圳市德兰明海新能源股份有限公司已<strong>向港交所递交招股书，拟香港主板IPO上市</strong>。这已经是它<strong>三年内第二次冲刺资本市场</strong>：2023年3月启动A股上市辅导，2025年终止；转身奔赴港股。</p><figure class=\"image\"><img alt=\"\" src=\"https://diting-hetu.iyiou.com/test/async/paste/3OTFphtP0RZX1xbeISFj\"/><figcaption>图源：德兰明海招股书</figcaption></figure><p>放弃A股、转向H股，与其海外业务结构高度相关。作为全球便携储能行业排名第四的玩家，德兰明海凭借BLUETTI品牌在海外市场站稳了脚跟：全球储能产品累计出货量超350万台，营收突破20亿元，<strong>海外收入占比接近100%</strong>。</p><p>不过，在光鲜的出货和热度背后，是仍处于<strong>增收不增利、连年亏损</strong>的尴尬状态。</p><h3><strong>一年卖出20亿，却未能盈利</strong></h3><p>当美国因冬季风暴造成50万居民受灾、停电，当欧洲因俄乌冲突陷入能源供电危机时，每一次寒潮、山火、飓风都在强化一个共识：<strong>电力安全，不能完全依赖公共系统。</strong></p><p>在这个情绪之上，储能的价值被重新定义：<strong>削峰填谷、应急备电、户外用电。</strong>叠加锂电成本下降、露营文化兴起、环保意识提升，便携式储能成为消费升级与风险对冲叠加的产物。</p><p>市场数据也相当诱人。Business Research数据显示，2023年全球便携式储能市场规模约18亿美元，预计2032年将增至56亿美元，复合年均增长率13.2%。这一快速扩容的赛道，正为中国储能企业打开全新增长空间。</p><p><strong>高增长赛道，往往催生高密度玩家。</strong></p><p>中国化学与物理电源行业协会数据显示，市面上头部的便携式储能玩家包括<strong>华宝新能源、正浩科技、德兰明海、安克创新</strong>。德兰明海并非最早，也不是声量最大，但它选择了一条极端路径：<strong>DTC直面海外消费者，把生意做到海外</strong>。</p><p>而这个故事的源头，还要追溯到2009年。</p><p>彼时，已经在锂电行业浸润多年的尹相柱开始萌发创业的念头。2011年日本地震带来的户外储能需求爆发，让他看清了一个趋势：<strong>电力焦虑会常态化</strong>。2013年，德兰明海成立，最初以ODM（贴牌）为主，存在感不强。</p><p>真正的拐点出现在2020年。德兰明海推出自主品牌BLUETTI，并在Indiegogo上线AC200户外电源。48天筹得约670万美元，达成目标金额的620倍，获得超7000名支持者鼎力支持，甚至创下了Indiegogo储能类产品的众筹金额之最。</p><p>众筹成功、打开知名度后，德兰明海快速搭建起了独立站、亚马逊等第三方渠道等，独立站在上线第一天就有了近30万美金的销售额。</p><p>资本随之而来。自2020年以来，德兰明海已完成多轮融资，最近一轮增资于2023完成，由钛信资本、松禾资本、唯品会投资等共同注资4.3亿元，<strong>投后估值高达82.32亿元。</strong></p><p>如今，德兰明海已经建立了智能化、自动化、信息化的制造体系，产品组合涵盖便携式储能产品与家用储能产品，并辅以周边设备及配件生态系统，核心系列包含Elite、Pioneer、Premium、Apex及EnergyPro等。</p><p>根据弗若斯特沙利文的数据，<strong>德兰明海2024年在全球便携储设备制造商中排名第四</strong>，以2024年按收入及出货量计，市场份额分别为6.6%及7.5%。截至2025年12月31日，德兰明海在全球累计出货超过350万台储能产品，远销120个国家和地区。2023-2025连续三年，BLUETTI位列Google Trends全球便携式储能品类搜索热度前二。</p><p><strong>账面规模不小，但盈利能力却始终摇摆。</strong></p><p>2024年营收21.74亿元，同比增长22.3%；2025年前三季度营收15.72亿元，同比增长3.3%，<strong>增速明显放缓。</strong></p><p>利润端则更凄凉。2023年至2025年前三季度，净利润分别为-1.16亿元、0.2亿元、0.25亿元，整体仍未完全覆盖历史亏损。公司坦言，由于仍处于销售、研发和海外本地化等业务扩张阶段，<strong>未来可能持续产生净亏损。</strong></p><figure class=\"image\"><img alt=\"\" src=\"https://diting-hetu.iyiou.com/test/async/paste/zCxsdtwdF0KWLLCBsi0T\"/><figcaption>图源：德兰明海招股书</figcaption></figure><p>简单讲：<strong>产品卖得动，但利润弹性有限</strong>。</p><h3><strong>九成命脉系于海外市场</strong></h3><p>在“存电”这件事上，外国人更为上头。</p><p>美国参与户外活动的人口比例接近一半，2023年常规露营和房车露营人次均达百万级，直接带动便携储能产品实现快速渗透。日本因地震等自然灾害频发、东南亚因洪涝灾害多发，全民防灾意识强，应急备用产品常年畅销。</p><p>在这股浪潮中，中国已成为全球便携式储能产业的超级工厂，<strong>2020年中国便携式储能产品产量占全球比例达到了91.9%</strong>。</p><p>如果只看国内市场，竞争格局明显更加拥挤。消费电子企业、工业电源厂商、动力电池巨头纷纷入场，玩家包括宁德时代、华宝新能、正浩科技、安克创新等。<strong>德兰明海并非国内声量最大的那一个，但它选择了把九成命运绑在海外。</strong></p><p>2020年众筹交付完成后，公司迅速启动全球品牌布局。海外业务的布局也带来了丰厚的回报：截至招股书披露期，公司产品覆盖120多个国家和地区；2023年、2024年及2025年前三季度，海外收入占比分别为98.8%、99.4%及97.9%，几乎是纯海外公司。2024年按收入和出货量计，公司全球市场份额分别为6.6%和7.5%，位列第四。</p><p><strong>从战略选择上看，这是一次踩准节奏的外拓</strong>。根据中国化学与物理电源行业协会数据，全球便携式储能市场到2026年规模有望达到882.3亿元，复合增速仍维持高位。与欧美成熟市场相比，国内户外渗透率明显偏低，反而印证了德兰明海优先出海的理性。</p><p>收入结构上也可以看出公司押注方向。2023年美洲、欧洲收入占比分别为44.0%和33.4%，2024年进一步提升至48.1%和35.2%。核心市场高度集中于欧美。</p><figure class=\"image\"><img alt=\"\" src=\"https://diting-hetu.iyiou.com/test/async/paste/FAC17F0V2yx80ojdSj92\"/><figcaption>图源：德兰明海招股书</figcaption></figure><p>德兰明海的另一大特色是<strong>研发投入</strong>。</p><p>招股书数据显示，2023年、2024年及2025年前三季度，德兰明海研发费用分别为1.28亿元、1.38亿元及1.29亿元，<strong>始终保持亿元级别稳定投入。</strong>截至2025年，德兰明海的研发人员超400人，占员工总数近三成。</p><p>这种研发投入，直接反映在产品的持续更新上。</p><p>早在2013年，德兰明海就率先开发并推出便携式储能产品。2019年，公司推动全球便携式储能行业实现从三元电池到磷酸铁锂电池的全面切换，2021年又推出即插即用型家用储能产品，加速家用储能市场普及。</p><p>专利方面，截至2025年末，全球有效专利847项，其中发明专利308项。技术储备在行业中处于前列。</p><p><strong>在海外渠道运营上，德兰明海选择了扎根本土化。</strong></p><p>截至2026年2月，公司在14个司法管辖区运营独立站，在29个第三方电商平台开设45家线上店铺；线下进入1000余家经销商体系，并进驻Home Depot、Costco、Jaycar、BCF、Best Buy等零售体系。</p><p>与此同时，公司在全球设立30家附属公司，在17个国家和地区布局22个服务中心，建立本土营销团队，形成从交付到售后的闭环。对于高度依赖海外收入的企业而言，这种本地化能力不仅是销售工具，更是风险缓冲器。</p><p>从收入结构看，这一模式确实奏效。报告期内，美洲收入分别为7.81亿元、10.46亿元、8.16亿元，占比持续提升；欧洲收入分别为5.93亿元、7.66亿元、4.51亿元，占比稳定在三成左右。<strong>几乎全部营收来自境外</strong>。</p><p>但硬币的另一面同样清晰。</p><p>收入越集中于海外，对既有渠道与市场的依赖就越深。<strong>一旦需求周期波动、汇率剧烈变化或关税政策调整，业绩弹性将被迅速放大。</strong></p><p>海外，是德兰明海的护城河，也是它最集中的风险敞口。</p><h3><strong>“带病”闯关港股</strong></h3><p>未来几年，业内普遍预测便携式储能还将处于高速成长期。GGII统计数据显示，2021年全球便携式储能全年规模达到111.3亿元，预计到2026年，全球便携式储能的市场规模将会超过800亿元，5年复合增长率达到48%。</p><p>但风口从来不自动等于盈利。</p><p>便携式储能的产品属性，本质上越来越接近消费电子：<strong>技术迭代快、价格透明、渠道为王、营销驱动</strong>。一旦供给端迅速扩张，行业很容易从“供不应求”滑向“红海厮杀”。</p><p><strong>因为，首当其冲的压力就是竞争白热化。</strong></p><p>国际市场上，德兰明海需要直面<strong>Goal Zero、Lion Energy等老牌企业</strong>；国内阵营中，则包括<strong>华宝新能、正浩科技、安克创新</strong>等强势玩家。</p><p>以华宝新能为例，其便携储能及光伏产品累计销量超过600万台，品牌Jackery长期占据亚马逊“Outdoor Generator”类目前列。但即便如此，其2025年净利润同比下跌超90%，同期净利率直接被抹平，仅有0.37%-0.58%。几乎处于“<strong>卖得动、但不赚钱</strong>”的状态。</p><figure class=\"image\"><img alt=\"\" src=\"https://diting-hetu.iyiou.com/test/async/paste/tpWxqOaakTzhDyMYAntB\"/><figcaption>图源：华宝新能2025年度业绩预告</figcaption></figure><p><strong>跨界者也在持续进入</strong>。华为推出户外电源产品，宁德时代布局应急电源，小米推出米家户外电源及配套太阳能板。产业链上游巨头与消费电子品牌同时下场，意味着价格、渠道与品牌都将被反复拉扯。</p><p><strong>第二重压力，来自增长模式本身。</strong></p><p><strong>由于</strong>收入主要由欧美海外市场贡献，导致德兰明海的<strong>在国际局势影响下的抗风险能力极低</strong>。一旦<strong>中美、中欧的关税关系</strong>发生变化，对德兰明海的业绩冲击极大。</p><p>事实上，德兰明海也在尝试解决这一问题。公司采用“<strong>中国研发+印尼制造+北美直发</strong>”的全球化布局。除惠州自有生产基地产能高达300万台外，公司2025年3月起与印尼第三方工厂合作生产，形成混合生产模式以应对区域需求波动和关税政策变化，年产能已150万台。但全球化布局也相应<strong>抬升了管理与资本支出</strong>，前期投入的效果仍是未知。</p><p>海外市场占比高、竞争激烈，德兰明海不得不持续<strong>加大营销、销售投入</strong>。2025年前三季度，德兰明海销售费用4.8亿元，费用率30.5%，处于行业高位。同期，华宝新能对销售费用为8.21亿元，费用率27.9%；安克创新销售费用约48.3亿元，费用率22.5%。</p><p>结果是<strong>利润端持续承压</strong>。2023—2024年，公司归母净利润分别亏损1.84亿元、4662.4万元；2025年前三季度仍亏损2985.2万元，较上年同期亏损3501.9万元有所收窄，但仍未扭亏。</p><p><strong>第三重压力，是治理与合规。</strong></p><p>德兰明海近年来的<strong>突击分红、逃汇被罚</strong>等经营动态，仍是其冲击IPO的“拦路虎”。报告期内，德兰明海先后进行了两次大额分红，合计宣派股息约1.24亿元。其中，2025年派发股息3710万元。并在IPO申报前的2026年1月15日，向部分股东宣派股息8740万元。</p><p><strong>在最近几年的盈利情况并不客观的前提下，德兰明海德1.25亿元分红与其现金流状况形成尖锐反差，甚至被质疑这笔分红是否是对老股东的特殊利益输送。</strong></p><p>无独有偶，德兰明海在<strong>合规管理</strong>方面曾出现过违规情况。天眼查信息显示，德兰明海存在两项行政处罚记录：2021年，德兰明海因在普通货物中夹带/谎报危险货物托运，被处罚11.25万元。2024年4月，公司又因逃汇被国家外汇管理局深圳市分局罚款22.9万元。</p><p>对于一家高度依赖跨境结算的企业而言，外汇与物流合规是经营底线。港股市场在公司治理与合规披露方面向来审慎，这些历史记录势必成为问询重点。</p><p>当然，这些问题并非德兰明海独有，而是便携式储能行业多数企业的共性困境。</p><p><strong>这场港股IPO，本质上是全行业共性焦虑的一面照妖镜。</strong>盈利模型的疲软、被营销费用“摊薄”的利润、现金流与豪气分红间的割裂，以及合规层面的历史包袱，德兰明海身上一道道勒痕，恰恰是当前拟上市储能企业的共同底色。</p><p>对这只独角兽而言，港股上市或许是解渴的“急救药”，但想要在内卷的红海中真正突围，前路依然布满荆棘。</p></article>",
            "link": "https://www.iyiou.com/news/202602271122815",
            "pub_date": "2026-02-27 18:35:55",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "影石被美国国际贸易委员会调查，最终裁决出炉！",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>据香港万得通讯社报道，影石创新2月27日公告称，公司于2026年2月26日（美国时间）获悉美国国际贸易委员会（ITC）就美国GoPro公司提起的337调查作出的最终裁决结果。</p><p>针对案涉6件专利，ITC最终裁决确认：3件GoPro主张的发明专利（第10,015,413号、第10,958,840号、第10,529,052号）所涉及的指控产品不构成侵权且专利权利要求无效/部分无效；1件GoPro主张的发明专利（第10,574,894号）所涉及的指控产品不构成侵权；1件GoPro主张的发明专利（第11,336,832号）权利要求无效。公司仅部分出口美国产品落入1件GoPro主张的外观专利（第D789,435号）保护范围，但公司提出的新外观设计方案已由ITC再次认定未对该件专利构成任何权利侵犯。该落入外观专利保护范围的上一代产品已经不再出口美国，当前产品均已由新外观设计方案取代。</p><p>本次终裁结果与2025年7月披露的初裁结果相比，在初裁结果认定第10,529,052号发明专利所涉及的部分指控产品构成侵权但专利权利要求无效的情况下，终裁结果认定该发明专利所涉及的全部指控产品既不构成侵权且该专利权利要求无效。另初裁结果认定第10,958,840号发明专利所涉及的指控产品不构成侵权，终裁结果进一步补充了该项专利所涉及的指控产品的不侵权情况。初裁结果的其他认定结论均予以维持。</p><p>至此，公司涉及的337调查已终结。公司表示，本次337调查为行政审查程序，不涉及专利损害赔偿问题，未对公司的生产、经营造成实质性影响。公司将持续不受限制地在美国进口和销售现有产品。</p><p>公告显示，在此次337调查过程中，公司专项工作组制定了充分的抗辩应对措施以及风险应对策略，除积极抗辩外，还准备了新的外观设计方案并获得ITC确认不构成侵权。同时，公司对GoPro在中国境内的相关主体提起了专利侵权诉讼，将通过多种法律途径积极维护自身合法权益。</p><p>公司提示，GoPro有权在ITC最终裁决生效之日起60天内向美国联邦巡回法院提出上诉；同时，其有权向美国加利福尼亚中区联邦地区法院申请重新启动相关诉讼程序。该平行诉讼已于2024年6月3日被法院裁定中止审理，本次337调查结案后，该诉讼将恢复审理，最终判决结果尚存在不确定性。公司将持续跟进上述事项进展，及时履行信息披露义务。</p></article>",
            "link": "https://www.iyiou.com/news/202602271122809",
            "pub_date": "2026-02-27 16:06:35",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "致敬未知完成亿元PreA轮融资，创维、博裕创投、联想创投等集体加码",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>亿欧2月27日消息，AI运动科技公司<span style=\"color:hsl(210, 75%, 60%);\"><strong>“致敬未知”宣布完成超亿元PreA轮融资，本轮由创维投资、博裕创投、联想创投、广发乾和等多家机构联合投资，创瓴资本担任本轮独家财务顾问</strong></span>。本次募集资金将主要用于全球化市场拓展、新产品研发及核心技术创新。</p><p><strong>这是致敬未知继阿里天使轮投资后，再次获得产业资本与财务资本的联合加持。</strong>在AI眼镜赛道竞争加剧的当下，本轮融资的完成，体现了资本市场对致敬未知战略定位与技术路径的认可。</p><p>从本轮投资方结构来看，致敬未知的产业协同布局逐步成形。创维投资、联想创投等产业资本将在供应链整合、渠道资源、技术生态等方面提供支持；博裕创投、广发乾和则将在资本运作与战略规划层面为致敬未知提供助力，加快AI运动科技的规模化落地。</p><p><strong>创维投资</strong>指出，致敬未知深度聚焦垂直运动场景，对用户需求及供应链有着深刻理解，不仅具备极致的产品打造能力，更擅长精细化用户运营，综合竞争优势显著。期待致敬未知在AI运动领域持续深耕，成长为全球领先的科技企业。</p><p><strong>博裕创投</strong>表示，作为本轮投资方，持续加注致敬未知的核心逻辑在于我们看到了智能眼镜作为“物理世界数字化终结方案”的确定性机会。当前大模型的竞争正从参数规模转向数据质量与场景闭环，而可穿戴设备是唯一能7x24小时渗透进真实人类行为、以第一视角持续采集多模态高价值数据（视觉、听觉、IMU、生物传感）的载体。致敬未知所切入的运动户外场景，天然具备高频、高粘性、高数据密度的特性，其产品本身即是内容生成工具与感知终端。这种“场景即数据源、数据即决策依据”的闭环能力，让公司在细分赛道率先跑通了AI Agent的商业闭环——当数据在运动场景内形成飞轮效应，其构建的垂直模型壁垒将远超通用型AI硬件。</p><p>另一方面，智能眼镜的本质是一场关于“微型化、低功耗、全天候可靠”的极限工程挑战，而非单纯的概念创新。致敬未知的核心团队是我们见过极少数真正经历过消费电子“饱和式交付”考验的组合：核心产品及研发负责人曾主导华为荣耀U8860、坚果Pro等百万级爆款的从0到1，以及ThinkPad T/X系列、摩托罗拉等千万级产品的全球量产交付。这支团队不仅“花过大钱”，更重要的是在移动端硬件的架构设计、供应链管控、品控体系等深水区积累了完整的know-how。在AI硬件创业普遍陷入“概念繁荣、交付乏力”的当下，这种能把极致工程化能力与AI场景定义能力深度融合的团队，才是我们敢于重注的底牌。</p><p><strong>联想集团副总裁、联想创投管理合伙人王光熙</strong>表示，随着端侧AI技术与垂直场景的深度融合，运动健康领域成为AI落地最具潜力的赛道之一。致敬未知以“场景驱动×多模态感知×AI实时决策”为核心技术路径，打造了兼具高性能硬件与智能算法的AI运动眼镜，首款产品上市即获市场高度认可，商业化潜力清晰。创始团队具有深厚的硬件积淀与AI创新思维，使团队在端侧AI与运动场景结合上展现出独特的竞争优势。联想创投长期深耕AI与智能终端生态，未来将充分发挥供应链整合、渠道资源、技术生态等优势，与致敬未知深度协同，助力其加快技术创新与全球化布局。</p><p>致敬未知成立于2022年，由前锤子科技合伙人、原华为荣耀产品线总经理吴德周创立。公司旗下品牌BleeqUp超影擎专注户外运动场景，推出针对骑行、跑步、登山、滑雪等场景的高性能AI运动眼镜，构建起“硬件+软件+服务”一体化解决方案。产品将基于端侧AI Agent技术，实现从数据记录到实时指导的跨越，推动智能穿戴设备从记录工具向决策辅助设备转变。</p><p style=\"text-align:center;\"><img alt=\"封面图\" src=\"https://diting-hetu.iyiou.com/GbuMLVb4dH.jpg\"/></p><p><strong>致敬未知创始人吴德周</strong>表示，公司目标并不止于成为一家硬件厂商，更希望构建以个人为核心的“AI运动健康智慧中枢”，成为户外运动领域的AI Agent，让AI主动理解场景、预判需求，在关键时刻提供决策支持。目前，公司已启动下一代产品研发规划与矩阵布局，以“端侧AI+运动场景”为技术主线，深化AI在运动健康领域的应用，通过技术迭代与体验升级，为用户提供更智能、更安全、更科学的运动健康解决方案，进一步夯实差异化竞争优势。</p><p><span style=\"color:#000000;\">自2025年9月底上市以来，BleeqUp超影擎首款产品Ranger出货量已突破万台，用户好评率达98%，销售网络覆盖全球20多个国家、600余个线下渠道。基于用户反馈，致敬未知持续升级BleeqUp Sport AI能力，近期将上线AI大师运镜、AI大师重绘、AI过弯精彩瞬间识别等功能，覆盖拍摄、剪辑到成片的完整流程。此外，产品将于3月推出粉紫色新配色，与现有黑白版本形成多元组合，满足用户个性化需求。</span></p><p style=\"text-align:center;\"><img alt=\"封面图\" src=\"https://diting-hetu.iyiou.com/sTbFHOer7L.jpg\"/></p><p>在AI技术加速向端侧与垂直场景落地的趋势下，致敬未知正围绕运动场景持续推进产品与技术迭代。随着本轮融资到位，公司将在研发投入、品牌建设及产业协同方面进一步加强布局，推动AI运动科技走向更广阔市场。</p></article>",
            "link": "https://www.iyiou.com/news/202602271122807",
            "pub_date": "2026-02-27 15:46:34",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "彪马2025财年营收73亿欧元同比下降8.1%，安踏入主成新变数",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>亿欧获悉，日前，德国运动品牌彪马发布2025财年业绩报告。财报数据显示，<strong>公司2025财年全球营收72.96亿欧元，同比下降8.1%；公司经调整息税前亏损1.66亿欧元，整体毛利率同比下降260个基点至45%。</strong></p><p>同时，彪马的<strong>批发业务</strong>实现营收49.35亿欧元，同比下降12.8%；<strong>直营业务</strong>实现营收23.61亿欧元，同比增长3.4%。</p><p>受业绩亏损影响，彪马提议2025财年不进行股息分配。</p><p><strong>具体而言，彪马2025年全域市场与品类均未实现增长。</strong></p><p>分区域来看，<strong>EMEA地区</strong>实现营收31.43亿欧元，同比下降6.9%；<strong>包含中国在内的亚太地区</strong>实现营收15.95亿欧元，同比下降7.4%；<strong>美洲地区</strong>实现营收25.58亿欧元，同比下降10%。</p><p>分品类来看，<strong>鞋类产品</strong>实现营收41.14亿欧元，同比下降7.1%；<strong>服装产品</strong>实现营收23.29亿欧元，同比下降9.7%；<strong>配件产品</strong>实现营收8.54亿欧元，同比下降8.5%。</p><p>彪马创立于1948年，与阿迪达斯同根同源，品牌以运动与时尚融合为核心定位，产品线覆盖鞋类、服装、配饰，在足球、赛车、田径等专业运动领域布局深厚，曾稳居全球运动品牌前三名，打造出Speedcat等现象级单品，在潮流运动市场拥有较高认可度。</p><p>面对业绩颓势，2025年7月上任的彪马新任CEO亚瑟·霍尔德（Arthur Hoeld）将2025年定义为品牌“重塑之年”，在最新财报发布之际，<strong>霍尔德再次重申目标，希望将彪马打造成全球前三的运动品牌，</strong>计划2027年恢复健康且高于行业水平的增长，同时创造可观利润。</p><p>值得一提的是，彪马的转型之路在不久前迎来了中国资本的加持。<strong>1月末，安踏体育宣布以总价15.06亿欧元（约合123亿元）收购彪马29.06%的股权。</strong>收购完成后，安踏将成为彪马单一最大股东。安踏将帮助彪马提升中国市场销售额，同时尊重其品牌自主权与独立治理架构，此次收购也是安踏推进多品牌全球化战略的关键一步。</p><p>2026年对于彪马而言，机遇与挑战并存。<strong>2026年世界杯成为品牌发力足球领域的重要契机，</strong>彪马计划将品牌战略围绕足球、跑步等核心领域展开；同时安踏的入局有望为其带来本土化运营经验与渠道资源，大中华区市场的增长潜力有望进一步释放。而挑战同样突出，彪马预计2026年销售额仍将有所下降，<strong>此外，过去三年三任CEO的更迭导致战略连贯性不足，叠加强劲对手耐克、阿迪达斯的行业竞争，品牌重塑与业绩复苏仍面临不小考验。</strong></p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/A1BPx9srm0KDIytVvIk6.png\"/></figure></article>",
            "link": "https://www.iyiou.com/news/202602271122802",
            "pub_date": "2026-02-27 14:50:49",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "宜宾漩涡科技获天使轮投资",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月27日，AI消费电子产品研发商宜宾漩涡科技（漩涡科技(宜宾)有限公司）宣布完成天使轮投资，投资方为宜宾新兴产业发展投资基金与清醒异构。此次融资将助力公司加速AI语音交互终端的研发与市场推广。</p><p>宜宾漩涡科技成立于2025年12月9日，是一家专注于AI消费电子产品的研发商，主要从事AI语音交互终端进入工程样机研发、智能硬件原型开发等业务。公司致力于通过技术创新，推动智能硬件与AI技术的深度融合，为用户提供更智能、便捷的交互体验。</p><p>本次天使轮融资的引入，将有效补充宜宾漩涡科技的研发资金，加速产品迭代与市场布局。投资方宜宾新兴产业发展投资基金与清醒异构对公司的技术实力与市场前景表示高度认可，期待双方未来在产业协同方面展开深度合作。</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/50109c850c4f9c797442ed050b2398c4/profile?source=iyiou.airzkb\" target=\"_blank\">宜宾漩涡科技</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602271122801",
            "pub_date": "2026-02-27 14:05:50",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Coral Care获A轮投资",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月26日，美国数字健康平台提供商Coral Care宣布完成A轮融资，本轮融资由AlleyCorp、Haymaker和Reach Capital联合投资。此次融资将进一步推动Coral Care在提升儿科发育专业护理可及性方面的创新服务。</p><p>Coral Care是一家专注于提升儿科发育专业护理可及性的数字健康平台。通过其平台，Coral Care连接经审核的本地儿童发展专家，支持家长即时预约与精准匹配。该平台致力于解决儿科发育领域资源分散、预约困难等问题，为家长提供便捷、高效的专业服务。</p><p>此次A轮融资的引入，将帮助Coral Care进一步扩大其服务网络，优化平台技术，并加强在儿科发育领域的专业资源整合。投资方AlleyCorp、Haymaker和Reach Capital对Coral Care的创新模式表示高度认可，并期待其未来在数字健康领域的持续发展。</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/b80e215af7d989561193153fe1654ce4/profile?source=iyiou.airzkb\" target=\"_blank\">Coral Care</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602271122800",
            "pub_date": "2026-02-27 14:05:52",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "日赚22.5亿元，英伟达的财报让华尔街闭嘴了",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p><img alt=\"\" src=\"https://diting-hetu.iyiou.com/test/async/paste/BUBXmHM54xaNS0FanN0U\"/></p><p>收入又创新高，平均每天盈利22.5亿人民币，英伟达的财报堪称炸裂。</p><p>截至2026年1月25日的2026财年第四季度成绩单显示，英伟达的核心经营数据全线超越预期，且对下一季度的指引极为强劲，证明了在人工智能算力领域，市场对芯片依旧“极度饥渴”。</p><p>财报显示，英伟达第四财季实现营收681亿美元，同比增长73%，不仅高于公司自身指引的650亿美元，也高于市场656.8亿美元的预期。从全年维度看，英伟达2026财年总营收达到创纪录的2159亿美元，同比增长65%。</p><p>其中，贡献超九成营收的数据中心业务依然是增长的绝对引擎。数据中心业务，第四季度收入达到623亿美元，同比增长75%。</p><p>得益于Blackwell架构芯片量产爬坡带来的产品结构优化，第四财季英伟达的毛利率达到75.2%，创下一年半以来的新高。</p><p><strong>利润更加炸裂。第四财季净利润429.6亿美元，全年净利润为1200.67亿美元，以全年数据来看，相当于日赚人民币22.5亿元。</strong></p><p>对于未来财务表现，英伟达依旧乐观，预计2027财年第一季度，收入将再破纪录，达到780亿美元上下（不含中国的数据中心算力营收），相当于环比增长14.5%，同比增幅约77%；预计2026财年，营收将持续增长，上调了去年预测的5000亿美元收入预期。</p><p>在业绩电话会上，黄仁勋表示，计算需求正呈指数级增长，Agentic AI的转折点已经到来，企业对该技术的应用正在飙升。</p><p>与此同时，市场上也盛行着对AI的担忧，甚至是“AI泡沫论”，主要表现为担忧AI巨头的高额资本开支并不能够带来正向循环的回报。据相关报道，今年谷歌、微软、Meta和亚马逊将一共投入近7000亿美元资金来推动AI扩张，比2025年高出六成以上。</p><p>大厂们的资本开支是英伟达短期业务的坚实基础。2026年全球头部的五大云计算服务商和超大规模云计算企业贡献了英伟达数据中心业务超50%的营收。</p><p><strong>黄仁勋指出，客户正竞相投资AI计算，并认为这最终将转化为有利可图的业务。针对市场关心的资本开支持续性，黄仁勋对云厂商客户的现金流增长充满信心，因为“AI算力即营收”。</strong></p><p>不过，在如此亮眼的成绩单背后，市场对英伟达的审视维度也在变化，从相对单一的增速指标转向更多维度，比如“盈利质量”与“现金流健康度”。</p><p>专业人士建议重点关注以下指标。</p><p>一是毛利率的可持续性，在存储芯片涨价和供应链成本上升的背景下，Blackwell架构带来的毛利改善能否抵御成本端压力。</p><p>二是现金回款能力，考虑到超大规模的云厂商对英伟达的影响，投资者不仅需要看到订单合同，更希望看到真金白银的现金落袋，以验证AI算力投入能够真正转化为可持续的现金流回报。</p><p><strong>此外，有一种观点认为SLM（小语言模型）和ASIC（专用集成电路）会是英伟达的潜在威胁。</strong></p><p>电影《大空头》的原型人物Michael Burry称，“对于大多数AI应用场景而言，SLM和ASIC才是未来发展的方向。如有必要，它们将向下兼容 CUDA。可以说，英伟达目前的方案耗电量巨大且效率低下，只是暂时守住了阵地。”</p><p>当AI大规模落地时，“运行模型”（推理）的规模将远超“训练模型”，因此对成本也更敏感，而英伟达的通用GPU为了兼容CUDA生态、适配多种计算任务，芯片架构本身存在一定的冗余开销。</p><p>相比之下，专为特定任务设计的ASIC芯片可以砍掉这些冗余，在特定场景下实现更高的能效比。这正是谷歌TPU、亚马逊Trainium等自研芯片的逻辑，也是Michael Burry认为SLM+ASIC可能成为未来方向的原因。</p><p>英伟达在2025年12月用200亿美元，以“非独家技术授权”的名义，掏空了AI推理芯片明星企业Groq的核心技术资产，并吸纳其创始人等核心团队，正是在加强自身在低延迟推理场景的能力。</p><p><strong>从这份年报不难看出，英伟达依然站在AI浪潮的最中心。业绩的高速增长、客户资本的持续投入，以及黄仁勋对Agentic AI时代到来的判断，都指向同一个方向：算力需求还未见顶。</strong></p><p>但市场关注的焦点已经开始从“还能涨多快”向“能稳多久”偏移，毛利率的持续性、现金回流的质量，以及推理时代可能出现的技术路线变局，都可能影响投资者对这家芯片巨头的定价。</p><p><i>作者：齐笑，编辑：赵元</i></p></article>",
            "link": "https://www.iyiou.com/news/202602271122741",
            "pub_date": "2026-02-27 11:55:50",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}