{
    "data": [
        {
            "title": "芯问科技获洪山资本Pre-A轮投资",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月27日，上海芯问科技有限公司（简称“芯问科技”）宣布完成洪山资本Pre-A轮投资。此次融资将助力芯问科技在科技推广服务领域的进一步发展。</p><p>芯问科技成立于2020年1月19日，总部位于上海市浦东新区，是一家专注于其他科技推广服务业的创新型企业。公司自成立以来，致力于通过技术创新和高效服务，推动科技领域的进步与发展。芯问科技凭借其独特的商业模式和强大的技术团队，在行业内逐渐崭露头角。</p><p>此次Pre-A轮投资由洪山资本领投，不仅为芯问科技带来了资金支持，更在战略资源、市场拓展等方面提供了重要帮助。洪山资本作为业内知名的投资机构，一直关注科技创新型企业，此次投资也体现了对芯问科技发展潜力的认可。</p><p>芯问科技表示，未来将利用此次融资资金，进一步加大研发投入，优化服务体系，提升市场竞争力，为更多客户提供高质量的科技推广服务。</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/26866b793488b0bbbace8f9ffb5e926a/profile?source=iyiou.airzkb\" target=\"_blank\">芯问科技</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602281122915",
            "pub_date": "2026-02-28 20:01:35",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "桥介数物获奇瑞控股等战略投资",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月27日，足式机器人控制系统研发商桥介数物(深圳)科技有限公司（简称“桥介数物”）宣布完成一轮战略融资。本轮融资由奇瑞控股、沂景投资、深圳天使母基金、钧石创投共同参与投资。</p><p>桥介数物成立于2023年5月29日，是一家专注于足式机器人控制系统研发的高科技企业。该公司研发的足式机器人具备稳定、优雅的行走能力，能够通过复杂地形，并配合机械臂完成操作任务。此外，其机器人还具备在多楼层之间自主导航的功能，展现了强大的环境适应性和智能化水平。</p><p>此次战略投资的完成，将进一步推动桥介数物在足式机器人领域的研发进程，加速产品落地和市场拓展。投资方奇瑞控股、沂景投资、深圳天使母基金及钧石创投的加入，不仅为桥介数物带来了资金支持，更在技术、市场资源等方面提供了全方位的助力。</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/4ebb4b35fbb6635a998ca13b4598cd53/profile?source=iyiou.airzkb\" target=\"_blank\">桥介数物</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602281122914",
            "pub_date": "2026-02-28 20:01:36",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "AI食安巡检员全面上岗！淘宝闪购面向网络餐饮行业开源“白泽”大模型",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>餐饮行业食安治理领域再添一枚重磅AI利器！近日，淘宝闪购正式发布专为餐饮服务与零售门店打造的风控治理垂直领域开源大模型——“白泽”（Ostrakon-VL），并宣布相关技术能力向全行业免费开放。</p><p>借助“白泽”大模型，外卖平台、餐饮及零售企业等行业参与方在图像识别、后厨预警等方面，都能通过人工智能技术快速加强对不合规场景的识别和治理能力，大幅提高数字化治理效率。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/4HIbV2iWuZRbWIL63q1l.png\"/><figcaption>“白泽”的论文已公开发表</figcaption></figure><p>2026年被预期为AI场景应用的全面爆发之年，随着《网络餐饮服务经营者落实食品安全主体责任监督管理规定》的出台，业内越来越关注AI可以如何助力网络餐饮行业提升数字化治理水平。作为首个面向餐饮服务与零售门店场景的多模态大语言模型，“白泽”已经深入参与到了淘宝闪购的日常平台治理中，在商家入驻审核、日常巡检及风险预警等核心场景中发挥关键作用。淘宝闪购会继续加大“白泽”的应用广度和深度，重点攻坚困扰行业的食品安全顽疾。</p><p>比如在明厨亮灶智能巡检方面，“白泽”可以24小时分析后厨直播视频流，自动识别墙面、台面清洁度、垃圾桶是否外溢、生熟食材是否分离、厨师是否佩戴工作帽等食品安全管理细节。白泽识别出违规行为后，系统可以即时生成预警并推送至风控治理团队，实现从“人工抽查”到“全时监控”的转变。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/iVscmOeL1ZE0p8iX9r7u.png\"/><figcaption>“白泽”可以24小时巡检明厨亮灶直播视频流</figcaption></figure><p>针对虚假店铺问题，“白泽”通过多图比对与思维推理技术，将商户环境与工商信息进行比对，模型可自动标记矛盾点，有效遏制“一店多开”和证照不符等违规行为。</p><p>目前，淘宝闪购已支持商家通过上传“一镜到底”的视频，来为其进行“可堂食”打标，“白泽”也能根据视频内容及店铺相关信息，综合判断店铺是否具备真实堂食环境，通过跨帧一致性分析识别视频真伪，防止用静态图片或AI生成视频蒙混过关，确保消费者获得真实的服务体验。</p><p>“白泽”项目负责人夏威介绍，该模型基于阿里云通义千问Qwen3-VL-8B基座进行深度训练调优，针对餐饮、零售门店场景的特殊需求进行了垂直领域适配，在技术性能方面的主要优势是极高的参数效率。根据ShopBench（服务于餐饮和零售门店的公开基准）评测，“白泽”性能评分显著超越同规模基座模型，在强噪声、高异质性的真实门店数据中仍能保持稳健的感知与决策能力。</p><p>目前，“白泽”已经接入淘宝闪购超过100个生产场景，调用量突破10亿级别，Token消耗量已突破万亿级别。更为重要的是，“白泽”的部署成本仅为同类方案的1/20，有助于网络餐饮行业的各参与方以极低成本大规模落地应用。</p><p>为推动行业整体食品安全治理水平提升，淘宝闪购宣布“白泽”相关技术能力向行业免费开放。模型权重与技术报告已通过主流开源平台发布，采用Apache 2.0开源协议，体现了平台以开放心态促进行业风控水平提升的决心。</p><p>据悉，该协议允许任何机构在商业或非商业场景下免费使用，无需支付许可费用，修改后的代码可闭源分发，并明确规定贡献者授予全球性、免版税的专利许可。使用方可根据需求自由部署和修改模型，实现“一次开源，多方受益”。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/41wmKznQja0NUwA7WWzW.png\"/><figcaption>“白泽”已在Hugging Face上开源</figcaption></figure><p>通过开源开放，连锁品牌总部可利用模型管理分店合规情况；各大外卖平台也可借鉴淘宝闪购技术方案提升自身治理能力。“白泽”的问世伴随着AI大模型从通用能力向垂直场景深度赋能的转变，为构建包含平台、商家、社会的食品安全共治格局，提供了新的技术路径。</p><p>淘宝闪购技术相关负责人表示，平台长期以来持续加大AI研发投入，以技术创新守护“舌尖上的安全”，让消费者放心消费，让合规商家获得更有利的经营环境。</p><p> </p></article>",
            "link": "https://www.iyiou.com/news/202602281122901",
            "pub_date": "2026-02-28 16:21:27",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "京东七鲜自有品牌上线Joybuy平台，元宵佳节海外华人吃上“家乡味”",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>近日，京东七鲜通过京东欧洲线上零售业务Joybuy，将数十款七鲜自有品牌商品成功销售至英国市场，为当地华人及对中国文化感兴趣的当地消费者提供了丰富的传统食材和特色商品选择。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/QiuAdGyMli4f1WwFH6ZO.png\"/><figcaption>京东七鲜自有品牌商品交付给海外华人</figcaption></figure><p>此次通过Joybuy销售的京东七鲜自有品牌商品种类繁多，涵盖了从烹饪必备品到休闲零食，再到健康饮品等多个品类。其中，绿豆、红小豆、建宁莲子等传统食材的热销，满足了海外华人制作汤圆等传统节日美食的需求，让他们在异国他乡也能品尝到家的味道。一位在英华人感慨道：“元宵节前通过Joybuy买到了心心念念的绿豆和红小豆，让我在异国也能亲手制作汤圆，这份‘家乡味’太珍贵了！”同时，玉米胚芽油、龙口粉丝、厚切苹果干、魔芋脆贡菜、荔枝气泡酒、黄皮油柑汁等商品，也因其独特的风味和高品质，赢得了英国消费者的青睐。</p><p>国际化始终是京东集团的重要战略方向，近年来加速了物流供应链的全球布局。目前，京东在海外运营的仓库数量已超过130个，总管理面积达130万平方米，并开通了多条国际货运航线。京东旗下欧洲线上零售业务Joybuy已在英国、荷兰、德国、法国、比利时和卢森堡开启试运营，依托于京东的供应链和物流能力，Joybuy已经在英国、德国、荷兰和法国等国家的主要城市，实现了当日达、次日达等高效配送服务，包括送货上门、生鲜冷链配送、大件送装一体及退换货等多元化服务。因此，英国用户通过Joybuy下单京东七鲜自有品牌商品，最快当日即可收货，确保了商品的新鲜度和消费者的购物体验。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/4ckmvME9Vj1wvnnHDvzN.png\"/><figcaption>销售至英国市场京东七鲜自有品牌商品（部分）</figcaption></figure><p>随着京东七鲜自有品牌商品在英国市场的销售成功，接下来，Joybuy会陆续将七鲜自有品牌商品带给荷兰、比利时、卢森堡、法国和德国等更多地区的用户，满足欧洲更多地区消费者日益增长的对中国传统食材和特色商品的需求，也助力中国优质商品走向欧洲更多区域市场。</p><p>对于海外华人而言，京东七鲜商品的引入不仅满足了他们对家乡味道的渴望，更成为了他们与家乡文化情感联系的纽带。七鲜小吊梨汤、茉莉花茶等商品的热销，让海外游子在节日期间重温了传统的节庆习俗。而茅根竹蔗水、栀子乌龙茶等创新饮品，则吸引了更多当地消费者探索东方饮食文化的魅力。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/bPXmpfVT2r7M8mcSgbnI.png\"/><figcaption>销售至英国市场京东七鲜自有品牌商品（部分）</figcaption></figure><p>一位用户分享道：“在京东Joybuy买到的小吊梨汤和茉莉花茶，让我想起了家乡的春节习俗。”与此同时，英国本地消费者也对这些独具特色的中国商品表现出浓厚兴趣，尤其是健康饮品和休闲零食类产品，成为他们探索东方风味的新选择。这不仅体现了京东七鲜商品在海外市场的受欢迎程度，也展示了中国品牌在全球范围内的影响力。</p><p>随着中国品牌加速“出海”，京东正凭借其全球超级供应链的实力和创新的服务模式，重塑全球零售格局。从一碗筋道的挂面到一瓶清甜的椰子水，京东七鲜商品在Joybuy的热销，不仅满足了海外华人的思乡之情，也为全球消费者打开了一扇了解中国文化的窗口，展现了跨境电商在促进文化交流与消费升级中的独特价值。</p><p>未来，京东将继续发挥自身全球超级供应链及海外物流网络建设的优势，推动更多优质中国商品走向世界，同时为全球消费者提供更加丰富、便捷的购物体验。</p></article>",
            "link": "https://www.iyiou.com/news/202602281122899",
            "pub_date": "2026-02-28 16:16:02",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "京东集团携手北京市民政局打造养老事业与产业协同发展的“北京标杆”",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>近日，北京市民政局与京东集团就促进首都养老事业与产业协同发展达成战略合作，双方将共同推动养老服务的“线上+线下”深度融合，打造具有首都特色的养老服务体系，培育银发经济、促进养老消费，实现民生改善与产业发展良性循环、相互促进。</p><p>借助此次战略合作，京东还将联合北京市民政局开展“暖阳助老”纸尿裤公益捐赠活动，面向全市100家养老服务机构免费赠送“护理关爱包”，以实际行动支持失能老人照护，提升失能老人生活质量，助力普惠养老事业发展。</p><p>自2021年启动“暖阳行动”以来，京东持续深化助老服务，始终将助老服务作为企业社会责任的重要组成部分，依托强大的供应链体系和科技创新能力，构建起覆盖商品、服务、情感支持等多维度的综合助老体系。以此次战略合作为契机，京东将统筹家政服务、医疗健康、家电家居、品质外卖、酒店旅游等业务，依托京东APP打造居家社区养老一站式服务平台，通过设置养老服务专门板块、推出适老化页面等措施，提升老年用户的使用体验。</p><p>为满足社会日益增长的多元养老服务需求，京东家政率先开设养老特色服务课程，涵盖饮食、起居、助浴等老年人生活照料标准作业流程、健康监测流程、应急处置流程、老年人心理关怀流程，以及居家康复流程。此前，京东家政已在日常保洁、家电清洗、维修、洗衣及整理收纳等基础服务领域，帮助老年家庭解决日常清洁难题，不仅降低老年人独自劳动的风险，还在服务过程中更加注重适老化设计，采用专业工具与温和清洁剂，并支持老人子女远程代下单，满足老年人在行动便利性、安全性与隐私保护等方面的实际关切。作为家政行业唯一拥有成熟培训体系的平台，京东家政也在日前宣布未来3年投入10亿培训建设资金，重点聚焦高标准养老护理课程研发，加强养老服务人才培养，进而推出标准、规范、安全的养老特色服务。</p><p>在专业服务领域，京东健康持续深耕线上“医、检、诊、药”服务闭环，助力老年人足不出户便可享受一站式的医疗健康体验。依托京东互联网医院老年病中心，京东健康联合全国三甲医院多学科专病专家，将优质医疗资源普惠更多老年群体，全面覆盖老年阶段核心健康问题，助力老年群体实现更便捷的长周期综合诊疗、健康管理，关爱老年群体身心健康；京东护士到家服务持续拓展，服务对象中近六成为老年人，入驻平台的执业护士人数已超过万人，大部分拥有三级及以上医院从业背景，累计服务家庭数十万户，目前服务项目已扩展至7大类64项，为老年人提供专业、便捷的到家护理服务。京东健康能够为老年用户提供慢病用药、健康监测、康复理疗、营养补充等全品类、专业化的健康养老商品，更有药师、营养师7X24小时在线，以及送装一体、上门验配等贴心服务，为银发人群提供更专业的健康指导建议。此外，京东健康还承接了全国多地的适老消费补贴，为老年用户提供更多切实健康福利。未来，双方将依托京东健康丰富的医疗服务资源和强大的医疗健康商品供应链，打造医养结合的服务模式，致力打造更专业友好的健康养老产品与服务新生态。</p><p>京东七鲜小厨将积极开展养老助餐服务，利用自身供应链优势开展线下点餐用餐、线上点餐送餐服务，系统解决当前养老助餐痛点问题，同时推出团体餐、长期餐等多样化服务，满足不同老年群体就餐需求。目前，七鲜小厨已成为北京首家正式备案的线上专供养老助餐点，率先打通北京市养老助残卡线上支付功能，部分门店同步上线“长辈专区”，为老年人提供便捷的线上订餐与配送服务。此外，依托于活跃在城市社区的配送人员，七鲜小厨还将探索在送餐同时对用餐老年人开展巡视探访，增强社区关爱老年人力量。此外，京东酒旅业务将积极推动旅居养老模式，提供适合老年人及其家庭同游的旅居产品，满足不同家庭异地养老需求，助力旅居养老产业高质量发展，推动“文旅+养老”协同创新。</p><p>针对老年人无法熟练操作智能手机的这一痛点，京东3C数码联合厂商，通过C2M（反向定制）模式打造大屏AI手机全新产品。聚焦老年人用机场景，从软件到硬件进行产品创新优化，让手机使用更简单。其中，AI语音操控、AI识别方言、远程协助、AI防诈等功能，让老年人也能便捷使用AI功能。同时大尺寸屏幕也能保障老年人可以看得清，配合耐摔、可靠、耐用、长续航的特性，京东大屏AI手机为老年人解决切实难题。此外，大屏AI手机WIKO X70更是首次搭载京东旗下的万能数字人助手“东东”APP，融合智能问答、健康问诊、外卖购物与创意生成等功能，老人使用这款手机可以享受便捷、智能的生活体验。</p><p>京东家电家居业务也在积极开展基础硬装改造、家居适老化、智能产品配备等服务，着力打造安全便利舒适的居家养老生活环境。目前，京东家电家居适老产品供给同比增长超100%，已拓展适老品类87个，覆盖品牌超3000个，适老商品数量超50万款。此外，京东还系统梳理老年人在起居、沐浴、出行、烹饪、家务、娱乐、安全等七大生活场景中的真实痛点与需求，联合中国标准化协会及行业领军品牌共同推动适老产品的标准化升级。京东也将利用京东MALL等线下大型商业体，设立适老商品体验区、样板间，开展适老专项活动，组织健康咨询、现场诊疗等活动，提升老年群体消费体验。</p><p>聚焦失能老年人皮肤脆弱、纸尿裤尺码难选等问题，京东超市推出了“过敏无忧”和“尺码随心换”两项贴心服务。消费者选购带有相关标识的自营商品，在使用过程中如出现过敏、尺码不合适的情况，可在线申请退换货服务，确保产品切实贴合老人实际需求、降低试错成本。</p><p>京东京造推出专为老年人设计的AI陪伴玩具“唠唠鹦”，通过智能化功能解决老年人在数字时代面临的陪伴与健康守护需求。特别配备一键紧急呼救按钮，遇突发情况可直接联系预设家人或社区服务，并联动京东健康平台，提供快速响应。</p><p>针对老年人的寄递需求，京东快递也在此前行业首个适老寄件服务基础上，对“长辈版”服务进行优化升级，不仅界面采用超大字体，首页也新增了更为实用的“电话寄件”入口，只需一个电话，专属客服不仅可以代长辈下单，还能全程查件、解答各类快递问题，实现真正的全流程陪伴。从2021年初，京东就成立了长辈专属客服团队，日常专门负责接线长辈用户，提供7*24小时全时段语音及在线服务，已帮助上千万老人解决消费以及生活中的难题。</p><p>此外，京东还将基于自身技术服务能力和先进经验，积极配合北京市民政局在养老等民政各业务场景的技术革新与数字化改造升级；双方还将以适老化产品标准和养老服务规范为基础，结合养老行业整体情况，制定完善适老化产品和养老服务相关行业标准，保障行业规范发展。</p></article>",
            "link": "https://www.iyiou.com/news/202602281122890",
            "pub_date": "2026-02-28 14:11:34",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Emed Technologies获战略投资",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月27日，美国药物递送和创新输液治疗设备研发商Emed Technologies宣布完成新一轮战略投资。此次投资旨在支持公司进一步研发和推广其用于皮下输液系统的医疗器械，以满足全球日益增长的家庭护理和慢性病管理需求。</p><p>Emed Technologies成立于1990年，是一家专注于药物递送技术的企业。公司致力于开发高效且安全的皮下输液系统，其产品包括SCIg60、Infuset、VersaRate等，广泛应用于免疫球蛋白治疗及其他注射治疗领域。这些设备特别适用于需要长期家庭护理或慢性病管理的患者，能够显著提升治疗的安全性和便捷性。</p><p>此次战略投资将帮助Emed Technologies加速产品研发进程，扩大生产规模，并进一步拓展全球市场。公司表示，未来将继续聚焦于创新药物递送技术，为患者提供更优质的治疗方案。</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/20b0ea83af59d90f1ef98681572955e6/profile?source=iyiou.airzkb\" target=\"_blank\">Emed Technologies</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602281122889",
            "pub_date": "2026-02-28 14:06:23",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "微创再生获深创投、苏州国发创投A轮投资",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月27日，苏州微创再生医学科技有限公司（简称“微创再生”）宣布完成A轮融资。本轮融资由深创投和苏州国发创投联合投资，具体融资金额未披露。</p><p>微创再生成立于2021年12月8日，是一家专注于组织工程与再生医学技术研发的高科技企业。公司致力于生物材料、组织工程及再生医学领域的技术创新，重点攻关骨、皮肤、软骨、神经、口腔及运动医学等组织修复关键技术。通过自主研发和合作研发，微创再生已形成多项核心技术，旨在为临床提供高效、安全的组织修复解决方案。</p><p>本轮融资将主要用于微创再生的研发团队扩充、技术平台升级以及临床试验推进。深创投和苏州国发创投的加入，不仅为微创再生提供了资金支持，还将为其带来丰富的行业资源和战略指导，助力公司在再生医学领域加速发展。</p><p>投资方深创投表示，微创再生在再生医学领域的创新能力和技术储备令人印象深刻，未来有望成为该领域的领军企业。苏州国发创投也表示，将继续支持微创再生的发展，推动其技术成果的产业化落地。</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/7363cfadc5c559be8faba0278216c09e/profile?source=iyiou.airzkb\" target=\"_blank\">微创再生</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602281122888",
            "pub_date": "2026-02-28 14:06:24",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "《2026年中国生产制造类工业软件行业发展洞察报告》解读——企业案例",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p><strong>一、中控技术股份有限公司</strong></p><p>中控技术股份有限公司（简称“中控技术”）作为国内领先、布局全球的智能制造整体解决方案供应商，始终致力于赋能流程工业的数字化转型。公司构建了以自动化控制系统为核心，工业软件、自动化仪表及运维服务深度融合的“4A”产品与技术体系，为客户提供从底层控制到顶层管理的全方位能力。目前，公司已形成覆盖生产管控、安全环保、供应链管理、资产管理、能源管理以及基础软件在内的六大类工业软件产品矩阵，全面助力工业企业实现高质量、可持续发展。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/yZpKod6WP8ZyZHZi8Iik.png\"/></figure><p><strong>二、和利时集团</strong></p><p>和利时集团（简称“和利时”）是中国工业自动化与智能化领域的核心企业，其工业软件发展已突破传统控制层范畴，致力于构建覆盖生产控制、运营管理、数据平台与虚拟仿真的全栈数智化能力。目前，和利时正以自主研发的XMagital智能平台为核心引擎，深入推进“原生融合、开放生态、AI驱动”三大战略，重塑工业软件体系，赋能流程与离散制造的全面智能化转型。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/5X88kBzn4Ewzd7mfwSI4.png\"/></figure><p><strong>三、赛美特信息集团股份有限公司</strong></p><p>赛美特信息集团股份有限公司（简称“赛美特”）是国内领先的智能工业软件解决方案供应商，依托扎实的技术能力与丰富的行业经验，持续助力制造企业实现智能化、自主化与低碳化升级。</p><p>作为国产半导体CIM龙头企业，赛美特是国内首家且唯一一家全自动化CIM解决方案供应商，已在多家12英寸晶圆厂获得量产验证。同时，赛美特在半导体智能制造软件份额稳居国产第一，是唯一实现规模化盈利的企业。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/jc8dgs0HXRyv7FGqwLeu.png\"/></figure><p>以上内容为报告节选，更多数据详情，请阅览完整版报告《亿欧智库|2026年中国生产制造类工业软件行业发展洞察报告》。</p></article>",
            "link": "https://www.iyiou.com/analysis/202602281122700",
            "pub_date": "2026-02-28 14:00:49",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "百余位零售行业高管将亮相NRF 2026亚太零售展",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>新加坡2026年2月24日 -- 美国全国零售联合会(NRF)与全球会展主办方Comexposium今日正式公布了<a href=\"https://nrfbigshowapac.nrf.com/\">NRF 2026亚太零售展(NRF 2026 APAC)</a>的<a href=\"https://nrfbigshowapac.nrf.com/agenda\">完整会议议程</a>，本届展会将于2026年6月2日至4日在新加坡金沙会展中心举办。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/6Q9YsMh4TH7v7Ds2LcI3.png\"/></figure><p>本届展会以\"The Next Now\"（下一个当下）为主题，设置超百场主题分享环节。亚太地区是全球增长最快的消费市场，零售业转型步伐持续加快，本次展会的议程内容均为精心策划，旨在为参会者带来前沿行业洞察，助力其制定面向未来的发展策略。</p><p><strong>超百位零售高管齐聚，分享行业前沿见解</strong></p><p>本届展会将再度汇聚全球零售领域的高管阵容。2025年，大会共有113位高管级演讲嘉宾出席，2026年的嘉宾阵容将进一步升级。</p><p><a href=\"https://nrfbigshowapac.nrf.com/speakers\">目前已确认的演讲嘉宾</a>包括：</p><p>• <strong>DFI零售集团</strong>(DFI Retail Group)行政总裁<strong>贝思哲</strong>(Scott Price)</p><p>• <strong>资生堂日本公司</strong>(Shiseido Japan)总裁兼首席执行官<strong>Koji Nakata</strong></p><p>• <strong>SM购物中心</strong>(SM Supermalls)总裁<strong>陈森原</strong>(Steven Tan)</p><p>• <strong>乐天零售</strong>(Lotte Retail)前集团首席执行官、高级顾问<strong>Samuel Kim</strong></p><p>• <strong>欧利芙洋</strong>(Olive Young)首席战略官<strong>Lee Young Ah</strong></p><p>• <strong>香港美心食品集团</strong>品牌产品董事<strong>赵嘉曼(Carmen Chiu)</strong></p><p>• <strong>AEON360</strong>董事总经理<strong>Ngai Yuen Low</strong></p><p>• <strong>雀巢日本</strong>(Nestle Japan)饮料事业本部常务执行董事<strong>Shimakawa Motoi</strong></p><p>• <strong>诗肯柚木</strong>(Scanteak)首席执行官<strong>Jamie Lim</strong></p><p>• <strong>Gill Capital（泰国/亚太区）</strong>董事<strong>Sanveer Gill</strong></p><p><strong>• 中国百货商业协会 (CCAGM) </strong>执行会长兼秘书长<strong> 杨青松博士</strong></p><p>DFI零售集团行政总裁贝思哲表示：\"亚洲正在重新定义现代零售业的形态，NRF 2026亚太零售展正是这场变革的重要交流平台。DFI始终聚焦如何融合消费者需求、数据与技术，在各市场打造更简洁、更无缝的消费体验。我期待与亚太地区的行业领袖交流，了解他们为服务消费者和社区所做出的零售变革实践。\"</p><p>资生堂日本公司总裁兼首席执行官Koji Nakata称：\"在资生堂看来，零售业的未来是人文洞察与大胆创新的持续对话。NRF 2026亚太零售展是重塑美妆与消费者连接方式的催化剂。我们期待通过打造沉浸式、价值驱动的消费体验，预判并提升未来消费者的需求与期待，共同书写零售业的全新篇章。\"</p><p><strong>亚太零售业发展的核心思路在此得到验证、实践和展示</strong></p><p>展商主题分享(Exhibitor Big Ideas)是NRF 2026亚太零售展的核心内容板块，也是展会最具特色的环节之一。与传统由展商主导的分享不同，该环节邀请展商与零售合作伙伴同台，呈现已在实际场景中得到验证的解决方案，分享极具实践价值，聚焦运营实操经验，坦诚分享方案落地过程中的成败与背后原因。</p><p>作为前两届展会最受欢迎的环节之一，2026年展商主题分享将扩增至四个舞台，设置近60场分享，谷歌(Google)、亚马逊云科技(Amazon Web Services)、万事达卡(Mastercard)等品牌均将登台分享。这一环节将面向所有持票参会者开放。</p><p><strong>三天展会多维赋能，打造学习与交流平台</strong></p><p>除完整的会议议程外，NRF 2026亚太零售展还设有两层展区，汇聚超300家参展商，集中展示零售行业前沿的解决方案与技术成果。所有参会者均可参观创新展示区(Innovators Showcase)，该区域经严格筛选，集中呈现全球零售领域的优秀创新企业与成果。</p><p>展会还将打造丰富的定制化学习与交流形式，进一步升级参会体验，包括提供英、日、中三种语言的展区导览和零售门店参访活动，同时开设定向邀请制的午餐会，深度探讨零售业特定领域的挑战。</p><p><strong>2026中国内地零售商限时专属权益</strong></p><p>原价1,499 美金的展会通票，2026年针对中国零售商实行限时 0 元* 免费权益。</p><p>注册通道：<a href=\"https://nrfbigshowapac.nrf.com/registration\">https://nrfbigshowapac.nrf.com/registration</a></p><p>Promo code (0元专享码)：NRFCHINA</p><p>0元注册截止日期：2026年3月31日</p><p><i>* 仅限中国内地零售商参与，须遵守其他相关条款与细则。</i></p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/aIyNUiL1v9DwvsmhIRfr.png\"/></figure><p><strong>关于NRF 2026亚太零售展</strong></p><p>作为亚太地区零售业的重要盛会，本届展会于2026年6月2日至4日在新加坡举办。展会汇聚亚太各地的零售行业领袖，在这一全球增长最快的市场舞台上开展深度合作。零售商可通过为期三天的会议获取行业领袖的灵感与见解，在包罗万象的展区中了解前沿零售解决方案，同时体验市场上最新的创新成果与突破性技术。 </p><p>联系人：McGagh Communications（代表NRF 2026亚太零售展）的Audrey McGagh，电话：+65 6570 9139，电邮：audrey.mcgagh@mcgaghcomms.com </p></article>",
            "link": "https://www.iyiou.com/news/202602281122867",
            "pub_date": "2026-02-28 11:41:21",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "九号公司2025业绩：营收213亿元，增50.22%，净利润17.55亿",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>2月27日，九号公司 (689009) 发布2025年年度业绩快报，公司全年经营业绩实现大幅增长，核心财务指标均创亮眼表现。 </p><p>数据显示，公司2025年实现<strong>营业总收入213.25亿元</strong>，较上年同期的141.96亿元<strong>增长50.22%；归属于母公司所有者的净利润17.55亿元，同比增长61.84%；</strong>扣非后归母净利润17.05亿元，同比增长60.50%。盈利端同步走高，基本每股收益24.39元，同比提升59.20%，加权平均净资产收益率达25.03%，较上年增加 5.93个百分点。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/dzZK7sqJJrqlNOzT6vkV.png\"/></figure><p>财务状况方面，截至2025年末，公司<strong>总资产213.34亿元</strong>，较期初增长36.08%；归属于母公司所有者权益71.68亿元，同比增长16.43%，整体财务结构稳健。 </p><p>对于业绩增长原因，九号公司表示，<strong>核心系持续深化智能短交通与服务机器人两大业务布局</strong>，电动两轮车、滑板车、服务机器人等核心产品销量稳步增长，营收和毛利润双双提升；同时成本费用增幅低于营收增幅，规模效应进一步释放。此外，公<strong>司资金管控、款项回收效率提升，存货储备合理增加，也推动了资产规模的稳步增长。</strong> </p></article>",
            "link": "https://www.iyiou.com/news/202602281122862",
            "pub_date": "2026-02-28 10:41:20",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}