{
    "data": [
        {
            "title": "京东生鲜汤圆消费观察：传统口味稳居C位，新概念汤圆增长迅猛",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>“正月十五闹元宵”，作为春节后第一个传统节日，元宵节这天，人们逛庙会、猜灯谜，观看舞龙、踩高跷等民俗表演，品尝节令美食——北方人喜爱“滚”元宵，南方人则钟情于“包”汤圆，用一颗颗寓意“团圆美满”的美味，开启新一年热气腾腾的生活。</p><p>随着生活方式和消费理念的变迁，今年元宵节，汤圆也迎来了一场传统与创新融合、口味与颜值齐飞的变革。京东生鲜消费数据显示，黑芝麻、大黄米等传统口味稳居“C位”，与此同时，榴莲、草莓、杨枝甘露等创新口味惊艳亮相，燕窝、铁皮石斛、阿胶枣泥等主打养生与低糖概念的汤圆日渐风靡，实现了甜蜜与健康的兼得；汤圆口味迭出，造型也不断突破，“柿柿如意”、“放轻松”、“有钱花”等高颜值汤圆持续走热，折射出年轻消费者要口福也要情绪价值的双重需求；而喜爱咸汤圆的消费者，也在猪肉、荠菜馅汤圆中找到了属于自己的仪式感。</p><p>元宵节期间，京东生鲜推出“满199减100、满99减40”惊喜福利，即日起，打开京东APP搜索“怪怪汤圆团圆夜”，只需9.9元即可选购多款兼具美味与颜值的汤圆，把一整年的好运和福气带回家。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/31bGQ7lKzoiwuh0wbJ8L.png\"/></figure><p><strong>元宵节汤圆爆款出炉，黑芝麻口味稳居“C位”</strong></p><p>对许多人来说，每年元宵节，汤圆里的那一口甜或者咸，是最鲜活的年味记忆。过去，物质条件有限，人们用黑芝麻、花生、黄米这些平价的食材包裹成馅，既饱腹，又美味实惠。</p><p>今年，传统黑芝麻汤圆凭借其深入人心的味道和口感，稳居元宵节汤圆“C位”。京东生鲜消费数据显示，今年春节至今，湾仔码头黑芝麻汤圆成为最受消费者喜爱的汤圆“顶流”。这源于其对口感的极致追求：选用优质黑芝麻经传统石磨工艺研磨，馅料流沙般细腻顺滑，搭配软糯Q弹的糯米外皮，咬开的瞬间，芝麻浓香便在口中爆开，带来满满的幸福感。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/eKIRGBkWFbUiPimnz1t3.png\"/></figure><p>此外，三全、思念、五芳斋黑芝麻汤圆，也凭借扎实的用料和地道的风味，跻身汤圆销量前十名，印证了经典口味的强大生命力。另一款京东自有品牌鲜京采与缸鸭狗联名的黑芝麻汤圆，凭借宁波百年水磨工艺，米粉磨得极为细腻，汤圆皮薄而韧，入口软糯而不粘牙，元宵节前环比增长156%。</p><p><strong>万物皆可“包”：新奇特口味走红，养生与低糖汤圆成新潮流</strong></p><p>伴随汤圆工艺与消费理念的升级，汤圆口味不断迭代，榴莲、草莓、蓝莓等时令水果开始进军汤圆圈，为汤圆增添了一抹甜蜜的风味；一些网红奶茶、甜品风味也被包进了汤圆里，比如羽衣甘蓝茉莉青提、鲜奶龙井茶、杨枝甘露、白桃乌龙等，以其独特的风味，持续拓展传统点心的味觉边界，为年轻消费者带来了全新的味蕾体验。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/4KfkSxRGztccFuRiT9R9.png\"/></figure><p>汤圆口味不断丰富的同时，这两年，健康理念持续深入，越来越多人开始注重养生，信奉“药食同源”和“五谷膳食”的饮食理念，追逐健康、滋补食材，玉米山药、茯苓、燕窝、阿胶等养生食材也被包裹成馅。</p><p>例如，五芳斋推出阿胶红糖枣泥汤圆、铁皮石斛黑芝麻汤圆、三色藜麦黑芝麻汤圆；思念三色慢养大黄米汤圆元宵节前环比增长586%，将大黄米、黑米、小米三种谷物混合入皮，丰富了膳食纤维的摄入；七鲜私厨宁波燕窝汤圆选用印尼干燕窝入馅，搭配传统宁波水磨皮，晶莹剔透的燕窝与糯米的软糯在口中交融，环比增长477%，成为送礼的爆款之选。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/RTV6PGyOQjS6NNOYw8b3.png\"/></figure><p>迷上养生的年轻人，饮食口味也逐渐转向“轻食风”。传统汤圆糖分含量较高，让许多注重健康的人吃起来有顾虑，为此，低GI、低脂、0蔗糖、木糖醇的“轻负担”汤圆成为新的消费增长点。今年元宵节，五芳斋推出的速冻木糖醇黑芝麻汤圆环比增长超6倍，这款汤圆以木糖醇代替蔗糖，保留甜味的同时大幅降低热量，控糖人群也能安心享用；湾仔码头大黄米黑芝麻轻汤圆环比增长275%，相比传统汤圆，这款汤圆采用低糖配方，以甜叶菊粉入馅，每100克汤圆含糖量不到5克，真正实现了“美味轻负担”。</p><p>此外，三全汤圆低GI蓝莓桑葚汤圆、思念零蔗糖黑芝麻汤圆等新品，精准回应了年轻人“既要口福又要健康”的心理，兼顾传统风味与现代健康需求，吸引了不少年轻人尝鲜。</p><p><strong>高颜值汤圆出圈：要美味也要情绪价值</strong></p><p>满足健康需求的同时，高颜值、好寓意、趣味化也成为今年汤圆市场的新风尚。如今，消费者购买汤圆，不再仅仅为了饱腹，更是在购买一份好心情、一个好彩头，期待通过食物获得情绪价值与情感共鸣。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/mgA6Z7GdTJNBMyEqqCjX.png\"/></figure><p>前几年，“柿柿如意”汤圆横空出世，戳中了当代人对生活“事事如意”的美好期盼，迅速走红网络。今年春节至今，思念柿柿如意汤圆持续畅销，稳居汤圆销量第二名，成为礼赠亲友的不二之选。三全的“好柿發生”汤圆也采用柿子和花生两种造型，寓意“有好事发生”，环比增长超3倍。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/QE80O1Eo5Qc2cU7on3OE.png\"/></figure><p>此外，“有钱花”、“桃气满满”、招财猫、元宝等承载美好寓意的汤圆，以及草莓、核桃等可爱造型汤圆，让汤圆从一种节令美食，变成了年轻人“悦己”与社交的新选择，为传统节日注入了新活力。</p><p>以三全组合装汤圆为例，这款汤圆总共10袋，涵盖“放青松”、“马到成功”、“彩虹小马”等各种造型，寓意“放轻松，好事自然成”，精准击中了当下年轻人追求个性、渴望松弛感的需求，情绪价值拉满，元宵节前环比增长高达205倍，一跃成为今年最火爆的汤圆新品。另一款思念熊猫好运汤圆，通过立体3D技术还原熊猫萌态，配上竹子造型和“顺”、“发”字样，寓意节节高升、万事顺意、财运到家，集超高颜值与好彩头于一体。有消费者感慨：“吃汤圆悟出一个道理，长得好看真的可以当饭吃！”</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/RU1O02onjR6qcQAqsNQJ.png\"/></figure><p>IP联名也是今年汤圆市场的一大特色。思念与小马宝莉联名推出的魔法汤圆，礼袋装环比增长282%，同时附赠贴纸、徽章等周边；Loopy联名新品走起了“猎奇”路线，荔枝红茶与羽衣甘蓝茉莉青提两种口味，吸引年轻消费者的味蕾；BDuck小黄鸭联名汤圆则以呆萌可爱的小黄鸭造型，成为亲子家庭的心仪之选。</p><p>汤圆素有“南北甜咸”之争，今年，市面上也出现了一些畅销的咸汤圆。比如湾仔码头猪肉汤圆，内馅选用新鲜猪肉调配而成，鲜香多汁，环比增长超6倍；园外园推出了比乒乓球还大的常州特色荠菜肉大汤团，软糯外皮包裹着满满的荠菜肉馅，是江浙沪地区消费者的心头好；安井四季如春荠菜猪肉汤圆，也同样受到咸汤圆消费者的追捧。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/67rhrrgb4HmxIFUlCYtU.png\"/></figure><p>从传统黑芝麻汤圆，到养生轻糖汤圆、创意造型汤圆、IP联名汤圆百花齐放，一颗小小的汤圆，从造型到口味不断演变，包裹着万千中国人对美好生活的向往，折射出中国家庭消费升级的深层逻辑。京东生鲜依托超级供应链能力，通过精准的消费洞察，持续推动节令食品升级，让传统节令在现代日常中焕发新的温度。元宵节将至，不妨打开京东APP搜索“怪怪汤圆团圆夜”，你想要的汤圆，京东生鲜都有！</p></article>",
            "link": "https://www.iyiou.com/news/202602281122927",
            "pub_date": "2026-02-28 20:20:48",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "赤子基金投资心影医疗",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月28日，赤子基金宣布完成对杭州心影医疗科技有限公司（简称“心影医疗”）的天使轮投资。此次投资旨在支持心影医疗在心脏影像诊断领域的创新研发，推动心血管高端器械的智能化发展。</p><p>心影医疗成立于2025年1月15日，是一家专注于心脏影像诊断服务的高科技企业。公司致力于提供先进的心脏影像诊断技术，为医疗专家提供精准的诊断依据。心影医疗的核心业务包括研发和生产心腔内超声介入器械、心脏彩超及AI辅助影像系统，通过技术创新提升心血管疾病的诊断效率和准确性。</p><p>心影医疗的创始人团队在心脏介入影像领域拥有丰富的研发和临床经验，公司技术团队由多位资深工程师和医学专家组成，确保了产品的高质量和临床适用性。公司成立至今，已获得多项技术专利，并在心脏介入影像领域展现出强大的市场潜力。</p><p>赤子基金作为此次投资方，对心影医疗的技术创新和市场前景表示高度认可。基金负责人表示：“心影医疗在心脏影像诊断领域的创新能力和团队实力令人印象深刻，我们期待通过此次投资，助力公司加速产品研发和市场拓展，为心血管疾病患者提供更优质的诊疗服务。”</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/c3546cc23a08afdec297cc40b762e467/profile?source=iyiou.airzkb\" target=\"_blank\">心影医疗</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602281122926",
            "pub_date": "2026-02-28 20:06:30",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "顺禧基金战略投资耐柯森",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月28日，顺禧基金宣布完成对耐柯森(北京)工业技术有限公司（简称“耐柯森”）的战略投资。此次投资旨在支持耐柯森在亚太区的业务拓展，并加强其在全球制造业中的竞争力。</p><p>耐柯森(北京)成立于2023年2月28日，是法国耐柯森集团亚太区唯一全系列产品生产、销售与服务平台，也是集团全球三大核心制造基地之一。公司坐落于北京怀柔科学城，拥有5000余平米现代化生产基地，致力于为亚太区客户提供高品质的工业技术解决方案。</p><p>耐柯森的成立标志着法国耐柯森集团在亚太区战略布局的重要一步。通过在北京设立生产基地，耐柯森能够更高效地服务亚太区客户，同时利用中国丰富的制造业资源和市场优势，进一步扩大其全球业务版图。</p><p>顺禧基金作为此次投资方，对耐柯森的发展前景表示高度认可。顺禧基金负责人表示：“耐柯森在工业技术领域的专业能力和市场潜力令人印象深刻。我们相信，通过此次战略投资，耐柯森将能够在亚太区市场取得更大的成功，并为全球客户提供更优质的产品和服务。”</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/8b304db87e8d8623508406c4d66cdd5e/profile?source=iyiou.airzkb\" target=\"_blank\">耐柯森</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602281122925",
            "pub_date": "2026-02-28 20:06:32",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "芯问科技获洪山资本Pre-A轮投资",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月27日，上海芯问科技有限公司（简称“芯问科技”）宣布完成洪山资本Pre-A轮投资。此次融资将助力芯问科技在科技推广服务领域的进一步发展。</p><p>芯问科技成立于2020年1月19日，总部位于上海市浦东新区，是一家专注于其他科技推广服务业的创新型企业。公司自成立以来，致力于通过技术创新和高效服务，推动科技领域的进步与发展。芯问科技凭借其独特的商业模式和强大的技术团队，在行业内逐渐崭露头角。</p><p>此次Pre-A轮投资由洪山资本领投，不仅为芯问科技带来了资金支持，更在战略资源、市场拓展等方面提供了重要帮助。洪山资本作为业内知名的投资机构，一直关注科技创新型企业，此次投资也体现了对芯问科技发展潜力的认可。</p><p>芯问科技表示，未来将利用此次融资资金，进一步加大研发投入，优化服务体系，提升市场竞争力，为更多客户提供高质量的科技推广服务。</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/26866b793488b0bbbace8f9ffb5e926a/profile?source=iyiou.airzkb\" target=\"_blank\">芯问科技</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602281122915",
            "pub_date": "2026-02-28 20:01:35",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "桥介数物获奇瑞控股等战略投资",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月27日，足式机器人控制系统研发商桥介数物(深圳)科技有限公司（简称“桥介数物”）宣布完成一轮战略融资。本轮融资由奇瑞控股、沂景投资、深圳天使母基金、钧石创投共同参与投资。</p><p>桥介数物成立于2023年5月29日，是一家专注于足式机器人控制系统研发的高科技企业。该公司研发的足式机器人具备稳定、优雅的行走能力，能够通过复杂地形，并配合机械臂完成操作任务。此外，其机器人还具备在多楼层之间自主导航的功能，展现了强大的环境适应性和智能化水平。</p><p>此次战略投资的完成，将进一步推动桥介数物在足式机器人领域的研发进程，加速产品落地和市场拓展。投资方奇瑞控股、沂景投资、深圳天使母基金及钧石创投的加入，不仅为桥介数物带来了资金支持，更在技术、市场资源等方面提供了全方位的助力。</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/4ebb4b35fbb6635a998ca13b4598cd53/profile?source=iyiou.airzkb\" target=\"_blank\">桥介数物</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602281122914",
            "pub_date": "2026-02-28 20:01:36",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "AI食安巡检员全面上岗！淘宝闪购面向网络餐饮行业开源“白泽”大模型",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>餐饮行业食安治理领域再添一枚重磅AI利器！近日，淘宝闪购正式发布专为餐饮服务与零售门店打造的风控治理垂直领域开源大模型——“白泽”（Ostrakon-VL），并宣布相关技术能力向全行业免费开放。</p><p>借助“白泽”大模型，外卖平台、餐饮及零售企业等行业参与方在图像识别、后厨预警等方面，都能通过人工智能技术快速加强对不合规场景的识别和治理能力，大幅提高数字化治理效率。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/4HIbV2iWuZRbWIL63q1l.png\"/><figcaption>“白泽”的论文已公开发表</figcaption></figure><p>2026年被预期为AI场景应用的全面爆发之年，随着《网络餐饮服务经营者落实食品安全主体责任监督管理规定》的出台，业内越来越关注AI可以如何助力网络餐饮行业提升数字化治理水平。作为首个面向餐饮服务与零售门店场景的多模态大语言模型，“白泽”已经深入参与到了淘宝闪购的日常平台治理中，在商家入驻审核、日常巡检及风险预警等核心场景中发挥关键作用。淘宝闪购会继续加大“白泽”的应用广度和深度，重点攻坚困扰行业的食品安全顽疾。</p><p>比如在明厨亮灶智能巡检方面，“白泽”可以24小时分析后厨直播视频流，自动识别墙面、台面清洁度、垃圾桶是否外溢、生熟食材是否分离、厨师是否佩戴工作帽等食品安全管理细节。白泽识别出违规行为后，系统可以即时生成预警并推送至风控治理团队，实现从“人工抽查”到“全时监控”的转变。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/iVscmOeL1ZE0p8iX9r7u.png\"/><figcaption>“白泽”可以24小时巡检明厨亮灶直播视频流</figcaption></figure><p>针对虚假店铺问题，“白泽”通过多图比对与思维推理技术，将商户环境与工商信息进行比对，模型可自动标记矛盾点，有效遏制“一店多开”和证照不符等违规行为。</p><p>目前，淘宝闪购已支持商家通过上传“一镜到底”的视频，来为其进行“可堂食”打标，“白泽”也能根据视频内容及店铺相关信息，综合判断店铺是否具备真实堂食环境，通过跨帧一致性分析识别视频真伪，防止用静态图片或AI生成视频蒙混过关，确保消费者获得真实的服务体验。</p><p>“白泽”项目负责人夏威介绍，该模型基于阿里云通义千问Qwen3-VL-8B基座进行深度训练调优，针对餐饮、零售门店场景的特殊需求进行了垂直领域适配，在技术性能方面的主要优势是极高的参数效率。根据ShopBench（服务于餐饮和零售门店的公开基准）评测，“白泽”性能评分显著超越同规模基座模型，在强噪声、高异质性的真实门店数据中仍能保持稳健的感知与决策能力。</p><p>目前，“白泽”已经接入淘宝闪购超过100个生产场景，调用量突破10亿级别，Token消耗量已突破万亿级别。更为重要的是，“白泽”的部署成本仅为同类方案的1/20，有助于网络餐饮行业的各参与方以极低成本大规模落地应用。</p><p>为推动行业整体食品安全治理水平提升，淘宝闪购宣布“白泽”相关技术能力向行业免费开放。模型权重与技术报告已通过主流开源平台发布，采用Apache 2.0开源协议，体现了平台以开放心态促进行业风控水平提升的决心。</p><p>据悉，该协议允许任何机构在商业或非商业场景下免费使用，无需支付许可费用，修改后的代码可闭源分发，并明确规定贡献者授予全球性、免版税的专利许可。使用方可根据需求自由部署和修改模型，实现“一次开源，多方受益”。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/41wmKznQja0NUwA7WWzW.png\"/><figcaption>“白泽”已在Hugging Face上开源</figcaption></figure><p>通过开源开放，连锁品牌总部可利用模型管理分店合规情况；各大外卖平台也可借鉴淘宝闪购技术方案提升自身治理能力。“白泽”的问世伴随着AI大模型从通用能力向垂直场景深度赋能的转变，为构建包含平台、商家、社会的食品安全共治格局，提供了新的技术路径。</p><p>淘宝闪购技术相关负责人表示，平台长期以来持续加大AI研发投入，以技术创新守护“舌尖上的安全”，让消费者放心消费，让合规商家获得更有利的经营环境。</p><p> </p></article>",
            "link": "https://www.iyiou.com/news/202602281122901",
            "pub_date": "2026-02-28 16:21:27",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "京东七鲜自有品牌上线Joybuy平台，元宵佳节海外华人吃上“家乡味”",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>近日，京东七鲜通过京东欧洲线上零售业务Joybuy，将数十款七鲜自有品牌商品成功销售至英国市场，为当地华人及对中国文化感兴趣的当地消费者提供了丰富的传统食材和特色商品选择。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/QiuAdGyMli4f1WwFH6ZO.png\"/><figcaption>京东七鲜自有品牌商品交付给海外华人</figcaption></figure><p>此次通过Joybuy销售的京东七鲜自有品牌商品种类繁多，涵盖了从烹饪必备品到休闲零食，再到健康饮品等多个品类。其中，绿豆、红小豆、建宁莲子等传统食材的热销，满足了海外华人制作汤圆等传统节日美食的需求，让他们在异国他乡也能品尝到家的味道。一位在英华人感慨道：“元宵节前通过Joybuy买到了心心念念的绿豆和红小豆，让我在异国也能亲手制作汤圆，这份‘家乡味’太珍贵了！”同时，玉米胚芽油、龙口粉丝、厚切苹果干、魔芋脆贡菜、荔枝气泡酒、黄皮油柑汁等商品，也因其独特的风味和高品质，赢得了英国消费者的青睐。</p><p>国际化始终是京东集团的重要战略方向，近年来加速了物流供应链的全球布局。目前，京东在海外运营的仓库数量已超过130个，总管理面积达130万平方米，并开通了多条国际货运航线。京东旗下欧洲线上零售业务Joybuy已在英国、荷兰、德国、法国、比利时和卢森堡开启试运营，依托于京东的供应链和物流能力，Joybuy已经在英国、德国、荷兰和法国等国家的主要城市，实现了当日达、次日达等高效配送服务，包括送货上门、生鲜冷链配送、大件送装一体及退换货等多元化服务。因此，英国用户通过Joybuy下单京东七鲜自有品牌商品，最快当日即可收货，确保了商品的新鲜度和消费者的购物体验。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/4ckmvME9Vj1wvnnHDvzN.png\"/><figcaption>销售至英国市场京东七鲜自有品牌商品（部分）</figcaption></figure><p>随着京东七鲜自有品牌商品在英国市场的销售成功，接下来，Joybuy会陆续将七鲜自有品牌商品带给荷兰、比利时、卢森堡、法国和德国等更多地区的用户，满足欧洲更多地区消费者日益增长的对中国传统食材和特色商品的需求，也助力中国优质商品走向欧洲更多区域市场。</p><p>对于海外华人而言，京东七鲜商品的引入不仅满足了他们对家乡味道的渴望，更成为了他们与家乡文化情感联系的纽带。七鲜小吊梨汤、茉莉花茶等商品的热销，让海外游子在节日期间重温了传统的节庆习俗。而茅根竹蔗水、栀子乌龙茶等创新饮品，则吸引了更多当地消费者探索东方饮食文化的魅力。</p><figure class=\"image\"><img src=\"https://diting-hetu.iyiou.com/bPXmpfVT2r7M8mcSgbnI.png\"/><figcaption>销售至英国市场京东七鲜自有品牌商品（部分）</figcaption></figure><p>一位用户分享道：“在京东Joybuy买到的小吊梨汤和茉莉花茶，让我想起了家乡的春节习俗。”与此同时，英国本地消费者也对这些独具特色的中国商品表现出浓厚兴趣，尤其是健康饮品和休闲零食类产品，成为他们探索东方风味的新选择。这不仅体现了京东七鲜商品在海外市场的受欢迎程度，也展示了中国品牌在全球范围内的影响力。</p><p>随着中国品牌加速“出海”，京东正凭借其全球超级供应链的实力和创新的服务模式，重塑全球零售格局。从一碗筋道的挂面到一瓶清甜的椰子水，京东七鲜商品在Joybuy的热销，不仅满足了海外华人的思乡之情，也为全球消费者打开了一扇了解中国文化的窗口，展现了跨境电商在促进文化交流与消费升级中的独特价值。</p><p>未来，京东将继续发挥自身全球超级供应链及海外物流网络建设的优势，推动更多优质中国商品走向世界，同时为全球消费者提供更加丰富、便捷的购物体验。</p></article>",
            "link": "https://www.iyiou.com/news/202602281122899",
            "pub_date": "2026-02-28 16:16:02",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "京东集团携手北京市民政局打造养老事业与产业协同发展的“北京标杆”",
            "description": "<article class=\"post-body\" data-v-3f1262b4=\"\"><p>近日，北京市民政局与京东集团就促进首都养老事业与产业协同发展达成战略合作，双方将共同推动养老服务的“线上+线下”深度融合，打造具有首都特色的养老服务体系，培育银发经济、促进养老消费，实现民生改善与产业发展良性循环、相互促进。</p><p>借助此次战略合作，京东还将联合北京市民政局开展“暖阳助老”纸尿裤公益捐赠活动，面向全市100家养老服务机构免费赠送“护理关爱包”，以实际行动支持失能老人照护，提升失能老人生活质量，助力普惠养老事业发展。</p><p>自2021年启动“暖阳行动”以来，京东持续深化助老服务，始终将助老服务作为企业社会责任的重要组成部分，依托强大的供应链体系和科技创新能力，构建起覆盖商品、服务、情感支持等多维度的综合助老体系。以此次战略合作为契机，京东将统筹家政服务、医疗健康、家电家居、品质外卖、酒店旅游等业务，依托京东APP打造居家社区养老一站式服务平台，通过设置养老服务专门板块、推出适老化页面等措施，提升老年用户的使用体验。</p><p>为满足社会日益增长的多元养老服务需求，京东家政率先开设养老特色服务课程，涵盖饮食、起居、助浴等老年人生活照料标准作业流程、健康监测流程、应急处置流程、老年人心理关怀流程，以及居家康复流程。此前，京东家政已在日常保洁、家电清洗、维修、洗衣及整理收纳等基础服务领域，帮助老年家庭解决日常清洁难题，不仅降低老年人独自劳动的风险，还在服务过程中更加注重适老化设计，采用专业工具与温和清洁剂，并支持老人子女远程代下单，满足老年人在行动便利性、安全性与隐私保护等方面的实际关切。作为家政行业唯一拥有成熟培训体系的平台，京东家政也在日前宣布未来3年投入10亿培训建设资金，重点聚焦高标准养老护理课程研发，加强养老服务人才培养，进而推出标准、规范、安全的养老特色服务。</p><p>在专业服务领域，京东健康持续深耕线上“医、检、诊、药”服务闭环，助力老年人足不出户便可享受一站式的医疗健康体验。依托京东互联网医院老年病中心，京东健康联合全国三甲医院多学科专病专家，将优质医疗资源普惠更多老年群体，全面覆盖老年阶段核心健康问题，助力老年群体实现更便捷的长周期综合诊疗、健康管理，关爱老年群体身心健康；京东护士到家服务持续拓展，服务对象中近六成为老年人，入驻平台的执业护士人数已超过万人，大部分拥有三级及以上医院从业背景，累计服务家庭数十万户，目前服务项目已扩展至7大类64项，为老年人提供专业、便捷的到家护理服务。京东健康能够为老年用户提供慢病用药、健康监测、康复理疗、营养补充等全品类、专业化的健康养老商品，更有药师、营养师7X24小时在线，以及送装一体、上门验配等贴心服务，为银发人群提供更专业的健康指导建议。此外，京东健康还承接了全国多地的适老消费补贴，为老年用户提供更多切实健康福利。未来，双方将依托京东健康丰富的医疗服务资源和强大的医疗健康商品供应链，打造医养结合的服务模式，致力打造更专业友好的健康养老产品与服务新生态。</p><p>京东七鲜小厨将积极开展养老助餐服务，利用自身供应链优势开展线下点餐用餐、线上点餐送餐服务，系统解决当前养老助餐痛点问题，同时推出团体餐、长期餐等多样化服务，满足不同老年群体就餐需求。目前，七鲜小厨已成为北京首家正式备案的线上专供养老助餐点，率先打通北京市养老助残卡线上支付功能，部分门店同步上线“长辈专区”，为老年人提供便捷的线上订餐与配送服务。此外，依托于活跃在城市社区的配送人员，七鲜小厨还将探索在送餐同时对用餐老年人开展巡视探访，增强社区关爱老年人力量。此外，京东酒旅业务将积极推动旅居养老模式，提供适合老年人及其家庭同游的旅居产品，满足不同家庭异地养老需求，助力旅居养老产业高质量发展，推动“文旅+养老”协同创新。</p><p>针对老年人无法熟练操作智能手机的这一痛点，京东3C数码联合厂商，通过C2M（反向定制）模式打造大屏AI手机全新产品。聚焦老年人用机场景，从软件到硬件进行产品创新优化，让手机使用更简单。其中，AI语音操控、AI识别方言、远程协助、AI防诈等功能，让老年人也能便捷使用AI功能。同时大尺寸屏幕也能保障老年人可以看得清，配合耐摔、可靠、耐用、长续航的特性，京东大屏AI手机为老年人解决切实难题。此外，大屏AI手机WIKO X70更是首次搭载京东旗下的万能数字人助手“东东”APP，融合智能问答、健康问诊、外卖购物与创意生成等功能，老人使用这款手机可以享受便捷、智能的生活体验。</p><p>京东家电家居业务也在积极开展基础硬装改造、家居适老化、智能产品配备等服务，着力打造安全便利舒适的居家养老生活环境。目前，京东家电家居适老产品供给同比增长超100%，已拓展适老品类87个，覆盖品牌超3000个，适老商品数量超50万款。此外，京东还系统梳理老年人在起居、沐浴、出行、烹饪、家务、娱乐、安全等七大生活场景中的真实痛点与需求，联合中国标准化协会及行业领军品牌共同推动适老产品的标准化升级。京东也将利用京东MALL等线下大型商业体，设立适老商品体验区、样板间，开展适老专项活动，组织健康咨询、现场诊疗等活动，提升老年群体消费体验。</p><p>聚焦失能老年人皮肤脆弱、纸尿裤尺码难选等问题，京东超市推出了“过敏无忧”和“尺码随心换”两项贴心服务。消费者选购带有相关标识的自营商品，在使用过程中如出现过敏、尺码不合适的情况，可在线申请退换货服务，确保产品切实贴合老人实际需求、降低试错成本。</p><p>京东京造推出专为老年人设计的AI陪伴玩具“唠唠鹦”，通过智能化功能解决老年人在数字时代面临的陪伴与健康守护需求。特别配备一键紧急呼救按钮，遇突发情况可直接联系预设家人或社区服务，并联动京东健康平台，提供快速响应。</p><p>针对老年人的寄递需求，京东快递也在此前行业首个适老寄件服务基础上，对“长辈版”服务进行优化升级，不仅界面采用超大字体，首页也新增了更为实用的“电话寄件”入口，只需一个电话，专属客服不仅可以代长辈下单，还能全程查件、解答各类快递问题，实现真正的全流程陪伴。从2021年初，京东就成立了长辈专属客服团队，日常专门负责接线长辈用户，提供7*24小时全时段语音及在线服务，已帮助上千万老人解决消费以及生活中的难题。</p><p>此外，京东还将基于自身技术服务能力和先进经验，积极配合北京市民政局在养老等民政各业务场景的技术革新与数字化改造升级；双方还将以适老化产品标准和养老服务规范为基础，结合养老行业整体情况，制定完善适老化产品和养老服务相关行业标准，保障行业规范发展。</p></article>",
            "link": "https://www.iyiou.com/news/202602281122890",
            "pub_date": "2026-02-28 14:11:34",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Emed Technologies获战略投资",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月27日，美国药物递送和创新输液治疗设备研发商Emed Technologies宣布完成新一轮战略投资。此次投资旨在支持公司进一步研发和推广其用于皮下输液系统的医疗器械，以满足全球日益增长的家庭护理和慢性病管理需求。</p><p>Emed Technologies成立于1990年，是一家专注于药物递送技术的企业。公司致力于开发高效且安全的皮下输液系统，其产品包括SCIg60、Infuset、VersaRate等，广泛应用于免疫球蛋白治疗及其他注射治疗领域。这些设备特别适用于需要长期家庭护理或慢性病管理的患者，能够显著提升治疗的安全性和便捷性。</p><p>此次战略投资将帮助Emed Technologies加速产品研发进程，扩大生产规模，并进一步拓展全球市场。公司表示，未来将继续聚焦于创新药物递送技术，为患者提供更优质的治疗方案。</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/20b0ea83af59d90f1ef98681572955e6/profile?source=iyiou.airzkb\" target=\"_blank\">Emed Technologies</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602281122889",
            "pub_date": "2026-02-28 14:06:23",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "微创再生获深创投、苏州国发创投A轮投资",
            "description": "<article class=\"post-body drg\" data-v-3f1262b4=\"\"><p>2026年2月27日，苏州微创再生医学科技有限公司（简称“微创再生”）宣布完成A轮融资。本轮融资由深创投和苏州国发创投联合投资，具体融资金额未披露。</p><p>微创再生成立于2021年12月8日，是一家专注于组织工程与再生医学技术研发的高科技企业。公司致力于生物材料、组织工程及再生医学领域的技术创新，重点攻关骨、皮肤、软骨、神经、口腔及运动医学等组织修复关键技术。通过自主研发和合作研发，微创再生已形成多项核心技术，旨在为临床提供高效、安全的组织修复解决方案。</p><p>本轮融资将主要用于微创再生的研发团队扩充、技术平台升级以及临床试验推进。深创投和苏州国发创投的加入，不仅为微创再生提供了资金支持，还将为其带来丰富的行业资源和战略指导，助力公司在再生医学领域加速发展。</p><p>投资方深创投表示，微创再生在再生医学领域的创新能力和技术储备令人印象深刻，未来有望成为该领域的领军企业。苏州国发创投也表示，将继续支持微创再生的发展，推动其技术成果的产业化落地。</p><p>更多文中提及企业信息请点击链接：<a href=\"https://data.iyiou.com/company/details/7363cfadc5c559be8faba0278216c09e/profile?source=iyiou.airzkb\" target=\"_blank\">微创再生</a></p><p style=\"color:#999\"><i>本文由小欧AI基于亿欧数据生成，如有问题及建议，欢迎通过网站底部联系方式和我们联系。</i></p></article>",
            "link": "https://www.iyiou.com/data/202602281122888",
            "pub_date": "2026-02-28 14:06:24",
            "source": "iyiou",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}