{
    "data": [
        {
            "title": "Central Banks Go on a Gold Buying Spree in 2024: A $96 Billion Surge That Signals a Safe Haven Strategy",
            "description": "<div class=\"digest-article-content\">\n<p>In a remarkable twist in the world of finance, central banks worldwide have acquired a staggering amount of gold in 2024, totaling around $96 billion. This buying spree, which involved 1,045 metric tons of the precious metal, highlights an increasing trend identified by the World Gold Council (WGC) in their Gold Demand Trends report.</p><p>Leading the charge were countries such as Poland, India, and Turkey, driving what the WGC has labeled an \"eye-watering pace\" of gold accumulation. This surge in central bank purchases has pushed the total recorded gold purchases to a historic high of 4,974 tons, despite a noticeable dip in jewelry consumption attributed to soaring prices.</p><p>Interestingly, central banks have been net buyers of gold for a continuous stretch of 15 years, but the rhythm of accumulation has accelerated dramatically since the onset of the Ukraine conflict. The geopolitical arena has prompted many monetary authorities to rethink their dependency on assets pegged to the US dollar. John Reade, a senior market strategist at the WGC, expressed surprise at this insatiable demand, noting that their expectations at the year's outset were exceeded, with central banks collectively purchasing over a thousand tons in the past year alone.</p><p>The continuing appetite for gold isn't merely a flash in the pan; according to the report, uncertainty on geopolitical and economic fronts remains high as we step into 2025, reinforcing the notion that central banks will once again regard gold as a secure strategic asset. This was reflected in gold prices, which saw an impressive ascent of 27% over the year as investors sought refuge from conflicts in Ukraine and the Middle East, while simultaneously adjusting to anticipated cuts in interest rates.</p><p>On the flip side, the demand for gold jewelry saw a decline, diminishing by 11% to 1,877 tons, much of which can be attributed to reduced consumption in China. This trend marks a significant shift, as for the second time in three years, jewelry demand in China has fallen behind that of India. The decline illustrates a broader issue: weaker consumer demand amid rapidly rising prices.</p><p>The WGC projects that central banks will maintain their dominant role in the gold market, potentially spurring gold ETF investors to join in. While jewelry demand is expected to face ongoing pressure, an increase in the recycling of gold could provide some counterbalance to supply challenges. Mine output is anticipated to remain strong, further contributing to the market dynamics.</p><p>Reade pointed out an interesting paradox: although jewelry sales are waning, investment demand in China has actually risen. He noted, \"China remains the biggest gold market. Although there was a significant drop in jewelry demand, the investment side has seen growth.\" This trend could serve as a rudimentary gauge of economic sentiment in China.</p><p>For traders, this burgeoning interest from central banks not only signifies a strong demand for gold but underscores the importance of safe-haven assets in today's financially tumultuous landscape. As the world continues to grapple with uncertainty, gold could very well be the go-to asset, presenting unique trading opportunities for those proficient in navigating market shifts.</p>\n</div>",
            "link": "https://stockinvest.us/digest/central-banks-go-on-a-gold-buying-spree-in-2024-a-96-billion-surge-that-signals-a-safe-haven-strategy",
            "pub_date": "2025-02-05 20:45:59",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Natural Gas Prices Surge in Northern Europe: Could Coal Be Making a Comeback?",
            "description": "<div class=\"digest-article-content\">\n<p>In a surprising twist for energy markets, northern Europe has seen a significant uptick in natural gas usage, driving prices to levels not seen in nearly two years. According to observations made by market analyst Gavin Maguire, countries like Germany, the United Kingdom, the Netherlands, and Poland reported gas consumption rising by more than 10% year-over-year in January 2025. This surge is noteworthy, as it marks the highest monthly gas output since 2022, a period when the region was grappling with supply disruptions following geopolitical tensions.</p><p>However, as the cost of natural gas escalates, an interesting shift is anticipated. The rising prices have now outpaced those of coal, compelling certain power companies to consider switching back to coal-fired generation to mitigate soaring operational costs. This scenario is particularly relevant in Germany and Poland, where coal has traditionally played a significant role in the energy mix.</p><p>Recent figures highlight that gas prices at the TTF hub—the Netherlands' main pricing facility—averaged €48.36 per megawatt-hour in January 2025. This figure amounts to a 40% increase compared to 2024 and a staggering 60% jump from January 2024, reflecting a robust demand for gas. Yet, this rise in prices poses a dual challenge: while it pressures energy producers to find ways to curb costs, it simultaneously raises concerns about increased carbon emissions as coal becomes a more attractive option once again. Coal produces almost double the carbon dioxide for each unit of electricity generated when stacked against natural gas.</p><p>The market dynamics suggest that power suppliers in this region may look to leverage coal generation as a cost-effective solution amidst rising gas prices. Data indicates that gas prices have consistently surpassed the coal-switching price since mid-2024, setting the stage for a potential rebound in coal's dominance in the energy sector. In fact, the price difference between gas and coal has widened significantly—averaging nearly €13/MWh over the coal-switching price so far this year.</p><p>For power generation entities, this situation is less about a straightforward choice between gas and coal; rather, it's a matter of balancing both resources against the backdrop of regulatory pressures and consumer demands. The forward projections for gas prices suggest they will remain above the coal-switching point for some time, potentially extending into 2026 before a downturn is expected.</p><p>Power companies in the UK face a unique dilemma as they have already shuttered their last coal-fired plant, leaving them to rely heavily on renewables such as wind power to meet demands. This may provide some relief against increasing gas reliance, especially since initiatives are underway to boost renewable energy output in the coming months.</p><p>Overall, while the initial data reflects a strong gas consumption trend, the evolving landscape of energy pricing could lead to a notable shift back towards coal, raising eyebrows among environmental advocates. For traders, this energy duality offers a fertile ground for speculation, but it's essential to keep an eye on the broader implications of these shifts—both economically and ecologically.</p>\n</div>",
            "link": "https://stockinvest.us/digest/natural-gas-prices-surge-in-northern-europe-could-coal-be-making-a-comeback",
            "pub_date": "2025-02-05 20:45:59",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Disney Posts Strong Earnings, Stock Rises Despite Disney+ Subscriber Dip",
            "description": "<div class=\"digest-article-content\">\n<p>The Walt Disney Company (NYSE: DIS) reported a <strong>5% revenue increase</strong> to <strong>$24.7 billion</strong> for the quarter ended December 28, 2024, driven by gains in entertainment and theme parks. <strong>Net income surged to $2.6 billion</strong>, up from $1.9 billion a year ago, with <strong>earnings per share (EPS) of $1.76</strong>, beating analyst expectations of $1.45.</p><p>Disney's <strong>entertainment division saw a 9% revenue boost to $10.9 billion</strong>, fueled by theatrical success and streaming growth. The <strong>sports segment returned to profitability</strong>, while <strong>parks and experiences revenue rose 3% to $9.4 billion</strong>, though domestic park performance softened.</p><p>Despite strong financials, <strong>Disney+ lost 700,000 subscribers</strong>, bringing its total to <strong>125 million</strong>, though <strong>overall streaming subscriptions (Disney+ and Hulu) increased to 178 million</strong>.</p><p>The company reaffirmed its full-year outlook, expecting <strong>high-single-digit EPS growth</strong>, aligning with FactSet's projected <strong>8.9% rise</strong>. Disney shares climbed <strong>2.6% in premarket trading</strong> following the report.</p>\n</div>",
            "link": "https://stockinvest.us/digest/disney-posts-strong-earnings-stock-rises-despite-disney-subscriber-dip",
            "pub_date": "2025-02-05 20:20:52",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DeepSeek AI's Rise Sparks Market Selloff: What Investors Need to Know",
            "description": "<div class=\"digest-article-content\">\n<p>Shares of AI-related stocks, particularly chipmakers like Nvidia (NASDAQ: <a href=\"https://stockinvest.us/stock/NVDA\"><strong>NVDA</strong></a>), Broadcom (NASDAQ:<a href=\"https://stockinvest.us/stock/AVGO\"><strong>AVGO</strong></a>), and AMD (NYSE:<a href=\"https://stockinvest.us/stock/AMD\"><strong>AMD</strong></a>), saw a sharp decline this week after the sudden surge in popularity of DeepSeek, a Chinese AI startup. DeepSeek’s app, which hit #1 in Apple's iPhone store, overshadowed even ChatGPT, though it didn’t make the top 10 on Google Play. This has raised questions about the AI industry and sparked fears among investors.</p><h3 id=\"what-is-deepseek\">What is DeepSeek?</h3><p>Founded in 2023 by hedge fund manager Liang Wenfeng in Hangzhou, China, DeepSeek has been making waves with its AI models. The company’s latest model, R1, released last week, is said to rival OpenAI’s ChatGPT in performance. </p><p>Notably, its V3 model, which debuted in December, was developed in just two months for under $6 million. This rapid development stands in contrast to the massive investments made by U.S. companies like OpenAI and Meta Platforms (META) in building their AI systems.</p><p>The speed and cost-efficiency of DeepSeek’s AI models have sparked concerns among investors. They worry that the startup’s success could undermine the financial assumptions that U.S. companies and investors have relied on for AI development. If DeepSeek can create competitive AI with such low costs, it could reshape how AI models are developed globally. This potential disruption is what’s driving the market selloff.</p><h3 id=\"impact-on-ai-stocks-and-the-market\"><strong>Impact on AI Stocks and the Market</strong></h3><p>The stock market felt the shockwave of DeepSeek’s success. The Nasdaq dropped over 3% on Monday, with AI-related stocks taking the hardest hit. Shares of major chipmakers like Nvidia, Broadcom, and AMD fell, alongside those of their international partners like Taiwan Semiconductor Manufacturing Company (NYSE:<a href=\"https://stockinvest.us/stock/TSM\"><strong>TSM</strong></a>). The PHLX Semiconductor Index (SOX) plunged more than 9%. Even energy stocks, which had soared on the belief that AI would drive increased demand, saw a drop.</p><p>While some sectors, like consumer staples, saw gains, the broader market sentiment was dampened by the fear of competition from DeepSeek and similar companies. This fear was compounded by the reality that DeepSeek’s rise may signal that AI development doesn’t require the expensive infrastructure that investors once believed was necessary.</p><h3 id=\"analysts-push-back-on-fears\">Analysts Push Back on Fears</h3><p>Despite the panic, not all analysts agree with the market’s overreaction. Bernstein’s Stacy Rasgon called the response “overblown” and maintained an “outperform” rating for Nvidia’s stock, suggesting that the selloff could present a buying opportunity. Citi analysts also backed Nvidia, believing that AI companies will continue to rely on its chips.</p><p>Analysts from Wedbush, however, were more skeptical about DeepSeek’s ability to challenge U.S. companies on a large scale. They pointed out that while DeepSeek’s models may be impressive for consumer use, building broader AI infrastructure is another matter entirely.</p><h3 id=\"summary\"><strong>Summary: </strong></h3><p>DeepSeek’s rise underscores the rapidly evolving landscape of AI, where new competitors can emerge quickly and disrupt expectations. While some analysts caution that the recent market panic may be exaggerated, investors should keep an eye on how the competition between Chinese and U.S. AI companies unfolds. </p>\n</div>",
            "link": "https://stockinvest.us/digest/deepseek-ais-rise-sparks-market-selloff-what-investors-need-to-know",
            "pub_date": "2025-02-04 20:15:57",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Will These Transport Companies Beat Estimates Tomorrow?",
            "description": "<div class=\"digest-article-content\">\n<p>As the transport sector gears up for earnings announcements on January 23, traders are keen to see if United Pacific (UNP), American Airlines (AAL), and CSX can beat Wall Street expectations. </p><p>These companies are navigating varied market dynamics, from freight market challenges to rising passenger demand. Here's a closer look at their performance outlook, key estimates, and what traders should watch for.</p><h3 id=\"united-pacific-nyseunp\">United Pacific (NYSE:<a href=\"https://stockinvest.us/stock/UNP\"><strong>UNP</strong></a>)</h3><p>United Pacific's fourth-quarter 2024 results are under pressure from freight market headwinds and a weaker consumer market. However, some optimism has emerged. The Zacks Consensus Estimate for earnings per share (EPS) has edged up 0.4% in the past 60 days to $2.78. If achieved, this would represent a modest 2.6% year-over-year increase.</p><p>Revenue expectations, however, are less favorable. Consensus pegs fourth-quarter revenue at $6.15 billion, suggesting a slight 0.2% decline from the same quarter last year. Investors will focus on how well the company managed to control costs amid these challenges.</p><h3 id=\"american-airlines-nasdaqaal\">American Airlines (NASDAQ:<a href=\"https://stockinvest.us/stock/AAL\"><strong>AAL</strong></a>)</h3><p>American Airlines is riding the tailwind of strong passenger demand, particularly in domestic and international markets. Favorable ticket pricing has also bolstered revenues. The Zacks Consensus Estimate for fourth-quarter earnings has surged by 60% over the past two months to $0.64 per share, an impressive 120.7% increase from a year ago.</p><p>Revenue projections are equally promising. Analysts expect $13.4 billion in revenues, up 2.7% year-over-year. The key question is whether AAL can sustain profitability while navigating higher costs, including fuel and labor expenses.</p><h3 id=\"csx-corporation-nysecsx\">CSX Corporation (NYSE:<a href=\"https://stockinvest.us/stock/CSX\"><strong>CSX</strong></a>)</h3><p>For CSX, weaker coal markets and lower freight volumes are a drag on performance. Analysts have trimmed earnings estimates slightly to $0.43 per share, down from $0.44. This reflects a modest decline from the prior year.</p><p>Revenue expectations also indicate a slowdown. Consensus estimates point to $3.58 billion, representing a 2.6% year-over-year drop. Fuel price declines offer some relief, but weaker freight demand may limit upside potential.</p>\n<!--kg-card-begin: html-->\n<div class=\"digest-article-table-parent\">\n<table>\n<thead>\n<tr>\n<th>Company</th>\n<th>EPS Estimate</th>\n<th>% Change in EPS</th>\n<th>Revenue Estimate</th>\n<th>% Change in Revenue</th>\n<th>Reporting Time</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>United Pacific</td>\n<td>$2.78</td>\n<td>+2.6%</td>\n<td>$6.15B</td>\n<td>-0.2%</td>\n<td>Before market open</td>\n</tr>\n<tr>\n<td>American Airlines</td>\n<td>$0.64</td>\n<td>+120.7%</td>\n<td>$13.4B</td>\n<td>+2.7%</td>\n<td>Before market open</td>\n</tr>\n<tr>\n<td>CSX Corporation</td>\n<td>$0.43</td>\n<td>-2.3%</td>\n<td>$3.58B</td>\n<td>-2.6%</td>\n<td>After market close</td>\n</tr>\n</tbody>\n</table>\n</div>\n<!--kg-card-end: html-->\n</div>",
            "link": "https://stockinvest.us/digest/will-these-transport-companies-beat-estimates-tomorrow",
            "pub_date": "2025-02-04 20:15:57",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AMD Earnings Report: Can the Chipmaker Maintain Momentum Amid Mixed Market Signals?",
            "description": "<div class=\"digest-article-content\">\n<p>As traders eagerly await the earnings announcement from Advanced Micro Devices, Inc. (NASDAQ: <a href=\"https://stockinvest.us/stock/AMD\">AMD</a>), scheduled for release today after market close, there are several key indicators to keep on your radar.</p>\n<!--kg-card-begin: html-->\n<div class=\"digest-article-table-parent\">\n<table>\n<tr>\n<th>Indicator</th>\n<th>Value</th>\n</tr>\n<tr>\n<td>Earnings Report</td>\n<td>Today after market close</td>\n</tr>\n<tr>\n<td>Previous Revenue</td>\n<td>$6.82B (17.6% growth)</td>\n</tr>\n<tr>\n<td>Predicted Revenue</td>\n<td>$7.54B (22.3% growth)</td>\n</tr>\n<tr>\n<td>EPS (Current Quarter)</td>\n<td>$1.09</td>\n</tr>\n<tr>\n<td>AMD Share Price Drop (Last Month)</td>\n<td>-12.6%</td>\n</tr>\n<tr>\n<td>Analysts' Price Target</td>\n<td>$169.82</td>\n</tr>\n<tr>\n<td>Current AMD Price</td>\n<td>$113.30</td>\n</tr>\n</table>\n</div>\n<!--kg-card-end: html-->\n<p>In the previous quarter, AMD managed to exceed revenue expectations, reporting earnings of $6.82 billion—a 17.6% increase compared to the same period last year. However, despite this triumph, the company's revenue guidance fell short of analysts’ forecasts. This slight hiccup poses a question for investors: should they consider AMD a buy or sell as the earnings report approaches? For a detailed analysis, feel free to explore our comprehensive insights!</p><p>For this quarter, analysts predict AMD’s revenue will climb 22.3% year over year, reaching $7.54 billion. This projection marks a notable uptick from the 10.2% growth observed in the same quarter last year, while adjusted earnings are expected to settle at $1.09 per share. The general consensus among analysts has remained optimistic in the past month, reinforcing the belief that AMD will maintain its momentum as it heads into earnings. However, it's worth noting that the company has missed Wall Street’s revenue estimates on two occasions over the past two years.</p><p>Shifting our focus briefly to AMD's competitors within the processors and graphics chip market, we see a mixed bag of results. For instance, Qorvo reported a 14.7% year-on-year revenue decline but managed to surpass analysts' expectations, leading to no significant change in their stock price. Conversely, Allegro MicroSystems faced a steeper revenue drop of 30.2%, yet its stock rose by 5.4% following its earnings call.</p><p>Looking at the broader market context, 2024 has been a robust year thus far, with the Federal Reserve successfully battling inflation without triggering a recession—a phenomenon affectionately termed a \"soft landing.\" With interest rates now on the decline and political dynamics shifting with the approaching presidential election in November 2024, market sentiment continues to tilt upward, albeit with some volatility. Despite some processors and graphics chips showing promising progress, the sector as a whole has seen an average drop of 4.7% in share prices over the last month. AMD, specifically, has declined by 12.6% during this period. Nevertheless, analysts maintain a favorable outlook, with an average price target set at $169.82 compared to AMD’s current share price of $113.30.</p>\n</div>",
            "link": "https://stockinvest.us/digest/amd-earnings-report-can-the-chipmaker-maintain-momentum-amid-mixed-market-signals",
            "pub_date": "2025-02-04 20:15:57",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's 15% Tariff on U.S. Coal: What Traders Need to Know Amid Global Supply-Demand Dynamics",
            "description": "<div class=\"digest-article-content\">\n<p>China has announced a 15% tariff on U.S. coal imports in response to the 10% tariffs the U.S. imposed on various Chinese goods. This decision directly impacts the global commodities market, particularly the coal trade between the two countries.</p><p>According to the analytical insights from Citi (NYSE:<a href=\"https://stockinvest.us/stock/C\"><strong>C</strong></a>), the export dynamics of U.S. coal present a nuanced picture. Last year, the United States shipped approximately 46.3 million tons of thermal coal, with a modest 7%—or about 3.4 million tons—headed to China. In the grand scheme of the global coal trade, which is estimated at 1,146 million tons, this accounted for a mere 0.3%. Dominating the U.S. coal export landscape are countries like India, Japan, South Korea, and various European and African nations, who are significantly snapping up thermal coal.</p><p>When it comes to metallurgical coal, utilized primarily in steel production, the U.S. exported around 50.2 million tons in 2024, with China absorbing approximately 10.7 million tons, a substantial 21% of that total. However, this still represented only 2.8% of worldwide metallurgical coal trade, which stands at about 380 million tons. Other notable markets for U.S. metallurgical coal include India, Brazil, Europe, Japan, and South Korea.</p><p>China's dependence on U.S. coal varies significantly between these coal types. For thermal coal, U.S. imports represent a mere 0.8% of China’s total thermal coal imports, which totaled 432.8 million tons in 2024. The majority of China’s thermal coal is sourced from countries like Indonesia, Australia, Russia, and Mongolia. On the other hand, the U.S. serves as a more critical supplier for metallurgical coal, making up about 9% of China's imports in that category.</p><p>Citi analysts suggest that the broader impact of these tariffs on coal prices may be limited. With ample supply in both thermal and metallurgical coal markets, any price fluctuations may turn out to be modest at best. Thus, for stock traders focusing on the coal sectors or companies such as Peabody Energy Corporation (NYSE:<a href=\"https://stockinvest.us/stock/BTU\"><strong>BTU</strong></a>) or Arch Resources, Inc. (NYSE:<a href=\"https://stockinvest.us/stock/ARCH\"><strong>ARCH</strong></a>), this might be a time to proceed with caution, keeping an eye on global supply-demand dynamics rather than reacting hastily to tariff news.</p>\n</div>",
            "link": "https://stockinvest.us/digest/chinas-15-tariff-on-us-coal-what-traders-need-to-know-amid-global-supply-demand-dynamics",
            "pub_date": "2025-02-04 20:05:46",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ferragamo Shares Tumble 5% Amid CEO Shake-Up: What Traders Need to Know",
            "description": "<div class=\"digest-article-content\">\n<p>In a notable shift within the luxury fashion industry, shares of <strong>Ferragamo</strong> (MIL:<a href=\"https://stockinvest.us/stock/SFER.MI\"><strong>SFER</strong></a>) fell by over 5% following the announcement of Marco Gobbetti’s departure as CEO, effective next month. Gobbetti, who took the helm just over three years ago, has been tasked with revitalizing the famed Florentine brand, yet the progress has not quite met the expectations of stakeholders.</p><p>Analysts from Equita suggest that this transition may carry some immediate negative impacts. They point out that uncertainties surrounding the brand’s new phase of relaunch could affect both the creative team and higher management. Gobbetti's exit is perceived as a possible reflection of unsatisfactory results and slower-than-anticipated progress in reviving Ferragamo's market presence. Since his arrival in early 2022, Gobbetti had announced ambitious plans for a swift turnaround, but by the end of last year, he had cautioned that achieving these goals could take longer than planned.</p><p>Compounding the uncertainty, Ferragamo has embarked on a search for a new CEO who will be pivotal in continuing the brand's efforts toward renewing its image and enhancing its heritage. This shift occurs at a challenging time, with Ferragamo’s share price having decreased about 38% over the last year, recently hitting record lows in December.</p><p>Interestingly, some analysts at Barclays view Gobbetti's departure as potentially positive, given Ferragamo's past underperformance compared to its industry peers. With the market reacting so dramatically, traders may need to consider the implications of leadership changes combined with operational strategies aimed at brand recovery. Navigating this terrain will demand a vigilant eye on further developments within Ferragamo, including who will step into the CEO role and what strategies they will pursue.</p>\n</div>",
            "link": "https://stockinvest.us/digest/ferragamo-shares-tumble-5-amid-ceo-shake-up-what-traders-need-to-know",
            "pub_date": "2025-02-04 20:01:00",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "February 4, 2025: Google, Toyota, and More Reveal Earnings – What to Expect",
            "description": "<div class=\"digest-article-content\">\n<p>Here’s a rundown of the companies set to report their earnings today, February 4, 2025. <br/><br/>Each of these organizations will provide insights into their financial performance and future guidance, impacting market sentiment and stock movements.</p>\n<!--kg-card-begin: html-->\n<table>\n<tbody><tr>\n<td><strong>Company</strong></td>\n<td><strong>Ticker</strong></td>\n<td><strong>When</strong></td>\n<td><strong>Exchange</strong></td>\n<td><strong>Market Cap (in B)</strong></td>\n<td><strong>Consensus EPS</strong></td>\n<td><strong>Earnings Date</strong></td>\n<td><strong>Ending Fiscal Quarter</strong></td>\n</tr>\n<tr>\n<td>Google</td>\n<td><a href=\"https://stockinvest.us/stock/GOOGL\">GOOGL</a></td>\n<td>AMC</td>\n<td>NASDAQ</td>\n<td>2,472.0</td>\n<td>2.12</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Google</td>\n<td><a href=\"https://stockinvest.us/stock/GOOG\">GOOG</a></td>\n<td>AMC</td>\n<td>NASDAQ</td>\n<td>2,470.0</td>\n<td>2.12</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Toyota Motor Corp Ltd Ord</td>\n<td><a href=\"https://stockinvest.us/stock/TM\">TM</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>251.1</td>\n<td>4.36</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Toyota Motor Corp Ltd Ord</td>\n<td><a href=\"https://stockinvest.us/stock/TM\">TM</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>251.1</td>\n<td>4.36</td>\n<td>2025-02-04</td>\n<td>Sep, 2025</td>\n</tr>\n<tr>\n<td>Merck</td>\n<td><a href=\"https://stockinvest.us/stock/MRK\">MRK</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>250.3</td>\n<td>1.85</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Pepsico</td>\n<td><a href=\"https://stockinvest.us/stock/PEP\">PEP</a></td>\n<td>BMO</td>\n<td>NASDAQ</td>\n<td>206.2</td>\n<td>1.95</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Advanced Micro Devices</td>\n<td><a href=\"https://stockinvest.us/stock/AMD\">AMD</a></td>\n<td>AMC</td>\n<td>NYSE</td>\n<td>192.9</td>\n<td>1.07</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Amgen Inc.</td>\n<td><a href=\"https://stockinvest.us/stock/AMGN\">AMGN</a></td>\n<td>AMC</td>\n<td>NASDAQ</td>\n<td>155.3</td>\n<td>5.04</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Pfizer</td>\n<td><a href=\"https://stockinvest.us/stock/PFE\">PFE</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>152.5</td>\n<td>0.48</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>KKR &amp; Co LP</td>\n<td><a href=\"https://stockinvest.us/stock/KKR\">KKR</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>148.2</td>\n<td>1.30</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n</tbody></table>\n<!--kg-card-end: html-->\n</div>",
            "link": "https://stockinvest.us/digest/february-4-2025-google-toyota-and-more-reveal-earnings-what-to-expect",
            "pub_date": "2025-02-04 20:01:00",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Merger Talks Stir Minor Market Ripples as Airbus and Leonardo See Slight Share Declines",
            "description": "<div class=\"digest-article-content\">\n<p>In today's trading session, shares of Airbus (PAR:<a href=\"https://stockinvest.us/stock/AIR.PA\"><strong>AIR</strong></a>) and Leonardo (BIT: LDO) experienced slight declines, slipping by 0.5% and 1.6% respectively. This downward movement comes amidst reports of ongoing merger discussions aimed at consolidating Airbus' space division with Thales’ Alenia Space, a joint venture between Thales and Leonardo. The goal of this potential merger appears to be a strategic response to the notable excess capacity within the space sector.</p><p>While many traders might brace for significant changes from such corporate maneuvers, the financial implications seem to be on the modest side, as indicated by analyst estimates. According to analysts at Citigroup, the expected financial benefits from this merger would only impact the involved companies slightly, projecting up to €110 million in savings—just around 1% of Airbus' projected EBIT for 2024, with Leonardo and Thales anticipating similarly marginal boosts.</p>\n</div>",
            "link": "https://stockinvest.us/digest/merger-talks-stir-minor-market-ripples-as-airbus-and-leonardo-see-slight-share-declines",
            "pub_date": "2025-02-04 18:50:56",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        }
    ]
}