{
    "data": [
        {
            "title": "DeepSeek AI's Rise Sparks Market Selloff: What Investors Need to Know",
            "description": "<div class=\"digest-article-content\">\n<p>Shares of AI-related stocks, particularly chipmakers like Nvidia (NASDAQ: <a href=\"https://stockinvest.us/stock/NVDA\"><strong>NVDA</strong></a>), Broadcom (NASDAQ:<a href=\"https://stockinvest.us/stock/AVGO\"><strong>AVGO</strong></a>), and AMD (NYSE:<a href=\"https://stockinvest.us/stock/AMD\"><strong>AMD</strong></a>), saw a sharp decline this week after the sudden surge in popularity of DeepSeek, a Chinese AI startup. DeepSeek’s app, which hit #1 in Apple's iPhone store, overshadowed even ChatGPT, though it didn’t make the top 10 on Google Play. This has raised questions about the AI industry and sparked fears among investors.</p><h3 id=\"what-is-deepseek\">What is DeepSeek?</h3><p>Founded in 2023 by hedge fund manager Liang Wenfeng in Hangzhou, China, DeepSeek has been making waves with its AI models. The company’s latest model, R1, released last week, is said to rival OpenAI’s ChatGPT in performance. </p><p>Notably, its V3 model, which debuted in December, was developed in just two months for under $6 million. This rapid development stands in contrast to the massive investments made by U.S. companies like OpenAI and Meta Platforms (META) in building their AI systems.</p><p>The speed and cost-efficiency of DeepSeek’s AI models have sparked concerns among investors. They worry that the startup’s success could undermine the financial assumptions that U.S. companies and investors have relied on for AI development. If DeepSeek can create competitive AI with such low costs, it could reshape how AI models are developed globally. This potential disruption is what’s driving the market selloff.</p><h3 id=\"impact-on-ai-stocks-and-the-market\"><strong>Impact on AI Stocks and the Market</strong></h3><p>The stock market felt the shockwave of DeepSeek’s success. The Nasdaq dropped over 3% on Monday, with AI-related stocks taking the hardest hit. Shares of major chipmakers like Nvidia, Broadcom, and AMD fell, alongside those of their international partners like Taiwan Semiconductor Manufacturing Company (NYSE:<a href=\"https://stockinvest.us/stock/TSM\"><strong>TSM</strong></a>). The PHLX Semiconductor Index (SOX) plunged more than 9%. Even energy stocks, which had soared on the belief that AI would drive increased demand, saw a drop.</p><p>While some sectors, like consumer staples, saw gains, the broader market sentiment was dampened by the fear of competition from DeepSeek and similar companies. This fear was compounded by the reality that DeepSeek’s rise may signal that AI development doesn’t require the expensive infrastructure that investors once believed was necessary.</p><h3 id=\"analysts-push-back-on-fears\">Analysts Push Back on Fears</h3><p>Despite the panic, not all analysts agree with the market’s overreaction. Bernstein’s Stacy Rasgon called the response “overblown” and maintained an “outperform” rating for Nvidia’s stock, suggesting that the selloff could present a buying opportunity. Citi analysts also backed Nvidia, believing that AI companies will continue to rely on its chips.</p><p>Analysts from Wedbush, however, were more skeptical about DeepSeek’s ability to challenge U.S. companies on a large scale. They pointed out that while DeepSeek’s models may be impressive for consumer use, building broader AI infrastructure is another matter entirely.</p><h3 id=\"summary\"><strong>Summary: </strong></h3><p>DeepSeek’s rise underscores the rapidly evolving landscape of AI, where new competitors can emerge quickly and disrupt expectations. While some analysts caution that the recent market panic may be exaggerated, investors should keep an eye on how the competition between Chinese and U.S. AI companies unfolds. </p>\n</div>",
            "link": "https://stockinvest.us/digest/deepseek-ais-rise-sparks-market-selloff-what-investors-need-to-know",
            "pub_date": "2025-02-04 20:15:57",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Will These Transport Companies Beat Estimates Tomorrow?",
            "description": "<div class=\"digest-article-content\">\n<p>As the transport sector gears up for earnings announcements on January 23, traders are keen to see if United Pacific (UNP), American Airlines (AAL), and CSX can beat Wall Street expectations. </p><p>These companies are navigating varied market dynamics, from freight market challenges to rising passenger demand. Here's a closer look at their performance outlook, key estimates, and what traders should watch for.</p><h3 id=\"united-pacific-nyseunp\">United Pacific (NYSE:<a href=\"https://stockinvest.us/stock/UNP\"><strong>UNP</strong></a>)</h3><p>United Pacific's fourth-quarter 2024 results are under pressure from freight market headwinds and a weaker consumer market. However, some optimism has emerged. The Zacks Consensus Estimate for earnings per share (EPS) has edged up 0.4% in the past 60 days to $2.78. If achieved, this would represent a modest 2.6% year-over-year increase.</p><p>Revenue expectations, however, are less favorable. Consensus pegs fourth-quarter revenue at $6.15 billion, suggesting a slight 0.2% decline from the same quarter last year. Investors will focus on how well the company managed to control costs amid these challenges.</p><h3 id=\"american-airlines-nasdaqaal\">American Airlines (NASDAQ:<a href=\"https://stockinvest.us/stock/AAL\"><strong>AAL</strong></a>)</h3><p>American Airlines is riding the tailwind of strong passenger demand, particularly in domestic and international markets. Favorable ticket pricing has also bolstered revenues. The Zacks Consensus Estimate for fourth-quarter earnings has surged by 60% over the past two months to $0.64 per share, an impressive 120.7% increase from a year ago.</p><p>Revenue projections are equally promising. Analysts expect $13.4 billion in revenues, up 2.7% year-over-year. The key question is whether AAL can sustain profitability while navigating higher costs, including fuel and labor expenses.</p><h3 id=\"csx-corporation-nysecsx\">CSX Corporation (NYSE:<a href=\"https://stockinvest.us/stock/CSX\"><strong>CSX</strong></a>)</h3><p>For CSX, weaker coal markets and lower freight volumes are a drag on performance. Analysts have trimmed earnings estimates slightly to $0.43 per share, down from $0.44. This reflects a modest decline from the prior year.</p><p>Revenue expectations also indicate a slowdown. Consensus estimates point to $3.58 billion, representing a 2.6% year-over-year drop. Fuel price declines offer some relief, but weaker freight demand may limit upside potential.</p>\n<!--kg-card-begin: html-->\n<div class=\"digest-article-table-parent\">\n<table>\n<thead>\n<tr>\n<th>Company</th>\n<th>EPS Estimate</th>\n<th>% Change in EPS</th>\n<th>Revenue Estimate</th>\n<th>% Change in Revenue</th>\n<th>Reporting Time</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>United Pacific</td>\n<td>$2.78</td>\n<td>+2.6%</td>\n<td>$6.15B</td>\n<td>-0.2%</td>\n<td>Before market open</td>\n</tr>\n<tr>\n<td>American Airlines</td>\n<td>$0.64</td>\n<td>+120.7%</td>\n<td>$13.4B</td>\n<td>+2.7%</td>\n<td>Before market open</td>\n</tr>\n<tr>\n<td>CSX Corporation</td>\n<td>$0.43</td>\n<td>-2.3%</td>\n<td>$3.58B</td>\n<td>-2.6%</td>\n<td>After market close</td>\n</tr>\n</tbody>\n</table>\n</div>\n<!--kg-card-end: html-->\n</div>",
            "link": "https://stockinvest.us/digest/will-these-transport-companies-beat-estimates-tomorrow",
            "pub_date": "2025-02-04 20:15:57",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AMD Earnings Report: Can the Chipmaker Maintain Momentum Amid Mixed Market Signals?",
            "description": "<div class=\"digest-article-content\">\n<p>As traders eagerly await the earnings announcement from Advanced Micro Devices, Inc. (NASDAQ: <a href=\"https://stockinvest.us/stock/AMD\">AMD</a>), scheduled for release today after market close, there are several key indicators to keep on your radar.</p>\n<!--kg-card-begin: html-->\n<div class=\"digest-article-table-parent\">\n<table>\n<tr>\n<th>Indicator</th>\n<th>Value</th>\n</tr>\n<tr>\n<td>Earnings Report</td>\n<td>Today after market close</td>\n</tr>\n<tr>\n<td>Previous Revenue</td>\n<td>$6.82B (17.6% growth)</td>\n</tr>\n<tr>\n<td>Predicted Revenue</td>\n<td>$7.54B (22.3% growth)</td>\n</tr>\n<tr>\n<td>EPS (Current Quarter)</td>\n<td>$1.09</td>\n</tr>\n<tr>\n<td>AMD Share Price Drop (Last Month)</td>\n<td>-12.6%</td>\n</tr>\n<tr>\n<td>Analysts' Price Target</td>\n<td>$169.82</td>\n</tr>\n<tr>\n<td>Current AMD Price</td>\n<td>$113.30</td>\n</tr>\n</table>\n</div>\n<!--kg-card-end: html-->\n<p>In the previous quarter, AMD managed to exceed revenue expectations, reporting earnings of $6.82 billion—a 17.6% increase compared to the same period last year. However, despite this triumph, the company's revenue guidance fell short of analysts’ forecasts. This slight hiccup poses a question for investors: should they consider AMD a buy or sell as the earnings report approaches? For a detailed analysis, feel free to explore our comprehensive insights!</p><p>For this quarter, analysts predict AMD’s revenue will climb 22.3% year over year, reaching $7.54 billion. This projection marks a notable uptick from the 10.2% growth observed in the same quarter last year, while adjusted earnings are expected to settle at $1.09 per share. The general consensus among analysts has remained optimistic in the past month, reinforcing the belief that AMD will maintain its momentum as it heads into earnings. However, it's worth noting that the company has missed Wall Street’s revenue estimates on two occasions over the past two years.</p><p>Shifting our focus briefly to AMD's competitors within the processors and graphics chip market, we see a mixed bag of results. For instance, Qorvo reported a 14.7% year-on-year revenue decline but managed to surpass analysts' expectations, leading to no significant change in their stock price. Conversely, Allegro MicroSystems faced a steeper revenue drop of 30.2%, yet its stock rose by 5.4% following its earnings call.</p><p>Looking at the broader market context, 2024 has been a robust year thus far, with the Federal Reserve successfully battling inflation without triggering a recession—a phenomenon affectionately termed a \"soft landing.\" With interest rates now on the decline and political dynamics shifting with the approaching presidential election in November 2024, market sentiment continues to tilt upward, albeit with some volatility. Despite some processors and graphics chips showing promising progress, the sector as a whole has seen an average drop of 4.7% in share prices over the last month. AMD, specifically, has declined by 12.6% during this period. Nevertheless, analysts maintain a favorable outlook, with an average price target set at $169.82 compared to AMD’s current share price of $113.30.</p>\n</div>",
            "link": "https://stockinvest.us/digest/amd-earnings-report-can-the-chipmaker-maintain-momentum-amid-mixed-market-signals",
            "pub_date": "2025-02-04 20:15:57",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's 15% Tariff on U.S. Coal: What Traders Need to Know Amid Global Supply-Demand Dynamics",
            "description": "<div class=\"digest-article-content\">\n<p>China has announced a 15% tariff on U.S. coal imports in response to the 10% tariffs the U.S. imposed on various Chinese goods. This decision directly impacts the global commodities market, particularly the coal trade between the two countries.</p><p>According to the analytical insights from Citi (NYSE:<a href=\"https://stockinvest.us/stock/C\"><strong>C</strong></a>), the export dynamics of U.S. coal present a nuanced picture. Last year, the United States shipped approximately 46.3 million tons of thermal coal, with a modest 7%—or about 3.4 million tons—headed to China. In the grand scheme of the global coal trade, which is estimated at 1,146 million tons, this accounted for a mere 0.3%. Dominating the U.S. coal export landscape are countries like India, Japan, South Korea, and various European and African nations, who are significantly snapping up thermal coal.</p><p>When it comes to metallurgical coal, utilized primarily in steel production, the U.S. exported around 50.2 million tons in 2024, with China absorbing approximately 10.7 million tons, a substantial 21% of that total. However, this still represented only 2.8% of worldwide metallurgical coal trade, which stands at about 380 million tons. Other notable markets for U.S. metallurgical coal include India, Brazil, Europe, Japan, and South Korea.</p><p>China's dependence on U.S. coal varies significantly between these coal types. For thermal coal, U.S. imports represent a mere 0.8% of China’s total thermal coal imports, which totaled 432.8 million tons in 2024. The majority of China’s thermal coal is sourced from countries like Indonesia, Australia, Russia, and Mongolia. On the other hand, the U.S. serves as a more critical supplier for metallurgical coal, making up about 9% of China's imports in that category.</p><p>Citi analysts suggest that the broader impact of these tariffs on coal prices may be limited. With ample supply in both thermal and metallurgical coal markets, any price fluctuations may turn out to be modest at best. Thus, for stock traders focusing on the coal sectors or companies such as Peabody Energy Corporation (NYSE:<a href=\"https://stockinvest.us/stock/BTU\"><strong>BTU</strong></a>) or Arch Resources, Inc. (NYSE:<a href=\"https://stockinvest.us/stock/ARCH\"><strong>ARCH</strong></a>), this might be a time to proceed with caution, keeping an eye on global supply-demand dynamics rather than reacting hastily to tariff news.</p>\n</div>",
            "link": "https://stockinvest.us/digest/chinas-15-tariff-on-us-coal-what-traders-need-to-know-amid-global-supply-demand-dynamics",
            "pub_date": "2025-02-04 20:05:46",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ferragamo Shares Tumble 5% Amid CEO Shake-Up: What Traders Need to Know",
            "description": "<div class=\"digest-article-content\">\n<p>In a notable shift within the luxury fashion industry, shares of <strong>Ferragamo</strong> (MIL:<a href=\"https://stockinvest.us/stock/SFER.MI\"><strong>SFER</strong></a>) fell by over 5% following the announcement of Marco Gobbetti’s departure as CEO, effective next month. Gobbetti, who took the helm just over three years ago, has been tasked with revitalizing the famed Florentine brand, yet the progress has not quite met the expectations of stakeholders.</p><p>Analysts from Equita suggest that this transition may carry some immediate negative impacts. They point out that uncertainties surrounding the brand’s new phase of relaunch could affect both the creative team and higher management. Gobbetti's exit is perceived as a possible reflection of unsatisfactory results and slower-than-anticipated progress in reviving Ferragamo's market presence. Since his arrival in early 2022, Gobbetti had announced ambitious plans for a swift turnaround, but by the end of last year, he had cautioned that achieving these goals could take longer than planned.</p><p>Compounding the uncertainty, Ferragamo has embarked on a search for a new CEO who will be pivotal in continuing the brand's efforts toward renewing its image and enhancing its heritage. This shift occurs at a challenging time, with Ferragamo’s share price having decreased about 38% over the last year, recently hitting record lows in December.</p><p>Interestingly, some analysts at Barclays view Gobbetti's departure as potentially positive, given Ferragamo's past underperformance compared to its industry peers. With the market reacting so dramatically, traders may need to consider the implications of leadership changes combined with operational strategies aimed at brand recovery. Navigating this terrain will demand a vigilant eye on further developments within Ferragamo, including who will step into the CEO role and what strategies they will pursue.</p>\n</div>",
            "link": "https://stockinvest.us/digest/ferragamo-shares-tumble-5-amid-ceo-shake-up-what-traders-need-to-know",
            "pub_date": "2025-02-04 20:01:00",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "February 4, 2025: Google, Toyota, and More Reveal Earnings – What to Expect",
            "description": "<div class=\"digest-article-content\">\n<p>Here’s a rundown of the companies set to report their earnings today, February 4, 2025. <br/><br/>Each of these organizations will provide insights into their financial performance and future guidance, impacting market sentiment and stock movements.</p>\n<!--kg-card-begin: html-->\n<table>\n<tbody><tr>\n<td><strong>Company</strong></td>\n<td><strong>Ticker</strong></td>\n<td><strong>When</strong></td>\n<td><strong>Exchange</strong></td>\n<td><strong>Market Cap (in B)</strong></td>\n<td><strong>Consensus EPS</strong></td>\n<td><strong>Earnings Date</strong></td>\n<td><strong>Ending Fiscal Quarter</strong></td>\n</tr>\n<tr>\n<td>Google</td>\n<td><a href=\"https://stockinvest.us/stock/GOOGL\">GOOGL</a></td>\n<td>AMC</td>\n<td>NASDAQ</td>\n<td>2,472.0</td>\n<td>2.12</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Google</td>\n<td><a href=\"https://stockinvest.us/stock/GOOG\">GOOG</a></td>\n<td>AMC</td>\n<td>NASDAQ</td>\n<td>2,470.0</td>\n<td>2.12</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Toyota Motor Corp Ltd Ord</td>\n<td><a href=\"https://stockinvest.us/stock/TM\">TM</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>251.1</td>\n<td>4.36</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Toyota Motor Corp Ltd Ord</td>\n<td><a href=\"https://stockinvest.us/stock/TM\">TM</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>251.1</td>\n<td>4.36</td>\n<td>2025-02-04</td>\n<td>Sep, 2025</td>\n</tr>\n<tr>\n<td>Merck</td>\n<td><a href=\"https://stockinvest.us/stock/MRK\">MRK</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>250.3</td>\n<td>1.85</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Pepsico</td>\n<td><a href=\"https://stockinvest.us/stock/PEP\">PEP</a></td>\n<td>BMO</td>\n<td>NASDAQ</td>\n<td>206.2</td>\n<td>1.95</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Advanced Micro Devices</td>\n<td><a href=\"https://stockinvest.us/stock/AMD\">AMD</a></td>\n<td>AMC</td>\n<td>NYSE</td>\n<td>192.9</td>\n<td>1.07</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Amgen Inc.</td>\n<td><a href=\"https://stockinvest.us/stock/AMGN\">AMGN</a></td>\n<td>AMC</td>\n<td>NASDAQ</td>\n<td>155.3</td>\n<td>5.04</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Pfizer</td>\n<td><a href=\"https://stockinvest.us/stock/PFE\">PFE</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>152.5</td>\n<td>0.48</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>KKR &amp; Co LP</td>\n<td><a href=\"https://stockinvest.us/stock/KKR\">KKR</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>148.2</td>\n<td>1.30</td>\n<td>2025-02-04</td>\n<td>Dec, 2024</td>\n</tr>\n</tbody></table>\n<!--kg-card-end: html-->\n</div>",
            "link": "https://stockinvest.us/digest/february-4-2025-google-toyota-and-more-reveal-earnings-what-to-expect",
            "pub_date": "2025-02-04 20:01:00",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Merger Talks Stir Minor Market Ripples as Airbus and Leonardo See Slight Share Declines",
            "description": "<div class=\"digest-article-content\">\n<p>In today's trading session, shares of Airbus (PAR:<a href=\"https://stockinvest.us/stock/AIR.PA\"><strong>AIR</strong></a>) and Leonardo (BIT: LDO) experienced slight declines, slipping by 0.5% and 1.6% respectively. This downward movement comes amidst reports of ongoing merger discussions aimed at consolidating Airbus' space division with Thales’ Alenia Space, a joint venture between Thales and Leonardo. The goal of this potential merger appears to be a strategic response to the notable excess capacity within the space sector.</p><p>While many traders might brace for significant changes from such corporate maneuvers, the financial implications seem to be on the modest side, as indicated by analyst estimates. According to analysts at Citigroup, the expected financial benefits from this merger would only impact the involved companies slightly, projecting up to €110 million in savings—just around 1% of Airbus' projected EBIT for 2024, with Leonardo and Thales anticipating similarly marginal boosts.</p>\n</div>",
            "link": "https://stockinvest.us/digest/merger-talks-stir-minor-market-ripples-as-airbus-and-leonardo-see-slight-share-declines",
            "pub_date": "2025-02-04 18:50:56",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tariff Turbulence: How Trump's New Trade Policies are Rocking U.S. Stock Sectors",
            "description": "<div class=\"digest-article-content\">\n<p>The application of a 25% tariff on goods from Mexico and Canada, along with a 10% tax on imports from China, has particularly affected companies with substantial international supply chains. Notable names reacting sharply to this news include <a href=\"https://stockinvest.us/stock/GM\">General Motors (NYSE: GM)</a>, <a href=\"https://stockinvest.us/stock/CMG\">Chipotle Mexican Grill (NYSE: CMG)</a>, and <a href=\"https://stockinvest.us/stock/GOOS\">Canada Goose (NYSE: GOOS)</a>.</p><p>As discussions of a potential global trade war gain traction, industries such as automotive, food and beverage, and retail find themselves navigating a precarious path. Many experts, including those at Goldman Sachs, warn that these tariffs could lead to a significant downturn in U.S. stock prices—potentially by as much as 5%—due to pressure on corporate earnings.</p><h3 id=\"automotive-sector-and-railroads\">Automotive Sector and Railroads</h3><p>Automakers are gearing up for substantial disruptions. With companies like <a href=\"https://stockinvest.us/stock/F\">Ford (NYSE: F)</a> and <a href=\"https://stockinvest.us/stock/STLA\">Stellantis (NYSE: STLA)</a> also heavily exposed, manufacturing operations that span across North America might face increased costs. This may force car manufacturers to reconsider their foreign production strategies, shifting operations back to the U.S. in an attempt to mitigate tariff impacts. <br/><br/>Logistics could face significant hurdles as tariffs hinder the flow of goods. Major freight operators like <a href=\"https://stockinvest.us/stock/UNP\">Union Pacific Corporation (NYSE: UNP)</a> and its peers, including <a href=\"https://stockinvest.us/stock/NSC\">Norfolk Southern (NYSE: NSC)</a> and <a href=\"https://stockinvest.us/stock/CP\">Canadian Pacific Kansas City (NYSE: CP)</a>, could see revenue and profits impacted by changes in transport dynamics due to tariffs that slow cargo movements.</p><h3 id=\"food-and-beverage\">Food and Beverage</h3><p>The beverage industry isn't immune either. <a href=\"https://stockinvest.us/stock/STZ\">Constellation Brands (NYSE: STZ)</a> is particularly affected, facing declining investments in the face of tariffs on Mexican imports. Additionally, both <a href=\"https://stockinvest.us/stock/CMG\">Chipotle</a> and avocado supplier <a href=\"https://stockinvest.us/stock/CVV\">Calavo Growers (NASDAQ: CVGW)</a> may encounter increased costs, given their dependence on avocados imported from Mexico.</p><h3 id=\"retail-sector-faces-the-storm\">Retail Sector Faces the Storm</h3><p>In the retail space, companies like <a href=\"https://stockinvest.us/stock/NKE\">Nike (NYSE: NKE)</a> and <a href=\"https://stockinvest.us/stock/LULU\">Lululemon (NASDAQ: LULU)</a> could brace for challenges as their robust supply chains rely heavily on imports from China. Additionally, budget retailers such as <a href=\"https://stockinvest.us/stock/FIVE\">Five Below (NASDAQ: FIVE)</a> and <a href=\"https://stockinvest.us/stock/DG\">Dollar General (NYSE: DG)</a> may feel the pinch, as their low-cost items largely originate from Chinese manufacturers. Furthermore, <a href=\"https://stockinvest.us/stock/GOOS\">Canada Goose</a>, renowned for its luxury outerwear, might also struggle amidst these tariff-related woes.</p>\n</div>",
            "link": "https://stockinvest.us/digest/tariff-turbulence-how-trumps-new-trade-policies-are-rocking-us-stock-sectors",
            "pub_date": "2025-02-03 22:55:50",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Week Preview: Key Reports from Google, Toyota, Amazon, and More Set to Shape Market Dynamics",
            "description": "<div class=\"digest-article-content\">\n<p>As the earnings season heats up, investors are keenly awaiting the next wave of financial reports from some of the world's most influential companies. <br/><br/>This week, a mix of technology giants, automotive manufacturers, and pharmaceutical leaders will announce their earnings. Below is a comprehensive overview of the upcoming earnings, highlighting key details such as earnings dates, expected EPS, and market capitalization.</p><p><strong>Upcoming Earnings Schedule</strong></p>\n<!--kg-card-begin: html-->\n<table>\n<tbody><tr>\n<td><strong>Date</strong></td>\n<td><strong>Day</strong></td>\n<td><strong>Company</strong></td>\n<td><strong>Ticker</strong></td>\n<td><strong>When</strong></td>\n<td><strong>Exchange</strong></td>\n<td><strong>Market Cap</strong></td>\n<td><strong>Consensus EPS</strong></td>\n<td><strong>Ending Fiscal Quarter</strong></td>\n</tr>\n<tr>\n<td>Feb 04</td>\n<td>Tuesday</td>\n<td>Google</td>\n<td><a href=\"https://stockinvest.us/stock/GOOG\">GOOG</a></td>\n<td>AMC</td>\n<td>NASDAQ</td>\n<td>2.471T</td>\n<td>2.12</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Feb 04</td>\n<td>Tuesday</td>\n<td>Google</td>\n<td><a href=\"https://stockinvest.us/stock/GOOGL\">GOOGL</a></td>\n<td>AMC</td>\n<td>NASDAQ</td>\n<td>2.469T</td>\n<td>2.12</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Feb 04</td>\n<td>Tuesday</td>\n<td>Toyota Motor Corp Ltd Ord</td>\n<td><a href=\"https://stockinvest.us/stock/TM\">TM</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>251.121B</td>\n<td>4.36</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Feb 04</td>\n<td>Tuesday</td>\n<td>Toyota Motor Corp Ltd Ord</td>\n<td><a href=\"https://stockinvest.us/stock/TM\">TM</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>251.121B</td>\n<td>4.36</td>\n<td>Sep, 2025</td>\n</tr>\n<tr>\n<td>Feb 04</td>\n<td>Tuesday</td>\n<td>Merck</td>\n<td><a href=\"https://stockinvest.us/stock/MRK\">MRK</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>250.308B</td>\n<td>1.85</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Feb 05</td>\n<td>Wednesday</td>\n<td>Alibaba</td>\n<td><a href=\"https://stockinvest.us/stock/BABA\">BABA</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>246B</td>\n<td>3.03</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Feb 06</td>\n<td>Thursday</td>\n<td>Amazon</td>\n<td><a href=\"https://stockinvest.us/stock/AMZN\">AMZN</a></td>\n<td>AMC</td>\n<td>NASDAQ</td>\n<td>2.467T</td>\n<td>1.52</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Feb 06</td>\n<td>Thursday</td>\n<td>Eli Lilly</td>\n<td><a href=\"https://stockinvest.us/stock/LLY\">LLY</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>781.505B</td>\n<td>5.45</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Feb 06</td>\n<td>Thursday</td>\n<td>Astrazeneca PLC</td>\n<td><a href=\"https://stockinvest.us/stock/AZN\">AZN</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>220.922B</td>\n<td>1.10</td>\n<td>Dec, 2024</td>\n</tr>\n<tr>\n<td>Feb 06</td>\n<td>Thursday</td>\n<td>Linde plc</td>\n<td><a href=\"https://stockinvest.us/stock/LIN\">LIN</a></td>\n<td>BMO</td>\n<td>NYSE</td>\n<td>212.547B</td>\n<td>3.93</td>\n<td>Dec, 2024</td>\n</tr>\n</tbody></table>\n<!--kg-card-end: html-->\n<p>Big Tech earnings take center stage this week, with Google parent Alphabet reporting on Tuesday and Amazon following on Thursday. Their results come amid heightened scrutiny of AI spending after Chinese startup DeepSeek introduced a sophisticated, lower-cost AI model that shook Wall Street last week.</p><p>AI favorite Palantir (PLTR) kicks off the week with its earnings on Monday, while chip giants Arm (ARM), Advanced Micro Devices (AMD), and Qualcomm (QCOM) are set to report later.</p><p>On Wednesday, Disney will release its results after last quarter’s streaming revenue boost and news of FuboTV merging with Disney’s Hulu + Live TV. Bitcoin heavyweight MicroStrategy (MSTR) also reports Wednesday, following its recent purchase of 10,107 bitcoins.</p><p>The pharmaceutical sector is in focus, too. Novo Nordisk, the maker of Ozempic and Wegovy, reports Wednesday, with Eli Lilly following on Thursday. Other major drugmakers set to release earnings include Pfizer (PFE), Merck (MRK), Amgen (AMGN), AstraZeneca (AZN), and Bristol Myers Squibb (BMY).</p>\n</div>",
            "link": "https://stockinvest.us/digest/earnings-week-preview-key-reports-from-google-toyota-amazon-and-more-set-to-shape-market-dynamics",
            "pub_date": "2025-02-03 22:30:58",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lufthansa's Strategic Move: A 41% Stake in ITA Airways Set to Fuel Profits by 2025",
            "description": "<div class=\"digest-article-content\">\n<p>Germany's Lufthansa (GER:<a href=\"https://stockinvest.us/stock/LHA.DE\"><strong>LHA</strong></a>) is poised to start seeing profits from its stake in ITA Airways as early as 2025. This strategic insight comes directly from Carsten Spohr, the CEO of Lufthansa, who recently revealed plans that are set to reshape the airline's presence, particularly in the vibrant southern European market.</p><p>The backdrop to this announcement is Lufthansa's recent acquisition of a 41% stake in ITA Airways, a venture costing around 325 million euros (about $332 million). This investment marks a significant milestone as ITA is the successor to the previously bankrupt Alitalia, and it represents Lufthansa's intention to gain a stronger foothold in a region that's been a treasure trove for travelers and businesses alike.</p><p>Beginning next year, ITA Airways is expected to join the prestigious Star Alliance, the world's largest airline alliance, which is likely to enhance its operational capabilities and connectivity. For stock traders keeping an eye on airline stocks, the implications of this integration could be profound. The influx of business travelers and leisure passengers will likely escalate profitability as Lufthansa taps into ITA's network.</p>\n</div>",
            "link": "https://stockinvest.us/digest/lufthansas-strategic-move-a-41-stake-in-ita-airways-set-to-fuel-profits-by-2025",
            "pub_date": "2025-02-03 20:05:46",
            "source": "stockinvest",
            "kind": 1,
            "language": "en"
        }
    ]
}