{
    "data": [
        {
            "title": "Tesla Ordered to Face Hiring Discrimination Lawsuit Over H-1B Visa Allegations",
            "description": "<div class=\"entry-content\">\n<p><a href=\"http://driveteslacanada.ca/tag/tesla\">Tesla </a>will have to defend itself in court after a U.S. federal judge ruled that a proposed class-action lawsuit accusing the automaker of discriminating against American workers in hiring can move forward — at least for now.</p>\n<p>In a decision issued this week in San Francisco, U.S. District Judge Vince Chhabria declined Tesla’s request to dismiss claims brought by software engineer Scott Taub, who alleges the company favored foreign workers holding H-1B visas over U.S. citizens for certain engineering roles. However, the judge also signaled significant doubts about whether the allegations will ultimately succeed.</p>\n<p>According to the ruling, Taub presented “just enough facts” for the case to proceed beyond the early dismissal stage, allowing the lawsuit to move into the discovery phase where additional evidence may be examined.<em> (via Reuters)</em></p>\n<h3 class=\"wp-block-heading\" id=\"h-allegations-focus-on-engineering-hiring-practices\">Allegations Focus on Engineering Hiring Practices</h3>\n<p>Taub claims Tesla passed him over for an engineering position as part of what the lawsuit describes as a “systematic preference” for hiring visa holders. Central to the complaint is an alleged interaction with a recruiter who reportedly told him the position he applied for was “H1B only,” referring to visas commonly used by U.S. technology companies to employ highly skilled foreign workers.</p>\n<p>The lawsuit also points to <a href=\"https://driveteslacanada.ca/news/tesla-layoffs-trim-workforce-by-14-report/\" id=\"92823\" type=\"post\">Tesla’s workforce changes in 2024</a>, alleging the company hired approximately 1,355 H-1B visa holders during the same period it laid off more than 6,000 domestic employees, most believed to be U.S. citizens.</p>\n<p>Judge Chhabria emphasized that those statistics alone do not prove discrimination, noting they demonstrate hiring activity but not necessarily preferential treatment.</p>\n<p>“All of this causes the Court to be somewhat skeptical of Taub’s allegations,” Chhabria wrote in the order.</p>\n<h3 class=\"wp-block-heading\" id=\"h-second-plaintiff-s-claims-dismissed\">Second Plaintiff’s Claims Dismissed</h3>\n<p>While Taub’s claims will proceed, the court dismissed allegations brought by a second plaintiff, human resources specialist Sofia Brander. The judge said it was implausible that Tesla would favour foreign visa holders for HR positions, particularly since H-1B programs are typically associated with specialized technical roles.</p>\n<p>Brander has been given two weeks to amend and refile her complaint if she wishes to continue pursuing the case.</p>\n<h3 class=\"wp-block-heading\" id=\"h-tesla-denies-allegations\">Tesla Denies Allegations</h3>\n<p>Tesla has strongly rejected the accusations in court filings, calling the claims “preposterous.” The company has not publicly commented further following the ruling.</p>\n<p>Tesla CEO Elon Musk has previously defended skilled immigration programs, arguing they are critical for maintaining competitiveness in advanced industries such as artificial intelligence and vehicle autonomy.</p>\n<p>For now, the lawsuit’s survival represents only an early procedural step. As the case moves into discovery, Tesla’s internal hiring records and communications could face closer scrutiny — a process that may ultimately determine whether the claims gain traction or are dismissed at a later stage.</p>\n\n<!-- CONTENT END 2 -->\n</div>",
            "image": "https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2025/10/fremont-15-scaled.jpg?fit=975%2C548&ssl=1",
            "link": "https://driveteslacanada.ca/news/tesla-ordered-to-face-hiring-discrimination-lawsuit-over-h-1b-visa-allegations/",
            "pub_date": "2026-02-26 02:11:28",
            "source": "driveteslacanada",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla Opens New V4 Supercharger in Penhold [Alberta]",
            "description": "<div class=\"entry-content\">\n<p>Tesla has officially opened a new <a href=\"https://driveteslacanada.ca/category/supercharger/\" id=\"16810\" type=\"category\">Supercharger </a>station in Penhold, Alberta, just outside of Red Deer, bringing the total number of Supercharger stations in the heart of ‘Gasoline Alley’ to three.</p>\n<p>Gasoline Alley is a critical stop for electric vehicle (EV) drivers travelling Highway 2, the province’s busiest transportation corridor connecting Calgary and Edmonton. With roughly 300 kilometres separating Alberta’s two largest cities, Red Deer and the surrounding area serve as a natural midpoint for charging stops — particularly during winter months when colder temperatures can reduce driving range.</p>\n<p>The Penhold Supercharger was first added as a potential location on Tesla’s official map in September 2024, with <a href=\"https://driveteslacanada.ca/news/tesla-starts-construction-on-v4-supercharger-in-red-deers-gasoline-alley-alberta/\">construction starting nearly a year later</a>. Located at 135 Leva Avenue in Gasoline Alley, next to Smitty’s restaurant, the new Supercharger station features 12 V4 stalls capable of delivering up to 325kW, making it the fastest charging location in central Alberta. </p>\n<p>The station supports both Tesla vehicles and non-Tesla EVs equipped with a North American Charging Standard (NACS) adapter. According to Tesla’s Supercharger listing, charging rates at the site are C$0.55 per kWh for Tesla owners, while other EV drivers pay C$0.76 per kWh.</p>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-114409\" data-attachment-id=\"114409\" data-comments-opened=\"1\" data-image-caption=\"\" data-image-description=\"\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"alberta\" data-large-file=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/alberta.png?fit=975%2C478&amp;ssl=1\" data-medium-file=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/alberta.png?fit=300%2C147&amp;ssl=1\" data-orig-file=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/alberta.png?fit=1902%2C932&amp;ssl=1\" data-orig-size=\"1902,932\" data-permalink=\"https://driveteslacanada.ca/news/tesla-opens-new-v4-supercharger-in-penhold-alberta/attachment/alberta-3/\" data-recalc-dims=\"1\" decoding=\"async\" fetchpriority=\"high\" height=\"478\" sizes=\"(max-width: 975px) 100vw, 975px\" src=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/alberta.png?resize=975%2C478&amp;ssl=1\" srcset=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/alberta.png?resize=1024%2C502&amp;ssl=1 1024w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/alberta.png?resize=300%2C147&amp;ssl=1 300w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/alberta.png?resize=768%2C376&amp;ssl=1 768w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/alberta.png?resize=1536%2C753&amp;ssl=1 1536w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/alberta.png?w=1902&amp;ssl=1 1902w\" width=\"975\"/></figure>\n<p>Tesla’s <a href=\"https://driveteslacanada.ca/news/tesla-launches-v4-superchargers-in-china/\" id=\"105591\" type=\"post\">V4 Superchargers</a> represent the company’s newest charging technology. In addition to higher power delivery, the updated design includes longer charging cables and improved compatibility for non-Tesla vehicles as more automakers adopt the NACS charging connector across North America.</p>\n<p>As we noted, Tesla already operates additional Supercharger infrastructure nearby, including older V2 and V3 stations. With this latest addition, there are now 24 Supercharger stalls within five kilometers of each other.</p>\n<iframe height=\"480\" src=\"https://www.google.com/maps/d/u/2/embed?mid=1fFZB69dD_4Y0dOCGycZvXhrte5VSm6Ms&amp;ehbc=2E312F\" width=\"640\"></iframe>\n\n<!-- CONTENT END 2 -->\n</div>",
            "image": "https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2024/09/V4Supercharger_98-scaled.jpg?fit=975%2C548&ssl=1",
            "link": "https://driveteslacanada.ca/news/tesla-opens-new-v4-supercharger-in-penhold-alberta/",
            "pub_date": "2026-02-26 01:25:37",
            "source": "driveteslacanada",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla’s European Sales Slide Continues as BYD Surges Ahead in January Registrations",
            "description": "<div class=\"entry-content\">\n<p>Tesla’s performance in Europe remains under pressure to start 2026, with new registration data showing the automaker trailing fast-growing competitors despite continued expansion of the region’s electric vehicle (EV) market.</p>\n<p>According to figures released by the European Automobile Manufacturers’ Association (ACEA), Tesla registered 8,075 vehicles across Europe in January. That represents a 17% decline compared to the same period last year and marks the company’s <a href=\"https://driveteslacanada.ca/news/teslas-sales-decline-across-europe-continues/\" id=\"103676\" type=\"post\">13th consecutive month of year-over-year (YoY) sales declines in the region</a>.</p>\n<p>Tesla’s market share also slipped to 0.8%, down from 1.0% a year ago and significantly lower than the 3.0% share it achieved just one month earlier in December 2025.</p>\n<h3 class=\"wp-block-heading\" id=\"h-ev-market-growing-but-tesla-losing-momentum\">EV Market Growing — But Tesla Losing Momentum</h3>\n<p>The downturn comes despite continued growth in EV adoption across Europe. Overall vehicle registrations fell 3.5% YoY in January, but battery electric vehicles (BEVs) moved in the opposite direction.</p>\n<p>BEVs accounted for 19.3% of all new EU vehicle registrations during the month, up from 14.9% a year earlier, with total EV registrations increasing by nearly 14%. Plug-in hybrids also posted strong gains, while gas and diesel vehicles continued to decline sharply.</p>\n<p>Most notably, Chinese automaker BYD, <a href=\"https://driveteslacanada.ca/news/byd-is-already-cleared-to-sell-evs-in-canada-giving-it-a-big-head-start-over-rivals/\" id=\"113606\" type=\"post\">which could soon be selling its EVs in Canada</a>, registered 18,242 vehicles in January, more than double Tesla’s total. That figure represents a massive 165% year-over-year increase and pushed BYD’s regional market share to 1.9%.</p>\n<h3 class=\"wp-block-heading\" id=\"h-product-strategy-and-market-pressures\">Product Strategy and Market Pressures</h3>\n<p>Several factors appear to be contributing to Tesla’s softer performance in Europe. Unlike many rivals, Tesla sells only fully electric vehicles, while competitors such as BYD offer a mix of BEVs and plug-in hybrids that appeal to buyers transitioning away from combustion vehicles.</p>\n<p>At the same time, Tesla’s lineup in Europe is mostly comprised of just two models, the Model 3 and Model Y, which continues to carry the bulk of sales while lower-cost competitors enter the market.</p>\n<p>The EU-only data shows a similar trend. Tesla registrations dipped slightly by 1.6% to 7,187 units in January, maintaining a 0.9% share of the market, while BYD surged 175% during the same period.</p>\n<p>Globally, the contrast has also emerged in annual results, with BYD’s pure EV sales growing nearly 28% in 2025 while Tesla’s declined by roughly 8.5%.</p>\n\n<!-- CONTENT END 2 -->\n</div>",
            "image": "https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2024/03/model3modely-scaled.jpg?fit=975%2C650&ssl=1",
            "link": "https://driveteslacanada.ca/news/teslas-european-sales-slide-continues-as-byd-surges-ahead-in-january-registrations/",
            "pub_date": "2026-02-26 01:05:40",
            "source": "driveteslacanada",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla Removes $59,990 Cybertruck AWD From Referral Program as Orders Surge",
            "description": "<div class=\"entry-content\">\n<p>Tesla has quietly made another change to the rapidly evolving rollout of its new $59,990 Dual Motor AWD Cybertruck, which has seen a number of updates <a href=\"https://driveteslacanada.ca/news/tesla-launches-59990-cybertruck-awd-that-may-beat-the-2019-reveal/\" id=\"114256\" type=\"post\">since its launch less than a week ago</a>.</p>\n<p>The latest updates is that the entry-level AWD Cybertruck is no longer eligible for <a href=\"https://www.tesla.com/referral/darryn55317\">Tesla’s referral program</a>, removing the $1,000 referral discount that new buyers could previously apply at checkout. Updated referral program details now show that only the Cybertruck Premium AWD and Cyberbeast qualify for referral rewards and discounts.</p>\n<p>The $59,990 variant remains eligible for loyalty benefits, but the removal from referrals indicates Tesla doesn’t need additional incentives to sell this trim.</p>\n<h3 class=\"wp-block-heading\" id=\"h-demand-is-driving-the-change\">Demand Is Driving the Change</h3>\n<p>Tesla has not publicly explained the decision, but the timing lines up with a wave of strong demand following the launch of the sub-$60K configuration.</p>\n<p>As we told you earlier this week, delivery timelines for the Dual Motor AWD were already <a href=\"https://driveteslacanada.ca/news/tesla-cybertruck-awd-delivery-timelines-slip-to-fall-2026-as-demand-surges/\" id=\"114349\" type=\"post\">pushed back several months into September–October 2026</a>, and Tesla has also since confirmed <a href=\"https://driveteslacanada.ca/news/tesla-confirms-cybertruck-awd-price-increase-coming-next-month/\" id=\"114367\" type=\"post\">pricing will increase after February 28</a>. Now, removing referral incentives further suggests the company is actively managing order volume rather than trying to stimulate it.</p>\n<p>There have also been multiple reports from Tesla owners saying they quickly hit their annual referral limits, further supporting that demand is high for this trim.</p>\n<figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"embed-twitter\"></div>\n</div></figure>\n<p>That kind of activity points to a surge of organic interest — exactly the type of momentum Tesla typically allows to play out without incentives cutting into margins.</p>\n<h3 class=\"wp-block-heading\" id=\"h-protecting-margins-while-demand-is-hot\">Protecting Margins While Demand Is Hot</h3>\n<p>From a business standpoint, the move makes sense. Between the lower starting price and strong early order activity, continuing to offer an additional $1,000 discount may have been unnecessary. Removing referral eligibility allows Tesla to preserve margins while still keeping higher-priced Cybertruck trims positioned as upgrade options with added incentives.</p>\n<h3 class=\"wp-block-heading\" id=\"h-momentum-continues-for-now\">Momentum Continues — For Now</h3>\n<p>Taken together, the recent changes paint a consistent picture. Delivery dates slipping, a confirmed upcoming price increase, and now the removal of referral discounts all point toward stronger-than-expected demand for the $59,990 Cybertruck AWD.</p>\n<p>The bigger question moving forward is whether Tesla can maintain that momentum once it raises the price of the Cybertruck AWD next month.</p>\n\n<!-- CONTENT END 2 -->\n</div>",
            "image": "https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/referral.png?fit=975%2C490&ssl=1",
            "link": "https://driveteslacanada.ca/news/tesla-removes-59990-cybertruck-awd-from-referral-program-as-orders-surge/",
            "pub_date": "2026-02-26 00:30:03",
            "source": "driveteslacanada",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla quietly updates lease policy in Canada, opening door to lease buyouts",
            "description": "<div class=\"entry-content\">\n<p>Tesla has quietly updated its lease buyout language in Canada, potentially giving some customers a path to purchase their vehicles at the end of their lease — something that was previously restricted for most models.</p>\n<p>The change comes through an update to Tesla’s Canadian support website, where the company has revised the wording surrounding lease-end purchase options. While Tesla has not made an official announcement, the updated language is a notable shift from the automaker’s long-standing policy.</p>\n<h3 class=\"wp-block-heading\" id=\"h-previous-policy-blocked-most-buyouts\">Previous Policy Blocked Most Buyouts</h3>\n<p>Under Tesla’s previous terms, lease buyouts in Canada were heavily limited. Only certain Model S and Model X vehicles leased before April 15, 2022 were eligible for purchase at the end of the lease term. Vehicles delivered after that date were explicitly excluded.</p>\n<p>More importantly for the majority of Tesla customers, leases for the Model 3 and Model Y — Tesla’s two best-selling vehicles — were “not eligible for purchase regardless of delivery date.” Tesla also prohibited third-party dealerships or individuals from buying leased vehicles.</p>\n<h3 class=\"wp-block-heading\" id=\"h-new-wording-introduces-flexibility\">New Wording Introduces Flexibility</h3>\n<p>Tesla’s updated lease language now <a href=\"https://www.tesla.com/en_ca/support/leasing/lease-end-options\">reads </a>differently. Instead of outright restrictions, customers are directed to review their lease agreement for purchase eligibility and are told to contact Tesla near the end of their lease if no purchase option is listed.</p>\n<p>The revised wording states customers should “contact us at the end of your lease to see what options are available to you.”</p>\n<p>While subtle, the change removes the blanket exclusions previously listed for newer vehicles and for Model 3 and Model Y leases which stated they were “not eligible for purchase regardless of delivery date.” There is also no longer an exclusion for third-party dealerships or individuals purchasing a leased vehicle.</p>\n<p>Here are the previous terms, which were in place as recently as November 15, 2025 according to Wayback Machine, and new terms as they exist on Tesla’s website today.</p>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-114395\" data-attachment-id=\"114395\" data-comments-opened=\"1\" data-image-caption=\"\" data-image-description=\"\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"terms\" data-large-file=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/terms.png?fit=975%2C192&amp;ssl=1\" data-medium-file=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/terms.png?fit=300%2C59&amp;ssl=1\" data-orig-file=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/terms.png?fit=1736%2C343&amp;ssl=1\" data-orig-size=\"1736,343\" data-permalink=\"https://driveteslacanada.ca/news/tesla-quietly-updates-lease-policy-in-canada-opening-door-lease-buyouts/attachment/terms-3/\" data-recalc-dims=\"1\" decoding=\"async\" fetchpriority=\"high\" height=\"192\" sizes=\"(max-width: 975px) 100vw, 975px\" src=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/terms.png?resize=975%2C192&amp;ssl=1\" srcset=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/terms.png?resize=1024%2C202&amp;ssl=1 1024w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/terms.png?resize=300%2C59&amp;ssl=1 300w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/terms.png?resize=768%2C152&amp;ssl=1 768w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/terms.png?resize=1536%2C303&amp;ssl=1 1536w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/terms.png?w=1736&amp;ssl=1 1736w\" width=\"975\"/></figure>\n<h3 class=\"wp-block-heading\" id=\"h-owners-report-case-by-case-decisions\">Owners Report Case-by-Case Decisions</h3>\n<p>Reports from Tesla owners online suggest buyouts are already happening, but on a case-by-case basis.</p>\n<p>One <a href=\"https://www.reddit.com/r/teslacanada/comments/1rclr3g/you_can_finally_buy_out_your_tesla_lease_in_canada/?\"><em>Reddit </em></a>user claiming familiarity with recent lease buyouts said, “This is not publicly advertised. You would have to talk to a tesla rep to make an request for buy out. Because its not advertised, tesla rep can’t guarantee 100%, the wording is case by case approval. Couple of my friends has just bought out their 2021 and 2022 Model Y lesse.”</p>\n<p>Another owner shared a similar experience, noting uncertainty around lease-end decisions. “When I asked mine he said they would decide at the time leased ended… they told me it wasn’t 100% and it would depend on at that time if they were allowing that or not.”</p>\n<h3 class=\"wp-block-heading\" id=\"h-what-this-means-for-canadian-tesla-owners\">What This Means for Canadian Tesla Owners</h3>\n<p>For Canadian Tesla lessees hoping to keep their vehicles, the update could be significant. Rather than a firm no, Tesla now appears to be leaving the door open — even if approvals are not guaranteed.</p>\n<p>For now, lease buyouts in Canada appear to depend on individual circumstances and Tesla’s internal decisions at the time a lease expires. However, the revised policy language shows Tesla is adopting a more flexible approach to lease buyouts in Canada.</p>\n<p>While not an exact match, this update somewhat aligns with changes made to the lease buyout policy in the United States, where <a href=\"https://driveteslacanada.ca/news/tesla-introduces-lease-buyout-option-in-the-us/\">Tesla started allowing them in late 2024</a> on all of their vehicles, including the Cybertruck.</p>\n\n<!-- CONTENT END 2 -->\n</div>",
            "image": "https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2024/12/model3modely-scaled.jpg?fit=975%2C548&ssl=1",
            "link": "https://driveteslacanada.ca/news/tesla-quietly-updates-lease-policy-in-canada-opening-door-lease-buyouts/",
            "pub_date": "2026-02-25 23:25:19",
            "source": "driveteslacanada",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla pushes back against Cybercab trademark claim",
            "description": "<div class=\"entry-content\">\n<p>Tesla is not backing down in its efforts to claim ownership of the “Cybercab” trademark, filing a formal challenge with U.S. regulators against French beverage company UNIBEV, whose <a href=\"https://driveteslacanada.ca/news/teslas-cybercab-trademark-suspended-filing-french-beverage-company/\">earlier filing has blocked Tesla’s application</a>.</p>\n<p>According to newly filed documents submitted to the U.S. Patent and Trademark Office’s (USPTO) Trademark Trial and Appeal Board obtained by <em><a href=\"https://electrek.co/2026/02/24/tesla-files-5-count-opposition-cybercab-trademark-squatter/\">Electrek</a></em>, Tesla has filed a detailed opposition against UNIBEV, accusing the company of fraud, bad faith filings, and attempting to capitalize on Tesla’s growing portfolio of “Cyber”-branded products.</p>\n<p>The dispute arises from a complicated trademark timeline that has been unfolding for months. Tesla publicly revealed the Cybercab <a href=\"https://driveteslacanada.ca/news/tesla-sends-out-invitations-to-10-10-robotaxi-reveal-event-we-robot/\">during its “We, Robot” event</a> in October 2024. However, UNIBEV had already filed for the name in France earlier in 2024 and later submitted a U.S. application on October 28, 2024—before Tesla filed its own paperwork in November.</p>\n<p>Under trademark law, earlier filings often carry significant legal weight, which previously resulted in Tesla’s application being suspended while the competing claim remained active.</p>\n<h3 class=\"wp-block-heading\" id=\"h-tesla-alleges-fraud-and-trademark-squatting\">Tesla Alleges Fraud and Trademark Squatting</h3>\n<p>In its February 18, 2026 opposition filing, Tesla outlines five separate legal arguments challenging UNIBEV’s claim to the name. </p>\n<p>Tesla alleges the beverage company falsely told the USPTO that no other companies were using similar “Cybercab” branding for related products. The automaker argues that claim could not have been accurate given the extensive publicity surrounding the Cybercab reveal two weeks earlier.</p>\n<p>The company also questions whether UNIBEV ever had legitimate plans to produce vehicles or transportation services covered under the trademark classes it applied for. Tesla says the filing fits a common trademark squatting strategy—registering high-profile product names outside a company’s core business in hopes of later negotiating a payout.</p>\n<p>Tesla’s filing also points to connections suggesting awareness of the automaker’s branding, noting UNIBEV’s principal follows Elon Musk and other Musk family accounts, along with SpaceX, on social media.</p>\n<h3 class=\"wp-block-heading\" id=\"h-not-the-first-time\">Not the First Time</h3>\n<p>The Cybercab dispute is not the first between the two companies. UNIBEV already controls <a href=\"https://driveteslacanada.ca/news/tesla-tequila-has-arrived-as-elon-musk-follows-through-on-april-fools-prank/\">trademarks tied to “Teslaquila,”</a> and has also filed applications connected to other Tesla-adjacent names including “Cyberquad” and “Cybertaxi.”</p>\n<p>Tesla argues these filings demonstrate a broader pattern targeting its expanding CYBER-branded vehicle lineup, in particular the already registered Cybertruck trademark.</p>\n<p>While the legal battle continues, Tesla is not slowing down development of the Cybercab, <a href=\"https://driveteslacanada.ca/news/tesla-rolls-first-cybercab-off-production-line-at-giga-texas/\" id=\"114163\" type=\"post\">producing its first unit at Giga Texas just last week</a>. Elon Musk has reiterated several times that <a href=\"https://driveteslacanada.ca/news/elon-musk-confirms-cybercab-production-will-begin-in-april-2026-reveals-first-look-at-unboxed-manufacturing-line/\" id=\"110393\" type=\"post\">volume production will begin April 2026</a>, and also confirmed last week the company aims to <a href=\"https://driveteslacanada.ca/news/elon-musk-confirms-cybercab-deliveries-under-30000-before-2027/\" id=\"114213\" type=\"post\">deliver a sub-$30,000 Cybercab without a steering wheel or pedals to regular customers this year</a>.</p>\n\n<!-- CONTENT END 2 -->\n</div>",
            "image": "https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2024/10/cybercab-robotaxi.jpg?fit=975%2C547&ssl=1",
            "link": "https://driveteslacanada.ca/news/tesla-pushes-back-against-cybercab-trademark-claim/",
            "pub_date": "2026-02-25 23:25:21",
            "source": "driveteslacanada",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rivian expanding service network with 150+ locations planned",
            "description": "<div class=\"entry-content\">\n<p>Rivian is planning to scale its service infrastructure as more of its electric trucks and SUVs hit the road, announcing a significant expansion aimed at improving ownership experience ahead of the highly anticipated launch of the <a href=\"https://driveteslacanada.ca/news/rivian-reveals-new-r2-engineering-details/\" id=\"105007\" type=\"post\">R2 platform</a>.</p>\n<p>According to Rivian, more than 50 new Service Centers are scheduled to open through next year, pushing its global network beyond 150 locations by the end of 2027. Larger, higher-capacity sites are planned for regions where Rivian ownership is most concentrated, while customers in less densely populated areas will increasingly rely on mobile support options.</p>\n<p>Mobile Service has already become the company’s most popular service method, and Rivian plans to increase its fleet of service vans by 50% through 2026. </p>\n<p>At the same time, Rivian has been expanding its workforce to support growing demand. The company says it added and trained more than 1,000 service specialists over the past year alone, while continuing to hire additional technicians for both new and existing locations. Those investments appear to be having an impact, with Rivian reporting a 35% reduction in service scheduling wait times compared to the previous year.</p>\n<p>Technology is also playing a larger role in how Rivian approaches vehicle maintenance. Thanks to the company’s connected vehicle architecture, it can often identify potential issues before owners even notice them. In some cases, problems can be resolved remotely through over-the-air (OTA) software updates, eliminating the need for a service appointment entirely.</p>\n<p>Rivian is also deploying new artificial intelligence (AI) tools behind the scenes to streamline scheduling, repair planning, and parts logistics. Improvements within the Rivian mobile app are intended to make booking appointments easier while improving communication throughout the repair process.</p>\n<p>As the company puts it, “Ultimately, the best service visit is the one you don’t need to make.”</p>\n<p>The service expansion comes at a critical time as Rivian prepares to introduce the <a href=\"https://driveteslacanada.ca/news/rivian-r2-enters-real-world-testing/\" id=\"104257\" type=\"post\">more affordable R2 electric SUV</a>, expected to significantly increase sales volumes.</p>\n\n<!-- CONTENT END 2 -->\n</div>",
            "image": "https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2022/11/rivian-service-vancouver.png?fit=975%2C725&ssl=1",
            "link": "https://driveteslacanada.ca/news/rivian-expanding-service-network-with-150-locations-planned/",
            "pub_date": "2026-02-25 07:46:54",
            "source": "driveteslacanada",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Volvo to Replace High-Voltage Batteries in Over 40,000 EX30 SUVs",
            "description": "<div class=\"entry-content\">\n<p><a href=\"http://driveteslacanada.ca/tag/volvo\">Volvo </a>is recalling more than 40,000 of its all-electric EX30 SUVs worldwide due to a potential battery defect that could increase the risk of a fire — a significant setback for a model that plays a central role in the brand’s EV ambitions.</p>\n<p>According to a report from <em>Reuters</em>, the recall affects 40,323 <a href=\"https://driveteslacanada.ca/news/volvo-ex30-debut-in-the-us-delayed-to-2025-canada-unaffected/\">EX30 Single-Motor Extended Range and Twin-Motor Performance</a> variants equipped with specific high-voltage battery cells. Volvo confirmed the issue involves replacing battery modules after discovering a risk of overheating.</p>\n<p>The Swedish automaker told <em>Reuters</em>, ” We are now contacting the owners of all affected cars to advise them of next steps,” adding that impacted vehicles will receive replacement battery modules at no cost.</p>\n<p>In Canada, the issue has already been formally published by Transport Canada under recall number <a href=\"https://wwwapps.tc.gc.ca/Saf-Sec-Sur/7/VRDB-BDRV/search-recherche/detail.aspx?lang=eng&amp;mk=1838!4876&amp;mkName=VOLVO&amp;md=0&amp;fy=0&amp;ty=9999&amp;arch=0&amp;ls=0&amp;sy=0&amp;syName=All%20Systems&amp;all=0&amp;rn=2026001&amp;cf=SearchResult&amp;pg=0\">2026-001</a>.</p>\n<p>The federal safety notice applies to 85 model year 2025 EX30 units in Canada and warns that an internal issue in the high-voltage battery could cause a short circuit. According to the recall description, a short circuit “can create a fire risk, even while the vehicle is parked and turned off.”</p>\n<p>As a precaution, Canadian owners are being advised to limit charging to 70% and park outdoors away from buildings or other vehicles until repairs are completed. The final corrective fix is still under development.</p>\n<p>Battery supplier Shandong Geely Sunwoda Power Battery Co., a Geely-backed joint venture, manufactured the affected cells. Volvo says the supplier has addressed the defect and will provide updated battery modules.</p>\n<p>However, the financial implications could be significant, with estimates that replacement battery packs alone could cost approximately $195 million, not including labour and logistics.</p>\n<p>Volvo isn’t alone in grappling with battery-related recalls. Just last week <a href=\"https://driveteslacanada.ca/news/mercedes-benz-to-replace-battery-packs-on-12000-eqb-electric-suvs-over-battery-fire-risk/\">Mercedes-Benz issued a recall</a> affecting certain EQB electric SUVs over similar battery fire concerns. The fix for that recall is also replace the high-voltage battery packs.</p>\n\n<!-- CONTENT END 2 -->\n</div>",
            "image": "https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2023/06/313302_Volvo_EX30_exterior-scaled.jpg?fit=975%2C731&ssl=1",
            "link": "https://driveteslacanada.ca/news/volvo-to-replace-high-voltage-batteries-in-over-40000-ex30-suvs/",
            "pub_date": "2026-02-25 07:16:33",
            "source": "driveteslacanada",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lucid Beats Revenue Expectations, Confirms Midsize Vehicle Production in 2026",
            "description": "<div class=\"entry-content\">\n<p>Lucid Group has released its fourth-quarter and full-year 2025 financial results, showing strong delivery growth and record revenue — but also highlighting the continued financial challenges facing the automaker as it scales production and works toward profitability.</p>\n<p>As we previously reported, the California-based EV company <a href=\"https://driveteslacanada.ca/news/lucid-doubles-annual-production-in-2025-finishes-year-with-record-q4-output/\" id=\"112671\" type=\"post\">delivered 15,841 vehicles in 2025</a>, representing a 55% increase year-over-year, including 5,345 deliveries in the fourth quarter alone, its eighth consecutive quarter of record deliveries. Much of that growth was driven by the ongoing ramp-up of the company’s second vehicle, the Lucid Gravity SUV.</p>\n<p>Revenue followed a similar trajectory. Lucid reported Q4 revenue of $522.7 million, more than doubling compared to the same period in 2024 and exceeding Wall Street expectations. Full-year revenue reached $1.35 billion, a 68% increase year-over-year and the highest annual total in the company’s history.</p>\n<p>Despite those gains, Lucid remains firmly in investment mode. The company posted a GAAP net loss of $814 million in the fourth quarter, or $(3.62) per share, contributing to a full-year loss of $(12.09) per share as it continues funding vehicle development, manufacturing expansion, and future technology programs.</p>\n<p>Lucid ended the year with approximately $4.6 billion in total liquidity, providing what executives say is sufficient flexibility to continue investing in upcoming products and autonomy initiatives while managing near-term operations.</p>\n<p>In 2026 Lucid expects a significant increase in output this year, issuing production guidance of 25,000 to 27,000 vehicles — potentially more than 50% higher than its revised 2025 production total of 17,840 units.</p>\n<p>The company also announced it had to adjust its previously announced production figures after determining that 538 vehicles had not completed final internal validation procedures required to be officially classified as produced. Lucid said those vehicles are expected to complete the process in 2026 and that the revision does not impact financial results or delivery totals.</p>\n<p>Beyond increasing production of the Gravity SUV, Lucid is also preparing for its next growth phase. The automaker confirmed plans to <a href=\"https://driveteslacanada.ca/news/lucid-confirms-2026-launch-for-50k-midsize-electric-suv/\" id=\"103186\" type=\"post\">begin production of its upcoming midsize platform vehicle</a> while advancing autonomy efforts tied to planned <a href=\"https://driveteslacanada.ca/news/lucid-delivers-first-gravity-robotaxi-for-uber-nuro-integration/\" id=\"108457\" type=\"post\">robotaxi deployments with Nuro</a>.</p>\n<p>However, challenges remain. The company recently <a href=\"https://driveteslacanada.ca/news/lucid-announces-third-major-layoff-in-three-years-slashes-12-of-staff/\" id=\"114286\" type=\"post\">announced its third round of major layoffs</a>, affecting roughly 12% of its U.S. salaried employees as part of broader efforts to improve efficiency and control spending.</p>\n\n<!-- CONTENT END 2 -->\n</div>",
            "image": "https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2025/01/lucid-scaled.jpg?fit=975%2C548&ssl=1",
            "link": "https://driveteslacanada.ca/news/lucid-beats-revenue-expectations-confirms-midsize-vehicle-production-in-2026/",
            "pub_date": "2026-02-25 05:51:51",
            "source": "driveteslacanada",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla confirms Cybertruck AWD price increase coming next month",
            "description": "<div class=\"entry-content\">\n<p>Tesla has now made it official, as the company has confirmed that the <a href=\"https://driveteslacanada.ca/news/tesla-launches-59990-cybertruck-awd-that-may-beat-the-2019-reveal/\" id=\"114256\" type=\"post\">$59,990 Dual Motor All-Wheel Drive Cybertruck</a> will not remain at its current price for long.</p>\n<p>The update comes after CEO Elon Musk previously <a href=\"https://driveteslacanada.ca/news/elon-musk-clarifies-10-day-59k-cybertruck-window-price-likely-to-change-based-on-demand/\" id=\"114310\" type=\"post\">hinted that future pricing would depend</a> on demand at the current level. Less than one week after the trim was introduced, Tesla has apparently seen enough demand to raise prices.</p>\n<p>Since launching the sub-$60,000 AWD configuration, Tesla has seemingly had a strong response from buyers. <a href=\"https://driveteslacanada.ca/news/tesla-cybertruck-awd-delivery-timelines-slip-to-fall-2026-as-demand-surges/\" id=\"114349\" type=\"post\">As we told you earlier today</a>, delivery estimates for new U.S. orders were already pushed back from June 2026 to September–October 2026, presumably due to high demand.</p>\n<p>For many, the new trim finally brought Cybertruck pricing closer to what buyers had been waiting for — a balance between capability and affordability that reignited interest in the stainless steel pickup truck. </p>\n<p>Now that interest has resulted in Tesla deciding to raise the price after February 28, according to a new message that appeared on the online configurator on Tuesday morning. </p>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-114369\" data-attachment-id=\"114369\" data-comments-opened=\"1\" data-image-caption=\"\" data-image-description=\"\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"cybertruck increase\" data-large-file=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/cybertruck-increase.png?fit=975%2C536&amp;ssl=1\" data-medium-file=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/cybertruck-increase.png?fit=300%2C165&amp;ssl=1\" data-orig-file=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/cybertruck-increase.png?fit=1912%2C1052&amp;ssl=1\" data-orig-size=\"1912,1052\" data-permalink=\"https://driveteslacanada.ca/news/tesla-confirms-cybertruck-awd-price-increase-coming-next-month/attachment/cybertruck-increase/\" data-recalc-dims=\"1\" decoding=\"async\" fetchpriority=\"high\" height=\"536\" sizes=\"(max-width: 975px) 100vw, 975px\" src=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/cybertruck-increase.png?resize=975%2C536&amp;ssl=1\" srcset=\"https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/cybertruck-increase.png?resize=1024%2C563&amp;ssl=1 1024w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/cybertruck-increase.png?resize=300%2C165&amp;ssl=1 300w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/cybertruck-increase.png?resize=768%2C423&amp;ssl=1 768w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/cybertruck-increase.png?resize=1536%2C845&amp;ssl=1 1536w, https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/cybertruck-increase.png?w=1912&amp;ssl=1 1912w\" width=\"975\"/></figure>\n<p>The big questions now are how much above $59,990 that price will be, and how the price increase will affect demand. </p>\n<p>Raising prices so soon after generating excitement could slow order activity just as Cybertruck <a href=\"https://driveteslacanada.ca/news/teslas-premium-lineup-faces-pressure-as-cybertruck-sales-fall/\" id=\"105711\" type=\"post\">demand is finally on an upward trend</a>. One argument is that Tesla may be better served keeping the price steady while continuing to build its order backlog and extending delivery timelines. </p>\n<p>At the same time, history suggests demand may remain strong even with a modest increase. The Cybertruck AWD launched at a massive discount compared to other trims, dropping from roughly $80,000 to just under $60,000. Even an adjustment of up to $5,000 would still leave the truck meaningfully cheaper than where buyers were only last week.</p>\n<p>There are also other levers Tesla could pull on their higher trim Cybertrucks without immediately raising entry-level pricing. Enticing financing offers, upgrade incentives, or other targeted promotions could encourage buyers to move into higher trims which could help improve margins while preserving a sub-$60K Cybertruck.</p>\n<p>If Tesla ultimately raises pricing by a relatively small amount, many buyers may still view the vehicle as strong value compared to both earlier Cybertruck pricing and competing electric pickups.</p>\n<p>How much do you think the price increase will be? Let us know in the comments below.</p>\n\n<!-- CONTENT END 2 -->\n</div>",
            "image": "https://i0.wp.com/driveteslacanada.ca/wp-content/uploads/2026/02/cybertruck-awd-scaled.jpg?fit=975%2C605&ssl=1",
            "link": "https://driveteslacanada.ca/news/tesla-confirms-cybertruck-awd-price-increase-coming-next-month/",
            "pub_date": "2026-02-25 03:37:02",
            "source": "driveteslacanada",
            "kind": 1,
            "language": "en"
        }
    ]
}