{
    "data": [
        {
            "id": "4875578",
            "title": "Ironwood Pharmaceuticals: Downgrading On Pipeline Setback And Extended Timeline For Apraglutide",
            "description": "<figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2238138457/image_2238138457.jpg?io=getty-c-w630\" alt=\"Asian scientist woman analyzing samples using microscope\" data-id=\"2238138457\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2238138457/image_2238138457.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2238138457/image_2238138457.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2238138457/image_2238138457.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2238138457/image_2238138457.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2238138457/image_2238138457.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2238138457/image_2238138457.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2238138457/image_2238138457.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2238138457/image_2238138457.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Carlo Prearo/iStock via Getty Images</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <p data-eci=\"true\">The last time I spoke about <strong>Ironwood Pharmaceuticals</strong> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IRWD\" title=\"Ironwood Pharmaceuticals, Inc.\">IRWD</a></span>), it was with respect to a Seeking Alpha article entitled \"<strong><a href=\"https://seekingalpha.com/article/4700204-ironwood-pharmaceuticals-q3-of-2024-data-readout-for-pbc\" title=\"https://seekingalpha.com/article/4700204-ironwood-pharmaceuticals-q3-of-2024-data-readout-for-pbc\" target=\"_blank\">Ironwood Pharmaceuticals: Q3 of 2024 Data Readout For PBC</a></strong>.\" With respect to this article, I mentioned a huge<span class=\"paywall-full-content\"> opportunity that the company had where it had the potential to exercise its option for exclusive access to a drug known as CNP-104 for the treatment of patients with primary biliary cholangitis [PBC]. I had given the stock a \"Buy\" rating on this potential, along with sales of LINZESS [linaclotide] increasing. Today, I'm downgrading this stock from a \"Buy\" rating to a \"Sell.\" There are several reasons for doing so at this present time, which I'm about to go over now. The first reason is because the hope was that once Ironwood saw the data of CNP-104 treating patients with PBC, it would like what it saw.</span></p> <p class=\"paywall-full-content\">Furthermore, it would choose to exercise its option to exclusively license CNP-104 for the treatment of these liver disease patients. Unfortunately, that's not what happened at all. Upon observing the topline data from COUR Pharmaceutical Development Company, Inc. [COUR], Ironwood notified it on September 27, 2024 [<strong><a href=\"https://www.sec.gov/Archives/edgar/data/1446847/000110465924115052/tm2427582d1_ex99-1.htm\" rel=\"nofollow\" title=\"https://www.sec.gov/Archives/edgar/data/1446847/000110465924115052/tm2427582d1_ex99-1.htm\" target=\"_blank\">Pipeline Update subsection note under CNP-104</a></strong>] that it would not exercise its option to acquire an exclusive license to CNP-104. This pipeline setback is the first reason for the downgrade rating. The second reason is because the hope is that LINZESS sales would continue to increase, but something bad happened with earnings the other day. It was noted that sales decreased by 6% to $864.5 million in 2025 compared to that of 2024, with sales of $916.3 million. It believes that LINZESS had fallen short because of the phasing of gross-to-net rebate reserves and pricing headwinds for Medicare Part D.</p> <p class=\"paywall-full-content\">It is bullish, with a projection of a 30% increase in full-year 2026 LINZESS U.S. sales to be between $1.125 and $1.175 billion. Despite this, it remains to be seen if it can actually execute such an expected increase. What is bullish is that it met with the FDA in Q4 of 2025 to advance apraglutide as a once-weekly, long-acting synthetic glucagon-like peptide-2 [GLP-2] analog to treat patients with short bowel syndrome with intestinal failure [SBS-IF]. A phase 3 study, known as STARS-2 for this program, is expected to initiate in Q2 of 2026. The major downside is that while this program is encouraging, a regulatory application for approval is not expected to happen until maybe around 2028/2029. Plus, that is only to happen if the primary endpoint of the study is met in a statistically significant manner.</p> <h2 class=\"paywall-full-content\">Phase 3 Study Initiation Is Bullish But Could Take Several Years For Catalyst Or Meaningful Impact</h2> <p class=\"paywall-full-content\">What I want to go over is a potential way that Ironwood Pharmaceuticals might be able to redeem itself and boost shareholder value. As I stated above, it believes that full-year 2026 LINZESS sales are going to increase by 30%, with a projection of sales between $1.125 and $1.175 billion. However, what it does have going for it is that it already met with the FDA in Q4 of 2025. This meeting was set in place to discuss the potential of moving apraglutide forward for the treatment of patients with short bowel syndrome with intestinal failure [SBS-IF]. As a matter of fact, there was alignment on a confirmatory phase 3 study that would be required to potentially obtain FDA approval of this drug for the treatment of these patients, to be known as STARS-2. The truth is that the company already established efficacy in a large phase 3 trial known as STARS. Before going over the clinical data released from this specific late-stage study, plus any catalysts to come from it for investors to look forward to, I believe it is first important to go over what this disorder is and what the market opportunity for the company could end up being.</p> <p class=\"paywall-full-content\"><strong><a href=\"https://www.shortbowelsyndrome.com/sbs-management?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=UB+%7C+SBS+%7C+hydration/diet+%7C+GOOG+%7C+DSE+%7C+FY25&amp;utm_content=Hydration&amp;utm_term=short+gut+dehydration&amp;gclsrc=aw.ds&amp;gad_source=1&amp;gad_campaignid=21784653015&amp;gbraid=0AAAAA9cSBmH31xuYSt4-lj_11JA3oL76H&amp;gclid=EAIaIQobChMI2dDuvbn3kgMVt7haBR2ppyqLEAMYASAAEgIwPfD_BwE#SBSdiet\" rel=\"nofollow\" title=\"https://www.shortbowelsyndrome.com/sbs-management?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=UB+%7C+SBS+%7C+hydration/diet+%7C+GOOG+%7C+DSE+%7C+FY25&amp;utm_content=Hydration&amp;utm_term=short+gut+dehydration&amp;gclsrc=aw.ds&amp;gad_source=1&amp;gad_campaignid=21784653015&amp;gbraid=0AAAAA9cSBmH31xuYSt4-lj_11JA3oL76H&amp;gclid=EAIaIQobChMI2dDuvbn3kgMVt7haBR2ppyqLEAMYASAAEgIwPfD_BwE#SBSdiet\" target=\"_blank\">Short Bowel Syndrome [SBS]</a></strong> is a type of disorder where the small intestine is surgically removed. Either that or it is damaged and dysfunctional. The problem with these items is that if the small intestine is missing or can't perform its function, then it can't adequately absorb nutrients from food. This causes malabsorption for the patient, which in turn causes a host of symptoms that these patients have to deal with, such as the following :</p> <ul class=\"paywall-full-content\"> <li><em><strong>Food sensitivity</strong></em></li> <li><em><strong>Bloating </strong></em></li> <li><em><strong>Heartburn </strong></em></li> <li><em><strong>Dehydration </strong></em></li> </ul> <p class=\"paywall-full-content\">In terms of the need for surgical removal of the small intestine, this can be caused by several reasons as well, which are :</p> <ul class=\"paywall-full-content\"> <li><em><strong>Crohn's Disease </strong></em></li> <li><em><strong>Blood clots of arteries to the small intestine </strong></em></li> <li><em><strong>Cancer </strong></em></li> <li><em><strong>Injury of some sort </strong></em></li> <li><em><strong>Birth defect </strong></em></li> </ul> <p class=\"paywall-full-content\">Short Bowel Syndrome with intestinal failure [SBS-IF] is just; that with a missing or ineffective intestine, nutrients can't be absorbed at all. Such patients are in desperate need of parenteral support [PS], where intravenous nutrients and fluids are given to patients. Especially when oral intake isn't even an option at all. The market opportunity in the United States alone is sufficient for the company to tackle. It is expected that the U.S. short bowel syndrome market is <strong><a href=\"https://www.fortunebusinessinsights.com/short-bowel-syndrome-market-107071#:~:text=The%20global%20short%20bowel%20syndrome,such%20as%20higher%20diagnosis%20rates.\" rel=\"nofollow\" title=\"https://www.fortunebusinessinsights.com/short-bowel-syndrome-market-107071#:~:text=The%20global%20short%20bowel%20syndrome,such%20as%20higher%20diagnosis%20rates.\" target=\"_blank\">expected to reach $1.93 billion by 2032</a></strong>. The thing is that it remains to be seen whether the company is going to be able to achieve a successful outcome from its confirmatory phase 3 STARS-2 study using its GLP-2 analog apraglutide to treat these SBS-IF patients.</p> <p class=\"paywall-full-content\">The thing is that the company can go after an unmet medical need for sure. There is one major reason why I believe this is the case. The main reason is that these patients are dependent on parenteral support [PS]. Why is this a bad thing? That's because the cost for such support is outrageous. Consider that the range for such PS is estimated to be <strong><a href=\"https://www.fortunebusinessinsights.com/short-bowel-syndrome-market-107071#:~:text=The%20global%20short%20bowel%20syndrome,such%20as%20higher%20diagnosis%20rates.\" rel=\"nofollow\" title=\"https://www.fortunebusinessinsights.com/short-bowel-syndrome-market-107071#:~:text=The%20global%20short%20bowel%20syndrome,such%20as%20higher%20diagnosis%20rates.\" target=\"_blank\">between $65,000 and $320,000 annually</a></strong>. Furthermore, it is not ideal to be dependent upon long-term care with PS. The reason why is because long-term use is associated with several problems like catheter sepsis, liver dysfunction, and more.</p> <p class=\"paywall-full-content\">There is only one drug approved right now for SBS, and it is GLP-2 <strong><a href=\"https://www.gattexhcp.com/moa/?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=BR+%7C+gattex+%7C+moa+%7C+GOOG+%7C+HCP+%7C+FY25&amp;utm_content=GATTEX+Core&amp;utm_term=GATTEX&amp;gclsrc=aw.ds&amp;gad_source=1&amp;gad_campaignid=21797896036&amp;gbraid=0AAAAA9cSAXTeS1Reieo2W147vjZ5t0FH4&amp;gclid=EAIaIQobChMIlIz40Lz3kgMViKNaBR1oJS2iEAAYASAAEgJ5S_D_BwE\" rel=\"nofollow\" title=\"https://www.gattexhcp.com/moa/?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=BR+%7C+gattex+%7C+moa+%7C+GOOG+%7C+HCP+%7C+FY25&amp;utm_content=GATTEX+Core&amp;utm_term=GATTEX&amp;gclsrc=aw.ds&amp;gad_source=1&amp;gad_campaignid=21797896036&amp;gbraid=0AAAAA9cSAXTeS1Reieo2W147vjZ5t0FH4&amp;gclid=EAIaIQobChMIlIz40Lz3kgMViKNaBR1oJS2iEAAYASAAEgJ5S_D_BwE\" target=\"_blank\">GATTEX [teduglutide]</a></strong> from <strong>Takeda Pharmaceuticals</strong> (<a href=\"https://seekingalpha.com/symbol/TAK\" title=\"Takeda Pharmaceutical Company Limited\">TAK</a>). The downside, from what I see, is that this must be taken once daily as a subcutaneous [SC] injection. There is once- or twice-weekly glepaglutide from Zealand Pharma, which succeeded in phase 3 testing treating patients with SBS. However, in late 2024, it <strong><a href=\"https://www.globenewswire.com/news-release/2024/12/19/3000220/0/en/U-S-Food-and-Drug-Administration-issues-Complete-Response-Letter-for-the-glepaglutide-New-Drug-Application-for-the-treatment-of-short-bowel-syndrome.html\" rel=\"nofollow\" title=\"https://www.globenewswire.com/news-release/2024/12/19/3000220/0/en/U-S-Food-and-Drug-Administration-issues-Complete-Response-Letter-for-the-glepaglutide-New-Drug-Application-for-the-treatment-of-short-bowel-syndrome.html\" target=\"_blank\">was given a Complete Response Letter [CRL]</a></strong> citing that more data would be needed to obtain regulatory approval. From what it appears with this CRL, one phase 3 study doesn't appear to be enough to confirm benefit. That's why when Ironwood met with the FDA in April of 2025, it was notified that it must run the phase 3 confirmatory STARS-2 study in order to be able to file an NDA of apraglutide for the treatment of patients with SBS-IF.</p> <p class=\"paywall-full-content\">To this end, Ironwood is preparing to initiate the confirmatory phase 3 STARS-2 trial in Q2 of 2026. The hope is that apraglutide is going to achieve statistical significance yet again with respect to the intended primary efficacy endpoint of relative change from baseline of weekly PS volume over a 24-week period. The thing is that this program appears to be a good one, but the problem is that such a study could take a few years to run. Plus, there is no way of knowing at this point if the primary efficacy endpoint is going to be met in a statistically significant manner. There is a good chance of it happening, since the company proved to achieve this very endpoint from the prior <strong><a href=\"https://clinicaltrials.gov/study/NCT04627025?term=STARS%20SBS&amp;rank=1\" rel=\"nofollow\" title=\"https://clinicaltrials.gov/study/NCT04627025?term=STARS%20SBS&amp;rank=1\" target=\"_blank\">STARS study</a></strong>, which I'm about to go over now. The thing to note first is that there were a total of 164 patients with SBS-IF that were recruited. They were first split into two different categories in 50/50 fashion :</p> <ul class=\"paywall-full-content\"> <li><em><strong>Stoma - colon lead out to create a pouch for waste to come from </strong></em></li> <li><em><strong>Colon-in-continuity - normal or near-normal bowel movements still possible </strong></em></li> </ul> <p class=\"paywall-full-content\">After patients were divided in this fashion, they were then randomized 2:1 to receive either of the following treatments :</p> <ul class=\"paywall-full-content\"> <li><em><strong>Once-weekly apragrlutide </strong></em></li> <li><em><strong>Placebo comparator </strong></em></li> </ul> <p class=\"paywall-full-content\">The primary endpoint for this STARS study is the same as that which has been established for the soon-to-be-initiated STARS-2 study. Such an endpoint is the change from baseline in actual weekly PS volume at 24 weeks. This primary endpoint, as part of the STARS study, was met in a <strong><a href=\"https://investor.ironwoodpharma.com/press-releases/press-release-details/2024/Ironwood-Pharmaceuticals-Announces-Positive-Topline-Results-from-Global-Phase-III-Trial-of-Once-Weekly-Apraglutide-in-Adults-with-Short-Bowel-Syndrome-with-Intestinal-Failure-SBS-IF/default.aspx\" rel=\"nofollow\" title=\"https://investor.ironwoodpharma.com/press-releases/press-release-details/2024/Ironwood-Pharmaceuticals-Announces-Positive-Topline-Results-from-Global-Phase-III-Trial-of-Once-Weekly-Apraglutide-in-Adults-with-Short-Bowel-Syndrome-with-Intestinal-Failure-SBS-IF/default.aspx\" target=\"_blank\">statistically significant manner with a p-value of p=0.001</a></strong>. Another way to look at this is in terms of drop in PS volume, which is as follows :</p> <ul class=\"paywall-full-content\"> <li><em><strong>-25.5 PS drop for patients who took apraglutide </strong></em></li> <li><em><strong>-12.5 PS drop for patients on placebo </strong></em></li> </ul> <p class=\"paywall-full-content\">The notion here is that what was achieved for STARS must now again be replicated in STARS-2. The problem again with this is that this study has not yet been initiated and will not be done so until Q2 of 2026. Plus, it is going to be a few years before data is even released from this trial. Of course, if the primary endpoint is met, then I would expect an NDA filing of apraglutide for the treatment of patients with SBS-IF shortly thereafter. What about the competition? If the company can get data right, then it might be able to fend them off with one competitive advantage, which is dosing. Apraglutide is the only long-acting, once-weekly GLP-2 that is known to treat these patients.</p> <h2 class=\"paywall-full-content\">Financials</h2> <p class=\"paywall-full-content\">Ironwood Pharmaceuticals <strong><a href=\"https://investor.ironwoodpharma.com/press-releases/press-release-details/2026/Ironwood-Pharmaceuticals-Reports-Fourth-Quarter-and-Full-Year-2025-Results-Achieves-2025-Financial-Guidance-and-Reiterates-Strong-2026-Outlook/default.aspx\" rel=\"nofollow\" title=\"https://investor.ironwoodpharma.com/press-releases/press-release-details/2026/Ironwood-Pharmaceuticals-Reports-Fourth-Quarter-and-Full-Year-2025-Results-Achieves-2025-Financial-Guidance-and-Reiterates-Strong-2026-Outlook/default.aspx\" target=\"_blank\">ended Q4 of 2025 with $215.5 million in cash</a></strong>, compared to the same time period in 2024, where it only ended with $88.6 million. Financially, the company does have debt on its books to mention. This would be in terms of the $200 million aggregate principal amount of convertible notes, which are due in June of 2026. On the flip side, it also has about $385 million in the aggregate principal amount of a Revolving Credit Facility that it can tap into. It entered into this credit facility back in 2023, and it was done to partially fund the VectivBio acquisition. Despite cash inflows from the revenues to be generated by LINZESS, plus the Revolving Credit Facility I just went over above, it believes that this will only be enough to fund its operations for at least the next 12 months. It burns roughly $41.15 million of cash per quarter. This is broken down into $21.86 million in R&amp;D expenses and then $19.29 million in SG&amp;A expenses.</p> <h2 class=\"paywall-full-content\">Risks To Business</h2> <p class=\"paywall-full-content\">There are several risks that investors should be aware of before investing in Ironwood Pharmaceuticals. The first risk to consider is in terms of the recent guidance given, which is that it expects full-year 2026 U.S. revenues of LINZESS to increase by 30% to a range of $1.125 and $1.175 billion. The risk here is that there is no assurance that the initial headwinds observed in Q4 of 2025 won't be carried over in 2026. Nor that the company is going to be able to meet its guidance of LINZESS sales as expected for full-year 2026. Especially when you consider that from 2024 to 2025, it saw a decline in full-year sales of this drug. In 2024, it posted U.S. sales of LINZESS to be $916.3 million. However, in 2025, full-year sales decreased by 6% to $864.5 million.</p> <p class=\"paywall-full-content\">The second risk to consider would be in terms of its development of its GLP-2 analog apraglutide for the treatment of patients with SBS-IF. It gained alignment with the FDA that a confirmatory phase 3 study is going to be necessary for it to be in a future position for it to file an NDA of this drug for the treatment of these patients. The risk here is that upon the release of data from the soon-to-be initiated phase 3 STARS-2 study, there is no guarantee that the final primary endpoint of relative change from baseline of actual weekly PS volume is going to be met in a statistically significant manner.</p> <p class=\"paywall-full-content\">The third and final risk to consider would be that of the competition I went over above. As I mentioned beforehand, Takeda Pharmaceutical has the only GLP-2 drug approved for the treatment of patients with SBS-IF, known as GATTEX. Plus, there is the competition that could come about if Zealand Pharma can eventually obtain FDA approval of its drug glepaglutide for these patients. Where Ironwood could possibly gain a competitive edge is in terms of dosing. Its long-acting, once-weekly dosing of apraglutide could be crucial over these other therapies, which require additional dosing throughout the week. The risk here is that there is no guarantee that the final outcome from the phase 3 STARS-2 study is going to establish such a competitive advantage. Nor that apraglutide from Ironwood will be approved to treat these SBS-IF patients that it will be able to produce sufficient revenues from it.</p> <h2 class=\"paywall-full-content\">Conclusion</h2> <p class=\"paywall-full-content\">The hope was that the company would be able to execute on several measures to continue to warrant a \"Buy\" rating from me. However, the company failed to move forward with exercising its option to exclusively license CNP-104 for the treatment of patients with primary biliary cholangitis [PBC]. This was a major setback for its pipeline and the first reason for my downgrade. The second reason, again, is because U.S. sales just posted for LINZESS in Q4 of 2025 decreased. It remains to be seen if it is going to be able to meet its full-year 2026 U.S. sales expectation guided to be in that range of $1.125 and $1.175 billion. Apraglutide appears to be going well, but it is going to be a few years before data is known for this candidate. Plus, even if the primary endpoint is met for the STARS-2 study, Ironwood would still need to be able to obtain U.S. marketing approval for it. With everything listed above, I think that this stock should be downgraded to a \"Sell\" rating.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2238138457/image_2238138457.jpg",
            "link": "https://seekingalpha.com/article/4875578-ironwood-pharmaceuticals-downgrading-pipeline-setback-and-extended-timeline-apraglutide",
            "pub_date": "2026-02-27 03:05:54",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4875560",
            "title": "Ciena: Expensive For A Reason",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153902731/image_2153902731.jpg?io=getty-c-w630\" alt=\"Ciena Canada office building in Ottawa, ON, Canada.\" data-id=\"2153902731\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153902731/image_2153902731.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153902731/image_2153902731.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153902731/image_2153902731.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153902731/image_2153902731.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153902731/image_2153902731.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153902731/image_2153902731.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153902731/image_2153902731.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153902731/image_2153902731.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">JHVEPhoto/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Ciena Corporation's (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CIEN\" title=\"Ciena Corporation\">CIEN</a></span>) share price has soared by over 300% over the last 12 months and by almost 50% year-to-date. The company has a strong AI exposure because of the strengthening foothold of its Networking Platforms<span class=\"paywall-full-content\"> segment, which offers high-performance connectivity solutions for AI infrastructure. Ciena demonstrates everything that I appreciate as a value investors: accelerating revenue growth, operating leverage, a healthy balance sheet, and a stable outstanding shares count. Valuation might be a notable area of concern, but I think that highly probable positive earnings revisions after the upcoming earnings release will help mitigate this risk. Moreover, I believe that at least over the next few quarters, the power of momentum will outshine CIEN's high multiples. All in all, I assign a Buy rating to CIEN.</span></p> <h2 class=\"paywall-full-content\">Fundamentals and earnings preview</h2> <p class=\"paywall-full-content\">In its <a href=\"https://seekingalpha.com/filing/77319676\">latest 10-K report</a>, Ciena is described as a network technology company that provides hardware, software, and services to a wide range of network operators. The company's major segment is Networking Platforms, which generated 77% of Ciena's consolidated sales in FQ4 2025. This segment has direct AI exposure, as it offers high-performance connectivity solutions for AI infrastructure.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721036950040953_origin.png\" rel=\"lightbox\" data-width=\"1381\" data-height=\"719\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721036950040953_origin.png?io=w640\" alt=\"Ciena's latest earnings presentation\" width=\"640\" height=\"333\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721036950040953_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721036950040953_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721036950040953_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721036950040953_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Ciena's latest earnings presentation</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The company historically had a substantial exposure to the telecom industry. However, I like the fact that it demonstrates proactiveness and flexibility, as the share of non-telco revenues has increased significantly over the last few years. As of FQ4 2025, the proportion of non-telco revenue increased to 55%, and the lion's portion of this non-telco revenue is represented by contracts with direct cloud providers. Moreover, the share of sales generated from direct cloud providers is consistently expanding.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721043362904837_origin.png\" rel=\"lightbox\" data-width=\"1297\" data-height=\"662\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721043362904837_origin.png?io=w640\" alt=\"Ciena's latest earnings presentation\" width=\"640\" height=\"327\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721043362904837_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721043362904837_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721043362904837_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721043362904837_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Ciena's latest earnings presentation</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Ciena released its latest <a href=\"https://seekingalpha.com/pr/20336340-ciena-reports-fiscal-fourth-quarter-2025-and-year-end-financial-results#hasComeFromMpArticle=false\">quarterly earnings</a> on December 11, delivering a third <a href=\"https://seekingalpha.com/news/4530430-ciena-non-gaap-eps-of-0_91-beats-by-0_14-revenue-of-1_35b-beats-by-60m\">dual beat</a> in a row. Revenue increased by 20% on a YoY basis, while the EPS increased much faster, from $0.54 to $0.91. It was a high-quality EPS growth as it was powered by increased profitability ratios. Ciena's adjusted operating margin increased from 9.7% to 11.2% YoY in Q4. Cash-generating capacity is also strong, with a levered FCF of $667 million in FY2025, a 49% increase compared to FY2024.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721056551537347_origin.png\" rel=\"lightbox\" data-width=\"1299\" data-height=\"571\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721056551537347_origin.png?io=w640\" alt=\"Ciena's latest earnings presentation\" width=\"640\" height=\"281\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721056551537347_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721056551537347_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721056551537347_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721056551537347_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Ciena's latest earnings presentation</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">And Ciena's FCF-generating capacity is likely to improve further. For the fiscal year 2026, the management expects the adjusted operating margin to expand by almost six percentage points, to 17%. Moreover, the $5.9 billion midpoint of the revenue guidance range means that full-year revenue growth is poised to accelerate to almost 24% from the 18% increase recorded in FY2025. Therefore, Ciena's already extremely strong <a href=\"https://seekingalpha.com/symbol/CIEN/balance-sheet\">balance sheet</a> with very low leverage and ample liquidity is poised to strengthen further and expand the company's financial flexibility. This is another big positive fundamental factor because Ciena invests quite aggressively in R&amp;D; <a href=\"https://seekingalpha.com/symbol/CIEN/income-statement\">~18% of sales</a> were reinvested in R&amp;D during FY2025.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-1772105816055346.png?io=w640\" alt=\"Seeking Alpha\" contenteditable=\"false\" width=\"424\" height=\"433\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-1772105816055346.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-1772105816055346.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Ciena's FQ1 2026 earnings are around the corner as the company is <a href=\"https://seekingalpha.com/symbol/CIEN/earnings\">set to report</a> on March 5. Wall Street analysts expect CIEN to deliver accelerated revenue growth compared to Q4 2025, with a projected 30% increase. The company's unit economics is expected to improve substantially as Wall Street analysts expect a staggering 81.5% adjusted EPS growth. The fact that there have been only positive <a href=\"https://seekingalpha.com/symbol/CIEN/earnings/revisions\">EPS revisions</a> over the last 90 days indicates that Wall Street analysts are extremely optimistic about CIEN's ability to deliver a solid earnings surprise next week.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721060187595189.png?io=w640\" alt=\"Seeking Alpha\" contenteditable=\"false\" width=\"590\" height=\"207\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721060187595189.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721060187595189.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721060187595189.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">It is difficult not to agree with Wall Street's optimism because Ciena has a proven record of capitalizing on the global AI data center spending spree. The calendar Q4 earnings season of the largest investors in AI infrastructure revealed their accelerated investments in capex during the last three months of 2025. Moreover, all giants confirmed that they plan to increase investments in AI-related capex in 2026 as well. Therefore, the increasing demand for connectivity from hyperscalers creates a substantial structural tailwind for Ciena.</p> <p class=\"paywall-full-content\">Moreover, during the fresh earnings release, Nvidia's management provided the public with several bullish insights regarding the longevity of AI tailwinds. According to CEO <a href=\"https://seekingalpha.com/article/4875147-nvidia-corporation-2026-q4-results-earnings-call-presentation\">Jensen Huang and his colleagues</a>, \"frontier agentic systems have reached an inflection point\" meaning that tokens are becoming profitable. It is a crucial development that demonstrates that the market's fears regarding uncertainty of returns from increasing AI capex were highly likely overblown.</p> <p class=\"paywall-full-content\">Moreover, Nvidia's management also said during their earnings call that the next generation of its AI accelerators, the Rubin platform, will reduce inference token costs by up to 10 times compared to Blackwell. It implies that profitability per token will significantly improve further, making new investments more and more justified from an economic perspective.</p> <p class=\"paywall-full-content\">With all that being said, I expect an extremely bullish tone from Ciena's management during the next week's earnings call.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721085751798923_origin.png\" rel=\"lightbox\" data-width=\"867\" data-height=\"272\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721085751798923_origin.png?io=w640\" alt=\"Seeking Alpha\" width=\"640\" height=\"201\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721085751798923_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721085751798923_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721085751798923_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721085751798923_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Finally, the power of momentum should not be underestimated, especially when we speak about a company with expanding margins and a strong balance sheet like Ciena. The stock is gaining more attention from investors, which drives the demand and pushes the share price further. Since CIEN boasts a strong balance sheet and expanding FCF-generating capacity, shareholders are extremely unlikely to suffer from a potential dilution of equity investors via new share issues. Despite the sharp share price increase over the last twelve months, the number of outstanding shares <a href=\"https://seekingalpha.com/symbol/CIEN/balance-sheet\">was stable in 2025</a>.</p> <h2 class=\"paywall-full-content\">Valuation as a major risk</h2> <p class=\"paywall-full-content\">When any stock soars by over 300% within a year, there always will be discussions about the fairness of the company's valuation. Looking at the company's multiples, it will not be an exaggeration to say that CIEN is priced to perfection. The company's current <a href=\"https://seekingalpha.com/symbol/CIEN/valuation/metrics\">valuation ratios</a> are higher than the sector median and its own historical averages by hundreds of percent across the board.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721091528565342_origin.png\" rel=\"lightbox\" data-width=\"873\" data-height=\"713\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721091528565342_origin.png?io=w640\" alt=\"Seeking Alpha\" width=\"640\" height=\"523\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721091528565342_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721091528565342_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721091528565342_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721091528565342_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The only ratio that looks reasonable is the forward-adjusted PEG ratio of 1.51, which is just above the sector median. The market currently prices extremely aggressive growth for years ahead, and before the AI revolution, I could have said that it is a big red flag. However, we are witnessing an unprecedented secular shift to AI, which requires vast amounts of compute power. Hyperscalers are ready to further boost aggressive investments in AI infrastructure because they already see that AI capabilities help them to unlock new revenue growth and profitability expansion drivers. With that being said, I think that CIEN is extremely likely to see many more new upward earnings revisions, which will mitigate the overvaluation risk.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721164579322176_origin.png\" rel=\"lightbox\" data-width=\"822\" data-height=\"728\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721164579322176_origin.png?io=w640\" alt=\"Seeking Alpha\" width=\"640\" height=\"567\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721164579322176_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721164579322176_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721164579322176_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/56545785-17721164579322176_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Furthermore, CIEN's massive share price momentum is actually a two-edged sword. While a soaring share price attracts more new investors, it also urges current investors to take fat gains earned over the last twelve months. Moreover, quite aggressive insider selling in January and February might set the tone for external equity holders to sell as well. Finally, the fact that the <a href=\"https://seekingalpha.com/symbol/CIEN/ratings/sell-side-ratings\">consensus target price is lower than the last close by 30%</a> might also undermine investors' desire to keep CIEN in their portfolios for longer.</p> <h2 class=\"paywall-full-content\">Bottom line</h2> <p class=\"paywall-full-content\">To conclude, I think that CIEN is a Buy. Yes, the stock is priced to perfection. However, in the current environment of rapidly accelerating AI tailwinds, I think that we will see several additional significant upward earnings revisions. New revisions and earnings surprises will mean compression of the P/E ratio, which will inevitably improve attractiveness of CIEN for investors.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">The company's fundamentals are solid, with a fortress balance sheet and rapidly expanding margins. Moreover, let's not forget about the power of momentum, which usually attracts additional investors and drives the demand for the stock. Since CIEN is not aggressive in issuing new shares, the highly probable increase in the demand for the company's stock will inevitably push the share price further.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153902731/image_2153902731.jpg",
            "link": "https://seekingalpha.com/article/4875560-ciena-expensive-for-a-reason",
            "pub_date": "2026-02-27 02:51:49",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4875539",
            "title": "CGMS: Active Multi-Sector Bond ETF, Last In Its Cohort (Rating Downgrade)",
            "description": "<figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2232145856/image_2232145856.jpg?io=getty-c-w630\" alt=\"Capital Value Performance Table with Sector Decreases Office, Retail, Industrial Close-Up Newspaper Data\" data-id=\"2232145856\" data-type=\"getty-image\" width=\"1536\" height=\"1017\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2232145856/image_2232145856.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2232145856/image_2232145856.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2232145856/image_2232145856.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2232145856/image_2232145856.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2232145856/image_2232145856.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2232145856/image_2232145856.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2232145856/image_2232145856.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2232145856/image_2232145856.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Abu Hanifah/iStock via Getty Images</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <h2>Thesis</h2> <p data-eci=\"true\">We started <a href=\"https://seekingalpha.com/article/4759498-cgms-an-attractive-opportunity-in-the-fixed-income-space\" title=\"https://seekingalpha.com/article/4759498-cgms-an-attractive-opportunity-in-the-fixed-income-space\" target=\"_blank\">covering</a> the Capital Group U.S. Multi-Sector Income ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CGMS\" title=\"Capital Group US Multi-Sector Inc. ETF\">CGMS</a></span>) in the fixed income space early last year, when we assigned the fund a 'Buy' rating. We liked the fund's multi-sector composition and its propensity to keep duration contained at<span class=\"paywall-full-content\"> the time. The name has performed since, posting a total return in excess of 7% with a low volatility profile:</span></p> <figure class=\"regular-img-figure a-c paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720181256403909.png?io=w640\" alt=\"returns\" contenteditable=\"false\" width=\"251\" height=\"206\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720181256403909.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">Returns <span>(Seeking Alpha)</span></p></figcaption></figure><p class=\"paywall-full-content\">We are going to revisit the name and its composition and determine the ETF's profile in today's macro market.</p> <h2 class=\"paywall-full-content\">Fund Performance Versus Peers - The Bottom of the Cohort</h2> <p class=\"paywall-full-content\">At the time of our initial coverage, we assigned CGMS a peer group composed of funds with similar mandates and profiles. Let's see how the ETF has done versus its cohort in the past year:</p> <figure class=\"sa-widget sa-ycharts paywall-full-content\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/saupload_06db1721c716c7190f83273d83f1abac.png?io=w640\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/saupload_06db1721c716c7190f83273d83f1abac.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/saupload_06db1721c716c7190f83273d83f1abac.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/saupload_06db1721c716c7190f83273d83f1abac.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\" title=\"https://ycharts.com\" target=\"_blank\">YCharts</a></figcaption></figure><p class=\"paywall-full-content\">We are looking at CGMS versus a peer group composed of the PIMCO Multisector Bond Active ETF (<a href=\"https://seekingalpha.com/symbol/PYLD\" title=\"PIMCO Multisector Bond Active ETF\">PYLD</a>), the iShares Flexible Income Active ETF (<a href=\"https://seekingalpha.com/symbol/BINC\" title=\"iShares Flexible Income Active ETF\">BINC</a>), and the TCW Flexible Income ETF (<a href=\"https://seekingalpha.com/symbol/FLXR\" title=\"TCW Flexible Income ETF\">FLXR</a>). PYLD is the clear outperformer, with the rest of the funds looking very similar.</p> <p class=\"paywall-full-content\">CGMS actually posted the lowest total return (although it is very close to BINC, off by only 7 bps). More worryingly, though, the ETF had the highest drawdown in April 2025 when the market sold off. These metrics show a lower reward-to-risk profile when compared to peers. On a net basis, however, the fund's volatility is still low:</p> <figure class=\"regular-img-figure a-c paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720181008128052.png?io=w640\" alt=\"risk\" contenteditable=\"false\" width=\"510\" height=\"196\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720181008128052.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720181008128052.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720181008128052.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">Risk metrics <span>(Seeking Alpha)</span></p></figcaption></figure><p class=\"paywall-full-content\">From the Seeking Alpha 'Risk' tab, we can see the ETF's annualized volatility at 4.11%, consistent with the drawdown seen in April 2025. Overall, the ETF does its job on a standalone basis but underperforms its peer group.</p> <h2 class=\"paywall-full-content\">Current Composition - Slightly Higher Risk</h2> <p class=\"paywall-full-content\">Let us see what the ETF is currently holding:</p> <figure class=\"regular-img-figure a-c paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720197984257364.png?io=w640\" alt=\"facts\" contenteditable=\"false\" width=\"221\" height=\"256\" loading=\"lazy\" srcset=\"\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">Current Holdings <span>(Fund Fact Sheet)</span></p></figcaption></figure><p class=\"paywall-full-content\">The fund has a 37% allocation to high yield, a 31% investment-grade corporate allocation, a 3.3% EM allocation, and roughly 20% in securitized products (overweight CMBS). The ETF presents a further refinement in each subclass, parsing each group by rating. The general allocation, though, is summarized as such:</p> <ul class=\"paywall-full-content\"> <li>HY Corp: 37%</li> <li>IG Corp: 31%</li> <li>Securitized: 20%</li> <li>EM: 3.3%</li> </ul> <p class=\"paywall-full-content\">From a ratings standpoint, the current parsing is as follows:</p> <figure class=\"regular-img-figure a-c paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720200079733825.png?io=w640\" alt=\"ratings\" contenteditable=\"false\" width=\"223\" height=\"212\" loading=\"lazy\" srcset=\"\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">Ratings <span>(Fund Fact Sheet)</span></p></figcaption></figure><p class=\"paywall-full-content\">Roughly 50% of the fund holdings are investment grade, while the rest are composed of high-yield exposures. On the high-yield side, the fund is overweight higher quality BB names, which make up 24% of the fund. The ETF only has a 3.4% bucket for 'CCC' issuers. Since our article last year, the fund has increased its high-yield exposure <span>slightly</span>.</p> <p class=\"paywall-full-content\">Other analytics for the name are as follows:</p> <ul class=\"paywall-full-content\"> <li>AUM: $4.4 billion</li> <li>Expense ratio: 0.39%</li> <li>SEC yield: 5.7%</li> <li>Payment period: monthly</li> <li>Duration: 4.2 years</li> </ul> <p class=\"paywall-full-content\">Please note the ETF also increased its duration slightly from 4 years to 4.2 years since the last time we reviewed it. Given the compression in spreads overall in the market, the name is taking more credit and duration risk to make up for some of the lost yield.</p> <h2 class=\"paywall-full-content\">Spreads Have Compressed in the Market</h2> <p class=\"paywall-full-content\">While the ETF does not take significant risks via its composition, it is nonetheless affected by overall IG and HY spreads. If we get another risk-off period like in April 2025, investors should expect the name to post another significant drawdown. For every 100 bps in spread widening, the fund should go down by -4.2%. Let us take a look at overall credit spreads in the market:</p> <figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720210279281607_origin.png\" rel=\"lightbox\" data-width=\"725\" data-height=\"502\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720210279281607_origin.png?io=w640\" alt=\"chart\" contenteditable=\"false\" width=\"640\" height=\"443\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720210279281607_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720210279281607_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720210279281607_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/48943276-17720210279281607_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\">IG &amp; HY spreads <span>(YCharts)</span></p></figcaption></figure><p class=\"paywall-full-content\">We have graphed two indices in the above, namely the US High Yield Master OAS as a proxy for high-yield spreads and the US Corporate BBB OAS as a proxy for IG spreads (namely BBB spreads). As we can see from the YChart above, both net figures are at historic lows.</p> <p class=\"paywall-full-content\">While high yield spreads went as high as 9% during Covid, they were as wide as 6% during 2022, while they are now at only 2.95%. Similarly, IG spreads were close to 2% during 2022 now only half. The point to be taken from the graphs above is that spreads are very, very low, and the next natural move is up (i.e., wider spreads). As we saw from the analytics section, 100 bps in widening means a -4.2% drawdown.</p> <h2 class=\"paywall-full-content\">Rating downgrade warranted</h2> <p class=\"paywall-full-content\">We are looking at an ETF that has increased its risk profile<span> slightly</span>, all while spreads are very tight. We like this name, and it has performed robustly; however, the next move here will likely see a -4% to -5% drawdown, similarly to April 2025. As an investor, one can consider CGMS a low risk fund, but you want to buy when there is a dislocation in spreads, not when they are tight.</p> <p class=\"paywall-full-content\">Also to note, the ETF has underperformed its cohort; thus, investors have more conservative choices currently when it comes to the same type of risk. We are downgrading this ETF to 'Hold' based on the above factors. This purely means today's price is not a good entry point from a macro standpoint, all while the fund is still expected to deliver as per its analytics.</p> <h2 class=\"paywall-full-content\">Conclusion</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">CGMS is a fixed income exchange traded fund. The name is an active take on intermediate fixed income, with allocations to IG, HY, and securitized products. The name has a low standard deviation but did produce a -4% drawdown in April 2025. Expect a similar price action for a 100 bps widening in spreads from here. We find the fund to be a robust long-term holding but do not consider today's price a good entry point.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2232145856/image_2232145856.jpg",
            "link": "https://seekingalpha.com/article/4875539-cgms-active-multi-sector-bond-etf-last-in-its-cohort-rating-downgrade",
            "pub_date": "2026-02-27 02:30:56",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4875529",
            "title": "Navitas: Growth Roadmap Depends On Successful Sampling - Numerous Risks Ahead",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2152102592/image_2152102592.jpg?io=getty-c-w630\" alt=\"Roadmap for plan implementation and markers installed along the way. 3d rendering\" data-id=\"2152102592\" data-type=\"getty-image\" width=\"1536\" height=\"864\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2152102592/image_2152102592.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2152102592/image_2152102592.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2152102592/image_2152102592.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2152102592/image_2152102592.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2152102592/image_2152102592.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2152102592/image_2152102592.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2152102592/image_2152102592.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2152102592/image_2152102592.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">mesh cube/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>I previously covered <a href=\"https://seekingalpha.com/article/4854108-navitas-semiconductor-reset-underway-more-momentum-than-fundamentals\">Navitas Semiconductor Corporation</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NVTS\" title=\"Navitas Semiconductor Corporation\">NVTS</a></span>) in December 2025, discussing why I had reiterated my Hold rating then, with FQ4'25/FY2026 likely to be trough years and data center monetization still a distance away<span class=\"paywall-full-content\"> in FY2027all of which underscored the notable divergence between its outsized rally and its underwhelming fundamentals in the near term.</span></p> <p class=\"paywall-full-content\">In this article, I shall discuss why I am reiterating my Hold rating for the NVTS stock here, given their execution risks from the speculative transition from product sampling to design/contract wins and the uncertain materialization of their growth roadmap.</p> <p class=\"paywall-full-content\">This is worsened by their inherent unprofitability, the equity erosion from their dilutive capital raises, the expensive valuations, and the potential volatility from the elevated short interest ratio.</p> <h2 class=\"paywall-full-content\"><strong>NVTS' Portfolio Reset Is Still Ongoing</strong></h2> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982600791187_origin.png\" rel=\"lightbox\" data-width=\"1815\" data-height=\"887\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982600791187_origin.png?io=w640\" alt=\"NVTS 1Y Stock Price\" width=\"640\" height=\"313\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982600791187_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982600791187_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982600791187_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982600791187_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">NVTS 1Y Stock Price <span>(<span></span></span>TradingView<span>)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">For now, NVTS has mostly traded sideways along the established resistance/support line since early October 2025, lending credence to my prior Hold ratings, especially given the ongoing consolidation along the 50/100/200-day moving averages.</p> <p class=\"paywall-full-content\">This development is unsurprising indeed, attributed to their ongoing portfolio reset, as the management deprioritized the lower-margin mobile SiC end markets to drive renewed growth through the high-power markets, including \"<a href=\"https://seekingalpha.com/pr/20412051-navitas-semiconductor-announces-fourth-quarter-and-full-year-2025-financial-results\">AI data centers, energy</a> and grid infrastructure, performance computing, and industrial electrification.\"</p> <p class=\"paywall-full-content\">NVTS has already hinted at the near end of their portfolio rationalization, based on the promising FQ1'26 revenue guidance of $8.25M at the midpoint (+13% QoQ/<a href=\"https://ir.navitassemi.com/news-releases/news-release-details/navitas-semiconductor-announces-first-quarter-2025-financial\" rel=\"nofollow noopener noopener noopener\">-41% YoY</a>) and the adj. gross margins of 38.7% (in line QoQ/+0.6 points YoY).</p> <p class=\"paywall-full-content\">The sequential improvement in its top lines and the expansion in its gross margins are extremely telling of their bottoming transition cadence compared to those observed in FQ4'25 at revenues of $7.3B (-27.7% QoQ/-59.4% YoY) and adj. gross margins of 38.7% (in line QoQ/-1.5 YoY).</p> <p class=\"paywall-full-content\">Much of NVTS' tailwinds are attributed to the growing data center exposure through the ongoing ramp of the higher power Silicon Carbide [SiC] chips for Power Supply Units [PSU], \"w<span>ith the fourth quarter being the first time that <a href=\"https://ir.navitassemi.com/events/event-details/navitas-semiconductor-q425-earnings\" rel=\"nofollow\">the high-power market</a> represents the majority of our total revenue.\"</span></p> <p class=\"paywall-full-content\">This is aided by the growing adoption of higher voltage power modules across different end markets, including chargers, computing/PCs, and industrials, with certain projects already in design/production stages, lending credence to the management's \"anticipates a return to top-line sequential growth beginning in the first quarter and throughout 2026, driven by high-power markets.\"</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/54998043-17720060895833495_origin.png\" rel=\"lightbox\" data-width=\"911\" data-height=\"452\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/54998043-17720060895833495_origin.png?io=w640\" alt=\"NVTS' Expanded SAM\" width=\"640\" height=\"318\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/54998043-17720060895833495_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/54998043-17720060895833495_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/54998043-17720060895833495_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/54998043-17720060895833495_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">NVTS' Expanded SAM <span>(NVTS)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">With Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>) leading the \"next wave of <a href=\"https://www.datacenterdynamics.com/en/news/nvidia-prepares-data-center-industry-for-1mw-racks-and-800-volt-dc-power-architectures/\" rel=\"nofollow noopener\">rack density jumps</a>\" to 800-volt DC power architectures, it is unsurprising that NVTS has already talked up the upcoming transition from SiC to Gallium Nitride [GaN] chips in the next-gen data center racks, as they report ongoing samplings with numerous OEMs/ODMs/hyperscalers and new manufacturing/supply partnerships to deliver their expanded data center monetization opportunities from 2027 onwards.</p> <p class=\"paywall-full-content\">Given that these high-power end markets typically \"come at a<span> higher margin than mobile work,\" it is unsurprising that NVTS already \"expects continued gross margin expansion\" from FQ1'26 onwards through FY2027.</span></p> <p class=\"paywall-full-content\">These exemplify the management's confidence about monetizing their growing Serviceable Addressable Market [SAM] size from $330M in 2025 to their bull-case <a href=\"https://ir.navitassemi.com/static-files/f086645c-793b-4230-b970-b0692b138441\" rel=\"nofollow noopener\">projections of $5.35B by 2030</a>, expanding at an accelerated CAGR of +74%, assuming their ability to convert the ongoing sampling cadence to design/contract wins while ensuring sufficient manufacturing capacity to deliver those aggressive numbers.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/24/54998043-17719826460021477_origin.png\" rel=\"lightbox\" data-width=\"2495\" data-height=\"414\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/24/54998043-17719826460021477_origin.png?io=w640\" alt=\"NVTS Valuations\" width=\"640\" height=\"106\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/24/54998043-17719826460021477_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/24/54998043-17719826460021477_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/24/54998043-17719826460021477_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/24/54998043-17719826460021477_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">NVTS Valuations <span>(Seeking Alpha)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Despite the steep correction of -53.5% from the 52-week highs and the ongoing moderation from the recent FWD EV/Sales highs of 85.35x, it is apparent that NVTS remains expensive at my estimated FQ1'26 FWD EV/Sales valuations of 53.33x, based on the current Enterprise Value of $1.76B and the management's annualized FQ1'26 revenue guidance of $33M at the midpoint.</p> <p class=\"paywall-full-content\">A similar conclusion may also be derived from my estimated FY2028 EV/Sales valuation of 14.08x, based on the consensus <a href=\"https://seekingalpha.com/symbol/NVTS/earnings/revisions\">FY2028 revenue estimates</a>.</p> <p class=\"paywall-full-content\">When comparing NVTS' FWD EV/Sales valuations of 53.33x and the consensus revenue growth estimates at a 3Y CAGR of +39.9% to its direct <a href=\"https://seekingalpha.com/filing/9699388#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link\">silicon-based power semiconductor peers</a>, including:</p> <ul class=\"paywall-full-content\"> <li>ON Semiconductor Corporation (<a href=\"https://seekingalpha.com/symbol/ON\" title=\"ON Semiconductor Corporation\">ON</a>) at 4.47x/+8.5%,</li> <li>STMicroelectronics N.V. (<a href=\"https://seekingalpha.com/symbol/STM\" title=\"STMicroelectronics N.V.\">STM</a>) at 2.06x/+10.4%,</li> <li>Renesas Electronics Corporation (<a href=\"https://seekingalpha.com/symbol/RNECF\" title=\"Renesas Electronics Corporation\">RNECF</a>) at 3.98x/+9.7%,</li> <li>Infineon Technologies AG (<a href=\"https://seekingalpha.com/symbol/IFNNY\" title=\"Infineon Technologies AG\">IFNNY</a>) at 4.14x/+10.7%,</li> <li>Texas Instruments Incorporated (<a href=\"https://seekingalpha.com/symbol/TXN\" title=\"Texas Instruments Incorporated\">TXN</a>) at 10.70x/+10.9%, and</li> <li>Power Integrations, Inc. (<a href=\"https://seekingalpha.com/symbol/POWI\" title=\"Power Integrations, Inc.\">POWI</a>) at 4.89x/+12.9%, respectively,</li> </ul> <p class=\"paywall-full-content\">... it is apparent that NVTS still does not offer a compelling risk/reward profile here, given the premium valuations and the uncertain monetization of their bull-case total Serviceable Addressable Market of up to $5.35B in FY2030.</p> <p class=\"paywall-full-content\">Otherwise, NVTS appears well positioned to drive its transition to the higher-growth, high-power markets, with their opportunistic capital raise at a time of elevated stock prices resulting in their richer balance sheet at a net cash position of $236.07M in FQ4'25 (+172.1% YoY).</p> <p class=\"paywall-full-content\">This is compared to some of its peers' net debt positions, including <a href=\"https://seekingalpha.com/pr/20392951-onsemi-reports-fourth-quarter-and-full-year-2025-results\">ON at $0.44B in FY2025</a>, <a href=\"https://www.infineon.com/row/public/documents/corporate/press/2026/infxx202602-042e.pdf\" rel=\"nofollow noopener noopener\">IFNNY at ~$5.88B in FQ1'26</a>, and<a href=\"https://seekingalpha.com/pr/20378241-ti-reports-q4-2025-and-2025-financial-results-and-shareholder-returns\"> TXN at $9.17B in FY2025</a>.</p> <p class=\"paywall-full-content\">The growing cash may also bridge NVTS' inherent lack of profitability over the next few years, as observed in their FY2025 adj. EPS performance of -$0.20 and the consensus FY2028 adj. EPS estimates of $0.02.</p> <p class=\"paywall-full-content\">These perhaps explain the stock's excellent support at the established trading floor of the $7.50s over the past few months, despite the dilutive capital raise effect on the long-term shareholders' equity to shares outstanding of 222.34M (+18.7% YoY).</p> <h2 class=\"paywall-full-content\"><strong>NVTS Presents Swing Trade Opportunity - Hold Reiterated</strong></h2> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982585907941_origin.png\" rel=\"lightbox\" data-width=\"1814\" data-height=\"887\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982585907941_origin.png?io=w640\" alt=\"NVTS 5Y Stock Price\" contenteditable=\"false\" width=\"640\" height=\"313\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982585907941_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982585907941_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982585907941_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/24/54998043-1771982585907941_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\">NVTS 5Y Stock Price <span>(<span></span></span>TradingView<span>)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">For now, NVTS has remained well supported along the $7.50s/$8s since October 2025, with the stock notably growing into its premium valuations as it consolidates along the 50/100/200-day moving averages.</p> <p class=\"paywall-full-content\">Despite their robust sampling cadence, I am of the opinion that the stock is likely to continue trading sideways in the intermediate term, attributed to the ongoing sampling process and the delayed high-voltage GaN monetization opportunities sometime in 2027.</p> <p class=\"paywall-full-content\">These reasons are also why NVTS presents a potential swing trade opportunity at an approximate four/five-week cycle, along the established floor at $7.50 ranges and the approximate exit points at the resistance levels of $10 ranges.</p> <p class=\"paywall-full-content\">The historical trading cycle since October 2025 offers traders an excellent way to ride the intermediate-term volatility, especially since the stock still reports an elevated short interest ratio of 17.50% by the time of writing.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Otherwise, pending their design/contract wins, the materialization of their growth roadmap, and the narrower net losses, I am of the opinion that NVTS remains rather speculative at current premium levels - resulting in my reiterated Hold rating here.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2152102592/image_2152102592.jpg",
            "link": "https://seekingalpha.com/article/4875529-navitas-growth-roadmap-depends-on-successful-sampling-numerous-risks-ahead",
            "pub_date": "2026-02-27 02:21:42",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4875518",
            "title": "Did Nvidia Just Prove Citrini Wrong?",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1393103204/image_1393103204.jpg?io=getty-c-w630\" alt=\"Duel of red and black samurai warriors. Isolated on white background. 3D Rendering\" data-id=\"1393103204\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1393103204/image_1393103204.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1393103204/image_1393103204.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1393103204/image_1393103204.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1393103204/image_1393103204.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1393103204/image_1393103204.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1393103204/image_1393103204.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1393103204/image_1393103204.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1393103204/image_1393103204.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Kirillm/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Thesis Summary</h2> <p>Citrinis <a href=\"https://www.citriniresearch.com/p/2028gic\" rel=\"nofollow\">Global Intelligence Crisis</a> went viral a couple of days ago.</p> <p>The report laid out a pretty gloomy future scenario, where AI leads to an economic recession and a market implosion.</p> <p>While the<span class=\"paywall-full-content\"> logic and narrative are appealing, as bear cases usually are, they are contradicted by cold, hard facts.</span></p> <p class=\"paywall-full-content\">And these facts have been made clear in Nvidias (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>) latest <a href=\"https://seekingalpha.com/article/4874926-nvidia-corporation-nvda-q4-2026-earnings-call-transcript\">earnings call</a>, which shows that AI isnt just cutting labor; its also generating revenue and increasing productivity.</p> <p class=\"paywall-full-content\">Where Citrini sees a doom loop, I see a virtuous cycle, and I think Nvidia CEO Jensen Huang does, too.</p> <h2 class=\"paywall-full-content\">The Core Assumption: AI Is Cost Substitution</h2> <p class=\"paywall-full-content\">Citrinis loop hinges on this:</p> <blockquote class=\"paywall-full-content\"><p>A company that had been spending $100M a year on employees and $5M on AI now spent $70M on employees and $20M on AI.</p></blockquote> <p class=\"paywall-full-content\">Source: Citrini Research.</p> <p class=\"paywall-full-content\">The core argument here is that as AI replaces labor, total spending shrinks, and this eventually collapses consumption.</p> <p class=\"paywall-full-content\">On the other side of the spectrum, we have Jensen saying this in the earnings call:</p> <blockquote class=\"paywall-full-content\"><p>Compute equals revenues Without compute, there is no way to generate tokens Without investing in compute, there cannot be revenue growth.</p></blockquote> <p class=\"paywall-full-content\">For starters, AI generates its own source of revenue, which in itself will have to go somewhere.</p> <p class=\"paywall-full-content\">It doesnt destroy demand de facto.</p> <p class=\"paywall-full-content\">Citrini assumes AI spend is defensive, and the first thing that companies will do is cut costs, but that doesn't actually make sense.</p> <p class=\"paywall-full-content\">If you can now do more and sell more, you will double down on that, especially if the ROI is positive.</p> <h2 class=\"paywall-full-content\">The ROI Is Already Showing Up</h2> <blockquote class=\"paywall-full-content\"><p>At Meta, advancements in their GEM model drove a 3.5x increase in ad clicks on Facebook and more than a 1% gain in conversions on Instagram.</p></blockquote> <p class=\"paywall-full-content\">Source: Nvidia Earnings Call.</p> <p class=\"paywall-full-content\">In order for AI to be a doom loop, it would have to be unproductive. At least here we have a clear example of AI increasing revenues and therefore demand.</p> <h2 class=\"paywall-full-content\">The White-Collar Collapse Requires a Hiring Freeze That Isnt There</h2> <p class=\"paywall-full-content\">Citrini assumes displaced workers wont be reabsorbed.</p> <p class=\"paywall-full-content\">This flies in the face of what we have seen throughout history. Money is being spent in different places, perhaps, but someone has to carry out this infrastructure rollout, and the money is being spread out.</p> <blockquote class=\"paywall-full-content\"><p>We added $11B in Data Center revenue across a diverse and expanding set of customers including cloud providers, hyperscalers, AI model makers, enterprises, and sovereign nations.</p></blockquote> <p class=\"paywall-full-content\">Source: Nvidia Earnings Call.</p> <p class=\"paywall-full-content\">If anything, we could argue that money is moving away from being concentrated in a few large companies, which tend to accumulate it in their fortress balance sheets, and getting closer to the real economy.</p> <h2 class=\"paywall-full-content\">Agentic AI Is Not Destroying SaaS</h2> <p class=\"paywall-full-content\">Citrinis SaaS reflexivity argument is interesting.</p> <p class=\"paywall-full-content\">In essence, the argument is that AI doesnt need to fully replace software to damage it.</p> <p class=\"paywall-full-content\">Agentic coding tools are enough of a threat that they shift the balance of power and force SaaS to cut prices and costs and themselves double down on AI.</p> <p class=\"paywall-full-content\">But Nvidia addressed what comes next during the call:</p> <blockquote class=\"paywall-full-content\"><p>Demand continues to strengthen as inference deployments grow in addition to training.</p></blockquote> <p class=\"paywall-full-content\">Also:</p> <blockquote class=\"paywall-full-content\"><p>Tokens are profitable driving extreme urgency to scale up compute.</p></blockquote> <p class=\"paywall-full-content\">I see it as a Jevons paradox. Making SaaS cheaper and better, through Agentic AI, actually increases the demand and TAM.</p> <p class=\"paywall-full-content\">The system does not shrink, though it does become more compute-heavy.</p> <h2 class=\"paywall-full-content\">The Margin Story Doesnt Look Like a Commodity Collapse</h2> <p class=\"paywall-full-content\">Citrinis scenario assumes compute becomes commoditized, which would lead to a collapse in margins for Nvidia, but this does not fit the reality at this time.</p> <p class=\"paywall-full-content\">As stated during the call, Nvidia is guiding:</p> <ul class=\"paywall-full-content\"> <li><p>75% gross margins</p></li> <li><p>Sustained mid-70s full-year outlook</p></li> </ul> <blockquote class=\"paywall-full-content\"><p>The single most important lever of our gross margins is actually delivering generational leads to our customers.</p></blockquote> <p class=\"paywall-full-content\">If performance per watt drives revenue per rack, and Nvidia maintains generational leads, then pricing power will persist.</p> <h2 class=\"paywall-full-content\">The Intelligence Premium May Compress, But Revenue Density Explodes</h2> <p class=\"paywall-full-content\">Citrinis most compelling argument is the philosophical one.</p> <p class=\"paywall-full-content\">Human intelligence will lose scarcity. That may be true, but the same can be said of human physical prowess.</p> <p class=\"paywall-full-content\">Whats the issue here?</p> <p class=\"paywall-full-content\">Machine intelligence is massively revenue-generative.</p> <ul class=\"paywall-full-content\"> <li><p>Coding agents increase output</p></li> <li><p>Physical AI expands robotics</p></li> <li><p>Autonomous fleets scale exponentially.</p></li> </ul> <p class=\"paywall-full-content\">This is a sector-wide disruption that will inevitably make us much, much wealthier, just like the invention of the steam engine did back in the day.</p> <h2 class=\"paywall-full-content\">Are There Any Real Threats?</h2> <p class=\"paywall-full-content\">Of course, there is merit to the bear thesis, and we have to acknowledge some of its good points as mentioned during the call:</p> <blockquote class=\"paywall-full-content\"><p>The platform will train MoE models with one-fourth the number of GPUs and reduce inference token costs by up to 10x compared to Blackwell.</p></blockquote> <p class=\"paywall-full-content\">A lot of the increased demand that AI is generating right now comes from the literal creation and deployment of hardware.</p> <p class=\"paywall-full-content\">As AI advances, hardware needs will decrease. Yes, this would be a shock in the short term, but again, very bullish long term.</p> <p class=\"paywall-full-content\">Not only will we have AI agents that are more efficient than humans, but they will also become cheaper over time.</p> <h2 class=\"paywall-full-content\">Final Thoughts</h2> <p class=\"paywall-full-content\">Citrinis 2028 memo is a useful thought experiment.</p> <p class=\"paywall-full-content\">But it assumes that AI is primarily labor substitution and that AI revenue does not scale with compute.</p> <p class=\"paywall-full-content\"><a href=\"https://seekingalpha.com/news/4557159-nvidia-non-gaap-eps-of-1_62-beats-by-0_08-revenue-of-68_13b-beats-by-1_9b\">Nvidias earnings</a> prove the opposite.</p> <p class=\"paywall-full-content\">As Jensen said, Compute equals revenues.</p> <p class=\"paywall-full-content\">The world is changing, but I still believe its for the better.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">And if there is going to be some turbulence on the way, the current data does not seem to support this.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1393103204/image_1393103204.jpg",
            "link": "https://seekingalpha.com/article/4875518-did-nvidia-just-prove-citrini-wrong",
            "pub_date": "2026-02-27 02:16:03",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4875507",
            "title": "AMD: Revenue Momentum Intact, But Underperformance Risk Persists",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214312305/image_2214312305.jpg?io=getty-c-w630\" alt=\"A sleek laptop showcases its powerful internals with AMD Ryzen 9 and NVIDIA GeForce RTX Studio badges, alongside NVIDIA G-SYNC and Energy Star certifications.\" data-id=\"2214312305\" data-type=\"getty-image\" width=\"1536\" height=\"1152\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214312305/image_2214312305.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214312305/image_2214312305.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214312305/image_2214312305.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214312305/image_2214312305.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214312305/image_2214312305.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214312305/image_2214312305.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214312305/image_2214312305.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214312305/image_2214312305.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Marvin Samuel Tolentino Pineda/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2><span>The Thesis</span></h2> <p>Exiting FY25, the semiconductor manufacturer, Advanced Micro Devices, Inc. (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/AMD\" title=\"Advanced Micro Devices, Inc.\">AMD</a></span>), delivered a solid, upbeat Q4, with strong sales growth across both data center and client &amp; gaming segments. AMD should continue to see<span class=\"paywall-full-content\"> solid double-digit growth across its consolidated top line through FY26, with sustained hyperscalers' spending on AI infrastructure expansion and healthy enterprise adoption, which should continue to benefit demand for its GPUs over the coming quarters. But margin prospects, on the other hand, still look uncertain, primarily due to high R&amp;D spending and elevated risk from high inventory levels, which could impact gross margins negatively if there's any demand slowdown.</span></p> <p class=\"paywall-full-content\">Since my <a href=\"https://seekingalpha.com/article/4854964-advanced-micro-devices-still-not-a-compelling-bet\">previous AMD article</a>, the stock has moved sideways and is down by low single-digit percentages. Although the company's outlook appears good in the near term, its competitive landscape remains challenging, particularly in the AI data center end market. In my view, this may significantly impact the company's ability to gain share in the discrete GPU market, capping its longer-term growth, particularly in the data center end market. While the stock valuation also remains expensive against its close peers, I think risk-reward remains balanced, given a challenging long-term outlook. Hence, I would like to maintain a neutral stance on the AMD stock.</p> <h2 class=\"paywall-full-content\">AMDs Q4 2025 Highlights</h2> <p class=\"paywall-full-content\">Earlier this month, AMD reported its final quarter results for 2025, delivering a solid <a href=\"https://seekingalpha.com/news/4546637-amd-non-gaap-eps-of-1_53-beats-by-0_21-revenue-of-10_3b-beats-by-630m\">double beat in Q4</a> with healthy momentum across its key businesses. In the fourth quarter, AMDs consolidated top line increased approximately 34.1%, reaching a record $10.27 billion. While the companys client and gaming segment yet again reported strong double-digit growth during Q4, its data center revenue also climbed approximately 39% on solid core demand, benefitting consolidated results during the quarter.</p> <p class=\"paywall-full-content\">Meanwhile, AMDs embedded segment was up only 3% during the quarter, as industrial and communication markets remain soft. For the full year 2025, the companys consolidated top line reached $34.6 billion, up about 34.3% versus the prior year.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720220932938101_origin.png\" rel=\"lightbox\" data-width=\"1564\" data-height=\"958\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720220932938101_origin.png?io=w640\" alt=\"AMD's quarterly sales\" width=\"640\" height=\"392\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720220932938101_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720220932938101_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720220932938101_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720220932938101_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">AMD's quarterly sales <span>(Research Wise)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">While overall volumes remain robust during the last quarter, the companys gross margins primarily benefited from nearly $400 million in MI308 revenue from <a href=\"https://seekingalpha.com/article/4865498-advanced-micro-devices-inc-amd-q4-2025-earnings-call-transcript\">China</a>, which was previously written down. As a result, the companys gross margins jumped approximately 290 bps to 57% in Q4. Excluding this impact, the GM would have been around 55%.</p> <p class=\"paywall-full-content\">However, due to continued pressure from high operational expenses related to R&amp;D investments, despite strong gross margin improvement, the companys adjusted EBITDA margin grew by just 100 bps to 29.7% in the last quarter. EBITDA growth also benefited the companys bottom line performance, as its adjusted EPS <a href=\"https://seekingalpha.com/symbol/AMD/earnings#:~:text=%241.53%20%28Beat%20by%20%240.21%29\">jumped to $1.53</a> from $1.09 a year ago, beating the consensus estimate by $0.21 in Q4 FY25.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720223107588384_origin.png\" rel=\"lightbox\" data-width=\"746\" data-height=\"273\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720223107588384_origin.png?io=w640\" alt=\"AMD's Q4 2025 earnings performance versus consensus estimates\" width=\"640\" height=\"234\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720223107588384_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720223107588384_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720223107588384_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720223107588384_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">AMD's Q4 2025 earnings performance <span>(Seeking Alpha)</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Comments On Outlook</h2> <p class=\"paywall-full-content\">Throughout FY25, AMD delivered strong double-digit growth and wrapped up the year, reporting another standout <a href=\"https://seekingalpha.com/pr/20386861-amd-reports-fourth-quarter-and-full-year-2025-financial-results#hasComeFromMpArticle=false\">quarter in Q4</a> with over 34% growth across its top line, thanks to continued strength across its data center and client segments. While certain businesses remain cyclical, continued demand for AMDs accelerator portfolio across AI infrastructure and cloud deployments should continue to support the strong momentum moving into FY26.</p> <p class=\"paywall-full-content\">The Data Center segment, which contributes about a 52% share in total revenue, continues to see strong demand as hyperscalers continue to expand AI infrastructure to support growing cloud and AI workloads, particularly in North America. Exiting FY25, adoption of AMDs instinct accelerator continued to grow with increasing deployments of its MI300 GPUs across cloud and enterprise AI customers, which should continue to drive segment revenue in the quarters ahead.</p> <p class=\"paywall-full-content\">Adoption of 5th-gen EPYC processors also remains strong, continuing to drive server share gains for the company in the server CPU space. While the 5th gen now accounts for over half of total server revenue, demand for 4th gen processors also remains healthy. Hyperscaler demand across the cloud also remains solid, with over <a href=\"https://seekingalpha.com/article/4865498-advanced-micro-devices-inc-amd-q4-2025-earnings-call-transcript\">500 AMD-based instances</a> launched by AWS, Google, and others in 2025, driving the total EPYC cloud instances count to nearly 1600. While I expect this count to increase further with expanding deployment, enterprise adoption also continues to see broader penetration across large enterprises, which should further support AMDs data center momentum.</p> <p class=\"paywall-full-content\">On the AI software front, the company continues to expand its <a href=\"https://seekingalpha.com/article/4865498-advanced-micro-devices-inc-amd-q4-2025-earnings-call-transcript\">ROCm ecosystem</a>. AMD has also introduced its enterprise suite to deliver a full-stack software platform for large-scale deployments. In my view, AMD's focus on the expansion of its software capabilities should gradually help it reduce adoption barriers over time in a market that remains dominated by Nvidias (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>) CUDA ecosystem and supports higher deployments.</p> <p class=\"paywall-full-content\">Now moving to the companys Client &amp; Gaming segment, which contributes roughly 43% to total revenue as of Q4 (up from 35% in FY24) and has been a key growth driver for AMD revenue in 2025. Within Client, overall demand remains solid with robust demand for the companys multiple generations of Ryzen desktop and mobile CPUs. While momentum across the commercial PC is also expected to remain healthy with growing enterprise adoption of Ryzen processors, the introduction of AMDs<a href=\"https://seekingalpha.com/article/4865498-advanced-micro-devices-inc-amd-q4-2025-earnings-call-transcript\"> Ryzen AI-400 mobile</a> series should further support demand in the client segment into 2026.</p> <p class=\"paywall-full-content\">The gaming business is also showing healthy momentum as demand for the companys Radeon RX 9000 series remains robust. In my view, with competitive performance in gaming, productivity, and content creation, demand for AMDs Ryzen portfolio should remain robust. With the integration of AI capabilities, the company should also continue to gain share in the premium PC markets. Overall, I believe, while the data center segment remains a key growth driver for AMD, contributing more than half of total revenue, the strong ongoing recovery on the client &amp; gaming side should further contribute to the consolidated growth in FY26.</p> <p class=\"paywall-full-content\">While the company's growth prospects remain favorable in the short term, its long-term outlook, mainly in the AI accelerator market, remains tied to its market competitiveness, particularly against Nvidia, which remains the dominant player in this space. Although AMD has significantly expanded its accelerator roadmap with higher customer engagement and its new offerings, including the MI400 series and Helio rack-scale AI platform, Nvidia remains far ahead due to its mature CUDA ecosystem and entrenched customer ties. Therefore, to sustain the current growth momentum beyond FY26, I believe strong execution, continued product competitiveness, and ecosystem depth will remain critical factors for AMD moving ahead.</p> <p class=\"paywall-full-content\">However, AMD has strengthened its strategic positioning with recent collaborations, including a partnership with <a href=\"https://seekingalpha.com/article/4865498-advanced-micro-devices-inc-amd-q4-2025-earnings-call-transcript\">Tata Consulting Services</a>, a global IT and consulting powerhouse, to co-develop AI solutions. This strategic collaboration is expected to meaningfully broaden AMDs reach into enterprise AI workloads across different sectors. This partnership is expected to drive incremental adoption over the long term, supporting the companys top line over the coming years. Additionally, the multi-year 6 GW infrastructure <a href=\"https://seekingalpha.com/news/4501935-amd-surges-25-after-ai-infrastructure-deal-with-openai\">deal with OpenAI</a> (<a href=\"https://seekingalpha.com/symbol/OPENAI\" title=\"OpenAI\">OPENAI</a>) remains in place and is set to drive meaningful long-term accelerator demand, which should further benefit the companys consolidated top line in the longer term.</p> <p class=\"paywall-full-content\">To sum up, near-term demand trends remain favorable, which are likely to help the company sustain double-digit top line growth through 2026. However, I think AMD's long-term outlook remains uncertain, given a highly competitive AI landscape and Nvidias massive scale, which doesn't look easy to get close to in the near future. Although AMD is positioned to benefit from structural AI tailwinds over the coming years, I believe sustaining accelerated growth in the long term will depend upon the company's software ecosystem development, strong execution, and, most importantly, continued competitiveness of AMDs offerings, particularly in the data center end market.</p> <h2 class=\"paywall-full-content\">Valuation Update: Still Unreasonable</h2> <p class=\"paywall-full-content\">I initially <a href=\"https://seekingalpha.com/article/4836749-amd-strong-momentum-but-risk-reward-looks-weak-ahead-of-q3\">covered the AMD stock</a> in November 2025, ahead of the company's Q3 earnings. I suggested staying on the sidelines and gave the stock a Hold rating, as its valuation appeared expensive. Since then, despite <a href=\"https://seekingalpha.com/news/4514963-amd-non-gaap-eps-of-120-beats-by-003-revenue-of-925b-beats-by-500m\">double-beat results</a> in Q3 and Q4, AMD stock has remained largely sideways, significantly underperforming the market by declining approximately 17% versus a nearly 1% rise in the S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>) during the same period.</p> <p class=\"paywall-full-content\">Although the stock has corrected nearly 20% since its highs near Q3 earnings, it still appears stretched. Currently, the company's stock is trading at a forward non-GAAP P/E of <a href=\"https://seekingalpha.com/symbol/AMD/valuation/metrics#:~:text=C%2D-,32.15,-22.41\">32.21</a>, based on its FY26 (ending Dec. 2026) consensus earnings <a href=\"https://seekingalpha.com/symbol/AMD/earnings/estimates#:~:text=Dec%202026-,6.64,-59.20%25\">estimate of $6.64</a>. While the valuation still appears undervalued against its historical average multiple in the high 30s, it remains meaningfully overvalued against its closest peer, Nvidia, which is currently trading at a much lower multiple at <a href=\"https://seekingalpha.com/symbol/NVDA/earnings/estimates#:~:text=67.33%25-,24.54,-6.17\">around 24x</a>, based on its FY27 (ending Jan. 2027) earnings estimate of $7.86, with a notably higher forward growth expectation, as can be seen in the comparison table below.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720205264656432_origin.png\" rel=\"lightbox\" data-width=\"783\" data-height=\"395\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720205264656432_origin.png?io=w640\" alt=\"AMD's growth comparison with NVDA\" width=\"640\" height=\"323\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720205264656432_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720205264656432_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720205264656432_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720205264656432_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">AMD's growth comparison with NVDA <span>(Seeking Alpha)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Going ahead, AMD's top line is expected to continue to expand in double digits, as the demand environment remains robust across its core segments. However, the company's margin trajectory remains relatively uncertain. Although the company reported solid margin growth in Q4, most of the improvement was driven by the release of MI300 series accelerators' inventory to <a href=\"https://seekingalpha.com/article/4865498-advanced-micro-devices-inc-amd-q4-2025-earnings-call-transcript\">China</a> during the quarter, which was previously written off and may not be present in subsequent quarters.</p> <p class=\"paywall-full-content\">Additionally, as of Q4, AMD's <a href=\"https://seekingalpha.com/pr/20386861-amd-reports-fourth-quarter-and-full-year-2025-financial-results#source=section%3APress%20Releases%7Csection_asset%3APress%20Releases%7Cfirst_level_url%3Asymbol%7Cbutton%3ATitle%7Clock_status%3ANo%7Cline%3A10\">inventory levels</a> are at around $7.9 billion (77% of Q4 sales). While demand visibility appears strong, current inventory levels appear overbuilt, which might increase the risk for potential write-downs in the short term if there's any setback with slowing hyperscalers or slipping ramps. This is notable when compared with Nvidia, which is operating with a significantly more linear inventory profile. Although Q4 benefited from certain reversals, the present inventory levels also introduce downside risk to gross margins in the coming quarters.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720213951410801.png?io=w640\" alt=\"AMD's inventory levels\" contenteditable=\"false\" width=\"600\" height=\"371\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720213951410801.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720213951410801.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/59815527-17720213951410801.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">AMD's inventory levels <span>(Q4 2025 earnings release)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Apart from these, AMD also continues to invest significantly in R&amp;D to expand and enhance its portfolio. While these investments are important to stay competitive in the evolving AI landscape, they are likely to remain a headwind for the company's operating margins in FY26, further limiting the pace of the company's bottom line expansion despite robust top line growth. With continued margin uncertainty and intense competition, I believe AMD's premium valuation is difficult to justify, limiting the upside in the near term.</p> <h2 class=\"paywall-full-content\">Final Verdict And Rating</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">As discussed above, the company's stock is still trading at a slight premium despite the recent correction. While the company's topline outlook looks favorable with a robust demand environment, margins should be under pressure in the short term, primarily due to high R&amp;D investments. At present, AMD's valuation still appears to embed high expectations for share gains and margin growth. While the company may continue to deliver steady growth over the coming quarter, given the intense competitive dynamics and margin uncertainty, I think the risk-reward stays unattractive, and the stock may continue to underperform. Therefore, I am maintaining a Hold rating on AMD stock for now.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214312305/image_2214312305.jpg",
            "link": "https://seekingalpha.com/article/4875507-amd-revenue-momentum-intact-but-underperformance-risk-persists",
            "pub_date": "2026-02-27 02:01:36",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4875495",
            "title": "2 Defensive Funds Delivering Passive Monthly Cash Flow",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222741543/image_2222741543.jpg?io=getty-c-w630\" alt=\"Risk Prevention and Protection Concept\" data-id=\"2222741543\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222741543/image_2222741543.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222741543/image_2222741543.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222741543/image_2222741543.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222741543/image_2222741543.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222741543/image_2222741543.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222741543/image_2222741543.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222741543/image_2222741543.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222741543/image_2222741543.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">patpitchaya/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p><em>Written by Nick Ackerman, co-produced by Stanford Chemist</em></p> <p>Income investors are constantly on the lookout for the next opportunities to provide them with a steady cash flow. With monthly paying funds (and even some weekly paying ETFs<span class=\"paywall-full-content\"> these days), that isn't too difficult. However, there are a lot of choices that can be quite aggressive in terms of risk, either by adding leverage or going into relatively riskier investments.</span></p> <p class=\"paywall-full-content\">With that, we want to highlight a couple of opportunities that provide monthly distributions to their investors. However, funds that are also relatively more conservative in their investment strategies have more defensive underlying exposure.</p> <h2 class=\"paywall-full-content\">#1 BlackRock Health Sciences Trust (<a href=\"https://seekingalpha.com/symbol/BME\" title=\"BlackRock Health Sciences Trust\">BME</a>)</h2> <ul class=\"paywall-full-content\"> <li>1-Year Z-score: 3.03</li> <li>Discount/Premium: -4.36%</li> <li>Distribution Yield: 7.50%</li> <li>Expense Ratio: 1.11%</li> <li>Leverage: N/A</li> <li>Managed Assets: $566 million</li> <li>Structure: Perpetual</li> </ul> <p class=\"paywall-full-content\"><em>BlackRock had announced <a href=\"https://www.blackrock.com/us/individual/literature/press-release/9-10-2025-pr-fe-cef-inv-obj-and-options-update.pdf\" rel=\"noreferrer noopener noopener\">in late 2025</a> that several funds would be removing their options writing focus, no longer being call writing funds, and BME was one of those. With that, there has been a slight tweak in the wording of its investment objective.</em></p> <p class=\"paywall-full-content\">The fund's <a href=\"https://www.blackrock.com/us/individual/products/240227/blackrock-health-sciences-trust-usd-fund\" rel=\"noreferrer noopener noopener\">investment objective</a> is now \"to provide total return and income primarily through long-term capital appreciation.\" In an attempt to achieve that, they will \"invest, under normal market conditions, at least 80% of its assets in equity securities of companies engaged in the health sciences and related industries and equity derivatives with exposure to the health sciences industry.\"</p> <p class=\"paywall-full-content\">BME has been a name we've liked for a long time, after the healthcare sector has been out of favor, and the fund has seen itself drop to a deep discount. Well, the healthcare space has been finding its footing and starting to reboundas has BME's discount started to narrow.</p> <p class=\"paywall-full-content\">With that, it may not be the best deal that it was a year ago or even several months ago, but it still gets a 'Buy' rating from us. In the short term, it is looking relatively extended in terms of valuation, but on the other hand, it still remains trading below its longer-term average discount level.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/12/saupload_235f1b9feb5112926f4cc49fdc72d8f6.png?io=w640\" alt=\"Chart\" contenteditable=\"false\" width=\"635\" height=\"424\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/12/saupload_235f1b9feb5112926f4cc49fdc72d8f6.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/12/saupload_235f1b9feb5112926f4cc49fdc72d8f6.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/12/saupload_235f1b9feb5112926f4cc49fdc72d8f6.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Ycharts</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">In general, the combination of no leverage and healthcare exposure makes this fund an overall more defensive one in the closed-end fund space. While there is some risk in individual names within the healthcare space, as there can be with any specific sector, diversification with investments spread across ~160 holdings helps to limit its overall negative impact.</p> <p class=\"paywall-full-content\">For example, UnitedHealth Group (<a href=\"https://seekingalpha.com/symbol/UNH\" title=\"UnitedHealth Group Incorporated\">UNH</a>) is a name that can't seem to avoid negative news for the last year, and it has been tumbling as it is down nearly 50%. This is a position for BME, but it hasn't completely derailed the CEF, and the fund has delivered ~9% total NAV returns over the last year.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709002477680619_origin.png?io=w640\" alt=\"BME Top Ten Holdings\" contenteditable=\"false\" width=\"640\" height=\"206\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709002477680619_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709002477680619_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709002477680619_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709002477680619_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">BME Top Ten Holdings <span>(BlackRock)</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">#2 NEOS Gold High Income ETF (<a href=\"https://seekingalpha.com/symbol/IAUI\" title=\"NEOS Gold High Income ETF\">IAUI</a>)</h2> <ul class=\"paywall-full-content\"> <li>Dividend Frequency: Monthly</li> <li>Dividend Yield: 1.88% SEC yield, 12.25% Distribution Yield</li> <li>Expense Ratio: 0.78%</li> <li>Leverage: N/A</li> <li>Managed Assets: $367.7 million</li> <li>Structure: Active ETF</li> </ul> <p class=\"paywall-full-content\">IAUI's<a href=\"https://neosfunds.com/iaui/\" rel=\"nofollow\"> investment objective</a> is to \"generate high monthly income with the potential for appreciation based on exposure to exchange-traded products (\"ETPs\") that have direct exposure to gold.\" To achieve this, the fund will utilize a \"data-driven call option strategy on gold ETPs.\"</p> <p class=\"paywall-full-content\">The fund has seen considerable interest since launching. When we initially covered the name in August 2025, it was at less than $30 million AUM. Today, that has pushed close to almost $368 million. NEOS Investments launched only in mid-2022. However, the fund sponsor has quickly made a name for itself in the ETF space for launching funds that income investors can rely on.</p> <p class=\"paywall-full-content\">The fund's strategy is fairly simple, and that is sometimes a good thing. Complexity for the sake of complexity can sometimes simply cause higher risk. For IAUI, they invest in gold ETFs and create synthetic long positions through options; this is then hedged with U.S. Treasury Bill holdings. The more active part is using a laddered approach to partially overwrite to generate option premiums.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709008845338397_origin.png?io=w640\" alt=\"IAUI Holdings\" contenteditable=\"false\" width=\"640\" height=\"286\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709008845338397_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709008845338397_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709008845338397_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709008845338397_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">IAUI Holdings <span>(NEOS)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">I know options can be fairly complex for some investors, but the type of options we are talking about here are some of the most straightforward vanilla types. At present, the fund is roughly ~51% overwritten from the 2/12/2026 holdings. This partial overwrite and laddered approach benefits the fund in that it can participate in a lot of upside if gold continues to run higher.</p> <p class=\"paywall-full-content\">By generating option premiums through writing calls, this provides the 'income' component to pay out a monthly distribution to investors. The big difference between the SEC yield and the distribution rate is that the yield component only reflects the U.S. Treasury Bill interest being earned minus the expenses. Since the fund is using capital gains from the options writing strategy or appreciation from gold rising, the actual distribution rate is significantly higher.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709013100749304_origin.png?io=w640\" alt=\"IAUI Distribution History\" contenteditable=\"false\" width=\"640\" height=\"222\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709013100749304_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709013100749304_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709013100749304_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/12/1058901-17709013100749304_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">IAUI Distribution History <span>(Seeking Alpha)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">No doubt, gold has been on a monster run, and an investor could have a right to be skeptical about investing here, at least aggressively. However, I think that IAUI can still be a solid investment choice over the long term, as gold is likely never to stop having value. It is something tangible that can be used and/or often hoarded as a store of value. A true safe haven asset during periods of significant uncertainty and volatility.</p> <p class=\"paywall-full-content\">Additionally, as we were looking at another fund recently, the Strategy Shares Gold Enhanced Yield ETF (<a href=\"https://seekingalpha.com/symbol/GOLY\" title=\"Strategy Shares Gold Enhanced Yield ETF\">GOLY</a>), we noted that during the latest pullback for gold, IAUI held up relatively well. Albeit in a relatively short period of time, it still resulted in losses during that period, but it was about a quarter of what the iShares Gold Trust (<a href=\"https://seekingalpha.com/symbol/IAU\" title=\"iShares Gold Trust ETF\">IAU</a>) actually dropped.</p> <p class=\"paywall-full-content\">Looking at it now since gold's peak on Jan. 29, 2026, it is the only fund that has posted positive returns.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/12/saupload_e5640a9224f9a7983b69ce5fd463c176.png?io=w640\" alt=\"Chart\" contenteditable=\"false\" width=\"635\" height=\"524\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/12/saupload_e5640a9224f9a7983b69ce5fd463c176.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/12/saupload_e5640a9224f9a7983b69ce5fd463c176.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/12/saupload_e5640a9224f9a7983b69ce5fd463c176.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>YCharts</span></p></figcaption></figure></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Again, this is a relatively short period, but it helps to at least start to show a track record of relative defensiveness compared to its peers and IAU itself. There is no guarantee that it can continue to be so defensive, but given the underlying safe haven exposure to gold and slightly defensive strategy of call writing, it is safe to say that this fund fits the category of a relatively conservative investment for the long term.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222741543/image_2222741543.jpg",
            "link": "https://seekingalpha.com/article/4875495-2-defensive-funds-delivering-passive-monthly-cash-flow",
            "pub_date": "2026-02-27 01:50:43",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4875491",
            "title": "Avalanche 201: The Institutional Platform",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2178269162/image_2178269162.jpg?io=getty-c-w630\" alt=\"Coin on CPU background. data and innovation cryptocurrency technology, Crypto payments.\" data-id=\"2178269162\" data-type=\"getty-image\" width=\"1536\" height=\"863\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2178269162/image_2178269162.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2178269162/image_2178269162.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2178269162/image_2178269162.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2178269162/image_2178269162.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2178269162/image_2178269162.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2178269162/image_2178269162.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2178269162/image_2178269162.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2178269162/image_2178269162.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>This piece explores Avalanches second act as the network shifts toward becoming institutional-grade blockchain infrastructure for tokenization, payments, and real-world financial systems.</p> <p><strong>Please note that VanEck may have a position(s) in the digital asset(s) described below.</strong></p> <p><strong>Key<span class=\"paywall-full-content\"> takeaways:</span></strong></p> <ul class=\"paywall-full-content\"> <li> <strong>Avalanche is a high-speed, multi-chain platform:</strong> It is a system of many blockchains designed to solve scalability issues by allowing applications to run on their own dedicated, purpose-built networks.</li> <li> <strong>Enterprise adoption anchors long-term value:</strong> Major financial institutions such as J.P. Morgan, Apollo, and Citi are using Avalanche for real-world asset tokenization and backend infrastructure.</li> <li> <strong>Strategic pricing shift drives network activity:</strong> Recent fee reductions have successfully sparked growth in daily active users and transaction volume, positioning the network for broader mainstream adoption.</li> </ul> <h2 class=\"paywall-full-content\">Introduction to Avalanche</h2> <p class=\"paywall-full-content\">Avalanche (<a href=\"https://seekingalpha.com/symbol/AVAX-USD\" title=\"Avalanche\">AVAX-USD</a>) is a high-performance platform that powers a network of interconnected, customizable blockchains. It has attracted both crypto-native users and enterprises, with Avalanche L1s processing about 40M transactions per day and supporting roughly 38M daily active users across 81 active blockchains. Avalanche has also brought $1.4B of real-world asset value onchain through institutions such as BlackRock, Janus Henderson, Franklin Templeton, and Republic. These teams are drawn to Avalanches predictable performance and scaling model built to support tens of millions of future users.</p> <p class=\"paywall-full-content\">From the start, Avalanche was built around different priorities than many legacy blockchains. Rather than centering the digital gold narrative, Avalanche focused on performance and scale, pioneering a novel consensus design and a multi-chain architecture. After launching in 2020, early adoption came from crypto-native users who wanted a faster alternative to Ethereum (<a href=\"https://seekingalpha.com/symbol/ETH-USD\" title=\"Ethereum USD\">ETH-USD</a>). Avalanche still maintains meaningful activity in DeFi and gaming, but it has increasingly evolved into a leading platform for custom Layer 1 blockchains, real-world asset tokenization, and enterprise deployment.</p> <p class=\"paywall-full-content\">Today, Avalanche focuses on enterprise, financial institution, and public sector use cases through its AvaCloud offering. The goal is to operate as a scalable, reliable backend infrastructure while preserving the core benefits of blockchain: transparency, fast settlement, and interoperability.</p> <p class=\"paywall-full-content\">We believe Avalanches long-term opportunity depends on whether it can convert enterprise interest into sustained production deployments. Progress to date is encouraging, even if broad adoption is still in its early stages. Overall, Avalanche offers investors differentiated exposure to a suit and tie platform that is working to bring large organizations onchain.</p> <h3 class=\"paywall-full-content\">Avalanche Stablecoin Transfer Volume Up 330% Y/Y in 2025</h3> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://www.vaneck.com/contentassets/9f01899823304e249d57473def77b38e/6756_avalanche-201-blog_chart-1_2026-2_v1.svg\" alt=\"Avalanche Stablecoin Transfer Volume Up 330% Y/Y in 2025\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\"> </p></figcaption></figure></p> <p class=\"paywall-full-content\"><em>Source: Artemis XYZ as of 2/06/2026. <strong>Past performance is no guarantee of future results. Not intended as a recommendation to buy or sell any securities named herein.</strong></em></p> <h2 class=\"paywall-full-content\">Avalanche Design for Rapid Consensus: Snowman</h2> <p class=\"paywall-full-content\">Avalanche offers a key breakthrough called the Snowman Consensus. Consensus is the method by which a chain agrees on blocks, and Avalanches innovation is to implement a more efficient, faster polling technique between validators. This allows it to produce blocks at a faster rate with more transaction capacity in each block than Ethereum.</p> <p class=\"paywall-full-content\">On legacy blockchains, this means far more communication than necessary, slowing block processing time. By contrast, Avalanche does not have a fixed leader, and instead allows any validator to propose blocks from the transactions they observe. Avalanche validators then ping one another in small, randomly selected groups to conduct repeated polls on the correct ledger and its content. Validators repeat these small-group polls until they have enough mathematical confidence that their view has finalized, and the network will converge on the same ledger.</p> <p class=\"paywall-full-content\">The result of this process is that Avalanche can process a block every 1.2 seconds, and the transactions within each block are considered final almost instantly. Avalanche competitor Ethereum produces blocks every 12 seconds while finality takes around 12.8 minutes. This allows Avalanche users to recognize settlement of their transactions within a few seconds, giving the chain significant practical advantages for financial use cases.</p> <h2 class=\"paywall-full-content\">Avalanches Multi-Chain Architecture</h2> <p class=\"paywall-full-content\">Avalanche is not a single blockchain but a system composed of many blockchains built using Avalanches software. There are 81 live blockchains in the ecosystem, with hundreds more in development. Each Avalanche L1 can bootstrap its own validators or use core validators operating on Avalanches primary chains. Many L1s also modify Avalanches core software to tailor performance, governance, and functionality, including cross-chain connections to other Avalanche L1s and to the Avalanche C-Chain. Some L1s are public while others are private and permissioned.</p> <p class=\"paywall-full-content\">The Avalanche Primary Network comprises the three original Avalanche chains. These are the C, P, and X chains. While the C-Chain is the epicenter of Avalanches crypto activity, the P-Chain is the network that coordinates Avalanches validators. The X-chain is currently only used to mint inflationary AVAX tokens. Each of these chains uses AVAX as the native token for payments and usage.</p> <p class=\"paywall-full-content\">The Avalanche C-Chain is the most economically valuable blockchain in the Avalanche ecosystem and, on average, processes $528M in economic activity each day. It uses the Ethereum Virtual Machine, which allows Avalanche developers to use the same smart contract language and tooling used to build Ethereum applications. Thus, Ethereum developers can quickly deploy their applications to Avalanche with only a few tweaks. In practice, this opened the aperture for new entrants to the Avalanche ecosystem by tapping into a huge pool of potential builders.</p> <p class=\"paywall-full-content\">The C-Chain offers economic and scaling advantages over Ethereum. It can process (+88%) more transaction throughput (measured by gas) while pricing transactions at 1/50<sup>th</sup>the cost of Ethereums fees. Avalanche also has the unique ability to rapidly increase its block size during periods of high demand, meaning that Avalanches throughput advantage grows during stressful periods.</p> <h3 class=\"paywall-full-content\">Avalanche Prices Transaction Fees are Lower Than Competitors</h3> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://www.vaneck.com/contentassets/9f01899823304e249d57473def77b38e/6756_avalanche-201-blog_chart-2_2026-2_v1.svg\" alt=\"Avalanche Prices Transaction Fees are Lower Than Competitors\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\"> </p></figcaption></figure></p> <p class=\"paywall-full-content\"><em>Source: Artemis XYZ as of 1/28/2026. <strong>Past performance is no guarantee of future results. Not intended as a recommendation to buy or sell any securities named herein.</strong></em></p> <p class=\"paywall-full-content\">Outside of the Primary Network, an L1 with notable traction is Binary Holdings, which runs a rewards and loyalty program for South Asian telecommunications firms. It reports 36M daily active addresses and roughly 40M transactions per day, reflecting a blockchain-as-infrastructure thesis where end users may not even realize they are interacting with a blockchain.</p> <p class=\"paywall-full-content\">Another is Dexalot L1, designed to provide centralized-exchange-like speed and capacity while preserving onchain transparency. Dexalot operates a dual-chain setup: users bridge and deposit via Avalanche C-Chain and execute trades on a customized L1 optimized for large trading volumes.</p> <h2 class=\"paywall-full-content\">Enterprise Adoption for Traditional Finance and Tokenization</h2> <p class=\"paywall-full-content\">Avalanche has launched public pilots for private markets tokenization with well-known traditional finance participants. For example, Apollo tokenized a $50M credit fund on Avalanche in January 2026. Avalanche has also pursued distribution-oriented partnerships aligned with enterprise requirements, including AWS support for government-oriented deployment and compliance pathways.</p> <p class=\"paywall-full-content\">Deloitte has used Avalanche to create a platform intended to improve the speed, security, and accuracy of FEMA reimbursements following disasters. These examples highlight the direction of travel: Avalanche is positioning itself as infrastructure that can plug into real workflows, not just crypto-native applications.</p> <p class=\"paywall-full-content\">Avalanche has key advantages over competing blockchains, but a practical question is: Why would someone want to deploy an Avalanche L1 instead of an Ethereum L2?</p> <h2 class=\"paywall-full-content\">Service and accountability</h2> <p class=\"paywall-full-content\">Avalanche offers builders a dedicated, for-profit engineering organization, Ava Labs, that can provide direct support, implementation assistance, and customization in a way that feels closer to a SaaS vendor relationship. Ethereum has excellent vendors and L2 teams, but creating an L2 on Ethereum typically requires a builder to choose a team with an opinionated framework. In some cases, those Ethereum L2 consultants may also push design decisions that benefit their own economic model rather than the builders.</p> <h2 class=\"paywall-full-content\">Sovereign chain design</h2> <p class=\"paywall-full-content\">An Avalanche L1 is a sovereign network where the deployer can set rules, define execution, and choose the virtual machine. That flexibility matters when an application or use case cannot be implemented within the EVM's limits, or when the builder needs to tune governance and performance for a specific workflow.</p> <h2 class=\"paywall-full-content\">Operational and compliance flexibility</h2> <p class=\"paywall-full-content\">Avalanche offers SOC 2 certified infrastructure that supports enterprise-grade security, with options for compliant operations in regulated sectors. An enterprise can define validator requirements, including hardware standards and participation restrictions tied to governance or compliance. In practice, this can be harder to replicate on Ethereum L2s without adding extra trust assumptions around sequencers, committees, or bespoke bridging.</p> <h2 class=\"paywall-full-content\">Enterprise-friendly economics</h2> <p class=\"paywall-full-content\">Avalanche L1s can define their own fee markets and use the token of their choice, meaning they do not need to use AVAX for gas. Operating costs are also easier for enterprises to budget because they are tied more directly to the validator footprint than to fluctuating usage. Avalanches L1 validator fee model is structured as an ongoing charge to run validators, whereas Ethereum is closer to a pay-as-you-go business arrangement. As a result, Avalanche L1s can feel more like SaaS licensing models with costs that scale with deployment requirements rather than short-term demand spikes. This makes the costs for Avalanche L1 operators more predictable.</p> <h2 class=\"paywall-full-content\">Risk and performance isolation</h2> <p class=\"paywall-full-content\">Ethereum L2s ultimately inherit key constraints from Ethereum, especially around settlement back to L1 and the specific rollup's design choices. For example, optimistic rollup L2s have built-in delay periods for withdrawals that would prevent L2 users from quickly withdrawing funds. Additionally, Ethereum L2 can still experience congestion if Ethereum Mainnet is overloaded with activity.</p> <p class=\"paywall-full-content\">Because Avalanche L1s isolate performance and fees from other chains, enterprises can avoid congestion problems caused by unrelated activity. Also, Avalanche L1s can adjust throughput, latency, and governance to fit the needs of the application.</p> <h2 class=\"paywall-full-content\">Simplicity of deployment</h2> <p class=\"paywall-full-content\">Avalanche has built the tooling and support to allow potential developers to quickly create Avalanche blockchains. In fact, builders without deep coding experience can create an Avalanche L1 without code and deploy it within minutes. Because Avalanche offers cross-chain support out of the box, sophisticated developers can create dozens of blockchains that act in concert to meet their needs.</p> <h2 class=\"paywall-full-content\">Key partnerships</h2> <ol class=\"paywall-full-content\"><li>Cloud and infrastructure partners for lowering the operational friction of operating Avalanche blockchains or using Avalanche blockchains,</li></ol> <p class=\"paywall-full-content\"><strong>Partners:</strong> Amazon Web Services (AWS), Alibaba Cloud, Tencent Cloud.</p> <ol class=\"paywall-full-content\"><li>Public sector and government process partners modernizing heavy workflows, improving auditability, and reducing fraud and administrative overhead in government adjacent processes.</li></ol> <p class=\"paywall-full-content\"><strong>Partners:</strong> Deloitte and the California Department of Motor Vehicles (DMV).</p> <ol class=\"paywall-full-content\"><li>Payments and onboarding partners that reduce the adoption bottleneck for users and mainstream applications, allowing them to quickly get funds onchain while abiding by compliance rules.</li></ol> <p class=\"paywall-full-content\"><strong>Partners:</strong> Stripe, Mastercard, Visa</p> <ol class=\"paywall-full-content\"><li>Capital markets, banking, and institutional tokenization partners to prove Avalanches potential to operate backend infrastructure for major financial institutions, including tokenization, fund operations, and credit market infrastructure.</li></ol> <p class=\"paywall-full-content\"><strong>Partners:</strong> Sumitomo Corporation, FIS and Intain, Citi and Wellington Management and WisdomTree and ABN AMRO and DTCC Digital Assets and Tokeny, J.P. Morgan Onyx and Apollo and WisdomTree and LayerZero, Securitize.</p> <ol class=\"paywall-full-content\"><li>Commerce and consumer distribution partners that see digital assets and onchain experiences as additive to customer acquisition and retention.</li></ol> <p class=\"paywall-full-content\"><strong>Partners:</strong> FIFA, Uptop, Sports Illustrated, EVEN, TITAN</p> <p class=\"paywall-full-content\"><em>The corporate partnerships in this blog reflect the use of the Avalanche network and do not imply endorsement of AVAX as an investment.</em></p> <h3 class=\"paywall-full-content\">Avalanche C-Chain Revenue</h3> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://www.vaneck.com/contentassets/9f01899823304e249d57473def77b38e/6756_avalanche-201-blog_chart-3_2026-2_v1.svg\" alt=\"Avalanche C-Chain Revenue\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\"> </p></figcaption></figure></p> <p class=\"paywall-full-content\"><em>Source: Artemis XYZ as of 2/06/2026. <strong>Past performance is no guarantee of future results. Not intended as a recommendation to buy or sell any securities named herein.</strong></em></p> <p class=\"paywall-full-content\">The AVAX token is the native token of all Avalanche blockchains but is most used on Avalanches C-Chain. This means that all transactions on that network necessitate AVAX to be processed. Because the C-Chains capacity for transactions is limited, as the level of activity increases, the amount of AVAX needed to transact rises as well. Like Ethereum, Avalanche also implements an economic policy that burns base fees to offset inflation. As Avalanche transaction velocity increases, more AVAX tokens are burned, and the total can be enormous during times of high activity. To date, 4.9M AVAX has been permanently removed from circulation.</p> <p class=\"paywall-full-content\">The current supply of AVAX is 431M, while the maximum supply of the token is 720M. To reach the maximum supply of AVAX, Avalanche mints new tokens to reward validators and stakers for running and securing the network. The current inflation rate for new AVAX tokens is (~3.5%) per year, and the number of new tokens emitted fluctuates based on the number of AVAX staked and their staking duration.</p> <p class=\"paywall-full-content\">Because Avalanche is a Proof-of-Stake (PoS) blockchain, AVAX is used to back validators who run and secure Avalanches C-Chain. Each validator must be backed by a minimum of 2,000 AVAX bond to operate on the blockchain, but in practice, validator stakes are often much larger because larger validators can receive more rewards (up to 3M AVAX). To satisfy the bonding requirement, validators often source AVAX bonds from tokenholders seeking to earn rewards on their AVAX holdings. However, validators who are dishonest or who demonstrate poor uptime can lose their access to rewards or even be booted from the network. This economic incentive drives stakers to seek high-quality validators.</p> <p class=\"paywall-full-content\">The current reward rate for Avalanche stakers is (&gt;7%), which is greater than the rate of inflation because not all AVAX tokens on Avalanche are staked. To stake on Avalanche, someone must bond a minimum of 25 AVAX and choose the duration of their lock-up. Those who choose to delegate their AVAX to a validator for longer periods receive higher rewards than those who opt for shorter bonding periods.</p> <p class=\"paywall-full-content\">Outside of Avalanche C-Chain, validators of other Avalanche L1s must pay a per-validator fee of 1.33 AVAX per month. These fees are burned. With ~850 L1 validators, this amounts to $160k in annual revenue.</p> <h2 class=\"paywall-full-content\">The Bear and Bull Case for AVAX</h2> <p class=\"paywall-full-content\"><strong>The Bear Case: Declining Metrics and Competitive Pressures</strong></p> <p class=\"paywall-full-content\">Currently, Avalanche is at a crossroads, making some bearish about its future. Once a member of the SOLUNAVAX triad meme spawned by immense returns in the summer of 2021 (&gt;+1000% returns in 4 months), AVAX has lost (-62%) of its value in the past year. Aside from broad, weak alt-token performance (<a href=\"https://www.marketvector.com/indexes/digital-assets/marketvector-smart-contract-leaders\" rel=\"noopener\" title=\"MVSCLE - MarketVector Smart Contract Leaders Index\"><strong>MarketVector Smart Contract Leaders Index</strong></a>: -37% y/y), competitive pressures have driven Avalanche to reduce its transaction pricing on the C-Chain by (-96%). This has led to a (-42%) y/y reduction in revenues.</p> <p class=\"paywall-full-content\">Avalanche onchain metrics have also generally lagged those of its competitors. Revenue has fallen to 13<sup>th </sup>in the 30-day trailing period, down from 8<sup>th </sup>place 2 years ago and 4<sup>th </sup>place 4 years ago. In TVL, over the past four years, it has dropped from the 3<sup>rd</sup>-ranked blockchain to the 7<sup>th</sup>-ranked blockchain.</p> <p class=\"paywall-full-content\">At the same time, there is concern that Avalanche L1s do not remit enough value to AVAX because they have little use in their frameworks. This is due to the lack of requirement to use AVAX as a native token on Avalanche L1s. Previously, Avalanche L1s (formerly 'Subnets') were required to stake 2,000 AVAX per validator, but this requirement was nixed, removing a major token sink for AVAX.</p> <p class=\"paywall-full-content\"><strong>Potential risks </strong></p> <ol class=\"paywall-full-content\"> <li>Competition from other blockchains</li> <li>Value of blockchain technologies accruing to existing financial institutions</li> <li>Emerging blockchains offering better technology</li> <li>Regulation of DeFi</li> <li>Increase in the inflation rate or expansion of the token supply</li> <li>Technical risks and hacking attacks</li> <li>Potential risks related to team dynamics and strategic priorities of core developers</li> </ol> <p class=\"paywall-full-content\"><strong>The Bull Case: Pivot to Enterprise and Ecosystem Growth</strong></p> <p class=\"paywall-full-content\">However, it is important to remember that investors valuing tokens like AVAX must look to the future, not Avalanches past identity. Avalanche technology was initially used to facilitate speculation, and it was presumed that this would evolve towards more sustainable financial products and services. However, the speculative narrative has evaporated as systematically overvalued cryptocurrencies failed to mature into more sustainable use cases. At the same time, existing financial institutions began adopting the most promising components of crypto to navigate many blockchain ecosystems effectively. As a result, Avalanche is moving towards enterprise use cases and real-world assets to build the products that can attract corporate interest. In this enterprise-centric new vision, Avalanche is an absolute leader compared to most other crypto projects.</p> <p class=\"paywall-full-content\">Avalanches new approach to long-term token holder value is to bring as many users as possible into its network of blockchains. This includes substantial price decreases alongside marketing focus on Avalanche L1s. Thus, one can view its price decreases as an opportunity to attract new users and expand use cases. Once Avalanche has proved its value to a large user base, it is presumed to be able to capture more value from its blockchains activity. Thus far, some of the steps to attract new activity have been working.</p> <p class=\"paywall-full-content\">The deliberate choice to reduce C-Chain fees has led to transactions growing (+370%) and (DAA<a href=\"https://seekingalpha.com/symbol/S\" title=\"SentinelOne, Inc.\">S</a>) surging (+368%) y/y. Likewise, Avalanche L1 outreach has attracted nearly 4M DAAs to Avalanches L1s (2-3x more DAUs than Ethereums ecosystem), collectively generating ~$25k in fees per day. At the same time, tokenization efforts have led to $1.4B in assets on Avalanche through partnerships with some of the worlds most important financial institutions. If Avalanche can continue to prove itself as an important backend financial infrastructure, it stands to benefit greatly from tokenization.</p> <p class=\"paywall-full-content\"><strong>Potential catalysts</strong></p> <ol class=\"paywall-full-content\"> <li>Tokenization is increasing usership and usage of the Avalanche blockchains</li> <li>Re-institution Avalanche L1 validator AVAX holding requirements</li> <li>AVAX native token being adopted by Avalanche L1s</li> <li>Avalanches growing gaming system is driving wallet growth</li> <li>The launch of high-velocity financial products</li> <li>Additional Avalanche L1 launches</li> </ol> <h2 class=\"paywall-full-content\">The Token vs Contributor Interests Debate</h2> <p class=\"paywall-full-content\">A key consideration for AVAX, as with many smart contract platforms, is the relationship between the token and the organizations that materially contribute to the ecosystems development and commercialization. Ava Labs is a major contributor to Avalanches core software and provides services to teams building on Avalanche technology. As a for-profit company, Ava Labs will make business decisions around resourcing, pricing, partnerships, and product focus based on its own operational needs and stakeholder obligations, which may not always align perfectly with the preferences of AVAX holders.</p> <p class=\"paywall-full-content\">That said, the linkage is indirect. Ava Labs does not control AVAXs market price, and Avalanches open-source ecosystem includes many independent developers and participants. Over time, successful ecosystem growth, whether through C-Chain activity or application-specific L1s, can support network usage and broader awareness, which may be constructive for the asset.</p> <p class=\"paywall-full-content\">From a risk perspective, the main issues are practical rather than mechanical. If key ecosystem contributors were to face operational disruption, such as funding constraints, strategic shifts, or other business pressures, the pace of development, ecosystem support, or market confidence could be affected. Conversely, a well-capitalized, execution-oriented contributor base can help Avalanche remain competitive. We therefore view Ava Labs as a net positive for Avalanche today, while recognizing that AVAXs long-term outcome ultimately depends on adoption and the broader ecosystem, not any single company.</p> <h3 class=\"paywall-full-content\">Avalanche Blockchain Fundamental Metrics</h3> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <tr> <td>Metric</td> <td>30D Average</td> <td>Ranking Out of Top 21 Blockchains</td> </tr> <tr> <td>Daily Revenue</td> <td>$8,094</td> <td>13</td> </tr> <tr> <td>Daily Active Users</td> <td>324,667</td> <td>9</td> </tr> <tr> <td>Total Value Locked</td> <td>$1,229,944,070</td> <td>7</td> </tr> <tr> <td>Daily Transactions</td> <td>2,322,136</td> <td>9</td> </tr> <tr> <td>Stablecoin Supply</td> <td>$1,703,767,118</td> <td>7</td> </tr> <tr> <td>Daily DEX Volume</td> <td>$169,839,958</td> <td>6</td> </tr> <tr> <td>Daily Stablecoin Transfer Volume</td> <td>$2,397,119,748</td> <td>7</td> </tr> <tr> <td>Daily Economic Activity</td> <td>$528,572,767</td> <td>5</td> </tr> <tr> <td>Twitter Followers</td> <td>1,121,086</td> <td>6</td> </tr> <tr> <td>MAUs</td> <td>1,051,674</td> <td>6</td> </tr> <tr> <td>Daily New Users</td> <td>49,838</td> <td>7</td> </tr> <tr> <td>Total Onchain Lending</td> <td>$1,339,098,882</td> <td>5</td> </tr> <tr> <td>Average Transaction Cost</td> <td>$0.004</td> <td>3</td> </tr> <tr> <td>Staked Value</td> <td>$2,698,841,179</td> <td>4</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\"><em>Source: Artemis XYZ as of 1/28/2026. <strong>Past performance is no guarantee of future results. Not intended as a recommendation to buy or sell any securities named herein.</strong></em></p> <h2 class=\"paywall-full-content\">Avalanche Leadership Team</h2> <p class=\"paywall-full-content\"><em>Emin Gn Sirer - CEO</em></p> <p class=\"paywall-full-content\">Computer scientist and co-founder who helped create the Avalanche consensus approach and leads the technical direction of Ava Labs. He is also a Cornell computer science professor and has held leadership roles in academic crypto research, including as a co-director of IC3.</p> <p class=\"paywall-full-content\"><em>John Wu - President</em></p> <p class=\"paywall-full-content\">Leads commercial strategy, business development, and partnerships. Before Ava Labs, he built his career as a buy-side tech investor, including at Tiger Management, and later ran investment and operating roles across fintech, including leading Sureview Capital and managing a technology portfolio at Kingdon Capital.</p> <p class=\"paywall-full-content\"><em>Charley Cooper - Chief Operating Officer</em></p> <p class=\"paywall-full-content\">Runs operations with deep experience across market structure and regulation. Previously served in senior leadership at the CFTC and held senior roles in financial markets infrastructure, including at State Streets trading and clearing organization, with earlier experience at Deutsche Bank.</p> <p class=\"paywall-full-content\"><em>John Nahas  Chief Business Officer</em></p> <p class=\"paywall-full-content\">Leads business development and ecosystem growth for Ava Labs and the Avalanche network, overseeing partnerships and go-to-market across multiple verticals (including institutional/capital markets, enterprise, wallets &amp; exchanges, retail/consumer, gaming, and DeFi) and driving international expansion through regional teams globally.</p> <p class=\"paywall-full-content\"><em>Wee Ming Choon - Chief Legal Officer</em></p> <p class=\"paywall-full-content\">Leads legal and regulatory strategy with a rare combination of software engineering and law. Prior to Ava Labs, his background includes roles at major tech and crypto-native organizations, including Meta and ConsenSys, as well as private practice at Latham &amp; Watkins.</p> <h2 class=\"paywall-full-content\">The Bottom Line on Avalanche's Value Proposition</h2> <p class=\"paywall-full-content\">Overall, we recognize the conflict embedded in Avalanches structure, but we believe the value Ava Labs provides to AVAX holders outweighs these concerns, especially if the scaling strategy succeeds and AVAXs role in value capture strengthens over time.</p> <p class=\"paywall-full-content\"><strong>Disclosures</strong></p> <p class=\"paywall-full-content\"><strong>Index Definitions</strong></p> <p class=\"paywall-full-content\"><strong>MarketVector Smart Contract Leaders Index: </strong>designed to track the performance of the largest and most liquid smart contract assets and is an investable subset of MarketVector Smart Contract Index.</p> <p class=\"paywall-full-content\"><strong>Coin Definitions</strong></p> <p class=\"paywall-full-content\"><strong>Avalanche (AVAX): </strong>A Layer-1 platform supporting custom subnets; AVAX is used for fees, staking, and governance.</p> <p class=\"paywall-full-content\"><strong>Ethereum (ETH): </strong>A decentralized smart-contract platform used to build and run applications and Layer-2 networks.</p> <p class=\"paywall-full-content\"><strong>Binance Coin (BNB): </strong>The native asset of BNB Chain used for transaction fees, staking, and ecosystem utilities.</p> <p class=\"paywall-full-content\"><strong>Solana (SOL): </strong>A high-throughput Layer-1 blockchain; SOL is used for fees and staking to secure the network.</p> <p class=\"paywall-full-content\"><strong>Tron (TRX): </strong>A Layer-1 blockchain focused on high-volume payments and stablecoin transfers; TRX is used for fees and staking.</p> <p class=\"paywall-full-content\"><strong>Arbitrum (ARB): </strong>The governance token of the Arbitrum Layer-2 ecosystem; not required for gas on Arbitrum chains.</p> <p class=\"paywall-full-content\"><strong>Risk Considerations</strong></p> <p class=\"paywall-full-content\">This is not an offer to buy or sell, or a recommendation to buy or sell any of the securities, financial instruments or digital assets mentioned herein. The information presented does not involve the rendering of personalized investment, financial, legal, tax advice, or any call to action. Certain statements contained herein may constitute projections, forecasts and other forward-looking statements, which do not reflect actual results, are for illustrative purposes only, are valid as of the date of this communication, and are subject to change without notice. Actual future performance of any assets or industries mentioned are unknown. Information provided by third party sources are believed to be reliable and have not been independently verified for accuracy or completeness and cannot be guaranteed. VanEck does not guarantee the accuracy of third party data. The information herein represents the opinion of the author(s), but not necessarily those of VanEck or its other employees.</p> <p class=\"paywall-full-content\">Index performance is not representative of fund performance. It is not possible to invest directly in an index.</p> <p class=\"paywall-full-content\"><strong>Investments in digital assets and Web3 companies are highly speculative and involve a high degree of risk.</strong> These risks include, but are not limited to: the technology is new and many of its uses may be untested; intense competition; slow adoption rates and the potential for product obsolescence; volatility and limited liquidity, including but not limited to, inability to liquidate a position; loss or destruction of key(s) to access accounts or the blockchain; reliance on digital wallets; reliance on unregulated markets and exchanges; reliance on the internet; cybersecurity risks; and the lack of regulation and the potential for new laws and regulation that may be difficult to predict. Moreover, the extent to which Web3 companies or digital assets utilize blockchain technology may vary, and it is possible that even widespread adoption of blockchain technology may not result in a material increase in the value of such companies or digital assets.</p> <p class=\"paywall-full-content\"><strong>Digital asset prices are highly volatile, and the value of digital assets, and Web3 companies, can rise or fall dramatically and quickly. If their value goes down, theres no guarantee that it will rise again. As a result, there is a significant risk of loss of your entire principal investment.</strong></p> <p class=\"paywall-full-content\">Digital assets are not generally backed or supported by any government or central bank and are not covered by FDIC or SIPC insurance. Accounts at digital asset custodians and exchanges are not protected by SPIC and are not FDIC insured. Furthermore, markets and exchanges for digital assets are not regulated with the same controls or customer protections available in traditional equity, option, futures, or foreign exchange investing.</p> <p class=\"paywall-full-content\"><strong>Digital assets</strong> include, but are not limited to, cryptocurrencies, tokens, NFTs, assets stored or created using blockchain technology, and other Web3 products.</p> <p class=\"paywall-full-content\"><strong>Web3 companies</strong> include but are not limited to, companies that involve the development, innovation, and/or utilization of blockchain, digital assets, or crypto technologies.</p> <p class=\"paywall-full-content\"><strong>All investing is subject to risk, including the possible loss of the money you invest. As with any investment strategy, there is no guarantee that investment objectives will be met and investors may lose money. Diversification does not ensure a profit or protect against a loss in a declining market. Past performance is no guarantee of future performance.</strong></p> <p class=\"paywall-full-content\"><a href=\"https://www.vaneck.com/us/en/blogs/digital-assets/matthew-sigel-avalanche-201-the-institutional-platform/\" rel=\"nofollow\"><em>Original Post</em></a></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2178269162/image_2178269162.jpg",
            "link": "https://seekingalpha.com/article/4875491-avalanche-201-institutional-platform",
            "pub_date": "2026-02-27 01:41:31",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4875480",
            "title": "SIVR: The Cheapest ETF Proxy On Physical Silver",
            "description": "<figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2233425446/image_2233425446.jpg?io=getty-c-w630\" alt=\"Silver bullion bars 999.9 fine, background. 3D rendering\" data-id=\"2233425446\" data-type=\"getty-image\" width=\"1536\" height=\"998\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2233425446/image_2233425446.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2233425446/image_2233425446.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2233425446/image_2233425446.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2233425446/image_2233425446.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2233425446/image_2233425446.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2233425446/image_2233425446.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2233425446/image_2233425446.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2233425446/image_2233425446.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">natatravel/iStock via Getty Images</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <h2><strong>Introduction To The abrdn Physical Silver Shares ETF</strong></h2> <p data-eci=\"true\">The abrdn Physical Silver Shares ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SIVR\" title=\"abrdn Physical Silver Shares ETF\">SIVR</a></span>), which made its debut on the markets on July 20, 2009, has so far accumulated total assets under management of over $6.6B. SIVR, which belongs to Aberdeen Group PLC (a<span class=\"paywall-full-content\"> UK-based investment manager), is issued by the latters wholly-owned subsidiary- abrdn ETFs Sponsor LLC [AESL]. To procure a stake in SIVR, investors will need to pay an expense ratio of 0.3%. SIVR does not make any dividends.</span></p> <h2 class=\"paywall-full-content\"><strong>What Does SIVR Do?</strong></h2> <p class=\"paywall-full-content\">SIVRs chief purpose it to serve as an accessible and cost-efficient vehicle for those who want to profit from the movement of physical silver prices (and not silver futures). SIVR, is basically the owner of<a href=\"https://www.aberdeeninvestments.com/docs?editionId=7690ff0f-7aed-44f1-b573-3146cc0d5c1e\" rel=\"nofollow\" title=\"https://www.aberdeeninvestments.com/docs?editionId=7690ff0f-7aed-44f1-b573-3146cc0d5c1e\" target=\"_blank\"> 75.4m</a> troy ounces of physical silver bullion bars, which are stored and maintained in secured vaults in the UK.</p> <p class=\"paywall-full-content\">Also consider that rather than being set up as an investment company that resorts to active management strategies to generate returns, SIVR is structured as a grantor trust. This means the onus here is to just hold the physical silver and issue shares against it (which investors buy, giving them fractional ownership of the entire silver held), rather than selling the metal when it goes higher, or purchasing it when it dips, or enhancing returns through the use of derivative contracts, etc.</p> <h2 class=\"paywall-full-content\"><strong>Who Are the Main Parties Within SIVRs Setup?</strong></h2> <p class=\"paywall-full-content\">Behind SIVRs successful operations there are a number of key parties that are worth noting:</p> <ul class=\"paywall-full-content\"> <li> <em>Sponsor</em>: As covered in the initial section of this article, this role is carried out by AESL, whose responsibility is to create and register shares of SIVR on the NYSE Arca, and issue new shares when required. AESL can be construed to be the general manager of this set-up and is also responsible for picking other key parties (as described below) that are essential to the running of SIVR.</li> <li> <em>Custodian:</em> The silver bars that SIVR holds arent held by the sponsor, but by a custodian called ICBC Standard Bank PLC [ISBP]. Interestingly ISBP only took over custodianship responsibilities of SIVR in May 2024 [before that custodianship duties were carried out by JP Morgan Chase] who parks them in their London vaults.</li> <li> <em>Trustee:</em> Trusteeship is carried out by the Bank of New York Mellon Corporation (<a href=\"https://seekingalpha.com/symbol/BK\" title=\"The Bank of New York Mellon Corporation\">BK</a>) that looks into the day-to-day administrative work (calculation of the daily NAV, accounting entries, creating grantor trust tax information, etc.)</li> <li> <em>Metal inspector:</em> To ensure that the quality of the bullion bars held in the vaults doesnt disintegrate, the services of Bureau Veritas Commodities UK Ltd (<a href=\"https://seekingalpha.com/symbol/BVRDF\" title=\"Bureau Veritas SA\">BVRDF</a>), is also tapped twice a year. Besides a standard inspection at the end of the year, the first inspection takes place on a random date during the year.</li> </ul> <h2 class=\"paywall-full-content\"><strong>What Are the Risks Associated With SIVR?</strong></h2> <p class=\"paywall-full-content\">Since SIVR is established as a grantor trust that holds physical metal, it exhibits some tax inefficiencies that may be seen as cumbersome to a fair few. For instance, long-term capital gains [LTCG] are taxed at a higher collectibles rate of 28% rather than 20% LTCG rate.</p> <p class=\"paywall-full-content\">In addition to that, because SIVR is a grantor trust, it does not pay any income tax, with all tax liabilities flowing through to its investors. Also, we know this trust has various expenses to incur, but because theres no income coming in to cover those expenses, a fraction of the silver owned needs to be sold every month to meet those expenses (also existing holders of SIVR own less silver every month, as a pro-rate share of their holdings been cashed in every month to meet those expenses). Also, even though there is some disposition of investors assets every month, the proceeds dont come to investors accounts, yet they are charged with a capital gain or loss and dont receive a tax break for the same either. This facet could prove to be particularly troubling to those who own SIVR in taxable brokerage accounts (as opposed to IRA or 401(k)s)).</p> <p class=\"paywall-full-content\">While silver does exhibit shades of a safe haven when risk sentiment in the markets dip or <span id=\"jS$705\" class=\"j3\">geo</span>political risks spike, this defensive trait certainly isnt as pronounced as gold. Also, silvers prospects are closely tied to the health of global industrials, making this quite a risky bet that could face some pressure during global cyclical downswings. Investors should also consider that unlike diversified ETFs, SIVR is a single-commodity ETF, which certainly elevates its risk profile. This can be validated even further by SIVRs standard deviation and volatility readings which are roughly 3x more than a standard ETF, making this product unsuitable for investors with conservative risk appetite.</p> <figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113303487551_origin.png\" rel=\"lightbox\" data-width=\"905\" data-height=\"293\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113303487551_origin.png?io=w640\" alt=\"Risk\" contenteditable=\"false\" width=\"640\" height=\"207\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113303487551_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113303487551_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113303487551_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113303487551_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure><p class=\"paywall-full-content\">Silver has an inverse relationship with the US Dollar, so if the latter witnesses meaningful appreciation, this could be detrimental for SIVR.</p> <p class=\"paywall-full-content\">Silver has benefited through multi-year deficits (including 2026, we will see will be six straight years of deficits), but investors should also note that these deficits are shrinking by the year (for instance FY25s estimated deficit of<a href=\"https://www.canadianminingreport.com/blog/is-silver-s-rally-being-driven-by-emotions-or-real-supply-demand\" rel=\"nofollow\" title=\"https://www.canadianminingreport.com/blog/is-silver-s-rally-being-driven-by-emotions-or-real-supply-demand\" target=\"_blank\"> 95-149Moz</a>, is poised to shrink to 68Moz this year) and in a few years, theres potential for the market position to normalize, which ultimately wont reflect well on prices.</p> <p class=\"paywall-full-content\">If investors are thinking of pursuing SIVR with the intention of also procuring a quarterly, semi-annual or annual dividend bonus (which is standard practice with most ETFs today), then this isnt the right product. The holdings (equities, bonds, derivative contracts) in most ETFs usually generate some form of income, or are sometimes lent out, to earn additional income, which is then passed on to these shareholders by way of distributions, but in SIVRs case, it just plainly holds physical silver, and its returns are just a function of the price movements of silver (and nothing more) after accounting for trust expenses.</p> <p class=\"paywall-full-content\">Investors should also note that SIVR hasnt taken out an insurance policy to cover its silver holdings; insurance support if any, only comes in the form of the insurance that the custodian-ISBP, has taken for its entire operation (and not just the silver it holds for SIVR).</p> <h2 class=\"paywall-full-content\"><strong>Who Is SIVR For?</strong></h2> <p class=\"paywall-full-content\">SIVR is meant for those who want a cost-efficient and transparent route to owning physical silver. For further context note that, SIVRs expense ratio of 0.3% is already 20bps lower than the median expense ratio of all ETFs.</p> <figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113309633725_origin.png\" rel=\"lightbox\" data-width=\"903\" data-height=\"290\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113309633725_origin.png?io=w640\" alt=\"Expense\" contenteditable=\"false\" width=\"640\" height=\"206\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113309633725_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113309633725_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113309633725_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113309633725_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure><p class=\"paywall-full-content\">Facilitating such a low expense ratio in the silver space is not easy to come by, with competing products priced at a much higher range of <a href=\"https://etfdb.com/etfs/commodity/silver/#etfs__expenses&amp;sort_name=expense_ratio&amp;sort_order=desc&amp;page=1\" rel=\"nofollow\" title=\"https://etfdb.com/etfs/commodity/silver/#etfs__expenses&amp;sort_name=expense_ratio&amp;sort_order=desc&amp;page=1\" target=\"_blank\">0.5-0.95%</a> (admittedly, some of these products are leveraged ETFs which will understandably cost more, but even against the unleveraged ETFs SIVR has a strong edge).</p> <p class=\"paywall-full-content\">SIVR also scores high on transparency, with its custodian- ISBP, providing a<a href=\"https://phoenix.icbcstandard.com/assets/public/barlists/Abrdn%20ETF%20Silver%20Bar%20List.pdf\" rel=\"nofollow\" title=\"https://phoenix.icbcstandard.com/assets/public/barlists/Abrdn%20ETF%20Silver%20Bar%20List.pdf\" target=\"_blank\"> bar list</a> which is updated every day.</p> <p class=\"paywall-full-content\">Investors <span>attracted to </span>SIVR are typically also those who are likely feeling emboldened about the long-term health and the buoyancy of the global industrial landscape; after all, roughly 60% of silver demand comes from the industrial sector.</p> <figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113316040163_origin.jpeg\" rel=\"lightbox\" data-width=\"679\" data-height=\"252\" title=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113316040163_origin.jpeg\" target=\"_blank\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113316040163_origin.jpeg?io=w640\" alt=\"Silver demand sources\" contenteditable=\"false\" width=\"640\" height=\"238\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113316040163_origin.jpeg?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113316040163_origin.jpeg?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113316040163_origin.jpeg?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113316040163_origin.jpeg?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Sprott</span></p></figcaption></figure><p class=\"paywall-full-content\">Within industrials, those who expect the solar wave to gain traction will like this product, as modern solar cells are increasingly seeing higher silver paste per cells than older models. Also, if investors are big on growing electrification of the modern world, a position in SIVR would represent a good bet, as silver is the most conductive metal around.</p> <p class=\"paywall-full-content\">SIVR would also be suitable for those who expect the debasement and devaluation of fiat currencies.</p> <p class=\"paywall-full-content\">SIVR and silver would also represent a good diversifier for US equity-heavy portfolios; we say this because over the last decade, the price of silver has exhibited relatively low correlation (less than 0.25x) with the US equity benchmark- the S&amp;P 500.</p> <figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113290574749_origin.png\" rel=\"lightbox\" data-width=\"756\" data-height=\"594\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113290574749_origin.png?io=w640\" alt=\"Correlation\" contenteditable=\"false\" width=\"640\" height=\"503\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113290574749_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113290574749_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113290574749_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113290574749_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>SIVR</span></p></figcaption></figure> <h2 class=\"paywall-full-content\"><strong class=\"highlighted_text\">Peers Of SIVR</strong></h2> <p class=\"paywall-full-content\">If not for SIVR, investors who want unleveraged ETF access to physical silver could also look at the iShares Silver Trust (<a href=\"https://seekingalpha.com/symbol/SLV\" title=\"iShares Silver Trust ETF\">SLV</a>) or the Sprott Physical Silver Trust (<a href=\"https://seekingalpha.com/symbol/PSLV\" title=\"Sprott Physical Silver Trust USD\">PSLV</a>).</p> <p class=\"paywall-full-content\">SLV is the most established product out of the lot, with a trading history that goes back to April 2006 (whereas PSLV got listed around 15 months after SIVR in October 2010). Relative longevity certainly appears to have played a part in the respective AUMs of these products, although SLV is well ahead of the other two at nearly $50B of AUM. SLVs strong drawing power can also be felt through the liquidity it attracts every day (around $8B of dollar volumes, whereas the other two see less than half a billion dollars).</p> <p class=\"paywall-full-content\">PSLV, which is the priciest out of the lot (expense ratio of 0.57%), is meant for those also want the option of redeeming their stake through physical silver (and not just cash). Both SLV and SIVR dont have this useful redemption option. It must also be said that for the degree of AUM it has accumulated, PSLV sees<a href=\"https://www.cefconnect.com/fund/PSLV\" rel=\"nofollow\" title=\"https://www.cefconnect.com/fund/PSLV\" target=\"_blank\"> very strong daily liquidity</a> (almost half its total AUM). In addition to that, PSLV is set up as a Canadian trust, and thus the IRS recognizes it as a Passive Foreign Investment Corporation (PFIC). The benefit of this is that long-term capital gains could be a lot lower at<a href=\"https://sprott.com/media/ez3d322y/pslv.pdf\" rel=\"nofollow\" title=\"https://sprott.com/media/ez3d322y/pslv.pdf\" target=\"_blank\"> 15-20%,</a> rather than the 28% rate that the other two alternatives are subject to.</p> <figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113297715938_origin.png\" rel=\"lightbox\" data-width=\"889\" data-height=\"378\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113297715938_origin.png?io=w640\" alt=\"Key stats\" contenteditable=\"false\" width=\"640\" height=\"272\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113297715938_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113297715938_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113297715938_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/9658941-17721113297715938_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha, CEFConnect, ETF prospectuses</span></p></figcaption></figure><h2 class=\"paywall-full-content\"><strong>Summary</strong></h2> <p class=\"paywall-full-content\">SIVR represents the most cost-efficient route for investors who want to garner access to physical silver. However, given that SIVR is set up as a grantor trust, it remains susceptible to some tax inefficiencies, and its single metal focus also results in high volatility.</p> <p class=\"paywall-full-content\">This article answers these three main questions about SIVR:</p> <ul class=\"paywall-full-content\"> <li>Who are the main players behind SIVR?</li> <li>What type of investor is SIVR suitable for, and what are the risks associated with it?</li> <li>What are some alternatives to SIVR?</li> </ul> <div class=\"T2G6W paywall-full-content\" data-test-id=\"content-container\"><p class=\"paywall-full-content\"><span><em>Editor's note:</em></span><em> This article is intended to provide a general overview of the ETF for educational purposes only and, unlike other articles on Seeking Alpha, does not offer an investment opinion about the ETF.</em></p></div> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2233425446/image_2233425446.jpg",
            "link": "https://seekingalpha.com/article/4875480-sivr-cheapest-etf-proxy-on-physical-silver",
            "pub_date": "2026-02-27 01:36:04",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4875471",
            "title": "Hertz: Making Some Progress (Rating Upgrade)",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/478766504/image_478766504.jpg?io=getty-c-w630\" alt=\"Hertz car rental\" data-id=\"478766504\" data-type=\"getty-image\" width=\"3008\" height=\"2005\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/478766504/image_478766504.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/478766504/image_478766504.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/478766504/image_478766504.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/478766504/image_478766504.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/478766504/image_478766504.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/478766504/image_478766504.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/478766504/image_478766504.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/478766504/image_478766504.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">tupungato/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Thursday morning, we received <a href=\"https://seekingalpha.com/pr/20415387-hertz-transformation-drives-structural-revenue-gains-and-builds-sustainable-momentum#hasComeFromMpArticle=false\">fourth-quarter results</a> from Hertz (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/HTZ\" title=\"Hertz Global Holdings, Inc.\">HTZ</a></span>). The rental car company has been looking to turn around its business after a failed bet on electric vehicles led to significant losses. The<span class=\"paywall-full-content\"> latest results indicated that things are improving, but the company still faces a number of headwinds as we progress through 2026.</span></p> <h2 class=\"paywall-full-content\">Previous Coverage of the Name</h2> <p class=\"paywall-full-content\">It was nearly a year ago that I last covered the company, right as the overall market was getting worried over President Trump's <a href=\"https://seekingalpha.com/article/4771645-hertz-global-stock-sell-tariff-rally\">global tariff strategy</a>. Hertz shares had jumped on hopes that rising used car prices would lower the company's depreciation expenses and lead to better resale values. However, things haven't worked out totally as expected, as since then, the stock has only risen about 6.7%, compared to a more than 24% surge in the S&amp;P 500.</p> <h2 class=\"paywall-full-content\">A Look at the Q4 Results and Recent News</h2> <p class=\"paywall-full-content\">For the final period of 2025, Hertz reported revenues of $2.028 billion. While this number was down $12 million over the prior year period, it did beat street estimates by about $100 million. The company reported a small increase in average rentable vehicles, but it had a slightly lower revenue per unit figure. While the International segment showed about 10% top-line growth, the much larger Americas division showed a 3% decline.</p> <p class=\"paywall-full-content\">Hertz was able to narrow its losses quite a bit in the quarter, mainly due to a 21% drop in monthly depreciation per vehicle. The company also reduced its direct vehicle and operating expenses while also showing a decline in interest costs. However, the company still lost nearly $200 million, and this figure included a significant benefit from the reduction in the fair value of its public warrants. For the year, the net loss was $747 million.</p> <p class=\"paywall-full-content\">In the current quarter, management expects a mid-single-digit revenue increase, well above the street's estimate for less than 2%. The company believes its commercial strategy is paying off, and it is focused on its off-airport and mobility business this year. I'll be curious to see if this progress continues later in 2026 as electric vehicle giant Tesla (<a href=\"https://seekingalpha.com/symbol/TSLA\" title=\"Tesla, Inc.\">TSLA</a>) expands its robo-taxi network, which could be a headwind for the overall rental car industry.</p> <p class=\"paywall-full-content\">The other major piece of news recently was a big loss for the company. The U.S. Supreme Court <a href=\"https://seekingalpha.com/news/4538539-hertz-global-slips-after-the-supreme-court-declines-to-hear-bond-payout-case\">declined to hear a case</a> regarding the company's bond payouts related to its Chapter 11 bankruptcy. As a result of this, the lower court's ruling stayed in place, so the company made a $346 million payment in January as detailed in its <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0000047129/000165785326000008/htz-20251231.htm\" rel=\"nofollow\">10-K filing</a>. The Delaware Bankruptcy Court will determine whether any additional amounts are due.</p> <h2 class=\"paywall-full-content\">Balance Sheet and Cash Flow Update</h2> <p class=\"paywall-full-content\">Hertz finished 2025 with $565 million in cash on the balance sheet. However, due to the capital-intensive nature of the business, it also had over $17 billion in total debt. At nearly $16.5 billion, the net debt total worsened by almost three quarters of a billion dollars last year and is up more than $3.56 billion in the last three years alone.</p> <p class=\"paywall-full-content\">The problem for Hertz right now is that it's not generating enough cash to cover the net costs of its capital expenditures. In 2025, total operating cash flow was $1.625 billion, down about $600 million from the year before. However, the company's net vehicle expenditures after disposals were about $2.1 billion, so true free cash flow was deeply negative. If things continue as is, Hertz will need to raise further capital through either debt or equity.</p> <h2 class=\"paywall-full-content\">The Current Valuation Picture</h2> <p class=\"paywall-full-content\">With Hertz losing money currently, there is no price-to-earnings ratio to calculate here. On a price-to-sales basis, Hertz goes for about 0.18 times its <a href=\"https://seekingalpha.com/symbol/HTZ/earnings/estimates\">currently expected revenues</a> for this year. That's less than half the roughly 0.39 times that competitor Avis Budget Group (<a href=\"https://seekingalpha.com/symbol/CAR\" title=\"Avis Budget Group, Inc.\">CAR</a>) goes for. Hertz is projected to show more revenue growth in 2026, but Avis didn't lose as much money last year (after impairment charges).</p> <p class=\"paywall-full-content\">On the analyst side of things, it's a mixed picture. Of the 9 analysts who have covered the stock in the past three months, there were six hold ratings and three sells. The current <a href=\"https://seekingalpha.com/symbol/HTZ/ratings/sell-side-ratings#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link\">average price target</a> is $4.75, implying more than 7% upside from current levels. That average has risen from $3.39 a year ago, but three years ago it was nearly $25.</p> <h2 class=\"paywall-full-content\">Final Thoughts and Recommendation</h2> <p class=\"paywall-full-content\">As Hertz continues its turnaround efforts, Q4 revenues came in better than street estimates on Thursday. The quarter's decline wasn't nearly as bad as expected, and things are looking even better in the current period. The only problem here is that the business is very capital intensive, and the company isn't generating enough operating cash flow to cover its vehicle purchases, leading to a large and growing net debt pile.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Given the valuation seems very depressed now compared to a key industry peer, I'm upgrading the stock today from \"Sell\" to \"Neutral.\" While I don't like the overall financial situation here, some progress has been made recently, and management did paint a pretty rosy picture for the start of this year. I'm not ready yet to fully buy in, given an ever-changing mobility industry, so I'd like to see another quarter or two of major progress here.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/478766504/image_478766504.jpg",
            "link": "https://seekingalpha.com/article/4875471-hertz-making-some-progress-rating-upgrade",
            "pub_date": "2026-02-27 01:30:58",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}