{
    "data": [
        {
            "id": "4876120",
            "title": "LivaNova: Excellent Performer, But Too Expensive In 2026 (Rating Downgrade)",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2194222153/image_2194222153.jpg?io=getty-c-w630\" alt=\"Close-Up Shot of Scientists Hands typing Data in Laptop in Laboratory\" data-id=\"2194222153\" data-type=\"getty-image\" width=\"1536\" height=\"1025\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2194222153/image_2194222153.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2194222153/image_2194222153.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2194222153/image_2194222153.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2194222153/image_2194222153.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2194222153/image_2194222153.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2194222153/image_2194222153.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2194222153/image_2194222153.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2194222153/image_2194222153.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Tom Werner/DigitalVision via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>In this article, I'll provide an update on LivaNova PLC (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/LIVN\" title=\"LivaNova PLC\">LIVN</a></span>), which has been part of my portfolio since mid-2025, and has seen a superb rate of outperformance relative to the market average, or <a href=\"https://seekingalpha.com/symbol/SPY\" title=\"State Street SPDR S&amp;P 500 ETF Trust\" class=\"paywall-full-content\">SPY</a><span class=\"paywall-full-content\">.</span></p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/26/49836612-1772092834223472.png?io=w640\" alt=\"Seeking Alpha Livanova PLC Returns\" contenteditable=\"false\" width=\"216\" height=\"317\" loading=\"lazy\" srcset=\"\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha <span></span></span>LivaNova<span> PLC Returns</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Since my last article, which you can find here, we've seen LivaNova deliver these outsized returns for a few reasons. In this article, I'll be going through those reasons, I'll be providing an industry-wide overview of what the company might achieve going forward, and I'll be telling you what to look out for in terms of potential downsides and when the company might \"go south\" again. To call this company in Medtech \"safe\" or as good as some of the other ones I invest in from a fundamental perspective would be incorrect. The company is smaller, has higher debt, and doesn't have as big or as impressive a market share as other companies that I cover. This is also why my position in the business has been relatively limited so far.</p> <p class=\"paywall-full-content\">The company's rise means that we're now trading above a fair-value multiple of 15x, where our thesis is no longer based solely on valuation reversal (which I consider a key part of my approach), but more on <em>consistent earnings growth on a forward basis. </em>The fact that the company does not offer any sort of yield adds to this, as does the fact that LivaNova is at its heart a very volatile business in terms of both share price and earnings, which cannot be said in the same way for some of its competition. This means that we need to be careful with LivaNova, and consider how, if, and when to exit this investment. The biggest question for me here will be whether to lower the company to a \"HOLD\" rating.</p> <p class=\"paywall-full-content\">I raised my PT for the company to $61/share in my last article. This means, based on the current trading price of almost $71/share, that another \"BUY\" would mean that the company's share price would have to be raised considerably for this to still be the case.</p> <p class=\"paywall-full-content\">Let's see why I do not believe raising it from here to well above $71/share would be a good idea.</p> <h2 class=\"paywall-full-content\">LivaNova PLC - Upside from valuation, but future upside is more uncertain</h2> <p class=\"paywall-full-content\">LivaNova has been a very good investment. Since my first \"BUY\" article that coincided with me adding a small position, the company is up over 54% relative to the SPY's 11%, making it much, much more than a statistical aberration and a proven \"good choice\" in terms of valuation and return. It's also proof that you shouldn't ignore smaller players, and that focusing on valuation for companies, as long as the fundamentals for the companies are of a solid nature.</p> <p class=\"paywall-full-content\">LivaNova, as far as medical devices and medtech go, is relatively simple as a company. It focuses on heart-lung and nervous system solutions, specifically with <em>devices</em> and specifically for surgery, and for assistance, such as oxygenators, valves, machines, and therapy systems. Any company with any sort of market share in something like life support (during surgical procedures) is a company that is worth your attention. Furthermore, the company's work with technologies and solutions for things like sleep apnea is, in my view, likely to potentially provide growth as well. The company's size is not as big as some giants like Siemens Healthineers (<a href=\"https://seekingalpha.com/symbol/SEMHF\" title=\"Siemens Healthineers AG\">SEMHF</a>), but also not small, with a solid market cap.</p> <p class=\"paywall-full-content\">The reason for recent outperformance, meaning since about early to mid-2025, is the <em>significant sales growth reported by the company. </em>Not just the top line either - LivaNova has managed to exceed forecasts and estimates, even my own. Improved reimbursement trends have been part of it, but LivaNova's 4Q25 saw the company reaching its fifth consecutive annual report of double-digit EPS growth, with a near-double-digit EPS on top-line sales as well. This is a very strong executor that seems to have everything going for it. The company's US operations have improved through significant Medicare/Medicaid reimbursement trends, which are expected to generate further earnings growth in 2026 as well.</p> <p class=\"paywall-full-content\">If you couple this with further growth in high-margin OSA segments, there's a good reason for expecting LivaNova to continue to at least deliver earnings growth. Many analysts have increased their targets and prices as of 4Q25, and as of the latest results, which came in yesterday (February 25th), I'm on board with raising the target as well. When a company outperforms like this, some sort of adjustment is in order. My own estimate was at 6% revenue growth, and closer to 7-8% EPS growth, but I was wrong here.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720942196438577_origin.png\" rel=\"lightbox\" data-width=\"1907\" data-height=\"1066\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720942196438577_origin.png?io=w640\" alt=\"LivaNova PLC Investor Presentation 4Q25 Results\" width=\"640\" height=\"358\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720942196438577_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720942196438577_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720942196438577_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720942196438577_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>LivaNova PLC Investor Presentation 4Q25 Results</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Lower FCF does not bug me here - it's a matter of WC and CapEx. SG&amp;A declines are more important, and an increased amount of R&amp;D is never a bad thing for a company in this field (in my view). I'd focus on improved EBIT margin, lower SG&amp;A, and solid EPS coupled with quarterly revenue growth. These are all solid signals, directly correlated and connected to the most important company trends - and these trends look even better from a 2025A perspective.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720943084068377_origin.png\" rel=\"lightbox\" data-width=\"1885\" data-height=\"1049\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720943084068377_origin.png?io=w640\" alt=\"LivaNova PLC Investor Presentation 4Q25 Results\" width=\"640\" height=\"356\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720943084068377_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720943084068377_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720943084068377_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/49836612-17720943084068377_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>LivaNova PLC Investor Presentation 4Q25 Results</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The company's legacy sectors in Cardiopulmonary, or CP, continue to dominate the sales, but Neuromodulation sales, the segment that I believe could drive further growth, are going up further here. We/you want the company to grow this segment, because the segment is at substantially better margins than Cardio - we're talking a difference of over 100%, with 35.4% in Neuromodulation and less than 16% in CP. The company has delivered full-year guidance for 2026, and the guidance is good, if somewhat slower than before.</p> <p class=\"paywall-full-content\">2026E is the first year in a while where the company is now expecting mid-to-high single-digit growth in both revenue and EPS growth. Thus, it's fair to say that even the company is expecting the EPS growth to taper off a bit, including an FCF that's set to stay at, or below, the 2025A level. This should at the very least temper our expectations a bit, which is why I consider PT raises to above $80/share for the company as a result of this year's earnings to be perhaps a bit too positive.</p> <p class=\"paywall-full-content\">I believe bulls may be a bit too positive on the company's prospects here, and not focused enough on the risks inherent to the company. CP company products come with manageable and limited risk, despite some risks for infection for some of the company's devices (but this is for all such devices). However, going into the modulation of nerves, with things like VNS therapy for epilepsy and depression, opens the company up to risks for such devices. There are competition risks as well - LivaNova is far from the only company doing neuromodulation. NeuroPace and even new entrants are coming to market, and also Medtronic (<a href=\"https://seekingalpha.com/symbol/MDT\" title=\"Medtronic plc\">MDT</a>) is in this segment, with much larger \"financial muscles\". While the company's products are good, they lack an immediate market uniqueness, such as you'd find in Carl Zeiss Meditec (<a href=\"https://seekingalpha.com/symbol/CZMWY\" title=\"Carl Zeiss Meditec AG\">CZMWY</a>), with a different type of \"market dominance\".</p> <p class=\"paywall-full-content\">The risks from the $350M+ settlement are gone. From that perspective, I believe a 4-6% revenue and EPS growth should be entirely possible. The question is, is that enough for this company to continue to be valued at higher multiples?</p> <h2 class=\"paywall-full-content\">Valuation for LivaNova in 2026 - I'm upgrading my PT, but only to $68/share.</h2> <p class=\"paywall-full-content\">So, let me clarify what I'm seeing here. LivaNova is likely to grow, but it's unlikely to grow as quickly as before. Remember, the company \"crashed\" back in 2019-2020 due to significant revenue decline, declining sales in legacy, and abandonment of a key program it was driving for. We know, therefore, that EPS volatility is very much part of this company's M.O. To expect this company to drive on and on for the next few years is possible, but it would be bullish.</p> <p class=\"paywall-full-content\">The company also has a rather unfortunate tendency to trade at excesses at times - without really any earnings-related reasons to do so. Look at the trends in share price relative to earnings for these two times below - there's very little logic here.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/49836612-17721136849489827_origin.png\" rel=\"lightbox\" data-width=\"1405\" data-height=\"883\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/49836612-17721136849489827_origin.png?io=w640\" alt=\"F.A.S.T graphs LivaNova PLC Valuation\" width=\"640\" height=\"402\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/49836612-17721136849489827_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/49836612-17721136849489827_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/49836612-17721136849489827_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/49836612-17721136849489827_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span></span>F.A.S.T Graphs<span> LivaNova PLC Valuation</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">We also know this company can significantly fail to hit growth targets. That was also part of the reason for the development. You can see that if you invested close to the peak, thanks to the zero dividend, there's a high likelihood of you being in the negative here. Valuation, as I keep jamming on, matters. It matters a lot.</p> <p class=\"paywall-full-content\">Because I bought when the company was cheap, I'm up over 48%. The question now is what we expect from here.</p> <p class=\"paywall-full-content\">For me, I say the 9-10% EPS estimates are too bullish. I cut those to 5-6%, citing the company's own expectations for the next year (\"mid-range single digit\"). While the company could see an upside from things like neuromodulation growth, there's a lot of competition and a lot of uncertainty here. Take, for instance, reimbursement rates from Medicare/Medicaid. What would happen if these were to drop again? It would, for sure, lead to lower adoption from hospitals, lower top-line growth, and the like. For the time being, the trend (in 2026), is <em>positive</em>, but I am saying that this can change. I'm citing US federal budget cuts, inflation, <a href=\"https://www.medicarerights.org/medicare-watch/2025/10/02/states-already-cutting-medicaid-massive-federal-cuts-yet-to-come#:~:text=The%20budget%20reconciliation%20bill%2C%20HR,downturns%20without%20cutting%20major%20programs.\" rel=\"nofollow\">and payment models that some say aren't working.</a></p> <p class=\"paywall-full-content\">So any company, like LivaNova, that depends on this, is potentially in danger.</p> <p class=\"paywall-full-content\">In terms of valuation, I now believe the company should, at most, trade at 20x P/E. This expectation represents <em>slower growth than the market expectation. </em>I'm cutting the average 10%+ growth from legacy and neuromodulation to 5-7%, which I believe will cause a bit of a premium compression to 19-20x P/E. I also forecast that the company's high-growth ambitions in OSA and DTD (the new segments) will not show the results the company expects. Recent trends confirm this, <a href=\"https://sleep-doctor.com/blog/imthera-livanova-aura6000-thn3-randomized-trial-outcomes/\" rel=\"nofollow\">with clinical trials being so-so, not even good enough for FDA approval.</a></p> <p class=\"paywall-full-content\">I further forecast slower earnings growth from margin compression and more R&amp;D costs, especially following the clinical trial pressures. Based on this, I work with a 19-20x P/E on 5-8% growth, coming to a fair value of about $87/share, and a PT for at most $68/share due to the lack of a yield. The current upside to 19x only shows 9-10% annualized growth with my estimates, and that is not good enough for me.</p> <p class=\"paywall-full-content\">Risks are now as follows.</p> <h2 class=\"paywall-full-content\">Risks &amp; Considerations</h2> <p class=\"paywall-full-content\">The risk seen by most people, the litigation, is already included and, as of 4Q25, gone. The $360M was included for the full year, and much as I expected, did not derail the company.</p> <p class=\"paywall-full-content\">The bigger risks I see are the slowing growth rates of the neuromodulation segment, which the company, as of 4Q25, is confirming for the forecast of 2026, and the potential, or lack of it, that the new treatment areas/new technology are introducing here.</p> <p class=\"paywall-full-content\">A lack of realized growth in these areas could, and would, result in lower EPS growth, which could normalize the premium, and this is what I believe is likely to happen going forward. I'm allowing a slightly higher FV and PT due to outperformance, but the chance of further upside is, in my view, limited.</p> <h2 class=\"paywall-full-content\">Thesis</h2> <p class=\"paywall-full-content\">LivaNova is a solid company in key diagnostic and treatment segments. The company has decent fundamentals, excellent market-leading positions, and is posting growth, with the disadvantages of a lack of dividends and some growth uncertainties going forward. Otherwise, risks are limited to high-level environmental litigation, which I believe the market is overestimating, and historical volatility in earnings.</p> <p class=\"paywall-full-content\">I discount for the volatility in earnings by lowering the company, and using a conservative forecast. My fair value target is over 25% discounted at $87/share in terms of the 20-year average, and a PT of $68/share, upgraded for 4Q25 going into 2026. I am therefore lowering my rating for the company to a \"HOLD\".</p> <p class=\"paywall-full-content\">Here are my criteria and how the company fulfills them.</p> <ul class=\"paywall-full-content\"> <li><em>This company is overall qualitative.</em></li> <li><em>This company is fundamentally safe/conservative &amp; well-run.</em></li> <li>This company pays a well-covered dividend.</li> <li>This company is currently cheap.</li> <li>This company has a realistic upside that is high enough, based on earnings growth or multiple expansion/reversion.</li> </ul> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">The company fulfills 2 out of 3 quality indicators, and 0 out of 2 valuation indicators. That means 3/5 \"stars\" here, which typically isn't enough. Based on this, and a valuation target of $68/share, I see a risk/reward-adjusted upside that's attractive enough for me. I give the company a \"Hold\" rating as of February 2026.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2194222153/image_2194222153.jpg",
            "link": "https://seekingalpha.com/article/4876120-livanova-excellent-performer-too-expensive-in-2026-rating-downgrade",
            "pub_date": "2026-02-27 17:56:03",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876108",
            "title": "Nvidia's Blowout And Retail's Resilience In The Last Big Week For Q4 Earnings",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1388717173/image_1388717173.jpg?io=getty-c-w630\" alt=\"Trolley filled with groceries in wholesale store Landscape\" data-id=\"1388717173\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1388717173/image_1388717173.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1388717173/image_1388717173.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1388717173/image_1388717173.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1388717173/image_1388717173.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1388717173/image_1388717173.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1388717173/image_1388717173.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1388717173/image_1388717173.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1388717173/image_1388717173.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Smile/DigitalVision via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Trade Risk Returns Just as Retailers Begin to Report</h2> <p>With over 90% of S&amp;P 500 earnings reported, the season wraps up next week with a final trickle of retail names. Overall, it was a great season for these large-cap<span class=\"paywall-full-content\"> names, with EPS growth topping 13%, the fifth consecutive quarter of double-digit growth, and revenue growth of 9%.</span><sup class=\"paywall-full-content\">1</sup><span class=\"paywall-full-content\"> Will those types of growth numbers continue in 2026, especially now that trade risk seems to be back on the table?</span></p> <p class=\"paywall-full-content\">After the Supreme Court struck down President Trump’s 10% global tariff on February 20, he bypassed the ruling by invoking Section 122 of the 1974 Trade Act to impose a statutory maximum 15% surcharge.<sup>2</sup> This \"balance-of-payments\" authority is limited to 150 days, forcing a high-stakes legislative showdown by July 2026 to determine if the tariffs become permanent.</p> <p class=\"paywall-full-content\">Tariff turmoil already started to hit the last batch of earnings reports. On Tuesday, Home Depot (<a href=\"https://seekingalpha.com/symbol/HD\" title=\"The Home Depot, Inc.\">HD</a>) said they were still analyzing the impacts of the new Section 122 proclamation. While the home improvement retailer has high domestic sourcing for items such as lumber, CEO Ted Decker noted that the 15% global surcharge on imported hardware and tools will likely lead to \"necessary price adjustments\" if the tariffs remain in place for the full 150-day window allowed by the Act.<sup>3</sup></p> <p class=\"paywall-full-content\"><a href=\"https://seekingalpha.com/symbol/TJX\" title=\"The TJX Companies, Inc.\">TJX</a> reported a strong double-beat yesterday, posting adjusted earnings of $1.43 per share on $17.7 billion in revenue, comfortably ahead of Wall Street's expectations. CEO Ernie Herrman highlighted a \"strong start\" to 2026, noting that the U.S. consumer remains resilient and attracted to the \"treasure hunt\" value model as consolidated comparable sales rose 5%. Regarding recent trade volatility, CFO John Klinger stated that the company's full-year guidance assumes they can largely offset tariff pressures through their flexible sourcing and merchandise margins. Despite the beat, the stock experienced a slight \"sell the news\" reaction, trading down about 0.3% in early action as investors weighed a conservative FY2027 guidance that came in just below consensus estimates. That stock has since popped up by nearly 1.5% today.<sup>4</sup></p> <h2 class=\"paywall-full-content\">Incoming Tailwind for Retailers - A $100B Tax Windfall</h2> <p class=\"paywall-full-content\">Retailers are also poised to benefit from an upcoming tax refund windfall which will likely fall in the $100-150B range this year. Consumers typically use these lump-sum refunds to pay off credit card debt from holiday spending, or make large-ticket purchases such as appliances or autos.</p> <p class=\"paywall-full-content\">While not referred to by companies themselves, analysts believe there will be several retail winners from these refunds. Off-price retailers such as TJX should capture the \"No Tax on Overtime\" demographic, workers who now have retroactive savings and are using them for wardrobe refreshes and home goods.<sup>5</sup> Analysts also believe Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) will be a refund winner.<sup>6</sup></p> <p class=\"paywall-full-content\">The IRS filing season began on January 26, and the first two weeks of data are in. So far, that data shows that as of February 13, the average refund payment is up 14.2% YoY. This is a win for American households and will likely lead to a boost in spending for the first half of 2026.<sup>7</sup></p> <h2 class=\"paywall-full-content\">Blowout Beat, Tempered Reaction: The World's Most Valuable Company Reports</h2> <p class=\"paywall-full-content\">Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>) delivered another blowout performance for their fiscal Q4 2026, reporting $68.1B in revenue (up 73% YoY) and an adjusted EPS of $1.62 (up 82% YoY), comfortably beating Wall Street expectations. The surge was powered by record Data Center sales as the Blackwell chip ramped up and demand for Agentic AI infrastructure reached a fever pitch. Despite zero revenue from China due to export restrictions, the company’s guidance for next quarter came in at a massive $78B, signaling that the AI build-out is nowhere near its peak.</p> <p class=\"paywall-full-content\">The market initially responded with enthusiasm, sending shares up roughly 3.5% as investors cheered the strong margins (75%) and the growth of sovereign AI revenue from national governments. Analysts have since shifted price targets higher, viewing Nvidia not just as a chipmaker but as the essential backbone of the global AI economy. While the stock has moderated slightly after the initial jump (down nearly 5% at the time of this publication), it continues to trade near all-time highs, as supply for their next-generation architectures remains the only real bottleneck. Also, as close NVDA watchers know well, the stock often runs into the report and slumps afterwards, despite typically beating estimates.</p> <h2 class=\"paywall-full-content\">US CEOs Appear Confident, For Now</h2> <p class=\"paywall-full-content\">The <a href=\"https://www.wallstreethorizon.com/late-earnings-report-index\" rel=\"noopener\">Late Earnings Report Index</a>, our proprietary measure of CEO uncertainty, posted its lowest post-peak number ever since we began collecting this data five years ago.</p> <p class=\"paywall-full-content\">The LERI tracks outlier earnings date changes among publicly traded companies with market capitalizations of $250M and higher. The LERI has a baseline reading of 100, and anything above that indicates that companies are feeling uncertain about their current and short-term prospects. A LERI reading under 100 suggests that companies feel they have a pretty good handle on the near term.</p> <p class=\"paywall-full-content\">The official post-peak season LERI reading for Q4 (data collected in Q1) stands at 51, well below the baseline reading, suggesting companies are feeling more certain about economic conditions than they were for the last three quarters. As of February 26, there were 106 late outliers and 186 early outliers.</p> <p class=\"paywall-full-content\">In mid-April, we will get numbers for the pre-peak LERI for the Q1 2026 reporting season. With uncertainties now swirling around everything from trade policy to AI it will be interesting to see how corporations react.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHLERI.png?io=w640\" alt=\"Wall Street Horizon Late Earnings Report Index, calculated at last peak week of earnings\" contenteditable=\"false\" width=\"763\" height=\"478\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHLERI.png?io=w750 750w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHLERI.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHLERI.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHLERI.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHLERI.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Source: Wall Street Horizon</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Q4 2025 Earnings Wave</h2> <p class=\"paywall-full-content\">In what is more or less the final big week of the Q4 earnings season, 1,068 companies are expected to release results (out of our universe of 11,000+ global names). Thus far, 61% of companies have reported.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHES.png?io=w640\" alt=\"Q4 2025 North America and worldwide earnings season announcement dates from a universe of 11,000 global equities\" contenteditable=\"false\" width=\"821\" height=\"497\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHES.png?io=w750 750w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHES.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHES.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHES.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_260226WSHES.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Source: Wall Street Horizon</span></p></figcaption></figure></p> <hr class=\"paywall-full-content\"> <p class=\"paywall-full-content\"><sup>1</sup> <a href=\"https://advantage.factset.com/hubfs/Website/Resources%20Section/Research%20Desk/Earnings%20Insight/EarningsInsight_021326.pdf\" rel=\"nofollow\">FactSet Earnings Insight</a>, John Butters, February 13, 2026<br><sup>2</sup> “<a href=\"https://www.whitehouse.gov/fact-sheets/2026/02/fact-sheet-president-donald-j-trump-imposes-a-temporary-import-duty-to-address-fundamental-international-payment-problems/\" rel=\"noopener noopener noopener\">Fact Sheet: President Donald J. Trump Imposes a Temporary Import Duty to Address Fundamental International Payment Problems</a>,” The White House, February 20, 2026<br><sup>3</sup> <a href=\"https://ir.homedepot.com/news-releases/2026/02-24-2026-110040985\" rel=\"noopener\">The Home Depot Announces Fourth Quarter and Fiscal 2025 Results; Increases Quarterly Dividend by 1.3%;Provides Fiscal 2026 Guidance</a>, The Home Depot, February 24, 2026<br><sup>4</sup> <a href=\"https://investor.tjx.com/news-releases/news-release-details/tjx-companies-inc-reports-q4-and-full-year-fy26-results-q4-comp\" rel=\"nofollow\">The TJX Companies, Inc. Reports Q4 and Full Year FY26 Results</a>, February 25, 2026<br><sup>5</sup> “<a href=\"https://www.barrons.com/articles/tax-refunds-consumer-spending-retailers-4f09cf1d?gaa_at=eafs&amp;gaa_n=AWEtsqcDRGQ2_bl9e2iX4XPi_8CQhRslJBEHzrWefX6p0esIKNk_2L8vZu6E1YBVWR4%3D&amp;gaa_ts=69a08223&amp;gaa_sig=jKVSjioVTAi-O_WZ6fka2L-_-4fn4ff0b4Ef55rTAeqKix_UD8yMtQVvt--UEiBzEz3eQqq8BgAO9qlrU3bX8A%3D%3D\" rel=\"nofollow\">Bigger Tax Refunds Are Coming. Which Retailers Gain the Most.</a>” Barron’s, Sabrina Escobar, January 24, 2026<br><sup>6</sup> “<a href=\"https://markets.financialcontent.com/stocks/article/marketminute-2026-2-24-the-obbba-refund-ripple-how-a-retroactive-tax-windfall-is-fueling-a-2026-consumer-surge\" rel=\"nofollow\">The OBBBA 'Refund Ripple': How a Retroactive Tax Windfall is Fueling a 2026 Consumer Surge</a>,” Market Minute, February 24, 2026<br><sup>7</sup> <a href=\"https://www.irs.gov/newsroom/filing-season-statistics-for-week-ending-feb-13-2026\" rel=\"nofollow\">Filing season statistics for week ending Feb. 13, 2026</a>, IRS</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\"><a href=\"https://www.wallstreethorizon.com/blog/Nvidias-Blowout-and-Retails-Resilience-in-the-Last-Big-Week-for-Q4-Earnings\" rel=\"nofollow\"><em>Original Post</em></a></p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1388717173/image_1388717173.jpg",
            "link": "https://seekingalpha.com/article/4876108-nvidia-blowout-retail-resilience-in-last-big-week-for-q4-earnings",
            "pub_date": "2026-02-27 17:31:09",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876112",
            "title": "Salesforce Q4 Results: Share Buybacks As Investor Worries Continue",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2242210690/image_2242210690.jpg?io=getty-c-w630\" alt=\"salesforce\" data-id=\"2242210690\" data-type=\"getty-image\" width=\"1536\" height=\"1305\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2242210690/image_2242210690.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2242210690/image_2242210690.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2242210690/image_2242210690.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2242210690/image_2242210690.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2242210690/image_2242210690.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2242210690/image_2242210690.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2242210690/image_2242210690.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2242210690/image_2242210690.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Software company, Salesforce (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CRM\" title=\"Salesforce, Inc.\">CRM</a></span>), traded lower immediately following its after-hours release of Q4 results. Driving the sentiment was a combination of a weaker-than-expected forward outlook and continuing <a href=\"https://seekingalpha.com/news/4555473-wall-street-dragged-down-by-ai-disruption-fears-tariff-uncertainty\">investor skepticism</a> of the relevancy of software companies<span class=\"paywall-full-content\"> like CRM in the age of AI.</span></p> <p class=\"paywall-full-content\">Heading into the release, the stock was already down nearly 40% over the last year, including a nearly 30% decline YTD. For many, this created an attractive opportunity to add to existing positioning or to initiate a new stake. At current valuations, the stock is priced appropriately for the strategic positioning, in my view.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004182172_origin.png\" rel=\"lightbox\" data-width=\"875\" data-height=\"325\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004182172_origin.png?io=w640\" alt=\"Seeking Alpha - 1-YR Share Price Performance Of CRM Stock\" contenteditable=\"false\" width=\"640\" height=\"238\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004182172_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004182172_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004182172_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004182172_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha - 1-YR Share Price Performance Of CRM Stock</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">While I am not 100% bullish on the stock, I lean to the bullish spectrum, despite my overall neutral outlook on shares. I believe shares in CRM will see recovery, but it could take some time to fully materialize, in my view.</p> <h2 class=\"paywall-full-content\">CRM Stock Key Metrics</h2> <p class=\"paywall-full-content\">I believe that CRM trades at an <a href=\"https://seekingalpha.com/symbol/CRM/valuation/metrics\">attractive multiple</a> today to justify new or additional positioning into the stock. Shares currently command a forward trading multiple of about 14.6x earnings. This is below both historical averages and the broader S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"State Street SPDR S&amp;P 500 ETF Trust\">SPY</a>).</p> <p class=\"paywall-full-content\">CRM, however, is still graded negatively on valuation by Seeking Alpha’s (“SA”) <a href=\"https://seekingalpha.com/symbol/CRM/ratings/quant-ratings\">quant scores</a>. This is mostly due to the weaker sales growth relative to its current price. The revenue growth is also a factor on ancillary metrics within the quants, and this offsets the positive marks on profitability.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004330876_origin.png\" rel=\"lightbox\" data-width=\"852\" data-height=\"425\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004330876_origin.png?io=w640\" alt=\"Seeking Alpha - Valuation Metrics Of CRM Stock\" contenteditable=\"false\" width=\"640\" height=\"319\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004330876_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004330876_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004330876_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070004330876_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha - Valuation Metrics Of CRM Stock</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Both the SA analyst community and Wall Street, however, are bullish, most of which are strongly so. Most coverage on SA has been bullish, so my neutral outlook is a bit of an outlier. Again, though I’m neutral overall, I do have a bullish lean.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721072793359642_origin.png\" rel=\"lightbox\" data-width=\"862\" data-height=\"253\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721072793359642_origin.png?io=w640\" alt=\"Seeking Alpha - 3-YR SA Analyst Rating History Of CRM Stock\" contenteditable=\"false\" width=\"640\" height=\"188\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721072793359642_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721072793359642_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721072793359642_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721072793359642_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha - 3-YR SA Analyst Rating History Of CRM Stock</span></p></figcaption></figure></p> <p class=\"paywall-full-content\"><a href=\"https://seekingalpha.com/symbol/CRM/ratings/sell-side-ratings\">Wall Street’s bullishness</a> is worth a highlight, in my view. Of the 57 analysts covering the stock over the last 90 days, for example, about 65% of the population have rated the stock as a ‘strong buy.’ Furthermore, this has been accompanied by a price target of about $300/share, representing nearly 60% upside potential from current trading levels.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070003817658_origin.png\" rel=\"lightbox\" data-width=\"845\" data-height=\"285\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070003817658_origin.png?io=w640\" alt=\"Seeking Alpha - Average Price Target Of CRM Stock\" contenteditable=\"false\" width=\"640\" height=\"216\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070003817658_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070003817658_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070003817658_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/49921492-17721070003817658_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha - Average Price Target Of CRM Stock</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Can it reach this target? Likely, but it may take a bit, and during that time, investors may find it possible to achieve an even better entry point than today’s prices.</p> <h2 class=\"paywall-full-content\">CRM Q4 Results Recap</h2> <p class=\"paywall-full-content\">I believe CRM put forth a <a href=\"https://seekingalpha.com/pr/20414070-salesforce-delivers-record-fourth-quarter-fiscal-2026-results#hasComeFromMpArticle=false\">strong Q4</a>, even if it wasn’t necessarily rewarded, at least immediately upon the release.</p> <p class=\"paywall-full-content\">Topline revenues during the quarter were up 12% YOY or 10% in constant currency terms, while full-year revenue was also up double digits at 10%. I view this as durable, double-digit expansion at scale that can likely continue into CRM’s new fiscal year.</p> <p class=\"paywall-full-content\">The forward indicators were also solid. Current remaining performance obligations (cRPO) rose 16% YOY, and total RPO climbed 14%. That backlog provides visibility and reinforces that demand hasn’t fallen off a cliff despite broader software concerns.</p> <p class=\"paywall-full-content\">For all the fears of AI and its impact on the business models of software companies, AI was ironically the centerpiece of CRM’s results. Agentforce has quickly become meaningful, now tracking as an +~$800M business, with 29K deals closed in its first 15 months. In addition, deals over +$1M rose 26% YOY, and deals over +$10M jumped 33%.</p> <p class=\"paywall-full-content\">CEO Marc Benioff <a href=\"https://seekingalpha.com/news/4557058-salesforce-slips-as-earnings-outlook-lands-just-below-estimates-benioff-projects-63b-revenue-by-fy30\">also highlighted</a> +$2.9B in Agentforce and Data 360 ARR, up 200% YOY. In my view, this is evidence that customers are adopting AI within the Salesforce ecosystem rather than showing any indication that it will be replaced.</p> <p class=\"paywall-full-content\">Lastly, and most significantly from my lens, is that the company authorized a massive +$50B buyback program. This signals confidence in long-term value and taking advantage of what the management team views as depressed share prices.</p> <h2 class=\"paywall-full-content\">What Is The Outlook For CRM Stock?</h2> <p class=\"paywall-full-content\"><a href=\"https://seekingalpha.com/article/4874911-salesforce-inc-crm-q4-2026-earnings-call-transcript\">The outlook</a> is where the debate begins.</p> <p class=\"paywall-full-content\">CRM guided full-year revenue to a range of +$45.8B to +$46.2B, which at the midpoint implies roughly 10% growth. This is essentially in line with the 10% growth delivered this past fiscal year. That’s steady, but it’s not accelerating. Notably, Wall Street was looking for +$46.11B, so while the guidance wasn’t disastrous, it wasn’t inspiring either.</p> <p class=\"paywall-full-content\">On the earnings front, which remains the rosier front for CRM, adjusted EPS guidance of $13.11 to $13.19/share brackets consensus of $13.15, suggesting continued margin strength. It’s also worth noting that the current quarter guidance actually came in slightly <a href=\"https://seekingalpha.com/news/4557100-salesforce-non-gaap-eps-of-3_81-beats-by-0_76-revenue-of-11_2b-in-line\">ahead of expectations</a> on both revenue and EPS.</p> <p class=\"paywall-full-content\">The grey area, in my view, remains AI velocity. While Agentforce reached an +$800M run rate and continues scaling quickly, some investors question whether adoption is happening fast enough to offset broader software disruption fears.</p> <p class=\"paywall-full-content\">Obviously, management clearly disagrees and is leaning in aggressively, both strategically and financially, via the new +$50B buyback.</p> <h2 class=\"paywall-full-content\">Is CRM Stock A Buy, Sell, Or Hold?</h2> <p class=\"paywall-full-content\">For me, shares in CRM are a ‘hold,’ and an intriguing one.</p> <p class=\"paywall-full-content\">As I’ve written in <a href=\"https://seekingalpha.com/article/4872387-workday-oversold-with-material-upside-potential\">other bullish pieces</a>, I don’t view the software business model as broken. And with regards to CRM, specifically, growth is steady at 10%, margins are expanding, backlog remains healthy, and AI monetization is clearly real.</p> <p class=\"paywall-full-content\">In addition, Agentforce is scaling quickly, large deal momentum is strong, and the +$50B buyback sends a very loud signal that management believes shares are undervalued, in my view. Those are not characteristics of a company in structural decline.</p> <p class=\"paywall-full-content\">That said, this is also not a clear-cut reacceleration story, at least not yet. Guidance was fine, but not exciting. While it’s true AI adoption is ramping up, investors seem to want proof that it can meaningfully reaccelerate top-line growth, not just protect it. And until we see clearer evidence of that inflection, I believe that multiple expansion may remain limited.</p> <p class=\"paywall-full-content\">At roughly 14–15x forward non-GAAP earnings, the valuation is far more reasonable than it has been in years. I lean bullish because I believe CRM ultimately emerges stronger in an AI-enabled software landscape.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">However, I believe investors could be rewarded by keeping the stock on the watchlist and waiting for an even better entry point. For now, I’m neutral with a bullish tilt. I’m watching closely, and willing to get more aggressive if the growth narrative strengthens.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2242210690/image_2242210690.jpg",
            "link": "https://seekingalpha.com/article/4876112-salesforce-q4-results-share-buybacks-as-investor-worries-continue",
            "pub_date": "2026-02-27 17:21:00",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876105",
            "title": "Trinity Capital: NAV Growth Continues In Q4",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222223206/image_2222223206.jpg?io=getty-c-w630\" alt=\"Composite trendy magazine photo collage of happy businesswoman show like reaction chart success statistics development cash income\" data-id=\"2222223206\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222223206/image_2222223206.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222223206/image_2222223206.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222223206/image_2222223206.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222223206/image_2222223206.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222223206/image_2222223206.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222223206/image_2222223206.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222223206/image_2222223206.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222223206/image_2222223206.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Deagreez/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Overview</h2> <p>Business Development Companies continue to face headwinds over the last few quarters and many high quality choices have struggled to grow earnings. However, Trinity Capital (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TRIN\" title=\"Trinity Capital Inc.\">TRIN</a></span>) has revealed itself to be the exception<span class=\"paywall-full-content\"> amongst the BDC landscape. TRIN has just reported its Q4 earnings, and I wanted to revisit this BDC to provide some updated insights into its performance and outlook for 2026. While TRIN still faces some similar headwinds as peers, the portfolio strategy has proven to be effective at producing consistent cash flows, supporting dividends, and preserving investor capital. When I previously covered TRIN, I issued a </span><a href=\"https://seekingalpha.com/article/4822545-trinity-capital-high-quality-bdc-but-waiting-for-a-pullback-rating-downgrade\" class=\"paywall-full-content\">hold rating</a><span class=\"paywall-full-content\"> due to the valuation at the time.</span></p> <p class=\"paywall-full-content\">Looking at the performance over the last twelve months, we can see that TRIN's share price has declined by about 3.5%. Despite this decline, I think it's fair to call out that many BDC peers in the sector have seen their share price rapidly erode over the last quarter. Therefore, TRIN remains one of the more resilient choices in the sector. When including all distributions that were paid out to shareholders, the total return jumps up to 10.3% over the same time frame. TRIN now offers investors a starting dividend yield of 13.5%, while now issuing payouts on a monthly basis!</p> <p class=\"paywall-full-content\"><figure class=\"sa-widget sa-ycharts paywall-full-content\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/saupload_6440492439b67ad7c8e87059756a2ff9.png?io=w640\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/saupload_6440492439b67ad7c8e87059756a2ff9.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/saupload_6440492439b67ad7c8e87059756a2ff9.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/saupload_6440492439b67ad7c8e87059756a2ff9.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"><figcaption>Data by YCharts</figcaption></figure></p> <p class=\"paywall-full-content\">The latest earnings report indicates that net investment income still supports the distributions, but there is certainly some room for improvement. One of the most notable achievements over the last quarter is that TRIN was able to provide some meaningful NAV growth over the last quarter, which indicates that the portfolio continues to generate sufficient income through these challenging market conditions. However, valuation remains tricky because these strengths have caused the BDC to trade at the higher end of its price-to-NAV range. So let's start by taking a look at the portfolio strategy and the highlights of its most recent earnings.</p> <h2 class=\"paywall-full-content\">Q4 Earnings</h2> <p class=\"paywall-full-content\">According to the most recent <a href=\"https://ir.trinitycapital.com/static-files/bd413a14-cf69-4e77-add9-730dccaf9735\" rel=\"nofollow\">portfolio breakdown</a>, TRIN has total investments at a fair value of $2.4B that are spread across a diverse range of debt securities. Unlike traditional equities, TRIN doesn't rely on the earnings growth of its investments. This is what makes TRIN a great hedge against the uncertainty of the market indices. Instead, TRIN invests in a portfolio of middle-market companies and relies on a borrower's ability to keep up with their required debt maintenance. TRIN's structure is most heavily reliant on loans since they make up most of its investments, but there is some exposure to other income streams. The breakdown by investment type is as follows:</p> <ul class=\"paywall-full-content\"> <li>Loans: 77.1%</li> <li>Equipment Financings: 13.9%</li> <li>Equity &amp; Warrants: 9%</li> </ul> <p class=\"paywall-full-content\">Expanding on this diversity, the portfolio of investments also spans across different industries. As we can see below, TRIN is most heavily allocated to finance and insurance investments at 15.1% of assets. This is followed by an allocation to medical devices and SaaS investments, which accounts for 10% and 9.2% of assets, respectively. With the selloff of SaaS companies, TRIN has remained resilient since it makes up only a fraction of its portfolio. This is the strength of TRIN's diversity. However, there is a sizeable allocation to different sub-sectors of technology, including AI &amp; automation and green technology investments. If the entire tech industry experiences an extended downturn, this could be a source of risk at some point.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720448830958035_origin.png\" rel=\"lightbox\" data-width=\"957\" data-height=\"311\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720448830958035_origin.png?io=w640\" alt=\"TRIN portfolio breakdown by industry\" contenteditable=\"false\" width=\"640\" height=\"208\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720448830958035_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720448830958035_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720448830958035_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720448830958035_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>TRIN Presentation</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">TRIN recently reported its <a href=\"https://seekingalpha.com/news/4556642-trinity-capital-nii-of-052-in-line\">Q4 earnings</a>, and I believe the results were solid. Most notably, net investment income amounted to $0.52 per share, which represents a decline from the prior year's net investment income of $0.58 per share. Interestingly, TRIN saw a rise in its interest and dividend income over the quarter, but the operating expenses substantially increased. Total interest income and dividend income amounted to $77.5M, which was an increase from the prior year's total interest and dividend income of $66.3M. The higher interest income is a clear indication that TRIN's new investments have continued to materialize and are now producing a higher level of income within the portfolio.</p> <p class=\"paywall-full-content\">However, total operating expenses landed at $43.6M for the quarter. This increase was primarily driven by an uptick in the interest expenses and other debt financing costs, which now total $23.8M. This was an increase from the prior year's interest expenses of $19M. There was also a slight increase in compensation benefits being paid out, which now totaled $14.8M.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720520807128232_origin.png\" rel=\"lightbox\" data-width=\"1882\" data-height=\"685\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720520807128232_origin.png?io=w640\" alt=\"TRIN financial highlights\" contenteditable=\"false\" width=\"640\" height=\"233\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720520807128232_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720520807128232_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720520807128232_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720520807128232_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>TRIN Presentation</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">One of the weaker aspects of the earnings report was the fact that TRIN faced net realized losses of $33.9M on its investments. However, this doesn't necessarily mean that positions are struggling to grow in value. These losses were attributed to the conversion of two debt positions, which is just the result of some rotations implemented within its portfolio. This was essentially offset by $33.4M in unrealized appreciation from investments during the quarter.</p> <p class=\"paywall-full-content\">From a balance sheet perspective, there is still some room for improvement. For instance, total cash and equivalents now amounts to $19.1M. While this is an increase from the prior year's balance of $9.6M, this is offset by a rise in liabilities. During the quarter, TRIN added another $198M in secured notes, while the credit facility rose to $373.9M. The shifts over the quarter ultimately led to total liabilities rising to $1.39B, up from $951M from the prior year. As long as this debt eventually leads to higher income, it may not be such an issue at this time.</p> <h2 class=\"paywall-full-content\">Valuation &amp; Risk Profile</h2> <p class=\"paywall-full-content\">At the time of my last coverage, TRIN traded at a premium to NAV of 21.4%. Following the latest pullback in its share price, TRIN now trades at a slightly smaller <a href=\"https://cefdata.com/funds/trin/\" rel=\"nofollow\">discount to NAV</a> of 12.09%. For reference, TRIN has traded at an average premium to NAV of 7.72% over the last five years. Referring to the red line on the graph below, we can see how TRIN trades at a much higher premium to NAV than peers. However, the valuation can be a bit tricky because a BDC's price to NAV level is usually a direct reflection of the sentiment. If a BDC is perceived as high quality by the market, it can trade at a massive premium to NAV and this makes it difficult to get in at an attractive level.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720450044558651_origin.png\" rel=\"lightbox\" data-width=\"1092\" data-height=\"651\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720450044558651_origin.png?io=w640\" alt=\"TRIN premium to NAV valuation\" contenteditable=\"false\" width=\"640\" height=\"382\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720450044558651_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720450044558651_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720450044558651_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720450044558651_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>CEF Data</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Despite the decline in its premium to NAV valuation, I think a highlight from the quarter was the rate of capital allocated to new investments. As management is able to allocate capital towards new investments, TRIN's base assets will continue to rise, and the earnings may increase as these new investments begin to materialize throughout the course of the year. During the quarter, TRIN was able to originate <a href=\"https://ir.trinitycapital.com/news-releases/news-release-details/trinity-capital-reports-fourth-quarter-and-full-year-2025\" rel=\"nofollow\">$543.1M</a> in total new commitments, including $170.7M allocated to five new portfolio companies, with another $264M allocated to twenty-five existing portfolio companies.</p> <p class=\"paywall-full-content\">These new investments were offset by exits and repayments of $218.8M during the quarter. Overall, TRIN experienced a positive net increase of $192.1M in portfolio activity for the quarter, ultimately contributing to the positive NAV growth. TRIN's positive NAV growth is a clear indication of the efficiency of the portfolio. TRIN has been able to consistently increase its NAV since Q1. For reference, here are the quarter-end NAV amounts over the last year:</p> <ul class=\"paywall-full-content\"> <li>Q4 2024: $13.35 per share</li> <li>Q1 2025: $13.05 per share</li> <li>Q2 2025: $13.27 per share</li> <li>Q3 2025: $13.31 per share</li> <li>Q4 2025: $13.42 per share</li> </ul> <p class=\"paywall-full-content\">Despite the NAV growth, there are still some risks that should be considered. These risks are mostly from a macro perspective and will be driven by the direction of interest rates. If we remain in a higher for longer environment, there's always a chance that non-accruals can increase. Thankfully, non-accruals remain relatively low, now totaling 0.7% of fair portfolio value. This represents a slight decline from the non-accruals totaling 0.9% of fair portfolio value at the time of my last coverage.</p> <p class=\"paywall-full-content\">So therefore, I don't believe TRIN presents any glaring red flags that investors should remain cautious of. Instead, the issues may arise as a result of unfavorable market conditions. If you want exposure to the BDC market, I would actually consider TRIN to be one of the lowest risk opportunities in the market right now. Just as a point of reference, we can see how TRIN is now one of the best performing BDCs over the last year. While the rest of the sector suffers from rising non-accruals, lower earnings, shrinking dividend coverage, and difficulty investing into new opportunities, TRIN has been able to differentiate itself through a strong portfolio strategy and efficient capital allocation.</p> <p class=\"paywall-full-content\"><figure class=\"sa-widget sa-ycharts paywall-full-content\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/saupload_233f28aa315a4dca3d7db54ff4865c07.png?io=w640\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/saupload_233f28aa315a4dca3d7db54ff4865c07.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/saupload_233f28aa315a4dca3d7db54ff4865c07.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/saupload_233f28aa315a4dca3d7db54ff4865c07.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"><figcaption>Data by YCharts</figcaption></figure></p> <p class=\"paywall-full-content\">Despite the tricky valuation, I believe that these are clear signs that it is a great time to accumulate. When interest rates eventually do decline, this will improve the operating spread for TRIN between the cost of its leverage and yield collected from portfolio companies. A healthier cost of debt would also provide some relief for existing portfolio companies, which may lead to higher valuations and lead to net realized gains.</p> <h2 class=\"paywall-full-content\">Thin Dividend Coverage</h2> <p class=\"paywall-full-content\">As of the latest <a href=\"https://seekingalpha.com/symbol/TRIN/dividends/history\">declared</a> monthly distribution of $0.17 per share, the current dividend yield sits around 13.5%. It should be noted that TRIN has recently converted its payout frequency to a monthly basis, which is great for investors that depend on the income generated within their portfolio! If we take this new monthly distribution and multiply it by three months, we get an estimated quarterly payout of $0.51 per share. As previously mentioned, net investment income amounted to $0.52 per share for the quarter. While the distribution is still supported by earnings, the base coverage is quite thin at this time.</p> <p class=\"paywall-full-content\">There is no indication of any spillover income available either, so a scenario where non-accrual rises may threaten the sustainability of payouts. As we've seen over the last quarter, sentiment can change quite rapidly, so I would love to see net investment income stay above the $0.55 range so that there is some excess income that can offset any headwinds. Despite these concerns, the portfolio strength looks great, and the new investments may eventually materialize to higher earnings through 2026. Therefore, I believe that TRIN is still a solid choice for income investors at this time.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720453036902275_origin.png\" rel=\"lightbox\" data-width=\"1086\" data-height=\"395\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720453036902275_origin.png?io=w640\" alt=\"TRIN dividend history\" contenteditable=\"false\" width=\"640\" height=\"233\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720453036902275_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720453036902275_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720453036902275_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/31369215-17720453036902275_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Lastly, investors should consider the fact that distributions received from TRIN may not offer tax efficiency. Since the distributions are being supported by interest income received from borrowers, the income would be classified as ordinary dividends, which have the greatest tax burden for investors. Therefore, a position in TRIN would be best utilized within a tax-advantaged account for investors looking to limit their overall tax liability.</p> <h2 class=\"paywall-full-content\">Takeaway</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">In conclusion, I am upgrading my rating on TRIN to a buy at this time. The share price still trades at the higher end of its price-to-NAV range, but it is often very difficult to find an attractive entry on these higher quality BDCs. The portfolio remains resilient, and non-accruals are low, which reinforces the quality of management's underwriting. The earnings saw a slight decline due to higher operating costs, but this shouldn't be an issue as long as the new investment activity eventually materializes into higher net investment income. The distributions are supported by earnings, and the new monthly frequency makes it a great option for investors seeking a reliable stream of income within their portfolio.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2222223206/image_2222223206.jpg",
            "link": "https://seekingalpha.com/article/4876105-trinity-capital-nav-growth-continues-in-q4-upgrade",
            "pub_date": "2026-02-27 17:05:56",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876104",
            "title": "Virtu Financial: A Bet On Volatility, Not On Growth",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2163792349/image_2163792349.jpg?io=getty-c-w630\" alt=\"Finance stock price list with business district city building background.Stock exchange market and investment. Bank. Cyrptocurrency. 3d illustration\" data-id=\"2163792349\" data-type=\"getty-image\" width=\"1536\" height=\"864\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2163792349/image_2163792349.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2163792349/image_2163792349.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2163792349/image_2163792349.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2163792349/image_2163792349.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2163792349/image_2163792349.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2163792349/image_2163792349.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2163792349/image_2163792349.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2163792349/image_2163792349.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">UniqueMotionGraphics/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h3>My thesis</h3> <p>Virtu Financial (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/VIRT\" title=\"Virtu Financial, Inc.\">VIRT</a></span>) is not an investment for growth; it's an investment for the market<span></span>'s fear and chaos. This company works like a liquidity provider, whose profitability is directly correlated with the<span class=\"paywall-full-content\"> VIX index and trading volumes, rather than economic health. In February 2026, the share price fluctuates around the $40 range. While the P/E rate appears low, just 7.7x, compared to the sector</span><span class=\"paywall-full-content\"></span><span class=\"paywall-full-content\">'s median of around 14x, this reflects the cyclical 2025 peak, rather than a sustainable trend.</span></p> <p class=\"paywall-full-content\">Investors need to understand that <a href=\"https://www.tradingview.com/news/financemagnates%3A733d6de1e094b%3A0-virtu-financial-s-trading-income-jumps-34-in-2025-amid-market-volatility/\" rel=\"nofollow\">2025 </a>was exceptional: annual revenue jumped to $3.63 billion, and adjusted <a href=\"https://fintool.com/app/research/companies/VIRT/earnings/Q4%202025\" rel=\"nofollow\">EPS</a> reached $5.73. Though the current dividend yield has shrunk to around 2.4%, which is way lower than the historical 4-5% average, suggesting that the share price is currently not low. The company in 2025 <a href=\"https://www.tradingview.com/news/financemagnates%3A733d6de1e094b%3A0-virtu-financial-s-trading-income-jumps-34-in-2025-amid-market-volatility/\" rel=\"nofollow\">bought</a> back shares for $135 million, though this is more to maintain the price, rather than create new value. This is an instrument for portfolio hedging, not so much an engine for long-term capital accumulation.</p> <h2 class=\"paywall-full-content\">Business overview</h2> <p class=\"paywall-full-content\">Virtu Financial works like a financial liquidity provider, whose revenue depends on trading volumes and volatility. The company is making operations in over 235 markets and exchanges in 36 countries, trading over 25,000 different financial instruments. The main source of revenue is the bid-ask spread, and it makes up millions of transactions per day. In 2025 Q4, the company reached an average adjusted net trading income (ANTI) of $9.7 million per day. This directly correlates with the market's activity: when the VIX index is higher, margins expand, and in calmer periods, they pull back. EPS in 2025 reached $5.73, which suggests a significant efficiency compared to the historical average of $3-$4.</p> <p class=\"paywall-full-content\">The company<span></span>'s activity is divided into two segments: market making and execution services. The market making remains a dominating segment, at the end of 2025, generating around $7.8 million ANTI per day, which makes up around 80% of the whole trading income. This segment is identified with high profitability; the trading segment <a href=\"https://www.investing.com/news/company-news/virtu-financial-q4-2025-slides-reveal-recordhigh-trading-income-strong-margin-growth-93CH-4473342\" rel=\"nofollow\">EBITDA </a>margin in 2025 Q4 reached 72%. The second segment, execution services, works like a more stable revenue flow, servicing institutional clients through algorithmic orders and the ITG platform. This segment in 2025 reached $2.0 million average daily income, growing for the 7th quarter in a row. Even though execution services make up a smaller part, they still cover fixed costs in periods when the market<span></span>'s volatility is low.</p> <h2 class=\"paywall-full-content\">Valuation</h2> <p class=\"paywall-full-content\">Virtu Financial shares are currently traded at around $40, with a 7.7x P/E. This is a significant discount compared to a 5 year historical average, which reaches 10.2x. The market currently values VIRT like a stagnant asset, despite the fact that in 2025, adjusted EPS reached $5.73. For comparison, the overall financial sector is usually traded at 12-14x P/E. This low of a valuation for the company shows that investors have doubts if the company will be able to maintain this profitability if the market volatility were to slow down.</p> <p class=\"paywall-full-content\">The enterprise value to EBITDA ratio is only at 7.4x. This is way lower than the broader capital markets sector median, which is usually over 11x. Such a low ratio looks unusual, considering that in 2025 total revenue grew by 26% and reached $3.63 billion. Also, more importantly, adjusted EBITDA grew 52% in a year to $1.4 billion. Q4 Trading segment EBITDA margins reached 72%, which confirms the business model's ability to generate cash flows without additional costs.</p> <p class=\"paywall-full-content\">Book value per share currently is $17.14. This makes the price-to-book ratio 2.3x. Even though the ratio is over the sector<span></span>'s average, it<span></span>'s justified because of a very high asset utilization efficiency. P/S is reaching 1.7x, which is lower than most technology-enabled financial companies. Current valuation suggests a clear gap between the growth of fundamental indicators and the contraction of share price multiples.</p> <h2 class=\"paywall-full-content\">Comparison</h2> <p class=\"paywall-full-content\">Virtu Financial's valuation shows a big gap between the main competitors and the broader capital markets sector. VIRT shares are traded at an 8.0x forward P/E rate, which is drastically lower than the sector<span></span>'s average, which reaches around the higher teens to twenties. For comparison, exchange operators such as Nasdaq (<a href=\"https://seekingalpha.com/symbol/NDAQ\" title=\"Nasdaq, Inc.\">NDAQ</a>) or Cboe Global Markets (<a href=\"https://seekingalpha.com/symbol/CBOE\" title=\"Cboe Global Markets, Inc.\">CBOE</a>) are usually valued at an 18-22x range, because of their stable revenues. VIRT's P/B ratio is <a href=\"https://finance.yahoo.com/quote/VIRT/key-statistics/\" rel=\"nofollow\">reaching</a> around 2.1x, while the closest competitors, for example, BGC Group or Charles Schwab, are traded at a 3.7x ratio. The market completely applies a discount for VIRT shares, because their business model is directly linked to the market<span></span>'s volatility and trading volumes, which are very unpredictable, opposite to exchange operators with their subscription and data sales revenues. This valuation gap suggests that investors consider VIRT not a growth, but rather a dividend yield instrument, demanding a high-risk premium for the cyclicality of profits.</p> <h2 class=\"paywall-full-content\">Share buybacks and dividends</h2> <p class=\"paywall-full-content\">Virtu Financial sticks to a conservative, fixed dividend policy and pays out $0.24 per share every quarter. This makes up a $0.96 yearly payment, which hasn<span></span>'t changed for a few years. At a current share price of around $40, dividend yield is 2.4%, which is much lower than the historical average of this company, which is 4-5%, though this drop happened, not because of dividend lowering, but because of rapid share price growth, because of successful 2025 results. The most important indicator here is the payout ratio. The company, through 2025, earned $5.73 adjusted EPS, so allocation for dividends is only about 19% of net profit. This suggests that the dividend is very safe, even if the market<span></span>'s volatility in the future decreases.</p> <p class=\"paywall-full-content\">Throughout 2025 Virtu Financial for share buybacks spent $135.3 million. For this amount, they bought and terminated 3.5 million of their shares. Even though this seems like a solid amount, it only makes up around 4% of the market capitalization. The total number of shares outstanding in the market decreased to 84.9 million units. Also worth noticing is that the management makes purchases opportunistically, so when the share price goes down, the buyback pace increases, though in 2025, when the shares had risen, buyback intensity was moderate. Despite that, regular share reduction mechanically increases the EPS ratio, even if gross profit remains stable.</p> <p class=\"paywall-full-content\">All together with dividends and share buybacks, the total yield is reaching around 6.5%. This is a solid ratio in the financial sector, though investors have to keep in mind the balance structure. At the end of 2025, the company had $1.13 billion in cash, and long-term debt reached $2.07 billion. Considering that in 2025 adjusted EBITDA reached $1.4 billion, the company has enough flows both for debt servicing and further capital return to shareholders. Current valuation suggests that the market has already priced in the success of 2025, so expecting a further rapid yield growth without higher market chaos, which increases VIRT<span></span>'s revenues, would be naive.</p> <h2 class=\"paywall-full-content\">Risks</h2> <p class=\"paywall-full-content\">The biggest risk for the VIRT business model is that in 2025-2026 SEC “Reg NMS” amendments come into effect. From 2025 to May 2026, a mandatory reduction in minimum tick size to $0.005 or even $0.001 for some shares, which directly lowers bid/ask spreads. Since VIRT in 2025 generated $2.44 billion net trading income exactly from these spreads, their contraction means lower revenues for the same amount of trades. This is a structural profitability decrease, which cannot be compensated for by higher turnover alone.</p> <p class=\"paywall-full-content\">The second risk is the high dependency on the market<span></span>'s volatility, which in 2025 was very high. In Q4, VIRT reached a record EPS of $1.85, when the VIX index was usually over 18. Though historically the VIX average is around 15. If the market stabilises in 2026 and the VIX drops to the 12-13 level, profits may decrease more than 50%, no matter if the company stays efficient. Also, December 2025, received a $2.5 million SEC fine for customer data protection gaps, showing that operational risks remain high, while regulators attention to algorithmic trading is only increasing.</p> <h2 class=\"paywall-full-content\">Thesis summary</h2> <p class=\"paywall-full-content\">Virtu Financial started 2026 not like a growth story, but rather like a cyclical market<span></span>'s volatility position. 2025 results were exceptional; revenues grew to $3.63 billion, and adjusted EPS reached a $5.73 rate. Though the current 7-8x P/E ratio is looking more like the market<span></span>'s skepticism on the sustainability of these results, rather than a structural discount. Virtu's profitability directly depends on the trading volumes and VIX index, so without increased market chaos, these profit levels could be hard to replicate.</p> <p class=\"paywall-full-content\">Even though dividend policy remains conservative, and the payout ratio is only reaching around 19%, the current 2.4% yield suggests that the share is not cheap anymore. Buybacks and capital returns give additional support for the price, though it's more of a support mechanism than a strategy for long-term value creation.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Valuing the risk, upcoming \"Reg NMS\" changes, and possible market volatility decrease could significantly impact bid-ask differential profitability. So Virtu today works more like a portfolio hedging or tactical cyclical instrument, than a stable long-term capital growth investment. Further returns will depend on the market<span></span>'s anxiety and trading activity levels, rather than economic growth.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2163792349/image_2163792349.jpg",
            "link": "https://seekingalpha.com/article/4876104-virtu-financial-a-bet-on-volatility-not-on-growth",
            "pub_date": "2026-02-27 17:01:05",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876119",
            "title": "Rates Spark: Inflation Data Next Test For Bullish Euro Rates",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2159044105/image_2159044105.jpg?io=getty-c-w630\" alt=\"Group of business men in front of a large illuminated Euro sign entrance\" data-id=\"2159044105\" data-type=\"getty-image\" width=\"1536\" height=\"987\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2159044105/image_2159044105.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2159044105/image_2159044105.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2159044105/image_2159044105.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2159044105/image_2159044105.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2159044105/image_2159044105.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2159044105/image_2159044105.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2159044105/image_2159044105.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2159044105/image_2159044105.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">J Studios/DigitalVision via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p><em>By <a href=\"https://think.ing.com/author/michiel-tukker/\" rel=\"nofollow\">Michiel Tukker</a>, <a href=\"https://think.ing.com/author/michiel-tukker/\" rel=\"nofollow\">Senior European Rates Strategist</a></em></p> <h2>Eurozone inflation stable, but also source of risk</h2> <p>Inflation surprises remain a risk to our rates view, both in terms of upside and downside risks. Markets are positioned for<span class=\"paywall-full-content\"> lower inflation, with the 2Y inflation swap marking 1.75% now, which is well below the European Central Bank’s target. Nevertheless, only 7bp of ECB easing is priced in for 2026, suggesting the probability of another rate cut is just 30%. This means that markets are content with an undershoot and don’t see the need for the ECB to respond.</span></p> <p class=\"paywall-full-content\">If we get lower CPI readings from the major eurozone countries today, then the case for more ECB cuts could quickly build – especially since rates seem keen to test lower the past few weeks. But also in the other direction, we see upside risks. The long end of the curve is still not fully confident that the ECB can keep inflation close to target over the long run. The 10Y inflation swap is still below 2%, even though in pre-quantitative easing times this number was usually around 2.2%, suggesting a 20bp risk premium. In effect, if we start seeing a series of strong inflation data in the coming months, then that could also push the back end up materially.</p> <p class=\"paywall-full-content\">Oil remains one piece of the inflation puzzle, but more recently the euro exchange rate and gas prices are more important driving forces behind rates. Gas prices jumped higher in January but have since lowered again. In the opposite direction, we had a sharp appreciation of the euro, but this has also broadly reverted since its January peak. That means we’re in quite a balanced position in terms of inflation expectations now. This is also reflected by the fact that both 2Y and 10Y inflation swaps are trading close to their six-month average.</p> <p class=\"paywall-full-content\">Meanwhile, we see that global rates markets are holding on to their bullish momentum. The AI jitters continue to keep risk sentiment on edge, and private credit concerns don't help either. We still think rates have come down too far, especially when seeing euro equities hitting new records. On the other hand, we don't see much willingness for rates to pop back up again, raising the question of whether investors are becoming more keen to <a href=\"https://seekingalpha.com/article/4874408-investors-may-turn-to-egbs-amid-equity-jitters\" rel=\"noopener\">add some safety</a> to their portfolio in the form of euro bonds.</p> <h4 class=\"paywall-full-content\">Inflation swaps suggest markets are positioned for an undershooting</h4> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721816266770847_origin.png\" rel=\"lightbox\" data-width=\"1749\" data-height=\"841\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721816266770847_origin.png?io=w640\" alt=\"Inflation swaps suggest markets are positioned for an undershooting\" contenteditable=\"false\" width=\"640\" height=\"308\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721816266770847_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721816266770847_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721816266770847_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721816266770847_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"> </p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Friday’s events and market views</h2> <p class=\"paywall-full-content\">Markets will be watching French, Spanish and German CPI numbers, which will help build expectations for the eurozone aggregate number coming on Tuesday. From the US, we have PPI data, the MNI Chicago PMI, and construction spending figures.</p> <p class=\"paywall-full-content\"><strong>Content Disclaimer</strong></p> <p class=\"paywall-full-content\">This publication has been prepared by ING solely for information purposes irrespective of a particular user's means, financial situation or investment objectives. The information does not constitute investment recommendation, and nor is it investment, legal or tax advice or an offer or solicitation to purchase or sell any financial instrument. <a href=\"https://think.ing.com/about/content-disclaimer/\" rel=\"nofollow\">Read more</a></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\"><strong><a href=\"https://think.ing.com/articles/rates-spark-inflation-data-next-test-for-bullish-euro-rates/\" rel=\"nofollow\">Original Post</a></strong></p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2159044105/image_2159044105.jpg",
            "link": "https://seekingalpha.com/article/4876119-inflation-data-next-test-bullish-euro-rates",
            "pub_date": "2026-02-27 16:55:52",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876001",
            "title": "Clipper Realty: Cheap Even With Office And Political Overhangs",
            "description": "<figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2206067205/image_2206067205.jpg?io=getty-c-w630\" alt=\"Lower Manhattan and the financial district at sunset, New York City, with clouds\" data-id=\"2206067205\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2206067205/image_2206067205.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2206067205/image_2206067205.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2206067205/image_2206067205.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2206067205/image_2206067205.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2206067205/image_2206067205.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2206067205/image_2206067205.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2206067205/image_2206067205.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2206067205/image_2206067205.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Tim Robberts/DigitalVision via Getty Images</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <p data-eci=\"true\">Shares of Clipper Realty (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CLPR\" title=\"Clipper Realty Inc.\">CLPR</a></span>) have been a poor performer over the past year, losing over a quarter of their value. The loss of a tenant in an office property, and increased concerns about rent regulations have weighed on shares. I last covered<span class=\"paywall-full-content\"> shares of Clipper in </span><a href=\"https://seekingalpha.com/article/4786526-clipper-realty-attractively-valued-despite-property-specific-headwinds\" title=\"https://seekingalpha.com/article/4786526-clipper-realty-attractively-valued-despite-property-specific-headwinds\" target=\"_blank\" class=\"paywall-full-content\">May 2025</a><span class=\"paywall-full-content\"> when I rated the stock a “buy,” but this has been a poor call, with shares losing 18% since then and missing out on a 17% market rally. I misread the political risk in NYC, though that appears to be largely priced into shares at this point. With updated financials, now is a good time to revisit CLPR.</span></p> <figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/13071522-17721537826117582_origin.png\" rel=\"lightbox\" data-width=\"847\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/13071522-17721537826117582_origin.png?io=w640\" alt=\"stock chart\" width=\"640\" height=\"277\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/13071522-17721537826117582_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/13071522-17721537826117582_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/13071522-17721537826117582_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/13071522-17721537826117582_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure><p class=\"paywall-full-content\">In the company’s <a href=\"https://clipperrealty.com/wp-content/uploads/2026/02/Q4-25-Earnings-Press-Release.pdf\" rel=\"nofollow\" title=\"https://clipperrealty.com/wp-content/uploads/2026/02/Q4-25-Earnings-Press-Release.pdf\" target=\"_blank\">fourth quarter</a>, Clipper generated $0.04 of funds from operations, which was $0.02 below <a href=\"https://seekingalpha.com/news/4558330-clipper-realty-ffo-of-0_04-misses-by-0_02-revenue-of-37_07m-misses-by-1_03m\" title=\"https://seekingalpha.com/news/4558330-clipper-realty-ffo-of-0_04-misses-by-0_02-revenue-of-37_07m-misses-by-1_03m\" target=\"_blank\">expectations</a> as revenue declined by 2.6% to $37 million, hampered by lease-up costs, which are temporary. For the full year, the company generated $0.56 of FFO, down from $0.68 in 2024. Adjusted EBITDA was actually flat at $74 million, but rising interest expense has reduced cash flow. The company’s share price has been negatively impacted by revised <a href=\"https://seekingalpha.com/article/4786526-clipper-realty-attractively-valued-despite-property-specific-headwinds\" title=\"https://seekingalpha.com/article/4786526-clipper-realty-attractively-valued-despite-property-specific-headwinds\" target=\"_blank\">rental regulations</a> in New York, which generally limit lease rate inflation to 2.75% and make it harder to convert units out of rent stabilization.</p> <h2 class=\"paywall-full-content\">Residential results were solid, but political risk looms</h2> <p class=\"paywall-full-content\">In its residential division, new leases were up 13%, with renewal rates also up a strong 7%. As a result, revenues grew by $2.7 million to $31 million, primarily from increased rents at stabilized properties. Additionally, its Prospect House property in Brooklyn is successfully leasing up, with occupancy now up to 66% and most of its unregulated units yet to be leased. We should see a substantial increase from the $1.5 million of revenue generated in Q4 from this property as it completes its lease-up and gets to a run-rate footing, likely around midyear 2026.</p> <p class=\"paywall-full-content\">The election of Mayor Zohran Mamdani in New York has added further uncertainty to the space, given his focus on this issue. In particular, he campaigned on freezing rent and is <a href=\"https://www.amny.com/news/mamdani-rent-guidelines-board-rent-freeze/\" rel=\"nofollow\" title=\"https://www.amny.com/news/mamdani-rent-guidelines-board-rent-freeze/\" target=\"_blank\">taking steps</a> to do that via appointments to the Rent Guidelines Board. Mamdani has also pushed to increase housing construction, <a href=\"https://www.cbsnews.com/newyork/video/nyc-mayor-mamdani-talks-housing-with-president-trump-at-the-white-house/\" rel=\"nofollow\" title=\"https://www.cbsnews.com/newyork/video/nyc-mayor-mamdani-talks-housing-with-president-trump-at-the-white-house/\" target=\"_blank\">meeting</a> with President Trump on this issue. At some point, these competing policy priorities may come into conflict, as rent restrictions may reduce the attractiveness of developing new apartments. Regardless, the overall policy stance is not particularly friendly towards residential landlords like Clipper.</p> <p class=\"paywall-full-content\">Its Flatbush Garden complex is its primary rent-regulated building. The property generated $13.2 million of revenue, up about 7% from last year, and its leased rate was strong at 98.2%. It was able to push leased rates to $32/square foot from $30 last year. There is a risk that revenue growth could slow materially on this property if Mamdani’s policy goals are achieved. Its Tribeca property, which has less rent regulation exposure, saw revenue jump nearly 10% to $11.7 million, and occupancy is excellent at 99.4%. On this property, CLPR charges $89/sqft, and that gap speaks to how beneficial having market-oriented apartment exposure is relative to rent-regulated units.</p> <p class=\"paywall-full-content\">I think it is also important to note that while the national residential rental market is battling negative rent, New York City has been a significant outperformer, aided by less supply post-COVID than in Sun Belt markets. Rents are still rising, up 2% from last year. With new construction levels fairly muted, any supply-side effort is unlikely to hit the market before 2028/2029. As such, in non-rent-regulated units, I expected continued positive rental inflation. Outcomes in rent-regulated units are much harder to predict and have meaningful political uncertainty associated with them.</p> <figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/13071522-1772153782709281_origin.png\" rel=\"lightbox\" data-width=\"964\" data-height=\"607\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/13071522-1772153782709281_origin.png?io=w640\" alt=\"line chart\" width=\"640\" height=\"403\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/13071522-1772153782709281_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/13071522-1772153782709281_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/13071522-1772153782709281_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/13071522-1772153782709281_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>ApartmentList</span></p></figcaption></figure><h2 class=\"paywall-full-content\">Tenant loss hampers office results</h2> <p class=\"paywall-full-content\">Its commercial unit has faced more difficulties as the city government exited its 250 Livingston Lease, and 141 Livingston faced claims from creditors. Revenue was down $3.6 million from last year to $6.2 million, entirely due to developments on 250 Livingston. Because it lost the city government lease, revenue from 250 Livingston declined by over 80% to $600k, coming from 36 residential units in the building. I previously wrote that finding a tenant in this office market would be very difficult and assumed no new tenant.</p> <p class=\"paywall-full-content\">Recognizing this, CLPR has stopped making interest and tax payments on this property, essentially defaulting on its mortgage. This loan, like the majority on CLPR’s properties, is nonrecourse. That means Clipper can walk away from an underwater building like 250 Livingston, and lenders have no claim on the rest of its assets. Rather than fund losses out of cash flow from other buildings, management has determined the building to be worth less than the outstanding debt on it. Unless lenders materially modify the mortgage, it is likely to be foreclosed.</p> <p class=\"paywall-full-content\">Separately, the lender on 141 Livingston had alleged CLPR breached covenants by failing to maintain a $100 million net worth. CLPR was able to resolve all claims by posting a $10 million letter of credit and incurring $2.6 million of settlement expenses. Importantly, this allows the 5-year lease with its main tenant, the city government, to go through.</p> <h2 class=\"paywall-full-content\">The balance sheet offers flexibility</h2> <p class=\"paywall-full-content\">Turning to its balance sheet, Clipper has $1.3 billion of debt, and it also has $31 million of cash. Net debt was flat over the past year. As noted above, CLPR primarily borrows at the property level. This provides flexibility as property fundamentals change. For instance, it has $125 million against its 250 Livingston property, which we may see exit its balance sheet. Its two primary mortgages are the $360 million against Tribeca House, one of its best-performing assets, and its $329 million against Flatbush Gardens.</p> <p class=\"paywall-full-content\">Importantly, the company has no near-term maturities. However, many of these loans carry low-rate mortgages. Most notably, its Flatbush Gardens loan is at 3.125%. This does not mature until 2032, but we are likely to see a materially higher interest rate given both the absolute level of rates and negativity around rent-regulated exposure, and this is likely to add several million in run-rate annual interest expense.</p> <h2 class=\"paywall-full-content\">Dividend should be secure in 2026</h2> <p class=\"paywall-full-content\">Shares offer an 11% dividend yield. During 2025, Clipper generated $23 million of operating cash flow, down from $32 million last year, though this still covered its $18.5 million of dividend payments. As a general rule, whenever I see a double-digit dividend yield, that is an immediate warning sign that markets believe the payout may not be sustained. The company did fully cover its dividend in 2025; however, this included a partial-year contribution from 250 Livingston. On the other hand, Prospect House is still leasing up. In Q4, CLPR did not cover its dividend. Once we get to run-rate on Prospect House and exit 250 Livingston, we should see ~$0.06 of benefits. At $0.10 per quarter, CLPR barely covers its dividend.</p> <p class=\"paywall-full-content\">Now, given the dynamics discussed above, we should see ongoing rental inflation at all non-regulated units, but there is considerable uncertainty about the path forward on H2 rent-regulated units and whether a freeze could be implemented. Given the fact operating expenses do rise over time, a rent freeze could erode cash flow. At this time, I expect a deceleration in rent inflation, but I do not view 0% as the base case either.</p> <p class=\"paywall-full-content\">Depending on the outcome here and the speed of the Prospect House lease-up, I expect $0.38-$0.44 of FFO, which protects the dividend this year. That said, over the medium term, Clipper’s interest expense is likely to rise as it refinances maturities, though this is not a pressing issue until the 2028-2032 period. Still, by 2032, interest expense could be $15 million higher, or over $0.30/share.</p> <p class=\"paywall-full-content\">Of course, much depends on the rate environment, which is completely unknowable several years from now. This thought is where the medium-term trajectory of rents becomes essential. With 2.5+% rent inflation, CLPR can grow the topline sufficiently to absorb higher rates, but at 1.5% or lower, interest expense will begin to squeeze the dividend. Shares are yielding 11%, in part reflecting this medium-term risk.</p> <h2 class=\"paywall-full-content\">I remain a \"buy,\" given depressed valuation</h2> <p class=\"paywall-full-content\">I do not expect a change to dividend policy in 2026 or likely even 2027, but there is uncertainty beyond then. That said, CLPR’s balance sheet structure of nonrecourse loans gives it a tremendous amount of flexibility and truncates downside on any single property. After the decline in shares and at sub-9x 2026 FFO, it seems to me that all the political risk is being priced in already, and fundamentals outside rent-regulated units are still quite solid in the NYC area.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">As such, I remain a \"buy.\" Given the increased political overhang from the NYC mayoral election (a risk I admittedly took too lightly last May, leading to my erroneous buy rating), I no longer think shares can get to $5, but I view 10x FFO as attainable as we see Prospect House results improve and AFFO cover the dividend. With upside towards $4.00 plus its 11% yield, I view CLPR as having attractive upside, though the political environment remains a risk.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2206067205/image_2206067205.jpg",
            "link": "https://seekingalpha.com/article/4876001-clipper-realty-cheap-even-with-office-and-political-overhangs",
            "pub_date": "2026-02-27 16:46:36",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876116",
            "title": "Why Gold's Pullback Is A Setup, Not A Setback",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2219056031/image_2219056031.jpg?io=getty-c-w630\" alt=\"Gold trading, gold bars with stock graph chart stock. Business and finance concept\" data-id=\"2219056031\" data-type=\"getty-image\" width=\"1536\" height=\"1068\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2219056031/image_2219056031.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2219056031/image_2219056031.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2219056031/image_2219056031.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2219056031/image_2219056031.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2219056031/image_2219056031.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2219056031/image_2219056031.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2219056031/image_2219056031.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2219056031/image_2219056031.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">e-crow/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p><em>Discover why we believe gold drawdowns are normal, why the bull market has room to run, and the case for including real assets in every portfolio. </em></p> <p>A new regime for real assets may be underway, driven<span class=\"paywall-full-content\"> by surging electricity demand, AI infrastructure buildout, and shifting monetary dynamics. Against this backdrop, we examine gold’s role in the cycle, why periodic corrections are historically normal for the metal, silver’s potential, and how diversified real asset exposure through the </span><a href=\"https://www.vaneck.com/us/en/investments/real-assets-etf-raax\" title=\"RAAX - VanEck Real Assets ETF\" rel=\"nofollow\" class=\"paywall-full-content\">VanEck Real Assets ETF</a><span class=\"paywall-full-content\"> (</span><a href=\"https://seekingalpha.com/symbol/RAAX\" title=\"VanEck Real Assets ETF\" class=\"paywall-full-content\">RAAX</a><span class=\"paywall-full-content\">) can help position portfolios for the debasement era. </span></p> <h2 class=\"paywall-full-content\">The Gold Rally Has More Upside</h2> <p class=\"paywall-full-content\">Looking at the current gold environment through the lens of the two previous major bull markets provides helpful context: the 1976–1980 cycle (which produced roughly 500% cumulative returns) and the 2001–2011 cycle (roughly 600% cumulative returns). The current cycle, which began in 2022, has generated approximately 200% so far. Importantly, both prior bull markets experienced five corrections of 10% or more along the way. The recent pullback represents the second such correction in this cycle and falls well within historical norms.</p> <ul class=\"paywall-full-content\"> <li>Prior gold bull markets produced 500–600% cumulative returns; the current cycle has delivered roughly 200%.</li> <li>Both the 1970s and 2000s bull markets experienced five corrections of 10% or more.</li> <li>The recent pullback is the second such correction in this cycle and is consistent with historical patterns.</li> </ul> <h2 class=\"paywall-full-content\">By Historical Standards, We View Gold’s Bull Market is in its Infancy</h2> <p class=\"paywall-full-content\"><strong>Gold – Cumulative Total Return</strong></p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://www.vaneck.com/EPiServer/CMS/Content/contentassets/9a6dcf86acac495fa6a1bf90e2212f3d/6846_raax-recap-blog_chart-1_2026-2_v1_desktop.svg,,362181/Download?epieditmode=False\" alt=\"Gold – Cumulative Total Return\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\"><span>Source: VanEck, Bloomberg. Data as of January 2026. The views expressed are for illustrative purposes only, subject to change without notice, do not constitute investment advice or recommendations, and are those of the author(s) and not necessarily those of VanEck or its other employees. Past performance is no guarantee of future results.</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">The RAAX ETF: A One-Stop Real Asset Allocation</h2> <p class=\"paywall-full-content\">The VanEck Real Assets ETF primarily allocates to exchange-traded products that provide exposure to real assets. Over the past five years, a portfolio of 55% stocks, 35% bonds, and 10% RAAX delivered a 47.5% cumulative return with an annualized standard deviation of 10.3%—outperforming a traditional 60/40 portfolio with virtually identical risk.</p> <h4 class=\"paywall-full-content\">RAAX Average Annual Total Returns as of 12/31/2025* (%)</h4> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <tr> <td>Quarter End as of 12/31/2025</td> <td>1 MO</td> <td>3 MO</td> <td>YTD</td> <td>1 YR</td> <td>3 YR</td> <td>5 YR</td> <td>10 YR</td> <td>LIFE 04/09/18</td> </tr> <tr> <td>RAAX (NAV)</td> <td>0.38</td> <td>3.78</td> <td>27.20</td> <td>27.20</td> <td>14.92</td> <td>14.77</td> <td>--</td> <td>7.95</td> </tr> <tr> <td>RAAX (Share Price)</td> <td>0.44</td> <td>3.73</td> <td>26.80</td> <td>26.80</td> <td>15.05</td> <td>14.80</td> <td>--</td> <td>7.97</td> </tr> <tr> <td>Bloomberg Commodity Index</td> <td>-0.32</td> <td>5.85</td> <td>15.77</td> <td>15.77</td> <td>3.96</td> <td>10.64</td> <td>--</td> <td>5.67</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table><tr><td> <p><sup>*</sup> Returns less than one year are not annualized.</p> <p>All benchmark indices are unmanaged and include the reinvestment of all dividends, but do not reflect the payment of transaction costs, advisory fees or expenses that are associated with an investment in the Fund. An index’s performance is not illustrative of the Fund’s performance. Benchmark indices are not securities in which investments can be made.</p> <p><em>The performance data quoted represents past performance. Past performance is not a guarantee of future results. Investment return and principal value of an investment will fluctuate so that an investor's shares, when redeemed, may be worth more or less than their original cost. Performance may be lower or higher than performance data quoted. Please call 800.826.2333 or visit vaneck.com for performance current to the most recent month ended.</em></p> </td></tr></table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <h2 class=\"paywall-full-content\">Examining a 10% Shift for a New Regime</h2> <p class=\"paywall-full-content\"><strong>Allocation Guide and Associated 5-Year Risk / Return</strong></p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <tr><td> <p><em>Weighting Stocks vs. Bonds vs. Real Assets</em></p> <p><img src=\"https://www.vaneck.com/EPiServer/CMS/Content/contentassets/17f667b1551648da9ab9d24178d6e9bf/6846_raax-recap-blog_chart-2_2026-2_v1_desktop.svg,,362199/Download?epieditmode=False\" alt=\"Weighting Stocks vs. Bonds vs. Real Assets\" loading=\"lazy\"></p> <p><em>5-Year Cumulative Return and Annualized Risk</em></p> <p><img src=\"https://www.vaneck.com/EPiServer/CMS/Content/contentassets/17f667b1551648da9ab9d24178d6e9bf/6846_raax-recap-blog_chart-3_2026-2_v1_desktop.svg,,362201/Download?epieditmode=False\" alt=\"5-Year Cumulative Return and Annualized Risk\" loading=\"lazy\"></p> </td></tr> <tr><td>Source: VanEck, FactSet. As of December 31, 2025. The views expressed are for illustrative purposes only, subject to change without notice, do not constitute investment advice or recommendations, and are those of the author(s) and not necessarily those of VanEck or its other employees. Past performance is no guarantee of future results. “Stocks” represented by S&amp;P 500 Index. “Bonds” represented by Bloomberg U.S. Aggregate Bond Index. “Real Assets” represented by VanEck Real Assets ETF (<a href=\"https://seekingalpha.com/symbol/RAAX\" title=\"VanEck Real Assets ETF\">RAAX</a>). Index descriptions included at the end of this presentation. Index performance is not illustrative of fund performance. It is not possible to invest directly in an index. Index and allocation performance figures shown are shown are historical and for educational purposes only and do not reflect actual investor accounts or guaranteed outcomes.</td></tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\">The RAAX ETF is structured around three pillars: growth-oriented holdings (54.5%), including commodities, resource equities, and infrastructure; income-producing assets (17.5%), including MLPs, REITs, and utilities; and capital preservation (26%), anchored by gold bullion and gold miners. Its active, rules-based allocation process has added incremental performance at each step relative to both a 60/40 benchmark and an equal-weight proxy of its investment universe.</p> <p class=\"paywall-full-content\">RAAX has also demonstrated an ability to generate consistent returns relative to both commodities and inflation.</p> <h2 class=\"paywall-full-content\">Ability to Outperform Commodities, Inflation Through Time</h2> <p class=\"paywall-full-content\"><strong>Annualized Trailing Total Return</strong></p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721807550825953_origin.png\" rel=\"lightbox\" data-width=\"896\" data-height=\"510\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721807550825953_origin.png?io=w640\" alt=\"Annualized Trailing Total Return\" contenteditable=\"false\" width=\"640\" height=\"364\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721807550825953_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721807550825953_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721807550825953_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/55028208-17721807550825953_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Source: FactSet. Data as of December 31, 2025. *As of 4/9/2018. The views expressed are for illustrative purposes only, subject to change without notice, do not constitute investment advice or recommendations, and are those of the author(s) and not necessarily those of VanEck or its other employees. Past performance is no guarantee of future results. Index performance is not illustrative of fund performance. It is not possible to invest directly in an index. Index performance figures shown are shown are historical and for educational purposes only and do not reflect actual investor accounts or guaranteed outcomes.</span></p></figcaption></figure></p> <p class=\"paywall-full-content\"><strong>Important Disclosures </strong></p> <p class=\"paywall-full-content\"><strong>This content is intended for educational purposes only. Please note that the availability of the products mentioned may vary by country, and it is recommended to check with your local stock exchange.</strong></p> <p class=\"paywall-full-content\">This is not an offer to buy or sell, or a recommendation to buy or sell any of the securities, financial instruments or digital assets mentioned herein. The information presented does not involve the rendering of personalized investment, financial, legal, tax advice, or any call to action. Certain statements contained herein may constitute projections, forecasts and other forward-looking statements, which do not reflect actual results, are for illustrative purposes only, are valid as of the date of this communication, and are subject to change without notice. Actual future performance of any assets or industries mentioned are unknown. Information provided by third party sources are believed to be reliable and have not been independently verified for accuracy or completeness and cannot be guaranteed. VanEck does not guarantee the accuracy of third party data. The information herein represents the opinion of the speaker(s), but not necessarily those of VanEck or its other employees.</p> <p class=\"paywall-full-content\">The S&amp;P 500<sup>®</sup> Index is an unmanaged index of 500 widely held U.S. large-cap stocks and is considered a measure of U.S. equity market performance.</p> <p class=\"paywall-full-content\">The Bloomberg U.S. Aggregate Bond Index is a broad, unmanaged index that measures the investment-grade, U.S. dollar-denominated, fixed-rate taxable bond market.</p> <p class=\"paywall-full-content\">The Bloomberg Commodity Index is a diversified index composed of futures contracts on physical commodities and is designed to measure broad commodity market performance.</p> <p class=\"paywall-full-content\">The U.S. Consumer Price Index (CPI), published by the U.S. Bureau of Labor Statistics, measures the average change over time in the prices paid by consumers for a basket of goods and services and is commonly used as a measure of inflation.</p> <p class=\"paywall-full-content\">Index returns are not Fund returns and do not reflect any management fees or brokerage expenses. Certain indices may take into account withholding taxes. Investors can not invest directly in the Index. Returns for actual Fund investors may differ from what is shown because of differences in timing, the amount invested and fees and expenses. Index returns assume that dividends have been reinvested.</p> <p class=\"paywall-full-content\">An investment in the Fund may be subject to risks which include, among others, risks related to investing in real assets ETPs, which may subject the Fund to commodities, gold, natural resources companies, MLPs, real estate sector, infrastructure, ETP-related equity securities, small- and medium-capitalization companies, foreign securities, emerging market issuers, ETP-related foreign currency, credit, interest rate, call, concentration and derivative risks, all of which may adversely affect the Fund. The Fund may also be subject to fund of funds, affiliated fund, U.S. Treasury securities, subsidiary investment, commodity regulatory, subsidiary tax, liquidity, gap, cash transactions, high portfolio turnover, data, active management, operational, authorized participant concentration, no guarantee of active trading market, trading issues, market, fund shares trading, premium/discount risk and liquidity of fund shares risks. Foreign investments are subject to risks, which include changes in economic and political conditions, foreign currency fluctuations, changes in foreign regulations, and changes in currency exchange rates which may negatively impact the Fund's returns. Small- and medium-capitalization companies may be subject to elevated risks. No part of this material may be reproduced in any form, or referred to in any other publication, without express written permission of VanEck.</p> <p class=\"paywall-full-content\"><strong>Investing involves substantial risk and high volatility, including possible loss of principal. An investor should consider the investment objective, risks, charges and expenses of a Fund carefully before investing. To obtain a prospectus and summary prospectus, which contain this and other information, call 800.826.2333 or visit vaneck.com. Please read the prospectus and summary prospectus carefully before investing.</strong></p> <p class=\"paywall-full-content\">© Van Eck Securities Corporation, Distributor, a wholly owned subsidiary of Van Eck Associates Corporation.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\"><strong><a href=\"https://www.vaneck.com/us/en/blogs/natural-resources/why-golds-pullback-is-a-setup-not-a-setback/\" rel=\"nofollow\">Original Post</a></strong></p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2219056031/image_2219056031.jpg",
            "link": "https://seekingalpha.com/article/4876116-gold-pullback-is-setup-not-setback",
            "pub_date": "2026-02-27 16:40:57",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876100",
            "title": "Nayax: Market Sentiments Cool Execution Upside (Rating Downgrade)",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1475904326/image_1475904326.jpg?io=getty-c-w630\" alt=\"Charging the EV car.\" data-id=\"1475904326\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1475904326/image_1475904326.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1475904326/image_1475904326.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1475904326/image_1475904326.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1475904326/image_1475904326.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1475904326/image_1475904326.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1475904326/image_1475904326.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1475904326/image_1475904326.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1475904326/image_1475904326.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Thank you for your assistant/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Despite the recent correction, Nayax (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NYAX\" title=\"Nayax Ltd.\">NYAX</a></span>) is up ~15% on average on my three buy ratings. Going into Q4, I think the valuation reality has changed. Multiple compression across the payments space has lowered the<span class=\"paywall-full-content\"> ceiling for fintech stocks. The market remains skittish, with AI </span><a href=\"https://www.wsj.com/finance/stocks/global-stocks-markets-dow-news-02-23-2026-06a32080?gaa_at=eafs&amp;gaa_n=AWEtsqeqiA-Z2I4H-Z3mE7c_Q-u2FeciRce9l6TpbGQDQjwKL-AgdbH93V-mk6BXf1g%3D&amp;gaa_ts=699e9237&amp;gaa_sig=dZGvnUyDT6PIeJTbIwKyg8UI_hPZl0_d0KGszlBKLnTu9APXszbDP2kcz0FX-txc9ILFWeAi3_V_-zKWesvCfg%3D%3D\" rel=\"nofollow\" class=\"paywall-full-content\">concerns</a><span class=\"paywall-full-content\"> lowering the tolerance for long-duration growth stories. While operationally Nayax has never been stronger and the company’s growth profile deserves a premium, I think a $52-$54 entry point makes this a high-risk bet with a limited margin of safety in the current market environment. I am therefore downgrading my rating to hold.</span></p> <h2 class=\"paywall-full-content\">Things to watch in Q4: Mix Shift and Enterprise Acceleration</h2> <p class=\"paywall-full-content\">Nayax is scheduled to release earnings on March 9, 2026. To frame long-term expectations from this report, we must look at trends in unit economics in the company’s core verticals.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720047974314842_origin.png\" rel=\"lightbox\" data-width=\"1424\" data-height=\"239\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720047974314842_origin.png?io=w640\" alt=\"TTV to Number of Devices Growth Rate\" width=\"640\" height=\"107\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720047974314842_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720047974314842_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720047974314842_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720047974314842_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">TTV to Number of Devices Growth Rate <span>(Nayax 3Q25 Press Release)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Nayax is currently undergoing a mix-shift towards high-yield verticals, which offer a lift to processing revenue without a linear increase in device count. In 3Q25, the Total Transaction Value (or, TTV) <a href=\"https://ir.nayax.com/news/news-details/2025/Nayax-Reports-Third-Quarter-2025-Results/default.aspx\" rel=\"nofollow\">increased</a> 34.6%, while the number of managed devices grew only by 16.8%. This is similar to the ratio observed in <a href=\"https://ir.nayax.com/news/news-details/2025/Nayax-Reports-Second-Quarter-2025-Results/default.aspx\" rel=\"nofollow\">2Q</a> but the <a href=\"https://ir.nayax.com/news/news-details/2025/Nayax-Reports-First-Quarter-2025-Results/default.aspx\" rel=\"nofollow\">earnings</a> before that indicate the ratio was often close to 1:1.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720054115719678_origin.png\" rel=\"lightbox\" data-width=\"1441\" data-height=\"235\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720054115719678_origin.png?io=w640\" alt=\"TTV to Number of Devices Growth Rate\" width=\"640\" height=\"104\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720054115719678_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720054115719678_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720054115719678_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720054115719678_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">TTV to Number of Devices Growth Rate <span>(Nayax 1Q25 Press Release)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">A look at the <a href=\"https://seekingalpha.com/article/4846255-nayax-q3-reinforces-the-bull-case\">average ticket sizes</a> below reveals that this growth ratio could be quite a lot higher than 2:1.</p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <colgroup> <col> <col> </colgroup> <tr> <td><strong>Category</strong></td> <td><strong>Average Ticket Size</strong></td> </tr> <tr> <td>EV charge on AC</td> <td>$3-$4</td> </tr> <tr> <td>EV charge on DC</td> <td>$18</td> </tr> <tr> <td>Vending machine</td> <td>$2.24</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\">AC charging is the dominant category of installations globally, but DC installations are <a href=\"https://theicct.org/wp-content/uploads/2025/09/ID-462-%E2%80%93-EV-Charging-Monitor_research-brief_final-1-1.pdf\" rel=\"nofollow\">growing</a> at a faster clip. The most critical factor is charging time. AC chargers require a vehicle’s onboard converter to change from AC to DC. In contrast, DC chargers can convert power inside the station and send it directly to the EV battery. This can juice an EV to 80% in under an hour compared to about 4-10 hours for AC.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720014957312467_origin.png\" rel=\"lightbox\" data-width=\"769\" data-height=\"627\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720014957312467_origin.png?io=w640\" alt=\"Share of Public DC and AC Chargers\" width=\"640\" height=\"522\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720014957312467_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720014957312467_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720014957312467_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/48014573-17720014957312467_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">Share of Public DC and AC Chargers <span>(THE INTERNATIONAL COUNCIL ON CLEAN TRANSPORTATION)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The second factor is range anxiety. While AC chargers are installed in residential and workplace settings, DC chargers serve en route locations such as highways and urban hubs, where faster charging directly addresses range anxiety. In the US, the National Electric Vehicle Infrastructure program had allocated $5 billion to build DC charging networks along highways. But these didn’t exactly pan out amidst <a href=\"https://www.canarymedia.com/articles/ev-charging/trump-reopen-nevi-funding\" rel=\"noopener\">opposition</a> from the federal government last year. Regardless, I think the trendline remains clear. Just a few days ago, Nayax signed an <a href=\"https://www.nayax.com/news/nayax-tritium-global-ev-charger-payment-partnership/\" rel=\"noopener noopener\">agreement</a> with Tritium, a DC charging manufacturer, to integrate its payment hardware across a charging network spanning over 50 countries.</p> <blockquote class=\"paywall-full-content\"><p>So we're seeing a high demand. Q4 is always -- is a big enterprise, and we have a very, very good visibility to end this quarter with the expectation that we set to the market. - Yair Nechmad, CEO of Nayax at 3Q25 Results</p></blockquote> <p class=\"paywall-full-content\">In Q3, management also <a href=\"https://seekingalpha.com/article/4845608-nayax-ltd-nyax-q3-2025-earnings-call-transcript\">mentioned</a> an acceleration in enterprise sales. The impact of enterprise mix on margins was not explicitly mentioned. However, they appeared confident in staying in the higher end of 30%-35% hardware margins, which I think implies that enterprise sales are consistent with and not dilutive to those higher margins. A combination of these factors and the fact that companies tend to <a href=\"https://www.investopedia.com/terms/s/sandbag.asp\" rel=\"nofollow\">sandbag</a> expectations leads me to believe that the company will likely continue to affirm its 2028 <a href=\"https://seekingalpha.com/article/4800637-nayax-sticky-bet-in-a-growing-market\">targets</a> in its last quarter earnings.</p> <h2 class=\"paywall-full-content\">Valuation</h2> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/48014573-17720918856865997_origin.png\" rel=\"lightbox\" data-width=\"1696\" data-height=\"745\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/48014573-17720918856865997_origin.png?io=w640\" alt=\"Target Price v P/FCF Multiple\" width=\"640\" height=\"281\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/48014573-17720918856865997_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/48014573-17720918856865997_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/48014573-17720918856865997_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/48014573-17720918856865997_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span></span>Target Price vs. P/FCF Multiple <span>(Tunga Capital)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">With the company’s 2028 targets still intact, not much has changed in terms of my target range. But I also think the edge in valuation disappears if the market perceives the discount rate as being structurally higher to account for AI risks. Unfortunately, this isn’t a company issue but a macro issue, which makes the stock behave like a long-duration asset. Because of this factor, I thought the stock could keep drifting in and out of the first two regimes below.</p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <colgroup> <col> <col> <col> </colgroup> <tr> <td>Regime</td> <td>Fair Value</td> <td>Interpretation</td> </tr> <tr> <td>Execution + normal discount rate</td> <td>~$66–$78</td> <td>Moderate upside</td> </tr> <tr> <td>Execution + high discount rate</td> <td>~$46 - $50</td> <td>Fairly valued</td> </tr> <tr> <td>Execution miss</td> <td>&lt;$40</td> <td>Real downside</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\">If the execution remains on course and discount rates normalize, there is meaningful upside. If the discount rate remains high, the equity drifts sideways. Only under conditions of weak execution does the thesis break decisively. So a market-perform or hold rating makes sense for a macro call on a fundamentally improving business.</p> <h2 class=\"paywall-full-content\">Conclusion</h2> <p class=\"paywall-full-content\">Operationally, Nayax is at its strongest point, and the company's growth levers are structurally sound. For the investor who bought at a $44 price point, the stock has offered a decent return in a short period of time. This is especially true if you managed to sell at the $60 highs seen last month.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">I continue to like the company. I am just a little less enthusiastic about the entry point where the broader market is compressing multiples and is demanding faster resolution of growth stories. A pullback to the mid-40s without a clear operational reason would provide a higher margin of safety to accumulate. Otherwise, I expect the stock to move in line with market sentiments in the near term.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1475904326/image_1475904326.jpg",
            "link": "https://seekingalpha.com/article/4876100-nayax-market-sentiments-cool-execution-upside",
            "pub_date": "2026-02-27 16:35:53",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876091",
            "title": "Shake Shack: Tremendous Buy As January Comps Accelerate",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/979313078/image_979313078.jpg?io=getty-c-w630\" alt=\"A summer evening at Shake Shack in Union Square Park. Midtown, Manhattan, New York City\" data-id=\"979313078\" data-type=\"getty-image\" width=\"1536\" height=\"794\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/979313078/image_979313078.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/979313078/image_979313078.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/979313078/image_979313078.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/979313078/image_979313078.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/979313078/image_979313078.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/979313078/image_979313078.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/979313078/image_979313078.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/979313078/image_979313078.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">francois-roux/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>In my eyes, 2026 is hardly a stock market built for passive investing. The S&amp;P 500 appears to be stuck at levels just shy of 7,000 as the market struggles to find direction. The tech stocks that<span class=\"paywall-full-content\"> have powered much of the market's dizzying ascent over the past few years are mostly in deep correction territory. Meanwhile, consumer-facing companies, including those in the restaurant sector, are also facing persistent challenges as investors worry about inflationary pressures plus macro headwinds on restaurant traffic.</span></p> <p class=\"paywall-full-content\">But against this backdrop, Shake Shack (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SHAK\" title=\"Shake Shack Inc.\">SHAK</a></span>) remains one of my favored plays in the restaurant space. The elevated burger chain has continued to deliver healthy comps that compare well against other \"fast casual\" restaurant chains. Despite this, shares remain down ~10% over the past year, still creating a well-timed buying opportunity.</p> <p class=\"paywall-full-content\"><figure class=\"sa-widget sa-ycharts paywall-full-content\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_1df9fad0fe5d7a58cae7b37e6a23cd36.png?io=w640\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_1df9fad0fe5d7a58cae7b37e6a23cd36.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_1df9fad0fe5d7a58cae7b37e6a23cd36.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_1df9fad0fe5d7a58cae7b37e6a23cd36.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"><figcaption>Data by YCharts</figcaption></figure></p> <p class=\"paywall-full-content\"><a href=\"https://seekingalpha.com/article/4836139-shake-shack-q3-execution-stock-correction-attractive-value-upgrade-buy\">I last wrote a buy opinion</a> on Shake Shack in October, when the stock was trading at ~$90 per share. Since then, Shake Shack has enjoyed a meaningful uptrend even as the rest of the stock market has floundered. Amid healthy guidance looking ahead to FY26, amid the company noting that sales trends have improved materially in the early part of Q1, I'm reiterating my <strong>buy </strong>rating on Shake Shack.</p> <h3 class=\"paywall-full-content\">Well positioned for success in 2026, with reasonable valuation against a robust outlook</h3> <p class=\"paywall-full-content\">In my view, there are two core catalysts that Shake Shack can count as tailwinds in the upcoming year. The first is that the company continues to expand into new international markets via licensing deals. In Q4, the company grew its sales from licensed locations by 26% y/y to $232.7 million, which is 38% of the company's systemwide sales of $618 million. Licensing fee revenue (Shake Shack's cut of these sales) grew 28% y/y to $15.3 million, still a small 4% slice of overall sales - and yet, it's also a \"free\", high-margin revenue stream that allows Shake Shack to substantially expand its brand presence with low capital needs and low risk.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/33427965-1772171946078615_origin.png\" rel=\"lightbox\" data-width=\"1024\" data-height=\"908\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/33427965-1772171946078615_origin.png?io=w640\" alt=\"Shake Shack licensed openings\" width=\"640\" height=\"568\" contenteditable=\"false\" data-width=\"640\" data-height=\"568\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/33427965-1772171946078615_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/33427965-1772171946078615_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/33427965-1772171946078615_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/33427965-1772171946078615_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\">Shake Shack licensed openings <span>(Shake Shack Q4 shareholder letter)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Over the past few months alone, the company has opened locations in Hong Kong, Philippines, Shanghai, Canada, Israel, Korea, and others - as shown above. The company expects to open 40-45 new licensed locations in FY26, representing meaningful growth from its current base of 286 licensed stores. This stacks on top of 55-60 planned company-owned and operated locations, marking 2026 as a meaningful year for Shake Shack's brand expansion: both in the U.S. and overseas.</p> <p class=\"paywall-full-content\">The other core catalyst for investors to keep in mind is the fact that within the company's owned and operated portfolio, Shake Shack is getting the hang of more efficient operations. Whereas many restaurant chains are getting bogged down by higher labor costs, Shake Shack has overhauled its labor model to reduce labor costs (as a percentage of revenue), helping to offset the impacts of beef price inflation.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673438461943_origin.png\" rel=\"lightbox\" data-width=\"970\" data-height=\"310\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673438461943_origin.png?io=w640\" alt=\"Shake Shack labor trends\" width=\"640\" height=\"205\" contenteditable=\"false\" data-width=\"640\" data-height=\"205\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673438461943_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673438461943_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673438461943_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673438461943_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\">Shake Shack labor trends <span>(Shake Shack Q4 shareholder letter)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">This has allowed the company to keep growing adjusted EBITDA at a double-digit pace, even as its new restaurant openings are just at the point of maturing.</p> <p class=\"paywall-full-content\">Despite its many growth catalysts, Shake Shack continues to trade at very reasonable valuations. At current share prices near $99, Shake Shack commands a market cap of $4.21 billion. Netting off the $360.1 million of cash and $247.7 million of debt on Shake Shack's most recent balance sheet, the company's resulting enterprise value is $4.10 billion.</p> <p class=\"paywall-full-content\">For FY26, Shake Shack is guiding to $1.60-$1.70 billion of revenue, or 14% midpoint revenue growth, with 55-60 company-owned openings stacking on top of low single-digit same-shack sales (comp sales) growth, both contributing to double-digit top line expansion. The company is also expecting restaurant-level margins of 23.0-23.5%, representing up to one point of full-year expansion versus a 22.6% margin in FY25. Adjusted EBITDA, at a midpoint of $241 million, represents a 14.6% margin (+10bps y/y) and 15% y/y growth.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673558362806_origin.png\" rel=\"lightbox\" data-width=\"770\" data-height=\"932\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673558362806_origin.png?io=w640\" alt=\"Shake Shack outlook\" width=\"640\" height=\"775\" contenteditable=\"false\" data-width=\"640\" data-height=\"775\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673558362806_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673558362806_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673558362806_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673558362806_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\">Shake Shack outlook <span>(Shake Shack Q4 shareholder letter)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Shake Shack's valuation is positioned at 17.0x EV/FY26 adjusted EBITDA. While not exactly a value stock, we note that the company sits on the lower end of the spectrum versus true \"fast casual\" peers like Chipotle and CAVA (<a href=\"https://seekingalpha.com/symbol/CAVA\" title=\"CAVA Group, Inc.\">CAVA</a>), despite the fact that Shake Shack's comp sales are trending stronger.</p> <p class=\"paywall-full-content\"><figure class=\"sa-widget sa-ycharts paywall-full-content\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_c3937aa7f9da422901174eee2cb61b95.png?io=w640\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_c3937aa7f9da422901174eee2cb61b95.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c3937aa7f9da422901174eee2cb61b95.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c3937aa7f9da422901174eee2cb61b95.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"><figcaption>Data by YCharts</figcaption></figure></p> <p class=\"paywall-full-content\">Stay long here: in my view, Shake Shack's post-earnings momentum is well positioned to continue.</p> <h2 class=\"paywall-full-content\">Q4 recap</h2> <p class=\"paywall-full-content\">Let's now go through Shake Shack's latest quarterly results in greater detail. The Q4 earnings summary is shown below:</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673698453104_origin.png\" rel=\"lightbox\" data-width=\"1012\" data-height=\"956\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673698453104_origin.png?io=w640\" alt=\"Shake Shack Q4 results\" width=\"640\" height=\"605\" contenteditable=\"false\" data-width=\"640\" data-height=\"605\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673698453104_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673698453104_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673698453104_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673698453104_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\">Shake Shack Q4 results <span>(Shake Shack Q4 shareholder letter)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Shake Shack's revenue grew 22% y/y to $400.5 million, which accelerated meaningfully versus 16% y/y growth in Q3. The core driver of acceleration was the addition of 15 new company-owned Shacks in Q4, as well as 17 net-new licensed locations. As previously mentioned, though licensing revenue is still a small ~4% slice of overall revenue, the 28% y/y growth rate here (plus the plan to grow licensed locations by another ~16% in FY26) makes this an incredibly high-margin growth lever for the company.</p> <p class=\"paywall-full-content\">Of course, the most important metric for us to watch here is same-shack sales growth (which other restaurants refer to as \"same restaurant sales\" or \"comp sales\" and measures revenue growth from existing locations, without including the contribution of newly opened locations).</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673949769619_origin.png\" rel=\"lightbox\" data-width=\"1672\" data-height=\"1140\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673949769619_origin.png?io=w640\" alt=\"Shake Shack SSS trends\" width=\"640\" height=\"436\" contenteditable=\"false\" data-width=\"640\" data-height=\"436\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673949769619_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673949769619_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673949769619_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721673949769619_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\">Shake Shack SSS trends <span>(Shake Shack Q4 shareholder letter)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The good news is that same-shack sales continued on a recent positive trend, up 2.1% y/y with 160bps of price increases and a favorable menu mix further buoyed by 50bps of y/y traffic increase. This is the company's second consecutive quarter of positive traffic, after y/y declines earlier in the year.</p> <p class=\"paywall-full-content\">The bad news is that comps decelerated from ~5% growth in Q3. The major headwind here remains the company's core New York City market, where same-shack sales declined -2% y/y. That said, the company noted adverse weather impacts as driving declines.</p> <p class=\"paywall-full-content\">We note as well that deceleration is more the rule rather than the exception in the industry. Burger King (BK), arguably the company's largest pure-play competitor, though leaning in the fast food space instead of \"fast casual,\" saw comps decelerate to 5.8%, from 6.4% in Q3.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721674435400753_origin.png\" rel=\"lightbox\" data-width=\"1974\" data-height=\"556\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721674435400753_origin.png?io=w640\" alt=\"Burger King comps trends\" width=\"640\" height=\"180\" contenteditable=\"false\" data-width=\"640\" data-height=\"180\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721674435400753_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721674435400753_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721674435400753_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-17721674435400753_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\">Burger King comps trends <span>(Restaurant Brands Q4 results)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Meanwhile, Mediterranean chain CAVA barely grew comps at all, decelerating 140bps sequentially to 0.5%.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-1772167489951108.png?io=w640\" alt=\"CAVA comps trends\" width=\"610\" height=\"402\" contenteditable=\"false\" data-width=\"610\" data-height=\"402\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-1772167489951108.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-1772167489951108.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-1772167489951108.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">CAVA comps trends <span>(CAVA Q4 earnings deck)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Overall, we are beginning to see the market make an apparent shift toward promotion-oriented fast food brands. McDonald's (<a href=\"https://seekingalpha.com/symbol/MCD\" title=\"McDonald's Corporation\">MCD</a>) had the most successful Q4 of most restaurant chains, with U.S. comps accelerating to 6.8% in Q4.</p> <p class=\"paywall-full-content\">That said, we do think Shake Shack, especially with its chef-driven roots and higher quality, maintains a clear distinction versus fast food burgers. We're also encouraged by the fact that Shake Shack noted January comps improved to over 4%, indicating that Q1 same-shack sales may be positioned to recover back to Q3 levels. Per CEO Robert Lynch's remarks on the <a href=\"https://seekingalpha.com/article/4875347-shake-shack-inc-shak-q4-2025-earnings-call-transcript\">Q4 earnings call:</a></p> <blockquote class=\"paywall-full-content\"> <p> </p> <p>Finally, I would like to give some color on our strong start to the year. January same-Shack sales grew 4.3% year-over-year. Despite meaningful weather headwinds in January, we've nevertheless generated solid sales growth, fueled by continued traction in our in-app value platform, increased hours of operations in our Shacks and the launch of compelling culinary innovation.</p> <p>Our start to the year, coupled with the leadership team that we now have in place, gives me unwavering confidence that our plan is working.\"</p> </blockquote> <p class=\"paywall-full-content\">Meanwhile, Shake Shack's adjusted EBITDA margins remained roughly flat y/y at 14.0%, with adjusted EBITDA rising 20% y/y to $56.1 million.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-1772167411895772_origin.png\" rel=\"lightbox\" data-width=\"1654\" data-height=\"652\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-1772167411895772_origin.png?io=w640\" alt=\"Shake Shack adjusted EBITDA\" width=\"640\" height=\"252\" contenteditable=\"false\" data-width=\"640\" data-height=\"252\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/33427965-1772167411895772_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-1772167411895772_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-1772167411895772_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/33427965-1772167411895772_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\">Shake Shack adjusted EBITDA <span>(Shake Shack Q4 shareholder letter)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The company is still facing headwinds from higher food costs, particularly in beef. On top of this, a rising mix of Shake Shack's sales are via delivery platforms, increasing commission payments. However, the company's labor model, plus its gradual tilting toward smaller formats (which are both cheaper to run on an ongoing basis and cost $2 million to build, a 20% y/y reduction in startup costs), have helped the company to offset the impacts of inflation.</p> <h2 class=\"paywall-full-content\">Risks and key takeaways</h2> <p class=\"paywall-full-content\">Of course, there are risks here that we need to keep in mind. As previously mentioned, McDonald's has been continuing to take more market share with positive U.S. comps in the second half of 2025, reflecting a consumer that is increasingly tilting to promotional deals. Though Shake Shack and McDonald's sit in different dining categories, we note that Shake Shack may feel more pressure to drive more promotions in order to appeal to a cash-strapped consumer. This is stacked on top of the risk of rising beef prices, which the company expects to continue inflating at a high single digit pace in 2026 (partially offset by lower paper and packaging costs).</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">That said, I see more positives than risks in this stock, especially at a lower valuation multiple than most fast-casual peers and the strong signal from re-accelerating January same-shack sales. Stay long here.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/979313078/image_979313078.jpg",
            "link": "https://seekingalpha.com/article/4876091-shake-shack-tremendous-buy-as-january-comps-accelerate",
            "pub_date": "2026-02-27 16:21:01",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}