{
    "data": [
        {
            "id": "4876717",
            "title": "Silver Caught Between War Premium And Peace Crash Risk",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/146965981/image_146965981.jpg?io=getty-c-w630\" alt=\"Valuable trophy\" data-id=\"146965981\" data-type=\"getty-image\" width=\"1536\" height=\"1152\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/146965981/image_146965981.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/146965981/image_146965981.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/146965981/image_146965981.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/146965981/image_146965981.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/146965981/image_146965981.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/146965981/image_146965981.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/146965981/image_146965981.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/146965981/image_146965981.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\">The Silver Peace Prize</p> <p class=\"item-credits\">lili41/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>This is a defining moment for the commodities market, and if you’ve been watching the screens over the last week, you know the air is thick with tension. We are swinging between the \"War Premium\" and<span class=\"paywall-full-content\"> the \"Peace Pivot,\" and for the disciplined investor, volatility is where the real money is made. I’ve been calling this the </span><em class=\"paywall-full-content\"><strong>Silver Peace Prize</strong></em><span class=\"paywall-full-content\"> because IF the world celebrates a potential end to current conflicts, </span><strong class=\"paywall-full-content\">the market is about to hand us a once-in-a-generation entry point for silver, gold, and uranium miners.</strong></p> <p class=\"paywall-full-content\">Trump is finally closer to a deal in the Ukraine-Russia conflict, and Putin is at the table. We know the 47th President has his eyes on the Nobel Peace Prize, and that means a compromise with Iran is no longer a fringe theory; it’s a distinct possibility. Meanwhile, <strong>silver has spent the last year acting less like a metal and more like a high-beta fear gauge. It’s the VIX in physical form.</strong> If we get a handshake in Geneva or a breakthrough in the Middle East, the <em>safety trade</em> will unwind with the force of a hurricane.</p> <p class=\"paywall-full-content\">We’ve already seen the preview. When the \"Dmitriev Package\" leaked (you can read about it in my last article <a href=\"https://seekingalpha.com/article/4876324-petrodollar-2-0-why-russias-dollar-pivot-could-crash-gold-and-silver\">here</a>), that massive proposal to bring Russia back into the dollar system and the lower fuel prices that would ensue, silver didn’t just dip; it cratered to $74. When Mark Carney reportedly walked out of those tense tariff negotiations with Canada, we saw it snap back to $80. This volatility is a masterclass in psychological warfare. But here is the secret: once the war fear is gone and the political risk premium has forced silver and gold down, the market will wake up to a cold, hard physical reality.<strong> Even in a peaceful world, there simply isn't enough silver</strong> to power the AI data centers, the global solar rollout, and the next-gen defense industry. Furthermore, America still has to pay for its ballooning debts, putting a floor under gold.</p> <p class=\"paywall-full-content\">I’m looking for a <em>Peace Crash</em> to bring silver to the $65 to $68 range. There is strong historical support at $48. This should be the floor, $10 below the critical support where the bankers who are short finally get their cover and the smart money steps in. My limit orders are already set between $64 and $66.</p> <p class=\"paywall-full-content\">I won’t be caught up in the noise or the panic IF the PEACE with Iran headlines hit. I’m waiting for the <em>Sale of the Century</em> to buy silver miners because I know who is waiting on the other side of the world. Chinese markets. If silver is sitting at $65 while the West is panicking about the price drop, the Chinese Central Bank and private hoarders will gobble up every available ounce. I plan to have my bids filled before they even log in.</p> <p class=\"paywall-full-content\">In this scenario, <strong>my<em> Peace Price</em> buy list is ready</strong>. I’m looking at the high-beta juniors that get punished the most during these macro shocks. When silver drops 20%, these juniors can drop 40% or more on pure emotion. That is where you find the life-changing upside. I’m focusing on the <em>American Soil</em> plays and the high-grade Canadian explorers. IF the <em>Peace Prize</em> drama plays out, don't lose sight of the uranium and gold sectors; they will also fall, giving us the unique opportunity to buy and hold at lower prices.</p> <p class=\"paywall-full-content\"><strong>If the Iran talks fail, gold will snap back toward $5,500 very quickly.</strong> And if the Strait of Hormuz sees even a whisper of a blockade, oil and uranium will go through the roof. Iran’s primary leverage is its enrichment capability. If war starts, those facilities are the first targets, creating a<em> Nuclear Catalyst</em> that removes any hope of Iranian supply and forces global panic buying of yellowcake. In contrast, a future deal with Russia brings massive uranium back on line.</p> <p class=\"paywall-full-content\">The silver markets are currently in a tug-of-war between <em>scary news</em> and <em>hopeful news</em>, which is causing wild swings in the metal. If the US goes to war with Iran and silver tests much higher highs, I will take profits when silver hits $130 to $180, as I will also do on my uranium portfolio due to the unprecedented possibility of the deflation of the de-dollar trade as Putin negotiates selling oil to Europe in dollars again.</p> <p class=\"paywall-full-content\">But even if we get Putin’s \"Grand Bargain,\" AND a peace deal with Iran, I remain fundamentally, unshakably bullish on the metals for the long term.</p> <h2 class=\"paywall-full-content\">Here is why the Silver Bull isn't over:</h2> <ul class=\"paywall-full-content\"> <li><p><strong>The Physical Deficit:</strong> We are in a structural shortage that no Peace Treaty can fix. The world is using more silver than it mines for the sixth year in a row. In a war with Iran, industrial demand for silver (defense systems, electronics) spikes just as investors try to buy every physical ounce.</p></li> <li><p><strong>The Debt Disaster:</strong> U.S. debt-to-GDP is exploding. Neither party has the political will for austerity, and the <em>hidden tax</em> inflation is the only way out.</p></li> <li><p><strong>The AI &amp; Solar Hunger:</strong> AI hardware and high-voltage data centers are silver-hungry. You can't run the future on paper dollars; you need the physical conductivity of silver and uranium to fuel it.</p></li> <li><p><strong>BRICS and the Great Divorce:</strong> Even if Putin uses the dollar for a few years to stabilize his economy and the dollar, the move toward commodity-backed trade isn't stopping. China and Russia aren't going to stop gobbling up gold, silver, and uranium.</p></li> <li><p><strong>The Credit Crunch:</strong> We are looking at a shaky year as commercial real estate loans come due and regional banks are forced to mark-to-market and tech stocks come back down to earth. When the credit freeze happens, people will run back to the only assets with no counterparty risk.</p></li> </ul> <p class=\"paywall-full-content\">The <em>Dollar Strength</em> we will see from a Putin deal will be a headwind to the metals, not just a temporary political phenomenon. Yet, the scarcity of these metals is a permanent physical reality. I’m keeping my cash ready for the <em>Peace Floor</em> so I can buy the best silver miners in the world at a huge discount.</p> <p class=\"paywall-full-content\">To play this <em>Snap-Back</em>, I am focusing on the<em> Quality Tier</em> of the market, the companies that have shown the most resilience and have the highest probability of leading the charge back as silver rebounds to $125 and beyond.</p> <ul class=\"paywall-full-content\"> <li><p><strong>Wheaton Precious Metals (<a href=\"https://seekingalpha.com/symbol/WPM\" title=\"Wheaton Precious Metals Corp.\">WPM</a>):</strong> This has been the absolute standout of the year. While other miners have felt the sting of the recent crashes, Wheaton has held its ground. They have the cleanest exposure to silver prices without the mining inflation. They are the smart money bunker.</p></li> <li><p><strong>Hecla Mining (<a href=\"https://seekingalpha.com/symbol/HL\" title=\"Hecla Mining Company\">HL</a>):</strong> The largest producer in the U.S. Hecla. It's the poster child for American mineral independence. They have the margins to survive a dip to $60 but will explode when the war fear is replaced by industrial scarcity.</p></li> <li><p><strong>First Majestic Silver (<a href=\"https://seekingalpha.com/symbol/AG\" title=\"First Majestic Silver Corp.\">AG</a>):</strong> Shorted and volatile, this is the ultimate short squeeze candidate when the pivot happens. They will snap back very quickly.</p></li> <li><p><strong>Silvercorp Metals (<a href=\"https://seekingalpha.com/symbol/SVM\" title=\"Silvercorp Metals Inc.\">SVM</a>):</strong> They have consistently managed to keep costs low through the chaos. It’s a solid, high-yield play for those who want to hold through the macro shocks.</p></li> </ul> <h2 class=\"paywall-full-content\"><strong>Action I will be taking if war is declared on Iran</strong></h2> <p class=\"paywall-full-content\">The structural fracturing (<a href=\"https://www.investing.com/analysis/silvers-great-divorce-of-2026-why-the-100-breakout-is-just-the-beginning-200673833\" rel=\"nofollow\">The Great Divorce</a>) of the physical from the paper silver market is no longer a theory; with silver at $94 and the COMEX vaults compromised, <strong>we are witnessing a generational physical squeeze</strong>. According to<a href=\"https://www.livemint.com/market/commodities/silver-inventory-on-comex-falls-below-90-million-ounces-what-does-this-mean-for-investors-11771836981544.html\" rel=\"noopener\"> this week’s market analysis of official CME data</a>, registered silver inventories have plummeted below the critical 90 million ounce mark, while open interest exceeds available stock by over 400%. We are now in force majeure territory. If I see news that the COMEX has officially suspended trading or has moved to Cash Settlement Only, it will signal the final decoupling where the paper price fails and the value of physical metal and high-grade miners goes viral. I will be getting ready to sell quickly in the peak of the panic as this and war news sends the metals parabolic.</p> <p class=\"paywall-full-content\"><strong>My exit strategy is clear:</strong> I am holding my miners for the $130–$180 War Peak and will be harvesting gains as the mining equities inevitably catch up several days after the spot price surges as news of war breaks out. If silver hits $130, the liquidity vacuum will force the miners up vertically in a matter of hours. The physical reality of a 6-year deficit may finally break the paper manipulation. At the same time, a physical delivery crisis collides with a wartime supply deficit. <strong>The perfect storm will send gold and silver, the safe haven physical VIX parabolic.</strong></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Historically, once a commodity breaks its all-time high (the $122 level we hit in January), it enters Price Discovery. The first day silver gaps to $120, I expect the miners will be lagging. The move from $122 to $140 and beyond will be driven by FOMO and panic buying from short-sellers who are being liquidated. I will wait for the third day of the vertical move when the retail FOMO hits and people buy the miners because they can't find physical silver. I will also sell my uranium portfolio on the war premium due to the unprecedented possibility of the hit of future deflation of the de-dollar trade as Putin works with Trump to sell oil in US dollars again, propping up the greenback and pushing us unexpectedly towards petrodollar 2.0.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/146965981/image_146965981.jpg",
            "link": "https://seekingalpha.com/article/4876717-silver-caught-between-war-premium-and-peace-crash-risk",
            "pub_date": "2026-02-28 17:06:37",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876713",
            "title": "Sezzle: Small But Mighty, Buy With Earnings On Tap",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2145077716/image_2145077716.jpg?io=getty-c-w630\" alt=\"A woman paying something with her mobile phone\" data-id=\"2145077716\" data-type=\"getty-image\" width=\"1536\" height=\"1022\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2145077716/image_2145077716.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2145077716/image_2145077716.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2145077716/image_2145077716.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2145077716/image_2145077716.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2145077716/image_2145077716.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2145077716/image_2145077716.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2145077716/image_2145077716.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2145077716/image_2145077716.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Franci Leoncio/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Sezzle Inc. (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SEZL\" title=\"Sezzle Inc.\">SEZL</a></span>) just reported a huge <a href=\"https://investors.sezzle.com/financials/quarterly-reports/\" rel=\"nofollow\">Q4 earnings win</a> on what feels like the turning point for the buy now pay later (BNPL) payment platform firm. The company aims to give consumers flexible payment<span class=\"paywall-full-content\"> options at point-of-sale financing situations. Their core product allows shoppers to split purchases into interest‑free installment payments, making larger purchases more accessible without traditional credit card interest or long‑term debt obligations. The firm went public about two and a half years ago, and after a tremendous stock climb through the first half of 2025, it reached over $180 a share. On an initially sharp, now steady decline since last July, SEZL had been trading below $60 per share before this earnings call.</span></p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789722736_origin.png\" rel=\"lightbox\" data-width=\"751\" data-height=\"408\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789722736_origin.png?io=w640\" alt=\"gains\" width=\"640\" height=\"348\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789722736_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789722736_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789722736_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789722736_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">SEZL assumes the credit risk and pays merchants upfront, collecting payments from consumers over time. Typically, the consumer would pay for a quarter of the purchase, with the three additional quarter payments coming every two weeks thereafter. They target millennial and Gen Z consumers, a demographic that increasingly prefers short‑term, transparent financing over traditional credit options. I believe in the industry growth trends through BNPL that SEZL is a part of, and think they are a leader in the field. They are smaller compared to a few similar peers but have seen tremendous growth, efficiently profitable operations, and customer and subscription strength. I rate SEZL a buy.</p> <h2 class=\"paywall-full-content\">What’s Caused the Correction? (Risk)</h2> <p class=\"paywall-full-content\">I normally end my articles with a risk perspective, but here let’s see what has caused much of this correction and where the risk lies. In August, SEZL reported very strong Q2 results, and immediately saw its stock price tumble over 30% as a major sell off took place with investors taking their profits and running for the hills. Volume was unusually high and seemed to flip the script for the stock moving forward.</p> <p class=\"paywall-full-content\">Outside of standard stock movement, broader industry trends and investor sentiment have weighed on the stock. The BNPL sector has matured in recent years but still has plenty of room to gain the trust of investors. There is always credit risk with consumers, especially the higher-risk customers that SEZL often loans to. Managing defaults carefully will always be important, but so far has not created any issues for the firm. Economic headwinds, credit volatility, and merchant adoption are key factors that investors need to watch for SEZL. The fintech space is highly competitive, but after a deep dive on trends, numbers, and strong forecasts, I still think SEZL is in a good spot.</p> <h2 class=\"paywall-full-content\">Users Not Slowing Here</h2> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/49307751-177210817928154_origin.png\" rel=\"lightbox\" data-width=\"1552\" data-height=\"770\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/49307751-177210817928154_origin.png?io=w640\" alt=\"users\" width=\"640\" height=\"318\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/49307751-177210817928154_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/49307751-177210817928154_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/49307751-177210817928154_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/49307751-177210817928154_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>SEZL</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Active consumers hit over 3 million for the first time this quarter and were up 2.6% from Q3, and 12% YoY. Monthly subscribers and number of transactions were both up massively on the year as gross merchandising volume reached an all-time quarterly high of $1.2 billion. The subscriber growth has been driven by their Premium and Anywhere subscriptions, which offer flexible payment options and a reward program. The number of merchants shopped is up big YoY, but was down slightly from Q3, so keep an eye on merchant growth trends moving forward, to make sure this doesn't stall.</p> <h2 class=\"paywall-full-content\">Q4 Outburst</h2> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789046657_origin.png\" rel=\"lightbox\" data-width=\"861\" data-height=\"487\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789046657_origin.png?io=w640\" alt=\"rev\" width=\"640\" height=\"362\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789046657_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789046657_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789046657_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789046657_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Stock Story</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Adjusted EPS came in at $1.21, blowing out analyst expectations, and up from $0.73 last year. Revenue was a record $130 million, up 32.2% on the year. You can see above how quickly sales growth has been in the last two years or so. Transaction-related costs as a percentage of revenue were down this quarter, as management notes AI-driven efficiency and strong marketing strategy results. Operating expenses grew by only 10.8%, leading to a massive 79% YoY gain in operating income to $55.2 million for Q4 and an improved operating margin to 42.5%. Full-year adjusted net income nearly doubled in 2025, reaching $128.4 million. Unpacking the Q4 and full-year numbers gets more impressive the deeper you go.</p> <h2 class=\"paywall-full-content\">Peers, Value, and Profits</h2> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754790168626_origin.png\" rel=\"lightbox\" data-width=\"877\" data-height=\"360\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754790168626_origin.png?io=w640\" alt=\"peers\" width=\"640\" height=\"263\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754790168626_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754790168626_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754790168626_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754790168626_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">By market cap, SEZL is a lot smaller than many other payment processing peers. It’s obvious in the chart above the volatility the stock has seen, but it is the only one of the group in the green over the last year.</p> <p class=\"paywall-full-content\">SEZL has a forward-looking PE ratio of just under 18x. This is above the sector median, but lower than all the peers in this group outside of the behemoth in PYPL. From a historical valuation standpoint, SEZL is discounted by over 3x from its price peak last summer. The stock is at a major discount right now. It hasn’t been this low since the stock broke out in early 2025; it’s lower than many peers in the industry, and lower than the broader market average.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789776773_origin.png\" rel=\"lightbox\" data-width=\"866\" data-height=\"206\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789776773_origin.png?io=w640\" alt=\"margins\" width=\"640\" height=\"152\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789776773_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789776773_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789776773_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/23/49307751-17718754789776773_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Macrotrends</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Profits are not a problem for SEZL. Gross margin is at all-time highs, north of 80%, near double that of the peers seen above. Net income margin is 27.65%, with the closest competitor being PYPL at 15.78%.</p> <p class=\"paywall-full-content\">Total cash is much less than its larger peers, naturally by size. However, SEZL has managed their debt intelligently and has seen a great impact on the balance sheet. They have reduced their debt to equity from about 98% to recently roughly 76% over the last 5 years or so. Their current and quick ratios both hovered between 1.0 and 2.0 for years. Over the last 5 quarters or so, this has emerged above 3.0 for each metric. If SEZL can continue its cash from operations trend, while allocating cash as expenditures appropriately, this gap will continue to widen. Cash from operations was $154.3 million in Q4, light-years above any other quarter they have reported.</p> <h2 class=\"paywall-full-content\">Conclusion</h2> <p class=\"paywall-full-content\">SEZL took another big leap with their Q4 earnings report. Sales and subscription growth are rapid. Customer retention and user expansion remain solid as much of the industry has seen slowing. Operations are running on all cylinders, with margins hitting all-time highs and smashing all of their larger scale peers. Management has already forecasted that 2026 will see another 25%-30% increase in revenue, and a 32% hike in year-end adjusted net income.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">There is risk in the BNPL space. Credit, economic headwinds, lowering merchant adoption and trust, are possibilities that can halt this field. But, if you’re looking for a growth opportunity, there is a lot to like about SEZL. The stock trades at a big discount, profits are being generated with ease, and management forecasts are confident. I think the script has been flipped for SEZL, and this stock is poised to make a strong run this year ahead.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2145077716/image_2145077716.jpg",
            "link": "https://seekingalpha.com/article/4876713-sezzle-small-but-mighty-buy-with-earnings-on-tap",
            "pub_date": "2026-02-28 16:55:51",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876723",
            "title": "Weekly Commentary: Sometimes Not Liquid At All",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214651343/image_2214651343.jpg?io=getty-c-w630\" alt=\"Emerging Financial Data - Stock Market, Prosperity, Bull Market - Blue Version\" data-id=\"2214651343\" data-type=\"getty-image\" width=\"1536\" height=\"864\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214651343/image_2214651343.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214651343/image_2214651343.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214651343/image_2214651343.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214651343/image_2214651343.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214651343/image_2214651343.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214651343/image_2214651343.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214651343/image_2214651343.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214651343/image_2214651343.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"></p> <p class=\"item-credits\">DKosig/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Crisis dynamics gained important momentum this week.</p> <p>\"Blue Owl Shares Post Worst Month Ever on Private Credit Fears.\" \"KKR BDC Slides on Rise in Troubled Loans.\" \"BlackRock Private Debt Fund Slumps After Slashing Dividend.\" \"Apollo's MFIC Slashes Dividend, Marks<span class=\"paywall-full-content\"> Down Assets, Announces $100M Buyback.\" \"Private Credit Firm Invico Calls Investors to Manage Exodus Risk.\" \"No Fed, No Safety Net: Why Private Credit's First Real Recession Will be its Moment of Truth.\" \"Blackstone Private Debt Fund Sees More Stress in Software Assets.\" \"Bain Warns Software Default Rate Risks Hitting Double Digits.\" \"Blackstone's Schwarzman Reaped Near-Record $1.24 Billion in 2025.\"</span></p> <p class=\"paywall-full-content\">Blue Owl's 2.4% decline this week pushed y-t-d (2-month) losses to 29.4%. KKR sank 13.3% (down 31.2% y-t-d), Ares Management 9.1% (down 30.7%), Apollo Management 12.6% (down 27.7%), and Blackstone 6.5% (down 26.5%). These stocks are sending a strong Credit cycle signal.</p> <p class=\"paywall-full-content\">Bloomberg: \"Bank Shares Walloped by More 'Cockroach' Credit Woes, AI.\" \"Banks Trade Like We're in the Midst of Crisis.\"</p> <p class=\"paywall-full-content\">Ominously, the KBW Bank Index sank 5.9% this week, boosting losses from February 10th highs to double digits (10.4%). It was the index's largest decline since 'liberation day' week (April 4th). PNC Financial dropped 8.9% this week, Wells Fargo 8.2%, Zions Bancorp 8.4%, Goldman Sachs 6.8%, Bank of America 6.1%, Morgan Stanley 5.1%, Citigroup 5.0%, and JPMorgan 3.4%. The Broker/Dealer Index fell 2.4%, with losses since February 10th at 7.9%. The KBW Index's 5.1% Friday slump was the largest single day decline since April 4th.</p> <p class=\"paywall-full-content\">Concerns were not limited to the goliath \"money center banks\". The KBW Regional Bank Index was clobbered 7.1% this week, with losses from February 9th highs at 10.0%.</p> <p class=\"paywall-full-content\">Key individual bank CDS prices posted their largest gains since April. Morgan Stanley CDS surged 11 bps to a nine-month high of 66 bps - the biggest move since \"liberation day.\" Citigroup CDS rose eight to 61 bps; Goldman Sachs seven to 64 bps; Wells Fargo five to 54 bps; Bank of America five to 60 bps; and JPMorgan four to 45 bps - all to highs since November.</p> <p class=\"paywall-full-content\">February 26 - Bloomberg (Constantine Courcoulas, Donal Griffin, and Scott Carpenter): \"As Market Financial Solutions Ltd. hurtled toward collapse in London, the setting was new, but the themes felt familiar. Like US auto lender Tricolor Holdings, MFS was a nonbank finance firm looking to fill a gap that major banks had ignored or shunned, while tapping those Wall Street giants for the cash to do it. And like auto parts supplier First Brands Group, the banks took comfort in tangible collateral, only for accusations of double-pledging to rattle that assurance. Even some of the names were the same: Banco Santander SA and Jefferies Financial Group Inc. - both stung by First Brands in recent months - are once again scrambling to recoup whatever money they can from an embattled company. This time, they're alongside the likes of Apollo Global Management Inc.'s Atlas SP Partners, Barclays Plc, Wells Fargo &amp; Co. and Castlelake LP. 'For the last six months the market has been constantly talking about how to prevent fraud,' said Nicole Byrns, founder of asset-based finance fund Dumar Capital Partners. 'Task forces have been put together. New anti-fraud products have developed. And yet this shows how there may still be weaknesses in the ability to spot it'.\"</p> <p class=\"paywall-full-content\">February 26 - Bloomberg (Constantine Courcoulas and Donal Griffin): \"Barclays Plc and Atlas SP Partners are among Wall Street firms that helped arrange more than £2 billion ($2.7bn) of loans to a UK mortgage-finance company that has unraveled amid allegations of financial irregularities. Market Financial Solutions Ltd., or MFS, collapsed into a UK form of insolvency Wednesday, with the judge overseeing the case citing accusations of fraud and double-pledging of assets. Barclays and Atlas, the structured-credit arm of Apollo Global Management Inc., each lent hundreds of millions of dollars. Jefferies Financial Group Inc., Banco Santander SA, Wells Fargo &amp; Co. and Castlelake LP are also among the lenders…\"</p> <p class=\"paywall-full-content\">International cockroach sightings. European (subordinated) bank CDS jumped seven Friday to 101 bps - the biggest daily move in five months.</p> <p class=\"paywall-full-content\">Signaling serious trouble, U.S. leveraged loan prices sank 80 cents this week to 94.57 - the low since April 9th - and only 16 cents off \"liberation day\" period lows. Loan prices were down $1.17 during February, the worst month since September 2022 (UK gilt deleveraging crisis).</p> <p class=\"paywall-full-content\">High yield CDS surged 24 this week to a three-month high of 331 bps - the largest weekly gain since October 10th (up 25 bps on China trade war worries). Oracle CDS jumped seven to 164 bps - up 112 bps in five months to the high since the Great Financial Crisis.</p> <p class=\"paywall-full-content\">Treasuries enjoyed notable safe haven demand. Ten-year Treasury yields sank 15 bps to a four-month low of 3.94%. Five-year Treasury yields fell 15 bps to an almost 17-month low of 3.50%, and two-year yields dropped 10 bps to 3.37% - the low back to August 2022. High yield spreads-to-Treasuries widened 21 this week to a three-month high 291 bps - the largest increase since October. Interestingly, investment-grade spreads caught fire this week. The seven bps increase was the largest widening since \"liberation day\" (to a 3-month high 291bps).</p> <p class=\"paywall-full-content\">February 24 - Bloomberg (Yash Roy and Bruce Douglas): \"A few weeks ago, analysts at UBS Group AG laid out a worst-case scenario for defaults in the private credit sector. Their outlook just became more grim. Strategists including Matthew Mish say private credit could see default rates surge as high as 15%, two percentage points more than the firm forecast less than a month ago, if artificial intelligence triggers an 'aggressive' disruption among corporate borrowers. 'What is new: a clearer catalyst - rapid, severe AI disruption,' according to the UBS strategists... Direct lenders that took a lead role in financing software companies in recent years now look dangerously exposed to AI's impact, stirring comparisons to the 2008 financial crisis. Some estimates suggest that the firms have 40% of all sponsor-backed loans tied up in the software industry.\"</p> <p class=\"paywall-full-content\">\"What is new: a clearer catalyst - rapid, severe AI disruption.\" It's certainly reasonable to target AI disruption risk as a catalyst. The critical unfolding issue is destabilizing tightening of Credit and liquidity conditions that commenced with last fall's late-cycle cockroach sightings (i.e., First Brands and Tricolor). Late-cycle high-risk lending is inherently susceptible to abrupt shifts in perceptions. Notions of endless marketplace liquidity ensure loose Credit standards and aggressive lending - and consequences.</p> <p class=\"paywall-full-content\">Yields associated with high-risk lending offer exceptional profit opportunities throughout the daisy chain of Wall Street loan intermediation - lending, structured finance, leveraged speculation, insurance, and asset management. So-called \"private Credit\" ranks high on the list of history's greatest high-risk lending and speculative Bubbles. And as financial flows inundated the sector, \"subprime\" corporate Credit enjoyed an extended period of unprecedented access to finance. This boom held delinquencies and defaults at artificially low levels. Investor/speculator returns remained artificially elevated - providing Wall Street quite an earnings bonanza. Things, as they will do, got way out of hand.</p> <p class=\"paywall-full-content\">February 23 - Axios (Emily Peck): \"Private credit was hot, and now it's not. That has some parts of the financial world on edge. A few trends - the AI scare trade and the retail investing boom - are colliding at once and stressing a trillion-dollar-plus piece of the economy… Facing high demand from investors in one of its funds to get their money back, Blue Owl sold off assets. It also changed the way redemptions at the fund operate, setting off alarm bells. Asset managers like Blue Owl, as well as better-known firms like Blackstone and KKR, take in money from investors to create funds that typically lend to mid-market businesses, like smaller nonpublic companies that don't issue high-grade bonds. That investor money gets locked up for a while. Historically, that was OK because investors were often deep-pocketed institutional types, insurance companies or pension funds not apt to need to cash out very often. The dynamic started shifting about five years ago when retail stock investing started booming, and everyone seemingly had a Robinhood account and a stock strategy.\"</p> <p class=\"paywall-full-content\">The week further confirmed that the high-risk lending cycle has decisively turned. At this point, everything seems to point to a breakdown in high-risk loan intermediation - the miracle of Wall Street Alchemy. Myriad risks have been revealed, speculative flows have reversed, liquidity dynamics have deteriorated, Credit has tightened at the margin, and Credit issues have begun to materialize in earnest.</p> <p class=\"paywall-full-content\">February 26 - Bloomberg (Olivia Fishlow): \"A private credit fund overseen by Apollo Global Management Inc. cut its dividend and marked down the value of its assets amid signs of strain in parts of its loan book. MidCap Financial Investment Corp., a business development company focused on direct lending, lowered its quarterly payout to 31 cents a share from 38 cents and wrote down its portfolio by about 3%, citing weakness in a handful of older investments and a reassessment of its long-term earnings power as interest rates shift.\"</p> <p class=\"paywall-full-content\">February 24 - Bloomberg (Rachel Graf and Olivia Fishlow): \"A potential migration of private credit loans from public business development companies into opaque debt vehicles could cause leverage to balloon tenfold while masking risk, Citigroup Inc. analysts warned. BDCs, which are facing pressure to pay back investors, can seek relief in selling assets to collateralized loan obligations, which are financed with long-term funding that cannot be withdrawn on short notice. But such a shift would trade public transparency for a much more leveraged and secretive structure, the analysts said... 'This migration increases opacity in aggregate leverage in the ecosystem and dependencies amongst private credit, insurers, and securitization,' Michael Anderson, Citigroup's global head of credit strategy, wrote... 'The public portfolio transparency that we have from BDCs would also be lost'.\"</p> <p class=\"paywall-full-content\">February 25 - Bloomberg (Edward Clark, Preeti Singh and Olivia Fishlow): \"A publicly-traded private credit fund managed by Blackstone Inc. said that it's seeing continued signs of stress in one of its largest investments - software company Medallia Inc. The Blackstone Secured Lending Fund has now marked the loan to Medallia at around 78 cents on the dollar…\"</p> <p class=\"paywall-full-content\">February 21 - Bloomberg (Scott Carpenter and Rachel Graf): \"Fear of rising defaults is spreading from the leveraged loan market to some of the retail funds that ultimately buy the debt as investors get choosier about taking on credit risk. The biggest buyers of leveraged loans are money managers that bundle the debt into bonds known as collateralized loan obligations. Some retail funds that buy the riskiest parts of CLOs, known as CLO equity, are slashing their dividends as loan yields fall and anxiety about future defaults mounts. Investors are responding by heading for the exits. Share prices of a handful of closed-end funds, including ones backed by the billionaire Koch family and Carlyle Group Inc., fell to all-time lows this week.\"</p> <p class=\"paywall-full-content\">February 25 - Bloomberg (Ameya Karve): \"Investors and managers are growing more cautious on collateralized loan obligations after a software-driven selloff in US leveraged loans eroded bond valuations, panelists said at SFVegas on Feb. 24. Refinancing risk has become the market's primary concern, even for borrowers still generating double-digit revenue growth. The resulting selling has been broad, sweeping up stronger credits… Roughly 15% of CLO collateral is tied to software, increasing to about 20% in private credit CLOs. Panelists flagged potential rating actions as the next catalyst as several loans will see pressure to refinance by the end of the year.\"</p> <p class=\"paywall-full-content\">As high-risk lending booms go, this one seemed to last for an eternity. And as things over recent years went to blow-off extremes, Wall Street shifted its focus to unsuspecting \"retail\" flows oblivious to Credit and liquidity risks.</p> <p class=\"paywall-full-content\">February 26 - Bloomberg (Allison McNeely): \"Carlyle Group Inc. Chief Executive Officer Harvey Schwartz suggested that asset managers should have been more forthcoming about the relative illiquidity of investment funds sold to individual investors. 'The industry did itself a bit of a disservice calling the vehicles semi-liquid,' Schwartz said... 'We just should have called them 'sometimes not liquid at all.' The industry's push into retail wealth has attracted scrutiny over whether private investments are appropriate for individuals… Retail products are sometimes marketed as 'semi-liquid' because they allow quarterly or monthly redemptions until they hit a certain limit.\"</p> <p class=\"paywall-full-content\">\"Sometimes Not Liquid at All\" is an almost unalarming comment with alarming ramifications. Crises erupt when the perception of safety and liquidity is suddenly recognized as a misperception. Traditionally, bank deposits and money market instruments have been the epicenter of the shocking and destabilizing realization that what was believed safe and liquid \"money\" was instead a risk asset vulnerable to significant losses.</p> <p class=\"paywall-full-content\">During the mortgage finance Bubble period, I highlighted mounting risks associated with the \"moneyness of Credit\" - in particular the perception of safety and liquidity for \"AAA\" MBS, ABS, mortgage derivatives, and structured finance (i.e., CDOs/CLOs). Over the global government finance Bubble period, I've often referred to the \"moneyness of risk assets.\" Decades of Fed/government market backstops, liquidity injections and unending loose conditions ensured the perception of safety and liquidity for an ever wider swath of financial assets - certainly including shares of thousands of ETFs across various asset classes.</p> <p class=\"paywall-full-content\">February 23 - Associated Press (Alex Veiga): \"For years, individual investors were dismissed by some on Wall Street as 'dumb money.' That typically referred to those prone to trading on hype, or chasing trends rather than company or industry fundamentals, or responding late to big market moves… These investors… accounted for $5.4 trillion in trading activity in 2025 across stocks and exchange-traded funds, or ETFs, according to Vanda, an independent data and research firm. That's a nearly 47% increase from the previous year and the most going back to at least 2014.\"</p> <p class=\"paywall-full-content\">February 24 - Reuters (Suzanne McGee): \"Nearly 90% of all the trading in leveraged single-stock ETFs in the U.S. market can be traced to transactions by individual investors, according to… Direxion... The data shows that the proliferation of these exchange-traded vehicles, which allow investors to speculate on short-term moves in an underlying stock, has been almost entirely driven by their allure for these retail investors. The study also found that last year trading in the leveraged single-stock ETFs accounted for 8% of total trading on all U.S. exchanges.\"</p> <p class=\"paywall-full-content\">Way too much Credit and liquidity risk has been distributed to the ETF complex. This will come back to haunt system stability. And it's interesting to read about the recent forced loan sales from troubled \"private Credit\" vehicles sold to entities that appear ready to shift this risk to CDOs (collateralized debt obligations) and other structured Credit products. Sure brings back memories of 2007/2008.</p> <p class=\"paywall-full-content\">February 23 - Bloomberg (Silas Brown, Olivia Fishlow, Leonard Kehnscherper and Ellen DiMauro): \"Blue Owl Capital Inc.'s co-chief reeled off all the times he'd seen this type of fear before. Covid. Silicon Valley Bank's collapse. Liberation Day. Marc Lipschultz was addressing analysts on the 11th straight day of losses for the firm's shares, the worst streak since Blue Owl went public almost five years ago… But as Lipschultz saw it, this was par for the course when markets get jittery… It appears different now. Blue Owl last week permanently shut the gates on one of those funds - preventing investors from withdrawing their cash every three months as they'd previously been allowed - and began selling assets to return investor capital. It's the latest sign of tumult in a $1.8 trillion market… 'The red flags we are seeing in private credit today are strikingly familiar to those of 2007,' said Orlando Gemes, chief investment officer of Fourier Asset Management. He pointed to worsening lender protections and convoluted liquidity terms that 'obscure the mismatch between what investors believe they own and what they can actually exit'.\"</p> <p class=\"paywall-full-content\">Understandably, Blue Owl's Marc Lipschultz and others would like to believe that current \"private Credit\" instability is similar to market challenges previously surmounted - i.e., Covid, SVB, \"liberation day,\" etc. But today's backdrop is strikingly different.</p> <p class=\"paywall-full-content\">I'll posit that those past episodes were characterized by bouts of speculative deleveraging and attendant liquidity issues that risked bursting inflating Bubbles in high-risk leveraged lending and \"private Credit.\" Deleveraging was reversed, and it was repeatedly off to the races.</p> <p class=\"paywall-full-content\">It's the opposite today. Importantly, faltering high-risk lending markets are at the cusp of triggering speculative deleveraging. The resolution of deleveraging risk will not today resolve leveraged lending and \"private Credit\" issues. Meanwhile, the unfolding de-risking/deleveraging dynamic will significantly exacerbate high-risk lending and liquidity risks.</p> <p class=\"paywall-full-content\">February 24 - Bloomberg (Caleb Mutua, Jeannine Amodeo and Aaron Weinman): \"Leveraged-loan traders are slashing their exposure to software debt - much of which entered 2026 priced at or near par - in a sign of how artificial-intelligence fears are rippling across the market. Broadly syndicated loans for software businesses… had slumped between 1 to 3 points in the secondary market from Friday to Tuesday… Those loans were all being quoted around 100 cents on the dollar as of Dec. 31.\"</p> <p class=\"paywall-full-content\">February 24 - Bloomberg (Tasos Vossos): \"An 'AI bubble' is the biggest concern of credit investors for the first time ever, according to a survey among Bank of America Corp.'s clients. 'Few worry about geopolitics or a central bank policy error,' BofA strategists… wrote... Some 23% of survey's investment-grade respondents saw the threat of an AI bubble as their top concern, up from 9% in BofA's previous survey in December. Worries over a potentially unsustainable surge in investment and valuations of AI companies overtook 'Bubbles in Credit' as the top concern… Anxiety over trade tensions and a global recession had also been seen as the biggest perceived risk during 2025.\"</p> <p class=\"paywall-full-content\">February 26 - Financial Times (George Steer and Rachel Rees): \"Investors are riding out the 'whack-a-mole' software sell-off by loading up on protection against volatility and exploiting the divergence in sectors tipped to be either winners or losers from AI's advance. Some of Wall Street's biggest players are turning to complex options and hedging strategies to navigate a market buffeted by blog posts and headlines that have recently wiped tens of billions of dollars off the value of some of the S&amp;P 500's largest tech groups.\"</p> <p class=\"paywall-full-content\">There are parallels between today's faltering \"subprime\" Bubble and 2007. Subprime blowup ramifications were widely dismissed throughout 2007 and into 2008. Not appreciated was how high-risk mortgage lending had evolved to become the key marginal source of Credit sustaining housing Bubble inflation in key markets - and how huge quantities of risky loans had been intermediated into perceived safe instruments. The collapse of subprime lending and loan intermediation triggered a dramatic tightening in Credit conditions at the \"periphery.\" Mounting housing inventories and falling prices led to a contagious crisis of confidence in mortgage finance more generally (subprime to Alt-A to prime). The harsh realization of Trillions of mispriced mortgage Credit instruments unleashed powerful crisis dynamics.</p> <p class=\"paywall-full-content\">Today, the systemic importance of \"private Credit\" is similarly dismissed, despite markets for leveraged loans and high-risk lending having inflated so far beyond the subprime mortgage market.</p> <p class=\"paywall-full-content\">Importantly, today's deteriorating Credit market is on a collision course with the AI mania and arms race. I couldn't help but associate the poor response to blockbuster Nvidia earnings as confirmation that the market is increasingly questioning the viability of financing requirements for a $3 TN plus AI investment boom. The bottom line is AI finance is high risk, and the marketplace is already chin deep in risky Credit.</p> <p class=\"paywall-full-content\">South Korean stocks were up another 7.5% this week (48% y-t-d), with Japan's Nikkei Index (up 16.9%) and the Shanghai Composite (4.9%) higher by 3.6% and 2.0%. UK's FTSE 100 rose 2.1%, while European equities for the most part enjoyed another solid week. Global liquidity remains abundant. But liquidity issues lurk.</p> <p class=\"paywall-full-content\">The MAG7 Index was down another 1.8% this week, with the index now 6.8% lower y-t-d - to a level it traded at back in mid-September. Bitcoin was $2,000 lower for the week to $65,800, having lost almost half its value from October highs. Liquidity overabundance may persist globally, but speculative deleveraging has begun to gather momentum. Credit tightening fears are enveloping the tech/AI Bubble. And the historic AI Bubble has inflated to dominate the stock market, an equities Bubble integral to the entire maladjusted and over-indebted U.S. economy. This week's $171 gold price advance and 10.8% silver surge corroborate the acute financial structure fragility thesis.</p> <p class=\"paywall-full-content\">February 25 - Financial Times (Claire Jones and Ian Smith): \"Global debt surged by almost $29tn to a record $348tn last year, according to an influential think-tank that expects the burden to worsen in the coming years as governments increase spending on areas such as defence. The Institute of International Finance said… governments' investments in national security were the primary driver behind last year's $28.8tn rise, with spending on AI and similar technologies also contributing to what was the biggest annual increase in the global debt burden since the Covid-19 pandemic. The IIF figures, which combine the debt burden for governments, companies and households, also showed that, as a share of global output, global debt ratios declined for a fifth consecutive year to around 308% of GDP. The debt-to-GDP ratio is seen as a vital indicator of borrowers' capacity to honour their obligations.\"</p> <p class=\"paywall-full-content\"><strong>For the Week:</strong></p> <p class=\"paywall-full-content\">The S&amp;P 500 slipped 0.4% (up 0.5% y-t-d), and the Dow declined 1.3% (up 1.9%). The Utilities rallied 3.1% (up 11.3%). The Banks sank 5.9% (down 3.0%), and the Broker/Dealers slumped 2.4% (down 0.1%). The Transports dipped 0.8% (up 13.4%). The S&amp;P 400 Midcaps declined 0.9% (up 8.2%), and the small cap Russell 2000 fell 1.2% (up 6.1%). The Nasdaq 100 slipped 0.2% (down 1.1%). The Semiconductors lost 2.0% (up 14.3%). The Biotechs added 0.2% (up 1.5%). With bullion jumping $171, the HUI gold index surged 9.6% (up 39.5%).</p> <p class=\"paywall-full-content\">Three-month Treasury bill rates ended the week at 3.575%. Two-year government yields dropped 10 bps to 3.37% (down 10bps y-t-d). Five-year T-note yields fell 15 bps to 3.50% (down 22bps). Ten-year Treasury yields dropped 15 bps to 3.94% (down 23bps). Long bond yields fell 11 bps to 4.61% (down 23bps). Benchmark Fannie Mae MBS yields declined eight bps to 4.81% (down 24bps).</p> <p class=\"paywall-full-content\">Italian 10-year yields fell seven bps to 3.27% (down 28bps y-t-d). Greek 10-year yields declined seven bps to 3.27% (down 17bps). Spain's 10-year yields dropped nine bps to 3.06% (down 23bps). German bund yields fell nine bps to 2.64% (down 21bps). French yields declined eight bps to 3.22% (down 35bps). The French to German 10-year bond spread widened about one to 58 bps. U.K. 10-year gilt yields sank 12 bps to 4.23% (down 25bps). U.K.'s FTSE equities index rose 2.1% (up 9.8% y-t-d).</p> <p class=\"paywall-full-content\">Japan's Nikkei 225 Equities Index surged 3.6% (up 16.9% y-t-d). Japan's 10-year \"JGB\" yields were unchanged at 2.12% (up 5bps y-t-d). France's CAC40 increased 0.8% (up 5.3%). The German DAX equities index was little changed (up 3.2%). Spain's IBEX 35 equities index gained 1.0% (up 6.1%). Italy's FTSE MIB index rose 1.6% (up 5.0%). EM equities were mixed. Brazil's Bovespa index declined 0.9% (up 17.2%), while Mexico's Bolsa index was unchanged (up 11.0%). South Korea's Kospi surged another 7.5% (up 48.2%). India's Sensex equities index dropped 1.8% (down 4.6%). China's Shanghai Exchange Index rose 2.0% (up 4.9%). Turkey's Borsa Istanbul National 100 index declined 1.6% (up 21.8%).</p> <p class=\"paywall-full-content\">Federal Reserve Credit declined $6.6 billion last week to $6.570 TN, with a 11-week rise of $79.7 billion. Fed Credit was down $2.320 TN from the June 22, 2022, peak. Since the September 11, 2019 restart of QE, Fed Credit has expanded $2.843 TN, or 76%. Fed Credit inflated $3.759 TN, or 134%, since November 7, 2012 (694 weeks). Elsewhere, Fed holdings for foreign owners of Treasury, Agency Debt sank $26.3 billion last week to $3.075 TN. \"Custody holdings\" were down $200 billion y-o-y, or 6.1%.</p> <p class=\"paywall-full-content\">Total money market fund assets (MMFA) gained $17.1 billion to $7.791 TN - with a 32-week surge of $776 billion, or 18.0% annualized. MMFA were up $868 billion, or 12.5%, y-o-y - having ballooned a historic $3.206 TN, or 70%, since October 26, 2022.</p> <p class=\"paywall-full-content\">Total Commercial Paper added $2.5 billion to $1.407 TN. CP expanded $100 billion, or 7.6%, y-o-y.</p> <p class=\"paywall-full-content\">Freddie Mac 30-year fixed mortgage rates dipped another three bps to 5.98% (down 78bps y-o-y) - the low since September 2022. Fifteen-year rates rose nine bps to 5.44% (down 50bps). Bankrate's survey of jumbo mortgage borrowing costs had 30-year fixed rate down six bps to 6.27% (down 77bps).</p> <p class=\"paywall-full-content\"><strong>Currency Watch:</strong></p> <p class=\"paywall-full-content\">February 24 - Financial Times (Ian Smith, Kate Duguid and Nic Fildes): \"The Australian dollar, Norwegian krone and New Zealand dollar have surged ahead of other major currencies this year, as foreign exchange markets point to a change in the direction of global interest rates from cuts to rises. The Aussie has gained more than 6% against the US dollar this year, taking it to around a three-year high, as the Reserve Bank of Australia this month kicked off what many analysts expect to be a new cycle of rate increases in response to a burst of inflation… The New Zealand dollar has jumped 4% as traders anticipate the country's first rate rise in the coming months, while the krone is up 6% as an unexpected increase in inflation last month led traders to price in a small chance of a rate increase in the first half of the year.\"</p> <p class=\"paywall-full-content\">For the week, the U.S. Dollar Index slipped 0.2% to 97.608 (down 0.7% y-t-d). On the upside, the Brazilian real increased 1.0%, the Swiss franc 0.8%, the South African rand 0.6%, the Australian dollar 0.5%, the South Korean won 0.5%, the New Zealand dollar 0.4%, the Swedish krona 0.3%, the Canadian dollar 0.3%, the euro 0.2%, the Singapore dollar 0.2%, and the Norwegian krone 0.2%. On the downside, the Japanese yen declined 0.6%, and the Mexican peso 0.5%. China's (offshore) renminbi increased 0.62% versus the dollar (up 1.83% y-t-d).</p> <p class=\"paywall-full-content\"><strong>Commodities Watch:</strong></p> <p class=\"paywall-full-content\">February 22 - Financial Times (Jamie Smyth): \"One of the largest suppliers of enriched uranium fuel to US nuclear power plants has warned of a looming supply crunch because of fast-rising demand and a ban on Russian imports. Centrus Energy chief executive Amir Vexler told the FT the company is racing to build enrichment capacity at its Ohio plant to meet a $2.3bn backlog in sales of enriched uranium to customers... 'It is my strong belief that there is a gap between supply and demand for the existing market - just the operating reactors that we have now,' said Vexler, adding that plans to build new fleets of large and small reactors in the US would pose longer-term challenges.\"</p> <p class=\"paywall-full-content\">The Bloomberg Commodities Index gained 1.7% (up 10.9% y-t-d). Spot Gold rose 3.4% to $5,279 (up 22.2%). Silver ran 10.8% higher to $93.7867 (up 30.9%). WTI Crude added 54 cents, or 0.8%, to $67.02 (up 17%). Gasoline jumped 4.0% (up 21%), while Natural Gas sank 6.2% to $2.859 (down 22%). Copper rose 2.7% (up 7%). Wheat jumped 3.1% (up 17%), and Corn gained 2.6% (unchanged). Bitcoin fell $2,000, or 3.0%, to $65,830 (down 24.9%).</p> <p class=\"paywall-full-content\"><strong>Market Instability Watch:</strong></p> <p class=\"paywall-full-content\">February 24 - Bloomberg (Edward Bolingbroke): \"Traders in US futures and options markets are piling on bets that the Federal Reserve will continue cutting rates into next year instead of raising them. Futures spreads linked to the Secured Overnight Financing Rate, which closely track expected Fed policy, are becoming deeply inverted - a sign that traders are starting to price a more prolonged central bank easing cycle. Until recently, traders had been wagering that the central bank would resume hiking rates in 2027 after two quarter-point reductions by the end of this year.\"</p> <p class=\"paywall-full-content\">February 23 - Wall Street Journal (David Uberti): \"It doesn't take much to cause tumultuous stock moves in a market top-heavy with tech shares and jumpy about the prospects for artificial intelligence. But nothing underlines the sensitivity of stocks right now quite like what happened on Monday, when one of the factors behind the Dow's 800-point drop was a 7,000-word hypothetical. A viral report by Citrini Research tapped into a new strain of fears about AI, painting a dark portrait of a future in which technological change inspires a race to the bottom in white-collar knowledge work. Concerns of hyperscalers overspending are out. Worries of software-industry disruption don't go far enough. The 'global intelligence crisis' is about to hit. The new, broader question: What if AI is so bullish for the economy that it is actually bearish?\"</p> <p class=\"paywall-full-content\">February 23 - CNBC (Alex Harring): \"Speculative investing tools have boomed in popularity since the Covid pandemic as more retail traders have entered the market… Leveraged and inverse funds are expected to see average daily trading volumes of 1.41 billion in 2025, per… Direxion... That's a gain of more than 130% from 2024 and 250% from 2020... Leveraged funds aim to use derivatives to boost the returns of an underlying asset, but they can also amplify losses. Inverse funds set out to give investors the opposite performance of an underlying asset. Average daily options volume is projected to reach 58 million in 2025... This figure reflects a roughly 26% increase from the prior year and is more than double the amount seen in 2020. 'People have gotten really smart about investing and investing in complex vehicles,' Douglas Yones, Direxion's chief executive, told CNBC…\"</p> <p class=\"paywall-full-content\">February 23 - Bloomberg (Ryan Vlastelica and Brody Ford): \"International Business Machines Corp. shares had their worst day in more than 25 years on Monday, after AI startup Anthropic PBC said its Claude Code tool can help modernize Cobol, a dated programming language that's run on IBM computers. The stock plunged 13% in its biggest single-day percentage loss since October 2000. With the decline, IBM shares have fallen 27% in February, on track for its biggest one-month slide since at least 1968…\"</p> <p class=\"paywall-full-content\">February 23 - Wall Street Journal (Joe Stonor): \"European private-equity firms sold off steeply Monday as fears around the strength of their underlying holdings intensified. Shares in Stockholm-based EQT Group slid 8.85% to close at 269.70 Swedish kronor... In Switzerland, Partners Group fell 8.4% to 850 Swiss francs… Asset managers CVC Capital Partners and ICG also fell Monday, dropping 7.1% in Amsterdam and 4.95% in London... The sector has fallen steeply so far in 2026, with shares in EQT now down 26% for the year.\"</p> <p class=\"paywall-full-content\">February 20 - Financial Times (John Plender): \"With US public debt approaching wartime levels as a percentage of GDP, professional investors are understandably in a funk. Increasingly they question whether the US has the fiscal capacity to support the huge balance sheet liabilities it creates through its current account deficits. Their worries are exacerbated - excuse the familiar litany - by Trump-induced geopolitical fragmentation, erratic policy shocks including a tariff policy designed to hurt America's friends more than its foes, a sustained assault on Federal Reserve independence and neo-imperial threats to annex Greenland.\"</p> <p class=\"paywall-full-content\"><strong>U.S. and Global Credit Excess Watch:</strong></p> <p class=\"paywall-full-content\">February 23 - Financial Times (Joshua Franklin and Akila Quinio): \"US banks generated record profits last year of almost $300bn as the industry paid lower levels of interest to savers while benefiting from an uptick in lending activity and benign credit losses. The 2025 profits at more than 4,300 US banks totalled $295.6bn... This was up 10% from a year earlier and set a new record, beating the industry's previous high-water mark of $279bn in 2021. The figures highlight a period of prosperity for US banking under the Trump administration that has helped boost the pay of the industry's top executives. 'It was a happy year,' said veteran banking analyst Christopher Whalen… 'It's another year where we have skipped past any credit concerns which to me is remarkable'.\"</p> <p class=\"paywall-full-content\">February 23 - Bloomberg (Hannah Levitt): \"JPMorgan… Chief Executive Officer Jamie Dimon, asked about fierce competition across the financial industry, said he's starting to see parallels to the era before the 2008 financial crisis, when a rush to make loans ended disastrously. 'Unfortunately, we did see this in '05, '06 and '07, almost the same thing - the rising tide was lifting all boats, everyone was making a lot of money,' Dimon told investors... While JPMorgan isn't willing to make riskier loans to boost net interest income, he said, 'I see a couple people doing some dumb things. They're just doing dumb things to create NII'... 'There's always a surprise in a credit cycle,' Dimon said, adding that the surprise has often been which industry. 'This time around it might be software because of AI'.\"</p> <p class=\"paywall-full-content\">February 23 - CNBC (Hugh Son): \"JPMorgan… CEO Jamie Dimon said… he was anxious over the U.S. economy, citing elevated asset prices and a competitive environment in banking that reminded him of the pre-2008 crisis years… 'My own view is people are getting a little comfortable that this is real, these high asset prices and high volumes, and that we won't have any problems,' said Dimon… Inevitably, Dimon said, the economic cycle will turn, leading to a wave of borrower defaults that would broadly affect lenders, and often impacting industries few people expect, he said. 'There will be a cycle one day… I don't know what confluence of events will cause that cycle. My anxiety is high over it,' Dimon said. 'I'm not assuaged by the fact that asset prices are high. In fact, I think that adds to the risk'.\"</p> <p class=\"paywall-full-content\">February 23 - Financial Times (Stephen Foley): \"A gap in US accounting rules allows Big Tech companies to conceal tens of billions of dollars of potential liabilities for their AI data centres, the credit rating agency Moody's warned… 'Limitations' in the rules mean AI companies may not have to account either for the cost of renewing a data centre lease or for the cost of not renewing it, even though either number could be huge… 'Disclosures may not show the full picture', the rating agency warned, adding 'the accounting liability is unlikely to reflect certain plausible future scenarios'. A growing number of companies including Meta and Oracle are using special purpose vehicles owned and funded largely by other investors to build their data centres. The long-term cost of leasing the data centre back from the entities is equivalent to debt in the eyes of rating agencies and many investors.\"</p> <p class=\"paywall-full-content\">February 22 - Financial Times (Michelle Chan): \"Data centre developers are seeking credit ratings - even while facilities are still under construction - as the tech industry tries to open up new sources of capital to fund hundreds of billions of dollars in AI investments. S&amp;P, Moody's, Fitch and Kroll Bond Rating Agency have in recent months expanded their coverage to data centre projects that are yet to be completed and in many cases given out private ratings for loans so that banks can offload them to a broader base of institutional investors.\"</p> <p class=\"paywall-full-content\"><strong>U.S. Credit Trouble Watch:</strong></p> <p class=\"paywall-full-content\">February 25 - Financial Times (Eric Platt and Antoine Gara): \"Executives at private credit giant Blue Owl were scrambling. The firm was facing growing demands for withdrawals last autumn from its first private debt fund for retail investors. To drum up cash, it turned to vehicles it created including one named Loantaka, after a part of New Jersey once populated by the Lenape indigenous tribe. Its translation: 'Place of cold winter.' For Blue Owl's top leaders, January and February have been the firm's own cold winter. The… investment group, with $307bn in assets, has been racing to shore up confidence in a firm that emerged as one of the biggest beneficiaries of the boom in private lending as banks retreated from making risky loans in the wake of the 2008 crisis. Now, after some of Blue Owl's flagship funds were hit by a surge in redemptions, it is being roiled by the consequences of its rapid expansion. Blue Owl's troubles have added to worries about the broader private capital sector… Investors have started pulling money from some of the largest private credit funds, fretting about an uptick in defaults as well as exposure to and the impact of AI on the software industry where the sector has lent heavily.\"</p> <p class=\"paywall-full-content\">February 25 - Wall Street Journal (Miriam Gottfried and Gunjan Banerji): \"Robert Hendricks immediately emailed his wealth adviser after seeing headlines on X saying Blue Owl Capital was halting redemptions in one of its private-credit funds. His adviser told him that he was invested in a different Blue Owl fund and that the fears around headlines were overblown. He plans to redeem the roughly $75,000 he has invested anyway. 'The last thing you want to hear as an investor is that the door is closing,' said Hendricks…, who first invested in private credit about two years ago. Hendricks is among the individual investors who piled into private-credit funds in recent years and are now wondering whether they made a mistake.\"</p> <p class=\"paywall-full-content\">February 25 - Financial Times (Michelle Chan): \"Tech companies are increasingly turning to loans backed by the chips on which their large language models are trained as they hunt for ways to fund their massive AI investments. Such loans, which are secured against graphics processing units and backed by leases to the tech groups, are popular with a sector burning hundreds of billions of dollars a year in an AI arms race on chips that can quickly become obsolete. Investors have been attracted by yields in the high single digits to mid-teens, which are typically higher than those on debt issued by the tech companies themselves.\"</p> <p class=\"paywall-full-content\">February 23 - Wall Street Journal (Alicia McElhaney): \"First Brands Group has been unable to find financing or a buyer to continue most of its companywide operations, the bankrupt auto-parts supplier said as it laid off employees in its aftermarket businesses Monday. First Brands said in a letter to laid-off workers that several potential buyers for the company 'suddenly and unexpectedly' withdrew or narrowed their bids to interest in certain units in recent days.\"</p> <p class=\"paywall-full-content\">February 24 - Bloomberg (Soma Biswas and Jonathan Randles): \"Raistone Capital, a trade finance firm that was done in by the collapse of auto parts supplier First Brands Group, filed for liquidation…, weeks after winding down its operations.\"</p> <p class=\"paywall-full-content\"><strong>Trump Administration Watch:</strong></p> <p class=\"paywall-full-content\">February 23 - Financial Times (Peter Navarro): \"Every so often, what looks like a defeat proves to be a strategic win. The Supreme Court's ruling on US President Donald Trump's tariffs is one of those moments. On its face, the ruling looks like a knockout punch. In a 6-3 decision, the court held that the International Emergency Economic Powers Act's authorisation to 'regulate importation' does not include the power to impose tariffs. Because tariffs raise revenue, the majority concluded, they are in effect taxes - and taxes require explicit congressional approval. But look carefully at what the court actually did. It ruled that the IEEPA does not authorise tariffs. That's all. The court did not declare tariffs unconstitutional. It did not strike down section 232 of the Trade Expansion Act. It did not invalidate section 301 of the Trade Act. It did not question the use of sections 122, 201 or 338. It did not revive the 'nondelegation' doctrine. And only three justices relied on the 'major-questions' doctrine, meaning the court created no sweeping precedent limiting presidential trade authority. In fact, even as the court struck down the IEEPA tariffs, it acknowledged that the president retains broad and powerful authority under numerous other statutes to impose tariffs.\"</p> <p class=\"paywall-full-content\">February 23 - Axios (Courtenay Brown): \"When the Supreme Court threw out the Trump administration's use of a novel emergency tool to implement tariffs Friday, the White House quickly turned to a different novel emergency tool - but economists and lawyers are now questioning its legality as well. Goodbye, IEEPA tariffs… Hello, Section 122 of the Trade Act of 1974. But the new tool comes with its own questions and limitations. Over the weekend, the administration imposed 15% global tariffs under Section 122, which permits the president to impose that maximum tariff rate for up to 150 days in the event of a balance-of-payments crisis. But does the U.S. fit those circumstances? The nation is not exhibiting the typical symptoms: plunging currency, spiking interest rates or a freezing-up of foreign capital flowing in. 'No matter how one looks at the current circumstances-the condition of the U.S. economy, its balance of payments or its currency regime-none of these meet the standards outlined under Section 122,' RSM chief economist Joe Brusuelas wrote… Indeed, Justice Department lawyers themselves dismissed the provision as an option last year.\"</p> <p class=\"paywall-full-content\">February 23 - Wall Street Journal (Tom Fairless and Gavin Bade): \"President Trump is doubling down on his tariffs, even though they have so far failed to achieve one of their key stated goals: rebalancing lopsided global trade. On the contrary, recent data show the tariffs that the Supreme Court struck down on Friday and that Trump has vowed to reimpose under a different statute are cementing these imbalances. From Berlin to Tokyo, the world's biggest exporting countries have reacted to U.S. tariffs by further committing to economic policies that support exports, subsidizing manufacturers to help them leap over the tariff wall. As for America, it very much remains the world's importer of last resort. The U.S. trade deficit in goods rose to a record high of $1.24 trillion in 2025, driven by a 4.3% increase in goods imports…\"</p> <p class=\"paywall-full-content\">February 26 - Financial Times (James Politi): \"Donald Trump and his top officials have tried to argue that last week's Supreme Court ruling striking down the core of his trade agenda is not a big deal. But the White House is facing a messy reality. For one, it is bracing for the impact of more than 900 lawsuits that have been filed challenging the emergency tariffs, which may now force the administration to issue refunds worth billions of dollars to aggrieved importers. 'We are going to fight tooth and nail to make sure this money is given back quickly with no games and reservations about it,' Neal Katyal, the lawyer who argued against Trump's tariffs on behalf of US-based businesses before the Supreme Court, told Stefania Palma…\"</p> <p class=\"paywall-full-content\">February 22 - Bloomberg (Catherine Lucey): \"Senior US officials said President Donald Trump's tariff defeat at the Supreme Court won't unravel deals negotiated with US partners as they sought to defend the administration's assertive trade policies. Those deals - which the administration made with partners including China, the European Union, Japan and South Korea - remain in place, US Trade Representative Jamieson Greer said… He sought to separate those arrangements from the planned 15% global tariff Trump announced Saturday. 'We want them to understand these deals are going to be good deals,' Greer said. 'We're going to stand by them. We expect our partners to stand by them'.\"</p> <p class=\"paywall-full-content\">February 23 - Axios (Barak Ravid and Marc Caputo): \"Joint Chiefs Chairman Gen. Dan Caine has been advising President Trump and top officials that a military campaign against Iran could carry significant risks, in particular the possibility of becoming entangled in a prolonged conflict… There's an ongoing debate at the top levels of the Trump administration about how to handle the Iran standoff and what the consequences of each option would be. At the moment, several of the voices in Trump's circle are urging caution, though some sources think Trump himself is leaning towards a strike. Above all, there's the question of what success would look like when it comes to military action, and how risky it would be to try to achieve it. On the other side, reaching a nuclear deal would likely mean walking back some of the president's previous red lines.\"</p> <p class=\"paywall-full-content\">February 23 - Associated Press (Konstantin Toropin and Ben Finley): \"The Pentagon is building up the largest force of American warships and aircraft in the Middle East in decades, including two aircraft carrier strike groups, as President Donald Trump warns of possible military action against Iran if talks over its nuclear program fall apart. 'It's proven to be, over the years, not easy to make a meaningful deal with Iran, and we have to make a meaningful deal,' Trump said last week. 'Otherwise bad things happen'.\"</p> <p class=\"paywall-full-content\">February 25 - Wall Street Journal (Michael R. Gordon and Laurence Norman): \"Iran's atomic program hasn't advanced significantly since the U.S. and Israel struck its three main nuclear sites last June, according to experts and diplomats, despite Washington's top negotiator saying Tehran could make fissile material for a bomb within days. The appraisal… comes as U.S. and Iranian officials prepare to hold talks… Steve Witkoff, the U.S.'s chief negotiator with Iran, told Fox News last week that Iran is 'probably a week away from having industrial-grade bomb-making material'.\"</p> <p class=\"paywall-full-content\">February 26 - Wall Street Journal (Amrith Ramkumar): \"Anthropic said it wouldn't back down in a dispute with the Defense Department over artificial-intelligence guardrails, complicating efforts to reach a compromise ahead of a Friday deadline. In a Tuesday meeting at the Pentagon, Defense Secretary Pete Hegseth gave Anthropic Chief Executive Dario Amodei until 5:01 p.m. Friday to agree to the military's right to use the technology in all lawful cases. If Anthropic declines, Hegseth has threatened to invoke the Defense Production Act to make the company do what the military wants, or to designate the company a supply-chain risk, impairing its ability to work with other government contractors. Anthropic has refused to accept the military's proposal and doesn't let users deploy its Claude models in scenarios involving mass domestic surveillance or autonomous weapons.\"</p> <p class=\"paywall-full-content\">February 25 - Axios (Dave Lawler, Colin Demarest and Maria Curi): \"The Pentagon asked two major defense contractors… to provide an assessment of their reliance on Anthropic's AI model, Claude - a first step toward a potential designation of Anthropic as a 'supply chain risk,' Axios has learned. That penalty is usually reserved for companies from adversarial countries, such as Chinese tech giant Huawei. Using it to punish a leading American tech firm, particularly one on which the military itself is currently reliant, would be unprecedented.\"</p> <p class=\"paywall-full-content\">February 25 - Bloomberg (Maria Luiza Rabello): \"An IPO of Fannie Mae and Freddie Mac this year is 'very likely,' FHFA Director Bill Pulte says on Fox Business. 'I think it's very likely. I think it's more likely than not, but look, this is up to the president,' he says. They're worth $500b to $700b, Pulte reiterates.\"</p> <p class=\"paywall-full-content\">February 22 - CNBC (Annie Palmer): \"President Donald Trump… called on Netflix to fire board member Susan Rice or 'pay the consequences,' after she said Democrats would push for corporate accountability if they regain power in the November midterm elections… Trump described Rice, who served as President Joe Biden's domestic policy chief and held top foreign policy posts under President Barack Obama, as 'purely a political hack' with 'no talent or skills.' 'HER POWER IS GONE, AND WILL NEVER BE BACK,' Trump wrote. Rice argued during a podcast last week that 'it is not going to end well' for corporations, news organizations, and law firms that 'bent the knee' to Trump, and that their deference is unpopular.\"</p> <p class=\"paywall-full-content\"><strong>Trade War Watch:</strong></p> <p class=\"paywall-full-content\">February 22 - Bloomberg: \"Chinese President Xi Jinping is heading to the negotiating table with Donald Trump with a boost in bargaining power… Weeks before Trump lands in Beijing on March 31, the first trip by an American president since his last visit in 2017, the Supreme Court invalidated his broad emergency tariffs - a key point of leverage over China. That's eliminated Trump's second-term levies on China and left Beijing facing the same 15% global fee applied to US allies, a rate that comes with a 150-day expiry date. The removal of tariff threats… will make it harder for Trump to press Xi for larger purchases of soybeans, Boeing Co. aircraft and energy. It also leaves him without a key weapon to strike back if Chinese negotiators make fresh demands…\"</p> <p class=\"paywall-full-content\">February 23 - Politico (Camille Gus and Max Griera): \"The European Parliament froze ratification of the EU's trade deal with the United States on Monday amid concerns that President Donald Trump's latest tariff broadside breaches the terms of the transatlantic accord struck last summer… 'The decision to postpone the vote on the implementation of the U.S. deal is the right one. Given the current enormous uncertainty, a vote would be unjustifiable,' said Anna Cavazzini, who represents the Greens.\"</p> <p class=\"paywall-full-content\">February 23 - Bloomberg (Sakura Murakami): \"Japanese Trade Minister Ryosei Akazawa called on the US to ensure that new tariff measures would not leave Tokyo with tougher conditions than those agreed in last year's trade deal… Following the rapid changes in US tariffs in recent days, Akazawa and Lutnick agreed that Japan and the US would continue to work closely to ensure the swift and smooth implementation of projects that are part of a $550 billion investment mechanism…\"</p> <p class=\"paywall-full-content\">February 25 - Reuters (Allison Lampert, Laurie Chen, Lewis Jackson and Michael Martina): \"Suppliers to U.S. aerospace and semiconductor firms face worsening rare earth shortages… The shortages center on rare earths such as yttrium and scandium, niche members of the family of 17 elements, which play tiny but vital roles in defence technology, aerospace and semiconductors and are almost entirely produced in China. While Beijing has allowed many rare earth exports to resume since it imposed restrictions in April, shipments of these materials still rarely make it to the U.S. despite the October detente with Washington…\"</p> <p class=\"paywall-full-content\">February 21 - Bloomberg (Sakura Murakami): \"A heavyweight of Japan's ruling Liberal Democratic Party called US tariffs 'a real mess' after President Donald Trump hiked levies in response to a Supreme Court decision that his previous tariffs were illegal. 'To be very frank, it's a real mess,' Itsunori Onodera, a former defense minister who currently serves as chairperson of the party's tax research group, said…\"</p> <p class=\"paywall-full-content\">February 24 - Financial Times (Joe Leahy and Anne-Sylvaine Chassany): \"German Chancellor Friedrich Merz has urged China's President Xi Jinping to reset trading relations between the EU and the world's second-largest economy amid growing tensions. Merz… said he discussed Germany's widening trade deficit and Chinese restrictions on German companies… The two leaders also discussed reducing risks in supply chains in critical sectors, he added, a reference to Germany's reliance on rare earths from China for its car and defence industries.\"</p> <p class=\"paywall-full-content\"><strong>New World Order Watch:</strong></p> <p class=\"paywall-full-content\">February 21 - Bloomberg (Alexander Weber): \"European Central Bank President Christine Lagarde said she walked out of a speech by US Commerce Secretary Howard Lutnick at the World Economic Forum because she found his anti-European rhetoric inappropriate given the setting. 'To have as a last speaker, without any rebuttal of any arguments, someone who just bashed Europe, right, left, and center. I thought it was just too much and just unnecessarily offensive,' Lagarde said…\"</p> <p class=\"paywall-full-content\">February 26 - Wall Street Journal (Paul Vieira and Shan Li): \"For years, Canada and India have had bitter relations, expelling diplomats and stalling trade talks. Now, Prime Minister Mark Carney wants New Delhi as his newest friend as he travels the world building alliances with so-called middle powers. Carney departed on Thursday for India in a bid to… deepen commercial ties that could reduce Canada's heavy economic reliance on the U.S… But underlying the trip is Carney's call for closer partnerships among countries that have struggled to stand up on their own to China and the U.S. under President Trump.\"</p> <p class=\"paywall-full-content\"><strong>Iran War Watch:</strong></p> <p class=\"paywall-full-content\">February 27 - Axios (Barak Ravid): \"The U.S. State Department announced… it started evacuating 'non-emergency' government personnel from the embassy in Israel and their family members, citing 'safety risks' amid growing tensions with Iran. The decision signals that a joint U.S.-Israeli military campaign against Iran could be imminent. In such a case, Iran could launch ballistic missiles toward Israel and U.S. targets in the region. Earlier this week the U.S. evacuated all non-essential staff and their family members from the embassy in Beirut, as well. Strikes on Iran could cause a war between Israel and Hezbollah to erupt.\"</p> <p class=\"paywall-full-content\">February 22 - Financial Times (Fabiola Sanchez): \"Iran agreed a secret €500mn arms deal with Russia to acquire thousands of advanced shoulder-fired missiles in its most significant effort to rebuild air defences shattered during last year's war with Israel. The agreement, signed in Moscow in December, commits Russia to deliver 500 man-portable 'Verba' launch units and 2,500 '9M336' missiles over three years… The Verba is one of Russia's most modern air-defence systems, a shoulder-fired, infrared-guided missile capable of targeting cruise missiles, low-flying aircraft and drones.\"</p> <p class=\"paywall-full-content\">February 24 - Reuters (John Irish, Parisa Hafezi and Gavin Finch): \"Iran is close to a deal with China to purchase anti‑ship cruise missiles…, just as the United States deploys a vast naval force near the Iranian coast ahead of possible strikes on the Islamic Republic. The deal for the Chinese‑made CM‑302 missiles is near completion, though no delivery date has been agreed… Their deployment would significantly enhance Iran's strike capabilities and pose a threat to U.S. naval forces in the region, two weapons experts said. Negotiations with China to buy the missile weapons systems, which began at least two years ago, accelerated sharply after the 12‑day war between Israel and Iran in June…\"</p> <p class=\"paywall-full-content\"><strong>Ukraine Watch:</strong></p> <p class=\"paywall-full-content\">February 23 - Reuters (Dan Peleschuk): \"European leaders vowed… not to abandon Ukraine as Russia's invasion entered a fifth year, though divisions among Kyiv's partners overshadowed commemorations of the outbreak of the continent's largest war in decades. Tuesday's anniversary of the start of the conflict, which has killed hundreds of thousands and ravaged swathes of Ukraine, comes a day after Hungary vetoed new EU sanctions against Russia and a 90 billion euro ($105bn) loan critical to Ukraine's survival… President Volodymyr Zelenskiy, facing mounting U.S. pressure to secure a peace deal, has repeatedly urged Kyiv's allies to tighten sanctions on Moscow and send more weapons as Russian President Vladimir Putin shows no signs of ending his war.\"</p> <p class=\"paywall-full-content\">February 23 - Wall Street Journal (James Marson and Alistair MacDonald): \"A Ukrainian counterattack in the country's southeast is chipping away at Russian advances there and demonstrating that Kyiv's forces have got plenty of fight left as Moscow's invasion stretches into a fifth year… Ukraine has embarrassed Russian generals' claims of significant gains by largely clearing the city of Kupyansk in the northeast of Russian forces and retaking several villages in the southeastern Zaporizhzhia region. At the same time, long-range strikes by Ukraine, Western sanctions and ship seizures are pushing down prices for Russian oil that are critical for Moscow to sustain its military efforts.\"</p> <p class=\"paywall-full-content\">February 25 - Bloomberg (Thomas Escritt): \"Hungarian Prime Minister Viktor Orban is going all in with an anti-Ukraine campaign less than seven weeks before an election, derailing the European Union's latest packages to aid Kyiv and punish Moscow. And now the prospect of a historic defeat that would end his 16-year rule - an independent poll Wednesday showed Orban's party trailing by 20 points - is forcing him into a corner.\"</p> <p class=\"paywall-full-content\"><strong>Taiwan Watch:</strong></p> <p class=\"paywall-full-content\">February 25 - Reuters (Greg Torode): \"A large Chinese military drone has conducted regular flights over the South China Sea in recent months while transmitting false transponder signals that made it appear to be other aircraft, including a sanctioned Belarusian cargo plane and a British Typhoon fighter jet. Military attaches and security analysts scrutinising the operations say the flights represent a step-change in China's grey-zone tactics in the contested South China Sea and appear to be testing possible decoy capabilities in the event of a Chinese invasion of Taiwan.\"</p> <p class=\"paywall-full-content\">February 23 - New York Times (Tripp Mickle): \"Federal officials have for years tried to wean Silicon Valley from its dependence on Taiwan, an island… that makes 90% of the world's high-end computer chips. In secret briefings held in Washington and Silicon Valley, national security officials warned executives from companies like Apple, Advanced Micro Devices and Qualcomm that China was making plans to retake Taiwan, which Beijing has long considered a breakaway territory. A Chinese blockade of Taiwan, the officials said, could choke the supply of computer chips made on the island and bring the U.S. tech industry to its knees.\"</p> <p class=\"paywall-full-content\"><strong>U.S./Russia/China/Europe/Iran Watch:</strong></p> <p class=\"paywall-full-content\">February 24 - Reuters: \"Russia's Foreign Ministry… issued a statement warning of the risk of a direct clash between nuclear powers and the grave consequences such a clash could have. The ministry issued the statement after Russia's Foreign Intelligence Service (SVR)… accused Britain and France of preparing to secretly supply Ukraine with nuclear weapons parts and technology… 'We once again warn of the risks of a direct military confrontation between nuclear powers and, accordingly, of its potentially dire consequences,' the foreign ministry said…\"</p> <p class=\"paywall-full-content\">February 24 - Wall Street Journal (Editorial Board): \"The world this week is marking the fourth anniversary of Russia's war on Ukraine, but the Kremlin is also conducting a quieter war with the rest of Europe. That war is documented in a report this week from the International Centre for Counter-Terrorism. The Netherlands think tank tracked violence, sabotage, public disturbances, arson and bombing attempts, among other criminal or terrorist acts. It finds the Kremlin plotted or carried out at least 151 such actions since February 2022 in Europe-at least 12 since July.\"</p> <p class=\"paywall-full-content\">February 23 - Bloomberg (Josh Xiao, Stephen Stapczynski, and Nectar Gan): \"China blacklisted 20 Japanese entities and tightened scrutiny on a raft of other firms, signaling Beijing won't drop its pressure campaign against Tokyo even after Prime Minister Sanae Takaichi's recent landslide victory. The Ministry of Commerce added top Japanese military suppliers… to an export control list… The move marks the first time Japanese firms were added to the list since its January 2025 debut. In another measure, Beijing placed an additional 20 entities, including automakers Subaru and Hino Motors, on a monitor list.\"</p> <p class=\"paywall-full-content\"><strong>AI Bubble/Arms Race Watch:</strong></p> <p class=\"paywall-full-content\">February 24 - Axios (Jim VandeHei and Mike Allen): \"If AI were a politician, it'd be headed for a landslide defeat. Defeated by Democrats ... Republicans ... and independents. In the Trump administration, Silicon Valley, and select AI-obsessed homes or businesses, people are euphoric about the fast rise of generative AI tools. These groups see a coming utopia. Almost everywhere else, the vast majority are indifferent, pessimistic - even downright dystopian. The politics are shifting so fast against AI that Democratic governors who championed it are in fast retreat. It's almost certain to get worse for AI. Every major AI company is racing frantically to pump out new, more human-like models and then boast about their awesome capabilities. Every advancement or boast likely causes an equal and opposite reaction from voters. They get more anxious. The AI companies are pouring money into politics, but it's mostly to thwart regulation they think could slow AI, not polish its image. So AI's image is shaped largely by critics or background noise.\"</p> <p class=\"paywall-full-content\">February 27 - Bloomberg (Shirin Ghaffary and Matt Day): \"OpenAI said it has finalized a record-breaking $110 billion funding round at a $730 billion valuation, not including the money raised, fueling the ChatGPT maker's costly push to secure more computing power and talent for AI development. Amazon.com Inc. is investing $50 billion in the financing round, OpenAI said Friday. SoftBank Group Corp. and Nvidia Corp. each invested $30 billion… OpenAI and rival Anthropic have ramped up their fundraising this year to support costly bets on chips and data centers to support their artificial intelligence software.\"</p> <p class=\"paywall-full-content\">February 25 - Axios (Chuck McCutcheon and Ben Geman): \"Tech giants are expected to join President Trump at the White House next week to sign a pledge that they will build or buy their own electricity supplies for data centers. It's the Trump administration's latest response to election-year voter angst… Trump said during Tuesday night's State of the Union address that he negotiated a 'ratepayer protection pledge' with tech companies. He said that the companies will 'have the obligation to provide for their own power needs' and touted building on-site generation.\"</p> <p class=\"paywall-full-content\">February 26 - Financial Times (Madhumita Murgia and John Reed): \"Anthropic this week claimed that competitors from China were stealing its AI technology by mounting so-called distillation attacks on its models. The company said that three Chinese AI groups, including industry upstart DeepSeek, had extracted information in this way from its popular Claude software. While the practice was previously known, Anthropic laid out what it claimed was an 'industrial-scale' campaign to mine its capabilities 'illicitly'.\"</p> <p class=\"paywall-full-content\">February 23 - Axios (Zachary Basu and Madison Mills): \"A manic new phase of the AI boom is sweeping through Silicon Valley, powered by autonomous 'agents' capable of liquefying weeks of manual labor into minutes. For now, the frenzy is largely confined to software engineering. But inside that bubble, the shift feels seismic… 'I've followed tech for 25 years and I've never felt a larger gap between the ~1 million people using Codex/Claude and the rest of humanity,' tweeted James Wang, director of product marketing at Cerebras. Anthropic CEO Dario Amodei recently described the current state of software engineering as the 'centaur phase' - a reference to the half-human, half-horse creature of Greek mythology. Just as a chess player aided by a computer could once beat any standalone machine, an engineer paired with an AI agent may now be the most powerful unit in tech. Amodei argues that this hybrid phase may be 'very brief' - perhaps only a few years before AI systems can independently outpace even the best human-led teams.\"</p> <p class=\"paywall-full-content\">February 23 - Bloomberg (Shirin Ghaffary, Natasha Mascarenhas, and Rebecca Torrence): \"Anthropic is offering some current and former employees the ability to sell shares in the company at a valuation of about $350 billion… allowing them to cash in at the level of a recent $30 billion fundraising. The company has lined up $5 billion to $6 billion for the share sale, but the final amount will depend on how many eligible Anthropic employees opt to sell…\"</p> <p class=\"paywall-full-content\">February 26 - Axios (Emily Peck): \"Fortune 500 CEOs ranked AI and 'new technology' as the top risk to their industry… AI is roiling the markets and companies to a degree that is shaking up even the companies believed to be on the right side of history. For example, OpenAI investor Microsoft's stock is down 15% this year, while hyperscaler Amazon is down 7%... AI or new technology was identified as a top concern by 60% of the 142 CEOs surveyed in early February by the Conference Board… It ranked third the previous quarter.\"</p> <p class=\"paywall-full-content\">February 24 - Axios (Amy Harder): \"As many as half of the world's data center projects slated to come online this year could face delays, according to a report… It's a sign of mounting collisions in the AI race - from power constraints and grid equipment shortages to rising community opposition… Data center additions hit a record in 2025, and 2026 is on track to surpass it, Olivia Wang, a Sightline research analyst, told Axios. Nearly six gigawatts came online last year, and five gigawatts are already under construction this year. (One gigawatt can power about 1 million U.S. homes.)\"</p> <p class=\"paywall-full-content\">February 25 - Bloomberg (John Gittelsohn): \"Construction of new data centers in the US fell for the first time since 2020 despite soaring demand for artificial intelligence computing capacity, as developers face delays in permitting, zoning and power procurement. Capacity under construction fell to 5.99 gigawatts at the end of 2025 from 6.35 gigawatts at the end of 2024, real estate brokerage CBRE Group Inc. reported... The construction delays and faster long-distance networks are driving development to move outside traditional data center sites like Northern Virginia, Gordon Dolven, CBRE's data center research director, said…\"</p> <p class=\"paywall-full-content\">February 26 - Wall Street Journal (Jack Pitcher and Xavier Martinez): \"One of the 21st century's hottest sectors has become a market albatross. Concern over the threat that artificial intelligence poses to software companies has hit the shares of companies like Salesforce and Adobe hard. Investors are questioning whether software companies that sell to businesses can withstand competition from AI-powered rivals… The State Street SPDR S&amp;P Software &amp; Services ETF, which tracks an equal-weight benchmark of about 140 software companies, has dropped 20% in the first two months of 2026 and almost 30% since its high from this past fall.\"</p> <p class=\"paywall-full-content\">February 24 - Bloomberg (Bailey Lipschultz and Paula Seligson): \"CoreWeave Inc. is looking to raise about $8.5 billion from banks including Morgan Stanley and Mitsubishi UFJ Financial Group Inc. to help finance a buildout of cloud computing capacity for Meta Platforms Inc., according to people familiar... The proposed delayed-draw term loan would be backed by a contract Meta signed last year to pay CoreWeave up to $14.2 billion for its services…\"</p> <p class=\"paywall-full-content\"><strong>Bubble and Mania Watch:</strong></p> <p class=\"paywall-full-content\">February 24 - Wall Street Journal (Corrie Driebusch): \"This was supposed to be a blockbuster year for initial public offerings. Artificial-intelligence fears spoiled the party. Investors have been thirsting for new issues, and big names including SpaceX, OpenAI and Anthropic are readying debuts for later this year. The momentum created an opening for dozens of smaller, mainly private-equity backed software firms that had been waiting in the wings. Then fears that AI will upend the software industry sent stocks tumbling earlier this month… Bankers and investors now expect the few mega-offerings to dominate the year. Most private tech companies-many that have spent years biding their time-will be forced to keep waiting it out.\"</p> <p class=\"paywall-full-content\">February 25 - Bloomberg (Preeti Singh): \"Fears that artificial intelligence may spell bad news for software giants have been pressuring stock market valuations for months. Now, those same fears are creeping into private markets too. Buyers are demanding discounts of as much as 20% to take a piece of private equity firms' technology-heavy portfolios off their hands… That's worse than the 5% discount they were seeking just weeks ago… As a result, some investors who were preparing to launch their portfolio sales have pumped the brakes for now, two of these people said.\"</p> <p class=\"paywall-full-content\">February 22 - Bloomberg (Preeti Singh): \"Private equity returned fewer profits to investors for a fourth straight year as the industry sat on $3.8 trillion of unsold assets and struggled to raise money for new funds. Distributions as a percentage of net asset value remained at 14% last year - the second-lowest level since the depths of the 2008 financial crisis, according to… Bain &amp; Co. And the duration of the rut is even more severe than what private equity firms faced then. The value of deals in 2025 rose 44% from a year earlier to $904 billion, fueled by large transactions including the $56.6 billion take-private of Electronic Arts… Total transactions fell 6% to 3,018.\"</p> <p class=\"paywall-full-content\"><strong>Crypto Crash Watch:</strong></p> <p class=\"paywall-full-content\">February 26 - Bloomberg (David Pan): \"American Bitcoin Corp., the Trump family-backed miner that rode the crypto euphoria to a blockbuster Nasdaq debut, is caught in the wreckage of the industry's deepest rout since 2022. The… firm reported a $59 million loss for the fourth quarter…, results that come amid a stock selloff that has wiped out around 90% of the firm's market value since the September high as the broader Trump digital-asset trade misfires… World Liberty Financial, the decentralized finance platform that hosted Wall Street executives at Mar-a-Lago this month, has seen a 65% plunge in its native token since the cryptocurrency was launched in September.\"</p> <p class=\"paywall-full-content\">February 22 - Bloomberg (Olga Kharif and Emily Nicolle): \"Cameron and Tyler Winklevoss spent more than a decade building Gemini Space Station Inc. into one of crypto's longest-running exchanges, among the first to secure major US regulatory approvals and a survivor of the industry's repeated cycles of scandal and collapse. Now, after a more than 40% plunge in Bitcoin erased the bull market that helped underpin the money-losing company's growth plans, Gemini is testing just how fast it can reposition - with little margin for error. Earlier this month, Gemini said it was axing as much as a quarter of its staff and exiting the UK, European Union and Australia entirely. This week, it parted with its chief operating officer, chief financial officer and chief legal officer, all in a single day. Its stock has fallen more than 80% from a post-listing high last year…\"</p> <p class=\"paywall-full-content\">February 24 - CNBC (Liz Napolitano): \"Most bitcoin miners are no longer profiting from their digital asset-related operations as the flagship cryptocurrency falls further into the red, according to… Rosenblatt… Earlier on Tuesday, the token sank just below $63,000… The crypto's latest slides could deepen a reemerging threat to most bitcoin miners, Rosenblatt analysts noted. 'With [the revenue earned on mining] now under [3 cents], it is down to levels that are unprofitable for all but the most efficient operations' Rosenblatt analyst Chris Brendler said…\"</p> <p class=\"paywall-full-content\"><strong>Inflation Watch:</strong></p> <p class=\"paywall-full-content\">February 23 - Reuters (Michael S. Derby): \"The underlying level of inflation heated up in December as measured by a New York Federal Reserve gauge, suggesting further challenges in getting overall price pressures ‌back to the U.S. central bank's 2% target. The regional Fed bank said its Multivariate Core Trend inflation ‌reading ticked up to 2.8% in December from 2.4% in the prior month, boosted by pressures in prices for services outside of housing and by goods costs.\"</p> <p class=\"paywall-full-content\">February 24 - Bloomberg (Erin Hudson): \"The cost of private school in the US is inching closer to $50,000, according to… S&amp;P Global Ratings. Annual average tuition reached new highs, according to the rating firm's report on 59 schools in the sector... For day schools, it jumped 3.6% to $48,922 on average and for boarding schools, tuition rose 3.5% to $75,466.\"</p> <p class=\"paywall-full-content\"><strong>Federal Reserve Watch:</strong></p> <p class=\"paywall-full-content\">February 26 - Wall Street Journal (C. Ryan Barber, Sadie Gurman and Nick Timiraos): \"The Federal Reserve is waging a behind-closed-doors legal challenge to a pair of subpoenas issued as part of U.S. Attorney Jeanine Pirro's criminal investigation into Chair Jerome Powell... Pirro, a longtime ally of President Trump, opened the probe to examine whether Powell gave false testimony to Congress last summer about the central bank's building-renovation project… The Fed, in sealed proceedings, is asking a judge to quash the subpoenas, which could reduce or eliminate its obligation to respond.\"</p> <p class=\"paywall-full-content\">February 25 - Wall Street Journal (Matt Grossman): \"Atlanta Fed President Raphael Bostic said… the rift between the Federal Reserve and the White House has begun to erode trust in the central bank's apolitical standing, one of the most direct warnings yet from a top monetary-policy official… in a farewell essay ahead of his scheduled retirement… at the end of February, Bostic said his colleagues in the Federal Reserve system remain committed to insulating their work from politics. 'But my travels over the past several months have made clear that the legal and rhetorical battles raging around the central bank right now have caused people across a wide cross-section of our population to begin to doubt the Fed's independence,' Bostic wrote. 'This is a major concern'.\"</p> <p class=\"paywall-full-content\">February 24 - Bloomberg (Enda Curran): \"Federal Reserve Governor Lisa Cook warned the US central bank may not be able to counter rising unemployment driven by adoption of artificial intelligence. 'If AI continues to raise productivity, economic growth could remain strong, even as churn in the labor market leads to an increase in unemployment. In a productivity boom such as this, a rise in unemployment may not indicate increased slack,' Cook said… 'As such, our normal demand-side monetary policy may not be able to ameliorate an AI-caused unemployment spell without also increasing inflationary pressure,' she said.\"</p> <p class=\"paywall-full-content\">February 25 - Bloomberg (Christopher Condon): \"Federal Reserve Bank of Richmond President Tom Barkin said interest-rate policy shouldn't be used to counter the disruption that artificial intelligence may cause to businesses and the labor market. 'What you just described is creative destruction, and that's been happening for hundreds of years in this country, and it's part of the essence of capitalism,\" Barkin said… The Fed's principal tool… is a 'blunt instrument,' he added. 'It's not the answer to all these issues… If you support capitalism, which I do, you imagine creative destruction will work in the way it does, and you don't actually turn to the Fed to solve all those problems'.\"</p> <p class=\"paywall-full-content\">February 25 - Reuters (Michael S. Derby): \"Federal Reserve Bank of Kansas City President Jeffrey Schmid said… overly high inflation remains a key problem ‌the central bank needs to address, but he stopped short of saying how monetary policy should respond. 'I think we have work to do on the inflation side of things,' while 'I think we're in a pretty good place for employment,' Schmid said…\"</p> <p class=\"paywall-full-content\">February 24 - Wall Street Journal (Matt Grossman): \"A solid consumer economy and steady labor market mean that the Federal Reserve should be primarily focused on addressing elevated inflation, Chicago Fed President Austan Goolsbee said… Goolsbee acknowledged that gloomy consumer surveys and sluggish hiring warrant some caution… But by and large, Goolsbee said, consumer-spending growth and modest unemployment suggest the economy has held up well, making inflation the appropriate target of the Fed's attention… Goolsbee… said '3% inflation is not good enough-and it's not what we promised when the Federal Reserve committed to the 2% target.' 'Stalling out at 3% is not a safe place to be for a myriad of reasons,' he added.\"</p> <p class=\"paywall-full-content\">February 24 - Bloomberg (Maria Eloisa Capurro): \"Federal Reserve Bank of Boston President Susan Collins said interest rates are likely to stay unchanged 'for some time' as recent economic data shows an improvement in the labor market, while risks to inflation remain. The labor market is showing 'at least some more signs of an unusual kind of stability,' Collins said… 'I think that it's quite likely that it will be appropriate to hold the current range for some time,' she said. 'After 175 bps of easing over the past year and a half, we are at mildly restrictive, perhaps quite close to neutral already,' Collins said…\"</p> <p class=\"paywall-full-content\">February 23 - Wall Street Journal (Matt Grossman): \"Federal Reserve governor Christopher Waller indicated… he may join the majority of Fed officials likely to support leaving interest rates on hold in March if February data show the labor market on solid footing… 'If these data support the idea of an improvement in the labor market in January that continued in February, along with additional progress toward 2% inflation, that could result in my outlook turning a bit more positive and my view of appropriate monetary policy may tilt toward a pause at our upcoming meeting,' Waller said…\"</p> <p class=\"paywall-full-content\">February 25 - Bloomberg (Katanga Johnson): \"Federal Reserve Vice Chair for Supervision Michelle Bowman said that while the banking system remains strong, it is important that traditional lenders be given tools and flexibility to 'compete effectively.' 'Non-bank financial institutions continue to increase their share of the total lending market, creating strong competition for regulated banks without facing the same capital, liquidity, and other prudential standards,' Bowman said… Trump-era regulators recently eased post-crisis rules that spurred complaints from bankers they were being sidelined by too much regulation amid rapid growth in the private credit industry. Officials have also eased some capital requirements for Wall Street lending giants and told examiners to focus on core financial risks instead of process-related items.\"</p> <p class=\"paywall-full-content\">February 26 - Reuters (Howard Schneider): \"Federal Reserve Governor Stephen Miran said ‌strong job growth in January ‌was 'a really good thing,' but that the Fed should still cut a full percentage point from its policy rate this year because there were ‌still risks ⁠to the labor market while inflation was no longer ⁠a problem. 'I think it's way too early to sort of sound an all clear that the labor market ‌doesn't need more support from the Federal Reserve. I definitely think the labor market can be supported by the Federal Reserve further,' ‌with four cuts this year, Miran said… 'I really ‌do not think that we have an inflation problem'…\"</p> <p class=\"paywall-full-content\"><strong>U.S. Economic Bubble Watch:</strong></p> <p class=\"paywall-full-content\">February 24 - Associated Press (Matt Ott): \"The American consumer's confidence in the U.S. economy improved slightly in February after cratering a month earlier. The Conference Board said… its consumer confidence index rose to 91.2 in February from an upwardly revised 89 last month. A measure of Americans' short-term expectations for their income, business conditions and the job market rose four points to 72… The measure of consumers' assessments of their current economic situation fell by 1.8 points to 120. Respondents' references to prices and inflation were little changed but remain elevated.\"</p> <p class=\"paywall-full-content\">February 26 - Associated Press (Matt Ott): \"Slightly more Americans applied for unemployment benefits last week as layoffs remain at relatively healthy levels. The number of Americans filing for jobless aid for the week ending Feb. 21 rose by 4,000 to 212,000 from the previous week… The total number of Americans filing for jobless benefits for the previous week ending Feb. 14 fell by 31,000 to 1.83 million…\"</p> <p class=\"paywall-full-content\">February 24 - Reuters (Lucia Mutikani): \"U.S. single-family house price gains slowed in December, but economists believe tight inventory could prevent an outright decline in national home prices. House prices edged up 0.1% after an upwardly revised 0.7% increase in November, the Federal Housing Finance Agency said... Prices increased 1.8% in the 12 months through December, after climbing 2.1% in November. They rose 0.8% in the fourth quarter. Supply remains tight, especially for entry-level homes, propping up prices and keeping the dream of owning a house out of reach for many Americans.\"</p> <p class=\"paywall-full-content\">February 26 - Associated Press (Alex Veiga): \"The average long-term U.S. mortgage rate slipped this week below 6% for the first time since late 2022… The benchmark 30-year fixed rate mortgage rate fell to 5.98% from 6.01% last week… One year ago, the rate averaged 6.76%.\"</p> <p class=\"paywall-full-content\">February 24 - Wall Street Journal (Jessica Coacci): \"U.S. home-price growth slowed to its lowest annual level in over a decade… The S&amp;P Cotality Case-Shiller National Home Price Index… rose 1.3% in the 12 months through December, compared with a 1.4% increase in November. 'National home prices grew just 1.3% for the year-the weakest full-year gain since 2011,' said Nicholas Godec at S&amp;P Dow Jones Indices.\"</p> <p class=\"paywall-full-content\"><strong>China Watch:</strong></p> <p class=\"paywall-full-content\">February 26 - Bloomberg (Foster Wong and Josh Xiao): \"China removed nine military lawmakers from its national parliament in the latest sign that President Xi Jinping's purge of key defense establishment personnel continues to widen. The country's top legislative body revoked the membership of Ground Force Commander Li Qiaoming and Information Support Force Political Commissar Li Wei, along with seven other military officials…\"</p> <p class=\"paywall-full-content\"><strong>Japan Watch:</strong></p> <p class=\"paywall-full-content\">February 25 - Wall Street Journal (Megumi Fujikawa): \"With deflation now firmly in the rearview mirror, the path is clear for the Bank of Japan to raise interest rates sooner rather than later, said policy board member Hajime Takata. 'I believe the bank should make a further gear shift, and engage in communication that assumes that the price stability target is almost achieved,' Takata said… He also flagged the risk that an external shock could drive Japan's inflation up more than expected.\"</p> <p class=\"paywall-full-content\">February 24 - Reuters (Leika Kihara): \"Japan must keep raising interest rates and tighten fiscal policy as the economy is already in 'great shape,' former central bank chief Haruhiko Kuroda said, warning that Premier Sanae Takaichi's big spending plan could stoke an inflationary upswing. With the economy enjoying solid growth and steady wage gains, the Bank of Japan can probably raise interest rates about twice a year in 2026 and 2027, said Kuroda… 'When Abenomics was deployed, Japan was suffering from deflation and a strong yen. Now, Japan is experiencing inflation and a weak yen. Japan needs to move toward tighter fiscal and monetary policy,' Kuroda said... 'The BOJ must gradually raise interest rates towards levels deemed neutral to the economy. Fiscal policy must be tightened, too,' Kuroda said.\"</p> <p class=\"paywall-full-content\"><strong>EM Watch:</strong></p> <p class=\"paywall-full-content\">February 22 - Financial Times (Song Jung-a, Daniel Tudor and William Sandlund,): \"On the bustling streets of Seoul, it is common to see buses with adverts on their sides for exchange traded funds, encouraging people to put their retirement savings into versions of these normally vanilla investment products that are often complex and speculative. They have a receptive audience. After many missed out on the South Korean stock market's world-beating 76% rally last year, and with markets powering ahead again, retail traders - commonly known as 'ants' - are flocking to these funds, particularly leveraged ones that amplify moves in the prices of the assets they track.\"</p> <p class=\"paywall-full-content\">February 22 - Bloomberg (Chiranjivi Chakraborty, Shruti Srivastava, and Ranjani Raghavan): \"In the autumn of 2024, a senior Indian securities regulator stood before a room full of money managers and foreign investors with an unusual message: India did not want to be the world's largest derivatives market. 'This is a crown we don't wish to wear,' Ashwani Bhatia, then a board member of the Securities and Exchange Board of India said... The authorities raised the ante 10 days ago, when the Reserve Bank of India curbed lending to stock brokers and proprietary traders. The move targeted the leverage that fueled explosive growth in the derivatives market, where average daily notional turnover reached $5.2 trillion by the end of 2025.\"</p> <p class=\"paywall-full-content\">February 22 - Associated Press (Fabiola Sanchez): \"The Mexican army killed the leader of the Jalisco New Generation Cartel, Nemesio Rubén Oseguera Cervantes, 'El Mencho,' on Sunday… The drug lord was the Mexican government's biggest prize yet to show the Trump administration in its efforts to crack down on the cartels, and his death was met with a forceful reaction from the cartel… Cars burned out by cartel members blocked roads at more than 250 points in 20 Mexican states…\"</p> <p class=\"paywall-full-content\"><strong>Leveraged Speculation Watch:</strong></p> <p class=\"paywall-full-content\">February 23 - Bloomberg (Michael Msika): \"Rotational volatility has pushed hedge funds to trim gross leverage from record levels and turn over their portfolio positions at the highest rate since 2021, according to… Goldman Sachs. A team led by Ben Snider writes gross leverage remains close to record highs, while short interest in the median S&amp;P 500 stock is still near the highest seen in recent years, particularly in defensives and small-caps. Says concentration within hedge fund portfolios and crowding across these portfolios remain elevated versus historical trends…\"</p> <p class=\"paywall-full-content\">February 23 - Bloomberg (Jan-Patrick Barnert): \"Hedge funds' net sales of global stocks reached the fastest pace since the tariff meltdown of early April 2025, according to… Goldman Sachs… Net selling in the week through Feb. 19 was so strong that it registered a negative 1.4 standard deviation from typical levels…\"</p> <p class=\"paywall-full-content\">February 23 - Bloomberg (Sidhartha Shukla): \"Hedge funds that helped fuel a boom in US exchange-traded funds holding Bitcoin are in rapid retreat. Aggregate Bitcoin ETF allocations among the largest hedge fund holders fell 28% from the third to the fourth quarter of 2025, according to… CF Benchmarks, a wholly-owned subsidiary of crypto exchange Kraken.\"</p> <p class=\"paywall-full-content\"><strong>Social, Political, Environmental and Cybersecurity Instability Watch:</strong></p> <p class=\"paywall-full-content\">February 26 - Wall Street Journal (Kris Maher): \"Pollution from U.S. power plants rose last year, a rare uptick in an otherwise long-term downward trend, partly because of more coal being burned to generate electricity. Levels of sulfur dioxide emitted from power-plant stacks were up about 18%, with nitrogen oxide up 7% and carbon dioxide up 4%, according to… Environmental Protection Agency data... The rise in emissions comes as President Trump has promoted the use of coal and worked to unwind Biden-era environmental regulations. Earlier this month, the EPA reversed a finding that carbon dioxide poses a risk to public health and welfare. Last week, the agency repealed the Biden administration's stricter emissions standards on mercury, arsenic and other air toxics…\"</p> <p class=\"paywall-full-content\">February 23 - Axios (Sam Sabin): \"As artificial intelligence accelerates, so does the prospect of a cyberattack powerful enough to shut down hospitals, black-out cities and disrupt core government systems. Just by scaling and accelerating the cyberwarfare tools adversaries already have, AI can turn manageable intrusions into large-scale crises. Axios asked seven former senior cybersecurity officials and leading security experts what a major AI-enabled cyberattack would look like and what worries them the most about current advancements in generative AI. Several of the experts pointed to the vulnerability of utilities, particularly water and electricity… Gen. Paul Nakasone, former head of the NSA and Cyber Command, raised the possibility that a nation-state that has breached systems critical to supplies of food and water could trigger an outage accidentally, if they lose control of an AI agent.\"</p> <p class=\"paywall-full-content\">February 23 - CNBC (Gili Malinsky): \"In December 2025, Australia became the first country to bar anyone under 16 from keeping or making social media accounts… The goal is 'to protect young Australians from pressures and risks' that emerge from social media use... Risks include 'design features that encourage them to spend more time on screens' and harmful content they might encounter… Around the world, other countries are following suit. Malaysia began barring kids under 16 from creating social media accounts in January, and Spain began doing so in February. Countries like Greece, France, and Denmark are currently working on their own restrictions for under 15 or 16-year-olds as well.\"</p> <p class=\"paywall-full-content\">February 25 - Wall Street Journal (Drew Hinshaw and Joe Parkinson): \"In its 250th year, is America, land of immigration, becoming a country of emigration? Last year the U.S. experienced something that hasn't definitively occurred since the Great Depression: More people moved out than moved in. The Trump administration has hailed the exodus-negative net migration-as the fulfillment of its promise to ramp up deportations and restrict new visas. Beneath the stormy optics of that immigration crackdown, however, lies a less-noticed reversal: America's own citizens are leaving in record numbers, replanting themselves and their families in lands they find more affordable and safe.\"</p> <p class=\"paywall-full-content\">February 26 - Associated Press (Seth Borenstein): \"Billions fewer birds are flying through North American skies than decades ago and their population is shrinking ever faster, mostly due to a combination of intensive agriculture and warming temperatures, a new study found. Nearly half of the 261 species studied showed big enough losses in numbers to be statistically significant and more than half of those declining are seeing their losses accelerate since 1987, according to Thursday's journal Science.\"</p> <p class=\"paywall-full-content\"><strong>Geopolitical Watch:</strong></p> <p class=\"paywall-full-content\">February 27 - Financial Times (Humza Jilani): \"Pakistan launched air strikes on Afghanistan on Friday, saying it had killed hundreds of Taliban forces and associated militants as conflict between the neighbours threatened to escalate into outright war. The bombardment included extensive air strikes and artillery fire targeting military installations as well as major urban areas, including the capital Kabul and Kandahar, where Taliban supreme leader Hibatullah Akhundzada is based. The assault came in response to an attack on Thursday night on Pakistani border posts that officials in Islamabad said was carried out by Afghan Taliban forces and the officially separate militant group Tehreek-e-Taliban Pakistan. Last weekend, Pakistan carried out air strikes on what it said were militant positions in east Afghanistan.\"</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2214651343/image_2214651343.jpg",
            "link": "https://seekingalpha.com/article/4876723-weekly-commentary-sometimes-not-liquid-at-all",
            "pub_date": "2026-02-28 16:46:40",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876722",
            "title": "BNY Mellon Small Cap Value Fund Q4 2025 Commentary",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417147459/image_1417147459.jpg?io=getty-c-w630\" alt=\"Closeup Benjamin Franklin face on USD banknote with stock market chart graph for currency exchange and global trade forex concept.\" data-id=\"1417147459\" data-type=\"getty-image\" width=\"1536\" height=\"573\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417147459/image_1417147459.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417147459/image_1417147459.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417147459/image_1417147459.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417147459/image_1417147459.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417147459/image_1417147459.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417147459/image_1417147459.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417147459/image_1417147459.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417147459/image_1417147459.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"></p> <p class=\"item-credits\">Dilok Klaisataporn/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Market Review</h2> <p>Equity performance was broadly positive across developed and emerging markets. Cooling inflation across major economies, resilient economic growth and improving visibility on corporate earnings supported investor confidence, despite ongoing geopolitical and policy uncertainty. Risk sentiment was<span class=\"paywall-full-content\"> further boosted by selective central bank easing and year-end portfolio rebalancing, underpinning gains across global equities. The S&amp;P 500® Index increased by 2.65% for the quarter. Within the index, eight of the 11 Global Industry Classification Standard ('GICS') equity sectors finished in positive territory, led by health care and communication services. Value stocks outperformed growth stocks. Among other major equity benchmarks, the MSCI EAFE Index, a measure of developed markets excluding the US and Canada, increased by 4.86%, while the MSCI Emerging Markets Index increased by 4.73%.</span></p> <p class=\"paywall-full-content\">Fixed-income market performance in developed markets was generally positive. The Bloomberg® US Aggregate Index returned 1.10%. The Bloomberg Global Aggregate Hedged Index returned 0.78%, while the Bloomberg Global Aggregate Unhedged Index returned 0.24% during the quarter.</p> <p class=\"paywall-full-content\">In the US, equities generally advanced during the fourth quarter. The Dow Jones Industrial Average® increased by 4.03%, while the NASDAQ 100 Index® increased by 2.47%. US fixed-income markets also posted gains. Markets proved resilient amid elevated uncertainty driven by a prolonged federal government shutdown and ongoing geopolitical tensions in the Middle East. Inflation, as measured by the headline consumer-price index, eased gradually from 3.0% year-over-year in September to 2.7% year-over-year in November. Labor market data, while disrupted and delayed, pointed to slowing momentum rather than a sharp deterioration. Economic growth remained firm, with third-quarter gross domestic product ('GDP') rising at a solid 4.3% annualized, supported by consumer spending and government outlays despite softer retail sales and business investment. Against this backdrop, the Federal Reserve cut rates by 25 basis points (<a href=\"https://seekingalpha.com/symbol/BPS\" title=\"BPS Technology Public Company Limited\">BPS</a>) early in the quarter, while maintaining a cautious tone and reaffirming a data-dependent policy stance as markets looked ahead to 2026.</p> <p class=\"paywall-full-content\">Equity markets in developed economies were broadly higher during the quarter. In the eurozone, fourth-quarter data signaled easing inflation and mixed growth dynamics. Inflation moderated toward the European Central Bank's (ECB's) 2% target, while business activity improved and GDP grew modestly, enabling the ECB to keep rates unchanged throughout the quarter. UK inflation declined steadily from elevated levels, while growth weakened and labor markets softened. The Bank of England shifted from holding rates earlier in the quarter to a 25-bp cut at its December meeting. In Japan, inflation remained above target and unemployment stayed low, despite a third-quarter GDP contraction and softer activity indicators. As a result, the Bank of Japan ended its hold with a late-quarter 25-bp hike, continuing its normalization effort.</p> <p class=\"paywall-full-content\">Emerging-market equities were positive for the quarter. In China, growth slowed from earlier in the year, and consumer and property-sector weakness persisted; however, data showed tentative stabilization, as manufacturing and services activity returned to slight expansion, enabling the People's Bank of China to keep lending rates unchanged throughout the quarter. Brazil's economy softened into the fourth quarter amid widening external deficits and weaker activity indicators. Nonetheless, the central bank maintained its restrictive 15% policy rate despite easing inflation. India stood out with solid momentum, posting robust GDP growth, rising industrial output and relatively contained inflation, supported by government commitments to greater capital spending and reform. In contrast, Mexico faced weak growth and a third-quarter contraction, prompting successive rate cuts as inflation eased. Argentina bolstered financial stability through a sizeable currency-swap agreement and improving US export prospects.</p> <p class=\"paywall-full-content\">Commodities were slightly higher, with the Refinitiv/CoreCommodity CRB Index rising 0.35%. During the fourth quarter, precious metals posted solid gains, with gold, silver and platinum supported by safe-haven demand amid geopolitical tensions, a US government shutdown and a weaker US dollar, culminating in a robust year-end rally. In contrast, energy markets were softer. Oil prices trended lower throughout the quarter as ample global supply, rising inventories and slowing demand outweighed geopolitical risks. Natural gas was volatile, rising early in the quarter on colder weather, liquefied natural gas export demand and seasonal heating needs, before ending the year lower as weather-driven strength faded. The US dollar weakened against a basket of major currencies.</p> <h2 class=\"paywall-full-content\">Quarterly Performance</h2> <p class=\"paywall-full-content\">BNY Mellon Small Cap Value Fund (Class A at NAV) underperformed its benchmark, the Russell 2000 Value Index, during the fourth quarter of 2025. From a sector perspective, information technology and consumer discretionary contributed to relative results, while health care and financials detracted.</p> <h2 class=\"paywall-full-content\">Sector Review</h2> <h3 class=\"paywall-full-content\">Positive Impacts</h3> <p class=\"paywall-full-content\">Information Technology: Stock selection within the information technology sector contributed to relative performance during the quarter. Notably, out-of-index optical and photonics firm Lumentum Holdings (<a href=\"https://seekingalpha.com/symbol/LITE\" title=\"Lumentum Holdings Inc.\">LITE</a>) saw significant tailwinds following the expansion of its US-based semiconductor facility. The company's San Jose operation manufactures the ultra high power ('UHP') laser, a key component supporting the buildout of modern artificial intelligence ('AI') data centers.</p> <p class=\"paywall-full-content\">Consumer Discretionary: Stock selection within consumer discretionary also contributed to relative returns. Out-of-index holding FIGS Class A (<a href=\"https://seekingalpha.com/symbol/FIGS\" title=\"FIGS, Inc.\">FIGS</a>), a direct-to-consumer medical apparel maker, advanced after reporting robust third-quarter earnings, including the surpassing of sales expectations, margin expansion, and raised guidance, as positive top-line trends are expected to accelerate.</p> <h3 class=\"paywall-full-content\">Negative Impacts</h3> <p class=\"paywall-full-content\">Health Care: Unfavorable stock selection within the health care sector detracted from relative performance, particularly as multiple index constituents delivered double- and triple-digit returns over the quarter. An overweight position in Evolent Health Class A (<a href=\"https://seekingalpha.com/symbol/EVH\" title=\"Evolent Health, Inc.\">EVH</a>) weighed on results after the company declined following a disappointing third-quarter earnings call.</p> <p class=\"paywall-full-content\">Financials: Unfavorable stock selection in financials detracted from relative returns. Shares of commercial real estate company Walker &amp; Dunlop (<a href=\"https://seekingalpha.com/symbol/WD\" title=\"Walker &amp; Dunlop, Inc.\">WD</a>) declined after the firm reported softer-than-expected fourth-quarter earnings per share, alongside broader industry concerns regarding deteriorating loan quality.</p> <h2 class=\"paywall-full-content\">Stock Review 1</h2> <h3 class=\"paywall-full-content\">Key Contributors</h3> <p class=\"paywall-full-content\">Lumentum Holdings: Out-of-index optical and photonics firm Lumentum Holdings saw significant tailwinds following the expansion of its US-based semiconductor facility. The company's San Jose operation manufactures the ultra high power ('UHP') laser, a key component supporting the buildout of modern artificial intelligence ('AI') data centers.</p> <p class=\"paywall-full-content\">Alcoa Corporation (<a href=\"https://seekingalpha.com/symbol/AA\" title=\"Alcoa Corporation\">AA</a>): Alcoa benefited from broad-based strength across the US metals and mining industry, as rising commodity prices supported sector performance. The company also announced an expansion of its New York operations through a new 10-year agreement with the New York Power Authority.</p> <p class=\"paywall-full-content\">Liberty Energy Class A (<a href=\"https://seekingalpha.com/symbol/LBRT\" title=\"Liberty Energy Inc.\">LBRT</a>): Liberty Energy, an onshore oilfield services provider, advanced as rising energy demand, supported in part by the expansion of AI data centers, continued to strengthen the services market.</p> <h3 class=\"paywall-full-content\">Key Detractors</h3> <p class=\"paywall-full-content\">Janus International Group (JNI): Shares of Janus International declined after the company reported third-quarter revenue below expectations, driven primarily by softness in the commercial segment.</p> <p class=\"paywall-full-content\">Walker &amp; Dunlop: Shares of commercial real estate company Walker &amp; Dunlop declined after the firm reported softer-than-expected fourth-quarter earnings per share, alongside broader industry concerns regarding deteriorating loan quality.</p> <p class=\"paywall-full-content\">Evolent Health Class A: The public health technology and services company declined following a disappointing third-quarter earnings call.</p> <h2 class=\"paywall-full-content\">Market Outlook</h2> <p class=\"paywall-full-content\">Heading into 2026, the macro backdrop reflects a measured balance. Inflation continues to moderate, with the US consumer-price index ('CPI') up 2.7% year-over-year and core CPI up 2.6% year-over-year in November, while wage growth and consumer spending have cooled without pointing to recession. In December, the Federal Reserve (Fed) lowered its target range to 3.50%–3.75%, signaling a shift toward easing while reaffirming a data-dependent approach amid mixed committee views. Global growth forecasts hover around 3.2% for 2025 and 3.1% for 2026. Supportive factors include selective fiscal measures in China and a gradual recovery in Europe, while trade policy uncertainty and geopolitical risks remain notable headwinds.</p> <p class=\"paywall-full-content\">Corporate earnings remain resilient, with S&amp;P 500 earnings per share up nearly 13% in the third quarter and projected to rise 8% in the fourth quarter, underpinned by solid margins and improving breadth beyond mega-cap technology. However, forward price-to-earnings ratios are near 21.8, elevated versus historical averages, suggesting limited capacity for multiple expansion without additional rate relief or better-than-expected earnings. In our view, international equities, particularly developed-market value segments, offer relative attractiveness with potentially lower multiples and higher dividend yields, while thematic opportunities in AI infrastructure, electrification and energy transition may continue to draw capital.</p> <p class=\"paywall-full-content\">Looking ahead, equities appear biased toward modest gains rather than outsized rallies. Positioning may favor quality growth with durable cash flows, complemented by selective cyclicals linked to tangible AI infrastructure and quality small caps that could potentially benefit from policy normalization. Risks include sticky services inflation, labor market deterioration and renewed supply-chain disruptions, while catalysts, such as January consumer-price inflation, Fed communications and fourth-quarter earnings could shape sentiment. In short, we believe the environment supports a disciplined allocation framework that balances the potential upside from policy easing and earnings resilience against valuation constraints and geopolitical volatility.</p> <p class=\"paywall-full-content\">In our view, small-cap equities may be increasingly attractive in 2026, supported by a convergence of macro, policy and earnings momentum. First, anticipated Fed rate cuts in 2026 could benefit small caps, which tend to be more sensitive to lower borrowing costs. Second, valuations remain discounted; Bank of America projects S&amp;P SmallCap 600 earnings-per-share growth of approximately 19% for 2026, above the broader S&amp;P 500, suggesting favorable entry points. Third, cyclical tailwinds like reshoring, AI-driven capital investment, rising merger-and-acquisition activity and signs of a prospective initial-public-offering rebound may offer additional earnings catalysts. We broadly expect small-cap leadership to extend into 2026 as funds rotate out of overvalued mega caps into this historically overlooked segment. Overall, the combination of improving macroeconomics, lower valuations and accelerating earnings momentum suggests a supportive setup for US small caps, with scope for continued recovery and relative outperformance.</p> <p class=\"paywall-full-content\">The 2026 outlook for international markets is supported by attractive valuations, policy accommodation in select regions and strengthening macro data. The European Central Bank's neutral-to-accommodative stance, coupled with fiscal initiatives that are boosting credit growth and industrial activity, supports consensus expectations for approximately 15% earnings-per-share growth in 2026. Meanwhile, Asia may benefit from robust export demand, AI-driven semiconductor momentum and targeted stimulus in China to stabilize property and manufacturing sectors. Regional growth forecasts range from 3.4% to 4.6%. Both regions may offer compelling opportunities in cyclicals, financials and infrastructure-linked sectors, with potential dividend yields and valuation discounts versus US equities adding support. Together, Europe and Asia offer diversified exposure amid a rotation toward broader leadership and structural growth themes.</p> <p class=\"paywall-full-content\"> </p> <hr class=\"paywall-full-content\"> <p class=\"paywall-full-content\"> </p> <h4 class=\"paywall-full-content\">References</h4> <ol class=\"paywall-full-content\"><li>Performance of individual stock evaluated is based on total effect. Total effect represents the opportunity cost of an investment manager's investment decisions relative to an overall benchmark, which can include holdings that are not held by the portfolio but contribute to relative portfolio performance.</li></ol> <p class=\"paywall-full-content\"></p> <hr class=\"paywall-full-content\"> <p class=\"paywall-full-content\"> </p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table><tbody><tr><td> <p></p> <p></p> <p>BNY Mellon Small Cap Value Fund</p> <p>CLASS A RUDAX (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/RUDAX\" title=\"BNY Mellon Small Cap Value Fund A\">RUDAX</a></span>)</p> <p>CLASS C BOSCX (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BOSCX\" title=\"BNY Mellon Small Cap Value Fund C\">BOSCX</a></span>)</p> <p>CLASS I STSVX (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/STSVX\" title=\"BNY Mellon Small Cap Value Fund I\">STSVX</a></span>)</p> <p>Investors should consider the investment objectives, risks, charges and expenses of a mutual fund carefully before investing. To obtain a prospectus, or a summary prospectus, if available, that contains this and other information about a fund, contact your financial professional. For more information, call 1-800-373-9387 or visit <a href=\"https://www.bny.com/investments\" rel=\"nofollow\">BNY Investments</a> . Read the prospectus carefully before investing. Investors should discuss with their financial professional the eligibility requirements for Class I shares, which are available only to certain eligible investors, and the historical results achieved by the fund's respective share classes.</p> <p>Past performance is no guarantee of future results.</p> <p>Risks</p> <p>Equities are subject to market, market sector, market liquidity, issuer, and investment style risks, to varying degrees. Small and mid-sized company stocks tend to be more volatile and less liquid than larger company stocks as these companies are less established and have more volatile earnings histories. Investing in foreign denominated and/or domiciled securities involves special risks, including changes in currency exchange rates, political, economic, and social instability, limited company information, differing auditing and legal standards, and less market liquidity. These risks generally are greater with emerging market countries.</p> <p>Artificial intelligence refers to computer systems that can perform tasks typically requiring human intelligence, such as visual perception, speech recognition, decision making and language translation. Sticky inflation is when prices for certain goods and services, like rent, insurance, and medical care, change very slowly and persist at high levels, even as other economic factors shift.</p> <p>As of 12/31/25, the fund's top ten holdings were: Columbia Banking System (<a href=\"https://seekingalpha.com/symbol/COLB\" title=\"Columbia Banking System, Inc.\">COLB</a>) 1.79%, Alamos Gold, Cl. A (<a href=\"https://seekingalpha.com/symbol/AGI\" title=\"Alamos Gold Inc.\">AGI</a>) 1.76%, Viavi Solutions (<a href=\"https://seekingalpha.com/symbol/VIAV\" title=\"Viavi Solutions Inc.\">VIAV</a>) 1.70%, Genius Sports (<a href=\"https://seekingalpha.com/symbol/GENI\" title=\"Genius Sports Limited\">GENI</a>) 1.69%, First Horizon (<a href=\"https://seekingalpha.com/symbol/FHN\" title=\"First Horizon Corporation\">FHN</a>) 1.55%, First Merchants (<a href=\"https://seekingalpha.com/symbol/FRME\" title=\"First Merchants Corporation\">FRME</a>) 1.52%, First Bussey (<a href=\"https://seekingalpha.com/symbol/BUSE\" title=\"First Busey Corporation\">BUSE</a>) 1.52%, Simmons First National (<a href=\"https://seekingalpha.com/symbol/SFNC\" title=\"Simmons First National Corporation\">SFNC</a>) 1.50%, Alcoa 1.38%, YETI Holdings (<a href=\"https://seekingalpha.com/symbol/YETI\" title=\"YETI Holdings, Inc.\">YETI</a>) 1.32%.</p> <p>As of 12/31/25, the companies mentioned represented 6.22% of the fund's portfolio in the aggregate. Evolent Health was not a portfolio holding as of 12/31/25. The holdings listed should not be considered recommendations to buy or sell a particular security. Other holdings may not have performed as well as some of those listed herein. Portfolio composition is subject to change at any time.</p> <p>The Russell 2000® Value Index measures the performance of the small-cap growth segment of the U.S. equity universe. It includes those Russell 2000 companies with lower growth earning potential as defined by Russell's leading style methodology. The Russell 2000® Value Index is constructed to provide a comprehensive and unbiased barometer for the small-cap value segment. The S&amp;P 500® Index is widely regarded as the best single gauge of large-cap U.S. equities. The index includes 500 leading companies and captures approximately 80% coverage of available market capitalization. This is not a benchmark for the fund. The Morgan Stanley Capital International Europe, Australasia, Far East (MSCI EAFE®) Index is a free float-adjusted, market capitalization-weighted index that is designed to measure equity performance in developed markets, excluding the United States and Canada. The index consists of select designated MSCI national developed market indices. The MSCI Emerging Markets Index is a free float-adjusted, market capitalization-weighted index that is designed to measure the equity performance in global emerging markets. The index consists of 22 MSCI emerging-market national indices. This is not a benchmark for the fund. The Dow Jones Industrial Average , Dow Jones, or simply the Dow, is a stock market index of 30 prominent companies listed on stock exchanges in the United States. The Nasdaq-100 Index is a stock market index made up of equity securities issued by 100 of the largest non-financial companies listed on the Nasdaq stock exchange. The Refinitiv/CoreCommodity CRB Index is a benchmark index that tracks the price movements of a basket of 19 globally traded commodities. It is designed to provide a broad representation of the commodity market, and is used as a benchmark for commodity-related investments. GICS stands for the Global Industry Classification Standard , a system developed by S&amp;P Dow Jones Indices and MSCI to categorize companies into sectors and industries based on their principal business activities. The Bloomberg U.S. Aggregate Index is designed to measure the investment grade, U.S. dollar-denominated, fixed-rate taxable bond market. The index includes Treasuries, government-related and corporate securities, mortgage-backed pass-through securities (agency fixed-rate), commercial mortgage-backed securities (agency and non-agency) and other asset-backed securities having at least one year until final maturity. To be included in the index, securities must be rated investment grade (Baa3/BBB-/BBB- or higher) using the middle rating of Moody's, S&amp;P and Fitch. The Bloomberg Global Aggregate Hedged Index is a flagship measure of global investment-grade debt from 24 local currency markets. This multi-currency benchmark includes treasury, government-related, corporate and securitized fixed-rate bonds from both developed and emerging market issuers. Currency exposure is hedged to the U.S. dollar. The Bloomberg Global Aggregate Unhedged Index is a flagship measure of global investment-grade debt from 24 local currency markets. This multi-currency benchmark includes treasury, government-related, corporate and securitized fixed-rate bonds from both developed and emerging market issuers. Investors cannot invest directly in an index.</p> <p>Definitions</p> <p>Q is quarter. NAV is Net Asset Value. YTD is Year to Date. FDIC is Federal Deposit Insurance Corp. CRB is Commodity Research Bureau. LLC is Limited Liability Company.</p> <p>The fund's investment adviser is BNY Mellon Investment Adviser, Inc. ('BNYIA'). BNYIA has engaged its affiliate, Newton Investment Management North America, LLC ('NIMNA'), to serve as the fund's sub-adviser. NIMNA has entered into a sub-sub-investment advisory agreement with its affiliate, Newton Investment Management Limited ('NIM'), to enable NIM to provide certain advisory services to NIMNA for the benefit of the fund.</p> <p>This material has been provided for informational purposes only and should not be construed as investment advice or a recommendation of any particular investment product, strategy, investment manager or account arrangement, and should not serve as a primary basis for investment decisions. Prospective investors should consult a legal, tax or financial professional in order to determine whether any investment product, strategy or service is appropriate for their particular circumstances. Views expressed are those of the author stated and do not reflect views of other managers or the firm overall. Views are current as of the date of this publication and subject to change. This information contains projections or other forward-looking statements regarding future events, targets or expectations, and is only current as of the date indicated. There is no assurance that such events or expectations will be achieved, and actual results may be significantly different from that shown here. The information is based on current market conditions, which will fluctuate and may be superseded by subsequent market events or for other reasons. References to specific securities, asset classes and financial markets are for illustrative purposes only and are not intended to be and should not be interpreted as recommendations. Information contained herein has been obtained from sources believed to be reliable, but not guaranteed. No part of this material may be reproduced in any form, or referred to in any other publication, without express written permission.</p> <p>BNY Mellon Investment Adviser, Inc. ('BNYIA'), Newton Investment Management Limited ('NIM'), Newton Investment Management North America ('NIMNA') and BNY Mellon Securities Corporation are subsidiaries of BNY. BNY is the corporate brand of The Bank of New York Mellon Corporation. © 2025 BNY Mellon Securities Corporation , distributor, 240 Greenwich Street, 9th Floor, New York, NY 10286. </p> <p>Not FDIC-Insured. Not Bank-Guaranteed. May Lose Value</p> </td></tr></tbody></table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <hr class=\"paywall-full-content\"> <p class=\"paywall-full-content\"><a href=\"https://www.bny.com/content/dam/im/documents/imwebdocs/commentary/quarterly/4032qc.pdf\" rel=\"noopener noopener\"><strong>Original Post</strong></a> </p> <p class=\"paywall-full-content\"><strong>Editor's Note:</strong> The summary bullets for this article were chosen by Seeking Alpha editors.<a href=\"blob:https://2vtaojjlbdml2ka53utuv82tr7xfagovem04ofd2im8y6zfvt4-h874623575.scf.usercontent.goog/c71ea962-165f-4f71-98e3-f415bd8e6d20#\" rel=\"nofollow\"></a> </p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Editor's Note: This article covers one or more microcap stocks. Please be aware of the risks associated with these stocks.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417147459/image_1417147459.jpg",
            "link": "https://seekingalpha.com/article/4876722-bny-mellon-small-cap-value-fund-q4-2025-commentary",
            "pub_date": "2026-02-28 16:35:53",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876720",
            "title": "Bitcoin Slides Below $66,000 As Inflation Cools Rate Cut Hopes",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1329055819/image_1329055819.jpg?io=getty-c-w630\" alt=\"Olsztyn, Poland 13 July 2021. Golden bitcoin coin over defocused stock chart\" data-id=\"1329055819\" data-type=\"getty-image\" width=\"1536\" height=\"919\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1329055819/image_1329055819.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1329055819/image_1329055819.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1329055819/image_1329055819.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1329055819/image_1329055819.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1329055819/image_1329055819.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1329055819/image_1329055819.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1329055819/image_1329055819.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1329055819/image_1329055819.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Nastco/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p><em>By Yaroslav Dmytrenko</em></p> <p><em>Bitcoin (<a href=\"https://seekingalpha.com/symbol/BTC-USD\" title=\"Bitcoin USD\">BTC-USD</a>) fell below $66,000 on Friday after hotter-than-expected U.S. producer inflation data triggered a broad sell-off in technology stocks. </em></p> <h2>Rate cut hopes fade</h2> <p>U.S. macroeconomic data released Friday showed that the<span class=\"paywall-full-content\"> Producer Price Index (PPI) rose 0.5% month-over-month in January, exceeding expectations of 0.3%.</span></p> <p class=\"paywall-full-content\">Core PPI, which excludes volatile food and energy prices, increased 0.8% for the month — also well above the 0.3% forecast.</p> <p class=\"paywall-full-content\">The renewed acceleration of inflation at the start of the year further delays potential Federal Reserve rate cuts, whose timing was already uncertain, and intensified the sell-off in major technology stocks.</p> <p class=\"paywall-full-content\">Companies such as Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>), Broadcom (<a href=\"https://seekingalpha.com/symbol/AVGO\" title=\"Broadcom Inc.\">AVGO</a>), Micron (<a href=\"https://seekingalpha.com/symbol/MU\" title=\"Micron Technology, Inc.\">MU</a>), Salesforce (<a href=\"https://seekingalpha.com/symbol/CRM\" title=\"Salesforce, Inc.\">CRM</a>), and Trade Desk (<a href=\"https://seekingalpha.com/symbol/TTD\" title=\"The Trade Desk, Inc.\">TTD</a>) dropped more than 5%, dragging down major indices. The Dow Jones Industrial Average and Nasdaq Composite led losses, each falling 1.1%, while the S&amp;P 500 declined 0.6%.</p> <p class=\"paywall-full-content\">In crypto-related equities, sentiment was further pressured after Jack Dorsey’s Block announced plans to cut 40% of its workforce, citing a strategic shift toward <a href=\"https://tradersunion.com/interesting-articles/best-algorithmic-trading-software-for-beginners/ai-trading-software/\" rel=\"noopener\">AI</a>-driven operations.</p> <h2 class=\"paywall-full-content\">Risk asset sell-off hits crypto market</h2> <p class=\"paywall-full-content\">Amid these developments, the crypto market initially showed resilience, supported by continued inflows into spot Bitcoin ETFs. Bitcoin hovered around $66,000, while Ethereum (<a href=\"https://seekingalpha.com/symbol/ETH-USD\" title=\"Ethereum USD\">ETH-USD</a>) traded near $1,950.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/55028208-17722663177271879_origin.png\" rel=\"lightbox\" data-width=\"1840\" data-height=\"934\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/55028208-17722663177271879_origin.png?io=w640\" alt=\"Bitcoin 4-hour chart\" contenteditable=\"false\" width=\"640\" height=\"325\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/55028208-17722663177271879_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/55028208-17722663177271879_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/55028208-17722663177271879_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/55028208-17722663177271879_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Bitcoin 4-hour chart. Source: TradingView</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">However, by the end of the day, BTC extended losses to $65,600 and ETH declined to $1,930. The broader crypto market fell more than 3% over 24 hours, with total market capitalization dropping to $2.26 trillion. Leading altcoins posted relatively moderate losses of 2–3%, and in some cases up to 5%.</p> <blockquote class=\"paywall-full-content\"><p>“Bitcoin’s decline reflects a broader reduction in market risk appetite rather than a crypto-specific crisis. Unless institutional inflows stabilize or macroeconomic concerns ease, downside pressure may persist in the short term,” said analyst Viktoras Karapetyants.</p></blockquote> <p class=\"paywall-full-content\">Historically, bearish Fridays tend to increase the likelihood of weekend weakness. In this context, a break below $65,500 could trigger a short-term move toward the $62,500–$63,000 range. The RSI may fall below 40, while the MACD remains in bearish territory with expanding histogram bars.</p> <p class=\"paywall-full-content\">A neutral scenario suggests consolidation within the $64,800–$67,500 range, with the MACD staying below the signal line but without strong downside acceleration and the RSI fluctuating around 45–50, indicating balanced buying and selling pressure.</p> <p class=\"paywall-full-content\">However, if buyers defend the $65,500 support level over the weekend, a rebound toward $68,500–$70,000 could materialize early next week — levels Bitcoin failed to firmly reclaim midweek following momentum sparked by Donald Trump’s U.S. economic policy speech.</p> <p class=\"paywall-full-content\">As we wrote, <a href=\"https://tradersunion.com/news/cryptocurrency-news/show/1572499-bitcoin-price-holds-above-67000/\" rel=\"noopener\">Bitcoin price holds above $67,000 as market enters consolidation phase</a> </p> <p class=\"paywall-full-content\"><em>This material may contain third-party opinions, none of the data and information on this webpage constitutes investment advice according to our <a href=\"https://tradersunion.com/terms-of-use/#p10\" rel=\"nofollow\">Disclaimer</a>. While we adhere to strict <a href=\"https://tradersunion.com/editorial-guidelines/\" rel=\"nofollow\">Editorial Integrity</a>, this post may contain references to products from our partners.</em></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\"><strong><a href=\"https://tradersunion.com/news/cryptocurrency-news/show/1581667-bitcoin-slides-below/\" rel=\"nofollow\">Original Post</a></strong></p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1329055819/image_1329055819.jpg",
            "link": "https://seekingalpha.com/article/4876720-bitcoin-slides-below-66000-inflation-cools-rate-cut-hopes",
            "pub_date": "2026-02-28 16:26:48",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876704",
            "title": "HubSpot: Finally A Bargain",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2175801796/image_2175801796.jpg?io=getty-c-w630\" alt=\"HubSpot Headquarters\" data-id=\"2175801796\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2175801796/image_2175801796.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2175801796/image_2175801796.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2175801796/image_2175801796.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2175801796/image_2175801796.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2175801796/image_2175801796.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2175801796/image_2175801796.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2175801796/image_2175801796.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2175801796/image_2175801796.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">hapabapa/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>HubSpot's (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/HUBS\" title=\"HubSpot, Inc.\">HUBS</a></span>) shares have materially corrected, while the business continues to demonstrate resilient growth and expanding profitability. We still see solid quarterly results, ARPU reacceleration, and stable customer dynamics. At the same time, current valuation creates an attractive entry<span class=\"paywall-full-content\"> point despite the key risk of potential growth deceleration.</span></p> <h2 class=\"paywall-full-content\">About the company</h2> <p class=\"paywall-full-content\">HubSpot, Inc., is a leading cloud-based CRM platform focused on marketing automation, sales, and customer service. The company offers modular cloud products that help clients attract traffic and generate leads, manage customer relationships (CRM), automate sales and service processes, and analyze the effectiveness of marketing and sales.</p> <p class=\"paywall-full-content\">HubSpot’s model is Software as a Service (SaaS) with recurring subscription-based revenue and an expandable product architecture (hubs/modules).</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721863324674573_origin.png\" rel=\"lightbox\" data-width=\"1162\" data-height=\"651\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721863324674573_origin.png?io=w640\" alt=\"Hubspot earnings slides\" contenteditable=\"false\" width=\"640\" height=\"359\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721863324674573_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721863324674573_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721863324674573_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721863324674573_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span></span>HubSpot <span>earnings slides</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Investment thesis</h2> <p class=\"paywall-full-content\">Here are the main reasons why we believe HubSpot stock has an appeal:</p> <ul class=\"paywall-full-content\"><li>HubSpot continues to outgrow the market, expanding by ~20%, while the rest of the TAM increases at a pace of about 10%–15%, according to various estimates (for example, <a href=\"https://www.grandviewresearch.com/industry-analysis/customer-relationship-management-crm-market#:~:text=CAGR%20%282025%2D2030%29%3A%2014.6%20%25\" rel=\"nofollow\">Grand View Research projects</a> 14.6% CAGR while <a href=\"https://www.statista.com/outlook/tmo/software/enterprise-software/customer-relationship-management-software/worldwide?srsltid=AfmBOory-UmTQZGEgVf7-nsFz_gkZQU8iDCPcDhjA2NPcHJnsuFj8y86#revenue\" rel=\"nofollow\">Statista projects</a> 9.8%). That means HubSpot is grabbing market share from competition, including its largest rival, Salesforce, which grows at an annual rate under 10%.</li></ul> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_customer-relationship-management-market.webp?io=w640\" alt=\"Customer relationship management market size by region, and growth forecast (2025-2030)\" contenteditable=\"false\" width=\"1024\" height=\"576\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_customer-relationship-management-market.webp?io=w750 750w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_customer-relationship-management-market.webp?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_customer-relationship-management-market.webp?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_customer-relationship-management-market.webp?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_customer-relationship-management-market.webp?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Grand View Research</span></p></figcaption></figure></p> <ul class=\"paywall-full-content\"><li>After a period of stagnation and cooling share prices (down 62% over the year), HubSpot looks attractive from a valuation standpoint for the first time in a long while. Over that same year, revenue jumped by 19%, and EBITDA became positive. Over the last two years, revenue has grown by 42%, while the share price has slumped by almost 50%. The current forward EV/EBITDA, according to SA is 14.5x, compared with a five-year average of 82x.</li></ul> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721890985784795_origin.png\" rel=\"lightbox\" data-width=\"1523\" data-height=\"598\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721890985784795_origin.png?io=w640\" alt=\"Hubspot charting\" contenteditable=\"false\" width=\"640\" height=\"251\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721890985784795_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721890985784795_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721890985784795_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721890985784795_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure></p> <ul class=\"paywall-full-content\"><li>The company continues to develop its product lineup by adding AI features and increases user engagement through cross-selling (customers are <a href=\"https://seekingalpha.com/article/4869081-hubspot-inc-hubs-q4-2025-earnings-call-transcript\">buying</a> more hubs—multi-hub expansion is also showing up across HubSpot's installed base, with 40% of the Pro Plus installed base by ARR owning 4 or more hubs, up 6 points year-over-year). This has a positive effect on ARPU, which is rising faster than inflation now.</li></ul> <h2 class=\"paywall-full-content\">4Q 2025 earnings</h2> <ul class=\"paywall-full-content\"> <li>Revenue jumped by 20.4% y/y to $846.7 mln,</li> <li>Adjusted EBITDA totaled $86.8 mln (5x y/y). We calculate adjusted EBITDA as operating profit + D&amp;A + SBC</li> </ul> <p class=\"paywall-full-content\"><strong>Operating metrics</strong></p> <p class=\"paywall-full-content\">The number of customers jumped by 16% y/y to 288,700, average subscription revenue per customer reached $11,683 (+3% y/y)</p> <p class=\"paywall-full-content\"><strong>Management’s outlook:</strong></p> <ul class=\"paywall-full-content\"> <li>Revenue in 2026 could reach $3.69-3.7 bln (+18% y/y). That’s above the consensus estimate ($3.6 bln) and in line with our expectations ($3.7 bln);</li> <li>Non-GAAP operating income is set to total $736-$740 mln with a margin of 20% (we projected this margin would be achieved by 2027).</li> </ul> <p class=\"paywall-full-content\"><span>We</span> <span>identify</span> <span>these</span> <span>results</span> <span>as</span> <span>strong</span><span>,</span> <span>with</span> an <span>acceleration</span> in <span>revenue</span> <span>growth</span> <span>from</span> <span>16</span><span>%</span> <span>in</span> <span>Q1</span> <span>2025</span> <span>to</span> <span>over</span> <span>20</span><span>%</span> <span>in</span> <span>Q4</span> <span>2025 and stable customer growth</span>.</p> <h2 class=\"paywall-full-content\">Our Expectations</h2> <p class=\"paywall-full-content\">We expect HubSpot to add an average of 10,000 new customers quarterly in the coming quarters, which represents the upper end of <a href=\"https://seekingalpha.com/article/4869081-hubspot-inc-hubs-q4-2025-earnings-call-transcript\">management's guidance</a>. At the same time, we anticipate a gradual deceleration in relative growth over the years, from the current 3%–4% y/y to 2% by the end of the decade. HubSpot has struggled to add more than ~10,000 customers per quarter. This pace has remained steady for recent quarters and will likely persist going forward.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721951790863261_origin.png\" rel=\"lightbox\" data-width=\"1336\" data-height=\"452\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721951790863261_origin.png?io=w640\" alt=\"HubSpot ARPU forecast\" contenteditable=\"false\" width=\"640\" height=\"217\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721951790863261_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721951790863261_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721951790863261_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721951790863261_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span></span>Company Data, Invest<span> Heroes Calculations</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">We are also tracking the performance of the ARPU metric (we compute it as subscription revenue divided by the number of customers). ARPU growth accelerated in 3Q, showing a beta of &gt;1x relative to inflation for the first time since 2022. This beta reached 1.07x in 3Q and climbed to 1.2x in 4Q, meaning average revenue per user is now rising faster than inflation. This is a signal that HubSpot is regaining pricing power and improving the revenue retention rate -a trend we view as positive. We expect the beta to remain at these levels moving forward, so the ARPU will grow with 1.2x beta to inflation. We believe U.S. inflation will slow down from the current 2.7% to 2% in the long term.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721954556607366_origin.png\" rel=\"lightbox\" data-width=\"1664\" data-height=\"563\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721954556607366_origin.png?io=w640\" alt=\"Hubspot ARPU forecast\" contenteditable=\"false\" width=\"640\" height=\"217\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721954556607366_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721954556607366_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721954556607366_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721954556607366_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span></span>Company Data, Invest<span> Heroes calculations</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Given the abovementioned, we expect HubSpot to earn a revenue of $3.8 bln (+20% y/y) in 2026, and $4.4 bln (+17% y/y) in 2027. As such, our forecast for 2026 is slightly above the management’s. We expect the company to report earnings that are higher than consensus estimates.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721957624651794_origin.png\" rel=\"lightbox\" data-width=\"1486\" data-height=\"664\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721957624651794_origin.png?io=w640\" alt=\"HubSpot revenue forecast\" contenteditable=\"false\" width=\"640\" height=\"286\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721957624651794_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721957624651794_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721957624651794_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721957624651794_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span></span>Company Data, Invest<span> Heroes calculations</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">As for operating costs, we project that by 2030 the company will incrementally achieve the following levels of operating costs, measured as a percentage of revenue:</p> <p class=\"paywall-full-content\">-S&amp;M – 30% of revenue</p> <p class=\"paywall-full-content\">-R&amp;D – 20% of revenue</p> <p class=\"paywall-full-content\">-G&amp;A – 8.5% of revenue</p> <p class=\"paywall-full-content\">So we forecast that HubSpot will gradually come to these numbers. We arrived at these numbers by analyzing average costs at such software-industry companies as Salesforce, Adobe, ServiceNow, and others.</p> <p class=\"paywall-full-content\">Based on the expected dynamics of revenue and expenses, we expect HubSpot’s adjusted EBITDA to about triple y/y in 2026 to reach $448 mln and to further rise to $695 mln in 2027.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721958964234788_origin.png\" rel=\"lightbox\" data-width=\"1547\" data-height=\"649\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721958964234788_origin.png?io=w640\" alt=\"Hubspot EBITDA forecast\" contenteditable=\"false\" width=\"640\" height=\"268\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721958964234788_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721958964234788_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721958964234788_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/48493874-17721958964234788_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span></span>Company Data, Invest<span> Heroes Calculations</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Risks</h2> <p class=\"paywall-full-content\">The biggest risk to the investment case would be slower revenue growth that winds down to levels lagging the rest of the market. In that case, the market could apply a discount to the company’s value, mirroring the Salesforce scenario.</p> <h2 class=\"paywall-full-content\">HubSpot’s valuation</h2> <p class=\"paywall-full-content\">We value HubSpot shares at $839 ($531 on a discounted basis) and assign a BUY rating. This represents an upside of 176% (60% on a discounted basis). We calculate our price target based on the projected 2030 EBITDA and a target EV/EBITDA multiple of 23.2x, applying a 13% discount rate.</p> <p class=\"paywall-full-content\">We derived the target EV/EBITDA multiple using average long-term multiples at such software-industry companies as Salesforce, Adobe, ServiceNow, and others.</p> <p class=\"paywall-full-content\"><strong>Explanation of discount rate: </strong><span>We</span> <span>use</span> <span>EBITDA</span> <span>for</span> <span>2030</span> to <span>evaluate</span> <span>HubSpot</span> <span>shares</span> <span>(</span>the <span>moment</span> <span>when</span><span>,</span> <span>according</span> to <span>our</span> <span>expectations</span><span>,</span> the <span>company</span> will <span>reach</span> <span>the</span> <span>industry</span> <span>average</span> in terms <span>of</span> <span>operating</span> <span>expenses</span><span>)</span><span>.</span> <span>That</span> <span>is</span>, the <span>target</span> <span>price</span> of <span>$</span><span>839</span> <span>is</span> our <span>expected</span> <span>fair</span> <span>share</span> <span>price</span> <span>by</span> <span>2030</span><span>.</span> <span>This</span> <span>means</span> <span>that</span> <span>from</span> the <span>point</span> of <span>view</span> <span>of</span> the <span>time</span> <span>value</span> of <span>cash</span> <span>flows</span>, in order <span>to</span> <span>get</span> the <span>target</span> <span>price</span> <span>over</span> <span>the</span> <span>next</span> <span>12</span> <span>months</span>, <span>we</span> <span>need</span> <span>to</span> discount <span>this</span> <span>value</span><span>.</span> <span>To</span> do <span>this</span>, <span>we</span> <span>use</span> a <span>13</span><span>%</span> <span>rate</span><span>,</span> <span>which</span> <span>corresponds</span> to the average <span>annual</span> <span>growth</span> of the <span>S</span><span>&amp;</span><span>P</span> <span>500</span> <span>index</span> <span>over</span> the <span>past</span> <span>10</span> <span>years</span><span>.</span> In <span>other</span> <span>words</span><span>,</span> <span>using</span> this <span>discount</span> <span>rate</span> <span>allows</span> you to <span>understand</span> whether it is better <span>to</span> <span>invest</span> <span>in</span> a <span>particular</span> <span>company</span> in <span>terms</span> <span>of</span> <span>expected</span> <span>return</span> <span>or</span> whether it is <span>better</span> to <span>invest</span> in the index<span>.</span></p> <h2 class=\"paywall-full-content\">Bottom Line</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">After a period of cooling share prices, HubSpot looks attractive from a valuation standpoint for the first time in a long while. We believe HubSpot combines durable top-line growth, improving operating leverage, and a valuation that no longer reflects its long-term potential. While a sharper-than-expected slowdown in revenue remains the key risk, the current setup offers an attractive risk/reward profile for long-term investors.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2175801796/image_2175801796.jpg",
            "link": "https://seekingalpha.com/article/4876704-hubspot-finally-a-bargain",
            "pub_date": "2026-02-28 16:16:04",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876714",
            "title": "Fidelity Multi-Asset Income Fund Q4 2025 Commentary",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2254579635/image_2254579635.jpg?io=getty-c-w630\" alt=\"Business analyst interacting with stock market chart interface on digital screen, showing forex growth and crypto trading concept on modern background.\" data-id=\"2254579635\" data-type=\"getty-image\" width=\"1536\" height=\"614\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2254579635/image_2254579635.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2254579635/image_2254579635.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2254579635/image_2254579635.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2254579635/image_2254579635.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2254579635/image_2254579635.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2254579635/image_2254579635.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2254579635/image_2254579635.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2254579635/image_2254579635.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"></p> <p class=\"item-credits\">ismagilov/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Market Review</h2> <p>U.S. stocks gained 2.66% in the fourth quarter, according to the S&amp;P 500® index, extending a historically fast rebound that began in early April, but at a slower pace. The advance has been supported by strong corporate fundamentals, a resilient economy, an<span class=\"paywall-full-content\"> ongoing boom in spending on artificial intelligence and the Federal Reserve's first interest-rate reductions since December 2024. Amid this favorable backdrop for higher-risk assets, the index closed the year just shy of its all-time high. Value stocks modestly outpaced growth in Q4, while large-caps had only a slight advantage over small-caps.</span></p> <p class=\"paywall-full-content\">Stocks entered October on an uptrend, but with the federal government in a shutdown that would last until November 12. Equities rose 2.34% nonetheless, boosted by earnings momentum and a constructive expansionary backdrop. Momentum faded a bit in November (+0.25%), as stocks weathered the shutdown and a mid-month sell-off amid concern about an AI bubble.</p> <p class=\"paywall-full-content\">Fed rate cuts also supported stocks the past three months. On October 29, the central bank lowered its benchmark federal funds rate by 0.25 percentage points at its second consecutive meeting, and cut rates by another quarter point on December 10. The index achieved a record close on Christmas Eve before a sluggish final week resulted in a flattish advance for the month, a 17.88% gain for the year and a 38.65% increase since the April 8 low.</p> <p class=\"paywall-full-content\">Meanwhile, U.S. taxable investment-grade bonds gained 1.10% in Q4, as measured by the Bloomberg U.S. Aggregate Index, fueled by a combination of elevated starting yields and price appreciation, as bond prices rose amid falling interest rates and investor demand, supported by stable fundamentals.</p> <p class=\"paywall-full-content\">The Fed's rate reductions drove short-term bond yields lower and contributed to gains for the investment-grade bond market in October and November. For the three months, short-term bond yields fell in step with the benchmark interest rate, but long-term yields rose marginally, a function of the Fed's policy signals and heavy issuance of long-term Treasurys to fund U.S. government spending during the period.</p> <p class=\"paywall-full-content\">Due to this steepening of the yield curve, short- and intermediate-term issues fared best in Q4. By credit rating, higher-quality bonds rated AAA and AA outperformed investment-grade debt rated A and BAA (the Bloomberg equivalent to BBB). By sector, U.S. Treasurys (+0.90%) slightly outperformed U.S. investment-grade corporate bonds (+0.84%), which were constrained by historically tight credit spreads.</p> <p class=\"paywall-full-content\">By comparison, emerging-markets debt gained 3.04%, while convertible bonds (+1.96%), U.S. high-yield bonds (+1.35%) and floating-rate loans (+1.22%) all similarly rose. Preferred stocks, however, lost ground, returning -0.31%. ■</p> <h4 class=\"paywall-full-content\">Broad Asset Class Returns (%) PERIOD ENDING DECEMBER 31, 2025</h4> <figure class=\"regular-img-figure a-c paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/542689-17722648266713111_origin.jpg\" rel=\"lightbox\" data-width=\"1512\" data-height=\"587\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/542689-17722648266713111_origin.jpg?io=w640\" alt=\"Broad Asset Class Returns (%) PERIOD ENDING DECEMBER 31, 2025\" contenteditable=\"false\" width=\"640\" height=\"248\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/542689-17722648266713111_origin.jpg?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/542689-17722648266713111_origin.jpg?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/542689-17722648266713111_origin.jpg?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/542689-17722648266713111_origin.jpg?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"></p></figcaption></figure><div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table><tbody><tr><td> <p>Periods greater than one year are annualized. Source: FMR</p> <p>*Difference between best- and worst-performing asset classes over the given time period</p> <p>You cannot invest directly in an index. Past performance is no guarantee of future results.</p> <p>Equities ex. Preferred Stock - S&amp;P 500, Preferred Stock - ICE BofA Fixed Rate Preferred Securities Index, Convertibles - ICE BofA All U.S. Convertibles Index, High-Yield Bonds - ICE BofA U.S. High Yield Constrained Index, Bank Loans - S&amp;P/LSTA Leveraged Performing Loan Index, Emerging-Markets Debt - J.P. Morgan Emerging Markets Bond Index Global, Investment-Grade Debt - Bloomberg U.S. Aggregate Bond Index</p> </td></tr></tbody></table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <h2 class=\"paywall-full-content\">Performance Review</h2> <p class=\"paywall-full-content\">For the quarter, the fund's Retail Class shares returned -0.11%, trailing the 1.88% gain of the Composite index, a 50/50 blend of the S&amp;P 500® index and the Bloomberg U.S. Aggregate Bond Index. Long-term performance favors the fund over the Composite.</p> <p class=\"paywall-full-content\">Security selection in the equity sleeve was the top detractor from the fund's performance versus the Composite index in Q4.</p> <p class=\"paywall-full-content\">The fund's stock holdings returned -0.69%, trailing the S&amp;P 500® index by 3.35 percentage points. Individual stocks that notably hurt relative performance included non-Composite stakes in SharpLink Gaming (<a href=\"https://seekingalpha.com/symbol/SBET\" title=\"Sharplink, Inc.\">SBET</a>) (-48%) and Bitmine Immersion Technologies (<a href=\"https://seekingalpha.com/symbol/BMNR\" title=\"Bitmine Immersion Technologies, Inc.\">BMNR</a>) (-43%), and a preferred stock position in Strategy (-8%), formerly MicroStrategy. The latter was one of the largest holdings at year-end.</p> <p class=\"paywall-full-content\">In contrast, a large underweight in Microsoft (<a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a>) (-6%) and a lack of exposure to index component Oracle (<a href=\"https://seekingalpha.com/symbol/ORCL\" title=\"Oracle Corporation\">ORCL</a>) (-31%) contributed for the three months.</p> <p class=\"paywall-full-content\">Another noteworthy relative detractor was security selection in investment-grade bonds, given that the fund's holdings lagged the category benchmark, the Bloomberg U.S. Aggregate Bond Index, by 2.61 percentage points. A large underweight in this category, however, partly offset the impact.</p> <p class=\"paywall-full-content\">The main contribution for the quarter came from security selection among convertible securities. Here, the fund's positions outpaced the category index, the ICE BofA® All U.S. Convertibles Index, by 4.85 percentage points. </p> <h2 class=\"paywall-full-content\">Outlook and Positioning</h2> <p class=\"paywall-full-content\">In managing the fund, we seek investment opportunities in a wide variety of assets, caused by temporary mispricing as investors overreact to fear or uncertainty. We want to \"do more with less,\" meaning we rely on Fidelity's skill and research to aim to achieve a total return close to the historical average of stocks, but with much less downside risk. For the past three months, we stuck to our focus of generating total return for the fund by capturing the highest income possible, while simultaneously limiting equity, credit and interest-rate risk within certain asset allocation parameters.</p> <p class=\"paywall-full-content\">In Q4, we eliminated the fund's exposure to investment-grade corporate bonds, as we saw limited potential for improvement in yield spreads. Instead, we added to U.S. Treasuries to obtain most of the portfolio's duration, or sensitivity to interest rates. This U.S. Treasury position went from 15% to about 19% of the portfolio during the last three months. The fund remained underweight equities, at 48% of the portfolio. Within the fund's equities, we saw opportunity among certain pharmaceutical companies with a particularly attractive valuation and low downside risk, in our view. Also, we continued to find potential among several oil-tanker stocks, as they largely remain off investors' radar, even as these companies have been reducing debt and paying dividends.</p> <p class=\"paywall-full-content\">We scaled back the fund's non-Composite holdings in high-yield bonds and floating-rate loans, redirecting the proceeds to preferred stocks. In addition, we lowered the fund's allocation to convertible securities. Even as we continued to like the segment – a strong performer in Q4 – the small reduction reflected sales of certain bitcoin- and AI-related holdings that had strong performance and offered a less-favorable risk/reward trade-off, in our opinion.</p> <p class=\"paywall-full-content\">Looking ahead, we view the economy as being in a mid-cycle type of environment, and we see the opportunity for lower interest rates and inflation to potentially remain contained. </p> <p class=\"paywall-full-content\"></p> <hr class=\"paywall-full-content\"> <h4 class=\"paywall-full-content\">References</h4> <ol class=\"paywall-full-content\"> <li>Life of Fund ('LOF') if performance is less than 10 years. Fund inception date: 09/09/2015.</li> <li>This expense ratio is from the most recent prospectus and generally is based on amounts incurred during the most recent fiscal year, or estimated amounts for the current fiscal year in the case of a newly launched fund. It does not include any fee waivers or reimbursements, which would be reflected in the fund's net expense ratio.</li> </ol> <p class=\"paywall-full-content\"></p> <hr class=\"paywall-full-content\"> <p class=\"paywall-full-content\"> </p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table><tbody><tr><td> <p></p> <p></p> <p></p> <p>Fidelity® Multi-Asset Income Fund</p> <p>Investment Approach</p> <p>Fidelity® Multi-Asset Income Fund is a flexible income-oriented strategy (<a href=\"https://seekingalpha.com/symbol/MSTR\" title=\"Strategy Inc\">MSTR</a>) that invests tactically across a broad spectrum of income-producing securities, ranging from investment-grade bonds to dividend-paying equities.</p> <p>Unconstrained by target asset allocation profiles or benchmark weights, the fund dynamically pursues attractive income and value opportunities across asset classes, while closely monitoring interest rate, equity and credit risk. This flexibility helps the fund adapt to market conditions, with the goal of generating capital appreciation in rising markets and mitigating losses in declining markets.</p> <p>The fund brings Fidelity's specialists in income investing together in a single portfolio. The lead manager and co-managers work collaboratively to identify the optimal combination of securities, reflective of market conditions, in seeking to balance income potential versus risk. Each manager leverages specialized research teams to find the most compelling investment ideas within their respective areas of expertise.</p> <p>Performance Summary</p> <div class=\"table-responsive\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <thead> <tr> <th></th> <th>Cumulative</th> <th>Annualized</th> </tr> <tr> <th>3 Month</th> <th>YTD</th> <th>1 Year</th> <th>3 Year</th> <th>5 Year</th> <th>10 Year/ LOF 1</th> </tr> </thead> <tbody> <tr> <td>Fidelity Multi-Asset Income Fund (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/FMSDX\" title=\"Fidelity Multi-Asset Income Fund\">FMSDX</a></span>)</td> <td>-0.11%</td> <td>14.08%</td> <td>14.08%</td> <td>11.91%</td> <td>7.55%</td> <td>8.94%</td> </tr> <tr> <td>Gross Expense Ratio: 0.80% 2</td> <td></td> <td></td> <td></td> <td></td> <td></td> <td></td> </tr> <tr> <td>Bloomberg US Aggregate Bond Index</td> <td>1.10%</td> <td>7.30%</td> <td>7.30%</td> <td>4.66%</td> <td>-0.36%</td> <td>2.01%</td> </tr> <tr> <td>S&amp;P500/Bloomberg US Aggregate Bond 50/50 Index</td> <td>1.88%</td> <td>12.64%</td> <td>12.64%</td> <td>13.62%</td> <td>6.99%</td> <td>8.50%</td> </tr> <tr> <td>Morningstar Fund Moderately Conservative Allocation</td> <td>1.69%</td> <td>11.14%</td> <td>11.14%</td> <td>10.08%</td> <td>5.01%</td> <td>6.11%</td> </tr> <tr> <td>% Rank in Morningstar Category (1% = Best)</td> <td>--</td> <td>--</td> <td>5%</td> <td>11%</td> <td>3%</td> <td>2%</td> </tr> <tr> <td># of Funds in Morningstar Category</td> <td>--</td> <td>--</td> <td>215</td> <td>208</td> <td>199</td> <td>160</td> </tr> </tbody> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p>1 Life of Fund ('LOF') if performance is less than 10 years. Fund inception date: 09/09/2015.</p> <p>2 This expense ratio is from the most recent prospectus and generally is based on amounts incurred during the most recent fiscal year, or estimated amounts for the current fiscal year in the case of a newly launched fund. It does not include any fee waivers or reimbursements, which would be reflected in the fund's net expense ratio.</p> <p>Past performance is no guarantee of future results. Investment return and principal value of an investment will fluctuate; therefore, you may have a gain or loss when you sell your shares. Current performance may be higher or lower than the performance stated. Performance shown is that of the fund's Retail Class shares (if multiclass). You may own another share class of the fund with a different expense structure and, thus, have different returns. To learn more or to obtain the most recent month-end or other share-class performance, visit <a href=\"https://www.fidelity.com/performance\" rel=\"nofollow\">Fidelity Funds | Mutual Funds from Fidelity Investments</a> , <a href=\"https://www.institutional.fidelity.com/\" rel=\"nofollow\">Financial Professionals | Fidelity Institutional</a> , or <a href=\"https://www.401k.com/\" rel=\"nofollow\">Fidelity NetBenefits | Employee Benefits</a> . Total returns are historical and include change in share value and reinvestment of dividends and capital gains, if any. Cumulative total returns are reported as of the period indicated.</p> <p>For definitions and other important information, please see the Definitions and Important Information section of this Fund Review.</p> <p>Not FDIC Insured • May Lose Value • No Bank Guarantee</p> <p>Fund Information</p> <p>Manager(s):Adam Kramer</p> <p>Trading Symbol:FMSDX</p> <p>Start Date:September 09, 2015</p> <p>Size (in millions):$3,218.99</p> <p>Morningstar Category:Fund Moderately Conservative Allocation</p> <p>Stock markets, especially foreign markets, are volatile and can decline significantly in response to adverse issuer, political, regulatory, market, or economic developments all of which are magnified in emerging markets. Fixed income investments entail interest rate risk (as interest rates rise bond prices usually fall), the risk of issuer or counterparty default, issuer credit risk and inflation risk. Foreign securities are subject to interest rate, currency exchange rate, economic, and political risks all of which are magnified in emerging markets. Lower-quality bonds can be more volatile and have greater risk of default than higher-quality bonds. Floating rate loans may not be fully collateralized and therefore may decline significantly in value. Moreover, they may be subject to restrictions on resale and sometimes trade infrequently in the secondary market; as a result they may be more difficult to value, buy, or sell. If the fund's asset allocation strategy does not work as intended, the fund may not achieve its objective.</p> <p> </p> <p>Asset Allocation Performance Summary</p> <div class=\"table-responsive\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <thead><tr> <th>Asset Class</th> <th>Benchmark</th> <th>Average Relative Weight</th> <th>Relative Contribution (basis points)*</th> </tr></thead> <tbody> <tr> <td>Equities ex. Preferred Stock</td> <td>S&amp;P 500</td> <td>-0.8%</td> <td>-169</td> </tr> <tr> <td>INVESTMENT GRADE BONDS ('USD')</td> <td>BBg US Agg Bond</td> <td>-33.2%</td> <td>-27</td> </tr> <tr> <td>HIGH-YIELD INVESTMENTS</td> <td>ICE BofA US HY Const</td> <td>5.7%</td> <td>2</td> </tr> <tr> <td>HIGH-YIELD FLOATING-RATE DEBT</td> <td>Morningstar LSTA US Loan</td> <td>7.9%</td> <td>2</td> </tr> <tr> <td>EMERGING-MARKETS DEBT</td> <td>J.P. Morgan EMBI Global</td> <td>2.9%</td> <td>-5</td> </tr> <tr> <td>CONVERTIBLES</td> <td>ICE BofA All US Conv</td> <td>10.9%</td> <td>28</td> </tr> <tr> <td>PREFERRED STOCK</td> <td>ICE BofA Fix Rt Pref Sec</td> <td>5.1%</td> <td>-19</td> </tr> <tr> <td>CALL OPTIONS</td> <td>SP500/BBg US Ag 50/50</td> <td>-1.1%</td> <td>3</td> </tr> <tr> <td>INVESTED ASSETS SUBTOTALS</td> <td>SP500/BBg US Ag 50/50</td> <td>-2.7%</td> <td>-185</td> </tr> <tr> <td>CASH &amp; NET OTHER ASSETS</td> <td>--</td> <td>2.7%</td> <td>6</td> </tr> <tr> <td>EXPENSES</td> <td>--</td> <td>0.0%</td> <td>-18</td> </tr> <tr> <td>Total Value Added</td> <td></td> <td></td> <td>-197</td> </tr> </tbody> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p>*1 basis point = 0.01%.</p> <p><em>Net Other Assets can include fund receivables, fund payables, and offsets to other derivative positions, as well as certain assets that do not fall into any of the portfolio composition categories. Depending on the extent to which the fund invests in derivatives and the number of positions that are held for future settlement, Net Other Assets can be a negative number.</em></p> <p>Portfolio Composition</p> <div class=\"table-responsive\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <thead><tr> <th>Asset Class</th> <th>Portfolio Weight</th> <th>Change From Prior Quarter</th> </tr></thead> <tbody> <tr> <td>Equities ex. Preferred Stock</td> <td>47.76%</td> <td>-0.22%</td> </tr> <tr> <td>U.S. Treasury &amp; Government Related Securities</td> <td>18.56%</td> <td>3.89%</td> </tr> <tr> <td>Investment-Grade Corporate Bonds</td> <td>0.00%</td> <td>-0.84%</td> </tr> <tr> <td>Mortgage Backed Securities</td> <td>0.48%</td> <td>-0.03%</td> </tr> <tr> <td>High-Yield Investments</td> <td>4.11%</td> <td>-3.37%</td> </tr> <tr> <td>Bank Loans</td> <td>7.63%</td> <td>-0.47%</td> </tr> <tr> <td>Convertibles</td> <td>10.72%</td> <td>-0.95%</td> </tr> <tr> <td>Preferred Stock</td> <td>5.92%</td> <td>2.00%</td> </tr> <tr> <td>Emerging-Markets Debt</td> <td>2.40%</td> <td>-0.67%</td> </tr> <tr> <td>Cash &amp; Net Other Assets</td> <td>2.42%</td> <td>0.66%</td> </tr> </tbody> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p><em>Net Other Assets can include fund receivables, fund payables, and offsets to other derivative positions, as well as certain assets that do not fall into any of the portfolio composition categories. Depending on the extent to which the fund invests in derivatives and the number of positions that are held for future settlement, Net Other Assets can be a negative number.</em></p> <p>Trended Asset Allocation</p> <figure class=\"regular-img-figure a-c paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/542689-1772264826644522_origin.jpg\" rel=\"lightbox\" data-width=\"663\" data-height=\"543\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/542689-1772264826644522_origin.jpg?io=w640\" alt=\"Stacked area chart showing the trended asset allocation of the Fidelity Multi-Asset Income Fund from October 2015 to October 2025. The Y-axis represents the percentage of assets from -20% to 100%. The X-axis shows time in quarters. The legend identifies the following asset classes: Equities ex. Preferred Stock (dark green), Investment-Grade Debt (light green), High-Yield Investments (blue), Bank Loans (yellow), Convertibles (red), Preferred Stock (purple), Emerging-Markets Debt (orange), and Cash &amp; Net Other Assets (grey). The chart shows significant volatility, with a major peak in equities around 2017 and a sharp decline in 2020, followed by a recovery and subsequent fluctuations.\" contenteditable=\"false\" width=\"640\" height=\"524\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/542689-1772264826644522_origin.jpg?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/542689-1772264826644522_origin.jpg?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/542689-1772264826644522_origin.jpg?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/542689-1772264826644522_origin.jpg?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Source: FMR</span></p></figcaption></figure><p>Fixed-income Market-segment Diversification</p> <div class=\"table-responsive\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <thead><tr> <th>Market Segment</th> <th>Portfolio Weight*</th> <th>Change From Prior Quarter</th> </tr></thead> <tbody> <tr> <td>Bank Loans</td> <td>15.31%</td> <td>-0.80%</td> </tr> <tr> <td>Corporate Bonds: U.S. Investment Grade</td> <td>0.00%</td> <td>-1.06%</td> </tr> <tr> <td>Corporate Bonds: U.S. High Yield</td> <td>7.57%</td> <td>-3.18%</td> </tr> <tr> <td>Corporate Bonds: Foreign Developed Markets</td> <td>0.68%</td> <td>-4.07%</td> </tr> <tr> <td>Corporate Bonds: Emerging Markets</td> <td>0.21%</td> <td>0.06%</td> </tr> <tr> <td>Sovereign Bonds: U.S.</td> <td>37.26%</td> <td>8.08%</td> </tr> <tr> <td>Sovereign Bonds: Foreign Developed Markets</td> <td>0.00%</td> <td>0.00%</td> </tr> <tr> <td>Sovereign Bonds: Emerging Markets</td> <td>4.62%</td> <td>-1.34%</td> </tr> <tr> <td>Securitized Debt</td> <td>0.96%</td> <td>-0.06%</td> </tr> <tr> <td>Convertible Bonds</td> <td>17.53%</td> <td>-3.41%</td> </tr> <tr> <td>Preferred Stock</td> <td>11.88%</td> <td>4.09%</td> </tr> <tr> <td>Other Debt</td> <td>3.98%</td> <td>1.69%</td> </tr> </tbody> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p>* % of debt assets</p> <p>Equity Market-segment Diversification</p> <div class=\"table-responsive\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <thead><tr> <th>Market Segment</th> <th>Portfolio Weight*</th> <th>Change From Prior Quarter</th> </tr></thead> <tbody> <tr> <td>Information Technology</td> <td>22.56%</td> <td>-3.48%</td> </tr> <tr> <td>Health Care</td> <td>14.72%</td> <td>8.66%</td> </tr> <tr> <td>Energy</td> <td>12.52%</td> <td>-2.64%</td> </tr> <tr> <td>Industrials</td> <td>11.22%</td> <td>3.89%</td> </tr> <tr> <td>Consumer Discretionary</td> <td>11.16%</td> <td>-0.92%</td> </tr> <tr> <td>Communication Services</td> <td>10.20%</td> <td>2.90%</td> </tr> <tr> <td>Financials</td> <td>6.12%</td> <td>-6.46%</td> </tr> <tr> <td>Utilities</td> <td>5.84%</td> <td>-3.52%</td> </tr> <tr> <td>Materials</td> <td>2.55%</td> <td>0.65%</td> </tr> <tr> <td>Real Estate</td> <td>1.71%</td> <td>0.63%</td> </tr> <tr> <td>Consumer Staples</td> <td>1.41%</td> <td>0.30%</td> </tr> <tr> <td>Other</td> <td>-0.01%</td> <td>-0.01%</td> </tr> </tbody> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p>* % of equity assets</p> <p>10 Largest Holdings</p> <div class=\"table-responsive\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <thead><tr> <th>Holding</th> <th>Asset Class</th> </tr></thead> <tbody> <tr> <td>US Treasury Bonds 1.875% 2/15/2051</td> <td>U.S. Treasury &amp; Government Related Securities</td> </tr> <tr> <td>US Treasury Bonds 1.25% 5/15/2050</td> <td>U.S. Treasury &amp; Government Related Securities</td> </tr> <tr> <td>Strategy Inc 9%</td> <td>Preferred Stock</td> </tr> <tr> <td>Strategy Inc Series A, 10%</td> <td>Preferred Stock</td> </tr> <tr> <td>EchoStar Corp (<a href=\"https://seekingalpha.com/symbol/SATS\" title=\"EchoStar Corporation\">SATS</a>) 3.875% 11/30/2030 pay-in-kind</td> <td>Convertibles</td> </tr> <tr> <td>Alphabet Inc (<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>) Class A</td> <td>Equities ex. Preferred Stock</td> </tr> <tr> <td>DHT Holdings Inc (<a href=\"https://seekingalpha.com/symbol/DHT\" title=\"DHT Holdings, Inc.\">DHT</a>)</td> <td>Equities ex. Preferred Stock</td> </tr> <tr> <td>International Seaways Inc (<a href=\"https://seekingalpha.com/symbol/INSW\" title=\"International Seaways, Inc.\">INSW</a>)</td> <td>Equities ex. Preferred Stock</td> </tr> <tr> <td>TransAlta Corp (<a href=\"https://seekingalpha.com/symbol/TAC\" title=\"TransAlta Corporation\">TAC</a>)</td> <td>Equities ex. Preferred Stock</td> </tr> <tr> <td>Brazilian Federative Republic 10% 1/1/2027</td> <td>Emerging-Markets Debt</td> </tr> <tr> <td>10 Largest Holdings as a % of Net Assets</td> <td>39.06%</td> </tr> <tr> <td>Total Number of Holdings</td> <td>333</td> </tr> </tbody> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p><em>The 10 largest holdings are as of the end of the reporting period, and may not be representative of the fund's current or future investments. Holdings do not include money market investments.</em></p> <p>CHARACTERISTICS</p> <div class=\"table-responsive\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <thead><tr> <th></th> <th>Portfolio</th> <th>Index</th> </tr></thead> <tbody> <tr> <td>Duration</td> <td>4.15 years</td> <td>2.00 years</td> </tr> <tr> <td>30-Day SEC Yield</td> <td>2.95%</td> <td>--</td> </tr> <tr> <td>30-Day SEC Restated Yield</td> <td>--</td> <td>--</td> </tr> <tr> <td>Net Asset Value</td> <td>$15.49</td> <td>--</td> </tr> </tbody> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p>Definitions and Important Information</p> <p>Unless otherwise expressly disclosed to you in writing, the information provided in this material is for educational purposes only. Any viewpoints expressed by Fidelity are not intended to be used as a primary basis for your investment decisions and are based on facts and circumstances at the point in time they are made and are not particular to you. Accordingly, nothing in this material constitutes impartial investment advice or advice in a fiduciary capacity, as defined or under the Employee Retirement Income Security Act of 1974 or the Internal Revenue Code of 1986, both as amended. Fidelity and its representatives may have a conflict of interest in the products or services mentioned in this material because they have a financial interest in the products or services and may receive compensation, directly or indirectly, in connection with the management, distribution, and/or servicing of these products or services, including Fidelity funds, certain third-party funds and products, and certain investment services. Before making any investment decisions, you should take into account all of the particular facts and circumstances of your or your client's individual situation and reach out to a professional adviser, if applicable.</p> <p>Broad Asset Class Returns</p> <p>A graphical representation of historical market performance and the variations in returns among asset classes, as represented by the following indexes:</p> <p>Bloomberg U.S. Aggregate Bond Index is a broad-based, market-value-weighted benchmark that measures the performance of the investment grade, U.S. dollar-denominated, fixed-rate taxable bond market. Sectors in the index include Treasuries, government-related and corporate securities, MBS (agency fixed-rate and hybrid ARM pass-throughs), ABS, and CMBS.</p> <p>ICE BofA All U.S. Convertibles Index is a market capitalization-weighted index of domestic U.S. corporate convertible securities including mandatory convertible preferreds.</p> <p>ICE BofA Fixed Rate Preferred Securities Index is a market capitalization-weighted index of fixed rate US dollar denominated preferred securities issued in the US domestic market. Qualifying securities must have an investment grade rating (based on an average of Moody's, S&amp;P and Fitch) and an investment grade rated country of risk. In addition, qualifying securities must be issued as public securities or through a 144a filing, must be issued.</p> <p>ICE BofA U.S. High Yield Constrained Index is a modified market capitalization-weighted index of US dollar denominated below investment grade corporate debt publicly issued in the US domestic market. Qualifying securities must have a below investment grade rating (based on an average of Moody's, S&amp;P and Fitch). The country of risk of qualifying issuers must be an FX-G10 member, a Western European nation, or a territory of the US or a Western European nation. The FX-G10 includes all Euro members, the US, Japan, the UK, Canada, Australia, New Zealand, Switzerland, Norway and Sweden. In addition, qualifying securities must have at least one year remaining to final maturity, a fixed coupon schedule and at least $100 million in outstanding face value. Defaulted securities are excluded. The index contains all securities of ICE BofA U.S. High Yield Index but caps issuer exposure at 2%.</p> <p>J.P. Morgan Emerging Markets Bond Index Global tracks total returns for the U.S. dollar-denominated debt instruments issued by Emerging Market sovereign and quasi-sovereign entities, such as Brady bonds, loans, and Eurobonds.</p> <p>S&amp;P 500 Index is a market capitalization-weighted index of 500 common stocks chosen for market size, liquidity, and industry group representation to represent U.S. equity performance.</p> <p>S&amp;P/LSTA Leveraged Performing Loan Index is a market value-weighted index designed to represent the performance of U.S. dollar-denominated institutional leveraged performing loan portfolios (excluding loans in payment default) using current market weightings, spreads and interest payments.</p> <p>CHARACTERISTICS</p> <p>Duration is a measure of a security's price sensitivity to changes in interest rates. Duration differs from maturity in that it considers a security's interest payments in addition to the amount of time until the security reaches maturity, and also takes into account certain maturity shortening features (e.g., demand features, interest rate resets, and call options) when applicable. Securities with longer durations generally tend to be more sensitive to interest rate changes than securities with shorter durations. A fund with a longer average duration generally can be expected to be more sensitive to interest rate changes than a fund with a shorter average duration.</p> <p>30-day SEC Yield is a standard yield calculation developed by the Securities and Exchange Commission for bond funds. The yield is calculated by dividing the net investment income per share earned during the 30-day period by the maximum offering price per share on the last day of the period. The yield figure reflects the dividends and interest earned during the 30-day period, after the deduction of the fund's expenses. It is sometimes referred to as \"SEC 30-Day Yield\" or \"standardized yield\".</p> <p>30-Day SEC Restated Yield is the fund's 30-day yield without applicable waivers or reimbursements, stated as of month-end.</p> <p>Net Asset Value is the dollar value of one share of a fund; determined by taking the total assets of a fund, subtracting the total liabilities, and dividing by the total number of shares outstanding.</p> <p>Important Fund Information</p> <p>Relative positioning data presented in this commentary is based on the fund's primary benchmark (<a href=\"https://seekingalpha.com/symbol/INDEX\" title=\"Cyber Hornet S&amp;P 500 No Load\">INDEX</a>) unless a secondary benchmark is provided to assess</p> <p>% Rank in Morningstar Category from the Performance Summary: Morningstar Extended Performance rankings shown are based on adjusted historical returns for periods prior to the class' inception. These hypothetical calculated returns reflect the historical performance of the oldest share class of the fund, adjusted to reflect the fees and expenses of each respective class. Morningstar Ranking is for the indicated share class only; other classes may have different performance characteristics.</p> <p>Initial offering of the Fidelity Multi-Asset Income Retail Class took place on March 28, 2018. Returns prior to that date are those of the Fidelity Advisor Multi-Asset Income Fund Class I and reflect the Class I's expenses.</p> <p>INDICES</p> <p>It is not possible to invest directly in an index. All indices</p> <p>represented are unmanaged. All indices include reinvestment of dividends and interest income unless otherwise noted.</p> <p>Bloomberg U.S. Aggregate Bond Index is a broad-based flagship benchmark that measures the investment grade, US dollar-denominated, fixed-rate taxable bond market. The index includes Treasuries, government-related and corporate securities, mortgage-backed securities (agency fixed-rate pass-throughs), asset-backed securities and collateralized mortgage-backed securities (agency and non-agency).</p> <p>S&amp;P500/Bloomberg U.S. Aggregate Bond 50/50 Index is a customized blend of unmanaged indices, weighted as follows: S&amp;P 500 Index - 50% and Bloomberg U.S. Aggregate Bond Index - 50%.</p> <p>Market-segment Weights</p> <p>Market segment weights illustrate examples of sectors or industries in which the fund may invest, and may not be representative of the fund's current or future investments. They should not be construed or used as a recommendation for any sector or industry.</p> <p>Ranking Information</p> <p>© 2026 Morningstar, Inc. All rights reserved. The Morningstar information contained herein: (1) is proprietary to Morningstar and/or its content providers; (2) may not be copied or redistributed; and (3) is not warranted to be accurate, complete or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Fidelity does not review the Morningstar data and, for mutual fund performance, you should check the fund's current prospectus for the most up-to-date information concerning applicable loads, fees and expenses.</p> <p>% Rank in Morningstar Category is the fund's total-return percentile rank relative to all funds that have the same Morningstar Category. The highest (or most favorable) percentile rank is 1 and the lowest (or least favorable) percentile rank is 100. The top-performing fund in a category will always receive a rank of 1%. % Rank in Morningstar Category is based on total returns which include reinvested dividends and capital gains, if any, and exclude sales charges. Multiple share classes of a fund have a common portfolio but impose different expense structures.</p> <p>Relative Weights</p> <p>Relative weights represents the % of fund assets in a particular market segment, asset class or credit quality relative to the benchmark. A positive number represents an overweight, and a negative number is an underweight. The fund's benchmark is listed immediately under the fund name in the Performance Summary.</p> <p><em>Before investing in any mutual fund, please carefully consider the investment objectives, risks, charges, and expenses. For this and other information, call or write Fidelity for a free prospectus or, if available, a summary prospectus. Read it carefully before you invest.</em></p> <p>Past performance is no guarantee of future results.</p> <p>Views expressed are through the end of the period stated and do not necessarily represent the views of Fidelity. Views are subject to change at any time based upon market or other conditions and Fidelity disclaims any responsibility to update such views. These views may not be relied on as investment advice and, because investment decisions for a Fidelity fund are based on numerous factors, may not be relied on as an indication of trading intent on behalf of any Fidelity fund. The securities mentioned are not necessarily holdings invested in by the portfolio manager(s) or FMR LLC. References to specific company securities should not be construed as recommendations or investment advice.</p> <p>Diversification does not ensure a profit or guarantee against a loss.</p> <p>S&amp;P 500 is a registered service mark of Standard &amp; Poor's Financial Services LLC.</p> <p>Other third-party marks appearing herein are the property of their respective owners.</p> <p>All other marks appearing herein are registered or unregistered trademarks or service marks of FMR LLC or an affiliated company.</p> <p>Fidelity Brokerage Services LLC, Member NYSE, SIPC, 900 Salem Street, Smithfield, RI 02917.</p> <p>Fidelity Distributors Company LLC, 500 Salem Street, Smithfield, RI 02917.</p> <p>© 2026 FMR LLC. All rights reserved.</p> <p>Not NCUA or NCUSIF insured. May lose value. No credit union guarantee.</p> </td></tr></tbody></table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <hr class=\"paywall-full-content\"> <p class=\"paywall-full-content\"><a href=\"https://www.fidelity.com/bin-public/060_www_fidelity_com/documents/SHDOCS/FMSDX/hosts/sh_comm_qfr.002792.RETAIL_pdf.pdf\" rel=\"noopener\"><strong>Original Post</strong></a> </p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\"><strong>Editor's Note:</strong> The summary bullets for this article were chosen by Seeking Alpha editors.<a href=\"blob:https://2vtaojjlbdml2ka53utuv82tr7xfagovem04ofd2im8y6zfvt4-h874623575.scf.usercontent.goog/c71ea962-165f-4f71-98e3-f415bd8e6d20#\" rel=\"nofollow\"></a> </p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2254579635/image_2254579635.jpg",
            "link": "https://seekingalpha.com/article/4876714-fidelity-multi-asset-income-fund-q4-2025-commentary",
            "pub_date": "2026-02-28 16:01:28",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876712",
            "title": "Strong Earnings Meet Stock Market Volatility",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w630\" alt=\"Currency and Exchange Stock Chart for Finance and Economy Display\" data-id=\"1358927461\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">cemagraphics/E+ via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p><em>By Carrie King </em></p> <p>Corporate America delivered again, with the S&amp;P 500 Index of U.S. stocks on pace for 13% growth in earnings for Q4 2025. This would mark the fifth consecutive quarter of double-digit growth, a stretch not seen since<span class=\"paywall-full-content\"> the 2021-2022 emergence from COVID-induced economic shutdowns. Revenue growth was the highest recorded for the index since Q2 2022.</span></p> <p class=\"paywall-full-content\">The makeup of the quarter’s results was familiar: The “magnificent” mega-cap stocks led the charge once again, with estimated earnings per share (EPS) growth of 30%. From a sector perspective, technology posted the hottest earnings growth (30%), followed by industrials (26%) and communication services (13%). At the opposite end of the spectrum, consumer discretionary, energy and healthcare showed flat to slightly negative EPS growth in the quarter.</p> <p class=\"paywall-full-content\">In another familiar pattern, an impressive 80% of companies beat their EPS estimates, though market reaction was muted relative to history. And as these solid earnings rolled in, S&amp;P 500 Index performance was largely unchanged, with some strong drawdowns countered by equally robust rebounds.</p> <p class=\"paywall-full-content\">Why the disconnect between solid earnings and volatile markets? It’s nuanced, but three things keep us optimistic as we look ahead to the start of 2026 earnings:</p> <h2 class=\"paywall-full-content\"><strong>1. Data supports strong 2026 earnings</strong></h2> <p class=\"paywall-full-content\">Earnings momentum does not appear to be slowing, as indicated by four key factors:</p> <ul class=\"paywall-full-content\"> <li> <strong>Analyst earnings estimates are climbing.</strong> Data from FactSet suggests another round of double-digit earnings growth in each of the four quarters of 2026, with current estimates placing growth at 14% for the year.</li> <li> <strong>Corporate sentiment is at a record high</strong>, according to a Bank of America analysis that parses positive and negative language in earnings calls.<sup>1</sup> </li> <li> <strong>AI’s impact is broadening</strong>. Earnings calls and surveys show AI-related productivity gains are touching more industries.<sup>2</sup> This could mean further upside to margins, which are already at historic highs (13% in Q4).</li> <li> <strong>More companies are raising guidance</strong> than lowering guidance.</li> </ul> <h2 class=\"paywall-full-content\"><strong>2. Fundamentals shine across time</strong></h2> <p class=\"paywall-full-content\">History has shown that fundamentals drive stock returns over longer time horizons. Yet short-term market action can be fickle and diverge from current fundamentals.</p> <p class=\"paywall-full-content\">Looking at Q4 earnings alongside year-to-date stock returns shows two notable dislocations:</p> <ul class=\"paywall-full-content\"><li>Despite reporting flat year-over-year earnings, <em>energy </em>is the best-performing sector so far this year, as shown in the chart below. This is in response to non-fundamental events, including recent geopolitical developments in Venezuela that could open up this large market to U.S. companies. Stocks of oilfield service and equipment companies rose in reaction. We also saw stock prices react to the cold snap across the U.S. A more than 20% uptick in natural gas prices in a matter of days boosted related stock prices. This illustrates that recent events can trigger transitory price moves that seem divorced from reported earnings.</li></ul> <p class=\"paywall-full-content\"><strong>The great divide</strong></p> <p class=\"paywall-full-content\"><em>Top- and bottom-performing S&amp;P 500 sectors, YTD total return and Q4 EPS growth</em></p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/55028208-1772263921402366_origin.png\" rel=\"lightbox\" data-width=\"907\" data-height=\"560\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/55028208-1772263921402366_origin.png?io=w640\" alt=\"Top- and bottom-performing S&amp;P 500 sectors, YTD total return and Q4 EPS growth\" contenteditable=\"false\" width=\"640\" height=\"395\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/55028208-1772263921402366_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/55028208-1772263921402366_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/55028208-1772263921402366_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/55028208-1772263921402366_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Source: BlackRock Fundamental Equities with data from FactSet as of Feb. 10, 2026. Chart shows the total return for the two best- and worst-performing S&amp;P 500 sectors year-to-date along with the sectors’ most recently reported earnings growth. Past performance is not a reliable indicator of current or future results. Indexes are shown for illustrative purposes only. It is not possible to invest directly in an index.</span></p></figcaption></figure></p> <ul class=\"paywall-full-content\"><li>Conversely, the <em>technology </em>sector is underperforming this year despite reporting stellar earnings for Q4. While earnings were positive across subsectors, dispersion in stock price performance has been outsized. Only <a href=\"https://www.blackrock.com/us/individual/insights/the-future-of-semiconductors\" rel=\"noopener\">semiconductors</a> and companies leveraged to the <a href=\"https://www.blackrock.com/us/individual/insights/investing-in-ai-infrastructure\" rel=\"noopener\">AI infrastructure buildout</a> are outperforming the broad market year-to-date. Meanwhile, software companies posted earnings results that were double expectations (30% vs. an outlook for 15%) but have undergone the largest 12-month non-recessionary drawdown in 30 years.<sup>3</sup> Even the AI hyperscalers, after delivering stellar Q4 earnings results, are underperforming as larger-than-expected capex spending comes under further scrutiny.</li></ul> <h2 class=\"paywall-full-content\"><strong>3. Dislocations can create opportunities</strong></h2> <p class=\"paywall-full-content\">Much ink has been spilled on the fear of AI disrupting the business models of software companies. The debate rages on and we are watchful on an individual stock basis. At the same time, we are focused on the <a href=\"https://www.blackrock.com/us/individual/insights/insight-on-ai-and-technology-stocks\" rel=\"noopener\">opportunities created by AI</a>. Early-year selling in tech stocks has been indiscriminate in some areas, providing ample opportunity to look for spots where the baby has been thrown out with the bathwater.</p> <p class=\"paywall-full-content\">One thing seems relatively clear: AI will speed up coding and result in the creation of more content. This has us setting our sights on companies that observe, store and secure data as a potentially misunderstood opportunity. Our view is for AI to continue powering market returns in 2026, even as the complexion of leaders and laggards may change ― a topic we discuss in <a href=\"https://www.blackrock.com/us/individual/insights/equity-investors-guide-2026\" rel=\"noopener\">An equity investor’s guide to 2026</a>.</p> <p class=\"paywall-full-content\">Our key takeaway after parsing Q4 2025 earnings and coincident 2026 YTD stock price performance: There will always be worries that move the markets and defy fundamentals. As <a href=\"https://www.blackrock.com/us/individual/investment-ideas/fundamental-equities\" rel=\"noopener\">active stock investors</a>, we embrace this as an opportunity to identify mispricings and establish or add to positions in fundamentally sound companies. It’s an exciting time to be actively invested.</p> <p class=\"paywall-full-content\"><strong>Footnotes</strong></p> <p class=\"paywall-full-content\">[1] Bank of America as of January 2026.</p> <p class=\"paywall-full-content\">[2] Goldman Sachs as of Jan. 30, 2026.</p> <p class=\"paywall-full-content\">[3] JPMorgan Global Markets Strategy as of Feb. 10, 2026. </p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\"><em>This <a href=\"https://www.blackrock.com/us/individual/insights/strong-earnings-meet-stock-market-volatility\" rel=\"nofollow\">post</a> originally appeared on BlackRock.</em></p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg",
            "link": "https://seekingalpha.com/article/4876712-strong-earnings-meet-stock-market-volatility",
            "pub_date": "2026-02-28 15:55:53",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876709",
            "title": "U.S. Earnings Season Ends On Strong Note",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1040865674/image_1040865674.jpg?io=getty-c-w630\" alt=\"Stock market report\" data-id=\"1040865674\" data-type=\"getty-image\" width=\"4200\" height=\"2400\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1040865674/image_1040865674.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1040865674/image_1040865674.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1040865674/image_1040865674.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1040865674/image_1040865674.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1040865674/image_1040865674.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1040865674/image_1040865674.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1040865674/image_1040865674.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1040865674/image_1040865674.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">bluebay2014/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Q4 earnings extend growth streak</h2> <p>The U.S. is on the back end of fourth quarter earnings season, and the overall tone from corporate management teams has been constructive. For the S&amp;P 500 Index, earnings growth tracked close to 15% year-over-year, marking<span class=\"paywall-full-content\"> a fifth consecutive quarter of double-digit growth. Management guidance looking ahead to the first quarter of 2026 reflects the strongest tone since 2021, reinforcing the durability of the earnings cycle.</span></p> <p class=\"paywall-full-content\">Despite that strength, price performance has been more restrained. U.S. large cap equities have largely treaded water so far this year, even as fundamentals improved. Beneath the surface, single-stock dispersion has been elevated as markets reassess how AI could <a href=\"https://seekingalpha.com/article/4875174-q1-active-management-pulse-positioning-broadens-beyond-ai-leaders\">reshape business models</a> and influence terminal values over the medium to longer term.</p> <p class=\"paywall-full-content\">This repricing dynamic has been particularly visible in parts of the <a href=\"https://seekingalpha.com/article/4876228-software-selloff-raises-stakes-active-managers\">software sector</a>, where investors are differentiating more deliberately across companies based on perceived competitive positioning and earnings durability.</p> <h2 class=\"paywall-full-content\">Diversification regains traction</h2> <p class=\"paywall-full-content\">Another theme this week was the continued benefit of diversification within equity markets. So far this year, market leadership has widened, with both non-U.S. stocks and U.S. small-cap stocks outperforming U.S. large caps.</p> <p class=\"paywall-full-content\">This shift aligns with one of the themes in our <a href=\"https://seekingalpha.com/article/4858283-2026-global-market-outlook-great-inflection-point\" rel=\"noopener\">2026 Global Market Outlook</a>, which is that market leadership is likely to broaden out this year. Case in point: Through Thursday’s market close, the MSCI All Country World Index excluding the U.S. has gained 11%.</p> <p class=\"paywall-full-content\">Meanwhile, U.S. small-cap equities have risen approximately 8%, while their large-cap counterparts have advanced only 1%. This widening gap suggests participation is expanding beyond the narrow group of mega-cap companies that drove returns in prior years.</p> <h2 class=\"paywall-full-content\">A Curious Move in U.S. Treasuries</h2> <p class=\"paywall-full-content\">Meanwhile, in the U.S. Treasury market, bond yields have moved lower even as the economic backdrop remains firm. This economic resilience is evident in the latest data. Recent reports have generally surprised to the upside, growth indicators are holding up, and the <a href=\"https://seekingalpha.com/article/4870390-us-jobs-report-tops-expectations\">labor market</a> - which led the Federal Reserve to lower rates late last year - appears to have stabilized.</p> <p class=\"paywall-full-content\">Under those conditions, Treasury yields would typically move higher. Instead, over the past month, they’ve declined by more than 20 basis points. The yield curve has also “bull-flattened” - meaning longer-term yields have fallen more than shorter-term rates.</p> <p class=\"paywall-full-content\">This is not the usual pattern when economic data is resilient, and it suggests investors are placing greater emphasis on managing risk. Ultimately, <a href=\"https://seekingalpha.com/article/4868078-market-signals-separating-wheat-from-chaff\">elevated equity volatility</a> and uncertainty around how AI may alter parts of the market have likely contributed to flows into Treasuries.</p> <p class=\"paywall-full-content\"><em>These views are subject to change at any time based upon market or other conditions and are current as of the date at the top of the page. The information, analysis, and opinions expressed herein are for general information only and are not intended to provide specific advice or recommendations for any individual or entity.</em></p> <p class=\"paywall-full-content\"><em>This material is not an offer, solicitation or recommendation to purchase any security.</em></p> <p class=\"paywall-full-content\"><em>Forecasting represents predictions of market prices and/or volume patterns utilizing varying analytical data. It is not representative of a projection of the stock market, or of any specific investment.</em></p> <p class=\"paywall-full-content\"><em>Nothing contained in this material is intended to constitute legal, tax, securities or investment advice, nor an opinion regarding the appropriateness of any investment. The general information contained in this publication should not be acted upon without obtaining specific legal, tax and investment advice from a licensed professional.</em></p> <p class=\"paywall-full-content\"><em>Diversification and strategic asset allocation do not assure a profit or guarantee against loss in declining markets.</em></p> <p class=\"paywall-full-content\"><em>Please remember that all investments carry some level of risk, including the potential loss of principal invested. They do not typically grow at an even rate of return and may experience negative growth. As with any type of portfolio structuring, attempting to reduce risk and increase return could, at certain times, unintentionally reduce returns.</em></p> <p class=\"paywall-full-content\"><em>The Russell Investments logo is a trademark and service mark of Russell Investments</em></p> <p class=\"paywall-full-content\"><em>The information, analyses and opinions set forth herein are intended to serve as general information only and should not be relied upon by any individual or entity as advice or recommendations specific to that individual entity. Anyone using this material should consult with their own attorney, accountant, financial or tax adviser or consultants on whom they rely for investment advice specific to their own circumstances.</em></p> <p class=\"paywall-full-content\"><em>Products and services described on this website are intended for <strong>United States residents only</strong>. Nothing contained in this material is intended to constitute legal, tax, securities, or investment advice, nor an opinion regarding the appropriateness of any investment, nor a solicitation of any type. The general information contained on this website should not be acted upon without obtaining specific legal, tax, and investment advice from a licensed professional. Persons outside the United States may find more information about products and services available within their jurisdictions by going to Russell Investments' Worldwide site.</em></p> <p class=\"paywall-full-content\"><em>Russell Investments is committed to ensuring digital accessibility for people with disabilities. We are continually improving the user experience for everyone, and applying the relevant accessibility standards.</em></p> <p class=\"paywall-full-content\"><em>Russell Investments' ownership is composed of a majority stake held by funds managed by TA Associates Management, L.P., with a significant minority stake held by funds managed by Reverence Capital Partners, L.P. Certain of Russell Investments' employees and Hamilton Lane Advisors, LLC also hold minority, non-controlling, ownership stakes.</em></p> <p class=\"paywall-full-content\"><em>Frank Russell Company is the owner of the Russell trademarks contained in this material and all trademark rights related to the Russell trademarks, which the members of the Russell Investments group of companies are permitted to use under license from Frank Russell Company. The members of the Russell Investments group of companies are not affiliated in any manner with Frank Russell Company or any entity operating under the \"FTSE RUSSELL\" brand.</em></p> <p class=\"paywall-full-content\"><em>© Russell Investments Group, LLC. 1995-2026. All rights reserved. This material is proprietary and may not be reproduced, transferred, or distributed in any form without prior written permission from Russell Investments. It is delivered on an \"as is\" basis without warranty.</em></p> <p class=\"paywall-full-content\"><em>CORP-13002</em></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\"><em><a href=\"https://russellinvestments.com/content/ri/us/en/insights/russell-research/2026/02/earnings-season-strong-note-mwir.html\" rel=\"nofollow\">Original Post</a></em></p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1040865674/image_1040865674.jpg",
            "link": "https://seekingalpha.com/article/4876709-us-earnings-season-ends-on-strong-note",
            "pub_date": "2026-02-28 15:46:49",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876697",
            "title": "Golar LNG: The Base Is Priced, The Upside Is Not",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331266624/image_1331266624.jpg?io=getty-c-w630\" alt=\"A typical Offshore Accommodation and Work Barge in the Oil and Gas industry. Offshore Accommodation Barge to serve as an offshore hotel to personnel and crew.\" data-id=\"1331266624\" data-type=\"getty-image\" width=\"1536\" height=\"1152\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331266624/image_1331266624.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331266624/image_1331266624.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331266624/image_1331266624.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331266624/image_1331266624.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331266624/image_1331266624.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331266624/image_1331266624.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331266624/image_1331266624.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331266624/image_1331266624.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">sarawutk/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Investment Thesis</h2> <p>Traditionally an offshore drilling project had to be accompanied by an onshore liquefaction terminal that makes the whole project very upfront capex intensive and can take over a decade to permit and construct. This<span class=\"paywall-full-content\"> made exploration of mid-sized gas fields very uneconomical, and for developing countries, investing billions of dollars upfront was also a big problem.</span></p> <p class=\"paywall-full-content\">Floating LNG changes that equation. Placing liquefaction directly offshore reduces capital intensity, shortens the time to first export to only a few years, and avoids political and environmental friction of onshore plants. For developing nations that cannot put billions of dollars in upfront capex and need export revenue quickly, that is often the only monetization route. This structural advantage is the reason FLNGs have been steadily expanding across West Africa and South America, and why we believe credible operators like Golar are ideally positioned to secure additional long-term contracts.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090426042_origin.png\" rel=\"lightbox\" data-width=\"758\" data-height=\"386\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090426042_origin.png?io=w640\" alt=\"FLNG Competitive Advantage\" contenteditable=\"false\" width=\"640\" height=\"326\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090426042_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090426042_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090426042_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090426042_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Earnings Presentation</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The economics of the contract are equally important. Golar’s vessels have secured long-term 20-year take-or-pay contracts, where the customer carries much of the operational and commodity risk, while Golar receives relatively stable liquefaction fees. Under these contracts, Golar has downside protection, but it shares in the upside above a specified LNG price. There is also partial CPI indexation.</p> <p class=\"paywall-full-content\">As global demand for flexible LNG infrastructure grows and management actively seeks to secure additional contracts, each additional long-term deployment has the potential to materially expand the cash flow and serve as a natural catalyst for the stock.</p> <p class=\"paywall-full-content\">Just as critical, today’s Golar is much simpler. Previously the company operated across LNG shipping, FSRUs, downstream gas infrastructure, and multiple affiliated entities, which complicated the core economics of the business. All of the businesses except a focused FLNG platform have been sold off. This FLNG platform is currently centered on vessels such as Hilli, Gimi, and MKII, each backed by long-term contracts. New build decisions are linked to securing contracts first, protecting from speculative expansion. This makes the business easier to understand and closer in nature to the contracted infrastructure model. As this cleaner structure becomes more visible through operating cash flows, the valuation multiple applied by the market has room to shift accordingly.</p> <h2 class=\"paywall-full-content\">Golar Past, Present &amp; Future</h2> <p class=\"paywall-full-content\">For a long time, Golar was difficult to understand and even harder to value. The company operated across multiple sectors that included LNG shipping, floating storage and regasification units (FSRUs), downstream gas infrastructure, and a web of affiliated entities and joint ventures. Cash flows moved between structures, assets were periodically dropped down, and the balance sheet reflected a mix of project financing, guarantees, and legacy obligations. None of this was unusual for the LNG world, but it created a level of complexity that kept many long-term investors on the sidelines.</p> <p class=\"paywall-full-content\">This structure also made the business cyclical and unpredictable. Shipping exposure introduced sensitivity to charter rates and capital markets, while downstream and affiliate investments added execution and financing risks that were difficult to model from outside. Even when individual assets performed well, the overall story lacked clarity. Investors were left trying to analyze different businesses with different economics and risk profiles, which led to a discounted valuation multiple.</p> <p class=\"paywall-full-content\">Over the past few years this structure has been <a href=\"https://www.globenewswire.com/news-release/2025/02/13/3025971/0/en/Sale-of-LNGC-Golar-Arctic-Marks-Golar-s-Exit-From-LNG-Shipping-Segment.html\" rel=\"nofollow\">wound down</a>. LNG carriers were separated, FSRU and downstream positions were sold, and various affiliated interests were simplified or exited. What remained was a singles business centered around liquification vessels. Many investors still anchor to the older, complicated version of Golar rather than the streamlined platform that exists today.</p> <p class=\"paywall-full-content\">Understanding this history is important because it explains the starting point of the current opportunity. The valuation discounts attached to complexity don't disappear immediately after simplification. It usually fades when the new structure starts to produce consistent visible cash flows. Golar is entering this phase where the past will matter less and the economics of the remaining FLNG business will start to dominate the story.</p> <p class=\"paywall-full-content\">The remaining FLNG business, being fundamentally different from the business Golar used to run, is now far less cyclical and depends less on the charter rates or trading style exposure; revenue now is tied to multiyear leasing agreements with large energy counterparties. Each vessel effectively behaves like a standalone infrastructure project with high upfront capital but, once operational, capable of producing dollar denominated EBITDA for decades. The variability that once defined a company’s earning profile is steadily being replaced by duration and contract visibility.</p> <p class=\"paywall-full-content\">Just as important is the <a href=\"https://www.golarlng.com/investors/press-releases/pr-story.aspx?ResultPageURL=https://rss.globenewswire.com/HexMLItem/Content/FullText/Attachments/All/Identifier/3244404/language/en\" rel=\"nofollow\">discipline</a> around growth. Management is no longer pursuing uncontracted asset accumulation and complex structures. New vessels are only sanctioned when a new contract is secured. This “contract first, build second” approach slows the growth but increases the quality of each incremental dollar invested. Over time this produces a cleaner equity story with fewer surprises and more predictable cash flows and clear valuation anchors.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899092364728.png?io=w640\" alt=\"FLNG Asset Portfolio\" contenteditable=\"false\" width=\"577\" height=\"326\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899092364728.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899092364728.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899092364728.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Earnings Presentation</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">In addition to the FLNG vessels, Golar owns a 10% equity stake in <a href=\"https://www.offshore-energy.biz/golar-secures-flng-charter-as-lng-momentum-in-argentina-builds/\" rel=\"nofollow\">Southern Energy S.A.</a> (SESA). SESA is a newly formed company to unlock LNG exports in Argentina. SESA is owned by Pan American Energy (30%), YPF (25%), Pampa Energia (20%), Harbour Energy (15%), and Golar (10%). Effectively, SESA is a public-private partnership to incentivize LNG production by aligning state interests (<a href=\"https://seekingalpha.com/symbol/YPF\" title=\"YPF Sociedad Anónima\">YPF</a>) with private sector operators (Golar, etc.).</p> <h2 class=\"paywall-full-content\">The Misunderstood Mechanic</h2> <p class=\"paywall-full-content\">For many investors, Golar is still mentally grouped with LNG producers, shippers, or other energy names whose earnings rise and fall with commodity prices. This framing feels intuitive because the company trades in the gas value chain. But economically it is inaccurate, as once the FLNG vessel is operational, the majority of Golar's revenue is not tied to the commodity price itself but to fixed long-term leasing agreements that pay for liquefaction capacity rather than the commodity being sold.</p> <p class=\"paywall-full-content\">This distinction matters more than it first appears. Commodity businesses are valued on cycles, margins, and forward price curves. Infrastructure assets are valued on duration, contract quality, and cash flow visibility. As Golar’s portfolio shifted towards FLNG, the lens through which the company is valued should change as well. Yet market perception often lags structural reality, leaving the shares trading closer to cyclical energy multiples than long-duration infrastructure ones.</p> <p class=\"paywall-full-content\">There is a second layer of misunderstanding. Since FLNG projects require years of construction before generating cash, the income statement can look stagnant before a major step in change in earnings. When a vessel moves from redevelopment into full operation, the EBITDA doesn’t grow gradually; it resets in discrete jumps tied to contract commencement. Investors focused on near-term reported numbers may miss this timing dynamic, even though it is precisely how value is created in project-based infrastructures.</p> <p class=\"paywall-full-content\">Taken together, these two mechanics, commodity insulation &amp; step change cash generation, help explain why Golar can appear optically cyclical while becoming economically stable. The market often recognizes that shift only when cash flows are actually visible, not while they are still forming.</p> <h2 class=\"paywall-full-content\">FLNG Contract Details</h2> <p class=\"paywall-full-content\">The easiest way to understand Golar is to focus only on the three vessels that define the company’s future economics.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090288253_origin.png\" rel=\"lightbox\" data-width=\"770\" data-height=\"402\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090288253_origin.png?io=w640\" alt=\"Contract Details\" contenteditable=\"false\" width=\"640\" height=\"334\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090288253_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090288253_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090288253_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899090288253_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Earnings Presentation</span></p></figcaption></figure></p> <p class=\"paywall-full-content\"><a href=\"https://www.golarlng.com/~/media/Files/G/Golar-Lng/documents/annual-reports/2024-annual-report-form-20-f-golar-lng.pdf\" rel=\"nofollow\">FLNG Gimi</a>, a vessel of 2.5 mtpa, is located at the Greater Tortue Ahmeyim project offshore Mauritania &amp; Senegal. The vessel runs under a 20-year agreement with BP extending into 2045. Golar’s effective economic interest is about 70%, while the remainder is owned by BP, translating into roughly $150 million of annual EBITDA for Golar generated primarily through fixed lease payments. This translates into roughly $3 billion dollars of EBITDA backlog over the contract term. There is no commodity linkage, and the CPI indexation was not explicitly disclosed. The absence of commodity linkage makes the contract completely indifferent to the LNG prices. The heavy conversion capex is already spent, leaving only maintenance capex requirements going forward. Gimi is functioning as the company’s first long-duration cash flow anchor, establishing a stable earnings base.</p> <p class=\"paywall-full-content\"><a href=\"https://www.golarlng.com/~/media/Files/G/Golar-Lng/documents/annual-reports/2024-annual-report-form-20-f-golar-lng.pdf\" rel=\"nofollow\">FLNG Hilli</a>, a 2.45 mtpa vessel, is still operating under a legacy contract in Cameroon, which expires in mid-2026. Its economic relevance lies in the redeployment to Argentina under a new 20-year charter with Southern Energy S.A. expected to begin around 2027. Under this contract, base income alone implies roughly $285 million of annual EBITDA, materially higher than the current contract. This base income translates into a backlog of $5.7 billion covering the contract term running till 2047. The agreement also incorporates a balanced commodity participation framework. Golar receives about 25% of LNG prices above $8/MMBtu, while downside exposure is limited by a floor of $6/MMBtu. If LNG prices go down to $6 and Golar earns less than the base income for a period of time, then there is a provision in the contract that allows them to recoup that lost revenue when LNG prices go back above $7.5. After year 6 there is also a partial CPI indexation that provides real return protection.</p> <p class=\"paywall-full-content\"><a href=\"https://www.golarlng.com/~/media/Files/G/Golar-Lng/documents/annual-reports/2024-annual-report-form-20-f-golar-lng.pdf\" rel=\"nofollow\">MKII FLNG</a>, a 3.5 mtpa vessel, is currently under conversion for Argentina. There is roughly $2.2 billion in conversion capex ahead of the expected start-up around 2028. The 20-year SESA charter implies approximately $400 million of annual base EBITDA, and a total backlog of $8 billion over the contract period. All of the other contract dynamics are the same as FLNG Hilli.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772190329217416_origin.png\" rel=\"lightbox\" data-width=\"1523\" data-height=\"625\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772190329217416_origin.png?io=w640\" alt=\"Golar contract details\" width=\"640\" height=\"263\" contenteditable=\"false\" data-width=\"640\" data-height=\"263\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772190329217416_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772190329217416_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772190329217416_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772190329217416_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Moat Investing</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Argentina naturally sounds like the part of the story that should worry investors, and operating there does come with real political risks and regulatory uncertainty. Both SESA and Golar have been given strong protections and guarantees that significantly de-risk the venture. The agreements are governed by <a href=\"https://finance.yahoo.com/quote/GLNG/earnings/GLNG-Q4-2025-earnings_call-399363.html\" rel=\"nofollow\">English law,</a> with disputes handled through International Chamber of Commerce arbitration, and payments are made entirely in USD, which removes local currency exposure. SESA has also secured a 30-year uninterrupted LNG export license. On top of that, Argentina has introduced the RIGI framework, which effectively fixes the regulatory and tax regime for the duration of the investment. None of this makes the jurisdiction risk-free, but it does suggest a structure that was designed to limit the risks that concern the investors.</p> <p class=\"paywall-full-content\">One detail that is important to highlight the relationship between the stakeholders is how closely the stakeholders are connected with each other. FLNG Gimi is contracted to BP which also owns a 30% economic interest. BP is not just paying a fee to use the vessel but is also exposed to the same long-term cash flows. The other two vessels, Hilli and MKII, are contracted to SESA, where Golar owns a 10% stake in SESA. These kinds of relations don’t eliminate risks but are reassuring nonetheless, as they suggest a relationship that is more anchored than a typical service contract.</p> <p class=\"paywall-full-content\">Management is actively marketing a 4<sup>th</sup> vessel contract. They were in the <a href=\"https://ml-eu.globenewswire.com/Resource/Download/09f4c5d2-f034-4720-986d-342907f92174\" rel=\"nofollow\">process of ordering</a> long lead items in Q4 2025. They have started to look for and identify donor vessels, and the construction times for all three new designs have been confirmed. This is no longer a distant concept.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899086654599_origin.png\" rel=\"lightbox\" data-width=\"758\" data-height=\"374\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899086654599_origin.png?io=w640\" alt=\"4th FLNG\" contenteditable=\"false\" width=\"640\" height=\"316\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899086654599_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899086654599_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899086654599_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-17721899086654599_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Earnings Presentation</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Valuation</h2> <p class=\"paywall-full-content\">Across Gimi, Hilli, and MKII, the company has moved towards a structure where EBITDA is contracted, capacity-based, and visible over decades. The right way to think about the business is not through next year’s earnings but through the NPV of these long-dated contracts that define the business now. Our valuation, therefore, is based on contract by-contract NPV.</p> <p class=\"paywall-full-content\">I want to touch on a less complicated part of valuation first, which is valuing Golar's stake in SESA. Currently LNG is trading around $11/MMBtu; as per the company’s own estimates, SESA would contribute around $90 million in EBITDA at this price. We will use $10 of LNG price as reference, which translates to an EBITDA of $70 million, applying an 8x multiple, which is consistent with publicly traded E&amp;Ps; Golar's stake is valued at $460 million. This translates to a per-share value of $4.5.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-177218990901781_origin.png\" rel=\"lightbox\" data-width=\"1397\" data-height=\"754\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-177218990901781_origin.png?io=w640\" alt=\"Contracted EBITDA\" contenteditable=\"false\" width=\"640\" height=\"345\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-177218990901781_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-177218990901781_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-177218990901781_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-177218990901781_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Earnings Presentation</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">We will value the current contracts in two parts: first, the NPV of the current cash flows at base prices, and second, the NPV of the commodity upside part.</p> <p class=\"paywall-full-content\">The effective tax used for the NPV is 7.5%, as the tax burden on the company is structurally low. Key cash flows are generated through offshore Mauritania/Senegal and Argentina’s RIGI investment regime, both of which provide stability and reduced taxation for foreign capital. In addition, large depreciation shields from vessel conversion capex further reduce taxable income in early years.</p> <p class=\"paywall-full-content\">Once vessels are operating, the business becomes light on recurring capital needs. Ongoing requirements are largely limited to modest maintenance capex typical of maritime infrastructures. We are going to use a modest number for this in our NPV calculations. There is still redeployment capex on Hilli and conversion capex on the MKII and these should be accounted for in NPV. I have estimated that the redeployment capex is around $400 million and the conversion capex to be $1.2 billion, and these are spread into the next three years.</p> <p class=\"paywall-full-content\">Lastly, the discount rate used is 7%. This reflects the hybrid risk profile of the assets: not sovereign risk-free but also far removed from the commodity-exposed upstream LNG. With 20-year take-or-pay contracts, strong counterparties, and infrastructure like visibility once operational, the economics sit closely to contracted energy infrastructure. A mid-single-digit discount rate is therefore appropriate.</p> <p class=\"paywall-full-content\">Using these assumptions and excluding inflation indexation and commodity upside, the NPV of the current contracts falls in the range of $40 and $45 per share.</p> <p class=\"paywall-full-content\">Moving onto the commodity upside part. As per the company’s estimates, the commodity link part will add $30 million in EBITDA for Hilli and $40 million for MKII for every $1 increase achieved in FOB price above the reference price of $8/MMBtu. Assuming this increase is sustained over the contract term and using the same tax and WACC, this incremental EBITDA would translate into $5.74 per share. The purpose of keeping this potential upside separate from the base cash flows is that everyone has different views on the prices of LNG and we won’t make the mistake of trying to model LNG prices 20 years into the future. This has given an estimate of how much incremental EBITDA per $1 increase in LNG prices would be worth per share.</p> <p class=\"paywall-full-content\">We don’t have to make an attempt to value the CPI indexation and new FLNG contracts, as they are not baked into the price. From the valuation analysis, we can conclude that the current share price largely reflects the value of existing contracts alone, without credit for commodity-linked upside, value of the stake in SESA, new FLNG contracts that management is actively pursuing, and CPI indexation.</p> <p class=\"paywall-full-content\">In other words, investors are not paying for any growth. Yet the structural advantages of FLNGs—lower capital intensity, faster deployment, and strong global demand for gas monetization—suggest additional contracts are more likely than not over time.</p> <p class=\"paywall-full-content\">Another thing that gets overlooked is Golar's continued focus on returning capital to shareholders. In the last 5 years, the company has repurchased $228 million in shares, paid $261 million in dividends, and bought back assets worth $323 million. In June 2025, the company purchased an additional 2.5 million shares in connection with a convertible bond offering, and in November 2025, the board authorized a new $150 million buyback program.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772189909056559_origin.png\" rel=\"lightbox\" data-width=\"1220\" data-height=\"619\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772189909056559_origin.png?io=w640\" alt=\"Shareholder Returns\" contenteditable=\"false\" width=\"640\" height=\"325\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772189909056559_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772189909056559_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772189909056559_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/53049850-1772189909056559_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Earnings Presentation</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Risks</h2> <p class=\"paywall-full-content\">As with any business, Golar doesn’t come without any risks. This is not a business exposed to daily commodity swings or short-cycle demand shifts. Instead, the real risks lie in a smaller number of high-impact variables.</p> <p class=\"paywall-full-content\">The biggest risk is execution, Hilli redeployment, and MKII conversion still require capital, timing discipline, and technical delivery. Delays or cost overruns would not permanently impair the business, but they would shift cash flow timing and postpone the step change the market is waiting to see.</p> <p class=\"paywall-full-content\">The second is jurisdictional and counterparty risk. FLNG projects operate in emerging and politically complex regions. Contracts are long-term and structured for durability, but over multidecade periods, regulatory change, fiscal pressure, or political instability can never be ruled out entirely.</p> <p class=\"paywall-full-content\">There is also a macro risk. Even though contracted FLNG cash flows are largely insulated from LNG spot prices, the shares can still move with broader energy sentiment.</p> <p class=\"paywall-full-content\">Capital allocation discipline is very critical in capital-intensive industries. Although the management has vowed not to develop another vessel without getting the contract first, the long-term outcome still depends on management maintaining this restraint when new opportunities emerge. In capital-intensive sectors, value is often determined less by the first project than by the decisions that follow that early success.</p> <h2 class=\"paywall-full-content\">Conclusion</h2> <p class=\"paywall-full-content\">The market appears to be roughly valuing Golar in line with the NPV of the current contracted vessels at base prices. In other words, investors are only paying for what is already signed and largely visible.</p> <p class=\"paywall-full-content\">What does not seem to be reflected is the value of the SESA stake, the commodity-linked upside in the Argentina contracts, and the probability of additional FLNG contracts. None of these require aggressive modelling. They simply require time and execution. The base contracts already exist, the equity participation is already funded, and the management is actively marketing new MKI &amp; MKIII vessels under the same contract-backed framework.</p> <p class=\"paywall-full-content\">That asymmetry is what makes the setup interesting. The downside is being anchored to the long-term contracts. The upside comes from elements that are either contractual but unpriced or structural and likely to emerge over time.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">The story does not depend on blind hope. It depends on the market gradually realizing the existing base is real and anything layered on top of it is incremental.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331266624/image_1331266624.jpg",
            "link": "https://seekingalpha.com/article/4876697-golar-lng-the-base-is-priced-the-upside-is-not",
            "pub_date": "2026-02-28 15:41:32",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}