{
    "data": [
        {
            "id": "4754696",
            "title": "KKR Real Estate Finance Trust Inc. 2024 Q4 - Results - Earnings Call Presentation",
            "description": "<p>The following slide deck was published by KKR Real Estate Finance Trust Inc. in conjunction with their 2024 Q4 earnings call.</p> <p></p>",
            "image": null,
            "link": "https://seekingalpha.com/article/4754696-kkr-real-estate-finance-trust-inc-2024-q4-results-earnings-call-presentation",
            "pub_date": "2025-02-04 19:24:41",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754689",
            "title": "Baron Durable Advantage Fund Q4 2024 Shareholder Letter",
            "description": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w750\" alt=\"Currency and Exchange Stock Chart for Finance and Economy Display\" data-id=\"1358927461\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption><p class=\"item-credits\">cemagraphics</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div></p> <h2>Dear Baron Durable Advantage Fund Shareholder:</h2> <p>We had another good quarter to finish out a solid 2024.</p> <p>Baron Durable Advantage Fund® (the Fund) gained 3.1% (Institutional Shares) in the fourth quarter, compared to the 2.4% gain for the S&amp;P 500 Index (the Index). For calendar year 2024, the Fund gained 27.1%, which compared favorably to the 25.0% gain for the Index.</p> <p><strong>Table I. - Performance - Annualized for periods ended December 31, 2024</strong></p> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <colgroup> <col> <col> <col> <col> <col> <col> <col> </colgroup> <thead><tr> <th> </th> <th>Baron Durable Advantage Fund Retail Shares1,2</th> <th>Baron Durable Advantage Fund Institutional Shares1,2</th> <td>S&amp;P 500 Index<sup>1</sup> </td> </tr></thead> <tr> <td>Three Months<sup>3</sup> </td> <td>3.11%</td> <td>3.14%</td> <td>2.41%</td> </tr> <tr> <td>One Year</td> <td>26.87%</td> <td>27.14%</td> <td>25.02%</td> </tr> <tr> <td>Three Years</td> <td>11.36%</td> <td>11.63%</td> <td>8.94%</td> </tr> <tr> <td>Five Years</td> <td>16.93%</td> <td>17.21%</td> <td>14.53%</td> </tr> <tr> <td>Since Inception(December 29, 2017)</td> <td>16.12%</td> <td>16.40%</td> <td>13.83%</td> </tr> </table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table><tr><td><p>Performance listed in the table above is net of annual operating expenses. The gross annual expense ratio for the Retail and Institutional Shares as of September 30, 2023 was 1.40% and 1.00%, respectively, but the net annual expense ratio was 0.95% and 0.70% (net of the Adviser's fee waivers), respectively. The performance data quoted represents past performance. Past performance is no guarantee of future results. The investment return and principal value of an investment will fluctuate; an investor's shares, when redeemed, may be worth more or less than their original cost. The Adviser waives and/ or reimburses certain Fund expenses pursuant to a contract expiring on August 29, 2035, unless renewed for another 11-year term and the Fund's transfer agency expenses may be reduced by expense offsets from an unaffiliated transfer agent, without which performance would have been lower. Current performance may be lower or higher than the performance data quoted. For performance information current to the most recent month end, visit BaronCapitalGroup.com or call 1-800-99-BARON.</p></td></tr></table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p>U.S. large-cap equities was again the place to be in 2024. After a 26.3% gain last year, the S&amp;P 500 Index returned an impressive 25.0% for an encore. The U.S. economy remains strong, with the latest GDP forecast from the Atlanta Fed estimating 3.1% GDP growth in the fourth quarter, while the rate of inflation remained below 3%. It seems that only yesterday Apple's market cap reached the <em>$1 trillion milestone</em>. As of January 2025, after a two-year blockbuster run, there were <strong>eleven</strong> companies with market values of $1 trillion or more. While Apple remained the world's most valuable company at $3.8 trillion, it was joined by <strong>NVIDIA (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>)</strong>, <strong>Microsoft (<a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a>)</strong>, <strong>Alphabet (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>)</strong>, <strong>Amazon (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>)</strong>, <strong>Meta (<a href=\"https://seekingalpha.com/symbol/META\" title=\"Meta Platforms, Inc.\">META</a>)</strong>, Tesla (<a href=\"https://seekingalpha.com/symbol/TSLA\" title=\"Tesla, Inc.\">TSLA</a>), Berkshire Hathaway (<a href=\"https://seekingalpha.com/symbol/BRK.A\" title=\"Berkshire Hathaway Inc.\">BRK.A</a>)(<a href=\"https://seekingalpha.com/symbol/BRK.B\" title=\"Berkshire Hathaway Inc.\">BRK.B</a>), <strong>Taiwan Semiconductor (<a href=\"https://seekingalpha.com/symbol/TSM\" title=\"Taiwan Semiconductor Manufacturing Company Limited\">TSM</a>)</strong>, Saudi Aramco, and <strong>Broadcom</strong>. An impressive run and a notable list, indeed. Seven of these companies, collectively known as the Magnificent Seven, were again the key driver of Index returns. In 2023, Alphabet, Amazon, Apple, Meta, Microsoft, NVIDIA, and Tesla represented 26% of the Index, on average, and accounted for 62% of its gains. In 2024, this group was responsible for 53% of the Benchmark's return, while representing approximately 31% of its weight. Our Magnificent Seven holdings outperformed the Index's by 127bps, while the rest of our portfolio outperformed the remainder of the Index's holdings by 402bps.</p> <p>Magnificent Seven performance has captured a lot of attention from the news and financial media, who spend a lot of time highlighting the group's returns but not so much emphasizing its fundamentals. As a group, Magnificent Seven total operating profits rose from $343 billion in 2022 to $575 billion in 2024<sup>4</sup>, and its free cash flow increased from $256 billion to $414 billion. During 2024, consensus estimates for 2025 earnings have increased by 21%. Now, add the fact that these companies are some of the best and most obvious beneficiaries of the AI opportunity, owning and operating key platforms enabling AI. In that context, is it really surprising that the Magnificent Seven performed as well as they did?</p> <p>From a quarterly performance attribution perspective, there was not much insight to be gleaned from what was a pretty uneventful quarter. We did well in Financials where <strong>Apollo</strong> (<a href=\"https://seekingalpha.com/symbol/APO\" title=\"Apollo Global Management, Inc.\">APO</a>) and <strong>LPL Financial</strong> (<a href=\"https://seekingalpha.com/symbol/LPLA\" title=\"LPL Financial Holdings Inc.\">LPLA</a>) generated excess returns, while our investments in Industrials and Health Care lagged. Not having investments in Materials, Utilities, and Energy also contributed to relative returns. Broadcom, Amazon, Apollo, LPL Financial, and Taiwan Semiconductor were our top five contributors to absolute returns, while <strong>Monolithic Power (<a href=\"https://seekingalpha.com/symbol/MPWR\" title=\"Monolithic Power Systems, Inc.\">MPWR</a>)</strong>, <strong>Thermo Fisher (<a href=\"https://seekingalpha.com/symbol/TMO\" title=\"Thermo Fisher Scientific Inc.\">TMO</a>)</strong>, and <strong>Danaher (<a href=\"https://seekingalpha.com/symbol/DHR\" title=\"Danaher Corporation\">DHR</a>)</strong> detracted.</p> <p>For the year, investments in Communication Services, Consumer Staples, Consumer Discretionary, and Financials contributed 376bps combined to relative returns, while not owning stocks in Energy, Materials, and Utilities added an additional 136bps. This was offset by poor performance in Real Estate, Information Technology, and Health Care holdings, which detracted 126bps. From a stock specific perspective, we had 29 contributors and 8 detractors - a solid batting average in what was a mixed year for our investable universe. But where we really shined was our slugging percentage with NVIDIA, Meta, Amazon, Broadcom, Taiwan Semiconductor, Apollo, Alphabet, Microsoft, and <strong>Brookfield</strong> contributing over 100bps each to absolute gains, while 13 of our holdings saw their stock prices rise over 30%. The average position size of investments that outperformed the Index was 3.6%, while the average position size of those that underperformed was 2.1% - or 150bps lower.</p> <p>The last three years proved to be quite a ride for equity investors. In many ways, it can be perceived and evaluated as a full market cycle: a sizable drawdown in 2022, followed by a meaningful recovery in 2023 and 2024. We are pleased with how the Fund performed over this combined period, generating a gain of 39.1%, close to 1,000bps better than the 29.3% return for the S&amp;P 500 Index. As a reminder, we seek to generate 100bps to 200bps of alpha over the Index (per year, net of fees and expenses, and over full-market cycles) by investing in high-quality, competitively advantaged businesses for the long term, while minimizing the probability of a permanent loss of capital. We do it differently from many of our competitors who construct their portfolios similarly to the Index by combining cheap <em>value</em> stocks with more expensive <em>growth</em> stocks. Both value and growth labels are as much a function of the multiple that is currently assigned to the stock as they are of the business's growth; they do not tell us anything about the most important characteristic of the business: its quality.</p> <p>Instead of splitting the investable universe into value stocks and growth stocks, we separate them into high-quality and lower-quality businesses. We further split the high-quality category into <em>Big Ideas</em> and companies that we call <em>holders of value</em>. Big Ideas are businesses going through the steep part of their growth s-curves that are in the earlier stages of their growth life cycles from the industry penetration perspective. These are companies that are either driving or are benefiting from disruptive change and that can become significantly larger in the future than they are today. This is the bread and butter of many investment strategies at Baron. This Fund, however, offers a home for the companies that are either in the later stages of being a Big Idea or that are transitioning into becoming holders of value (although, occasionally we may find a company priced and perceived as a holder of value that is on its way to becoming a Big Idea, as was the case with NVIDIA when we first invested in the company towards the end of 2022, and Broadcom, which was acquired early in 2024). Essentially, we focus on long-term <em>compounders with lower risk</em>: the highest quality large-cap companies with attractive business models (asset light, high recurring revenues, low financial leverage, etc.), durable growth characteristics (long duration of growth, though the growth rates may be lower), that solve critical problems for their customers and have durable competitive advantages. Typically, these companies face lower risk of getting disrupted by competitors or new technologies. We also look for management teams with long track records of operational excellence and prudent capital allocation. One of the most common signs of a company leaving the realm of a Big Idea and transitioning into the holder of value is the recognition that it can no longer reinvest all of its excess cash flow back into the business at high rates of return, and therefore it chooses to return capital back to shareholders via dividends or stock buybacks. If we are successful in identifying and investing in businesses with the above characteristics, it should make our claim and conviction in <em>lower risk of a permanent loss of capital</em> somewhat self-evident.</p> <p>We believe that the best way to assess whether we are successful in doing what we set out to do is to measure our performance over full market cycles. We believe that rolling monthly performance is helpful in that regard. This analysis shows that on an annual basis, the Fund has outperformed the S&amp;P 500 Index and its Morningstar peer group, 62% and 68% of the time, respectively.* But as the time horizon extends so has the Fund's winning percentage. On a 3-year rolling monthly return basis, it has outperformed 78% and 86%, and on a 5-year basis, the Fund has outperformed 96%, and 100% of the time, respectively. Note of course that past performance does not guarantee future results.</p> <p><strong>Table II - Percentage of time Fund outperformed benchmarks and peers over different time periods from inception through 12/31/2024</strong></p> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <colgroup> <col> <col> <col> <col> <col> </colgroup> <thead><tr> <th>Rolling Return Period</th> <th>3 Months</th> <th>1 Year</th> <th>3 Years</th> <th>5 Years</th> </tr></thead> <tr> <td>Fund Outperformance vs. S&amp;P 500 Index</td> <td>61%</td> <td>62%</td> <td>78%</td> <td>96%</td> </tr> <tr> <td>Fund Outperformance vs. Morningstar Large Growth Category Average*</td> <td>59%</td> <td>68%</td> <td>86%</td> <td>100%</td> </tr> </table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table><tr><td> <p>The performance data quoted represents past performance. Current performance may be lower or higher than the performance data quoted. The indexes is unmanaged. Index performance is not Fund performance. Investors cannot invest directly in an index.</p> <p>*As of 12/31/2024, the annualized returns of the Morningstar Large Growth Category average were 28.96%, 15.42%, and 14.28% for the 1-year, 5-year, and since inception (12/29/2017) periods, respectively.</p> <p>Sources: Baron Capital, S&amp;P Global Inc., and Morningstar Direct.</p> </td></tr></table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <h2>Top Contributors to Performance</h2> <p><strong>Table III - Top contributors to performance for the quarter ended December 31, 2024</strong></p> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <colgroup> <col> <col> <col> <col> <col> </colgroup> <thead><tr> <th> </th> <th>Quarter End Market Cap($ billions)</th> <td>Contribution to Return (%)</td> </tr></thead> <tr> <td>Broadcom Inc.</td> <td>1,086.7</td> <td>1.26</td> </tr> <tr> <td>Amazon.com, Inc.</td> <td>2,306.9</td> <td>1.10</td> </tr> <tr> <td>Apollo Global Management, Inc.</td> <td>93.5</td> <td>1.02</td> </tr> <tr> <td>LPL Financial Holdings Inc.</td> <td>24.4</td> <td>0.65</td> </tr> <tr> <td>Taiwan Semiconductor Manufacturing Company Limited</td> <td>1,024.3</td> <td>0.58</td> </tr> </table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p><strong>Broadcom Inc.</strong> (<a href=\"https://seekingalpha.com/symbol/AVGO\" title=\"Broadcom Inc.\">AVGO</a>) is a fabless semiconductor and enterprise software company with 60% of revenue from semiconductors and 40% from software. Shares increased 34.8% in the fourth quarter, and 72.4%<sup>5</sup> in 2024, on rising investor confidence in its AI market opportunity and strong execution across segments. Broadcom reported solid fourth quarter results, driven by robust semiconductor solutions growth of 12% with AI revenues reaching $12.2 billion for the fiscal year, although software revenues slightly missed forecasts due to deal delays. Broadcom estimated its serviceable addressable market for AI at a range of $60 billion to $90 billion by fiscal 2027, primarily across Google, Meta, and ByteDance, with additional opportunity with other customers. Moreover, the company continues to progress ahead of schedule on integrating VMware, with rapid margin expansion (reducing VMware spend to $1.2 billion in the fourth quarter of 2024, down 50% from $2.4 billion prior to the acquisition) and faster-than-anticipated incremental EBITDA contribution, highlighting Broadcom's operational discipline. Non-AI semiconductor businesses showed signs of recovery, while networking solutions including Tomahawk and Jericho continue to perform well. We remain confident in Broadcom's ability to capitalize on the growth in AI infrastructure, deliver operational synergies, and maintain leadership in networking technologies.</p> <p><strong>Amazon.com</strong><strong>, Inc.</strong> is the world's largest retailer and cloud services provider. Shares increased 17.7% in the fourth quarter, ending 2024 up 44.5%, after the company reported solid third quarter results, with $17.4 billion in operating profits, nearly $3 billion above consensus expectations; solid growth in Amazon's cloud business (Amazon Web Services or AWS), which grew 19% year-over-year; and continued positive commentary on AI, with Andy Jassy calling generative AI<sup>6</sup> a <em>\"once-in-a-lifetime type of opportunity,\"</em> sharing promising data on growth: <em>\"our AI business is a multibillion-dollar business. It's growing triple-digit percentages year-over-year, and it's growing 3x faster at its stage of evolution than AWS did itself. We thought AWS grew pretty fast.\"</em> While the company is investing large amounts in AI, it continues to improve profitability across its core North American retail, international retail, and even AWS, thanks to cost discipline and operational optimization. While we continue to monitor progress across all cloud hyperscalers, we believe AWS will ultimately be a winner in generative AI, given Amazon's scale and technical infrastructure advantages. Longer term, Amazon has substantially more room to grow in e-commerce, where it still has less than 15% of its total addressable market. Amazon also remains the clear leader in the vast and growing cloud infrastructure market, with large opportunities in application software, including enabling generative AI workloads.</p> <p>Shares of alternative asset manager <strong>Apollo Global Management, Inc.</strong> rose 32.6% in the fourth quarter, ending the year up 73.3%<sup>7</sup>. The company held a well-received Investor Day in October, in which management highlighted the work done to build Apollo into a successful credit manager and laid out bullish five-year targets of $1.5 trillion, $5 billion, and $5 billion for assets under management, fee-related earnings, and spread-related earnings, respectively, as well as a $15-plus EPS target. Apollo also participated in the broader rally of financial stocks spurred by the Republican November elections sweep, which has bolstered expectations for greater capital markets activity and reduced regulatory scrutiny. In addition, investors anticipate that a more business-friendly administration will not block growth initiatives from alternative managers, including plans to introduce private investments into a broader swathe of retirement assets. Finally, Apollo was added to the Index in the quarter. We remain shareholders given Apollo's strong long-term growth prospects driven by the growth of alternative investments and the company's strong competitive advantages thanks to scale, first-movers advantage, and proprietary origination capabilities.</p> <h2>Top Detractors from Performance</h2> <p><strong>Table IV - Top detractors from performance for the quarter ended December 31, 2024</strong></p> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <colgroup> <col> <col> <col> <col> <col> </colgroup> <thead><tr> <th> </th> <th>Quarter End Market Cap($ billions)</th> <td>Contribution to Return (%)</td> </tr></thead> <tr> <td>Monolithic Power Systems, Inc.</td> <td>28.9</td> <td>-0.58</td> </tr> <tr> <td>Thermo Fisher Scientific Inc.</td> <td>199.0</td> <td>-0.44</td> </tr> <tr> <td>Danaher Corporation</td> <td>165.8</td> <td>-0.43</td> </tr> <tr> <td>Booz Allen Hamilton Holding Corporation</td> <td>16.4</td> <td>-0.41</td> </tr> <tr> <td>UnitedHealth Group Incorporated</td> <td>465.5</td> <td>-0.32</td> </tr> </table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p><strong>Monolithic Power Systems, Inc.</strong> is a fabless high-performance analog and power semiconductor company serving diverse end markets across the semiconductor industry. Monolithic is a relatively small player that leverages its deep system-level and applications knowledge, strong design experience, and innovative process technologies to provide highly integrated, energy-efficient, cost-effective, and easy-to-use products. Shares fell 35.9% in the fourth quarter and finished the year down 5.6% on rumors Monolithic was being displaced as a power module supplier for NVIDIA's AI systems. While management always discussed multi-sourcing for NVIDIA's Blackwell, sell-side reports suggested Monolithic would be fully removed, which could also suggest issues with its products. After speaking with management, we believe the rumors are unlikely to materialize. As the demand environment improves, Monolithic should return to growing 10% to 15% above the industry average as it expands its addressable market and takes advantage of areas where competition fails to innovate, driving meaningful long-term upside in the stock.</p> <p><strong>Thermo Fisher Scientific Inc.</strong> is a life sciences company that offers instruments and consumables for research, tools for bioproduction, specialty diagnostics, and contract research and manufacturing services. Shares fell 15.8% in the fourth quarter and ended the year down 2.1%, on underwhelming quarterly results marked by cautious commentary around China, slow progress of biopharmaceutical projects, and equipment purchases. The election of Trump and his selection of Robert F. Kennedy, Jr. to head Health and Human Services also pressured shares as they introduced an element of uncertainty into health care regulation and life science funding. We retain conviction as Thermo Fisher is a dominant and a diversified supplier across multiple end markets, that together with its scale, make it more resilient to a variety of market conditions. Once the macro environment normalizes, we expect a durable organic growth profile in the high single-digit range along with double-digit EPS growth.</p> <p><strong>Danaher Corporation</strong> supplies instruments to the life sciences industry for lab research, genomics services, and bioproduction and diagnostics tools for clinical tests in large core labs, hospitals, pathology labs, and at the point of care. Shares declined 17.3% in the quarter and finished 2024 down 0.5% on cautious forward-looking quarterly commentary marked by weakness in China, biopharmaceutical projects, and equipment cycles. The election of Trump and his selection of Robert F. Kennedy, Jr. to head Health and Human Services also pressured shares as they introduced an element of uncertainty into health care regulation and life science funding. We retain conviction given Danaher's market leadership and broad portfolio within bioprocessing, which addresses a biologics market with double-digit growth that should benefit growth thanks to a wave of biosimilars entering the market. Danaher has a portfolio of high-quality assets, with targets of high single-digit core revenue growth and double-digit EPS growth that we believe should sustain for the long term.</p> <h2>Portfolio Structure</h2> <p>The portfolio is constructed on a bottom-up basis with the quality of ideas and conviction level (rather than benchmark composition and weights) determining the size of each individual investment. Sector weights tend to be an outcome of the stock selection process and are not meant to indicate a positive or a negative \"view.\"</p> <p>As of December 31, 2024, our top 10 positions represented 53.5% of the Fund's net assets, the top 20 were 79.5%, and we exited 2024 with 34 investments (this compares to 52.6%, 82.2% and 30 investments as of the end of 2023, respectively). As of year end, Financials and IT were our largest sectors, representing 62.0% of the Fund. Communication Services, Health Care, Consumer Discretionary, Industrials, Real Estate, and Consumer Staples represented another 37.6% of the Fund. Cash was the remaining 0.3%.</p> <p><strong>Table V. - Top 10 holdings as of December 31, 2024</strong></p> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <colgroup> <col> <col> <col> <col> <col> <col> <col> </colgroup> <thead><tr> <th> </th> <th>Quarter End Market Cap($ billions)</th> <th>Quarter End Investment Value($ millions)</th> <td>Percent of Net Assets (%)</td> </tr></thead> <tr> <td>Microsoft Corporation</td> <td>3,133.8</td> <td>37.1</td> <td>7.7</td> </tr> <tr> <td>Amazon.com, Inc.</td> <td>2,306.9</td> <td>35.5</td> <td>7.4</td> </tr> <tr> <td>Meta Platforms, Inc.</td> <td>1,478.6</td> <td>33.4</td> <td>6.9</td> </tr> <tr> <td>Broadcom Inc.</td> <td>1,086.7</td> <td>25.0</td> <td>5.2</td> </tr> <tr> <td>NVIDIA Corporation</td> <td>3,288.8</td> <td>24.3</td> <td>5.0</td> </tr> <tr> <td>Taiwan Semiconductor Manufacturing Company Limited</td> <td>1,024.3</td> <td>22.5</td> <td>4.7</td> </tr> <tr> <td>Alphabet Inc.</td> <td>2,324.0</td> <td>22.2</td> <td>4.6</td> </tr> <tr> <td>Visa Inc.</td> <td>637.5</td> <td>19.7</td> <td>4.1</td> </tr> <tr> <td>Apollo Global Management, Inc.</td> <td>93.5</td> <td>19.4</td> <td>4.0</td> </tr> <tr> <td>S&amp;P Global Inc.</td> <td>158.1</td> <td>19.3</td> <td>4.0</td> </tr> </table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <h2>Recent Activity</h2> <p>During the fourth quarter, we initiated a position in the senior living focused REIT, <strong>Welltower (<a href=\"https://seekingalpha.com/symbol/WELL\" title=\"Welltower Inc.\">WELL</a>)</strong>. We also increased six existing positions, including continuing to build two of our most recent additions to the portfolio - the government-focused services contractor, <strong>Booz Allen (<a href=\"https://seekingalpha.com/symbol/BAH\" title=\"Booz Allen Hamilton Holding Corporation\">BAH</a>)</strong>, and the aerospace and defense supplier, <strong>TransDigm (<a href=\"https://seekingalpha.com/symbol/TDG\" title=\"TransDigm Group Incorporated\">TDG</a>)</strong>. We also sold our stub position in Lineage during the quarter as we reallocated to ideas in which we had greater conviction.</p> <p><strong>Table VI - Top net purchases for the quarter ended December 31, 2024</strong></p> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <colgroup> <col> <col> <col> <col> <col> </colgroup> <thead><tr> <th> </th> <th>Quarter End Market Cap($ billions)</th> <td>Net Amount Purchased($ millions)</td> </tr></thead> <tr> <td>Booz Allen Hamilton Holding Corporation</td> <td>16.4</td> <td>3.7</td> </tr> <tr> <td>TransDigm Group Incorporated</td> <td>71.3</td> <td>2.7</td> </tr> <tr> <td>Welltower Inc.</td> <td>78.5</td> <td>2.5</td> </tr> <tr> <td>Visa Inc.</td> <td>637.5</td> <td>1.7</td> </tr> <tr> <td>Alphabet Inc.</td> <td>2,324.0</td> <td>1.0</td> </tr> </table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p>We initiated a new investment in <strong>Welltower Inc.</strong> in the most recent quarter. Welltower owns and operates senior housing and medical office buildings in the U.S. and internationally. Welltower owns over 2,100 properties with nearly 200,000 units and is focused on the most attractive, high end of the market, a segment in which they enjoy the benefits of geographic density, scale, and pricing power.</p> <p>We believe that senior housing fundamentals will continue to be robust with Welltower well positioned to capture both the cyclical and secular growth inflection over the coming years. The industry backdrop hasn't been this favorable in many years with accelerating demand while growth in supply is limited. Underlying demand is supported by a demographics boom with the 80+ year-old population growing at a 4% to 5% CAGR over the next five years versus annual growth below 2% coming out of the Great Financial Crisis. While growth is accelerating, supply is muted given construction starts are declining rapidly, current developer economics are no longer attractive, and there is a five-plus year timeline to entitle and build a new project.</p> <p>We believe that by returning to normalized occupancy rates, there is a path for senior housing cash flow to grow by over 50%. In addition, there is further structural upside opportunity to both operating margins and occupancy through enhanced asset management, employing proprietary data analytics and introducing initiatives such as amenity-based pricing. We recently met with the entire Welltower executive team in our offices and came away even more encouraged by the multi-dimensional growth opportunities ahead. Welltower has recruited top senior executives from the multi-family space to execute and deploy these initiatives that will drive operating margins and occupancy beyond industry standards.</p> <p>Lastly, the management team, led by Shankh Mitra (CEO), John Burkart (<a href=\"https://seekingalpha.com/symbol/COO\" title=\"The Cooper Companies, Inc.\">COO</a>), Tim McHugh (<a href=\"https://seekingalpha.com/symbol/CFO\" title=\"Victory Portfolios II - VictoryShares US 500 Enhanced Volatility Wtd ETF\">CFO</a>), and Nikhil Chaudhri (CIO) are astute allocators of capital focused on driving shareholder value. Shankh's annual letters to shareholders might sound familiar to the Fund's shareholders - from defining risk as <em>\"permanent capital loss; not volatility\"</em> to reducing risk by <em>\"seeking a large margin of safety… acquiring assets for less than what it costs to build\"</em> and with the company's north star being the <em>\"long-term compounding of per share cash flow.\"</em> If you enjoy reading our letters, you will enjoy these even more - https://welltower.com/investors/.</p> <p>The current capital constrained financing environment for senior housing with loans either coming due or interest rate caps coming off assets acquired during a period of low interest rates should provide an active and growing external growth pipeline where management will be able to invest at an attractive \"cost basis\" below replacement cost. Putting this all together, we see a path for earnings to more than double over the next five years, leading to attractive return prospects for shareholders.</p> <p>During the quarter, our largest additions were to two of our recent purchases - <strong>TransDigm Group Incorporated</strong> and <strong>Booz Allen Hamilton Holding Corporation</strong>. While commercial aftermarket growth has slowed relative to the elevated levels seen in 2022-2023, OEMs still struggle to ramp up production, and travel demand remains strong, providing durable tailwinds for TransDigm. With 90% of its portfolio classified as proprietary, the company has significant pricing power, enabling mid-single-digit growth even with inflation coming down. Additionally, the company just had one of its most active years of M&amp;A in a while and sees more opportunities ahead with the new administration's more pro-M&amp;A-stance. Booz Allen is seeing extraordinary demand from different federal agencies with its technology focused solutions. It has become the largest provider of AI and sophisticated cyber services and is at the forefront of the government's broad-based technology modernization efforts. The incoming administration's DOGE initiative is being perceived as a risk, and it has hurt both companies' share prices post the election results. While we continue to assess the range of possible outcomes, we believe the risk is both overstated and manageable. Approximately 6% of TransDigm's sales are direct to the DoD with less than 1% not under formal contracts. The company's parts are mission-critical, low cost, and purchased in low volumes. Even in scenarios in which replacement parts were to be considered, since TransDigm's parts are largely sole-sourced, it would take a while to develop, test, and certify a whole new set of solutions. More importantly, it is unlikely to yield meaningful savings and would be extremely time-consuming and risky. Booz Allen has a key set of strategic capabilities as an enabler of efficiency and technological progress with especially strong capabilities in cyber and AI.</p> <p><strong>Table VII - Top net sales for the quarter ended December 31, 2024</strong></p> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <colgroup> <col> <col> <col> <col> <col> </colgroup> <thead><tr> <th> </th> <th>Quarter End Market Cap or Market Cap When Sold($ billions)</th> <td>Net Amount Sold($ millions)</td> </tr></thead> <tr> <td>Lineage, Inc. (<a href=\"https://seekingalpha.com/symbol/LINE\" title=\"Lineage, Inc.\">LINE</a>)</td> <td>15.5</td> <td>2.1</td> </tr> <tr> <td>Agilent Technologies, Inc. (<a href=\"https://seekingalpha.com/symbol/A\" title=\"Agilent Technologies, Inc.\">A</a>)</td> <td>38.4</td> <td>0.1</td> </tr> </table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <h2>Outlook</h2> <blockquote><p><em>\"Time is the friend of the wonderful business, the enemy of the mediocre.\"</em> - Warren Buffett's letter to shareholders, 1989</p></blockquote> <p>We continue to operate in an environment where an overwhelming majority of investors are hyper-focused on the minute-by-minute news cycle. What is the incremental change? The reality is that this incremental change is very rarely of any consequence or materiality, yet stock prices react to the change and pick up momentum in both directions. We work hard on trying to cut through the noise and focus on seeing the forest for the trees.</p> <p>The range of outcomes continues to be fairly wide, creating a challenging environment for investors. We stick to focusing on well-managed, high-quality businesses with sustainable competitive advantages for the long term. We continue to speak with company management teams as often as we can, test our investment thesis, look for disconfirming evidence, and measure how well our businesses are performing <em>fundamentally</em>.</p> <p>Over the long term, stock prices will reflect the intrinsic value of businesses. Of course, in any given year, stocks can trade ahead or behind because businesses' intrinsic values are not readily available to investors. Instead, they must be estimated by making assumptions and projections about growth rates, profitability, direction and level of interest rates, opportunity costs, and so on. These projections are often volatile and can swing violently in both directions depending on a multitude of factors including investors' psychology, time horizon, and risk appetite.</p> <p>To get a glimpse into the direction of intrinsic values and investor perception, we deconstructed the Fund's returns into two components - the change in multiples and change in the fundamentals. During the quarter, the Fund's weighted average multiple<sup>8</sup> declined by 0.7%, and finished 2024 up 6.4%. Since the Fund was up 3.1% in the quarter and 27.1% during 2024, <strong>the fundamentals of our holdings grew by approximately 4% in the quarter and by approximately 21% during 2024</strong> - implying that 77% of our performance in 2024 was driven by growth in fundamentals while 23% was driven by the change in multiples. The fundamentals of our businesses continue to improve after the slowdown in 2022 with consensus revenue expectations for 2025 rising by 1.1% during the quarter and 7.6% during 2024<sup>9</sup>, operating income estimates increasing by 1.7% and 10.6% respectively, and operating margin expectations increasing by 28bps in the quarter and 59bps in 2024. Business trends are improving across most sectors and geographies. A longer-term perspective on the weighted average multiple of the Fund shows that the weighted average multiple today is in line (0.1% lower) with the weighted average multiple of our holdings over the last five years.</p> <p>Every day, we live and invest in an uncertain world. Well-known conditions and widely anticipated events, such as Fed rate changes, ongoing trade disputes, government shutdowns, and the unpredictable behavior of important politicians the world over, are shrugged off by the financial markets one day and seem to drive them up or down the next. We often find it difficult to know why market participants do what they do over the short term. The constant challenges we face are real and serious, with clearly uncertain outcomes. History would suggest that most will prove passing or manageable. The business of capital allocation (or investing) is the business of taking risk, managing the uncertainty, and taking advantage of the long-term opportunities that those risks and uncertainties create. We are confident that our process is the right one, and we believe that it will enable us to make good investment decisions over time.</p> <p>Our goal is to invest in large-cap companies with, in our view, strong and durable competitive advantages, proven track records of successful capital allocation, high returns on invested capital, and high free-cash-flow generation, a significant portion of which is regularly returned to shareholders in the form of dividends or share repurchases. It is our belief that investing in great businesses at attractive valuations will enable us to earn excess risk-adjusted returns for our shareholders over the long term. We are optimistic about the prospects of the companies in which we are invested and continue to search for new ideas and investment opportunities.</p> <p><strong>Sincerely,</strong></p> <p><strong>Alex Umansky, Portfolio Manager</strong></p> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table><tr><td> <p><strong><strong>Footnotes</strong></strong></p> <p>(1)The <strong>S&amp;P 500 Index</strong> measures the performance of 500 widely held large cap U.S. companies. The Fund includes reinvestment of dividends, net of withholding taxes, while the S&amp;P 500 Index includes reinvestment of dividends before taxes. Reinvestment of dividends positively impacts the performance results. The index is unmanaged. Index performance is not Fund performance. Investors cannot invest directly in an index</p> <p>(2)The performance data in the table does not reflect the deduction of taxes that a shareholder would pay on Fund distributions or redemption of Fund shares.</p> <p>(3)Not annualized.</p> <p><sup>4</sup>Based on FactSet consensus expectations for the group as of 12/31/2024.</p> <p><sup>5</sup>Since we first purchased shares in March 2024.</p> <p><sup>6</sup>Amazon's third quarter 2024 earnings conference call.</p> <p><sup>7</sup>Since we acquired the shares in January 2024.</p> <p><sup>8</sup>We calculate the change in P/E multiple (based on FactSet consensus expectations for EPS for the next 12 months) for each holding except for Apollo and Blackstone for whom we use the more appropriate P/FRE (price to fee related earnings) multiple and Welltower, for whom we use the more appropriate multiple for REITs, P/FFO (price to funds from operations). We exclude Brookfield from the calculation since we value the firm on a sum of the parts basis. We then use the ending weights of each position in the Fund to calculate the weighted average change in the Fund's multiple.</p> <p><sup>9</sup>We calculate the change in FactSet consensus expectations for 2025 estimated revenues, operating income and operating margins for our holdings and calculated the weighted average using end of the year weights. We use FRE for Apollo and Blackstone instead of operating income.</p> <p><em>Investors should consider the investment objectives, risks, and charges and expenses of the investment carefully before investing. The prospectus and summary prospectus contain this and other information about the Funds. You may obtain them from the Funds' distributor, Baron Capital, Inc., by calling 1-800-99-BARON or visiting BaronCapitalGroup.com. Please read them carefully before investing.</em></p> <p><strong>Risks:</strong> The Fund invests primarily in equity securities, which are subject to price fluctuations in the stock market. In addition, because the Fund invests primarily in large-cap company securities, it may underperform other funds during periods when the Fund's securities are out of favor.</p> <p>The Fund may not achieve its objectives. Portfolio holdings are subject to change. Current and future portfolio holdings are subject to risk.</p> <p>The discussions of the companies herein are not intended as advice to any person regarding the advisability of investing in any particular security. The views expressed in this report reflect those of the respective portfolio managers only through the end of the period stated in this report. The portfolio manager's views are not intended as recommendations or investment advice to any person reading this report and are subject to change at any time based on market and other conditions and Baron has no obligation to update them.</p> <p>This report does not constitute an offer to sell or a solicitation of any offer to buy securities of Baron Fifth Avenue Growth Fund by anyone in any jurisdiction where it would be unlawful under the laws of that jurisdiction to make such offer or solicitation.</p> <p><strong>Morningstar calculates the Morningstar Large Growth Category Average performance using its Fractional Weighting methodology. Total returns do account for management, administrative, and 12b-1 fees and other costs automatically deducted from fund assets.</strong></p> <p><strong>©2025 Morningstar</strong>. All Rights Reserved. The information contained herein: (1) is proprietary to Morningstar and/or its affiliates or content providers; (2) may not be copied, adapted or distributed; (3) is not warranted to be accurate, complete or timely; and (4) does not constitute advice of any kind, whether investment, tax, legal or otherwise. User is solely responsible for ensuring that any use of this information complies with all laws, regulations and restrictions applicable to it. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Past performance is no guarantee of future results.</p> <p><strong>MORNINGSTAR IS NOT RESPONSIBLE FOR ANY DELETION, DAMAGE, LOSS OR FAILURE TO STORE ANY PRODUCT OUTPUT, COMPANY CONTENT OR OTHER CONTENT.</strong></p> <p><strong>Alpha</strong> measures the difference between a fund's actual returns and its expected performance, given its level of risk as measured by beta. <strong>Price/ Earnings Ratio or P/E (next 12-months):</strong> is a valuation ratio of a company's current share price compared to its mean forecasted 4 quarter sum earnings per share over the next twelve months. If a company's EPS estimate is negative, it is excluded from the portfolio-level calculation. <strong>Free cash flow</strong> represents the cash that a company generates after accounting for cash outflows to support operations and maintain its capital assets. <strong>EPS Growth Rate (3-5-year forecast)</strong> indicates the long term forecasted EPS growth of the companies in the portfolio, calculated using the weighted average of the available 3-to-5 year forecasted growth rates for each of the stocks in the portfolio provided by FactSet Estimates. The EPS Growth rate does not forecast the Fund's performance.</p> <p>BAMCO, Inc. is an investment adviser registered with the U.S. Securities and Exchange Commission (SEC). Baron Capital, Inc. is a broker-dealer registered with the SEC and member of the Financial Industry Regulatory Authority, Inc. (FINRA).</p> </td></tr></table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <div class=\"before_last_paragraph-piano-placeholder\"></div><p><strong><a href=\"https://www.baroncapitalgroup.com/article/quarterly-letter-baron-durable-advantage-fund-q4-2024#section-recent-activity\" rel=\"nofollow\">Original Post</a></strong></p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg",
            "link": "https://seekingalpha.com/article/4754689-baron-durable-advantage-fund-q4-2024-shareholder-letter",
            "pub_date": "2025-02-04 19:20:00",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754651",
            "title": "January AAII Asset Allocation Survey: Cash Allocations Increase",
            "description": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1902911442/image_1902911442.jpg?io=getty-c-w750\" alt=\"Pie chart shaped conference table\" data-id=\"1902911442\" data-type=\"getty-image\" width=\"1536px\" height=\"987px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1902911442/image_1902911442.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1902911442/image_1902911442.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1902911442/image_1902911442.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1902911442/image_1902911442.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1902911442/image_1902911442.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1902911442/image_1902911442.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1902911442/image_1902911442.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1902911442/image_1902911442.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">J Studios</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Individual investors’ allocations to cash increased while stock and bond allocations decreased in the January Asset Allocation Survey.</p> <p>Stock and stock fund allocations decreased 0.7 percentage points to 69.1%. Stock and stock fund allocations are above their historical</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1902911442/image_1902911442.jpg",
            "link": "https://seekingalpha.com/article/4754651-january-aaii-asset-allocation-survey-cash-allocations-increase",
            "pub_date": "2025-02-04 19:12:34",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754648",
            "title": "Triumph Group Acquired: Fair Price And Up 80% Since Buy Rating",
            "description": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1660938444/image_1660938444.jpg?io=getty-c-w750\" alt=\"Virgin B737 Spring Sunset\" data-id=\"1660938444\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1660938444/image_1660938444.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1660938444/image_1660938444.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1660938444/image_1660938444.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1660938444/image_1660938444.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1660938444/image_1660938444.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1660938444/image_1660938444.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1660938444/image_1660938444.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1660938444/image_1660938444.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">SCM Jeans/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Triumph Group has <a href=\"https://seekingalpha.com/news/4401808-triumph-to-go-private-in-3b-deal-with-warburg-pincus-and-berkshire-partners-stock-soars\">agreed to go private in a $3 billion deal</a> with Warburg Pincus and Berkshire Partners. In November 2024, I <a href=\"https://seekingalpha.com/article/4737345-triumph-group-stock-only-has-appeal-as-aerospace-acquisition-target\">covered Triumph Group, Inc.</a> (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TGI\" title=\"Triumph Group, Inc.\">TGI</a></span>) and attached a</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1660938444/image_1660938444.jpg",
            "link": "https://seekingalpha.com/article/4754648-triumph-group-acquired-fair-price",
            "pub_date": "2025-02-04 19:10:18",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754676",
            "title": "Monthly Newsletter - January 2025",
            "description": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w750\" alt=\"Currency and Exchange Stock Chart for Finance and Economy Display\" data-id=\"1358927461\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"></p> <p class=\"item-credits\">cemagraphics</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2><strong>Include Us Out</strong></h2> <p>When Donald Trump got elected for the second time last November, the financial markets saw an immediate rise in the most dubious and sometimes outright crooked investments. Securities that are traded on the public markets, but which are</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg",
            "link": "https://seekingalpha.com/article/4754676-monthly-newsletter-january-2025",
            "pub_date": "2025-02-04 18:55:00",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754675",
            "title": "TransDigm Group Incorporated 2025 Q1 - Results - Earnings Call Presentation",
            "description": "<p>The following slide deck was published by TransDigm Group Incorporated in conjunction with their 2025 Q1 earnings call.</p> <p></p>",
            "image": null,
            "link": "https://seekingalpha.com/article/4754675-transdigm-group-incorporated-2025-q1-results-earnings-call-presentation",
            "pub_date": "2025-02-04 18:49:20",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754663",
            "title": "Oakmark Global All Cap Strategy Q4 2024 Commentary",
            "description": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w750\" alt=\"Money makes the world go round\" data-id=\"1399575283\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">gopixa</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div></p> <h2>MARKET ENVIRONMENT</h2> <p>Global equities finished lower during the quarter with 7 of 11 GICS sectors posting negative returns. By sector, health care and materials detracted the most from market returns while information technology and consumer discretionary were the top contributors. By country, Switzerland and France detracted most from market performance while the U.S. drove nearly all positive momentum.</p> <p><figure class=\"regular-img-figure\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2025/2/4/58280443-17386801308781261.png\" alt=\"Performance highlights\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\"> </p></figcaption></figure></p> <h2>PORTFOLIO PERFORMANCE</h2> <p>The portfolio’s return was -5.34% (net) for the reporting period. This compares to the MSCI World Index that returned -0.16% for the same period.</p> <h3>Top contributors:</h3> <ul> <li>Capital One Financial (<a href=\"https://seekingalpha.com/symbol/COF\" title=\"Capital One Financial Corporation\">COF</a>) was a contributor during the quarter. The U.S.-headquartered consumer finance company’s stock price rose after posting good third-quarter results. In our view, the update seemed to be marginally positive on all fronts, with loans and card purchase volumes growing modestly. In addition, an improved credit outlook caused management to release USD 134 million of loss reserves in the quarter, which contributed to earnings per share that exceeded consensus expectations. Furthermore, Capital One’s stock price got a significant boost in November following the U.S. presidential election as investors are optimistic that the financials sector will benefit from looser regulations. Specific to Capital One, the market now appears to believe that there is a greater probability of the merger with Discover closing and that the credit card late fee cap proposed by the Consumer Financial Protection Bureau seems less likely to be implemented. We appreciate management’s focus on creating long-term value and think the stock offers an attractive upside.</li> <li>General Motors (<a href=\"https://seekingalpha.com/symbol/GM\" title=\"General Motors Company\">GM</a>) was a contributor during the quarter. The U.S.-headquartered automobile manufacturer’s stock price rose aided by solid third-quarter results and increased full-year guidance for adjusted earnings before interest and tax (EBIT), earnings per share and free cash flow. The company repurchased USD 1 billion in stock during the quarter and suggested the pace of repurchase will increase near term. General Motors also issued better than expected initial 2025 guidance that calls for adjusted EBIT to come in a similar range to 2024. We believe the company is well-positioned to compete in an evolving auto industry, is significantly undervalued, and that per share value is being enhanced as the company continues to repurchase shares at a significant discount to our estimate of intrinsic value.</li> <li>Alphabet Cl A (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>)(<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>) was a contributor during the quarter. Despite ongoing litigation with the Department of Justice in its antitrust case, the U.S.-headquartered interactive media and services company’s stock price rose after posting solid third-quarter earnings. In the Search division, the company generated low-teens year-over-year revenue growth and management highlighted that they’re seeing strong user engagement with their new AI Overviews feature. The biggest upside surprise came from the Cloud division, where revenue growth accelerated to 35% and margins reached a record of 17%. This performance was driven by client demand for AI Infrastructure and Generative AI Solutions as well as core Google Cloud Platform (GCP) products. We continue to believe Alphabet is a collection of great businesses that can unlock further value over the long term through its world-class AI capabilities.</li> </ul> <h3>Top detractors:</h3> <ul> <li>Bayer (<a href=\"https://seekingalpha.com/symbol/BAYZF\" title=\"Bayer Aktiengesellschaft\">OTCPK:BAYZF</a>)(<a href=\"https://seekingalpha.com/symbol/BAYRY\" title=\"Bayer Aktiengesellschaft\">OTCPK:BAYRY</a>) was a detractor during the quarter. The Germany-headquartered agriculture and pharma company’s stock price declined following developments in polychlorinated biphenyl (PCB) litigation and soft preliminary 2025 guidance. In October, the Washington Supreme Court granted review for the plaintiff’s appeal of Bayer’s first win at appellate court in PCB. Bayer’s appellate win, if enforced, will result in existing cases being retried on different grounds, but the Washington Supreme Court review raises the risk that the win is overturned. We viewed the appellate win as helpful but not a skeleton key to litigation resolution, so the Washington Supreme Court development is only marginal to value. In November, Bayer issued preliminary 2025 guidance indicating that profits would likely decline. The seemingly implied decline in agriculture business profitability was particularly disappointing versus consensus. This was partially driven by temporary regulatory issues that we expect to resolve in the mid-term, and the balance was driven by challenges in the crop protection portfolio. Bayer is now kicking off a deep restructuring of crop protection that we expect to help offset pressures and drive recovery. Overall, despite current headwinds, we believe that new CEO Bill Anderson’s restructuring and organizational change initiatives will unlock improved performance at Bayer and better capitalize on the potential of its well-positioned franchises. We are watching closely for evidence of success as Bill’s strategy enters its second year.</li> <li>Centene (<a href=\"https://seekingalpha.com/symbol/CNC\" title=\"Centene Corporation\">CNC</a>) was a detractor during the quarter. The U.S.-headquartered managed health care company’s stock price declined despite releasing third-quarter results that showed resilient fundamentals in the face of short-term industry pressure. Centene also issued above consensus guidance for 2025 earnings per share (EPS) at its December investor day. We believe the largest driver of the stock price decline in the quarter was investor concern around how legislative changes following the recent U.S. presidential election could impact the company. In our view, this unease is overly discounted into the share price. We see Centene as having significant embedded earnings power that can drive continued EPS growth even with a less accommodative political backdrop. Shares trade at less than 8.5x 2025 EPS guidance, which we think is a compelling valuation for a business that generates healthy returns on capital and operates in a secularly growing industry.</li> <li>Capgemini (<a href=\"https://seekingalpha.com/symbol/CAPMF\" title=\"Capgemini SE\">OTCPK:CAPMF</a>)(<a href=\"https://seekingalpha.com/symbol/CGEMY\" title=\"Capgemini SE\">OTCPK:CGEMY</a>) was a detractor during the quarter. The France-headquartered IT services and consulting company’s stock price declined after reporting a 2% organic revenue decline in the third quarter and reducing its expectation for a fourth quarter rebound in growth. Capgemini’s growth is currently lagging IT services peers due to higher exposure to European manufacturing sector clients that have cut spending in the face of macro and political uncertainty. We believe demand for IT services will cyclically rebound and that the industry is a structurally GDP-positive + growth market where leading players, like Capgemini, enjoy attractive economics and scale-driven competitive advantages. We think the company remains an attractive holding given its low valuation, mid-term growth prospects and attractive economic model characteristics of highly recurring revenues, asset-light balance sheet and strong cash conversion.</li> </ul> <h2>PORTFOLIO POSITIONING</h2> <p>We initiated the following position(s) during the period:</p> <ul> <li>Beacon Roofing Supply (<a href=\"https://seekingalpha.com/symbol/BECN\" title=\"Beacon Roofing Supply, Inc.\">BECN</a>) is one of the largest distributors of roofing materials and complimentary building products in the U.S. and Canada. Distributors serve an important role connecting manufacturers with a highly fragmented contractor base, and the largest distributors benefit from scale advantages, such as more favorable procurement terms and better operational efficiency. Over the past decade, Beacon has quadrupled its scale through transformative acquisitions and organic growth, transitioned to a differentiated networked branch model, introduced private label offerings, and enhanced its e-commerce capabilities. These changes have driven structural improvements in operating margins and returns on capital that we believe are not yet fully appreciated by investors. We also believe investors are overly concerned about short-term weather-related volatility inherent to the roofing business and overlook the fact that Beacon’s long-term fundamental performance is as strong as that of leading distributors in other less volatile building products end markets. As such, we were happy to recently purchase shares at ~9.5x this year’s EBITDA – a steep discount to the 16x EBITDA that competitor SRS Distribution was acquired for earlier this year and where other building products distributors trade.</li> <li>Becton, Dickinson and Company (<a href=\"https://seekingalpha.com/symbol/BDX\" title=\"Becton, Dickinson and Company\">BDX</a>) is a global medical technology company that markets a broad range of devices, laboratory equipment and diagnostic products. BD has achieved leading share positions in nearly all of its product categories by combining continuous innovation with manufacturing scale. Covid-19, inflation and other transient factors have weighed on results and camouflaged underlying improvements to BD’s portfolio and operations. We think it has also provided the opportunity to invest in an above-average business at a below-average valuation.</li> <li>Brunswick (<a href=\"https://seekingalpha.com/symbol/BC\" title=\"Brunswick Corporation\">BC</a>) is the leading manufacturer of marine engines, boats, and related parts and accessories. The company is commonly viewed as a cyclical boat manufacturer. The business has evolved in recent years, however, and now most of its profits come from its outboard engine business as well as its aftermarket parts and accessories segments. These are high-quality businesses in which Brunswick has material competitive advantages and they generate high returns on invested capital. The Mercury outboard business is the crown jewel. Over the past decade, Mercury has taken advantage of its leading scale to fund large investments in R&amp;D and product development. These investments have driven consistent market share gains and enabled Mercury to carve out a dominant position in the fast-growing, high-horsepower part of the outboard market. Meanwhile, Brunswick has grown its parts and accessories business through attractive acquisitions that benefit from its broad-based distribution. The combination has shifted the business mix toward more resilient and faster growing profit streams that we believe are underappreciated today. Softening retail demand and an erroneous perception that Brunswick is a stale business have provided us with an opportunity to buy this high-quality franchise at an attractive point in the business cycle.</li> <li>DSV is a transportation and logistics company that offers supply chain solutions to customers across the globe. DSV is an exceptionally well managed freight forwarder with a team that has continuously delivered industry-leading profit margins. The company recently acquired Schenker, the fourth-largest freight forwarder in the world, which we think will further expand DSV's capabilities and offer attractive synergies. DSV has created and grown shareholder value over the past decade by successfully acquiring and integrating companies in this fragmented market, which we expect to continue while maintaining its strategy of increasing volumes, while maintaining best-in-class profitability.</li> <li>Elevance Health (<a href=\"https://seekingalpha.com/symbol/ELV\" title=\"Elevance Health, Inc.\">ELV</a>) is one of the nation’s largest managed care organizations. We believe managed care is an attractive industry, as health expenditures have historically outpaced GDP, and the short business cycle allows companies to quickly correct underwriting mistakes. More recently, managed care stocks have underperformed the market as the industry is facing headwinds due to mismatches between reimbursement rates and medical costs. We believe this will prove transitory and that changes to pricing and/or plan designs will help realign profit trends over time. While we acknowledge that a return to “normal” profitability will take a few years, we believe the stock is trading at a depressed multiple of depressed earnings and for a significant discount to both the broader market and the companies’ own trading history. With its unmatched scale, diversification across end markets, and track record of disciplined underwriting and capital allocation, we believe that over time, the market will once again recognize Elevance as a high-quality franchise with above-average growth characteristics.</li> <li>Sysco Corporation (<a href=\"https://seekingalpha.com/symbol/SYY\" title=\"Sysco Corporation\">SYY</a>) is one of the largest foodservice distribution companies globally. We appreciate that foodservice distribution is a stable industry that has historically grown slightly faster than food spending thanks to a continued secular shift to food away from home, and that scale advantaged companies, like Sysco, benefit from better procurement terms from suppliers and demonstrate high operational efficiency. Recently, growth in Sysco’s largest and most profitable customer segment, independent restaurants, has slowed, but Sysco is increasing headcount and changing compensation incentives in its salesforce, which we think will reinvigorate growth and prove beneficial for long-term shareholders. In our view, Sysco remains a high-quality company with a credible management team, so we were happy to purchase shares at a discount to peers and Sysco’s own historical trading multiple.</li> </ul> <p>We eliminated the following position(s) during the period:</p> <ul> <li>Agilent Technologies (<a href=\"https://seekingalpha.com/symbol/A\" title=\"Agilent Technologies, Inc.\">A</a>)</li> <li>Daimler Truck Holding (<a href=\"https://seekingalpha.com/symbol/DTRUY\" title=\"Daimler Truck Holding AG\">OTCPK:DTRUY</a>)(<a href=\"https://seekingalpha.com/symbol/DTGHF\" title=\"Daimler Truck Holding AG\">OTCPK:DTGHF</a>)</li> <li>Interpublic Group (<a href=\"https://seekingalpha.com/symbol/IPG\" title=\"The Interpublic Group of Companies, Inc.\">IPG</a>)</li> <li>Thor Industries (<a href=\"https://seekingalpha.com/symbol/THO\" title=\"THOR Industries, Inc.\">THO</a>)</li> </ul> <h2>OUTLOOK</h2> <p>As we look forward to 2025, we note that the spread between growth and value remains especially wide relative to history, both in US and international markets. Given this, we believe that it’s an unusually attractive time to be a value investor. This growth-led market environment has afforded us an excellent opportunity to build very well-diversified portfolios in companies trading at significantly lower than average valuations across a variety of industries. We remain optimistic about the positioning, strength and depth of opportunity set as we continue to find high-quality businesses trading at bargain prices.</p> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table><tr><td> <p><strong>Past performance is no guarantee of future results.</strong> The investment return and principal value of this portfolio and any particular holdings may fluctuate. Portfolio holdings are subject to change without notice.</p> <p>The specific securities identified and described in this report do not represent all the securities purchased, sold, or recommended to advisory clients. There is no assurance that any securities discussed herein will remain in an account’s portfolio at the time one receives this report or that securities sold have not been repurchased. It should not be assumed that any of the securities, transactions, or holdings discussed herein were or will prove to be profitable.</p> <p>The information, data, analyses, and opinions presented herein (including current investment themes, the portfolio managers’ research and investment process, and portfolio characteristics) are for informational purposes only and represent the investments and views of the portfolio managers and Harris Associates L.P. as of the date written and are subject to change without notice. This content is not a recommendation of or an offer to buy or sell a security and is not warranted to be correct, complete or accurate. Data is in terms of U.S. dollars unless otherwise indicated.</p> <p>Certain comments herein are based on current expectations and are considered “forward-looking statements”. These forward-looking statements reflect assumptions and analyses made by the portfolio managers and Harris Associates L.P. based on their experience and perception of historical trends, current conditions, expected future developments, and other factors they believe are relevant. Actual future results are subject to a number of investment and other risks and may prove to be different from expectations. Readers are cautioned not to place undue reliance on the forward-looking statements.</p> <p>The MSCI World Index (Net) is a free float-adjusted, market capitalization-weighted index that is designed to measure the global equity market performance of developed markets. The index covers approximately 85% of the free float-adjusted market capitalization in each country. This benchmark calculates reinvested dividends net of withholding taxes. This index is unmanaged and investors cannot invest directly in this index.</p> <p>©2025 Harris Associates L.P. All rights reserved.</p> </td></tr></table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p><a href=\"https://harrisassoc.com/wp-content/uploads/sites/2/documents/Global-All-Cap-Strategy-Commentary.pdf\" rel=\"nofollow noopener\"><strong>Original Post</strong></a></p> <div class=\"before_last_paragraph-piano-placeholder\"></div><p><strong>Editor's Note:</strong> The summary bullets for this article were chosen by Seeking Alpha editors.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg",
            "link": "https://seekingalpha.com/article/4754663-oakmark-global-all-cap-strategy-q4-2024-commentary",
            "pub_date": "2025-02-04 18:45:00",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754669",
            "title": "Publicis Groupe S.A. 2024 Q4 - Results - Earnings Call Presentation",
            "description": "<p>The following slide deck was published by Publicis Groupe S.A. in conjunction with their 2024 Q4 earnings call.</p> <p></p>",
            "image": null,
            "link": "https://seekingalpha.com/article/4754669-publicis-groupe-s-a-2024-q4-results-earnings-call-presentation",
            "pub_date": "2025-02-04 18:34:58",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754668",
            "title": "Oaktree Specialty Lending Corporation 2025 Q1 - Results - Earnings Call Presentation",
            "description": "<p>The following slide deck was published by Oaktree Specialty Lending Corporation in conjunction with their 2025 Q1 earnings call.</p> <p></p>",
            "image": null,
            "link": "https://seekingalpha.com/article/4754668-oaktree-specialty-lending-corporation-2025-q1-results-earnings-call-presentation",
            "pub_date": "2025-02-04 18:30:54",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754630",
            "title": "Intel: Almost Time To Buy",
            "description": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w750\" alt=\"Intel Headquarters\" data-id=\"1831946092\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">hapabapa</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Last week, we received <a href=\"https://seekingalpha.com/pr/19987044-intel-reports-fourth-quarter-and-full-year-2024-financial-results#hasComeFromMpArticle=false\">fourth quarter results</a> from Intel (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/INTC\" title=\"Intel Corporation\">INTC</a></span>). The chip company has seen its stock underperform quite a bit in recent years as the top line has shrunk, resulting in large losses and cash burn. While</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg",
            "link": "https://seekingalpha.com/article/4754630-intel-almost-time-to-buy",
            "pub_date": "2025-02-04 18:24:20",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}