{
    "data": [
        {
            "id": "4754676",
            "title": "Monthly Newsletter - January 2025",
            "description": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w750\" alt=\"Currency and Exchange Stock Chart for Finance and Economy Display\" data-id=\"1358927461\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"></p> <p class=\"item-credits\">cemagraphics</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2><strong>Include Us Out</strong></h2> <p>When Donald Trump got elected for the second time last November, the financial markets saw an immediate rise in the most dubious and sometimes outright crooked investments. Securities that are traded on the public markets, but which are</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg",
            "link": "https://seekingalpha.com/article/4754676-monthly-newsletter-january-2025",
            "pub_date": "2025-02-04 18:55:00",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754675",
            "title": "TransDigm Group Incorporated 2025 Q1 - Results - Earnings Call Presentation",
            "description": "<p>The following slide deck was published by TransDigm Group Incorporated in conjunction with their 2025 Q1 earnings call.</p> <p></p>",
            "image": null,
            "link": "https://seekingalpha.com/article/4754675-transdigm-group-incorporated-2025-q1-results-earnings-call-presentation",
            "pub_date": "2025-02-04 18:49:20",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754663",
            "title": "Oakmark Global All Cap Strategy Q4 2024 Commentary",
            "description": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w750\" alt=\"Money makes the world go round\" data-id=\"1399575283\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">gopixa</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div></p> <h2>MARKET ENVIRONMENT</h2> <p>Global equities finished lower during the quarter with 7 of 11 GICS sectors posting negative returns. By sector, health care and materials detracted the most from market returns while information technology and consumer discretionary were the top contributors. By country, Switzerland and France detracted most from market performance while the U.S. drove nearly all positive momentum.</p> <p><figure class=\"regular-img-figure\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2025/2/4/58280443-17386801308781261.png\" alt=\"Performance highlights\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\"> </p></figcaption></figure></p> <h2>PORTFOLIO PERFORMANCE</h2> <p>The portfolio’s return was -5.34% (net) for the reporting period. This compares to the MSCI World Index that returned -0.16% for the same period.</p> <h3>Top contributors:</h3> <ul> <li>Capital One Financial (<a href=\"https://seekingalpha.com/symbol/COF\" title=\"Capital One Financial Corporation\">COF</a>) was a contributor during the quarter. The U.S.-headquartered consumer finance company’s stock price rose after posting good third-quarter results. In our view, the update seemed to be marginally positive on all fronts, with loans and card purchase volumes growing modestly. In addition, an improved credit outlook caused management to release USD 134 million of loss reserves in the quarter, which contributed to earnings per share that exceeded consensus expectations. Furthermore, Capital One’s stock price got a significant boost in November following the U.S. presidential election as investors are optimistic that the financials sector will benefit from looser regulations. Specific to Capital One, the market now appears to believe that there is a greater probability of the merger with Discover closing and that the credit card late fee cap proposed by the Consumer Financial Protection Bureau seems less likely to be implemented. We appreciate management’s focus on creating long-term value and think the stock offers an attractive upside.</li> <li>General Motors (<a href=\"https://seekingalpha.com/symbol/GM\" title=\"General Motors Company\">GM</a>) was a contributor during the quarter. The U.S.-headquartered automobile manufacturer’s stock price rose aided by solid third-quarter results and increased full-year guidance for adjusted earnings before interest and tax (EBIT), earnings per share and free cash flow. The company repurchased USD 1 billion in stock during the quarter and suggested the pace of repurchase will increase near term. General Motors also issued better than expected initial 2025 guidance that calls for adjusted EBIT to come in a similar range to 2024. We believe the company is well-positioned to compete in an evolving auto industry, is significantly undervalued, and that per share value is being enhanced as the company continues to repurchase shares at a significant discount to our estimate of intrinsic value.</li> <li>Alphabet Cl A (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>)(<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>) was a contributor during the quarter. Despite ongoing litigation with the Department of Justice in its antitrust case, the U.S.-headquartered interactive media and services company’s stock price rose after posting solid third-quarter earnings. In the Search division, the company generated low-teens year-over-year revenue growth and management highlighted that they’re seeing strong user engagement with their new AI Overviews feature. The biggest upside surprise came from the Cloud division, where revenue growth accelerated to 35% and margins reached a record of 17%. This performance was driven by client demand for AI Infrastructure and Generative AI Solutions as well as core Google Cloud Platform (GCP) products. We continue to believe Alphabet is a collection of great businesses that can unlock further value over the long term through its world-class AI capabilities.</li> </ul> <h3>Top detractors:</h3> <ul> <li>Bayer (<a href=\"https://seekingalpha.com/symbol/BAYZF\" title=\"Bayer Aktiengesellschaft\">OTCPK:BAYZF</a>)(<a href=\"https://seekingalpha.com/symbol/BAYRY\" title=\"Bayer Aktiengesellschaft\">OTCPK:BAYRY</a>) was a detractor during the quarter. The Germany-headquartered agriculture and pharma company’s stock price declined following developments in polychlorinated biphenyl (PCB) litigation and soft preliminary 2025 guidance. In October, the Washington Supreme Court granted review for the plaintiff’s appeal of Bayer’s first win at appellate court in PCB. Bayer’s appellate win, if enforced, will result in existing cases being retried on different grounds, but the Washington Supreme Court review raises the risk that the win is overturned. We viewed the appellate win as helpful but not a skeleton key to litigation resolution, so the Washington Supreme Court development is only marginal to value. In November, Bayer issued preliminary 2025 guidance indicating that profits would likely decline. The seemingly implied decline in agriculture business profitability was particularly disappointing versus consensus. This was partially driven by temporary regulatory issues that we expect to resolve in the mid-term, and the balance was driven by challenges in the crop protection portfolio. Bayer is now kicking off a deep restructuring of crop protection that we expect to help offset pressures and drive recovery. Overall, despite current headwinds, we believe that new CEO Bill Anderson’s restructuring and organizational change initiatives will unlock improved performance at Bayer and better capitalize on the potential of its well-positioned franchises. We are watching closely for evidence of success as Bill’s strategy enters its second year.</li> <li>Centene (<a href=\"https://seekingalpha.com/symbol/CNC\" title=\"Centene Corporation\">CNC</a>) was a detractor during the quarter. The U.S.-headquartered managed health care company’s stock price declined despite releasing third-quarter results that showed resilient fundamentals in the face of short-term industry pressure. Centene also issued above consensus guidance for 2025 earnings per share (EPS) at its December investor day. We believe the largest driver of the stock price decline in the quarter was investor concern around how legislative changes following the recent U.S. presidential election could impact the company. In our view, this unease is overly discounted into the share price. We see Centene as having significant embedded earnings power that can drive continued EPS growth even with a less accommodative political backdrop. Shares trade at less than 8.5x 2025 EPS guidance, which we think is a compelling valuation for a business that generates healthy returns on capital and operates in a secularly growing industry.</li> <li>Capgemini (<a href=\"https://seekingalpha.com/symbol/CAPMF\" title=\"Capgemini SE\">OTCPK:CAPMF</a>)(<a href=\"https://seekingalpha.com/symbol/CGEMY\" title=\"Capgemini SE\">OTCPK:CGEMY</a>) was a detractor during the quarter. The France-headquartered IT services and consulting company’s stock price declined after reporting a 2% organic revenue decline in the third quarter and reducing its expectation for a fourth quarter rebound in growth. Capgemini’s growth is currently lagging IT services peers due to higher exposure to European manufacturing sector clients that have cut spending in the face of macro and political uncertainty. We believe demand for IT services will cyclically rebound and that the industry is a structurally GDP-positive + growth market where leading players, like Capgemini, enjoy attractive economics and scale-driven competitive advantages. We think the company remains an attractive holding given its low valuation, mid-term growth prospects and attractive economic model characteristics of highly recurring revenues, asset-light balance sheet and strong cash conversion.</li> </ul> <h2>PORTFOLIO POSITIONING</h2> <p>We initiated the following position(s) during the period:</p> <ul> <li>Beacon Roofing Supply (<a href=\"https://seekingalpha.com/symbol/BECN\" title=\"Beacon Roofing Supply, Inc.\">BECN</a>) is one of the largest distributors of roofing materials and complimentary building products in the U.S. and Canada. Distributors serve an important role connecting manufacturers with a highly fragmented contractor base, and the largest distributors benefit from scale advantages, such as more favorable procurement terms and better operational efficiency. Over the past decade, Beacon has quadrupled its scale through transformative acquisitions and organic growth, transitioned to a differentiated networked branch model, introduced private label offerings, and enhanced its e-commerce capabilities. These changes have driven structural improvements in operating margins and returns on capital that we believe are not yet fully appreciated by investors. We also believe investors are overly concerned about short-term weather-related volatility inherent to the roofing business and overlook the fact that Beacon’s long-term fundamental performance is as strong as that of leading distributors in other less volatile building products end markets. As such, we were happy to recently purchase shares at ~9.5x this year’s EBITDA – a steep discount to the 16x EBITDA that competitor SRS Distribution was acquired for earlier this year and where other building products distributors trade.</li> <li>Becton, Dickinson and Company (<a href=\"https://seekingalpha.com/symbol/BDX\" title=\"Becton, Dickinson and Company\">BDX</a>) is a global medical technology company that markets a broad range of devices, laboratory equipment and diagnostic products. BD has achieved leading share positions in nearly all of its product categories by combining continuous innovation with manufacturing scale. Covid-19, inflation and other transient factors have weighed on results and camouflaged underlying improvements to BD’s portfolio and operations. We think it has also provided the opportunity to invest in an above-average business at a below-average valuation.</li> <li>Brunswick (<a href=\"https://seekingalpha.com/symbol/BC\" title=\"Brunswick Corporation\">BC</a>) is the leading manufacturer of marine engines, boats, and related parts and accessories. The company is commonly viewed as a cyclical boat manufacturer. The business has evolved in recent years, however, and now most of its profits come from its outboard engine business as well as its aftermarket parts and accessories segments. These are high-quality businesses in which Brunswick has material competitive advantages and they generate high returns on invested capital. The Mercury outboard business is the crown jewel. Over the past decade, Mercury has taken advantage of its leading scale to fund large investments in R&amp;D and product development. These investments have driven consistent market share gains and enabled Mercury to carve out a dominant position in the fast-growing, high-horsepower part of the outboard market. Meanwhile, Brunswick has grown its parts and accessories business through attractive acquisitions that benefit from its broad-based distribution. The combination has shifted the business mix toward more resilient and faster growing profit streams that we believe are underappreciated today. Softening retail demand and an erroneous perception that Brunswick is a stale business have provided us with an opportunity to buy this high-quality franchise at an attractive point in the business cycle.</li> <li>DSV is a transportation and logistics company that offers supply chain solutions to customers across the globe. DSV is an exceptionally well managed freight forwarder with a team that has continuously delivered industry-leading profit margins. The company recently acquired Schenker, the fourth-largest freight forwarder in the world, which we think will further expand DSV's capabilities and offer attractive synergies. DSV has created and grown shareholder value over the past decade by successfully acquiring and integrating companies in this fragmented market, which we expect to continue while maintaining its strategy of increasing volumes, while maintaining best-in-class profitability.</li> <li>Elevance Health (<a href=\"https://seekingalpha.com/symbol/ELV\" title=\"Elevance Health, Inc.\">ELV</a>) is one of the nation’s largest managed care organizations. We believe managed care is an attractive industry, as health expenditures have historically outpaced GDP, and the short business cycle allows companies to quickly correct underwriting mistakes. More recently, managed care stocks have underperformed the market as the industry is facing headwinds due to mismatches between reimbursement rates and medical costs. We believe this will prove transitory and that changes to pricing and/or plan designs will help realign profit trends over time. While we acknowledge that a return to “normal” profitability will take a few years, we believe the stock is trading at a depressed multiple of depressed earnings and for a significant discount to both the broader market and the companies’ own trading history. With its unmatched scale, diversification across end markets, and track record of disciplined underwriting and capital allocation, we believe that over time, the market will once again recognize Elevance as a high-quality franchise with above-average growth characteristics.</li> <li>Sysco Corporation (<a href=\"https://seekingalpha.com/symbol/SYY\" title=\"Sysco Corporation\">SYY</a>) is one of the largest foodservice distribution companies globally. We appreciate that foodservice distribution is a stable industry that has historically grown slightly faster than food spending thanks to a continued secular shift to food away from home, and that scale advantaged companies, like Sysco, benefit from better procurement terms from suppliers and demonstrate high operational efficiency. Recently, growth in Sysco’s largest and most profitable customer segment, independent restaurants, has slowed, but Sysco is increasing headcount and changing compensation incentives in its salesforce, which we think will reinvigorate growth and prove beneficial for long-term shareholders. In our view, Sysco remains a high-quality company with a credible management team, so we were happy to purchase shares at a discount to peers and Sysco’s own historical trading multiple.</li> </ul> <p>We eliminated the following position(s) during the period:</p> <ul> <li>Agilent Technologies (<a href=\"https://seekingalpha.com/symbol/A\" title=\"Agilent Technologies, Inc.\">A</a>)</li> <li>Daimler Truck Holding (<a href=\"https://seekingalpha.com/symbol/DTRUY\" title=\"Daimler Truck Holding AG\">OTCPK:DTRUY</a>)(<a href=\"https://seekingalpha.com/symbol/DTGHF\" title=\"Daimler Truck Holding AG\">OTCPK:DTGHF</a>)</li> <li>Interpublic Group (<a href=\"https://seekingalpha.com/symbol/IPG\" title=\"The Interpublic Group of Companies, Inc.\">IPG</a>)</li> <li>Thor Industries (<a href=\"https://seekingalpha.com/symbol/THO\" title=\"THOR Industries, Inc.\">THO</a>)</li> </ul> <h2>OUTLOOK</h2> <p>As we look forward to 2025, we note that the spread between growth and value remains especially wide relative to history, both in US and international markets. Given this, we believe that it’s an unusually attractive time to be a value investor. This growth-led market environment has afforded us an excellent opportunity to build very well-diversified portfolios in companies trading at significantly lower than average valuations across a variety of industries. We remain optimistic about the positioning, strength and depth of opportunity set as we continue to find high-quality businesses trading at bargain prices.</p> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table><tr><td> <p><strong>Past performance is no guarantee of future results.</strong> The investment return and principal value of this portfolio and any particular holdings may fluctuate. Portfolio holdings are subject to change without notice.</p> <p>The specific securities identified and described in this report do not represent all the securities purchased, sold, or recommended to advisory clients. There is no assurance that any securities discussed herein will remain in an account’s portfolio at the time one receives this report or that securities sold have not been repurchased. It should not be assumed that any of the securities, transactions, or holdings discussed herein were or will prove to be profitable.</p> <p>The information, data, analyses, and opinions presented herein (including current investment themes, the portfolio managers’ research and investment process, and portfolio characteristics) are for informational purposes only and represent the investments and views of the portfolio managers and Harris Associates L.P. as of the date written and are subject to change without notice. This content is not a recommendation of or an offer to buy or sell a security and is not warranted to be correct, complete or accurate. Data is in terms of U.S. dollars unless otherwise indicated.</p> <p>Certain comments herein are based on current expectations and are considered “forward-looking statements”. These forward-looking statements reflect assumptions and analyses made by the portfolio managers and Harris Associates L.P. based on their experience and perception of historical trends, current conditions, expected future developments, and other factors they believe are relevant. Actual future results are subject to a number of investment and other risks and may prove to be different from expectations. Readers are cautioned not to place undue reliance on the forward-looking statements.</p> <p>The MSCI World Index (Net) is a free float-adjusted, market capitalization-weighted index that is designed to measure the global equity market performance of developed markets. The index covers approximately 85% of the free float-adjusted market capitalization in each country. This benchmark calculates reinvested dividends net of withholding taxes. This index is unmanaged and investors cannot invest directly in this index.</p> <p>©2025 Harris Associates L.P. All rights reserved.</p> </td></tr></table>\n<span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p><a href=\"https://harrisassoc.com/wp-content/uploads/sites/2/documents/Global-All-Cap-Strategy-Commentary.pdf\" rel=\"nofollow noopener\"><strong>Original Post</strong></a></p> <div class=\"before_last_paragraph-piano-placeholder\"></div><p><strong>Editor's Note:</strong> The summary bullets for this article were chosen by Seeking Alpha editors.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399575283/image_1399575283.jpg",
            "link": "https://seekingalpha.com/article/4754663-oakmark-global-all-cap-strategy-q4-2024-commentary",
            "pub_date": "2025-02-04 18:45:00",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754669",
            "title": "Publicis Groupe S.A. 2024 Q4 - Results - Earnings Call Presentation",
            "description": "<p>The following slide deck was published by Publicis Groupe S.A. in conjunction with their 2024 Q4 earnings call.</p> <p></p>",
            "image": null,
            "link": "https://seekingalpha.com/article/4754669-publicis-groupe-s-a-2024-q4-results-earnings-call-presentation",
            "pub_date": "2025-02-04 18:34:58",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754668",
            "title": "Oaktree Specialty Lending Corporation 2025 Q1 - Results - Earnings Call Presentation",
            "description": "<p>The following slide deck was published by Oaktree Specialty Lending Corporation in conjunction with their 2025 Q1 earnings call.</p> <p></p>",
            "image": null,
            "link": "https://seekingalpha.com/article/4754668-oaktree-specialty-lending-corporation-2025-q1-results-earnings-call-presentation",
            "pub_date": "2025-02-04 18:30:54",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754630",
            "title": "Intel: Almost Time To Buy",
            "description": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w750\" alt=\"Intel Headquarters\" data-id=\"1831946092\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">hapabapa</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Last week, we received <a href=\"https://seekingalpha.com/pr/19987044-intel-reports-fourth-quarter-and-full-year-2024-financial-results#hasComeFromMpArticle=false\">fourth quarter results</a> from Intel (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/INTC\" title=\"Intel Corporation\">INTC</a></span>). The chip company has seen its stock underperform quite a bit in recent years as the top line has shrunk, resulting in large losses and cash burn. While</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1831946092/image_1831946092.jpg",
            "link": "https://seekingalpha.com/article/4754630-intel-almost-time-to-buy",
            "pub_date": "2025-02-04 18:24:20",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754655",
            "title": "Pernas Research Q4 2024 Investment Letter",
            "description": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2181092158/image_2181092158.jpg?io=getty-c-w750\" alt=\"Financial market fluctuations, technology, bar graphs, up and down trends graphs. stock trading\" data-id=\"2181092158\" data-type=\"getty-image\" width=\"1536px\" height=\"922px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2181092158/image_2181092158.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2181092158/image_2181092158.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2181092158/image_2181092158.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2181092158/image_2181092158.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2181092158/image_2181092158.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2181092158/image_2181092158.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2181092158/image_2181092158.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2181092158/image_2181092158.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"></p> <p class=\"item-credits\">Donny DBM/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <thead><tr> <th></th> <th>QTD</th> <th>YTD</th> <th>*ITD</th> </tr></thead> <tbody> <tr> <td>Pernas Portfolio*</td> <td>22.7%</td> <td>45.6%</td> <td>28.7%</td> </tr> <tr> <td>S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" class=\"ticker-link\">SP500</a>,<a href=\"https://seekingalpha.com/symbol/SPX\" class=\"ticker-link\">SPX)</a> </td> <td>2.4%</td> <td>25.0%</td> <td>14.8%</td> </tr> <tr> <td>Russell 2000 (<a href=\"https://seekingalpha.com/symbol/RTY\" title=\"Russell 2000 Index\">RTY</a>)</td> <td>0.3%</td> <td>11.3%</td> <td>7.8%</td> </tr> <tr> <td>DJ Industrial Average (<a href=\"https://seekingalpha.com/symbol/DJI\" title=\"Dow Jones Industrial Average Index\">DJI</a>)</td> <td>1.0%</td> <td>14.8%</td> <td>12.3%</td> </tr> </tbody> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p></p> <hr> <p> </p> <h2>This Year in</h2>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2181092158/image_2181092158.jpg",
            "link": "https://seekingalpha.com/article/4754655-pernas-research-q4-2024-investment-letter",
            "pub_date": "2025-02-04 18:20:00",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754656",
            "title": "New Jersey Resources Corporation 2025 Q1 - Results - Earnings Call Presentation",
            "description": "<p>The following slide deck was published by New Jersey Resources Corporation in conjunction with their 2025 Q1 earnings call.</p> <p></p>",
            "image": null,
            "link": "https://seekingalpha.com/article/4754656-new-jersey-resources-corporation-2025-q1-results-earnings-call-presentation",
            "pub_date": "2025-02-04 18:15:15",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754647",
            "title": "NXP Semiconductors N.V. 2024 Q4 - Results - Earnings Call Presentation",
            "description": "<p>The following slide deck was published by NXP Semiconductors N.V. in conjunction with their 2024 Q4 earnings call.</p> <p></p>",
            "image": null,
            "link": "https://seekingalpha.com/article/4754647-nxp-semiconductors-n-v-2024-q4-results-earnings-call-presentation",
            "pub_date": "2025-02-04 18:09:23",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4754624",
            "title": "Tesla Will Need To Prove The Viability Of Its Robotaxi Program In June",
            "description": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://media.gettyimages.com/id/2102225692/photo/humanoid-manufacturing.jpg?b=1&amp;s=612x612&amp;w=0&amp;k=20&amp;c=MVISOLka9UwXdK7H74G9M5HFHSluXo5q7CPyouXlmgE=\" alt=\"Humanoid Manufacturing\" data-id=\"2102225692\" data-type=\"getty-image\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">J Studios/DigitalVision via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>2025 will be a pivotal year for <b>Tesla, Inc.</b> (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/TSLA\" title=\"Tesla, Inc.\">TSLA</a></span>). The firm is laying out the groundwork for what I believe to be the epitome of the AI revolution. With unsupervised Full Self-Driving (FSD) becoming</p>",
            "image": null,
            "link": "https://seekingalpha.com/article/4754624-tesla-will-need-to-prove-the-viability-of-its-robotaxi-program-in-june",
            "pub_date": "2025-02-04 18:05:42",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}