{
    "data": [
        {
            "id": "4876820",
            "title": "Workday: A Generational Contrarian Buy",
            "description": "<p class=\"p p1 editors-note-first-article\" data-eci=\"true\"><i><b>Editor's note:</b> Seeking Alpha is proud to welcome Wilson Ye as a new contributing analyst. You can become one too! Share your best investment idea by submitting your article for review to our editors. Get published, earn money, and unlock exclusive SA Premium access. <a rel=\"nofollow\" href=\"https://about.seekingalpha.com/become-a-contributor\" class=\"paywall-full-content\">Click here to find out more »</a></i></p> <p class=\"paywall-full-content\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1212869212/image_1212869212.jpg?io=getty-c-w630\" alt=\"Workday Headquarters Building Exterior\" data-id=\"1212869212\" data-type=\"getty-image\" width=\"4997\" height=\"3331\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1212869212/image_1212869212.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1212869212/image_1212869212.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1212869212/image_1212869212.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1212869212/image_1212869212.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1212869212/image_1212869212.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1212869212/image_1212869212.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1212869212/image_1212869212.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1212869212/image_1212869212.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">hapabapa/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">I have 7 years of \"boots-on-the-ground\" experience implementing Workday. I have taken panic calls during Christmas holidays due to an integration failure caused by accident. I sat in meetings where executives grilled me with \"What if it doesn't work\" questions. I have seen projects delayed as customers could not complete the testing process in time. I understand the gravity of building and maintaining a reliable enterprise system—a reality many market participants currently take for granted.</p> <p class=\"paywall-full-content\">Recently, Workday and other software leaders have been severely punished as the <a href=\"http://finance.yahoo.com/video/workday-q4-earnings-why-software-183310253.html\" rel=\"nofollow\">\"Software is being disrupted by AI\"</a> rhetoric took hold. In this hyper-emotional environment, the market seizes upon any flaw to punish the stock. However, I believe this sell-off is unwarranted. The market is underestimating the complexity, sophistication, and \"trust moat\" of the Workday ecosystem. I am assigning a \"buy\" rating to Workday, as the market is currently pricing in a structural decline that my professional experience strongly contradicts.</p> <h2 class=\"paywall-full-content\">Misunderstanding of the Enterprise SaaS Industry</h2> <p class=\"paywall-full-content\">If you ask any professional who works in the industry, you will certainly receive an answer that Enterprise Resource Planning (ERP) is an incredibly difficult business. It is not a college midterm where an 85% is an \"A\"; it is a statement of legal and financial liability that demands 100% accuracy and strict regulatory compliance. Workday is the System of Record—the ultimate \"truth\" of an organization.</p> <p class=\"paywall-full-content\"><a href=\"http://siliconangle.com/2026/02/24/workdays-stock-slumps-weak-guidance-ai-disruption-fears/\" rel=\"nofollow\">Critics claim</a> AI agents may soon code curated software systems to disrupt or replace traditional SaaS players, including Workday. This might work for a seven-employee car shop, but not for the mid-to-large enterprises Workday targets. These organizations are deeply risk-averse. A failed enterprise system is catastrophic; no executive will hand the responsibility of payroll and financial integrity to a \"smart but erratic\" AI agent. Using Workday provides a \"Peace of Mind\" insurance that an unverified AI cannot offer. As a result, I do not believe large clients would develop their own native agents to handle massive amounts of data, meeting tremendous reporting and regulatory requirements while accepting the risk of a system failure. This is equivalent to handing the fate of their careers to a casino.</p> <p class=\"paywall-full-content\">Think about it: even before AI, why didn’t clients build their own internal software? Because they don't just pay Workday for code; they pay for integrity, reputation, and indemnity. Even if I, as an experienced Workday professional, could build a technically functional ERP in weeks, I would never replace Workday because I lack decades of built-up trust and reliability. This \"soft power\" is a moat that AI agents cannot easily cross. That is why many reputable AI companies, including the <a href=\"http://www.bloomberg.com/news/articles/2026-02-24/workday-ceo-says-anthropic-and-openai-use-his-company-s-software\" rel=\"nofollow\">developers of Claude</a>, also use Workday to process their sensitive data, despite having the ability to build their own enterprise software.</p> <h2 class=\"paywall-full-content\">The Market is Pricing in for the Worst</h2> <h3 class=\"paywall-full-content\">Workday's Strength in AI</h3> <p class=\"paywall-full-content\">During the most recent earnings call, I noticed several key highlights:</p> <ul class=\"paywall-full-content\"> <li>In FY26, Workday executed more than 1.7 billion AI actions.</li> <li>In Q4, Workday \"generated over $100 million in new ACV from emerging AI products\", double from Q4 of last year.</li> <li>Over 400 customers have adopted Workday's role-based agents.</li> </ul> <p class=\"paywall-full-content\">I still remember the first time I implemented Workday AI features as a junior resource on a project several years ago. I led a mini project to use AI to scan red flags on expense reports. Now, Workday's AI capabilities have grown exponentially, and clients are excited about new features. My observations in the field support the claims from the management - that Workday's AI offerings are gaining momentum. As an incumbent sitting on an ocean of proprietary data, Workday is uniquely positioned to thrive.</p> <p class=\"paywall-full-content\">I am particularly excited about Workday Sana. According to the comment from its management:</p> <blockquote class=\"paywall-full-content\"><p>Sana Core brings conversational AI directly into Workday, so employees can get answers and complete tasks using Workday agents. Sana Enterprise extends the same experience beyond Workday by connecting enterprise tools, like Outlook and Google Drive and so many more, so employees can find information, create agents and automate workflows all in one place. That will create an entirely new way for our 75 million users to engage with Workday.</p></blockquote> <p class=\"paywall-full-content\">If I were a Workday customer, I would welcome a curated ERP system that promotes automation, streamlines business processes, and keeps the core infrastructure largely intact from large changes. In the world of ERP, \"lift and shift\" should be strictly avoided unless it is absolutely necessary. If I can conveniently enjoy all the reliable outcomes of AI while relying on a trusted infrastructure as my source of truth, why would I seek drastic replacements?</p> <p class=\"paywall-full-content\">As stated above, I firmly believe that incumbents with excellent vision and execution skills will survive and thrive in the era of AI; those without a clear vision will become obsolete. Not all SaaS companies will survive, but I believe that Workday is well positioned to take on this challenge.</p> <h3 class=\"paywall-full-content\">Market Irrationality</h3> <p class=\"paywall-full-content\">Having gone through ups and downs in the past, I believe that the market is so irrational that it assumes negative narratives about any incumbent software company. The presumption of guilt is what is behind the large catastrophe of software stocks, including Workday.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/53707181-17721554090133226_origin.png\" rel=\"lightbox\" data-width=\"2600\" data-height=\"900\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/53707181-17721554090133226_origin.png?io=w640\" alt=\"Workday's Price vs FCF Margin\" width=\"640\" height=\"222\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/53707181-17721554090133226_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/53707181-17721554090133226_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/53707181-17721554090133226_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/53707181-17721554090133226_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">Workday's Price vs FCF Margin <span>(Seeking Alpha)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">At ~$130 per share today, Workday is trading at:</p> <ul class=\"paywall-full-content\"> <li>13x Forward Non-GAAP P/E: A historical low for the company.</li> <li>0.5 non-GAAP PEG: It is rare to see a growing technology company with 95%+ retention rates trading at 0.5 PEG. Historically, such a low valuation does not persist unless fundamentals worsen significantly.</li> <li>~10x Forward EV/FCF: This valuation currently sits at a decade low.</li> <li>~97% retention rate, showing no signs of customer abandonment.</li> </ul> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <thead><tr> <td><strong>Company/Benchmark</strong></td> <td><strong>Forward Revenue Growth </strong></td> <td><strong>Non-GAAP Op. Margin </strong></td> <td><strong>FCF Margin (%)</strong></td> <td><strong>Forward P/E</strong></td> <td><strong>Forward P/S</strong></td> <td><strong>Forward EV/FCF</strong></td> </tr></thead> <tr> <td><span><strong>Workday (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/WDAY\" title=\"Workday, Inc.\">WDAY</a></span>)</strong></span></td> <td><span>13%</span></td> <td><span>30%</span></td> <td><span>29%</span></td> <td><span>15</span></td> <td><span>4</span></td> <td>13</td> </tr> <tr> <td><span><strong>Oracle (<a href=\"https://seekingalpha.com/symbol/ORCL\" title=\"Oracle Corporation\">ORCL</a>)</strong></span></td> <td><span>14%</span></td> <td><span>42%</span></td> <td><span>Abnormal</span></td> <td><span>21</span></td> <td><span>6</span></td> <td>Abnormal</td> </tr> <tr> <td><span><strong>Salesforce (<a href=\"https://seekingalpha.com/symbol/CRM\" title=\"Salesforce, Inc.\">CRM</a>)</strong></span></td> <td><span>10%</span></td> <td><span>36%</span></td> <td><span>35%</span></td> <td><span>15</span></td> <td><span>4</span></td> <td>16</td> </tr> <tr> <td><span><strong>ServiceNow (<a href=\"https://seekingalpha.com/symbol/NOW\" title=\"ServiceNow, Inc.\">NOW</a>)</strong></span></td> <td><span>22%</span></td> <td><span>29%</span></td> <td><span>26%</span></td> <td><span>92</span></td> <td><span>10</span></td> <td>34</td> </tr> <tr> <td><span><strong>Software Sector</strong></span></td> <td><span>11%</span></td> <td><span>30%</span></td> <td><span>27%</span></td> <td><span>28</span></td> <td><span>5</span></td> <td>32</td> </tr> <tr> <td><span><strong>S&amp;P 500 Avg</strong></span></td> <td><span>~8%</span></td> <td><span>~19%</span></td> <td><span>~15%</span></td> <td><span>~22%</span></td> <td><span>3</span></td> <td>16</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\">Peer valuation shows that Workday is trading at a significant discount to the sector average. Considering that Workday continues to demonstrate strong cash flow growth, moderated but still robust revenue growth, and a strong FCF margin, it warrants a premium to the S&amp;P 500. If Workday is able to solidify its status as the AI-era ERP leader over the next several quarters, Workday should command a higher valuation premium.</p> <p class=\"paywall-full-content\">Today, considering that most valuation multiples have contracted to historical lows, Workday is trading like a commodity stock with no growth prospects. There has been no material damage to any future earnings and cash flows of Workday, so its price action is largely attributable to the market sentiment. The market is correct to price in the risk of AI disruption, which warrants a contraction from historical norms, as new risks elevate the cost of debt and equity, resulting in a larger discount applied to its terminal value. However, the indiscriminate punishment across the sector has gone too far.</p> <h3 class=\"paywall-full-content\">SBC Concerns</h3> <p class=\"paywall-full-content\">While many argue that its massive stock-based-compensation (SBC) presents a problem (GAAP P/E stands at 40x), I believe that we should compare apples to apples. SBC is not a new problem. It has been a well-known fact since Workday's inception and has been factored into Workday's valuation throughout its history. It's not as if the market suddenly began to care about SBC this morning.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/26/53707181-1772095294294609_origin.png\" rel=\"lightbox\" data-width=\"1300\" data-height=\"450\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/26/53707181-1772095294294609_origin.png?io=w640\" alt=\"SBC impact in the past several years.\" width=\"640\" height=\"222\" contenteditable=\"false\" data-width=\"640\" data-height=\"222\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/26/53707181-1772095294294609_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/26/53707181-1772095294294609_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/26/53707181-1772095294294609_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/26/53707181-1772095294294609_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">SBC in the past several years has stabilized. <span>(Seeking Alpha)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Furthermore, the company has a buyback program that aggressively offsets its SBC. Last year, Workday repurchased 12.8 million shares, resulting in a net reduction of 1.5 million shares outstanding in the past year. Workday currently guides to 3.18 billion in free cash flow for FY27 - a 15% increase. I believe Workday will meet its guidance and provide new resources for further share buybacks. Should the stock remain suppressed, the company will be able to repurchase shares at a significant discount.</p> <p class=\"paywall-full-content\">The pessimistic sentiment presents a generational contrarian buy opportunity. Just under a year ago, MU was trading at $65 and NVDA was at $90 when the AI sentiment was low. The current skepticism around SaaS is repeating the same story, though it may take several months for the market to process the reality. Of course, there will be winners and losers, but my bullish stance comes from my professional experience in the ecosystem. I believe that many market participants have never navigated an enterprise system implementation and, as a result, deeply underestimate the stickiness and sophistication of Workday.</p> <h2 class=\"paywall-full-content\">Risks</h2> <p class=\"paywall-full-content\">Of course, Workday carries significant risks. The competitive landscape in the AI era has effectively produced a new S-curve, and Workday must prove it can execute its AI strategy to meet customer demands.</p> <h3 class=\"paywall-full-content\">Headcount Pressure</h3> <p class=\"paywall-full-content\">The market assumes that a significant percentage of the workforce will be reduced due to AI automation. Since Workday's revenue still relies primarily on a per-seat basis, labor market uncertainty may cause per-seat revenue to stagnate. Recently, Block (<a href=\"https://seekingalpha.com/symbol/XYZ\" title=\"Block, Inc.\">XYZ</a>) just announced a 40% reduction in headcount, citing AI tools as a catalyst; this triggered a new wave of panic in all software stocks.</p> <p class=\"paywall-full-content\">I am personally skeptical of this announcement, as many companies use \"<a href=\"http://fortune.com/2026/02/19/sam-altman-confirms-ai-washing-job-displacement-layoffs/\" rel=\"nofollow\">AI washing</a>\" to justify staff reductions, blaming layoffs on AI when they actually result from other business factors. However, in the long term, AI will eventually replace many jobs - especially entry-level roles. It is a part of an evolution that no one can avoid.</p> <p class=\"paywall-full-content\">While I believe the concern is valid, Workday is actively adopting a new pricing model that charges clients based on usage instead of headcount. While total headcount may stagnate, the volume of transactions will not. Transactions will continue at scale generated by AI agents rather than human employees. AI will still require a source of truth and a reliable infrastructure to operate; Workday provides that \"playground\" for human-AI collaboration. While revenue growth may slow during this transition, I expect usage-based-revenue to normalize growth in the long run.</p> <p class=\"paywall-full-content\">This is not the first time Workday has leveraged new products to revitalize its narrative. Workday Finance, Prism Analytics, Accounting Center, and Adaptive were all introduced to drive revenue as the traditional HCM and payroll markets matured. The ability to integrate new revenue streams in a dynamic environment is a critical skill that maximizes Workday's chance of success.</p> <h3 class=\"paywall-full-content\">AI Execution Risk</h3> <p class=\"paywall-full-content\">Ironically, while the market views Workday as vulnerable to AI disruption, the key risk could be the opposite - what if AI is overrated?</p> <p class=\"paywall-full-content\">If so, Workday may have invested billions into a product trend that offers more risk than reward. While many software companies embrace AI as a \"politically correct\" necessity, there is a risk that Workday is trying to change a business model that shouldn't be overly generous to AI to begin with.</p> <p class=\"paywall-full-content\">For instance, while I appreciate the boldness of Workday Sana, its potential damage is significant. In my experience, customers struggle more with \"what to do\" than \"how to do it\". As AI interacts with infrastructure to automate processes, a \"wrong order\" could result in \"automated chaos\" - incorrect tasks performed on a massive scale. Negative user experiences could cause risk-averse clients to retreat, damaging Workday's revenue.</p> <p class=\"paywall-full-content\">As I previously mentioned, ERP is a conservative business. This protects Workday’s core infrastructure but may also diminish the return on AI investments. AI add-ons take time to build momentum, but a few bad incidents are enough to spook large customers. Therefore, the quality of execution is key. If Workday fails to deliver high-quality AI, two outcomes are possible:</p> <ol class=\"paywall-full-content\"> <li>Systematic Poor Returns: The ERP ecosystem may not be an ideal place for large-scale AI. If the market realizes this, Workday and its competitors will face margin compression and a poor return on AI spend.</li> <li>Competitive Displacement: If AI <em>is</em> a gift to ERP, but Workday’s offerings are less competitive than peers', the company will lose market share and face margin pressure.</li> </ol> <p class=\"paywall-full-content\">As AI-embedded ERP products are in their infancy, it is difficult to predict which risk will prevail. Therefore, diversification is recommended. Investors seeking exposure to the ERP industry should diversify across several large players to minimize specific execution risks.</p> <h2 class=\"paywall-full-content\">Conclusion</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">At today's price, I believe that the market has priced in maximum pessimism. While short-term volatility is expected, long-term value will prevail as the narrative shifts over the next several quarters. Instead of panicking over the slight guidance miss, we should emphasize Workday's unique position and moat in the enterprise infrastructure space. I believe now is the time to accumulate quality software stocks, including Workday. If everyone was chasing it at $280, why wouldn't you want it at $130?</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1212869212/image_1212869212.jpg",
            "link": "https://seekingalpha.com/article/4876820-workday-a-generational-contrarian-buy",
            "pub_date": "2026-03-01 15:36:36",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876819",
            "title": "Why There Are Better Alternatives Than Welltower In 2026",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197891190/image_2197891190.jpg?io=getty-c-w630\" alt='wooden cubes spelling \"REIT\" on a laptop, with wooden house models in the background, symbolizing real estate investment' data-id=\"2197891190\" data-type=\"getty-image\" width=\"1536\" height=\"984\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197891190/image_2197891190.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197891190/image_2197891190.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197891190/image_2197891190.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197891190/image_2197891190.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197891190/image_2197891190.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197891190/image_2197891190.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197891190/image_2197891190.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197891190/image_2197891190.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>I used to be fairly heavily invested in US REITs. The reason I am not right now is because REITs are bad investments or bad choices; it's because a significant shift in USD/SEK FX made me leave most of<span class=\"paywall-full-content\"> those investments (that were at a profit) behind. Now that FX has normalized, I'm looking at what REITs to go into, and I've been investing in a couple of them again. Today, I look at Welltower (</span><span class=\"ticker-hover-wrapper paywall-full-content\"><a href=\"https://seekingalpha.com/symbol/WELL\" title=\"Welltower Inc.\">WELL</a></span><span class=\"paywall-full-content\">), and I'll show you why, in this case, I </span><em class=\"paywall-full-content\">have not</em><span class=\"paywall-full-content\"> invested in this particular one.</span></p> <p class=\"paywall-full-content\">When I pick investments or even companies to cover, I focus on a couple of things. Fundamentals, profitability, and valuation are core among the qualities that I weigh heavily. I try not to rely <em>too heavily</em> on a company having to \"outperform\" the market or its own expectations. When a company's performance is, in fact, dependent on a specific, expected outperformance, I tend to be very dubious about investing in it. It's because even if we have solid accuracy ratios and forecasts (historically speaking), there's always a certain risk in investing in companies like this. To me, that risk is higher than investing in a company that is fundamentally undervalued for what it is at its heart, irrespective of future outperformance.</p> <p class=\"paywall-full-content\">To put it another way, I'd rather invest in a cheap-quality company that grows very slowly, or even sometimes not at all, than I would in a company that trades at expensive multiples, and that's because investment return success (mine, in turn) is predicated on outperforming significantly, or even at all.</p> <p class=\"paywall-full-content\">I believe the more \"tilted\" you are towards this tendency, the more of a value-oriented investor you can be argued to be. In this article, I'll be updating on Welltower following the company's recent bout of share price appreciation, following in turn the short decline we saw in November-December of 2025.</p> <h2 class=\"paywall-full-content\">Welltower - The Upside Here is Tricky</h2> <p class=\"paywall-full-content\">Welltower is an A-rated healthcare REIT with an AFFO multiple of over 44x. During bad times, such as the GFC or even COVID-19, this company dropped to less than 13x.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772266672184131_origin.png\" rel=\"lightbox\" data-width=\"1698\" data-height=\"1308\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772266672184131_origin.png?io=w640\" alt=\"F.A.S.T Graphs Welltower REIT\" contenteditable=\"false\" width=\"640\" height=\"493\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772266672184131_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772266672184131_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772266672184131_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772266672184131_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span></span>Welltower REIT (FAST Graphs)</p></figcaption></figure></p> <p class=\"paywall-full-content\">I feel that this is a very good way to start out this article and updated coverage - to clarify that Welltower is currently at a multiple that it has never been at before (20+ years), and that is close to 3-4x the company's low end and more than 2x the typical average. Its closest peers in the industry trade at less than half the current P/AFFO and have better dividend yields, if not necessarily the same stellar credit rating as Welltower has.</p> <p class=\"paywall-full-content\">First off, let's clarify why the company has risen to these multiple levels.</p> <p class=\"paywall-full-content\">This has to do with the company's shift to a premium-to-pay model, coupled with a large portion of elderly individuals (the so-called \"Silver Tsunami\") driving demand for senior housing. But not just any senior housing - Welltower is focusing on that luxury senior housing.</p> <p class=\"paywall-full-content\">Since the pandemic and the decline of many of these healthcare REITs (you can go back to some articles and companies from back then to see what happened to companies like Omega (OHI)), there's been a very sharp decline in construction of new capacity in senior housing - correlated with the current state of US housing, by the way.</p> <p class=\"paywall-full-content\">But of course, these demographic tailwinds and advantages alone could never explain why a SHOP REIT like Welltower (previously) is trading at these significant multiples. There's more to it than that. Wall Street, despite the company's rather \"nutty\" valuation multiple relative to historical levels, after all, still has the company at a \"BUY\". So what gives?</p> <p class=\"paywall-full-content\">Well, a definite core part of it is also <em>that the company shifted its business model. </em>Typical SHOP/Healthcare/Senior operators <em>are passive landowners</em>. They lease out the land/assets to others who do the operating for them and pay a lease. However, for some time now, the company has moved to an active model of owner-operation. The company's Senior Housing Operating (or SHOP) is part of this, delivering consistent, superior relative returns to the market. The company enhances this with its own data analytics to identify performers and underperformers, allowing them to strategically target and rectify margin issues before they even become a problem.</p> <p class=\"paywall-full-content\">Its superior credit quality and debt metrics have allowed the company, relative to the BBB- (that's minus) rated companies in the sector, to buy up cheap properties <em>in a market where supply is scarce. </em></p> <p class=\"paywall-full-content\">Furthermore, as of current demographic trends, these growth metrics or trends are not expected to slow down but to pick up further. The strategic shift to this \"luxury housing\" is certainly the core of what is driving Welltower.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772267499068991_origin.png\" rel=\"lightbox\" data-width=\"2129\" data-height=\"1153\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772267499068991_origin.png?io=w640\" alt=\"Welltower IR 2026\" contenteditable=\"false\" width=\"640\" height=\"347\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772267499068991_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772267499068991_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772267499068991_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49836612-1772267499068991_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Welltower IR 2026</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The recent trends, reported about 2 weeks ago, confirm the continued growth with the 13th consecutive quarter of 20% NOI growth. Welltower, due to the assets it owns, has some significant pricing power at this time - and in recent results, operating margins have exceeded 30%.</p> <p class=\"paywall-full-content\">The company is not only buying things, but it's also selling them. Its recent plan includes the disposition of its outpatient medical portfolio at $6.4B, which will obviously free up a considerable amount of capital for potential reinvestment into new properties and assets. Money is being used, as of late, to buy up all UK-located senior properties.</p> <p class=\"paywall-full-content\">Let's hold there for a moment. The company is selling all of its outpatient medical, or OM, portfolio for capital recycling. The rationale for this move is obviously to buy other things for that money.</p> <p class=\"paywall-full-content\"><em>I think this is a poor move. Why?</em></p> <p class=\"paywall-full-content\">Because Welltower is selling \"crown jewels\" at what could be too-cheap (forward) prices in order to get deeper into SHOP. Welltower has spent many years becoming a solid OM operator. The sold portfolio had a more than 93% occupancy with very, very solid cash flows and much life left in it. I further like outpatient medical sectors because <em>they act as a hedge against a downturn. </em>Their sale represents Welltower giving up valuable diversification and income. It represents, as I see things, Welltower moving from a defensive income play into a very forward-looking, risk-taking growth player. Do we want that?</p> <p class=\"paywall-full-content\">Well, that would depend on the price, wouldn't it? I certainly wouldn't want to put my money in an overvalued player who wanted to overpay for SHOP assets with the explanation of \"demographics\" while, in my view, ignoring some of the downside risk and the qualities of the very assets that it's selling.</p> <p class=\"paywall-full-content\">Note that I said \"overvalued\" in the paragraph above. Let's presume for a moment that Welltower traded at, let's say, <em>half of its current valuation. </em>Then it would be a different ballgame - I would probably be interested, or at least willing to consider investing.</p> <p class=\"paywall-full-content\">But right now, no matter how solid and how good the results, margins, cash flows, and other metrics are, it doesn't matter to me due to how much I have to pay to \"get\" those margins or returns. It's always about \"what you pay for what you get\". When there's a surge like this in a company, it's always extremely hard to see even the risk or potential for a turnaround of the company dropping once again. It has to do with complex trends - such as the risks of initial issues and risks being hidden by the \"waves\" of success that the company is going through - this has to do with cognitive bias on our part as investors. Confirmation bias is a \"big thing\" here. Too often I've heard investors or clients say, \"Well, the company is still doing well\". It might be, but that doesn't mean in a year.</p> <p class=\"paywall-full-content\">The higher a company flies, the less it will take to start to make it tremble, metaphorically speaking.</p> <p class=\"paywall-full-content\">You want an example of this? Look at many people's darling, NVIDIA (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>). Despite what even Nvidia bears like me would describe as a record-breaking quarter in every single metric, the company fell 5% on the trading day. This is proof to me that not only are many of these companies flying so high we can start talking about \"Icarus flying too close to the sun\", but we should also be talking about exits and risks for many more companies than just Nvidia.</p> <p class=\"paywall-full-content\">This is one of them.</p> <p class=\"paywall-full-content\">Welltower had a superb previous result period, but to me, valuation is what matters. The valuation for the company is as follows.</p> <h2 class=\"paywall-full-content\">Valuation for Welltower - Not Justifiable Going Into 2026E</h2> <p class=\"paywall-full-content\">Let's start with the bull case. The company would, according to bull expectations, sustain its current expansion trajectory, margin growth, and earnings growth. They would have to \"compound\" the successes of 2025 into 2026 and work from there. I would argue that to make the bullish thesis work, the company must maintain double-digit NOI growth, and revenue must keep outperforming expenses. The company must also, in an attractive manner, execute on its pipeline and capital strategy. Growing at 44-45x P/AFFO would continue to drive a somewhat market-beating rate of return here.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/49836612-17722685651757474_origin.png\" rel=\"lightbox\" data-width=\"1661\" data-height=\"1338\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49836612-17722685651757474_origin.png?io=w640\" alt=\"F.A.S.T Graphs Welltower Upside\" contenteditable=\"false\" width=\"640\" height=\"516\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49836612-17722685651757474_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/49836612-17722685651757474_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49836612-17722685651757474_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49836612-17722685651757474_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span></span>Welltower Upside (FAST Graphs)</p></figcaption></figure></p> <p class=\"paywall-full-content\">It's not that I believe that the company will fail with all of these things; it's that I think that the <em>risks aren't being properly considered.</em></p> <p class=\"paywall-full-content\">What risks?</p> <p class=\"paywall-full-content\">Think of it like a \"weight\" on the company. We've already seen the first significant tremble of the company under pressure - that was during November/December when the stock fell, only to now recover at earnings. Based on this, I say that if the company can keep the recent results trends up, I think it might outperform (even at just 15.11%, about 0.11% above my requirement).</p> <p class=\"paywall-full-content\">For risks, we have a few.</p> <p class=\"paywall-full-content\">As mentioned above, the company is leaving OM behind. Why? There's, to my mind, no good reason for this move (aside from capital recycling - but the company could have tapped equity or debt, easily, to handle this capital need.) The OM segment is growing. There's a structural shift from hospital to outpatient, <em>driven by exactly the same demographic trends the company is citing. </em>The need for OM will be higher, not lower. Yet WELL is, in my view, leaving \"safe money\" on the table here.</p> <p class=\"paywall-full-content\">The company's new operating profile lacks diversification. Senior housing operations are further correlated to significant volatility due to the reliance on labor, occupancy dips, and other factors, unlike OM, which is much easier to continually fill and work with.</p> <p class=\"paywall-full-content\">Further, by leaving the sector entirely, WELL is disregarding a multi-decade expertise that they've built up in OM. Over 150 people are leaving the company, people that the company trained and worked with. That's losing skill/expertise, and that's not positive.</p> <p class=\"paywall-full-content\">I argue that Welltower should view <em>the healthcare sector for seniors like an ecosystem. </em>In doing what the company is doing, Welltower <em>is giving up a core part of that ecosystem willingly</em> and without really needing to do so.</p> <p class=\"paywall-full-content\">Then there are fiscal considerations. The company is getting money for its OM portfolio and cycling it into what are now <em>expensive assets</em>. I believe there's a real risk that Welltower is selling solid-performance assets at what will be discounts to future cash flows while overpaying for assets that will be more volatile than the company expects them to be.</p> <p class=\"paywall-full-content\">Based on this, I view the company as being unfavorably valued here.</p> <p class=\"paywall-full-content\">My outlook is bearish. I give the company a premium to long-term AFFO at 25x, but that's as high as I can go for the FV. That comes to $180/share, with a PT of $155/share or lower. This target <em>includes the assumption of future growth</em>, just not as much growth as the market seems to be expecting. My share price targets include a significant correction from these overvalued tendencies over the coming 2-3. I believe we'll see a risk from rising costs relative to revenue growth, as well as the slow introduction of interest rate pressure. I believe that <a href=\"https://www.insidehousing.co.uk/home/uks-largest-retirement-home-builder-commits-to-40-new-mmc-developments-74143#:~:text=UK's%20largest%20retirement%20home%20builder%20commits%20to%2040%20new%20MMC%20developments,-Home03.02.22&amp;text=The%20UK's%20largest%20retirement%20housing,in%20the%20next%20two%20years.&amp;text=McCarthy%20Stone%2C%20which%20operates%20475,retirement%20communities%20using%20this%20method.\" rel=\"nofollow\">senior housing supply will, in fact, grow now that the supply situation is clear.</a></p> <p class=\"paywall-full-content\">Once this supply and similar trends become clearer, this premium will, I believe, deflate. I believe this will result in missed growth metrics going forward and a lower AFFO on a per-share basis than expected. This also represents a failure for the company to deliver on its capital acquisitions because they're made at \"too high\" prices. If you want to adjust my targets, the variables are there for you to remove or edit. The shift in any of them towards the positive side would result in a higher FV/PT, ultimately towards the end the $240-$350/share target that some analysts have.</p> <p class=\"paywall-full-content\">I am not one of them, however.</p> <p class=\"paywall-full-content\">My thesis for Welltower for 2026 is as follows.</p> <h2 class=\"paywall-full-content\">Thesis</h2> <p class=\"paywall-full-content\">Welltower is a very solid REIT, with what some might argue are best-in-class fundamentals with significant upside. However, the company's strategy does not convince me that the upside for 2026-2028E will be as high as it is expected, and I believe the company's plan to succeed is flawed in terms of risk/reward at this particular valuation.</p> <p class=\"paywall-full-content\">I view the move from the solid OM segment as the wrong move as a justification for the capital recycling strategy. What I would have liked to see is a hybrid approach or an entirely equity/debt approach to fund this move - perhaps with more care and consideration as well.</p> <p class=\"paywall-full-content\">I believe the risks are now higher than before and, coupled with the valuation, are unsustainably high. For that reason, I update with an FV of $180/share and a PT of $155/share.</p> <p class=\"paywall-full-content\">Here are my criteria and how the company fulfills them (<em>in italics</em>).</p> <ul class=\"paywall-full-content\"> <li><em>This company is overall qualitative.</em></li> <li><em>This company is fundamentally safe/conservative &amp; well-run.</em></li> <li><em>This company pays a well-covered dividend.</em></li> <li>This company is currently cheap.</li> <li>This company has a realistic upside that is high enough, based on earnings growth or multiple expansion/reversion.</li> </ul> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">The company fulfills 3 out of 3 quality indicators and 0 out of 2 valuation indicators. That means 3/5 \"stars\" here, which typically isn't enough. Based on this and a valuation target of $155/share, I see a risk/reward-adjusted upside that's attractive enough for me. I give the company a \"Hold\" rating as of February 2026.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197891190/image_2197891190.jpg",
            "link": "https://seekingalpha.com/article/4876819-why-there-are-better-alternatives-than-welltower-in-2026",
            "pub_date": "2026-03-01 15:30:55",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876815",
            "title": "Permian Resources: A Rollup Strategy Continues The Growth Story",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2256598545/image_2256598545.jpg?io=getty-c-w630\" alt=\"Oil pumpjack operating in an onshore oil field\" data-id=\"2256598545\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2256598545/image_2256598545.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2256598545/image_2256598545.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2256598545/image_2256598545.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2256598545/image_2256598545.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2256598545/image_2256598545.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2256598545/image_2256598545.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2256598545/image_2256598545.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2256598545/image_2256598545.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Esteban Alejandro/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Recently, Diamondback Energy (<a href=\"https://seekingalpha.com/symbol/FANG\" title=\"Diamondback Energy, Inc.\">FANG</a>) <a href=\"https://seekingalpha.com/article/4875388-diamondback-energy-strategy-shift\">announced a strategy change</a> because there are now a lot less targets for the company to continue to pursue its strategy of growth by acquisition. But Permian Resources (<span class=\"ticker-hover-wrapper paywall-full-content\"><a href=\"https://seekingalpha.com/symbol/PR\" title=\"Permian Resources Corporation\">PR</a></span><span class=\"paywall-full-content\">) is a much smaller company located in the Permian. Therefore, this company has long elected to pursue growth by purchasing small parcels and combining them with the leases it already has to create value for shareholders. This type of growth is likely to be able to be executed for a very long time. It seems like there are always small positions that are hard to market available for purchase. Additionally, the costs of this strategy are often far less than the traditional acquisition strategy.</span></p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/27/1102834-1772234506910857_origin.png?io=w640\" alt=\"Permian Resources Fourth Quarter Acquisition Strategy Summary\" contenteditable=\"false\" width=\"640\" height=\"353\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/1102834-1772234506910857_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/1102834-1772234506910857_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/1102834-1772234506910857_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/1102834-1772234506910857_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">Permian Resources Fourth Quarter Acquisition Strategy Summary <span>(Permian Resources Corporate Presentation Fourth Quarter 2025)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The <a href=\"https://permianres.com/wp-content/uploads/2026/02/PR-Q425-Earnings-Presentation.vFF_.pdf\" rel=\"nofollow\">average purchase price</a> shown above is dirt cheap compared to a lot of acquisitions that cost up to $65,000 an acre. This affects the location cost of a well. For investors, enough of these purchases will show as above-average company profitability because it does not require as much capital per well location as the far more traditional acquisition strategy does.</p> <p class=\"paywall-full-content\">It should also be noted that the location cost shown above has two significant variables. Those variables are acreage cost and the choice of well spacing.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/27/1102834-17722348452095027_origin.png?io=w640\" alt=\"Permian Resources Overall 2025 Acquisition Program Accomplishments\" contenteditable=\"false\" width=\"640\" height=\"355\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/1102834-17722348452095027_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/1102834-17722348452095027_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/1102834-17722348452095027_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/1102834-17722348452095027_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">Permian Resources Overall 2025 Acquisition Program Accomplishments <span>(Permian Resources Corporate Presentation Fourth Quarter 2025)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The ability to do this likely makes the company a bit pickier about large acquisitions. After all, 30,000 net acres (roughly) is significant for many companies.</p> <p class=\"paywall-full-content\">Many times, acquisitions like this are accretive because the combined acreage offers more profit potential than do two separate holdings. This consideration is completely different from the benefits of the low prices.</p> <p class=\"paywall-full-content\">In summary, there are several ways to win with a rollup strategy. But very few managements of the companies that I follow bother with such a strategy.</p> <p class=\"paywall-full-content\">Most managements prefer an acquisition that \"moves the needle\". But this strategy, over time, can prove to be a very significant profit enhancement idea.</p> <p class=\"paywall-full-content\">Additionally, such a program is a sign of detail-oriented management that is very important to the commodity business. Any time a company can be extra profitable compared to the competition, that \"extra profitable\" becomes a competitive advantage that can last a while. Sometimes a strategy like this is very similar to a competitive moat as long as it continues to be well executed.</p> <h2 class=\"paywall-full-content\">Last Article</h2> <p class=\"paywall-full-content\">The last article noted the disciplined nature of the acquisition strategy here. This company is not as dependent upon large acquisitions to grow, even though it has made large acquisitions in the past.</p> <p class=\"paywall-full-content\">More than a few companies have announced intentions to grow by exploring new intervals. Much of the Permian is a stacked play with multiple intervals. There are plenty of those intervals that are either still to be developed or are older plays revolutionized by ongoing technology improvements.</p> <p class=\"paywall-full-content\">Probably a big difference here is that this company has so far not joined the \"mad rush\" to the Midland Basin. This is where many companies have chosen to grow their business in recent years. Instead, the focus here remains on the Delaware Basin (at least for the time being).</p> <p class=\"paywall-full-content\"><a href=\"https://seekingalpha.com/article/4554612-permian-resources-shareholder-alignment\">Keep in mind</a> that Permian Resources has only really been around since fiscal year 2023. The management that is running the company had a lot of success building and selling private companies before this attempt. This is the first attempt at building and probably selling a public company.</p> <p class=\"paywall-full-content\">That makes the acquisition strategy a key part of putting the company together for an eventual sale. However, the market often demands a period of time necessary to form a few years of a track record of the company as it is currently composed. Therefore, shareholders may well expect better valuation of this company ahead as acquisitions play a progressively smaller part of the company's growth in the future.</p> <h2 class=\"paywall-full-content\">Debt</h2> <p class=\"paywall-full-content\">The company is beginning to get consideration for an investment-grade debt rating.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/27/1102834-17722359643966365_origin.png?io=w640\" alt=\"Permian Resources Debt Summary\" contenteditable=\"false\" width=\"640\" height=\"357\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/1102834-17722359643966365_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/1102834-17722359643966365_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/1102834-17722359643966365_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/1102834-17722359643966365_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">Permian Resources Debt Summary <span>(Permian Resources Corporate Presentation Fourth Quarter 2025)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">One of the reasons for the low debt ratio is the ongoing program to purchase small lease holdings at a big discount to the market. That often makes the production that follows on this acreage more profitable due to the lower location costs.</p> <p class=\"paywall-full-content\">The other thing is that this is that rare company with a prime Permian location in the Delaware Basin. Very few companies accomplish a locational advantage like this. Fewer still manage to grow in an area that is a focus for much of the industry. Most companies this size and smaller are outbid for acreage in an area like this.</p> <p class=\"paywall-full-content\">But now, with one ratings agency basically giving this company an investment-grade rating and another one (S&amp;P) getting very close to the same conclusion, it would appear there will be an interest rate advantage to that low debt as well.</p> <h2 class=\"paywall-full-content\">Earnings</h2> <p class=\"paywall-full-content\">Probably the big deal is the increase in the base dividend. This company will repurchase stock with some more money so that if there is something that needs to stop (due to weak commodity prices), the first thing that stops is the stock buyback program. That makes the dividend far more defensible than one would normally think for an upstream company.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/28/1102834-17722607027515593_origin.png?io=w640\" alt=\"Permian Resources Summary Of Fiscal Year 2025\" contenteditable=\"false\" width=\"640\" height=\"347\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/1102834-17722607027515593_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/1102834-17722607027515593_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/1102834-17722607027515593_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/1102834-17722607027515593_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">Permian Resources Summary Of Fiscal Year 2025 <span>(Permian Resources Corporate Presentation Fourth Quarter 2025)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">This company has a darn good cost structure for a company of this size. Part of this is due to the geology where the company is located. Of course, then it is up to management to make the best of the situation. I have covered companies in this area that settled for \"good enough\" because the geology was that good. This does not appear to be one of those companies.</p> <p class=\"paywall-full-content\">Management states that the dividend is covered down to roughly WTI $40. That is far better than many competitors that have replied to the<a href=\"https://www.dallasfed.org/research/surveys/des/2025/2501\" rel=\"nofollow\"> Dallas Federal Reserve Energy Survey</a> that they need WTI in the upper $60 range to drill new wells (let alone pay a dividend).</p> <h2 class=\"paywall-full-content\">Summary</h2> <p class=\"paywall-full-content\">To me, it looks like Permian Resources is beginning to slowly cross a ratings border towards investment grade. This company is a good deal smaller than many of the companies I follow that make investment grade. If it happens that all the ratings companies eventually consider this investment grade, it is a tribute to management that it happened.</p> <p class=\"paywall-full-content\">Similarly, this company is continuing its growth story by acquiring \"bolt-on\" small, suboptimal parcels. These parcels border on leases that the company already has. The combination of the two holdings is often more profitable than was the case when they were separate.</p> <p class=\"paywall-full-content\">This management has built and sold companies before. For me, this remains a strong buy idea that I would hold until management sells the company.</p> <h2 class=\"paywall-full-content\">Risk</h2> <p class=\"paywall-full-content\">There is always a risk that the growth story changes or fails to provide the positive results seen in the past. Should something like that happen, I would probably re-evaluate the company.</p> <p class=\"paywall-full-content\">A severe and sustained commodity price decline could materially change the company outlook. Now it would appear that this company has breakeven costs that allow a very low WTI price to support the dividend. Therefore, a lot of companies would suffer far more than this one in any cyclical downturn.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Any management that builds and sells companies is a subset of the managers qualified for the various jobs in this company. A replacement of a key manager could prove to be quite a challenge because very few senior managers can build and sell companies. Therefore, the loss of services could set back the company or materially change the company's future.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2256598545/image_2256598545.jpg",
            "link": "https://seekingalpha.com/article/4876815-permian-resources-a-rollup-strategy-continues-the-growth-story",
            "pub_date": "2026-03-01 14:56:36",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876660",
            "title": "S&P 500 Snapshot: 50-Day MA Becomes A Pivot Point Amid February Volatility",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/520131149/image_520131149.jpg?io=getty-c-w630\" alt=\"S&amp;P Recession 3D Concept\" data-id=\"520131149\" data-type=\"getty-image\" width=\"1536\" height=\"1152\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/520131149/image_520131149.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/520131149/image_520131149.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/520131149/image_520131149.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/520131149/image_520131149.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/520131149/image_520131149.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/520131149/image_520131149.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/520131149/image_520131149.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/520131149/image_520131149.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Skywalker_ll/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p><em>By Jennifer Nash </em></p> <p>The S&amp;P 500 slipped back below its 50-day moving average to end the week, marking the index's seventh cross of the key trendline this February. The index finished the week with a loss of -0.4% and<span class=\"paywall-full-content\"> is now 1.43% off its all-time high from January 27, 2026. Here is a snapshot of the index from the past week:</span></p> <p class=\"paywall-full-content\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_c4ab4ad3d625ef92ba178e705a9b2751.png\" rel=\"lightbox\" data-width=\"2241\" data-height=\"1342\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_c4ab4ad3d625ef92ba178e705a9b2751.png?io=w640\" alt=\"SP500 This Week\" width=\"1280\" height=\"767\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_c4ab4ad3d625ef92ba178e705a9b2751.png?io=w1280 1280w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c4ab4ad3d625ef92ba178e705a9b2751.png?io=w1080 1080w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c4ab4ad3d625ef92ba178e705a9b2751.png?io=w750 750w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c4ab4ad3d625ef92ba178e705a9b2751.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c4ab4ad3d625ef92ba178e705a9b2751.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c4ab4ad3d625ef92ba178e705a9b2751.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c4ab4ad3d625ef92ba178e705a9b2751.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span></p> <p class=\"paywall-full-content\"><span>The table below summarizes the number of record highs reached each year dating back to 2013.</span></p> <p class=\"paywall-full-content\"><img src=\"https://static.seekingalpha.com/uploads/2026/1/31/saupload_642463f30debd06e2287076bfbba0d42.png?io=w640\" alt=\"Record Highs\" width=\"230\" height=\"306\" loading=\"lazy\" srcset=\"\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></p> <p class=\"paywall-full-content\">Here is a snapshot of the index from the past six months with a 50-day moving average:</p> <p class=\"paywall-full-content\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_8a154251e6270abea8e0789210b50b74.png\" rel=\"lightbox\" data-width=\"2774\" data-height=\"1612\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_8a154251e6270abea8e0789210b50b74.png?io=w640\" alt=\"S&amp;P 500 - Past 6 Mos\" width=\"1280\" height=\"744\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_8a154251e6270abea8e0789210b50b74.png?io=w1280 1280w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_8a154251e6270abea8e0789210b50b74.png?io=w1080 1080w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_8a154251e6270abea8e0789210b50b74.png?io=w750 750w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_8a154251e6270abea8e0789210b50b74.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_8a154251e6270abea8e0789210b50b74.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_8a154251e6270abea8e0789210b50b74.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_8a154251e6270abea8e0789210b50b74.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span></p> <h2 class=\"paywall-full-content\"><strong>S&amp;P 500: A Perspective on Drawdowns</strong></h2> <p class=\"paywall-full-content\">On October 9, 2007, the S&amp;P 500 reached an all-time high, closing the day at 1565.15. Then on March 9, 2009, the index dropped ~57% off of its high from exactly 17 months before, closing the day at 676.53. This time period became known as the Global Financial Crisis. It took over 5 years before the index reached a new all-time high on March 28, 2013, where it closed out at 1569.19. The chart below is a snapshot of record highs and selloffs since the 2007 peak reached on October 9, 2007.</p> <p class=\"paywall-full-content\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_97c9dbf137de8b034f7f057635b1d3ee.png\" rel=\"lightbox\" data-width=\"3131\" data-height=\"2275\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_97c9dbf137de8b034f7f057635b1d3ee.png?io=w640\" alt=\"SPX Drawdowns since Oct. 9 2007\" width=\"1280\" height=\"930\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_97c9dbf137de8b034f7f057635b1d3ee.png?io=w1280 1280w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_97c9dbf137de8b034f7f057635b1d3ee.png?io=w1080 1080w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_97c9dbf137de8b034f7f057635b1d3ee.png?io=w750 750w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_97c9dbf137de8b034f7f057635b1d3ee.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_97c9dbf137de8b034f7f057635b1d3ee.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_97c9dbf137de8b034f7f057635b1d3ee.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_97c9dbf137de8b034f7f057635b1d3ee.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span>What happens if we take out the Global Financial Crisis? Here's a snapshot of the same chart above where the start date has been changed to the trough reached on March 9, 2009. Note the recent selloffs in 2022.</p> <p class=\"paywall-full-content\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_c13dc747806ab27e6a4c13f256f356ef.png\" rel=\"lightbox\" data-width=\"3131\" data-height=\"2275\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_c13dc747806ab27e6a4c13f256f356ef.png?io=w640\" alt=\"SPX Drawdowns\" width=\"1280\" height=\"930\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_c13dc747806ab27e6a4c13f256f356ef.png?io=w1280 1280w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c13dc747806ab27e6a4c13f256f356ef.png?io=w1080 1080w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c13dc747806ab27e6a4c13f256f356ef.png?io=w750 750w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c13dc747806ab27e6a4c13f256f356ef.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c13dc747806ab27e6a4c13f256f356ef.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c13dc747806ab27e6a4c13f256f356ef.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_c13dc747806ab27e6a4c13f256f356ef.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span>Here are a few tables with the number of days of a 1% or greater change in either direction and the number of days of corrections (down 10% or more from the record high).</p> <p class=\"paywall-full-content\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_77f3ea87a2dc63ebbcd35c0e8d43cb94.png?io=w640\" alt=\"Up Down One Percent\" width=\"351\" height=\"326\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_77f3ea87a2dc63ebbcd35c0e8d43cb94.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_77f3ea87a2dc63ebbcd35c0e8d43cb94.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> <img src=\"https://static.seekingalpha.com/uploads/2026/1/17/saupload_3f9ff16da7ea917d1f5d54d400ec4ef5.png?io=w640\" alt=\"Corrections\" width=\"256\" height=\"286\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/1/17/saupload_3f9ff16da7ea917d1f5d54d400ec4ef5.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></p> <p class=\"paywall-full-content\">And here is a linear chart of the index since October 9, 2007:</p> <p class=\"paywall-full-content\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_0d55ce886984e7f5c60c70168c517bc2.png\" rel=\"lightbox\" data-width=\"3128\" data-height=\"2273\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_0d55ce886984e7f5c60c70168c517bc2.png?io=w640\" alt=\"SPX Snapshot\" width=\"1280\" height=\"930\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_0d55ce886984e7f5c60c70168c517bc2.png?io=w1280 1280w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_0d55ce886984e7f5c60c70168c517bc2.png?io=w1080 1080w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_0d55ce886984e7f5c60c70168c517bc2.png?io=w750 750w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_0d55ce886984e7f5c60c70168c517bc2.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_0d55ce886984e7f5c60c70168c517bc2.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_0d55ce886984e7f5c60c70168c517bc2.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_0d55ce886984e7f5c60c70168c517bc2.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span></p> <p class=\"paywall-full-content\">Here is a linearly scaled version of the same chart with the 50- and 200-day moving averages. The index has been below the 50-day moving average since February 27th and above the 200-day moving average since May 12th. Additionally, the 50-day moving average has been above the 200-day moving average since July 1st.</p> <p class=\"paywall-full-content\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_223f18990d645f38d59b9a7e1e21f6c9.png\" rel=\"lightbox\" data-width=\"3131\" data-height=\"2273\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_223f18990d645f38d59b9a7e1e21f6c9.png?io=w640\" alt=\"SPX Snapshot MAs\" width=\"1280\" height=\"929\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_223f18990d645f38d59b9a7e1e21f6c9.png?io=w1280 1280w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_223f18990d645f38d59b9a7e1e21f6c9.png?io=w1080 1080w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_223f18990d645f38d59b9a7e1e21f6c9.png?io=w750 750w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_223f18990d645f38d59b9a7e1e21f6c9.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_223f18990d645f38d59b9a7e1e21f6c9.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_223f18990d645f38d59b9a7e1e21f6c9.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_223f18990d645f38d59b9a7e1e21f6c9.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span></p> <h2 class=\"paywall-full-content\"><strong>S&amp;P 500: A Perspective on Volatility</strong></h2> <p class=\"paywall-full-content\">For a sense of the correlation between the closing price and intraday volatility, the chart below overlays the S&amp;P 500 since 2007 with the intraday price range. On April 9th, 2025, the index experienced its largest intraday price volatility (10.77%) since December 24th, 2018 (19.10%). Also included is the 20-day moving average to identify trends in volatility. Over the past 20 days, the average percent change from the intraday low to the intraday high is 1.22%.</p> <p class=\"paywall-full-content\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_f1464f46def50156e9f0104c3ed1a763.png\" rel=\"lightbox\" data-width=\"3131\" data-height=\"2275\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_f1464f46def50156e9f0104c3ed1a763.png?io=w640\" alt=\"SPX Volatility since 2007\" width=\"1280\" height=\"930\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_f1464f46def50156e9f0104c3ed1a763.png?io=w1280 1280w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_f1464f46def50156e9f0104c3ed1a763.png?io=w1080 1080w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_f1464f46def50156e9f0104c3ed1a763.png?io=w750 750w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_f1464f46def50156e9f0104c3ed1a763.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_f1464f46def50156e9f0104c3ed1a763.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_f1464f46def50156e9f0104c3ed1a763.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_f1464f46def50156e9f0104c3ed1a763.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span></p> <h2 class=\"paywall-full-content\"><strong>S&amp;P 500 versus S&amp;P Equal Weight</strong></h2> <p class=\"paywall-full-content\">The S&amp;P 500 is a market cap-weighted index which includes roughly the 500 largest U.S. stocks spanning 11 sectors. The S&amp;P 500 Equal Weight Index includes the same constituents as the S&amp;P 500, but each company is equally weighted at a fixed weight. So how do these two indexes match up against each other this year?</p> <p class=\"paywall-full-content\">The S&amp;P 500 is currently up 0.49% year-to-date, while the S&amp;P Equal Weight is up 6.78% year-to-date.</p> <p class=\"paywall-full-content\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_04d7104320d049ea6d1447f0ded52439.png\" rel=\"lightbox\" data-width=\"3131\" data-height=\"2272\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_04d7104320d049ea6d1447f0ded52439.png?io=w640\" alt=\"SP500 vs SP Equal Weight\" width=\"1280\" height=\"929\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/saupload_04d7104320d049ea6d1447f0ded52439.png?io=w1280 1280w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_04d7104320d049ea6d1447f0ded52439.png?io=w1080 1080w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_04d7104320d049ea6d1447f0ded52439.png?io=w750 750w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_04d7104320d049ea6d1447f0ded52439.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_04d7104320d049ea6d1447f0ded52439.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_04d7104320d049ea6d1447f0ded52439.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/saupload_04d7104320d049ea6d1447f0ded52439.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span></p> <p class=\"paywall-full-content\">ETFs associated with the S&amp;P 500 include: iShares Core S&amp;P 500 ETF (<a href=\"https://seekingalpha.com/symbol/IVV\" title=\"iShares Core S&amp;P 500 ETF\">IVV</a>), SPDR S&amp;P 500 ETF Trust (<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"State Street SPDR S&amp;P 500 ETF Trust\">SPY</a>), Vanguard S&amp;P 500 ETF (<a href=\"https://seekingalpha.com/symbol/VOO\" title=\"Vanguard 500 Index Fund ETF\">VOO</a>), SPDR Portfolio S&amp;P 500 ETF (<a href=\"https://seekingalpha.com/symbol/SPYM\" title=\"State Street SPDR Portfolio S&amp;P 500 ETF\">SPYM</a>), and Invesco S&amp;P 500® Equal Weight ETF (<a href=\"https://seekingalpha.com/symbol/RSP\" title=\"Invesco S&amp;P 500 Eql Wght ETF\">RSP</a>).</p> <p class=\"paywall-full-content\"><a href=\"https://www.advisorperspectives.com/dshort/updates/2026/02/27/s-p-500-snapshot-50-day-ma-becomes-a-pivot-point-amid-february-volatility\" rel=\"noopener noopener noopener noopener noopener noopener noopener noopener\">Original Post</a></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\"><strong>Editor's Note:</strong> The summary bullets for this article were chosen by Seeking Alpha editors.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/520131149/image_520131149.jpg",
            "link": "https://seekingalpha.com/article/4876660-sp-500-snapshot-50-day-ma-becomes-pivot-point-amid-february-volatility",
            "pub_date": "2026-03-01 13:31:55",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876811",
            "title": "Buy Applied Optoelectronics, But Be Very Careful",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1199687306/image_1199687306.jpg?io=getty-c-w630\" alt=\"Tablet computer data network technology and dollar symbol, big data global transmission and storage, internet security technology and fintech\" data-id=\"1199687306\" data-type=\"getty-image\" width=\"1536\" height=\"1195\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1199687306/image_1199687306.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1199687306/image_1199687306.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1199687306/image_1199687306.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1199687306/image_1199687306.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1199687306/image_1199687306.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1199687306/image_1199687306.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1199687306/image_1199687306.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1199687306/image_1199687306.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">liulolo/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Investment Thesis</h2> <p>Applied Optoelectronics (NASDAQ:<a href=\"https://seekingalpha.com/symbol/AAOI\" class=\"ticker-link\">AAOI</a>) shares surged 57% after reporting Q4 CY25 results that beat top-line estimates by 4.7% and overwhelmingly surprised markets with a mere 1 cent loss per share, significantly ahead of analysts' estimates.</p> <p class=\"paywall-full-content\">The Q4 ER from the Texas-based maker of laser and laser components/products that are widely deployed in optical networks showed that both its end markets, cable TV and data center networks, were exhibiting great strength.</p> <p class=\"paywall-full-content\">But it was the guidance from management that violently catapulted shares. Management’s outlook for its data center business was extremely high-caliber, projecting a 3.5x increase in data center revenues, leading me to adopt a bullish view on AOI.</p> <p class=\"paywall-full-content\">But there is enough precedent to show investors must mix elements of caution in their bullishness on AOI as highlighted in the risk section.</p> <h2 class=\"paywall-full-content\">Demand For Laser Products In Datacenters Is Too High</h2> <p class=\"paywall-full-content\">AOI competes directly with Lumentum (<a href=\"https://seekingalpha.com/symbol/LITE\" title=\"Lumentum Holdings Inc.\">LITE</a>) and Coherent (<a href=\"https://seekingalpha.com/symbol/COHR\" title=\"Coherent Corp.\">COHR</a>) but is much smaller compared to both its larger peers. I just wrote about the difference between Lumentum and Coherent, which should be somewhat useful for investors in the context of AOI.</p> <p class=\"paywall-full-content\">Unlike Lumentum but similar to Coherent, AOI is a highly vertically integrated company that manages and controls the entire manufacturing &amp; production process of making its optical products, including manufacturing semiconductor laser chip components to assembling the final product(s)—turnkey modules and equipment like optical transceiver modules, which are mostly sold to hyperscalers. Outside of the DC (data center) market, AOI also manufactures 1.8 GHz HFC (Hybrid Fiber-Coaxial) amplifiers that are deployed in CATV (cable TV networks).</p> <p class=\"paywall-full-content\">So, CATV and DC are two major end markets for AOI, and in CY25, CATV was the growth vector for AOI.</p> <p class=\"paywall-full-content\">In the recent<a href=\"https://investors.ao-inc.com/news-releases/news-release-details/applied-optoelectronics-reports-fourth-quarter-and-full-year-5\" rel=\"nofollow\"> Q4 results</a>, AOI reported a 34% increase in Q4 revenues worth $134.3M, beating expectations by 4.7% or $6M. For the full year, CY25 revenues came in at $455.7M, accounting for 54% of AOI’s CY25 revenue base, implying the CATV revenue segment surged 2.8x over its CY24. DC revenues accounted for 43% and grew 32% over CY24, as shown below.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852595430174_origin.png\" rel=\"lightbox\" data-width=\"1544\" data-height=\"818\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852595430174_origin.png?io=w640\" alt=\"Exhibit A: AOI’s revenues per year split by end markets.\" width=\"640\" height=\"339\" contenteditable=\"false\" data-width=\"640\" data-height=\"339\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852595430174_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852595430174_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852595430174_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852595430174_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">Exhibit A: AOI’s revenues per year split by end markets. <span>(Company filings)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">It’s really management’s outlook on its DC business that worked its charm on markets.</p> <p class=\"paywall-full-content\">Management expects to touch a billion dollars in consolidated revenue this year, and its hyperscaler customers are expected to account for 70% of the CY26 $1B revenue projection, which represents an astounding leap of revenues projected in the DC market for AOI. Per my estimates based on management’s projections, DC revenues should be jumping 3.5x to ~$700M in CY26, which is extremely powerful.</p> <p class=\"paywall-full-content\">Most of the DC revenues this year came from sales of AOI’s 400G optical transceiver modules, and the momentum in 400G modules is expected to continue in Q1 CY26. But from Q2 onwards AOI’s 800G optical modules will become the majority revenue growth driver, and the ramp is expected to stay robust throughout the year. Also, AOI expects 1.6T optical modules to ramp up later this year, with 1.6T modules becoming the major revenue driver next year.</p> <p class=\"paywall-full-content\">This is very promising for AOI because as the company ships higher-speed modules (400G to 800G to 1.6T), the opportunity for gross margins significantly increases. That’s exactly what markets want to see. Gross margins in Q4 came in at 31%, and management sees a strong path to 40% margins by the end of next year if they can continue to move customers up to the 1.6T optical modules.</p> <p class=\"paywall-full-content\">Management revealed that their lead hyperscaler customer, Microsoft (<a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a>), is already engaging with them to ramp up on 800G optical modules, and one other hyperscaler should join Microsoft as their two largest hyperscaler customers in CY26. AOI is also engaging with two other hyperscaler customers for 800G optical modules, with the fourth potential hyperscaler customer also looking at deploying AOI’s 1.6T optical modules.</p> <p class=\"paywall-full-content\">The most encouraging sign here is that management has been deploying its capex with the sole goal of sourcing more raw materials and building more manufacturing &amp; assembly capacity. As seen below, AOI’s capex has been growing at ~4x rates per year since CY23, with CY25 capex standing at $210M.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852858112214_origin.png\" rel=\"lightbox\" data-width=\"1784\" data-height=\"648\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852858112214_origin.png?io=w640\" alt=\"Exhibit B: Comparing AOI’s annual revenue growth and capex growth vs capex % revenue.\" width=\"640\" height=\"232\" contenteditable=\"false\" data-width=\"640\" data-height=\"232\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852858112214_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852858112214_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852858112214_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722852858112214_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">Exhibit B: Comparing AOI’s annual revenue growth and capex growth vs capex % revenue. <span>(Company filings)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">And management believes they’re still capacity constrained. Assuming they deploy more capex and follow a rigorous discipline of shipping their optical modules on time to customers, AOI easily has a path to grow revenues beyond the $1B mark while expanding gross margins beyond the 31% Q4 gross margins.</p> <p class=\"paywall-full-content\">In that case, AOI’s shares look extremely cheap from a valuation standpoint.</p> <h2 class=\"paywall-full-content\">AOI’s Revenue Multiple Signals Explosive Upside</h2> <p class=\"paywall-full-content\">Consensus estimates point to AOI’s revenues growing to $856M, an ~88% growth over CY25 revenues. That’s under the CY26 $1B revenue guide that management gave.</p> <p class=\"paywall-full-content\">Even if I consider $856M in analyst’s CY26 revenue expectations and factor in AOI’s enterprise value of $5.8B, that gets me to a forward revenue multiple of 6.8x. In my opinion, that still leaves room for AOI’s forward revenue multiple to expand to ~8.5x as it did last year on the hopes of CY25 revenues doubling. This implies ~23-25% upside from current levels for AOI’s shares.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-1772285365586598_origin.png\" rel=\"lightbox\" data-width=\"1992\" data-height=\"1278\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-1772285365586598_origin.png?io=w640\" alt=\"Exhibit C: AOI's forward revenue multiple shows potential for strong upside\" width=\"640\" height=\"411\" contenteditable=\"false\" data-width=\"640\" data-height=\"411\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-1772285365586598_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-1772285365586598_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-1772285365586598_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-1772285365586598_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">Exhibit C: AOI's forward revenue multiple shows potential for strong upside <span>(yCharts)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">If investors consider management's CY26 $1B revenue expectation, the forward revenue multiple can be estimated to be ~5.8x. Assuming the exit multiple of ~8.5x, this implies an upside of 45% in AOI’s shares.</p> <p class=\"paywall-full-content\">So, the outlook looks very strong. But before turning extremely bullish, investors must consider the risks.</p> <h2 class=\"paywall-full-content\">Risks On Staying Permanently Bullish On AOI</h2> <p class=\"paywall-full-content\">AAOI has some painful history during CY16-CY18, the years when optical networks were ramping from 40G to 100G speeds. You can take it from me, because I learned it the hard way why I should adopt a tactical bullish view on AOI, keeping in mind the risks of investing in AOI.</p> <p class=\"paywall-full-content\">In 2017, AOI’s shares had surged in advance of a strong outlook announced in Q1 CY17. At the time, management revealed that they had secured large orders from major hyperscalers who were upgrading their networks from 40G speeds to 100G speeds. But execution risks eventually played out that year, and by the end of CY17, shares were crashing because revenues that were expected from the 100G ramp-up were strangely contracting in CY17.</p> <p class=\"paywall-full-content\">This can also be seen in management’s capex plans, which largely remained contained at ~$21-22M between H2 CY17 and CY18, despite AOI’s revenue accelerating at ~2x pace rates. Management’s unusually tight capex plans at the time eventually led to inherent demand loss, severely impacting revenue growth versus prior guidance ranges. And I believe this created extreme lumpy volatility in AOI’s growth rates as well as customer base at the time.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722854070508828_origin.png\" rel=\"lightbox\" data-width=\"1988\" data-height=\"1386\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722854070508828_origin.png?io=w640\" alt=\"Exhibit D: Comparing Applied Optoelectronics’ revenue growth vs capex plans in 2017-2018.\" width=\"640\" height=\"446\" contenteditable=\"false\" data-width=\"640\" data-height=\"446\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722854070508828_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722854070508828_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722854070508828_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/59636229-17722854070508828_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">Exhibit D: Comparing Applied Optoelectronics’ revenue growth vs capex plans in 2017-2018. <span>(yCharts)</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">In<a href=\"https://seekingalpha.com/article/4149218-applied-optoelectronics-aaoi-ceo-thompson-lin-on-q4-2017-results-earnings-call-transcript\"> AOI’s Q4 CY17 call</a>, management said that the issue in their revenue miss in that year was <em>“customer specific,”</em> in response to an analyst's question around why AOI’s <em>“100 gig revenue was down.”</em> AOI had execution issues in planning and building enough capacity to meet the demand surge. This led to loss of orders, probably even losing Meta Platforms (<a href=\"https://seekingalpha.com/symbol/META\" title=\"Meta Platforms, Inc.\">META</a>) entirely as a customer.<a href=\"https://investors.ao-inc.com/static-files/0771159e-3733-47ba-baac-9a2f8051671a\" rel=\"nofollow\"> In CY17</a>, Microsoft, Amazon (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>), and Meta Platforms were AOI’s three major hyperscaler customers, accounting for ~78% of AOI’s revenue in that year.</p> <p class=\"paywall-full-content\">Over the years, only Microsoft remained as AOI’s long-time hyperscaler customer, with Amazon maintaining a cyclical business relationship with AOI. Meanwhile, Meta Platforms moved over its business entirely to peers like Lumentum.</p> <p class=\"paywall-full-content\">Per<a href=\"https://investors.ao-inc.com/node/16686/html\" rel=\"nofollow\"> AOI’s CY25 10-K</a>, Microsoft continues to be a major hyperscaler, accounting for ~29% of AOI’s revenues, while Oracle (<a href=\"https://seekingalpha.com/symbol/ORCL\" title=\"Oracle Corporation\">ORCL</a>) has also become a meaningful AOI customer, accounting for ~12% of AOI’s revenues.</p> <p class=\"paywall-full-content\">With respect to Microsoft’s contract, there is potential for execution risk to occur, which might make AOI lose out on Microsoft’s 800G program. AOI hinted that the firmware in their 800G modules for Microsoft faced glitches causing AOI to optimize firmware. This impacted the overall revenue targets of AOI’s 800G program in Q4, causing 800G sales to come under the $4-8M target range that AOI had initially projected and leading to a situation similar to CY17, where 400G module sales grew faster than the higher-margin 800G module sales. Management has said that they should be completing firmware optimization on these 800G modules for Microsoft next month. But the firefighting management had to do with updating 800G module firmware, meaning management expects very little revenue from 800G shipments in Q1 CY26, while 400G modules will account for most of the transceiver module revenues in this quarter. 800G transceiver modules are expected to ramp in Q2 CY26.</p> <p class=\"paywall-full-content\">Let me circle back to Amazon as a customer for AOI because it is a point of contention between bulls and bears. Although Amazon has not been a major customer for AOI in CY25, AOI has an active<a href=\"https://www.sec.gov/Archives/edgar/data/1158114/000168316825001580/appliedopto_ex0401.htm\" rel=\"nofollow\"> share warrant agreement</a> (issued in October ‘25) in place with Amazon that vests only after Amazon buys $4B worth of AOI’s product over the next 10 years or ~$400M per year worth of forward revenues. AOI’s revenues in CY25 were $456M, so that gives investors some perspective of the scale of the Amazon warrant in case Amazon decides to pursue the share warrant’s revenue goals. There are a few speculative short reports issued early last year stating that AOI botched its manufacturing &amp; delivery timelines with Amazon. But at the same time there are also many speculative bullish reports that use the October share warrant to explain why Amazon may ramp up purchases at AOI. Either way it's best to stay focused on management’s guidance and cross-reference that to its capex and inventory levels. But the whole point of the risks section so far is to illustrate meaningful execution risks similar to CY17-18.</p> <p class=\"paywall-full-content\">Now, outside of AOI’s hyperscaler customer segment, AOI has a deep and long relationship with Digicomm International, who acts as a system integrator on behalf of AOI. Digicomm usually integrates AOI’s optical components and products in the cable TV network domain outside the purview of AI.</p> <p class=\"paywall-full-content\">In CY25, Digicomm alone accounted for 53% of AOI’s revenues. Add Microsoft’s contribution of 28.8% and Oracle’s contribution of 12.4%, and we arrive at this fresh new perspective on AOI’s CY25 revenue base, where 94% of AOI’s revenues came from just 3 customers. The significant revenue contribution from Digicomm explains why AOI’s CATV revenues jumped 2.8x in CY25. That's a significant concentration risk not only from a very few customers but also from just one customer too.</p> <p class=\"paywall-full-content\">At the end of the call, management did provide some very interesting color on how the nature of their customer concentration may be changing in CY26 to account for 70% hyperscalers (DC end market) vs. 30% cable TV (CATV end market):</p> <blockquote class=\"paywall-full-content\"> <p><em>So if you break down the revenue, right, you just take a round number of $1 billion, right? -- subtract the $300-ish that we have in cable TV, that gives you $700 million-ish left over. Right now, I would expect that's going to be dominated by -- most of that is going to be 2 large hyperscale customers.</em></p> <p><em>And they'll probably be roughly equivalent exiting the year. We'll see how that plays out. It's pretty early to say exactly how the timing on that is going to go. But I would expect at least 2 [hyperscalers] to be sort of comparable in size, let's put it that way. And then obviously, the third one that would be smaller in scale, but still significant.</em></p> </blockquote> <p class=\"paywall-full-content\">If AOI gets it right this time, the company actually could use customer concentration to its advantage, significantly boosting potential for further upside. But it doesn’t take away the execution risk, which we saw a glimpse of in Q4 based on their module firmware issues creating a volatile situation similar to CY17-18.</p> <p class=\"paywall-full-content\">History is not fully on the side of AOI. But, this time around, I do feel encouraged by the ramp-up in capex this time, which does give me some hope that AOI might have capacity in place to meet demand this time around, giving the ‘reward’ a slight edge in AOI’s risk/reward profile, in my opinion.</p> <p class=\"paywall-full-content\">This is why I’m sticking to a bullish call on AOI but advising investors to be extra careful with their positions. Investors must invest in AOI according to their risk appetite or use hedging tools accordingly to mitigate risk.</p> <h2 class=\"paywall-full-content\">Takeaway</h2> <p class=\"paywall-full-content\">AOI’s outlook for CY26 shows just how much demand there is for laser components, products, and optical transceiver modules, especially from hyperscalers. The risks for AOI to get it wrong are meaningful, but should they get this right, unlike the CY16-CY18 years, AOI could benefit from incredible upside.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">I am bullish on AOI’s outlook for now.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1199687306/image_1199687306.jpg",
            "link": "https://seekingalpha.com/article/4876811-buy-applied-optoelectronics-but-be-very-careful",
            "pub_date": "2026-03-01 13:21:03",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4867597",
            "title": "Politics And The Markets 03/01/26",
            "description": "<p data-eci=\"true\"><span>This is the forum for daily political discussion on Seeking Alpha. A new version is published every market day.</span></p> <p>Please don't leave political comments on other articles or posts on the site.</p> <p>The comments below are not regulated with the same rigor as the rest of the site, and this is an <strong>'enter at your own risk' </strong>area as discussion can get very heated. If you can't stand the heat... you know what they say...</p> <p class=\"MsoNormal\"><b><span>More on Today's Markets:</span></b></p> <h2> </h2> <p class=\"MsoNormal\"><b><span></span></b></p> <p class=\"MsoNormal\"><b>Moderation Guidelines:</b></p> <p class=\"MsoNoSpacing\"><b><span></span></b>We remove comments under the following categories:</p> <ul> <li>Personal attacks on another user account</li> <li>Anti-Vaxxer or covid related misinformation</li> <li>Stereotyping, prejudiced or racist language about individuals or the topic under discussion.</li> <li>Inciting violence messages, encouraging hate groups and political violence.</li> </ul> <p class=\"MsoNoSpacing\">Regardless of which side of the political divide you find yourself, please be courteous and don't direct abuse at other users.</p> <p class=\"MsoNoSpacing\">For any issue with regards to comments please email us at : moderation@seekingalpha.com.</p> <p class=\"MsoNormal\"><b><span>Seeking Alpha's Disclosure:</span></b><span> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</span></p> <p class=\"MsoNoSpacing\"> </p> <div class=\"before_last_paragraph-piano-placeholder\"></div> <p class=\"MsoNormal\"><b><span></span></b></p> <div class=\"sa-art article-width paywall-full-content\" id=\"a-body\"><span class=\"content-end p p1\"></span></div>",
            "image": null,
            "link": "https://seekingalpha.com/article/4867597-politics-and-the-markets-030126",
            "pub_date": "2026-03-01 13:01:35",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876807",
            "title": "Aviva: Strategy May Continue To Deliver Strong Results (Rating Downgrade)",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2211988937/image_2211988937.jpg?io=getty-c-w630\" alt=\"Aviva Stadium Dublin\" data-id=\"2211988937\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2211988937/image_2211988937.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2211988937/image_2211988937.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2211988937/image_2211988937.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2211988937/image_2211988937.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2211988937/image_2211988937.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2211988937/image_2211988937.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2211988937/image_2211988937.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2211988937/image_2211988937.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Jacek Politowski/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>The U.K.’s largest insurer, Aviva (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/AVVIY\" title=\"Aviva plc\">AVVIY</a></span>), has a mixed performance record over the long term (and its antecedent companies predate the existence of the U.S.A., so a long-term view is possible), but it has been<span class=\"paywall-full-content\"> in clover over the past five or so years. Full-year results are due on 5 March.</span></p> <p class=\"paywall-full-content\">I last covered the name in my March 2021 <a href=\"https://seekingalpha.com/article/4412456-aviva-stock-focus-benefiting-capital-structure-not-earnings-yet\">“buy” note,</a> <em>Aviva: More Focus Is Benefiting Capital Structure, But Not Earnings Yet</em>, since when the share price has gone up 26% according to SA data (although Google Finance shows a 72% increase during that period in the sterling-denominated London-listed shares, probably reflecting a 2022 share consolidation). At that point, I saw value in the company’s swiftly executed strategic plans to focus on its core U.K. business and significantly reduce its footprint outside the British Isles, though it has hung onto its Canadian business.</p> <p class=\"paywall-full-content\">Over the past few months, Aviva has hit its highest share price since 2008. I still like the business but am now moving to a “hold” rating on valuation grounds. The streamlined, U.K.-centred strategy has continued to guide the company since I last wrote on it and, I think, is delivering positive financial results. However, I think that is reflected in the share price growth since I last wrote.</p> <h2 class=\"paywall-full-content\">Aviva’s Been Getting the Basics Right</h2> <p class=\"paywall-full-content\">I am not a fan of pinning success stories in large firms on a leader (though a single bad leader can easily damage a business), but current management under chief executive Amanda Blanc deserves credit for having led a successful increase in the firm’s fortunes (and indeed she got that in the form of a damehood, though predictably that was not merely for her business performance but for services to “business, gender equality, and net-zero”).</p> <p class=\"paywall-full-content\">The playbook here has been simple but no less powerful for it. Aviva’s home market of the U.K. is its largest, and Aviva also has a commanding position in it, as the country’s largest general insurer by far. By getting rid of many overseas distractions that lacked scale and focusing on entrenching its position in the U.K. even more, it has built a bigger moat. Those overseas sales also helped improve the balance sheet.</p> <p class=\"paywall-full-content\">The most notable move over the past few years to grow the U.K. business’s scale even more was the <a href=\"https://www.aviva.com/investors/acquisition-of-direct-line-insurance-group-plc/\" rel=\"nofollow\">acquisition</a> of local rival Direct Line (<a href=\"https://seekingalpha.com/symbol/DIISF\" title=\"Direct Line Insurance Group plc\">DIISF</a>), which was <a href=\"https://www.aviva.com/newsroom/news-releases/2025/07/aviva-completes-acquisition-of-direct-line/\" rel=\"nofollow\">completed</a> last July. That was no surprise: Direct Line had seen a number of ex-Aviva employees appointed to senior management, and it was struggling as a standalone entity after profit warnings. So far it seems that Aviva has been able to integrate it fine, although I think it will be another couple of years before we can draw a definitive conclusion on <a href=\"https://seekingalpha.com/article/4794506-selling-direct-line-after-bumpy-3-year-investment\">whether Direct Line had just been poorly run in the years before its takeover or whether underlying problems like the quality of its underwriting were to blame</a> and have persisted. My bet is on the former, but I think a longer timeframe is needed for full judgement.</p> <p class=\"paywall-full-content\">The company has 25.2 million customers, including over 21 million in the U.K. That equates to 4 in 10 adults: a very impressive number.</p> <p class=\"paywall-full-content\">The economies of scale here stem not only from having lots of customers but also from being able to cross-sell to them. At the interim results stage last year, the company noted that a record 5.5m customers have two or more policies with it. The Direct Line acquisition ought to have further helped this push for scale, alongside organic growth. Aviva estimates it will add £225m of run-rate savings in 2028 and deliver capital synergies of over half a billion pounds by the end of this year.</p> <p class=\"paywall-full-content\">This all shows through in the company’s key performance metrics, which have been coming in well. As a snapshot, here are the headlines from the company’s interim results in August.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720743680096421_origin.png\" rel=\"lightbox\" data-width=\"956\" data-height=\"223\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720743680096421_origin.png?io=w640\" alt=\"Aviva interim results financial toplines\" width=\"640\" height=\"149\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720743680096421_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720743680096421_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720743680096421_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720743680096421_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Company interim results statement</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Not only are those strong year-on-year numbers for operating profit and Solvency II operating own funds generation, but they are also markedly stronger than a few years beforehand.</p> <p class=\"paywall-full-content\">Indeed, Aviva’s performance has been strong enough for it to raise its medium-term targets in a Q3 trading statement last November.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720744042017586_origin.png\" rel=\"lightbox\" data-width=\"660\" data-height=\"275\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720744042017586_origin.png?io=w640\" alt=\"Aviva new targets\" width=\"640\" height=\"267\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720744042017586_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720744042017586_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720744042017586_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720744042017586_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>Company Q3 trading statement</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Dividend is Growing at an Attractive Pace, Though That is Set to Slow Next Year</h2> <p class=\"paywall-full-content\">Having cut its dividend per share in 2013, the company did the same in 2020, by a painful 30%.</p> <p class=\"paywall-full-content\">Since then, though, the dividend growth has been solid. In the chart below, I omit some messily timed 2020 payments to make it easier to compare recent dividends with those before the 2020 cut. The chart does not satisfactorily reflect the impact of a 2022 share consolidation, but the overall point is that the dividend per share has been growing and is now greater than it was before the cut six years ago.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720742752591286_origin.png\" rel=\"lightbox\" data-width=\"977\" data-height=\"639\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720742752591286_origin.png?io=w640\" alt=\"Aviva dividend history\" width=\"640\" height=\"419\" contenteditable=\"false\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720742752591286_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720742752591286_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720742752591286_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/25/51578875-17720742752591286_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\"><span>compiled by author using data from company website</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The current financial year saw the interim dividend raised by 10%, which reflected “our usual mid-single digit dividend increase as well as a further mid-single digit uplift following the completion of the Direct Line transaction,” and the company set the expectation of the full-year dividend following this approach.</p> <p class=\"paywall-full-content\">Further out, the expectation is for mid-single-digit growth in the cash cost of the dividend. That is not the same as mid-single-digit growth in dividend per share, and if the share base expands, the per-share dividend growth will be lower. That is not unlikely over time. The Direct Line acquisition alone led to a 14% higher share count.</p> <p class=\"paywall-full-content\">Still, I expect the company to keep growing its dividend per share at the low to mid-single-digit level each year from next year onwards.</p> <p class=\"paywall-full-content\">Currently the yield is 5.6%, which compares very favourably to the current FTSE 100 yield of 3.1%.</p> <h2 class=\"paywall-full-content\">Full-Year Results Are Due in the Coming Week</h2> <p class=\"paywall-full-content\">Aviva is set to publish its full-year results on Thursday, 5 March.</p> <p class=\"paywall-full-content\">Current management has had a tendency to surprise only on the upside, and I expect that to continue, so I am not anticipating any nasty surprises, though of course it's always a risk.</p> <p class=\"paywall-full-content\">It will be interesting to get further detail on how the Direct Line integration has bedded down, though to date the company has already been positive on that front.</p> <p class=\"paywall-full-content\">Beyond that, I will be looking to see whether Aviva has maintained its strong performance from the interim point discussed above.</p> <h2 class=\"paywall-full-content\">I’m Moving to a “Hold” on Valuation Grounds</h2> <p class=\"paywall-full-content\">But while I like the business and see ongoing potential for its performance, I think the rising share price of recent years has built that in, and accordingly, I move to a “hold” rating.</p> <p class=\"paywall-full-content\">The share price is 30 times earnings, which I see as expensive. Insurance earnings tend to move around a lot, making that metric of limited use sometimes.</p> <p class=\"paywall-full-content\">Management's guided 11% CAGR for operating EPS over the next three years could see operating EPS increase strongly if delivered successfully. Operating EPS will not necessarily translate to EPS. But even allowing for it to, that would still put the medium-term prospective P/E in the low 20s, which I still do not think offers attractive value.</p> <p class=\"paywall-full-content\">Aviva’s price-to-book ratio currently sits at around 2.2, which I do not see as cheap.</p> <p class=\"paywall-full-content\">While the company is well run, I see risks associated with its size, as, for example, presuming a standard per-customer cost impact, the scale of its customer base makes it costlier to respond to smaller rivals seeking to build market share through lower pricing than if it had fewer customers.</p> <p class=\"paywall-full-content\">One of the complaints I heard anecdotally from Direct Line customers in the couple of years prior to the takeover was that premiums had gone up substantially without any real justification in terms of claims costs, etc. The company at the time presented a different perspective, but rising policy costs seemed to hurt demand for Direct Line’s insurance products, and this remains a price-sensitive market.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2211988937/image_2211988937.jpg",
            "link": "https://seekingalpha.com/article/4876807-aviva-strategy-continues-to-deliver-strong-results-rating-downgrade",
            "pub_date": "2026-03-01 12:46:50",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876806",
            "title": "Phillips 66: Attractive As Geopolitical Tensions Surge",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2185040383/image_2185040383.jpg?io=getty-c-w630\" alt=\"Wilmington Phillips 66 Refinery\" data-id=\"2185040383\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2185040383/image_2185040383.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2185040383/image_2185040383.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2185040383/image_2185040383.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2185040383/image_2185040383.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2185040383/image_2185040383.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2185040383/image_2185040383.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2185040383/image_2185040383.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2185040383/image_2185040383.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">MattGush/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Shares of Phillips 66 (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/PSX\" title=\"Phillips 66\">PSX</a></span>) have been a solid performer over the past year, gaining about 20% as the company has benefited from an improvement in the refining environment, even as its chemicals unit struggles with<span class=\"paywall-full-content\"> weak pricing dynamics. Beyond this, investments in its refining facilities have helped to reduce operating costs and improve results. I last covered shares in </span><a href=\"https://seekingalpha.com/article/4834942-phillips-66-turnaround-gains-traction-in-q3\" class=\"paywall-full-content\">October</a><span class=\"paywall-full-content\"> when I rated the stock a “buy” given its operational improvement, and since then, shares have rallied 12%, justifying that rating. With updated financials and new geopolitical pressures, now is a good time to revisit shares.</span></p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599423776_origin.png\" rel=\"lightbox\" data-width=\"813\" data-height=\"386\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599423776_origin.png?io=w640\" alt=\"stock chart\" contenteditable=\"false\" width=\"640\" height=\"304\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599423776_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599423776_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599423776_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599423776_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Geopolitical Developments Are a Net Positive</h2> <p class=\"paywall-full-content\">Of course, whenever looking at the oil sector, geopolitics is an important consideration. Earlier this year, the US removed President Nicolas Maduro from Venezuela, which is a positive for the refining sector. Venezuela produces the cheaper, heavy crude that our refineries specialize in processing. Incremental flows from this country can provide a cheap fuel that will widen margins. Indeed, PSX is <a href=\"https://seekingalpha.com/news/4553585-phillips-66-citgo-seek-to-buy-crude-directly-from-venezuela-reuters\">working</a> to source crude directly from Venezuela to enhance margins. I view this geopolitical development as a modest positive.</p> <p class=\"paywall-full-content\">Additionally, this weekend the US and Israel launched a coordinated military strike on Iran. This operation is still developing, and the final outcome is unknown. Given years of sanctions, the US &amp; Iran have essentially no economic linkage, and Iran’s crude oil exports have been pressured. However, if this conflict spills out more broadly, it could disrupt wider Middle East supplies.</p> <p class=\"paywall-full-content\">If such spillover occurs, this conflict risks disrupting oil supplies more than refined products, which could pressure margins. Offsetting this, the Administration could make releases from the Strategic Petroleum Reserve to keep markets adequately supplied, especially as it likely will want to limit any inflationary impacts. Heightened geopolitical risk premiums may also widen crack spreads. All else equal, I expect a near-term pop in crack spreads, but I view the longer-term impacts as less clear.</p> <p class=\"paywall-full-content\">As geopolitical tensions have ramped up, we have seen crack spreads widen, passing $30 (as a reminder, this measures how much refiners make turning oil into refined products like gasoline and diesel). In late 2024, cracks dropped into the mid-teens, which created a difficult operating environment for the sector given strong throughput. Then, over 2025, we saw crack spreads steadily improve until a weakening late in the year. They have come surging back and are now over $30. As a reminder, I view ~$25 as the long-term norm, so we are in a clearly favorable environment for the sector.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599484978.png?io=w640\" alt=\"line chart\" contenteditable=\"false\" width=\"487\" height=\"184\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599484978.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599484978.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599484978.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Energy Stock Channel</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The initial crunch lower in spreads in November/December came as physical fundamentals weakened. As you can see below, gasoline inventories rose more than even the seasonal norm, going from unusually low to unusually high. In general, higher inventories should mean weaker pricing power and lower spreads. Importantly, inventories have stabilized as we approach the seasonal drawdown.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599271884.png?io=w640\" alt=\"line chart\" contenteditable=\"false\" width=\"495\" height=\"349\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599271884.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599271884.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-17722972599271884.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>EIA </span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Still, it is notable how much crack spreads have outperformed in recent weeks, largely decoupling from the physical market. This speaks to how much geopolitical risk premium has been added. With potential outages in the Middle East, markets are essentially encouraging US refiners to increase throughput. This creates a very favorable near-term dynamic for PSX and peers. That said, if geopolitical risk fades, I would expect crack spreads to narrow again into the $20-25 area.</p> <h2 class=\"paywall-full-content\">Operating Performance Has Improved</h2> <p class=\"paywall-full-content\">Now, turning to recent financial results, in the company’s <a href=\"https://investor.phillips66.com/financial-information/news-releases/news-release-details/2026/Phillips-66-Delivers-Strong-4Q-Operating-Results-While-Enhancing-Portfolio/default.aspx\" rel=\"nofollow\">fourth quarter</a>, Phillips 66 earned $2.47, which beat <a href=\"https://seekingalpha.com/news/4546938-phillips-66-non-gaap-eps-of-2_47-beats-by-0_32\">estimates</a> by $0.32. In its refining business, profits rose by ~25% sequentially to $542 million, thanks to a widening in margins to ~$12.50. This represented a solid 98% capture of market levels. It operated at 99% utilization in Q4. I expect utilization to tick down in Q1 into the lower 90% area as the company does seasonal maintenance activity, which temporarily reduces capacity. As you can see below, it has steadily improved utilization after investing in modernizing its facilities. While doing this, PSX has also reduced operating costs by about 15% to $6/barrel. These self-improvement efforts should structurally enhance margins.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297259948577.png?io=w640\" alt=\"line chart\" contenteditable=\"false\" width=\"504\" height=\"245\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297259948577.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297259948577.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297259948577.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Phillips 66</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Aside from its refining assets, PSX has developed an integrated set of midstream assets, providing takeaway capacity from major basins all the way to export markets. These cash flows are less cyclical and more fee-like in nature. They provide enough cash flow to fully cover their dividend and maintenance, with cash flow from other businesses supporting buybacks or M&amp;A. NGL transportation and fractionation volumes each hit records, passing 1mbd, and management reiterates its goal of reaching $4.5 billion in run-rate midstream EBITDA by the end of 2027. Midstream EBITDA was a solid $952 million in Q4, or $3.8 billion annualized. Given ongoing growth projects, I view its 2027 target as very attainable.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297259993479.png?io=w640\" alt=\"map\" contenteditable=\"false\" width=\"422\" height=\"519\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297259993479.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297259993479.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Phillips 66</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">PSX also has a chemicals unit that is a joint venture with Chevron (<a href=\"https://seekingalpha.com/symbol/CVX\" title=\"Chevron Corporation\">CVX</a>). While PSX has premiere, low-cost assets in the US and Middle East, the sector has faced significant challenges from structural oversupply given weak industrial demand and increased Chinese capacity. I expect challenging conditions to persist, and we need to see more supply cuts, especially from high-cost operators in Europe. The unit made just $19 million in Q4, down from $72 million last year. For the full year, profits fell by $500 million to $329 million.</p> <p class=\"paywall-full-content\">I expect the chemicals environment to be equally bad in 2026, though if housing activity improves by late in the year, that can provide a floor. Ongoing supply cuts should eventually restore pricing power, but this is a very drawn-out process. In the longer term, I believe PSX should consider divesting the unit, as I see little operational synergies, especially with the midstream business growing and providing more diversification to cash flow. That said, I do not view such an action as imminent. Given the significant macro pressures, valuation in the chemical sector is depressed, and PSX would be best to wait for a cyclical turn before considering strategic alternatives.</p> <h2 class=\"paywall-full-content\">Shares Remain Attractive</h2> <p class=\"paywall-full-content\">During the fourth quarter, PSX generated $2.8 billion of operating cash flow, aided by working capital improvements. This enabled the company to reduce debt by $2 billion, ending the year at $19.7 billion. PSX is carrying 38% net debt to capital, which is a bit more than I like to see. The company aims to get net debt down by about $3 billion over the next two years.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297260090353_origin.png\" rel=\"lightbox\" data-width=\"680\" data-height=\"567\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297260090353_origin.png?io=w640\" alt=\"table\" contenteditable=\"false\" width=\"640\" height=\"534\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297260090353_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297260090353_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297260090353_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/13071522-1772297260090353_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Phillips 66</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">I view this as attainable so long as crack spreads average over $23, though it will limit buybacks in the near term. During Q4, it repurchased $274 million of stock. Thanks to buybacks, its share count is down about 1.7% from last year; I expect slightly more buybacks this year. In <a href=\"https://seekingalpha.com/news/4550618-phillips-66-raises-quarterly-dividend-by-58-to-127share\">February</a>, Phillips 66 increased its dividend by 6%, and shares now offer a 3.3% dividend yield. I view its dividend as secure</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Overall, PSX is performing well. Its investments in refining modernization are paying off, and midstream continues to grow. Beyond this, the heightened geopolitical tensions are likely to be positive for refiners and PSX given its US-centric asset base. Back in December, I was targeting $12 of 2026 EPS and $16+ in 2027. I still view this as the central case, especially with crack spreads widening in the near term. At ~9.5x 2027 earnings, I view PSX as attractive still, though there is less upside than a few months ago. I expect shares to push to the $165-$170 area, and PSX also can help provide diversity in portfolios amid geopolitical tensions. With 8-10% upside plus a secure dividend, I remain a buy on Phillips 66.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2185040383/image_2185040383.jpg",
            "link": "https://seekingalpha.com/article/4876806-phillips-66-attractive-as-geopolitical-tensions-surge",
            "pub_date": "2026-03-01 12:36:01",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876804",
            "title": "AVLV: A Value ETF With A Distinct Sector Mix",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2215283906/image_2215283906.jpg?io=getty-c-w630\" alt=\"Value\" data-id=\"2215283906\" data-type=\"getty-image\" width=\"1536\" height=\"807\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2215283906/image_2215283906.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2215283906/image_2215283906.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2215283906/image_2215283906.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2215283906/image_2215283906.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2215283906/image_2215283906.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2215283906/image_2215283906.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2215283906/image_2215283906.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2215283906/image_2215283906.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">matdesign24/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>The Avantis US Large Cap Value ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/AVLV\" title=\"Avantis US Large Cap Value ETF\">AVLV</a></span>) is among the funds following value-oriented strategies, but with additional profitability screens that give it a more balanced portfolio, blending industrials, consumer discretionary, financial services, and technology. While the fund has still<span class=\"paywall-full-content\"> seen higher volatility than peers, its sector mix shifts since </span><a href=\"https://seekingalpha.com/article/4725386-avlv-low-valuations-risk-reward-not-as-attractive-due-to-sector-exposure\" class=\"paywall-full-content\">my last review</a><span class=\"paywall-full-content\"> in late 2024 have reduced cyclical exposure, while a heavier stance in technology is consistent with its quality, given above-average profitability in the sector. In my view, this makes AVLV better positioned going forward, as the fund is likely to continue to outperform more conservative value ETFs in a risk-on environment, given its balanced sector mix, while its disciplined valuation is expected to limit downside risk somewhat, despite relatively high historical drawdowns. The next sections will detail the fund’s holdings and compare valuation, performance, and volatility with value peers and the broader equity market.</span></p> <h2 class=\"paywall-full-content\">ETF Description &amp; Highlights</h2> <p class=\"paywall-full-content\">AVLV is an actively managed ETF that seeks exposure to companies that exhibit above-average profitability and value characteristics, without tracking any specific index.</p> <p class=\"paywall-full-content\">The stock selection process relies on portfolio managers’ research to identify companies that meet the fund’s strategy, primarily among the 1000 largest U.S. companies. To achieve this, portfolio managers take into consideration value indicators, especially book-to-price ratios, while profitability is measured through adjusted cash from operations to book, among other metrics. Once a company is selected for inclusion in the fund, it is weighted according to its market capitalization, plus a factor relative to its value and profitability metrics, so that constituents that offer more compelling metrics are overweight in the portfolio.</p> <p class=\"paywall-full-content\">As of February 21, AVLV had nearly $10.6 billion under management, invested in 261 stocks, with an average market capitalization of $111.8 billion. Although the fund has a primary focus on larger companies, the reality is that large and mega caps make up only 32.6% and 18.9% of the portfolio, while mid caps account for 35.2% and small caps 13.2%. This reflects a well-balanced market cap distribution when compared to the Russell 1000, a mid and large cap benchmark, where large and mega caps represent over 70% of the index, versus nearly AVLV’s nearly 51%. It is also worth noting that the fund had a more pronounced mid-cap bias in October 2024, as the representation of this category was 40.5% at that time compared to 35.2% now. This gap is not large, to be sure, but it suggests a shift toward large caps, where valuations are admittedly above the broader market but profitability is generally higher than in smaller companies.</p> <p class=\"paywall-full-content\">AVLV’s top ten holdings are Micron (3.26%), Exxon Mobil (3.20%), Meta (2.91%), Apple (2.78%), Caterpillar (2.68%), Amazon (2.51%), Lam Research (2.49%), Merck (2.31%), JPMorgan Chase (2.13%), and Costco (2.07%). Together, these positions account for roughly 26% of total assets, highlighting a less concentrated profile compared to the Russell 1000’s 34%, and a relatively diversified sector mix, spanning tech-driven segments, energy, industrials, healthcare, and financial services.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108406238074.png?io=w640\" alt=\"Morningstar, consolidated by the author\" contenteditable=\"false\" width=\"621\" height=\"416\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108406238074.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108406238074.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108406238074.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Morningstar, consolidated by the author</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">The table below shows a list of six value-oriented ETFs that will be referred to as the peer group for AVLV in this analysis. The first and the largest fund is the Vanguard Value Index Fund ETF (<a href=\"https://seekingalpha.com/symbol/VTV\" title=\"Vanguard Value Index Fund ETF\">VTV</a>), with roughly $150 billion in assets. VTV tracks the CRSP US Large Cap Value Index using a market-cap weighting approach. Next is the iShares Russell 1000 Value ETF (<a href=\"https://seekingalpha.com/symbol/IWD\" title=\"iShares Russell 1000 Value ETF\">IWD</a>), which follows an index that is the value version of the Russell 1000, and also applies a market-cap-weighted design. The SPDR Portfolio S&amp;P 500 Value ETF (<a href=\"https://seekingalpha.com/symbol/SPYV\" title=\"State Street SPDR Portfolio S&amp;P 500 Value ETF\">SPYV</a>) selects stocks from the S&amp;P 500 with attractive valuations and weights them by float-adjusted market cap. The Schwab U.S. Large-Cap Value ETF (<a href=\"https://seekingalpha.com/symbol/SCHV\" title=\"Schwab US Large-Cap Value ETF\">SCHV</a>) tracks the Dow Jones U.S. Large-Cap Value Total Stock Market Index, also following a capitalization-weighted structure. Meanwhile, the Vanguard Mega Cap Value ETF (<a href=\"https://seekingalpha.com/symbol/MGV\" title=\"Vanguard Mega Cap Value Index Fund ETF\">MGV</a>) focuses on the U.S. larger companies, with a heavy concentration in large (74%) and mega caps (18%). Finally, the Invesco S&amp;P 500® Pure Value ETF (<a href=\"https://seekingalpha.com/symbol/RPV\" title=\"Invesco S&amp;P 500 Pure Value ETF\">RPV</a>) favors stocks with strong value characteristics and applies a weighting methodology that reflects this stricter investment strategy, giving more weight to companies offering more compelling value.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841469536_origin.png\" rel=\"lightbox\" data-width=\"1208\" data-height=\"417\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841469536_origin.png?io=w640\" alt=\"Morningstar, consolidated by the author\" contenteditable=\"false\" width=\"640\" height=\"221\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841469536_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841469536_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841469536_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841469536_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Morningstar, consolidated by the author</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">From a sector allocation perspective, <a href=\"https://www.avantisinvestors.com/avantis-investments/avantis-us-large-cap-value-etf/#overview\" rel=\"nofollow\">AVLV</a>’s largest exposures are to industrials (16.4%) and consumer discretionary (16.2%), two areas that are not typically the most value-oriented. A second tier includes financial services (15.0%), technology (14.2%), and energy (12.9%). Further down, communication services (9.1%), consumer staples (7.9%), and healthcare (6.2%) are still relevant sectors, while the fund holds marginal positions in basic materials (1.8%), utilities (0.3%), and real estate (0.1%). Although there have been only relatively small changes in the fund’s exposure to the largest sectors compared to late 2024, holdings in technology and healthcare have increased somewhat, while the allocation to financial services, basic materials, and energy has decreased by the 1.5% to 3.0%. This suggests a slight rotation away from interest rate and commodity prices sensitive areas, while the increased weight in technology points to a more balanced value-growth profile, as this sector is typically a high-growth segment.</p> <p class=\"paywall-full-content\">Relative to the Russell 1000, though, AVLV remains most overweight in energy (+9.5%), followed by industrials (+6.8%) and consumer discretionary (+5.9%), while it is underweight in technology (-17.8%) and healthcare (-3.5%), despite the increased allocation to these sectors now.</p> <p class=\"paywall-full-content\">Breaking down AVLV’s holdings across its largest sectors, we see that in industrials, the fund owns over 40 stocks, led by railroads, through Union Pacific and CSX, while it is also overweight in logistics with positions in FedEx, UPS, and Expeditors. The fund also holds heavy equipment makers Caterpillar and Deere, along with positions in airline operators like Delta and United Airlines.</p> <p class=\"paywall-full-content\">In consumer discretionary, the fund is again broadly diversified, holding more than 40 companies. The largest position by far is Amazon, while the fund also leans into the travel and leisure segment via cruise operators Royal Caribbean and Carnival, as well as holdings in the casino and resort industry through Las Vegas Sands. The fund also owns off-price retailers TJX and Burlington, and automakers General Motors and Ford, while small positions in specialty retailers Ulta Beauty, Best Buy, and Dick’s Sporting Goods round out the fund’s exposure to the sector.</p> <p class=\"paywall-full-content\">Beyond these top three sectors, where the allocation is fairly diversified, AVLV still holds relevant positions in other sectors, mostly with a much more concentrated exposure. These include technology, where the fund’s holdings are Apple, Micron, Lam Research, Applied Materials, and NVIDIA, along with key names in energy (Exxon and ConocoPhillips), communications services (Meta, Alphabet, Verizon, and AT&amp;T) (1.50%), healthcare (Merck and Gilead), and staples (Costco).</p> <p class=\"paywall-full-content\">Given AVLV’s strategy centered on value and profitability, the portfolio has suffered only modest rotation since late 2024, despite a few changes since then, such as increased allocation to companies like Alphabet, Amazon, Micron, Merck, and American Express, offset by divestiture from Chevron, Walmart, Qualcomm, and Wells Fargo. Still, such rotations are pretty much in line with an actively managed philosophy. That said, I believe that the high profitability usually seen in big tech names is expected to serve as an anchor to keep those names in the portfolio for the foreseeable future. On the other hand, margin pressures in more cyclical segments like energy, or even rate-sensitive areas like financial services, may drive potential changes from here, which would be in line with what we have already seen over the past year or so.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841762908_origin.png\" rel=\"lightbox\" data-width=\"941\" data-height=\"542\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841762908_origin.png?io=w640\" alt=\"Morningstar, consolidated by the author\" contenteditable=\"false\" width=\"640\" height=\"369\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841762908_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841762908_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841762908_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310841762908_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Morningstar, consolidated by the author</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">AVLV is overweight in consumer discretionary (+8.4%), communication services (+4.4%), and technology (+2.3%) relative to the peer group of value ETFs. Much of that is a byproduct of the fund's large allocation to a few big tech names, such as Meta, Apple, and Amazon. The fund also overweights industrials and energy, which gives it a more cyclical exposure. On the other hand, AVLV is underweight in typical value sectors, such as healthcare (-8.3%), financial services (-5.2%), utilities (-3.9%), and consumer staples (-2.7%), as peers favor these sectors, aiming to drive their average valuation lower than the broader market. As a result, AVLV has only a moderate sector correlation in the 0.50-0.70 range with most peers. At the same time, AVLV’s sector correlation with RPV (0.29) is arguably low, driven by RPV’s stronger value screens, leading to limited exposure to technology (2.2%), along with heavier exposure to healthcare (17.0%) and consumer staples (15.3%), amplifying AVLV’s modest stance in these two areas. From here, given the low stock rotation across these funds, as we will see later, I do not see a drastic change in this picture over the coming quarters, unless there is a sharp reset in the overall market valuation, which would create new opportunistic allocations for funds seeking to maximize value in their portfolios.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108419019203_origin.png\" rel=\"lightbox\" data-width=\"1138\" data-height=\"512\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108419019203_origin.png?io=w640\" alt=\"Morningstar, consolidated by the author\" contenteditable=\"false\" width=\"640\" height=\"288\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108419019203_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108419019203_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108419019203_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108419019203_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Morningstar, consolidated by the author</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Attractive Valuation</h2> <p class=\"paywall-full-content\">AVLV’s 16.6x P/E represents roughly a 24% discount to the Russell 1000’s 22.0x. The gap is in large part driven by a sector mix that underweights a high-multiple sector like technology and has overweight positions in value areas, such as energy and consumer staples. Another core driver stems from lower valuation multiples in virtually all sectors, with discounts of over 30% in consumer discretionary, healthcare, and financial services. At the individual stock level, core contributions include Verizon (8.6x P/E), General Motors (7.9x), Merck (11.9x), and Allstate (7.0x), all trading well below the broader market average.</p> <p class=\"paywall-full-content\">The fund trails in growth. Its historical earnings growth of 4.1% falls short of the Russell 1000’s 7.9%, and its sales growth of 5.9% is also below the benchmark’s 6.9%. This softer growth profile is largely tied to sector positioning, which, much like in the valuation analysis, underweights a high-growth area like technology. In addition, positions in consumer discretionary and industrials are also a drag, due to a much lower growth profile than in the Russell 1000. Overweight positions in companies in these sectors, including UPS and Las Vegas Sands, which have seen slow-to-negative growth, help explain the fund’s softer growth profile.</p> <p class=\"paywall-full-content\">AVLV shows relatively strong profitability; However, it is not as high as the Russell 1000. Its EBITDA margin (28.3%) is about 2.3 percentage points lower than the index’s 30.6%, and the fund’s ROE (34.5%) also lags the benchmark’s 48.2% by roughly 13.7 points. AVLV’s underweight exposure to the high margins usually seen in technology does not help, of course. In addition, there is a negative contribution from lower margins in consumer staples and financial services relative to the Russell 1000. Shares of Costco (EBITDA margin 4.7% and ROE 30.3%) and Progressive (EBITDA margin 16.5% and ROE 34.2%) are good examples of a few individual holdings that contribute to lower margins compared to elevated metrics seen in the Russell 1000, thanks to the index’s heavy weights in high-margin big tech companies.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108416081693.png?io=w640\" alt=\"Morningstar and ETFs’ websites, consolidated by the author\" contenteditable=\"false\" width=\"566\" height=\"462\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108416081693.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108416081693.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108416081693.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\"><span>Morningstar and ETFs’ websites, consolidated by the author</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">Although AVLV does not exhibit a pronounced tilt toward sectors like financial services and consumer staples, its P/E remains just below most peers. This is at least in part explained by overweight exposure to energy, another typical value sector, along with stock picking across most sectors with a low P/E profile, as highlighted in the previous sections. Meanwhile, the only fund trading at a deep discount to AVLV is RPV (11.2x P/E), driven by a very limited position in technology and a heavy exposure to small and mid caps, two categories that usually trade at a discount to large and mega caps, which together account for over 85% of the fund.</p> <p class=\"paywall-full-content\">With all peers trading at a large discount to the broader market, it is fair to say that AVLV and the peer group continue to show more reasonable valuations in a market that has seen P/Es ratios above the historical average. That said, given AVLV’s modest turnover, I see the fund continuing to trade at a reasonable level and at a significant discount to the benchmark, unless a shift in sentiment leads to multiple compression in sectors like technology and consumer discretionary. If that were to happen, though, I would not be surprised to see AVLV increasing exposure to big tech names, as lower valuation multiples and consistent above-average profitability would make these companies more appealing to the fund.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108416207333_origin.png\" rel=\"lightbox\" data-width=\"1061\" data-height=\"291\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108416207333_origin.png?io=w640\" alt=\"Morningstar, consolidated by the author\" contenteditable=\"false\" width=\"640\" height=\"176\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108416207333_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108416207333_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108416207333_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108416207333_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Morningstar, consolidated by the author</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Outperforming Peers</h2> <p class=\"paywall-full-content\">With its inception in September 2021, AVLV is still a relatively new fund. However, it has already gone through different market environments, ranging from a steep selloff in 2022, due to rising interest rates, to a strong bull market in the following years, fueled by AI prospects. Overall, as expected for a value-oriented fund, it held up much better than the Russell 1000 in 2022, but it lagged in the bullish years of 2024 and 2025, due to its more conservative exposure. It is also worth noting that it is doing very well year to date, with double-digit returns, while the Russell 1000 gained only 1.3%. Still, AVLV’s 3-year total returns of 19.3% have not kept pace with the benchmark’s 21.5%, as the overall market has been predominantly in a bullish mode during this period. AVLV has outperformed its peers, though, thanks to stronger gains in 2023, 2024, and 2025, when it has been the top performer so far.</p> <p class=\"paywall-full-content\">During this time, AVLV’s volatility has been in line with the Russell 1000, with a 3-year beta of 1.00. Meanwhile, all peers have betas below 1.00, with funds like VTV and MGV exhibiting betas at 0.77 and 0.80, respectively, as peers in general have had a much more defensive sector mix, with heavier allocations to healthcare, consumer staples, and utilities. A point of concern is AVLV’s 3-year downside capture ratio of 128, which is much higher than the Russell 1000 (105) and also most peers, which have been in the 102-121 range. As we can see, MGV’s downside capture of 102 indicates that mega caps have seen more moderate declines during selloffs. On the other hand, other funds, especially RPV, have seen higher readings driven by their heavier exposure to mid and small caps, which are typically more vulnerable to declines during adverse market conditions like 2022.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108421205754_origin.png\" rel=\"lightbox\" data-width=\"1107\" data-height=\"583\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108421205754_origin.png?io=w640\" alt=\"Morningstar, consolidated by the author\" contenteditable=\"false\" width=\"640\" height=\"337\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108421205754_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108421205754_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108421205754_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-17723108421205754_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Morningstar, consolidated by the author</span></p></figcaption></figure></p> <p class=\"paywall-full-content\">With an average daily trading value of about $37.0 million, AVLV is a liquid fund, though it is still a long way from heavy-volume peers VTV and IWD, both north of $800 million a day. That helps explain AVLV’s 0.07% bid-ask spread, which can not be compared with most funds, all in the 0.01%-0.03% range. The fund’s 5% turnover is the lowest in the group, highlighting its longer-term investment horizon, though peers like VTV, SCHV, and MGV have shown turnover below 10%. Its expense rate of 0.15% is just above the peer group’s average, reflecting relatively low costs in the whole value ETF space. The fund offers a 1.25% dividend yield, which is below the peer group’s 1.93%, driven by its lighter allocation to above-average-yielding sectors, like healthcare, financial services, and utilities. AVLV’s tracking error of above 1.10% highlights its active management profile, while most peers track benchmark indexes. Finally, the fund’s 3-year Sharpe ratio of 0.83 is well above most peers, only below MGV (0.87), thanks to its outperformance, which more compensates for its higher volatility from a risk-adjusted return perspective.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310842097097_origin.png\" rel=\"lightbox\" data-width=\"996\" data-height=\"450\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310842097097_origin.png?io=w640\" alt=\"Morningstar and Seeking Alpha, consolidated by the author\" contenteditable=\"false\" width=\"640\" height=\"289\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310842097097_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310842097097_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310842097097_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49456258-1772310842097097_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Morningstar and Seeking Alpha, consolidated by the author</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Final Thoughts</h2> <p class=\"paywall-full-content\">AVLV’s core characteristic is its attempt to offer value to investors without compromising business quality. This strategy helps explain most of the fund’s profile. It holds names like Meta, Apple, and Amazon and remains reasonably diversified, blending value sectors with material allocations to industrials and technology. In the current backdrop, with mixed inflation readings, uncertainties about the impact of AI on companies across the equity market, and elevated expectations for companies’ financial results and guidance, investors appear more cautious during an earnings season that has been marked by volatile performance, especially for mega-cap stocks.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">That setup creates a balanced setup for AVLV. If the market becomes more risk-averse and P/E multiples compress, the fund’s discount can help cushion the downside, though not as much as more defensive ETFs in the peer group. On the other hand, the fund’s more balanced sector mix should support performance relative to other value funds if sentiment improves from here. That said, it is reasonable to expect the fund to achieve returns in the range of high-single digit to low-double digit over the next twelve months, assuming S&amp;P 500 earnings growth remains in the mid-teens, as forecast at the beginning of the year by the financial market. If that happens, it would be a strong opportunity for AVLV, as it would build on the strong results already recorded year to date. In conclusion, my take is that AVLV remains a good option for investors seeking balanced value exposure, without falling into deep defensive territory.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2215283906/image_2215283906.jpg",
            "link": "https://seekingalpha.com/article/4876804-avlv-a-value-etf-with-a-distinct-sector-mix",
            "pub_date": "2026-03-01 12:15:56",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4876803",
            "title": "TACK: Sensible Strategy Delivering Some Downside Protection, Yet Weaknesses Exist, A Hold",
            "description": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187254257/image_2187254257.jpg?io=getty-c-w630\" alt=\"Wall Street New York stock exchange stock market\" data-id=\"2187254257\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187254257/image_2187254257.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187254257/image_2187254257.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187254257/image_2187254257.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187254257/image_2187254257.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187254257/image_2187254257.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187254257/image_2187254257.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187254257/image_2187254257.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187254257/image_2187254257.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">alexsl/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>In my view, the Fairlead Tactical Sector ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TACK\" title=\"Fairlead Tactical Sector ETF\">TACK</a></span>), which has been doing an excellent job this year, beating the iShares Core S&amp;P 500 ETF (<a href=\"https://seekingalpha.com/symbol/IVV\" title=\"iShares Core S&amp;P 500 ETF\">IVV</a>) amid the capital rotation, is a good<span class=\"paywall-full-content\"> candidate for ETF investors' shortlist if they are on the lookout for dynamic exposures that could protect them from too deep drawdowns during periods of market softness and, at the same time, are content with rather bleak upside capture. However, my point is that TACK is a Hold. I like the concept, yet I am not impressed by the annualized and risk-adjusted returns TACK has delivered since inception in 2022 (that is, they were meaningfully lower than those of IVV).</span></p> <h2 class=\"paywall-full-content\">TACK Strategy And Portfolio</h2> <p class=\"paywall-full-content\">As described on its <a href=\"https://www.fairleadfunds.com/tack\" rel=\"nofollow\">website</a>, TACK is an actively managed ETF that \"seeks capital appreciation with limited drawdowns.\" As per the summary prospectus, Katie Stockton, CMT, is the portfolio manager.</p> <p class=\"paywall-full-content\">It is explained that</p> <blockquote class=\"paywall-full-content\"><p>TACK is a model-driven exchange-traded fund aligned with Fairlead Strategies disciplined technical methodology with a discretionary overlay reserved for market anomalies. The primary goal of the model is to leverage sector leadership, while navigating equity market downdrafts through asset allocation.</p></blockquote> <p class=\"paywall-full-content\">The core of the process is technical analysis:</p> <blockquote class=\"paywall-full-content\"><p>The basis of TACK’s model is technical analysis, with an emphasis on indicators designed to identify long-term trends and major trend reversals. Opportunities are identified using signals from a combination of technical indicators designed to identify price trends, after which a quantitative momentum overlay is applied to finalize the portfolio.</p></blockquote> <p class=\"paywall-full-content\">In other words, what I see here is a strategy designed to rotate between certain ETFs (sector ETFs as well as gold and Treasury ETFs enumerated on page 2 of the summary prospectus) and position for risk-on and risk-off scenarios. As to the portfolio composition:</p> <blockquote class=\"paywall-full-content\"><p>The Fund anticipates holding between 5 and 8 ETF positions, distributed between “risk-on” sector ETF positions of approximately equal sizes and occasional “risk-off” ETF positions of varying sizes based on the results of our technical analysis filters.</p></blockquote> <p class=\"paywall-full-content\">The following definitions are given for \"risk-on\" and \"risk-off\":</p> <blockquote class=\"paywall-full-content\"><p>A market where stocks are outperforming bonds is said to be a “risk-on” environment. When stocks are selling off and investors are favoring bonds or gold, the environment is said to be “risk-off.”</p></blockquote> <h3 class=\"paywall-full-content\">What Are TACK's Current Style Factor Exposures?</h3> <p class=\"paywall-full-content\">This is an interesting question, and to answer it, we need to look not at just the portfolio composition but at the aggregate underlying holdings (that is, amalgamate all the equities which are present in the ETFs that TACK is currently long).</p> <p class=\"paywall-full-content\">So as of February 26, we see eight sector ETFs in the TACK portfolio (so, it is quite obviously in risk-on mode now), with the State Street Energy Select Sector SPDR ETF (<a href=\"https://seekingalpha.com/symbol/XLE\" title=\"State Street Energy Select Sector SPDR ETF\">XLE</a>) being the top one. In the portfolio, there are also the BBH SWEEP Vehicle and Receivables/Payables (a 0.4% combined net weight).</p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <colgroup> <col> <col> </colgroup> <tr> <td>ETF</td> <td>Ticker</td> <td>Weight in TACK, as of February 26</td> </tr> <tr> <td>State Street Energy Select Sector SPDR ETF</td> <td>(<a href=\"https://seekingalpha.com/symbol/XLE\" title=\"State Street Energy Select Sector SPDR ETF\">XLE</a>)</td> <td>13.41%</td> </tr> <tr> <td>State Street Utilities Select Sector SPDR ETF</td> <td>(<a href=\"https://seekingalpha.com/symbol/XLU\" title=\"State Street Utilities Select Sector SPDR ETF\">XLU</a>)</td> <td>13.39%</td> </tr> <tr> <td>State Street Industrial Select Sector SPDR ETF</td> <td>(<a href=\"https://seekingalpha.com/symbol/XLI\" title=\"State Street Industrial Select Sector SPDR ETF\">XLI</a>)</td> <td>12.87%</td> </tr> <tr> <td>State Street Materials Select Sector SPDR ETF</td> <td>(<a href=\"https://seekingalpha.com/symbol/XLB\" title=\"State Street Materials Select Sector SPDR ETF\">XLB</a>)</td> <td>12.35%</td> </tr> <tr> <td>State Street Communication Services Select Sector SPDR ETF</td> <td>(<a href=\"https://seekingalpha.com/symbol/XLC\" title=\"State Street Com Svc Sel Sec SPDR ETF\">XLC</a>)</td> <td>12.15%</td> </tr> <tr> <td>State Street Health Care Select Sector SPDR ETF</td> <td>(<a href=\"https://seekingalpha.com/symbol/XLV\" title=\"State Street Health Care Select Sector SPDR ETF\">XLV</a>)</td> <td>11.99%</td> </tr> <tr> <td>State Street Technology Select Sector SPDR ETF</td> <td>(<a href=\"https://seekingalpha.com/symbol/XLK\" title=\"State Street Technology Select Sector SPDR ETF\">XLK</a>)</td> <td>11.86%</td> </tr> <tr> <td>State Street Consumer Discretionary Select Sector SPDR ETF</td> <td>(<a href=\"https://seekingalpha.com/symbol/XLY\" title=\"State Street Cons Disc Sel Sect SPDR Income ETF\">XLY</a>)</td> <td>11.57%</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\"><em>Data from TACK</em></p> <p class=\"paywall-full-content\">Sectors TACK ignores are financials, consumer staples, and real estate.</p> <p class=\"paywall-full-content\">Next, below are the top five stocks TACK has exposure to via the ETFs:</p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <colgroup> <col> <col span=\"2\"> <col> <col> </colgroup> <tr> <td>Company</td> <td>Ticker</td> <td><strong>Weight in TACK, as of February 26 (approximate)</strong></td> <td>Weight in IVV, as of February 26</td> <td>Sector</td> <td>Market Cap, $ Billion</td> </tr> <tr> <td>Exxon Mobil Corporation</td> <td>(<a href=\"https://seekingalpha.com/symbol/XOM\" title=\"Exxon Mobil Corporation\">XOM</a>)</td> <td><strong>3.19%</strong></td> <td>1.06%</td> <td>Energy</td> <td>618.93</td> </tr> <tr> <td>Amazon.com, Inc.</td> <td>(<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>)</td> <td><strong>2.44%</strong></td> <td>3.42%</td> <td>Consumer Discretionary</td> <td>2,232.00</td> </tr> <tr> <td>Meta Platforms, Inc.</td> <td>(<a href=\"https://seekingalpha.com/symbol/META\" title=\"Meta Platforms, Inc.\">META</a>)</td> <td><strong>2.42%</strong></td> <td>2.42%</td> <td>Communication</td> <td>1,661.94</td> </tr> <tr> <td>Chevron Corporation</td> <td>(<a href=\"https://seekingalpha.com/symbol/CVX\" title=\"Chevron Corporation\">CVX</a>)</td> <td><strong>2.32%</strong></td> <td>0.59%</td> <td>Energy</td> <td>367.47</td> </tr> <tr> <td>Tesla, Inc.</td> <td>(<a href=\"https://seekingalpha.com/symbol/TSLA\" title=\"Tesla, Inc.\">TSLA</a>)</td> <td><strong>2.22%</strong></td> <td>1.94%</td> <td>Consumer Discretionary</td> <td>1,533.17</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\"><em>Created by the author using data from the ETFs and Seeking Alpha. Please keep in mind that the stocks' weights in the TACK portfolio are approximate and were calculated by multiplying their weight in a respective ETF portfolio by this ETF's weight in TACK. For XOM, the formula is 0.1340864 multiplied by 0.23811213, to be precise.</em></p> <p class=\"paywall-full-content\">So how is its factor story different from IVV's? I would like to provide the following table that encapsulates the essentials.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/27/49647006-17722474638092208.png?io=w640\" alt=\"TACK and IVV comparison\" contenteditable=\"false\" width=\"601\" height=\"536\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/27/49647006-17722474638092208.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/27/49647006-17722474638092208.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/27/49647006-17722474638092208.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">Financial data as of February 27 <span>(Calculated by the author using data from Seeking Alpha and the ETFs)</span></p></figcaption></figure></p> <ul class=\"paywall-full-content\"> <li>TACK's aggregate underlying holdings have around 79.9% weight in IVV, as per my calculations. However, this is just the top of the iceberg as weights of individual stocks are different considerably. For example, the trillion-dollar league has just 14.6% weight in TACK but 36.8% in IVV, in part because the Fairlead ETF currently ignores the financial sector, hence, it has no exposure to Berkshire Hathaway Inc. (<a href=\"https://seekingalpha.com/symbol/BRK.B\" title=\"Berkshire Hathaway Inc.\">BRK.B</a>). So, its 2.4x lower weighted average market cap is the direct consequence of that.</li> <li>Next, I see a considerable value tilt, which is assisted by softer growth characteristics, and slightly weaker quality (not critically, of course, as its allocation to stocks with a B- Quant Profitability grade or higher is only 2.5% weaker than IVV's).</li> <li>Ultimately, TACK has notably larger exposure to low-beta stocks (the weighted average 24-month beta is just 0.86), thanks to its considerable allocation to XLU (while utilities account for only about 2.4% of the IVV portfolio).</li> </ul> <h3 class=\"paywall-full-content\">TACK Performance</h3> <h3 class=\"paywall-full-content\">Advantages</h3> <p class=\"paywall-full-content\">First and foremost, TACK has significantly outperformed the iShares Core S&amp;P 500 ETF since the beginning of 2026, which is an achievement worth appreciating given the challenging environment.</p> <p class=\"paywall-full-content\"><figure class=\"sa-widget sa-ycharts paywall-full-content\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/saupload_7b846c00a6357a09bc10f389f61ef9ad.png?io=w640\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/saupload_7b846c00a6357a09bc10f389f61ef9ad.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/saupload_7b846c00a6357a09bc10f389f61ef9ad.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/saupload_7b846c00a6357a09bc10f389f61ef9ad.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content\">Another advantage of TACK is that it does deliver downside protection, though not a perfect one. More specifically, in the fact sheet (as of December 31, 2025), TACK compares its returns to those of the Russell 1000 Equal Weight Index. This index is tracked by the Invesco Russell 1000 Equal Weight ETF (<a href=\"https://seekingalpha.com/symbol/EQAL\" title=\"Invesco Russell 1000 Equal Weight ETF\">EQAL</a>), which I have <a href=\"https://seekingalpha.com/article/4874232-eqal-long-term-issues-outweigh-recent-outperformance\">covered</a> recently, with a Hold rating assigned.</p> <p class=\"paywall-full-content\">Now let us look at the data for the April 2022–January 2026 period. In the first case, EQAL is selected as a benchmark.</p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <colgroup> <col> <col span=\"2\"> </colgroup> <tr> <td>Metric</td> <td><strong>TACK</strong></td> <td>EQAL</td> </tr> <tr> <td>Upside Capture Ratio (%)</td> <td><strong>55.85</strong></td> <td>100</td> </tr> <tr> <td>Downside Capture Ratio (%)</td> <td><strong>49.48</strong></td> <td>100</td> </tr> <tr> <td>Maximum Drawdown (%)</td> <td><strong>-11.30</strong></td> <td>-19.70</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\"><em>Created by the author using data from Portfolio Visualizer</em></p> <p class=\"paywall-full-content\">In the second case, I used IVV as a benchmark. And here, TACK's result looks decent again. As we can see, it captured just 61.8% of IVV's downside. I should also add that its maximum drawdown over the period was -11.30%, which looks much more comfortable than IVV's -20.28%.</p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <tr> <td>Metric</td> <td><strong>TACK</strong></td> <td>IVV</td> </tr> <tr> <td>Upside Capture Ratio (%)</td> <td><strong>55.71</strong></td> <td>100</td> </tr> <tr> <td>Downside Capture Ratio (%)</td> <td><strong>61.8</strong></td> <td>100</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\"><em>Created by the author using data from Portfolio Visualizer</em></p> <h3 class=\"paywall-full-content\">Vulnerabilities</h3> <p class=\"paywall-full-content\">The principal vulnerability which I believe TACK has is that it cannot capture a sufficient share of the market's upside (which I usually proxy with an S&amp;P 500 ETF), which, in turn, translates not only into rather soft annualized return but also into unimpressive risk-adjusted returns.</p> <p class=\"paywall-full-content\">More specifically, since its inception in March 2022, TACK has significantly underperformed IVV. It has also trailed EQAL, though, in fairness, it should be noted that EQAL has raced ahead of it just recently.</p> <p class=\"paywall-full-content\"><figure class=\"sa-widget sa-ycharts paywall-full-content\"><img src=\"https://static.seekingalpha.com/uploads/2026/2/28/saupload_9185aad98797ed8045fbf8e02d5bb79f.png?io=w640\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/saupload_9185aad98797ed8045fbf8e02d5bb79f.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/saupload_9185aad98797ed8045fbf8e02d5bb79f.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/saupload_9185aad98797ed8045fbf8e02d5bb79f.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content\">Next, over the April 2022–January 2026, TACK delivered risk-adjusted returns (i.e., the Sharpe and Sortino ratios) that were also not particularly impressive compared to those of IVV, although they were stronger than EQAL's.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2026/2/28/49647006-17723124812553165.png?io=w640\" alt=\"TACK, EQAL, and IVV comparison\" contenteditable=\"false\" width=\"493\" height=\"342\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2026/2/28/49647006-17723124812553165.png?io=w480 480w,https://static.seekingalpha.com/uploads/2026/2/28/49647006-17723124812553165.png?io=w320 320w,https://static.seekingalpha.com/uploads/2026/2/28/49647006-17723124812553165.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"> </picture><figcaption><p class=\"item-caption\">IVV was selected as a benchmark by the author <span>(Created by the author using data from Portfolio Visualizer)</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content\">Bottom Line</h2> <p class=\"paywall-full-content\">In sum, TACK delivers precisely what is promised: \"capital appreciation with limited drawdowns.\" I find the strategy perfectly sensible, and I mostly like how the fund is currently positioned (that is, I would not construct an argument against it).</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">Still, to me, upside capture is critical, and TACK does not deliver on that front. So, investors who are focused on minimizing drawdowns and are content with the upside capture ratio in the 50s, should shortlist the fund as a possible satellite holding. They should keep in mind that it comes with a rather high <a href=\"https://seekingalpha.com/symbol/TACK/expenses\">expense ratio of 70 bps</a>, which is a significant detractor from total returns. Besides, the median bid/ask spread of 0.1279% (as of February 27) is rather wide. Also, while AUM is considerable at $278.9 million, it is not particularly large, even though the fund has almost four years in the books. All in all, my rating on TACK is Hold.</p>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187254257/image_2187254257.jpg",
            "link": "https://seekingalpha.com/article/4876803-tack-sensible-strategy-delivering-some-downside-protection-yet-weaknesses-exist-a-hold",
            "pub_date": "2026-03-01 12:01:53",
            "source": "seekalpha_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}