{
    "data": [
        {
            "id": "4558923",
            "title": "Calumet targets MaxSAF 150 expansion and $1–$2/gallon SAF contract premiums as operational gains drive leverage reduction",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Calumet, Inc. (CLMT) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Louis Borgmann described 2025 as “a defining high-impact year,” noting that Calumet achieved several strategic milestones, including consistent free cash flow generation in Specialties, proving Montana Renewables’ financial resilience, closing the DOE loan for Montana Renewables, and materially deleveraging the balance sheet. Borgmann stated, “For full year 2025, we delivered $293 million of adjusted EBITDA with tax attributes, nearly a 30% increase year-over-year. We reduced restricted debt by more than $220 million. Net recourse leverage improved from 8.2x to 4.9x.”</li>\n<li>Borgmann highlighted structural improvements: “Fixed costs were down over $40 million. Water treatment costs at Montana Renewables were down over $20 million as were our crude transportation costs in the Specialties business… capital spending was also reduced by roughly $20 million. At the same time, our ops team increased production by roughly 1.3 million barrels on the year.”</li>\n<li>He reported record levels of production in Specialty Products &amp; Solutions, with specialty sales volumes exceeding 20,000 barrels per day throughout every quarter. “Our commercial engine more than kept up as we sustained material margins above historic norms despite softer macro conditions.”</li>\n<li>On Montana Renewables, Borgmann cited a 60% improvement in operating costs over two years and the completion of multiyear SAF contracts at a $1–$2 per gallon premium over renewable diesel. “These contracts are all multiyear… opening up premium renewable markets globally that complement the strong local markets we serve.”</li>\n<li>The MaxSAF 150 expansion project is set to bring 120 million to 150 million gallons of annual SAF capacity online, with the turnaround and project beginning next week and completion targeted for late April.</li>\n<li>CFO David Lunin reported, “We generated $69.3 million of adjusted EBITDA with tax attributes in the quarter and $293.3 million for the full year 2025. Each segment contributed meaningfully to our financial results.” He announced 2026 capital expenditures guidance of $115 million to $145 million, citing a heavy turnaround year, and forecasted increased production year-over-year.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management expects continued cost and reliability improvements in 2026, even with significant turnarounds. Borgmann stated, “We expect for that to continue in 2026 despite what's going to be a very heavy turnaround year.”</li>\n<li>For Montana Renewables, objectives are to “execute MaxSAF 150 safely, on time and on budget in the second quarter; continue improving our already strong cost levels; and… leverage our early mover advantage in SAF as we grow.”</li>\n<li>The company anticipates a “step change financial improvement even in past trough market conditions” as new contracts ramp up and regulatory tailwinds from RVO emerge.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Adjusted EBITDA for Q4 2025 was $69.3 million; full-year adjusted EBITDA reached $293.3 million.</li>\n<li>Specialty Products &amp; Solutions reported $88.5 million adjusted EBITDA for the quarter and $291.8 million for the year, maintaining margins over $60 per barrel and five consecutive quarters of volume above 20,000 barrels per day.</li>\n<li>Performance Brands posted $5.4 million adjusted EBITDA for the quarter and $47.9 million for the year, overcoming the Royal Purple Industrial divestiture.</li>\n<li>Montana Renewables segment posted a Q4 adjusted EBITDA with tax attributes of negative $5.4 million, but $31.3 million for the full year, impacted by transaction costs related to PTC sales. Monetization of production tax credits is expected to normalize going forward.</li>\n<li>Capital expenditures for 2026 are projected at $115 million to $145 million, up due to major scheduled maintenance, but production is still expected to increase.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Alexa Petrick, Goldman Sachs: Asked about macro setup and operational gating items for MaxSAF. Bruce Fleming responded, “The global energy transition is a regulated market… if you want to survive in that environment, be a low-cost provider, be well positioned, be able to shift gears quickly, and we think we are all 3.”</li>\n<li>Conor Fitzpatrick, BofA Securities: Inquired about RINs market and Montana Renewables margin capture. Fleming said, “We capture more than 100% of the renewable diesel index margin… the fourth quarter managed to hit the lowest renewable diesel index margin ever recorded in the history of the world.”</li>\n<li>Sameer Joshi, H.C. Wainwright: Asked about the timing and cost impact of MaxSAF ramp-up and SAF contract premiums. Borgmann replied, “We expect just continued incremental improvement there… as we increase our volume, then we'll see more unit efficiencies drop to the bottom line.” Fleming clarified that SAF contracts are structured for resilience and diversity, with linked feedstock contracts.</li>\n<li>Jason Gabelman, TD Cowen: Queried about sustainability of specialty margins and Performance Brands weakness. Scott Obermeier stated, “Our commercial excellence focus and the initiatives that we've done over the years… has proven to be highly successful, highly durable through really almost any type of market.”</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on clarity regarding regulatory developments, margin sustainability, and the ramp-up of new contracts—tone was neutral to slightly positive, with interest in operational details and financial resilience in the face of macro uncertainty.</li>\n<li>Management maintained a confident and constructive tone, repeatedly emphasizing “step change” improvements and cost discipline. Borgmann’s and Fleming’s responses were detailed and assertive, offering reassurance about execution and risk management.</li>\n<li>Compared to the previous quarter, management’s tone remained optimistic but more focused on the successful delivery of stated milestones and forward-looking growth via new contracts and expansion projects. Analysts’ tone remained consistent, with questions reflecting ongoing interest in regulatory clarity and operational execution.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance language shifted from anticipation of regulatory clarity and project progress in Q3 to confirmation of milestone achievement and new contract completions in Q4.</li>\n<li>Strategic focus moved from cost reductions and project de-risking to executing the MaxSAF 150 expansion and delivering contracted SAF volumes at premium margins.</li>\n<li>Analysts’ questions in both quarters centered on regulatory factors, margin capture, and contract placement, but the Q4 discussion reflected increased confidence in operational execution and contract fulfillment.</li>\n<li>Key metrics show continued reduction in leverage, higher adjusted EBITDA, and ongoing cost discipline. Management’s confidence remained high, now backed by successful execution rather than projections.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management acknowledged ongoing regulatory uncertainty in global energy markets but emphasized a robust framework and readiness to adapt quickly to policy changes.</li>\n<li>Heavy scheduled maintenance in 2026 introduces operational risk, but management expressed preparedness and expects production to increase despite this.</li>\n<li>Transaction costs related to PTC monetization impacted Montana Renewables’ quarterly results but are expected to normalize.</li>\n<li>Analysts raised concerns about the pace of industry utilization increases, potential margin volatility, and the durability of contract premiums, but management asserted confidence in their diversified contract portfolio and cost-positioning.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Calumet enters 2026 with a fundamentally stronger balance sheet, durable cost and reliability improvements, and clear momentum in both Specialty and Renewables segments. The MaxSAF 150 project is on track to deliver 120 million to 150 million gallons of annual SAF capacity, supported by multiyear contracts at a $1–$2 per gallon premium. Management remains focused on operational excellence, prudent capital allocation, and leveraging early mover advantages in renewables to drive long-term value creation and further deleveraging.</p>\n<p><a href=\"https://seekingalpha.com/symbol/clmt/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558923-calumet-targets-maxsaf-150-expansion-and-1-2-gallon-saf-contract-premiums-as-operational",
            "pub_date": "2026-02-28 06:21:25",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558922",
            "title": "Trump Media & Technology Group reports FY25 results",
            "description": "<html><body><ul>\n<li>Trump Media &amp; Technology Group <a href=\"https://seekingalpha.com/pr/20418159-trump-media-and-technology-group-reports-full-year-2025-results\">press release</a>  (DJT): FY Revenue of $3.7M.</li>\n<li>For 2025, TMTG had a $712.3 million consolidated net loss, most of which comprised unrealized losses stemming from a drop in the price of digital assets and digital asset related securities. This included non-cash losses related to changes in the fair value of digital assets and digital assets pledged ($403.2 million) and non-cash losses stemming from the fair value mark to market of digital asset related securities ($178.8 million). The figure also includes $59.2 million in non-cash stock-based compensation and $27.0 million in non-cash interest expense on outstanding debt, leading to consolidated adjusted EBITDA loss of $664.4 million.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558922-trump-media-technology-group-reports-fy25-results",
            "pub_date": "2026-02-28 06:11:28",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558918",
            "title": "Defence Therapeutics to raise up to $11 million in private placement",
            "description": "<html><body><ul>\n<li>Defence Therapeutics (CSE: DTC) (<span class=\"ticker-hover-wrapper\">OTCQB: <span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DTCFF\" title=\"Defence Therapeutics Inc.\">DTCFF</a></span></span>) on Friday said that it plans to raise up to $11 million through a private placement of up to 20 million units priced at $0.55 each.</li>\n<li>Each unit will consist of one common share and one warrant exercisable at $0.65 per share for 24 months.</li>\n<li>The company said it had signed a binding term sheet with two institutional investors for gross proceeds of C$6 million under the offering.</li>\n<li>Proceeds from that portion will be released in monthly cash tranches of C$333,333 over an 18-month term under a sharing agreement, with settlements beginning five months after closing.</li>\n<li>The final amount received under the sharing agreement could be more or less than C$6 million depending on the company’s share price, it said.</li>\n<li>Defence said it intends to use the proceeds to advance its antibody drug conjugate and radiopharmaceutical programs, develop partnerships and for working capital.</li>\n<li>Closing of the offering is expected on or about March 6, subject to approval by the Canadian Securities Exchange.</li>\n<li>DTCFF closed <span>-0.0%</span> at $0.44.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20418154-defence-therapeutics-announces-private-placement-of-units-for-proceeds-of-up-to-11-million\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558918-defence-therapeutics-to-raise-up-to-11-million-in-private-placement",
            "pub_date": "2026-02-28 06:11:28",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558914",
            "title": "Sunstone Hotel Investors outlines 2026 RevPAR and FFO growth targets while maintaining disciplined capital allocation",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Sunstone Hotel Investors (SHO) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li><p>Bryan Giglia, CEO, highlighted that “Despite the various headwinds that impacted our industry in 2025, our portfolio finished the year on a high note with fourth quarter operating results that exceeded our expectations, driven by broad-based strength across the portfolio.” He pointed to accomplishments in capital recycling, portfolio investment, and returning capital to shareholders, citing the sale of the Hilton New Orleans and the debut of Andaz Miami Beach as strategic moves. Giglia stated, “We returned more than $170 million of capital to our shareholders through a well-covered dividend and accretive share repurchases.” He underscored strong resort performance, especially at Wailea Beach Resort and Andaz Miami Beach, and noted ongoing cost control efforts that led to comparable portfolio margin growth despite inflationary pressures.</p></li>\n<li><p>Robert Springer, President and Chief Investment Officer, offered detail on capital investment, noting, “2025 was a busy year for us on the operations and investment front. We debuted Andaz Miami Beach in the second quarter and the fully renovated resort looks great and is gaining traction.” He reported encouraging early 2026 performance, with Andaz Miami Beach posting a year-to-date RevPAR of nearly $475.</p></li>\n<li><p>Aaron Reyes, CFO, reported, “Adjusted EBITDAre in the fourth quarter of $57 million and adjusted FFO of $0.20 per diluted share.” Reyes emphasized the company’s balance sheet strength, stating, “As of the end of the quarter and pro forma for the January payoff, we had over $200 million of total cash and cash equivalents...over $700 million of total liquidity.” He also shared that the Board of Directors reauthorized the repurchase program up to $500 million and declared a $0.09 per share common dividend for Q1 2026.</p></li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li><p>The company expects rooms RevPAR for all hotels to increase between 4% and 7% for 2026, reaching a range of $234 to $241, with Andaz Miami Beach contributing approximately 400 basis points at the midpoint. Total RevPAR is projected to increase between 3.5% and 6.5%, implying a range of $385 to $396. Reyes stated, “This revenue growth is expected to translate into adjusted EBITDAre in the range of $225 million to $250 million.” FFO per diluted share is expected to range from $0.81 to $0.94 for 2026.</p></li>\n<li><p>The company anticipates first-quarter RevPAR and total RevPAR growth above the high end of the full-year ranges, driven by the Andaz contribution and improved performance in Maui. Subsequent quarters are expected to be between the lower end and midpoint of the ranges. The outlook does not incorporate any benefit from additional common stock buybacks.</p></li>\n</ul>\n<h3>Financial Results</h3>\n<ul><li>Adjusted EBITDAre for the fourth quarter was $57 million and adjusted FFO was $0.20 per diluted share. Rooms RevPAR grew 9.6% in the quarter, including a 540 basis point benefit from Andaz Miami Beach, and total RevPAR grew 12.5%, with Andaz contributing 510 basis points. Resorts, led by Wailea Beach Resort and Montage Healdsburg, delivered the strongest results, while cost controls led to portfolio margin growth of 40 basis points on total RevPAR growth of 3.5% for the year. The balance sheet remains robust, and the company addressed all debt maturities through 2028.</li></ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li><p>Cooper Clark, Wells Fargo: Asked about the 1.5% midpoint of '26 RevPAR growth ex-Andaz and expense growth. Giglia responded that “Maui is a market where we are seeing growth...transient pace is up about 53%,” but noted caution in D.C. due to prior headwinds. On expenses, Giglia said, “We're right around 3% total,” with labor in the 3% range and energy prices up, while Reyes added that “expense growth is in that kind of that 3-ish percent or so area” for the comparable portfolio.</p></li>\n<li><p>Duane Pfennigwerth, Evercore ISI: Asked about asset sales and the Wine Country marketing process. Giglia replied, “We’re going to look to realize private market values for...hotels and resorts that we have, where we see the biggest gap between the public and private market values.”</p></li>\n<li><p>Bennett Rose, Citi: Inquired about the relationship between total RevPAR and RevPAR outlook, and transient weakness in San Diego. Giglia explained that group side displacement and slower group pace in D.C. and San Diego impacted ancillary spend but noted “positive signs as the year goes on right now in San Diego on the transient side.”</p></li>\n<li><p>Michael Bellisario, Baird: Asked about mechanisms for taking out Ohana preferred and Miami EBITDA expectations. Reyes confirmed the Series G preferred is callable at the company's discretion and noted the preferred dividend is expected to be stable year on year. Giglia said Miami EBITDA expectations are “consistent with where we were before...low to mid-teens EBITDA this year.”</p></li>\n<li><p>Chris Woronka, Deutsche Bank: Asked about operational impacts from any Wine Country sale process and San Francisco area Hyatt margin improvement. Giglia affirmed strong group pace (+22%) at Four Seasons and rising transient pace at Montage (+25%) and expects ongoing margin improvement at the Hyatt given market recovery and recent renovations.</p></li>\n<li><p>Michael Harris (for Dan Politzer), JPMorgan: Asked about macro events affecting guidance and CapEx timing. Giglia cited cautious expectations for D.C. given potential government disruptions but noted positives from America 250 celebrations and stronger transient demand. CapEx will be front-loaded, with the largest chunk in Q1 and Q2, mainly for San Diego meeting space.</p></li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li><p>Analysts focused on clarity regarding RevPAR growth, expense guidance, capital recycling, and operational impacts from asset sales, with a generally neutral to slightly positive tone, pressing for details on margin sustainability and market recovery.</p></li>\n<li><p>Management’s sentiment was cautiously optimistic in prepared remarks and measured during Q&amp;A. Giglia and Reyes repeatedly emphasized caution—“we are cautious”—but highlighted positive trends and strong early 2026 results.</p></li>\n<li><p>Compared to the previous quarter, management’s tone has shifted from defensive regarding industry headwinds and strategic options to more balanced optimism, while analysts continue to probe for underlying risks and sustainability of recovery.</p></li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li><p>Guidance language has become more specific, with explicit RevPAR and FFO targets for 2026, versus the prior quarter’s focus on maintaining outlook amid uncertainty.</p></li>\n<li><p>Strategic priorities remain on capital recycling, portfolio investment, and shareholder returns, but there is increased emphasis on asset sales and disciplined capital allocation.</p></li>\n<li><p>Analysts in both quarters focused on RevPAR outlook, asset transactions, and margin dynamics, but the current quarter saw more questions on operating leverage and cost control.</p></li>\n<li><p>Management’s confidence in Andaz Miami Beach and recovery in key markets has increased, while acknowledging persistent headwinds in D.C. and San Diego.</p></li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li><p>Management noted headwinds from softer transient demand in San Diego and uncertainty in D.C., with possible impacts from government shutdowns and spending cuts. Giglia stated, “We are excited about our prospects this year. And if costs remain controlled and some of these events produce more than our modest expectations, we could be positioned to see performance accelerate as the year progresses.”</p></li>\n<li><p>Analysts raised concerns about expense growth, margin sustainability, asset sale impacts, and market demand normalization, particularly in D.C., Maui, and San Diego.</p></li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Sunstone Hotel Investors’ management underscored a strong finish to 2025 with robust resort performance and cost controls, projecting 2026 RevPAR growth of 4%–7% and FFO per diluted share between $0.81 and $0.94. The company remains focused on disciplined capital recycling, executing value-creating investments, and maintaining liquidity, while balancing optimism for market recovery with caution regarding persistent headwinds in certain markets and external macro uncertainties.</p>\n<p><a href=\"https://seekingalpha.com/symbol/sho/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558914-sunstone-hotel-investors-outlines-2026-revpar-and-ffo-growth-targets-while-maintaining",
            "pub_date": "2026-02-28 06:06:04",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558903",
            "title": "Trump calls for re-adjudication of SCOTUS ruling in social media post",
            "description": "<html><body><p data-eci=\"true\">U.S. President Donald Trump on Friday called for a re-adjudication of the Supreme Court's decision striking down his tariffs in a social media post.</p>\n<p>Last week, SCOTUS <a href=\"https://seekingalpha.com/news/4554697-us-supreme-court-strikes-down-trumps-global-tariffs\" target=\"_blank\" title=\"ruled\">ruled</a> in a 6-3 decision to strike down the tariffs. The ruling found that Trump did not have the authority to impose tariffs under the International Emergency Economic Powers Act.</p>\n<p>The court's decision raised concerns over whether importers will get refunds for duties already paid.</p>\n<p>Notably, Hasbro (<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a>) was reportedly <a href=\"https://seekingalpha.com/news/4558884-hasbro-sues-us-government-to-recover-tariff-costs\" target=\"_blank\" title=\"seeking to\">seeking to</a> recover tariffs that were paid to the U.S. government under the International Emergency Economic Powers Act following last week's decision.</p>\n<p>The toymaker was said to be the latest in a wave of companies trying to recover the billions of dollars that were collected between April 2025 and February 2026.</p>\n<p>\"The recent Decision of the United States Supreme Court concerning TARIFFS could allow for Hundreds of Billions of Dollars to be returned to Countries and Companies that have been 'ripping off' the United States of America for many years, <span>and now, according to this Decision, could actually continue to do so, at an even increased level,</span>\" said Trump in a Truth Social post.</p>\n<p>\"<span>It doesn’t make sense that Countries and Companies that took advantage of us for decades, receiving Billions and Billions of Dollars that they should not have been allowed to receive, would now be entitled to an undeserved 'windfall,' the likes of which the World has never seen before, as a result of this highly disappointing, to say the least, ruling,\" said the post.</span></p>\n<p><span>\"Is a Rehearing or Readjudication of this case possible???\" asked Trump in the post.</span></p>\n<p><span><strong id=\"docs-internal-guid-f9daf5ee-7fff-1ce7-21c1-b78105c3bbe0\">Dear readers<span>: </span></strong><span>We recognize that politics often intersects with the financial news of the day, so we invite you to </span><a href=\"https://seekingalpha.com/article/4867595-politics-and-the-markets-022726\" target=\"_blank\" title=\"click here\">click here</a><span> to join the separate political discussion.</span></span></p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558903-trump-calls-for-re-adjudication-of-scotus-ruling-in-social-media-post",
            "pub_date": "2026-02-28 05:51:20",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558912",
            "title": "InTEST outlines $125M–$130M 2026 revenue target amid backlog growth and diversification strategy",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: inTEST Corporation (INTT) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li><p>Nick Grant, President and CEO, described Q4 as “a strong finish to a challenging year,” highlighting that “orders once again exceeded $37 million,” and revenue reached $32.8 million, above guidance. Grant emphasized a “healthy year-end backlog of $53.9 million, representing a 36% increase over year-end 2024.” He credited diversification and new product launches, particularly from Alfamation and Acculogic, for driving top-line growth and advancing the company toward its Vision 2030 goal of 25% revenue from new products. Grant also noted, “With nearly 80% of fourth quarter revenue derived from non-semi end markets and momentum in new product sales contributing meaningfully to revenue and gross margin, we believe our strategy is working.”</p></li>\n<li><p>Duncan Gilmour, CFO, stated, “Revenue in Q4 increased $6.6 million or 25% from $26.2 million in Q3 to $32.8 million,” attributing gains to industrial, defense/aerospace, life sciences, and auto EV segments, partially offset by a decline in semi. Gilmour further explained, “Gross margin expanded 350 basis points sequentially from 41.9% in Q3 2025 to 45.4% in Q4 2025,” driven by higher sales of new Alfamation products. He added, “For the fourth quarter, net income was $1.2 million. Adjusted EBITDA was $3.2 million, representing an adjusted EBITDA margin of 9.7%.”</p></li>\n</ul>\n<h3>Outlook</h3>\n<ul><li>Management resumed offering full-year guidance, projecting 2026 revenue of $125 million to $130 million, “at the midpoint, this represents growth of approximately 12% over 2025's $113.8 million,” according to Gilmour. Q1 2026 revenue is expected to be $31 million to $33 million, with gross margin at approximately 44%. Full-year 2026 gross margin is forecasted at approximately 45%. Operating expenses are projected at $53 million to $55 million, amortization at $2.6 million, and capital expenditures at 1% to 2% of revenue. Gilmour specified, “Our guidance does not contemplate any material impact, positive or negative, from changes in tariff policy or the broader geopolitical environment.”</li></ul>\n<h3>Financial Results</h3>\n<ul><li>Revenue for Q4 2025 was $32.8 million, up from $26.2 million in Q3. Backlog at year-end was $53.9 million, up 9% sequentially and 36% year-over-year. Gross margin was 45.4%, a sequential increase of 350 basis points and a year-over-year increase of 570 basis points. Operating expenses were $13.6 million. Net income for Q4 was $1.2 million or $0.10 per diluted share, with adjusted EPS at $0.16. For full year 2025, there was a net loss of $2.5 million or $0.21 per share. Adjusted EBITDA for Q4 was $3.2 million, up from $0.4 million in Q3. Total debt at year-end was $7.5 million, and liquidity was approximately $58 million.</li></ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li><p>Maxwell Michaelis, Lake Street Capital Markets: Asked about the semi space and guidance language. Grant responded, “our guidance we provided there really is based on just modest recovery in semi, which, yes, could be conservative...we're well positioned to capture that if it does happen again.”</p></li>\n<li><p>Michaelis asked about the 2027 automotive program. Grant said, “auto has been a nice bright spot...we believe well positioned from an auto perspective with Alfamation to support these new model year programs...as the demand comes back, these new model programs come out and creates greater demand around the new tech and the cars.”</p></li>\n<li><p>Michaelis inquired about life sciences growth. Grant detailed, “this is really a concentrated effort we've made to go after MedTech...had really nice success with Alfamation, diversifying them in the MedTech space with some glucometer electronic testing...continue to see good momentum there.”</p></li>\n<li><p>Richard Ryan, Oak Ridge Financial: Asked about back-end and front-end semi positioning. Grant replied, “We're very well positioned in that back-end test space...new products we've been launching really has broadened our customer base...better position to benefit from the growth as the investments in these testing spaces take off.”</p></li>\n<li><p>Ryan followed up on silicon carbide and front-end semi outlook. Grant stated, “We're very well positioned in that space...as these technologies get adopted into new applications and creates more demand as auto comes back...we have the capacity to scale right up to support them at those levels and beyond.” Gilmour added, “modest increases in semi baked in...the front-end side has been slow. We think the outlook looks great, but we're really not banking on a great deal in 2026.”</p></li>\n<li><p>Edward Jackson, Northland Capital: Asked about gross margins and semi’s impact. Grant responded, “semi contribution was low...yet we still had a nice gross margin quarter...if that comes back in a strong fashion at some point, then we'd expect margin to tick up.”</p></li>\n<li><p>Jackson asked about cadence of guidance. Grant explained, “we're expecting cautious sequential growth throughout the year...if there was a really strong recovery in semi in particular, we would expect to see the benefits of that.”</p></li>\n<li><p>Jackson requested color on bookings activity. Grant said, “two strong quarters of bookings...our funnel -- overall funnel is healthy...for the most part, the funnels are healthy and the opportunities are there.”</p></li>\n<li><p>Jackson questioned OpEx guidance and incentive comp. Grant confirmed, “we have factored in the incentive comp side of the numbers that we've laid out with respect to the spending guidelines.”</p></li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li><p>Analysts expressed largely positive sentiment, frequently congratulating management and pressing for detail on growth opportunities in semi, auto, and life sciences. There were some probing questions about margin potential and guidance conservatism, but the tone remained constructive. </p></li>\n<li><p>Management’s prepared remarks and responses were confident and cautiously optimistic. Grant and Gilmour acknowledged conservatism in guidance, repeatedly used terms like “well positioned,” and demonstrated confidence in diversification and new product strategies. There was a consistent tone of cautious optimism, with several acknowledgments of macro uncertainty and deliberate conservatism in forecasts.</p></li>\n<li><p>Compared to the previous quarter, management’s tone remained optimistic but more confident, with greater willingness to discuss forward-looking guidance and growth expectations. Analysts’ tone also improved, focusing more on growth avenues than risk factors.</p></li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li><p>Guidance shifted from only providing next quarter outlook in Q3 to reinstating full-year guidance for 2026 in Q4, with a revenue target of $125 million to $130 million, signaling increased confidence.</p></li>\n<li><p>Strategic focus continued on diversification and new product launches, but management highlighted greater traction in non-semi markets and noted a 36% year-over-year increase in backlog.</p></li>\n<li><p>Analysts’ questions in Q4 centered more on growth opportunities and margin potential, whereas Q3 saw more focus on operational challenges and near-term revenue risk.</p></li>\n<li><p>Key financial metrics improved sequentially: revenue, gross margin, and adjusted EBITDA all increased from Q3 to Q4, while guidance suggests further growth in 2026.</p></li>\n<li><p>Management’s confidence and willingness to offer full-year guidance marked a notable shift from the prior quarter’s caution.</p></li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li><p>Management cited persistent softness in the semi business and macroeconomic uncertainties as ongoing challenges, but highlighted that “market diversification is creating broader order opportunities.”</p></li>\n<li><p>Gilmour noted that guidance does not include potential impacts from tariff policy or geopolitical events.</p></li>\n<li><p>Analysts raised questions about the pace of semi recovery, margin expansion, and the sustainability of life sciences and auto growth, with management acknowledging that upside in semi is not factored into guidance.</p></li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>inTEST management emphasized that strong backlog growth, a diversified revenue base, and momentum in new product adoption have positioned the company for a year of returning growth in 2026. With a revenue target of $125 million to $130 million, the company is focused on broadening its market reach and scaling operational efficiency while maintaining a conservative approach to semi market recovery. Management expressed confidence that recent structural changes and strategic initiatives will contribute to sustainable, profitable growth moving forward.</p>\n<p><a href=\"https://seekingalpha.com/symbol/intt/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558912-intest-outlines-125m-130m-2026-revenue-target-amid-backlog-growth-and-diversification",
            "pub_date": "2026-02-28 05:51:20",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558910",
            "title": "XTL announces receipt of staff delisting letter from Nasdaq",
            "description": "<html><body><ul> <li>XTL Biopharmaceuticals (<a href=\"https://seekingalpha.com/symbol/XTLB\">XTLB</a>) has received a letter from Nasdaq notifying that it believes the company is a “public shell”, and that the continued listing of XTLB's American Depositary Shares is no longer warranted.</li>\n<li>The company intends to request a hearing to appeal the delisting process before a Nasdaq Hearings Panel. A hearing request will stay the suspension of the ADSs and delisting pending the panel’s decision.</li> <li>The letter stated that the staff believes the company no longer has an operating business, citing it’s prior public disclosure that its wholly owned subsidiary, The Social Proxy, had filed a formal application with the competent Israeli court for the commencement of insolvency proceedings and that on February 22, 2026, the court ordered The Social Proxy's liquidation and the appointment of a trustee for the insolvency proceedings.</li>\n<li>The staff noted that the company’s purported shell status could lead to the ADSs being subject to market abuses and other violative conduct.</li> <li>Additionally, the staff notified the company that it did not comply with the minimum $2.5M stockholders’ equity requirement and on December 20, 2025, the Staff notified the Company that its ADSs were no longer in compliance with the minimum $1 bid price.</li> <li>Unless the company requests the Hearing by March 4, 2026, trading of the company’s ADSs will be suspended from The Nasdaq Capital Market at the opening of business on March 6, 2026, and will subsequently be removed from listing.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20418097-xtl-announces-receipt-of-staff-delist-determination-from-nasdaq-and-plans-to-request-hearing\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558910-xtl-announces-receipt-of-staff-delisting-letter-from-nasdaq",
            "pub_date": "2026-02-28 05:46:29",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558911",
            "title": "American Eagle Gold plans C$34.5M financing; Eric Sprott to acquire 9.9% stake",
            "description": "<html><body><ul>\n<li>American Eagle Gold (AE:CA) <a href=\"https://seekingalpha.com/pr/20418126-american-eagle-announces-23-million-strategic-investment-backed-by-eric-sprott\">intends to raise</a> up to C$34.54M through a combined charity flow-through and concurrent share offering.</li>\n<li>The charity flow-through offering will include up to 19.2M shares at C$1.20 per share for gross proceeds of C$23.04M.</li>\n<li>The concurrent offering will consist of up to 14.94M common shares at C$0.77/share for up to C$11.5M.</li>\n<li>Eric Sprott, through 2176423 Ontario, has agreed to acquire an ~9.9% equity stake in the company.</li>\n<li>Sprott will purchase 19.2M shares underlying the charity flow-through offering at a back-end price of C$0.77/share, representing the full C$23.04M portion of that offering.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558911-american-eagle-gold-plans-c345m-financing-eric-sprott-to-acquire-99-stake",
            "pub_date": "2026-02-28 05:46:29",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558907",
            "title": "Tencent snaps six straight sessions of losses",
            "description": "<html><body><p data-eci=\"true\">Tencent (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TCEHY\" title=\"Tencent Holdings Limited\">TCEHY</a></span>) rebounded on Friday after closing in the red for six straight sessions. The stock closed 0.15% higher at $65.70.</p>\n<p>The Chinese firm lost nearly 4% in the previous six sessions. On February 26, the stock ended 1.90% lower, further pressuring its price. The stock has closed in the red for the majority of February, barring just four sessions of gains.</p>\n<p>As per Seeking Alpha’s quant rating, the stock has a Hold rating with a score of 3.22 out of 5. Tencent has been rated an A+ for profitability, while it has been graded an F for valuation. However, both Seeking Alpha and Wall Street analysts have rated the company as Buy.</p>\n<p>Last month, Seeking Alpha analyst <a href=\"https://seekingalpha.com/article/4863685-tencent-stock-china-emphasizing-domestic-and-international-services-growth-bodes-well\" target=\"_blank\" title=\"APAC Investment News\">APAC Investment News</a> issued a Buy rating for the stock, arguing that it is well-positioned to benefit from China’s pivot toward services and the knowledge economy.</p>\n<p>“Despite a touch-high valuation, TCEHY offers robust growth, strong margins, and potential AI upside, justifying a buy rating,” the analyst said.</p>\n<p>The company is expected to benefit from China’s support via the upcoming five-year plan and increased domestic consumption.</p>\n<p><span>“…we do know that when China does decide to support a specific industry, generous support can fuel growth. The last few five-year plans have emphasized electric vehicles, for example, and now China is the world’s leader in many areas of EV technology, and globally it’s now the biggest producer of EVs. I suspect the overall knowledge economy and services sector will enjoy a high degree of support going forward, which should buoy Tencent and other services firms,” it added.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558907-tencent-snaps-six-straight-sessions-of-losses",
            "pub_date": "2026-02-28 05:40:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558904",
            "title": "Cadence plans to sell up to 3.2M shares of common stock",
            "description": "<html><body><p data-eci=\"true\">Cadence Design Systems (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CDNS\" title=\"Cadence Design Systems, Inc.\">CDNS</a></span>) plans to sell up to 3.2M shares of its common stock, according to a filing on Friday with the U.S. Securities and Exchange Commission.</p>\n<p>The planned stock sale is related to its completed <a href=\"https://seekingalpha.com/pr/20409025-cadence-completes-acquisition-of-hexagon-s-design-and-engineering-business-advancing\" target=\"_blank\" title=\"acquisition\">acquisition</a> of Hexagon AB's design and engineering business. Cadence completed the acquisition on Monday, Feb. 23, for approximately <span>€2.7B, or $3.19B. Cadence expects the incoming business to add an incremental $160M to its 2026 revenue.</span></p>\n<p><span>\"On September 4, 2025, we entered into the Purchase Agreement, pursuant to which we issued 3,224,473 shares of common stock as partial consideration in connection with the acquisition of the design and engineering business of Hexagon Smart Solutions AB,\" Cadence said in the <a href=\"https://seekingalpha.com/filing/176255402\" target=\"_blank\" title=\"filing\">filing</a>. \"We issued the shares of common stock in reliance upon the exemptions from registration afforded by Regulation S promulgated under the Securities Act and/or Section 4-a-2 of the Securities Act. In accordance with our obligations under the Purchase Agreement, we agreed to register the resale of the shares of common stock offered by the selling stockholder hereby.\"</span></p>\n<p><span><span>\"This acquisition marks a major milestone in advancing our vision for intelligent system design,\" said Cadence CEO </span>Anirudh Devgan. \"By combining our industry-leading computational software and AI-driven design expertise with MSC Software's world-class structural and physics-based analysis technologies, we're empowering customers to push the boundaries of what's possible—from autonomous systems and advanced robotics to the future of transportation.\"</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558904-cadence-plans-to-sell-up-to-3_2m-shares-of-common-stock",
            "pub_date": "2026-02-28 05:40:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}