{
    "data": [
        {
            "id": "4403009",
            "title": "Federal Reserve in 'good position' to 'wait and see,' Daly says",
            "description": "<html><body><p>Federal Reserve Bank of San Francisco President Mary Daly said Tuesday that the U.S. central bank, which last paused its rate-cutting cycle, can take its time to assess how economic data has evolved relative to its dual mandate of stable prices and full<span class=\"paywall-full-content invisible\"> employment.</span></p> <p class=\"paywall-full-content invisible\">Assessing the current economic backdrop, Daly said there's \"a lot of momentum\" behind the U.S. economy, though inflation remains her biggest focus as it still hovers above the Fed's 2% target.</p> <p class=\"paywall-full-content invisible\">\"We haven't finished the job\" in containing inflation, Daly said in a panel hosted by the Commonwealth Club World Affairs of California.</p> <p class=\"paywall-full-content invisible\">Earlier on Tuesday, Atlanta Fed President Raphael Bostic said \"inflation in housing costs is a <a href=\"https://seekingalpha.com/news/4402757-taming-housing-inflation-would-bring-overall-inflation-to-goal-atlanta-feds-raphael-bostic-says\" rel=\"noopener\" target=\"_blank\" title='major factor in inflation writ large.\"'>major factor in inflation writ large.\"</a></p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/172781953/image_172781953.jpg",
            "link": "https://seekingalpha.com/news/4403009-federal-reserve-in-good-position-to-wait-and-see-daly-says",
            "pub_date": "2025-02-04 22:42:17",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403007",
            "title": "'Undervalued gas giant' Expand Energy initiated as Strong Buy at Raymond James",
            "description": "<html><body><p>Expand Energy (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/EXE\" title=\"Expand Energy Corporation\">EXE</a></span>) <span style=\"color: #008000;\">+1.2%</span> in Tuesday's trading as Raymond James launches coverage with a Strong Buy rating <span style=\"color: #000000;\">and a $135 price target, saying the c<span dir=\"ltr\" role=\"presentation\">ompany has ample room to grow and inventory to last decades into the future.</span></span></p> <p><span style=\"color: #000000;\"><span dir=\"ltr\" role=\"presentation\">Expand (<span class=\"ticker-hover-wrapper paywall-full-content invisible\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/EXE\" title=\"Expand Energy Corporation\">EXE</a></span><span class=\"paywall-full-content invisible\">), which became the largest U.S. gas producer with the combination of Chesapeake Energy and Southwestern Energy, is poised for capital efficient growth given its significant spending in DUCs </span></span><span class=\"paywall-full-content invisible\" dir=\"ltr\" role=\"presentation\">and deferred turn in-lines during a depressed price environment in recent years, Raymond James analyst John Freeman writes.</span></span></p> <p class=\"paywall-full-content invisible\"><span style=\"color: #000000;\"><span dir=\"ltr\" role=\"presentation\">The </span><span dir=\"ltr\" role=\"presentation\">investment in building the DUCs and deferred TILs provides Expand (<a href=\"https://seekingalpha.com/symbol/EXE\" title=\"Expand Energy Corporation\">EXE</a>) with \"the flexibility to push on </span><span dir=\"ltr\" role=\"presentation\">the growth accelerator whenever they desire,\" and the company's extensive portfolio provides multiple </span><span dir=\"ltr\" role=\"presentation\">decades of viable inventory and peer-leading growth in free cash flow, according to John Freeman.</span></span></p> <p class=\"paywall-full-content invisible\"><span style=\"color: #000000;\"><span dir=\"ltr\" role=\"presentation\">Expand (<a href=\"https://seekingalpha.com/symbol/EXE\" title=\"Expand Energy Corporation\">EXE</a>) has a backlog of ~80 deferred TILs and ~60 DUCs, which will allow it to quickly expand production north of 7B cfe/day in 2025, Freeman says; using Raymond James' gas price forecast of $4.00 in 2025 and $4.50 in 2026, he calculates the company's free cash flow yield will trail only Antero Resources (<a href=\"https://seekingalpha.com/symbol/AR\" title=\"Antero Resources Corporation\">AR</a>) in 2026 among gassy peers.</span></span></p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/92287654/image_92287654.jpg",
            "link": "https://seekingalpha.com/news/4403007-undervalued-gas-giant-expand-energy-initiated-as-strong-buy-at-raymond-james",
            "pub_date": "2025-02-04 22:31:55",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403015",
            "title": "Omega Healthcare Q4 earnings stand to gain from investments, macro backdrop",
            "description": "<html><body><p>Omega Healthcare Investors (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/OHI\" title=\"Omega Healthcare Investors, Inc.\">OHI</a></span>) is expected to benefit from the investments made by the skilled nursing facility provider as well as the macroeconomic backdrop.</p> <p>OHI is scheduled to announce Q4 earnings results on Wednesday, February 5th, after market close.</p> <p>The<span class=\"paywall-full-content invisible\"> consensus FFO estimate is $0.72 (+6.35% Y/Y) and the consensus revenue estimate is $226.22M (+10.89% Y/Y).</span></p> <p class=\"paywall-full-content invisible\">Omega Healthcare <a href=\"https://seekingalpha.com/news/4224903-omega-healthcare-q-3-results-beat-guidance-raised-investments-rise\">posted</a> Q3 earnings that exceeded consensus, as it continued to invest.</p> <p class=\"paywall-full-content invisible\">\"We have accretively invested approximately $834M year-to-date and the pipeline continues to be strong. As a result, we are again increasing our 2024 AFFO guidance,\" CEO Taylor Pickett had said in the Q3 results announcement.</p> <p class=\"paywall-full-content invisible\">OHI completed $440M in new investments during the third quarter, consisting of $390M in real estate acquisitions and $50M in real estate loans. It completed $119M in new investments Q4-to-date as of October 30.</p> <p class=\"paywall-full-content invisible\">\"As per NAREIT, OHI sees $600M+ of investments in 2025 as likely versus Street/BMOe at $515M/$750M (per Visible Alpha). In discussions with investors, we believe the 2025 bogey is closer to $1B. OHI also noted greater interest to deploy capital in U.S. fee simple structures. Going forward, OHI expects to capture a larger share of the industry investment pipeline following the PACS fallout,\" a report by BMO Capital Markets said.</p> <p class=\"paywall-full-content invisible\">\"We look to gage OHI's views on potential Medicare or Medicaid cuts being discussed by Republicans to help pay for targeted initiatives as part of the budget reconciliation process. In addition, we look for the latest thoughts on more restrictive immigration policies and the impact to costs and rent coverage,\" the report noted.</p> <p class=\"paywall-full-content invisible\">\"The healthcare sector is poised to increasingly benefit from the aging demographics in the U.S. Those born at the peak of the baby boom are now roughly 65 years old, entering retirement age when they will increasingly require different housing solutions and greater medical care,\" Truist Securities had said in a recent research note.</p> <p class=\"paywall-full-content invisible\">\"Aging demographics are expected to meaningfully drive demand for skilled nursing facilities, and current supply trends appear insufficient to keep up. Despite high absolute costs, SNFs still remain a relatively cheaper environment for post-acute care,\" said Truist.</p> <p class=\"paywall-full-content invisible\">\"Tenant issues appear to be largely behind OHI. The one issue to watch with SNF-focused operators is on the labor side. If lower income wages pick up, we note this could offset some of the benefit of the aging of America on SNF performance,\" BoA Securities said in its Q3 earnings recap.</p> <p class=\"paywall-full-content invisible\">The investment bank raised its 2024 AFFO estimate for the healthcare REIT to $2.72 from $2.68. The <a href=\"https://seekingalpha.com/symbol/OHI/earnings/estimates\">consensus</a> stands at $2.82 (+0.94% Y/Y).</p> <p class=\"paywall-full-content invisible\"><strong>What to Expect</strong></p> <p class=\"paywall-full-content invisible\">\"The healthcare REITs in our coverage universe generally have low positive correlations to GDP, the broader stock market and REIT index over the past 10 years on an absolute and relative basis. Interestingly, the stocks in our healthcare REIT coverage universe have a very low correlation with the 10-year Treasury as well,\" said Truist analysts.</p> <p class=\"paywall-full-content invisible\">\"Skilled nursing and senior housing performed significantly better than the other healthcare REITs we cover and the broader market, posting a 56%+ average total return (in our coverage),\" said the note.</p> <p class=\"paywall-full-content invisible\">\"The fundamental backdrop continues to improve as the healthcare industry has materially recovered from pandemic impacts and demand from aging demographics outpaces supply growth,\" said Truist.</p> <p class=\"paywall-full-content invisible\">\"OHI could outperform on faster than expected leasing at Maplewood's (private) Inspir community in NYC or outsized external growth versus peers,\" Truist said with a Hold rating, citing the stock appears fairly valued.</p> <p class=\"paywall-full-content invisible\">The stock has risen <span class=\"green\">33.87%</span> in the last one year.</p> <p class=\"paywall-full-content invisible\">The <a href=\"https://seekingalpha.com/symbol/OHI/ratings/sell-side-ratings\">sell-side</a> analysts and <a href=\"https://seekingalpha.com/symbol/OHI/ratings/author-ratings\">Seeking Alpha authors</a> grade OHI as Buy. The <a href=\"https://seekingalpha.com/symbol/OHI/ratings/quant-ratings\">Quant Rating</a> system rates it as a Strong Buy.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1503371245/image_1503371245.jpg",
            "link": "https://seekingalpha.com/news/4403015-omega-healthcare-q4-earnings-stand-to-gain-from-investments-macro-backdrop",
            "pub_date": "2025-02-04 22:39:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403005",
            "title": "Beyond rallies 26% after a well-received business update dials up the heat on shorts",
            "description": "<html><body><p>Beyond (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BYON\" title=\"Beyond, Inc.\">BYON</a></span>) soared on Tuesday in a delayed reaction by investors to the company's announcement that it has entered into an asset purchase agreement with BBBY Acquisition to acquire the global rights of the Buy Buy Baby brand.</p> <p>The purchase<span class=\"paywall-full-content invisible\"> price</span><span class=\"paywall-full-content invisible\"> of $5M includes certain assets, databases, domains, intellectual property, vendor relationships, and content related to Buy Buy Baby.</span></p> <p class=\"paywall-full-content invisible\">Beyond and tZERO, with its SEC-regulated special purpose broker dealer license, are also exploring the tokenization of a portion of the Buy Buy Baby intellectual property. </p> <p class=\"paywall-full-content invisible\">Jefferies analyst Jonathan Matuszewski and his team think the $5M price tag looks attractive for a brand that peaked with multiple billion in omnichannel revenue, especially considering Dream On Me paid $15.5M just 20 months ago. \"That said, the brand has generated only ~$35M in TTM online revenue and will now operate under its 3rd different mgmt team in less than 2 years,\" warned Matuszewski.</p> <p class=\"paywall-full-content invisible\">On the financial front, Buy Buy Baby is expected to have a positive contribution to Beyond's (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BYON\" title=\"Beyond, Inc.\">BYON</a></span>) 2025 margins.</p> <p class=\"paywall-full-content invisible\">Shares of Beyond (<a href=\"https://seekingalpha.com/symbol/BYON\" title=\"Beyond, Inc.\">BYON</a>) were up <span style=\"color: #008000;\">25.6%</span> in afternoon trading on Tuesday. Short interest stands at 19.2% of the total float, which may be adding to the volatility,</p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/874979248/image_874979248.jpg",
            "link": "https://seekingalpha.com/news/4403005-beyond-rallies-26-after-a-well-received-business-update-dials-up-the-heat-on-shorts",
            "pub_date": "2025-02-04 22:29:40",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403013",
            "title": "Everest Group targets 9% operating ROE for 2024 amid portfolio shifts and casualty discipline",
            "description": "<html><body><p>Earnings Call Insights: Everest Group (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/EG\" title=\"Everest Group, Ltd.\">EG</a></span>) Q4 2024 </p> <h3>Management View</h3> <ul> <li>CEO Jim Williamson highlighted a pre-tax net loss estimate of $350 million to $450 million from the California wildfires, primarily affecting the reinsurance division. He emphasized the company's underwriting discipline, noting that Everest's loss reflects<span class=\"paywall-full-content invisible\"> careful client selection. </span> </li> <li class=\"paywall-full-content invisible\">Operating income for 2024 reached $1.3 billion, with a 9% return on equity despite $1.7 billion in reserve strengthening, predominantly in U.S. casualty lines. Williamson described the results as demonstrating the business's resilience, supported by strong income streams from reinsurance and investments.</li> <li class=\"paywall-full-content invisible\">Reinsurance premium growth of 12.6% during Q4 was driven by property lines and selective specialty expansion, offset by a 7% reduction in U.S. casualty treaty business. Williamson stated that the company walked away from $750 million in North American casualty quota share business since January 1, 2024.</li> <li class=\"paywall-full-content invisible\">The insurance segment saw a casualty premium reduction of 23%, with remediation efforts targeting underperforming accounts. Key wins included multiline and large deductible casualty programs for sophisticated clients.</li> <li class=\"paywall-full-content invisible\">CFO Mark Kociancic reported gross written premiums of $4.7 billion, representing 7.2% growth. The combined ratio was 135.5%, impacted by 37.6 points of prior-year reserve development.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Williamson noted that Everest's strategic focus would remain on underwriting discipline, particularly in casualty lines where loss cost trends remain elevated. The company is not entering new markets in 2025 but plans to scale operations in its existing 12 international markets.</li> <li>Reinsurance pricing is expected to stabilize or improve following recent catastrophic events, particularly in property catastrophe and European markets. Williamson expects the California wildfires to reinforce pricing discipline in property reinsurance.</li> <li>CFO Kociancic reaffirmed the company's mid-teens total shareholder return target over the cycle, emphasizing capital strength and the potential for share repurchases.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>The combined ratio for Q4 reached 135.5%, reflecting $1.5 billion of prior-year unfavorable reserve development. Current accident year losses contributed $229 million, driven by Hurricane Milton.</li> <li>Reinsurance achieved a combined ratio of 90.4%, with property cat excess of loss growing 26.2% for the year. Attritional combined ratio improved by 140 basis points to 83.7%, excluding profit commissions.</li> <li>Insurance gross written premiums declined 1.6%, reflecting casualty remediation offset by 30% growth in property and specialty lines. The attritional loss ratio for insurance increased to 84%, reflecting current accident year strengthening.</li> <li>Net investment income increased to $473 million during Q4, driven by higher assets under management and book yield stability at 4.7%.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Gregory Peters, Raymond James: Asked about managing volatility given the shift to international property business. Williamson emphasized disciplined capital deployment and reinsurance strategies to manage per-risk volatility.</li> <li>Meyer Shields, Keefe Bruyette &amp; Woods: Inquired about loss ratio progress in the insurance segment. Williamson pointed to prudent reserve actions and improving portfolio mix as tailwinds.</li> <li>Alex Scott, Barclays: Asked about the impact of California wildfires on pricing. Williamson expects this event to reinforce pricing discipline globally, particularly in property catastrophe.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed moderate concern over reserve strengthening and loss cost trends in U.S. casualty lines but recognized the company's proactive approach.</li> <li>Management maintained a confident tone, particularly in highlighting underwriting discipline and resilience in navigating market conditions. Williamson frequently emphasized strategic actions to improve profitability.</li> <li>Compared to Q3, analysts' tone was slightly more pressing, focusing on reserve adequacy and future casualty trends. Management showed consistent confidence but was more cautious in addressing potential risks in U.S. casualty lines.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance language shifted to emphasize discipline in casualty underwriting and a narrower focus on international market scaling.</li> <li>Reserve strengthening in Q4 was significantly higher than in Q3, reflecting heightened prudence in U.S. casualty lines.</li> <li>Analysts' focus moved from broad operational performance in Q3 to reserve adequacy and casualty remediation in Q4.</li> <li>Management tone remained firm, but there was a more defensive posture regarding reserve adjustments.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Elevated loss cost inflation in U.S. casualty lines remains a key challenge, with assumed trends exceeding 12% in general liability, auto liability, and umbrella lines.</li> <li>Analysts raised concerns about reserve adequacy and the potential for further strengthening in casualty lines.</li> <li>Management noted strategic exits from underperforming accounts and emphasized continued focus on rate adequacy and portfolio mix improvement.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Everest Group's Q4 2024 results underscore its focus on underwriting discipline and portfolio remediation, particularly in U.S. casualty lines. While reserve strengthening impacted the quarter, the company demonstrated resilience through growth in reinsurance and specialty lines. Management remains optimistic about achieving mid-teens shareholder returns, supported by strong capital positioning, targeted growth in international markets, and anticipated stabilization in property reinsurance pricing. Investors should monitor ongoing reserve trends and the impact of casualty remediation efforts on profitability.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/EG/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403013-everest-group-targets-9-percent-operating-roe-for-2024-amid-portfolio-shifts-and-casualty",
            "pub_date": "2025-02-04 22:25:48",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403010",
            "title": "Clorox shares under pressure as cautious outlook overshadows FQ2 beat",
            "description": "<html><body><p class=\"MsoNormal\">Shares of Clorox (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CLX\" title=\"The Clorox Company\">CLX</a></span>) were under heavy selling pressure Tuesday and dipped below support at the 200-day moving average for the first time since August as the company’s above-consensus<a href=\"https://seekingalpha.com/news/4402302-clorox-fq2-results-beat-expectations-as-cost-cutting-gains-traction\" rel=\"noopener\" target=\"_blank\" title=\" fiscal Q2 results \"> fiscal Q2 results </a>were overshadowed by a double-digit<span class=\"paywall-full-content invisible\"> drop in sales, and cautious outlook for the future given the uncertainty of U.S. trade policy and foreign exchange headwinds.</span></p> <p class=\"MsoNormal paywall-full-content invisible\">For FY25, the company’s guidance reflected caution as it expects FY25 revenue to down 1% to up 2% which includes 1 to 2 points of benefit from incremental shipments related to the company’s Enterprise Resource Planning (“ERP”) transition. However, this benefit is expected to reverse in the first half of next year. <span style=\"mso-spacerun: yes;\"> </span>Excluding the ERP transition, organic sales are expected to be up a more modest 3% to 5% compared to guidance including ERP transition.</p> <p class=\"MsoNormal paywall-full-content invisible\">During the company’s<a href=\"https://seekingalpha.com/article/4754470-the-clorox-company-clx-q2-2025-earnings-conference-call-transcript\" rel=\"noopener\" target=\"_blank\" title=\" earnings call\"> earnings call</a>, Clorox (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CLX\" title=\"The Clorox Company\">CLX</a></span>) said that while it is making progress in regaining lost market share, it will likely need to increase promotion pricing to “fully regain penetration,” Morgan Stanley’s Dara Mohsenian said in a note to clients.</p> <p class=\"MsoNormal paywall-full-content invisible\">In the wake of results and conference call, the majority of Wall Street analysts have maintained their neutral outlook for the stock (Goldman reiterated a Sell rating), with a modest lift to corresponding price targets, given the relatively unchanged earnings outlook, low-single digit topline growth outlook, and competitive landscape that is further clouded by any fallout from U.S. trade policies.</p> <p class=\"MsoNormal paywall-full-content invisible\">Seeking Alpha’s <a href=\"https://seekingalpha.com/symbol/CLX/analysis\" rel=\"noopener\" target=\"_blank\" title=\"Quant rating\">Quant rating</a> views Clorox (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CLX\" title=\"The Clorox Company\">CLX</a></span>) as a Hold with a score of 3.18 out of 5.</p> <p class=\"MsoNormal paywall-full-content invisible\">Shares are <span style=\"color: #ff0000;\">down 7%</span> in late afternoon trading. </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/109012457/image_109012457.jpg",
            "link": "https://seekingalpha.com/news/4403010-clorox-shares-under-pressure-as-cautious-outlook-overshadows-fq2-beat",
            "pub_date": "2025-02-04 22:27:27",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403012",
            "title": "Coloplast targets 8%-9% organic growth for FY 2025 amid Kerecis expansion and new launches",
            "description": "<html><body><p>Earnings Call Insights: Coloplast A/S (<a href=\"https://seekingalpha.com/symbol/CLPBF\" title=\"Coloplast A/S\">OTCPK:CLPBF</a>) Q1 2025</p> <h3>Management View</h3> <ul> <li><p>CEO Kristian Villumsen highlighted 8% organic growth and a reported EBIT margin of 27% for Q1 2025, which aligned with expectations. He emphasized the divestment of the Skin Care business, expected to improve the EBIT<span class=\"paywall-full-content invisible\"> margin by 30 basis points this fiscal year, and noted that this would reduce reported revenue growth by approximately 1.5 percentage points.</span></p></li> <li class=\"paywall-full-content invisible\"><p>Management discussed the strong performance of Chronic Care, with Ostomy Care and Continence Care outpacing market growth. Luja, particularly the male catheter, was a key growth driver, and the female version is now expanding to nine markets, including the U.S.</p></li> <li class=\"paywall-full-content invisible\"><p>Villumsen noted double-digit growth for Atos Medical and Kerecis, with the latter achieving 32% growth in Q1. Interventional Urology faced a soft start due to a voluntary product recall, though sales are expected to recover in the second half of the year.</p></li> <li class=\"paywall-full-content invisible\"><p>CFO Anders Lonning-Skovgaard reported a Q1 gross margin of 68%, unchanged from last year, benefiting from favorable input costs and pricing but offset by ramp-up costs in Costa Rica and Portugal. Operating profit before special items increased by 5% year-over-year.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Coloplast reaffirmed its FY 2025 guidance of 8%-9% organic revenue growth and an EBIT margin of approximately 28%. The company anticipates second-half-weighted growth, driven by recovery in Emerging Markets and Interventional Urology, and continued contributions from innovation and acquisitions.</p></li> <li><p>Management stated that Kerecis should contribute around 1 percentage point to organic growth, with improved profitability expected. The delay in implementing the U.S. Local Coverage Determination (LCD) policy for skin substitutes to April 2025 is not expected to impact trading.</p></li> <li><p>EBIT margin improvement will be supported by easing inflationary pressures and profitability initiatives in Advanced Wound Care, including the Skin Care divestment.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Q1 2025 revenue increased by DKK 420 million, with organic growth contributing approximately DKK 500 million. Divestments and foreign exchange reduced reported revenue by DKK 47 million and DKK 32 million, respectively.</p></li> <li><p>Adjusted net profit before special items rose 17% year-over-year to DKK 1.4 billion, with diluted earnings per share increasing to DKK 6.38.</p></li> <li><p>Free cash flow increased to DKK 1.9 billion, benefiting from working capital improvements and the Skin Care divestment.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Hassan Al-Wakeel, Barclays: Questioned the confidence in execution following recent disruptions. Villumsen responded that the company has resolved issues with the U.S. distribution center and product quality, adding, \"These are certainly aberrations that I do not expect to repeat.\"</p></li> <li><p>Jack Reynolds-Clark, RBC: Asked about margin headwinds from manufacturing ramp-ups. CFO Lonning-Skovgaard stated that gross margin for FY 2025 is expected to remain around 68%, supported by cost efficiencies and lower inflationary pressures.</p></li> <li><p>Lisa Clive, Bernstein: Inquired about the rate of women's health declines. Villumsen confirmed the decline has stopped, with the focus now on the Altis product and upcoming INTIBIA launch.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Analysts showed a mix of cautious and inquisitive tones, with concerns centered on execution risks, margin sustainability, and the impact of the delayed LCD implementation. Villumsen's responses were measured and aimed at reassuring stakeholders of the company's ability to navigate challenges.</p></li> <li><p>Management maintained a confident tone, particularly regarding growth prospects for Kerecis, the Luja launch, and recovery in Interventional Urology. Villumsen repeatedly emphasized readiness for the LCD opportunity and strong momentum in innovation.</p></li> <li><p>Compared to the previous quarter, management's tone reflected greater emphasis on addressing operational disruptions and elaborating on mitigation strategies.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Q1 2025 guidance language remained consistent with Q4 2024, though an increased focus was placed on recovering from the Interventional Urology recall and achieving second-half growth acceleration.</p></li> <li><p>Analysts continued to scrutinize execution challenges, particularly in the U.S. Chronic Care business and Kerecis LCD uncertainties.</p></li> <li><p>The gross margin remained stable quarter-over-quarter, while free cash flow improved significantly due to the Skin Care divestment.</p></li> <li><p>Management's sentiment appeared slightly more defensive, reflecting ongoing operational challenges, though confidence in growth drivers like Kerecis and Luja remained strong.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management highlighted potential risks from the delayed LCD implementation and competitive pressures in Interventional Urology.</p></li> <li><p>Analysts expressed concerns about margin headwinds from manufacturing ramp-ups and the potential for lost sales in Bladder Health due to the product recall.</p></li> <li><p>Villumsen reiterated that the company is prepared for LCD-related opportunities and emphasized plans to recover lost sales in Interventional Urology during the second half of the year.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Coloplast delivered solid Q1 2025 results, with 8% organic growth and stable margins despite operational headwinds. The company remains focused on innovation, recovery in Interventional Urology, and expanding its Kerecis platform. While analysts raised concerns about execution risks and LCD uncertainties, management expressed confidence in achieving its full-year guidance and long-term growth objectives.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/CLPBF/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403012-coloplast-targets-8-percentminus-9-percent-organic-growth-for-fy-2025-amid-kerecis-expansion",
            "pub_date": "2025-02-04 22:23:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402992",
            "title": "Deutsche Bank says 'existential imbalance' behind U.S. and China's trade spats",
            "description": "<html><body><p>Deutsche Bank on Tuesday highlighted the huge difference in how much the U.S. consumes and how much China produces, adding that this imbalance was one of the key reasons behind the trade tensions between the world's two largest economies.</p> <p>U.S. President<span class=\"paywall-full-content invisible\"> Donald Trump approved 10% tariffs on Chinese goods on February 1. The Asian nation </span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/news/4402411-tit-for-tat-china-hits-back-with-tariffs-on-u_s_-coal-lng-vehicles\" rel=\"noopener\" target=\"_blank\" title=\"responded\">responded</a><span class=\"paywall-full-content invisible\"> with its own duties on imports of multiple American products, including LNG, coal and more. China's reaction was in stark contrast to Canada and Mexico, with the two North American nations showing a willingness to work with Trump.</span></p> <p class=\"paywall-full-content invisible\">\"While markets may be inclined to read across from negotiating successes the U.S. had with Mexico and Canada, we think a lot is different in the U.S.-China trade relationship. A much more existential imbalance lies behind U.S. trade angst with China, which the Trump administration now seems keen to correct,\" Deutsche Bank's Jim Reid said.</p> <p class=\"paywall-full-content invisible\">\"While the U.S. accounts for 29% of global consumption, it produces only 15% of the world's goods. Meanwhile, China accounts for 32% of global manufacturing but just 12% of consumption. Simplifying it, this imbalance shows up in a USD1tn Chinese trade surplus and a nearly equivalent U.S. deficit,\" Reid added.</p> <p class=\"paywall-full-content invisible\">See the chart shared by Reid below:</p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><a href=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/7f595483677cde940af304079d914aa4.png\" rel=\"lightbox\"><img alt=\"Trade imbalance chart\" data-caption=\"\" data-original-src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/7f595483677cde940af304079d914aa4.png\" data-source=\"Deutsche Bank\" height=\"683\" src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/7f595483677cde940af304079d914aa4.png?io=getty-c-w900\" width=\"900\"/></a><figcaption class=\"overlay-title\"><p class=\"item-caption\"><span class=\"item-source\">Deutsche Bank</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">\"China's economic development in recent years, instead of moving it towards a consumer-oriented economy, has moved in the direction of a more advanced manufacturing economy. This is now causing consternation in the West, with China making strides in many high-value added capital goods,\" Reid said. </p> <p class=\"paywall-full-content invisible\">China's disruptive power was on full display last week in the form of artificial intelligence (AI) startup DeepSeek and the hype around its low-cost language model.</p> <p class=\"paywall-full-content invisible\">\"While the U.S. is still the second-largest goods producer, it has less than half of China's global share, with many U.S. allies also seeing significant drops in their manufacturing share over the past 30 years. This may now have gone too far. Access to cheaper goods is no longer a good 'trade' for the U.S. given the loss of economic security over production supply chains and technologies to a competing power,\" Reid added.</p> <p class=\"paywall-full-content invisible\">Wall Street (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>) on Tuesday <a href=\"https://seekingalpha.com/news/4402743-sp500-nasdaq-dow-jones-outlook-stock-market\" rel=\"noopener\" target=\"_blank\" title=\"shook off\">shook off</a> the tariff drama and advanced. Here are some popular exchange-traded funds that track the benchmark S&amp;P 500 index (<a href=\"https://seekingalpha.com/symbol/SP500\">SP500</a>): (<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"SPDR® S&amp;P 500 ETF Trust\">SPY</a>), (<a href=\"https://seekingalpha.com/symbol/VOO\" title=\"Vanguard S&amp;P 500 ETF\">VOO</a>), (<a href=\"https://seekingalpha.com/symbol/IVV\" title=\"iShares Core S&amp;P 500 ETF\">IVV</a>), (<a href=\"https://seekingalpha.com/symbol/RSP\" title=\"Invesco S&amp;P 500 Equal Weight ETF\">RSP</a>), (<a href=\"https://seekingalpha.com/symbol/SSO\" title=\"ProShares Trust - ProShares Ultra S&amp;P500\">SSO</a>), (<a href=\"https://seekingalpha.com/symbol/UPRO\" title=\"ProShares Trust - ProShares UltraPro S&amp;P500\">UPRO</a>), (<a href=\"https://seekingalpha.com/symbol/SH\" title=\"ProShares Short S&amp;P 500 ETF\">SH</a>), (<a href=\"https://seekingalpha.com/symbol/SDS\" title=\"ProShares UltraShort S&amp;P 500 ETF\">SDS</a>), and (<a href=\"https://seekingalpha.com/symbol/SPXU\" title=\"ProShares UltraPro Short S&amp;P 500 ETF\">SPXU</a>).</p> <p class=\"paywall-full-content invisible\">Here are some Canada-linked ETFs: (<a href=\"https://seekingalpha.com/symbol/EWC\" title=\"iShares MSCI Canada ETF\">EWC</a>), (<a href=\"https://seekingalpha.com/symbol/FXC\" title=\"Invesco CurrencyShares Canadian Dollar Trust ETF\">FXC</a>), (<a href=\"https://seekingalpha.com/symbol/FLCA\" title=\"Franklin FTSE Canada ETF\">FLCA</a>), and (<a href=\"https://seekingalpha.com/symbol/BBCA\" title=\"JPMorgan BetaBuilders Canada ETF\">BBCA</a>).</p> <p class=\"paywall-full-content invisible\">Some Mexico-linked ones: (<a href=\"https://seekingalpha.com/symbol/EWW\" title=\"iShares MSCI Mexico Capped ETF\">EWW</a>), (<a href=\"https://seekingalpha.com/symbol/FLMX\" title=\"Franklin FTSE Mexico ETF\">FLMX</a>), and (<a href=\"https://seekingalpha.com/symbol/MEXX\" title=\"Direxion Daily MSCI Mexico Bull 3X ETF\">MEXX</a>).</p> <p class=\"paywall-full-content invisible\">And some China-linked ones: (<a href=\"https://seekingalpha.com/symbol/KWEB\" title=\"KraneShares CSI China Internet ETF\">KWEB</a>), (<a href=\"https://seekingalpha.com/symbol/PGJ\" title=\"Invesco Golden Dragon China Portfolio ETF\">PGJ</a>), (<a href=\"https://seekingalpha.com/symbol/CQQQ\" title=\"Invesco China Technology ETF\">CQQQ</a>), (<a href=\"https://seekingalpha.com/symbol/FXI\" title=\"iShares China Large-Cap ETF\">FXI</a>), (<a href=\"https://seekingalpha.com/symbol/GXC\" title=\"SPDR S&amp;P China ETF\">GXC</a>), (<a href=\"https://seekingalpha.com/symbol/MCHI\" title=\"iShares MSCI China ETF\">MCHI</a>), (<a href=\"https://seekingalpha.com/symbol/FLCH\" title=\"Franklin FTSE China ETF\">FLCH</a>), (<a href=\"https://seekingalpha.com/symbol/CNYA\" title=\"iShares MSCI China A ETF\">CNYA</a>), (<a href=\"https://seekingalpha.com/symbol/ASHR\" title=\"Deutsche X-trackers Harvest CSI 300 China A-Shares ETF\">ASHR</a>), and (<a href=\"https://seekingalpha.com/symbol/YINN\" title=\"Direxion Daily FTSE China Bull 3x Shares ETF\">YINN</a>).</p> <p class=\"paywall-full-content invisible\"><strong>Dear readers</strong>: We recognize that politics often intersects with the financial news of the day, so we invite you to <a href=\"https://seekingalpha.com/article/4752436-politics-and-the-markets-020425\" rel=\"noopener\" target=\"_blank\" title=\"click here to join the separate political discussion\">click here to join the separate political discussion</a>. </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/184287950/image_184287950.jpg",
            "link": "https://seekingalpha.com/news/4402992-deutsche-bank-says-existential-imbalance-behind-u_s_-and-chinas-trade-spats",
            "pub_date": "2025-02-04 22:25:28",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403006",
            "title": "Ferrari targets €900M CapEx for 2025 with six new models and personalization growth",
            "description": "<html><body><p>Earnings Call Insights: Ferrari N.V. (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/RACE\" title=\"Ferrari N.V.\">RACE</a></span>) Q4 2024 </p> <h3>Management View</h3> <ul> <li>Ferrari marked a record-breaking year in 2024, with revenues reaching approximately €6.7 billion, supported by double-digit growth in profitability and net profit of €1.5 billion. CEO Benedetto Vigna highlighted the company's strong performance, driven by demand<span class=\"paywall-full-content invisible\"> for personalization and a favorable product mix.</span> </li> <li class=\"paywall-full-content invisible\">The F80 supercar launch was emphasized as pivotal, representing Ferrari's advancements in electrification, with its V6 hybrid powertrain and key components developed in-house at the new E-building. All 799 units of the F80 are fully allocated to collectors.</li> <li class=\"paywall-full-content invisible\">Six new models are planned for 2025, signaling an acceleration in the company's product rollout. Vigna stated that the Ferrari full electric model will be unveiled in Q4 2025.</li> <li class=\"paywall-full-content invisible\">CFO Antonio Picca Piccon noted an EBITDA margin of 38.3% and an EBIT margin of 28.3%, crediting these improvements to product mix, personalization growth, and favorable geographical contributions.</li> <li class=\"paywall-full-content invisible\">Piccon confirmed that personalization now accounts for approximately 20% of revenues from cars and spare parts, driven by models like the Purosangue and Daytona SP3.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management projected 2025 capital expenditures of approximately €900 million, down from the 2024 peak of €990 million, with investments focused on the paint shop and product development.</li> <li>Ferrari expects personalization levels to remain around 20% of cars and spare parts revenues.</li> <li>The first half of 2025 is anticipated to outperform the second half due to product mix evolution, including initial deliveries of the F80 in Q4 2025.</li> <li>The effective tax rate for 2025 is estimated to rise to 22.5%, reflecting changes in the Patent Box regime.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 2024 revenues reached €1.6 billion, with net profit of €375 million and industrial free cash flow exceeding €1 billion for the year.</li> <li>Shipments increased by 89 units year-over-year in 2024, driven by models such as the Purosangue, Roma Spider, and 296 GTS, while five models phased out, including the Portofino M and 812 Competizione.</li> <li>Hybrid models represented 51% of shipments in 2024, reflecting Ferrari’s transition towards electrification.</li> <li>Personalizations continued to strengthen, boosted by features like carbon finish components.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Susy Tibaldi, UBS: Asked about the six new model launches for 2025 and potential customer confusion. Vigna clarified that the models cater to distinct client segments and emphasized Ferrari’s strategy of offering diverse options without compromising exclusivity.</li> <li>Stephen Reitman, Bernstein: Inquired about pricing for the Purosangue and the customer profile for the 12Cilindri. Vigna confirmed a planned price increase for the Purosangue and highlighted the younger demographic of 12Cilindri buyers, with 20% being new customers.</li> <li>Monica Bosio, Intesa SanPaolo: Asked about the order book in China and potential changes in strategy. Vigna reiterated Ferrari’s commitment to maintaining a deliberate allocation strategy and keeping China’s volume below 10%.</li> <li>Adam Jonas, Morgan Stanley: Queried about residual values and personalization trends. Vigna noted that residual values vary by region and are influenced by the degree of personalization, with Ferrari advising clients on design choices.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts displayed a mix of curiosity and skepticism, particularly regarding Ferrari’s ability to maintain residual values and manage its ambitious product rollout. Questions about market dynamics in China and residual value management indicated cautious optimism.</li> <li>Management remained confident, emphasizing Ferrari’s strong brand desirability and innovation. Vigna’s repeated references to Ferrari’s strategic flexibility and commitment to quality reinforced a positive tone.</li> <li>Compared to the previous quarter, management displayed heightened confidence in the company’s direction, supported by record-breaking financial results and a robust order book.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance for 2025 includes six new model launches, compared to the progressive rollout of the F80 in Q4 2024.</li> <li>Personalization revenues increased to 20% of cars and spare parts, up from earlier estimates in Q3.</li> <li>Management’s tone in Q4 reflected greater confidence, particularly in discussing electrification advancements and the F80’s successful allocation.</li> <li>Analysts’ focus shifted from ERP impacts in Q3 to pricing strategies and regional dynamics in Q4, particularly in China.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management highlighted supply chain challenges stemming from lower demand across the wider automotive industry, with mitigation strategies including second sourcing and on-site support for suppliers.</li> <li>Analysts raised concerns about residual value trends, particularly for hybrid models and the Purosangue, though Ferrari emphasized its deliberate allocation strategy and robust demand.</li> <li>The potential impact of U.S. import tariffs remains uncertain, with Ferrari monitoring developments closely.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Ferrari closed 2024 with record-breaking financial performance, driven by personalization and a robust product mix. The launch of the F80 supercar and plans for six new models in 2025 signal the company’s commitment to innovation and exclusivity. Despite challenges such as supply chain issues and regional dynamics, management expressed confidence in maintaining Ferrari’s strong trajectory, supported by a loyal customer base and strategic flexibility.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/RACE/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403006-ferrari-targets-900m-capex-for-2025-with-six-new-models-and-personalization-growth",
            "pub_date": "2025-02-04 22:11:10",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402988",
            "title": "PayPal stock tumbles 12%, partly on unbranded checkout growth concerns",
            "description": "<html><body><p>PayPal Holdings (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/PYPL\" title=\"PayPal Holdings, Inc.\">PYPL</a></span>) stock <span style=\"color: #ff0000;\">sank 12%</span> in Tuesday afternoon trading even after the payment tech company delivered a Q4 earnings beat and issued strong 2025 guidance.</p> <p>\"We think the stock's pressure is more a result of high expectations rather than a<span class=\"paywall-full-content invisible\"> structural issue in PYPL's transformation journey to drive profitable growth,\" BTIG analyst Andrew Harte wrote in a note to clients. He calls Tuesday's stock selloff \"a bit drastic given the positive 4Q result, FY25 guidance that we think is conservative, and growth opportunities discussed for the year ahead.\"</span></p> <p class=\"paywall-full-content invisible\">Two areas that may triggered concern are lack of conviction in PayPal's (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/PYPL\" title=\"PayPal Holdings, Inc.\">PYPL</a></span>) branded checkout acceleration in 2025 and a drastic deceleration in its unbranded total payment volume growth, even though it was signaled by management.</p> <p class=\"paywall-full-content invisible\">The company has been churning unprofitable volume in its Braintree business as it focuses on profitable growth. The rapid deceleration in Q4 results may have taken some investors by surprise, Harte said. Q4 PSP \"Braintree merchant negotiations are expected to result in a 5% headwind to revenue growthin FY25, but are expected to positively result in a 1% benefit to transaction margin dollars, with even more benefit over time,\" the analyst wrote. Unbranded card processing <a href=\"https://seekingalpha.com/article/4754618-paypal-holdings-inc-2024-q4-results-earnings-call-presentation\" rel=\"noopener\" target=\"_blank\" title=\"total payment volume increased\">total payment volume increased</a> 2% Y/Y in Q4, slowing from 11% in Q3.</p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1976573535/image_1976573535.jpg",
            "link": "https://seekingalpha.com/news/4402988-paypal-stock-tumbles-12-partly-on-unbranded-checkout-growth-concerns",
            "pub_date": "2025-02-04 22:05:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}