{
    "data": [
        {
            "id": "4403618",
            "title": "Children's Place rallies after Mithaq Capital confirms its controlling stake",
            "description": "<html><body><p>Children's Place (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/PLCE\" title=\"The Children's Place, Inc.\">PLCE</a></span>) rallied on Wednesday after Saudi investment firm Mithaq Capital confirmed that it holds a 54.8% stake in the retailer. The fund has held a controlling stake in Children's Place (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/PLCE\" title=\"The Children's Place, Inc.\">PLCE</a></span>) for over a year. Notably, no<span class=\"paywall-full-content invisible\"> other institutional shareholder has a stake in Children's Place (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/PLCE\" title=\"The Children's Place, Inc.\">PLCE</a><span class=\"paywall-full-content invisible\">) of over 3%.</span></p> <p class=\"paywall-full-content invisible\">Mithaq Capital SPC is an independent limited-investor, private mutual fund licensed by the Cayman Islands Monetary Authority. It operates as a segregated portfolio company and is an affiliate of Mithaq Holding Company, a family office based in Saudi Arabia.</p> <p class=\"paywall-full-content invisible\">Shares of Childrens's Place (<a href=\"https://seekingalpha.com/symbol/PLCE\" title=\"The Children's Place, Inc.\">PLCE</a>) jumped <span style=\"color: #008000;\">17.1%</span> in late morning trading. Short interest on PLCE stands at 22% of the total float, which could be adding to the volatility.</p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/874979248/image_874979248.jpg",
            "link": "https://seekingalpha.com/news/4403618-childrens-place-rallies-after-mithaq-capital-confirms-its-controlling-stake",
            "pub_date": "2025-02-05 19:47:32",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403663",
            "title": "The top 10 Value stocks by BofA: AFL, DRI, DVN, and more",
            "description": "<html><body><p class=\"MsoNormal\">Bank of America updated their “Value 10” stocks – the 10 highest ranking value stocks according to their screening methodology.</p> <p class=\"MsoNormal\">In this edition, analysts replaced Arch Capital Group (<a href=\"https://seekingalpha.com/symbol/ACGL\" title=\"Arch Capital Group Ltd.\">ACGL</a>), Ameriprise Financial (<a href=\"https://seekingalpha.com/symbol/AMP\" title=\"Ameriprise Financial, Inc.\">AMP</a>), and Ralph Lauren (<a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/RL\" title=\"Ralph Lauren Corporation\">RL</a><span class=\"paywall-full-content invisible\">) by Nucor Corp. (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/NUE\" title=\"Nucor Corporation\">NUE</a><span class=\"paywall-full-content invisible\">), W. R. Berkley (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/WRB\" title=\"W. R. Berkley Corporation\">WRB</a><span class=\"paywall-full-content invisible\">), and Eastman Chemical Co. (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/EMN\" title=\"Eastman Chemical Company\">EMN</a><span class=\"paywall-full-content invisible\">).</span></p> <p class=\"MsoNormal paywall-full-content invisible\">Analysts explained that the BofA vs. Consensus EPS Surprise rating fell below 5 for those three stocks they are removing.</p> <p class=\"MsoNormal paywall-full-content invisible\">The criteria for Value 10 stocks list includes BofA vs. Consensus EPS Surprise rating of 1; a buy-rated opinion; a rating of 1 or 2 for the BofA vs. Consensus EPS Surprise model for less than 10 months; and the lowest trailing 12-Month P/E.</p> <p class=\"MsoNormal paywall-full-content invisible\">The Value 10’s total annual return for 2024 is 22%, compared to 12% for the S&amp;P 500 Value (<span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/IVE\" title=\"iShares S&amp;P 500 Value ETF\">IVE</a></span>), outperforming by 1.6 percentage points.</p> <p class=\"MsoNormal paywall-full-content invisible\">Year-to-date, the Value 10 performance is up 4.5%.</p> <p class=\"MsoNormal paywall-full-content invisible\">Here is the list:</p> <ul class=\"paywall-full-content invisible\"> <li class=\"MsoNormal\">Aflac (<a href=\"https://seekingalpha.com/symbol/AFL\" title=\"Aflac Incorporated\">AFL</a>) – Trailing 12-month PE: 16.0</li> <li class=\"MsoNormal\">Allstate Corp. (<a href=\"https://seekingalpha.com/symbol/ALL\" title=\"The Allstate Corporation\">ALL</a>) – Trailing 12-month PE: 12.3</li> <li class=\"MsoNormal\">Darden Restaurants (<a href=\"https://seekingalpha.com/symbol/DRI\" title=\"Darden Restaurants, Inc.\">DRI</a>) – Trailing 12-month PE: 22.2</li> <li class=\"MsoNormal\">Devon (<a href=\"https://seekingalpha.com/symbol/DVN\" title=\"Devon Energy Corporation\">DVN</a>) – Trailing 12-month PE: 6.3</li> <li class=\"MsoNormal\">Eastman Chemical (<a href=\"https://seekingalpha.com/symbol/EMN\" title=\"Eastman Chemical Company\">EMN</a>) – Trailing 12-month PE: 12.9</li> <li class=\"MsoNormal\">Hewlett-Packard (<a href=\"https://seekingalpha.com/symbol/HPE\" title=\"Hewlett Packard Enterprise Company\">HPE</a>) – Trailing 12-month PE: 10.9</li> <li class=\"MsoNormal\">Nucor (<a href=\"https://seekingalpha.com/symbol/NUE\" title=\"Nucor Corporation\">NUE</a>) – Trailing 12-month PE: 15.2</li> <li class=\"MsoNormal\">Raymond James (<a href=\"https://seekingalpha.com/symbol/RJF\" title=\"Raymond James Financial, Inc.\">RJF</a>) – Trailing 12-month PE: 16.0</li> <li class=\"MsoNormal\">Steel Dynamics (<a href=\"https://seekingalpha.com/symbol/STLD\" title=\"Steel Dynamics, Inc.\">STLD</a>) – Trailing 12-month PE: 13.0</li> <li class=\"MsoNormal\">W.R. Berkley (<a href=\"https://seekingalpha.com/symbol/WRB\" title=\"W. R. Berkley Corporation\">WRB</a>) – Trailing 12-month PE: 13.4</li> </ul> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1291599098/image_1291599098.jpg",
            "link": "https://seekingalpha.com/news/4403663-the-top-10-value-stocks-by-bofa-afl-dri-dvn-and-more",
            "pub_date": "2025-02-05 19:48:35",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403575",
            "title": "Criteo shares jump on earnings beat, driven by strong client integrations",
            "description": "<html><body><div> <p>Criteo (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/CRTO\" title=\"Criteo S.A.\">CRTO</a></span>) shares <span class=\"green\">rose more than 22%</span> during Wednesday trading hours after the company <a href=\"https://seekingalpha.com/news/4403415-criteo-sa-beats-q4-top-line-and-bottom-line-estimates-initiates-q1-and-fy25-outlook\">beat</a> both top-line and bottom-line estimates for the fourth quarter. </p> <p>New client integrations along with continued strength in Travel and Classified trends were some of the major catalysts<span class=\"paywall-full-content invisible\"> for the company's earnings beat. </span></p> <p class=\"paywall-full-content invisible\">The advertising company reported adjusted earnings per share of $1.75, beating analysts’ estimates by $0.40. The company reported a revenue of $553M for the period, which also topped estimates. </p> <p class=\"paywall-full-content invisible\">Criteo’s (<a href=\"https://seekingalpha.com/symbol/CRTO\" title=\"Criteo S.A.\">CRTO</a>) Retail Media Contribution ex-TAC grew 23% in the fourth quarter, while its same-retailer contribution was 126% in the quarter, driven by an uptick in offsite campaigns and growing network effects of the platform. </p> <p class=\"paywall-full-content invisible\">The France-based ad-tech company said it expects Contribution ex-TAC to be between $256M to $260M in the first quarter of 2025, along with adjusted EBITDA in the range of $68M to $72M. </p> <p class=\"paywall-full-content invisible\">Criteo (<a href=\"https://seekingalpha.com/symbol/CRTO\" title=\"Criteo S.A.\">CRTO</a>) said it expects mid-single-digit growth in Contribution ex-TAC for FY25. </p> <p class=\"paywall-full-content invisible\">The company also announced an increase to its remaining share repurchase authorization to up to $200M in January 2025. It had deployed $225M of capital for share repurchases in 2024. </p> <p class=\"paywall-full-content invisible\">SA analysts see CRTO stock as a BUY with the company’s growth in digital advertising and its expanding retail media presence. </p> <p class=\"paywall-full-content invisible\">Criteo (<a href=\"https://seekingalpha.com/symbol/CRTO\" title=\"Criteo S.A.\">CRTO</a>)’s market value has increased more than 17% so far this year, outperforming the broader S&amp;P 500 Index. </p> <div class=\"paywall-full-content invisible\"> </div> </div> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403575-criteo-shares-jump-on-earnings-beat",
            "pub_date": "2025-02-05 19:43:36",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403659",
            "title": "DNB Bank sees 15% GDP growth in 2025 with strong loan and deposit momentum",
            "description": "<html><body><p>Earnings Call Insights: DNB Bank ASA (<a href=\"https://seekingalpha.com/symbol/DNBBY\" title=\"DNB Bank ASA\">OTCPK:DNBBY</a>) Q4 2024 ### Management View * CEO Kjerstin Braathen highlighted a strong performance across all customer segments, with a return on equity of 19% for the quarter. Lending grew by 2.5%, while deposits increased by 4.7%. She emphasized the bank’s focus<span class=\"paywall-full-content invisible\"> on profitable growth and maintaining a diversified credit portfolio supported by solid results in debt capital markets and asset management. * CFO Ida Lerner reported net interest income growth of 3.7% quarter-over-quarter, driven by higher financing activity and treasury-related income. Net commissions and fees increased by 12.3%, reaching an all-time high for the fourth quarter, particularly due to strong contributions from debt capital markets and asset management. * The Board proposed a dividend of SEK 16.75 per share, an increase from SEK 16 last year, aligning with its policy of year-over-year nominal increases and share buybacks to optimize capital. ### Outlook * Management expects the Norwegian Central Bank to begin lowering its key policy rate by 25 basis points in March 2025, with a potential terminal rate of 3.75%. CFO Lerner noted an anticipated wage growth slowdown in 2025, projected at 4.4%, and a reduction to 3.5% by 2026. * CEO Braathen stated that competition in the Norwegian banking market remains rational, with expectations for increased credit growth amid a strong macroeconomic outlook. She projected favorable conditions for continued profitable growth. * The Carnegie acquisition is expected to close by March 2025, with regulatory approvals pending. Management anticipates it will enhance synergies in private banking, wealth management, and investment banking. ### Financial Results * Net interest income rose 3.7% sequentially, supported by strong lending and deposit growth. Loan volumes grew by 2.5%, with deposit volumes up 4.7%. * Impairment provisions totaled SEK 157 million, while 99.3% of the credit portfolio remains classified as Stage 1 and 2. * Return on equity adjusted for a one-time low tax rate was 16.1%, exceeding the long-term target of 14%. * Capital adequacy remains robust, with a capital ratio of 19.4%, providing a solid foundation to absorb the Carnegie acquisition and meet regulatory requirements. ### Q&amp;A * </span><strong class=\"paywall-full-content invisible\">Gulnara Saitkulova, Morgan Stanley:</strong><span class=\"paywall-full-content invisible\"> Asked about the outlook for lending and deposit spreads and whether net interest income (NII) has peaked. CEO Braathen indicated potential downward pressure on NII as rates fall but noted stable volume-weighted spreads. She added that competition remains rational, with expectations for credit growth to increase. * </span><strong class=\"paywall-full-content invisible\">Shrey Srivastava, Citi:</strong><span class=\"paywall-full-content invisible\"> Inquired about capital headwinds and share buybacks. CFO Lerner reiterated the bank’s commitment to its dividend policy, highlighting flexibility for future buybacks depending on capital conditions and regulatory clarity. * </span><strong class=\"paywall-full-content invisible\">Namita Samtani, Barclays:</strong><span class=\"paywall-full-content invisible\"> Asked about the Carnegie acquisition timeline and cost dynamics for 2025. CFO Lerner confirmed the acquisition would close by March 2025 and highlighted ongoing investments in digital solutions and cost efficiency measures. ### Sentiment Analysis * Analysts expressed concerns regarding NII sustainability and deposit behavior in a declining rate environment but acknowledged management’s confidence in maintaining stable spreads and profitability. * Management maintained a positive tone, emphasizing strong performance metrics and a favorable macroeconomic outlook. CEO Braathen projected confidence in the bank’s ability to navigate competitive pressures and leverage opportunities from the Carnegie acquisition. * Compared to Q3, management’s tone remained consistent, with continued optimism on profitability and growth. Analysts, however, showed slightly increased skepticism regarding macroeconomic impacts and capital allocation decisions. ### Quarter-over-Quarter Comparison * Net interest income growth accelerated from 2% in Q3 to 3.7% in Q4, driven by stronger lending and deposit growth. * Return on equity increased to 19% in Q4 from 18.9% in Q3, though Q4 figures included a one-time low tax rate adjustment. * Fee and commission income growth remained robust, with Q4 seeing a 12.3% increase compared to 11.1% in Q3. * Management’s outlook shifted slightly, reflecting optimism around increased credit growth and the Carnegie acquisition’s synergies. ### Risks and Concerns * Management flagged potential impacts from macroeconomic adjustments, including rate cuts and inflation trends. * Analysts expressed concerns about possible margin compression in a declining rate environment and the competitive landscape in Norway. * Uncertainty around regulatory approvals for the Carnegie acquisition and the potential impacts on capital requirements were highlighted as key factors to monitor. ### Final Takeaway DNB Bank delivered strong Q4 2024 results, supported by robust lending and deposit growth, record-high fee income, and a solid capital position. Management remains optimistic about macroeconomic conditions, with anticipated rate cuts and increased credit growth providing a favorable outlook. The Carnegie acquisition, expected to close in Q1 2025, is set to enhance the bank’s private banking and investment banking capabilities. Investors should monitor regulatory developments and the bank’s ability to sustain profitability amid a shifting rate environment.</span></p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/DNBBY/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403659-dnb-bank-sees-15-percent-gdp-growth-in-2025-with-strong-loan-and-deposit-momentum",
            "pub_date": "2025-02-05 19:45:05",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403641",
            "title": "Stingray Group declares CAD 0.075 dividend",
            "description": "<html><body><ul>\n<li>Stingray Group (RAY.A:CA) declares <a href=\"https://seekingalpha.com/pr/19991749-stingray-reports-third-quarter-results-for-fiscal-2025\" target=\"_blank\">CAD 0.075/share quarterly dividend</a>, in line with previous.</li>\n<li>Payable March 14; for shareholders of record Feb. 28; ex-div Feb. 28.</li>\n<li><a href=\"https://seekingalpha.com/symbol/RAY.A:CA/dividends?source=news_bullet\">See RAY.A:CA Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n</body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403641-stingray-group-declares-cad-0_075-dividend",
            "pub_date": "2025-02-05 19:37:11",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403643",
            "title": "CapitaLand Integrated Commercial Trust signals mid-single-digit rent reversions amid strong operational metrics",
            "description": "<html><body><p>Earnings Call Insights: CapitaLand Integrated Commercial Trust (<a href=\"https://seekingalpha.com/symbol/CPAMF\" title=\"CapitaLand Integrated Commercial Trust\">OTCPK:CPAMF</a>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Tony Tan highlighted that CapitaLand Integrated Commercial Trust (CICT) ended the year in a strong position, supported by a 1.7% increase in revenue year-over-year and a net property income growth of<span class=\"paywall-full-content invisible\"> 3.4%. The portfolio occupancy rate improved to 96.7%, rising by 0.3 percentage points sequentially. He also emphasized the impact of several asset enhancement initiatives (AEIs), including work at IMM, Gallileo, and 101 Miller, which are expected to contribute significantly in 2025 and beyond.</span> </li> <li class=\"paywall-full-content invisible\">The CEO noted that the acquisition of ION Orchard had exceeded expectations, contributing positively to the portfolio's performance. Newly completed AEI work at various locations, including Clarke Quay and 101 Miller, was highlighted as critical to maintaining competitive asset quality.</li> <li class=\"paywall-full-content invisible\">CFO Mei Lian Wong reported that leverage was reduced to 38.5%, providing financial flexibility for future investments. She noted that 81% of debt is now hedged at fixed rates, with the cost of debt maintained at 3.6%. She added, \"With our strong financial position, we are well-protected against market volatility.\"</li> <li class=\"paywall-full-content invisible\">Head of Portfolio Management Lee Yi Zhuan stated that leasing activity remained robust, with over 1.8 million square feet leased during the year. He noted strong tenant retention and positive rental reversions across both office and retail segments.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management anticipates mid-single-digit rental reversions for the retail portfolio in 2024, supported by strong demand from F&amp;B, beauty, health, and fashion tenants. The office portfolio is also expected to achieve mid-single-digit rent reversions, driven by demand from sectors such as financial services, legal, and wealth management.</li> <li>CEO Tony Tan outlined plans for significant contributions from AEIs starting in 2025, particularly from Gallileo and IMM. He stated, \"We anticipate more substantial revenue recognition in 2026 as these projects ramp up.\"</li> <li>The company remains committed to maintaining a strong Singapore anchor, while also exploring opportunities in overseas markets, albeit cautiously due to valuation challenges.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Revenue increased by 1.7% year-over-year, while net property income grew by 3.4%. Portfolio valuation rose by 6.2%, reaching $26 billion, with growth driven by operational improvements and the acquisition of ION Orchard. </li> <li>Distributable income per unit (DPU) for the second half of 2024 grew sequentially to $0.0545, supported by strong operational performance and higher contributions from new acquisitions. </li> <li>The average cost of debt remained stable at 3.6%, and leverage was reduced to 38.5%, providing headroom for future investments and AEI projects.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Vijay Natarajan, RHB Research, asked about capital recycling plans and whether divestments were imminent. Jacqueline Lee, Head of Investments, responded that portfolio reconstitution is a continuous process and that any divestment would depend on timing and market conditions.</li> <li>Mervin Song, J.P. Morgan, inquired about the outlook for ION Orchard's performance. CEO Tony Tan noted that occupancy at ION had improved to nearly 98%, with base rents rising. However, he acknowledged a softening in luxury retail sales globally.</li> <li>An analyst inquired about Gallileo's AEI costs and potential returns. Tony Tan explained that the AEI is necessary to modernize the building and attract high-quality tenants, with significant rental uplifts expected upon completion.</li> <li>Another analyst asked about the potential impact of higher interest rates on valuations. CFO Mei Lian Wong stated that the company has hedged 81% of its debt and expects the average cost of debt to remain below 4% in 2025.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts exhibited a mix of cautious optimism and skepticism. Concerns were raised about the potential impact of economic headwinds on tenant sales and occupancy costs. Questions also focused on AEI execution risks and the ability to sustain positive rental reversions.</li> <li>Management maintained a confident tone during the prepared remarks, emphasizing operational resilience and growth prospects. However, during the Q&amp;A, responses were measured, particularly when addressing valuation declines in overseas markets and higher interest rate impacts.</li> <li>Compared to prior quarters, management demonstrated increased confidence in the Singapore portfolio's performance, particularly in retail and office segments, while acknowledging challenges in overseas markets.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>No comparative data from the previous quarter was available for evaluation. However, management emphasized consistent improvement in operational metrics, such as occupancy rates and rental reversions, as well as the portfolio's resilience in a challenging macroeconomic environment.</li> <li>Analysts' focus shifted more toward AEI contributions and overseas market challenges, reflecting evolving concerns about valuation and growth opportunities.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Key risks highlighted include economic uncertainty, rising interest rates, and challenges in overseas markets, particularly in Germany and Australia. The company also faces potential headwinds from global retail trends and softening luxury sales.</li> <li>Management is addressing these risks through portfolio diversification, active cash management, and AEI investments aimed at enhancing asset quality and tenant retention.</li> <li>Analysts expressed concerns about the sustainability of rental reversions and the impact of AEI-related downtime on near-term cash flows.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">CapitaLand Integrated Commercial Trust delivered a solid Q4 2024 performance, marked by improved operational metrics and strong contributions from recent acquisitions and AEIs. The company's focus on Singapore as a core market and its initiatives to enhance asset quality position it well for future growth. However, challenges persist in overseas markets and macroeconomic headwinds, requiring careful execution of strategic projects to sustain performance and investor confidence.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/CPAMF/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403643-capitaland-integrated-commercial-trust-signals-mid-single-digit-rent-reversions-amid-strong",
            "pub_date": "2025-02-05 19:37:44",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403436",
            "title": "Disney beats on core metrics and guides upbeat profit growth for 2025; shares seesaw (update)",
            "description": "<html><body><p data-pm-slice=\"1 1 []\">Disney (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a></span>) beat on top and bottom line numbers for the first quarter, helped by <em>\"Moana 2\"</em> outperformance and the media conglomerate provided a forecast for the full year that was within Wall Street expectations.</p> <p>Shares of the company have<span class=\"paywall-full-content invisible\"> been dilly-dallying between green and red after reporting results; DIS stock is down 1% ahead of midday trading on the NYSE.</span></p> <p class=\"paywall-full-content invisible\">For the full year, the company expects adjusted earnings per share growth in the high single-digit range and cash flow from operations of about $15B. The Bloomberg consensus estimate for adj. EPS growth is 8.1%, and cash flow is $15.09B.</p> <p class=\"paywall-full-content invisible\">The company also expects to incur $200M related to Disney Cruise Line pre-opening expenses and record a $300M equity loss due to the purchase accounting of the Star India deconsolidation in 2025.</p> <p class=\"paywall-full-content invisible\">In Q2, the company expects a modest decline in Disney+ subscribers sequentially, and expects an impact of $100M on sports operating income from college sports and an additional NFL game, and about $50M from exiting the Venu Sports joint venture.</p> <p class=\"paywall-full-content invisible\">During Q1, total Disney+ subscribers came in at 124.6M, which included 56.8M domestic users and 67.8M internationally. Total Hulu subscribers were 53.6M.</p> <p class=\"paywall-full-content invisible\" data-pm-slice=\"1 1 []\">Domestic Disney+ average monthly revenue per paid subscriber increased to $7.99 from $7.70; International Disney+ average monthly revenue per paid subscriber increased to $7.19 from $6.78.</p> <p class=\"paywall-full-content invisible\" data-pm-slice=\"1 1 []\">Most notably, revenue from content sales/licensing saw a 34% jump in Q1, helped by higher theatrical distribution, reflecting the strong performance of <em>Moana 2</em>, the company said.</p> <p class=\"paywall-full-content invisible\">Results at domestic parks and experiences were \"unfavorably impacted\" by Hurricane Milton and Hurricane Helene, the company said. <span class=\"location\">Walt Disney World Resort</span> was closed for a day and the cruise itinerary was canceled as a result of Hurricane Milton.</p> <p class=\"paywall-full-content invisible\">In his initial reaction to the report, Seeking Alpha analyst and leader of the Investing Group \"Cash Flow Club,\" <a class=\"c-link\" data-sk=\"tooltip_parent\" data-stringify-link=\"https://seekingalpha.com/author/jonathan-weber#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" href=\"https://seekingalpha.com/author/jonathan-weber#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" rel=\"noopener noreferrer\" target=\"_blank\">Jonathan Weber</a>, said, <em>\"</em>Disney delivered a double beat, growing slightly faster than expected. The Disney+ subscriber number declined sequentially, and the same is expected for the current quarter. That being said, other business units performed reasonably well, and management foresees a nice HSD EPS increase for the current year.\"</p> <p class=\"paywall-full-content invisible\">Net income for the three months ended December 31 was $2.64B, compared to $2.15B for the same period last year.</p> <p class=\"paywall-full-content invisible\">On a per-share basis, the company earned $1.40, beating the average analyst estimate by 9 cents.</p> <p class=\"paywall-full-content invisible\">Revenue rose 5% to $24.7B and was ahead of expectations by $150M.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2186902541/image_2186902541.jpg",
            "link": "https://seekingalpha.com/news/4403436-disney-beats-on-core-metrics-and-guides-an-upbeat-profit-growth-for-2025",
            "pub_date": "2025-02-05 19:34:45",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403590",
            "title": "Elon Musk’s DOGE agents said to have gained access to Medicare systems",
            "description": "<html><body><p>Representatives of the Elon Musk-run Department of Government Efficiency have gained access to key payment and contracting systems of the U.S. Centers for Medicare and Medicaid Services in a bid to identify areas of potential fraud or waste, <em>The Wall<span class=\"paywall-full-content invisible\"> Street Journal </span></em><span class=\"paywall-full-content invisible\">reported Wednesday.</span></p> <p class=\"paywall-full-content invisible\">Citing people familiar with the matter, the publication said that DOGE agents have entered the CMS offices this week to study the agency's system technology and associated spending flows so as to highlight areas of possible fraud or waste.</p> <p class=\"paywall-full-content invisible\">DOGE is also said to be looking at the agency's organizational structure and its staffing methods.</p> <p class=\"paywall-full-content invisible\">CMS said it has two senior agency officials leading the coordination with DOGE. And they are “taking a thoughtful approach to see where <a href=\"https://www.wsj.com/health/healthcare/elon-musk-doge-medicare-medicaid-fraud-e697b162?st=ZRo1B6&amp;reflink=desktopwebshare_permalink\" rel=\"noopener\" target=\"_blank\">there may</a> be opportunities for more effective and efficient spending in line with meeting the goals of President Trump,” a CMS official said.</p> <p class=\"paywall-full-content invisible\">DOGE, created by President Donald Trumpunder the leadership of Elon Musk, billionaire CEO of Tesla (<a href=\"https://seekingalpha.com/symbol/TSLA\" title=\"Tesla, Inc.\">TSLA</a>) via an executive order on his first day in office has previously accessed the Treasury Department’s payments system, <em>The New York <a href=\"https://seekingalpha.com/news/4401711-elon-musks-doge-gains-access-to-treasury-departments-payments-system-nyt\" rel=\"noopener\" target=\"_blank\">Times </a></em><a href=\"https://seekingalpha.com/news/4401711-elon-musks-doge-gains-access-to-treasury-departments-payments-system-nyt\" rel=\"noopener\" target=\"_blank\">reported Saturday.</a></p> <p class=\"paywall-full-content invisible\">Major health insurers working with the CMS include UnitedHealth (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/UNH\" title=\"UnitedHealth Group Incorporated\">UNH</a></span>), Humana (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/HUM\" title=\"Humana Inc.\">HUM</a></span></span>), CVS Health (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CVS\" title=\"CVS Health Corporation\">CVS</a></span>),<span style=\"mso-spacerun: yes;\"> </span>Cigna (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CI\" title=\"The Cigna Group\">CI</a></span>), Clover Health (<a href=\"https://seekingalpha.com/symbol/CLOV\" title=\"Clover Health Investments, Corp.\">CLOV</a>) and Alignment Healthcare (<a href=\"https://seekingalpha.com/symbol/ALHC\" title=\"Alignment Healthcare, Inc.\">ALHC</a>), Centene (<a href=\"https://seekingalpha.com/symbol/CNC\" title=\"Centene Corporation\">CNC</a>), Molina Healthcare (<a href=\"https://seekingalpha.com/symbol/MOH\" title=\"Molina Healthcare, Inc.\">MOH</a>), Elevance Health (<a href=\"https://seekingalpha.com/symbol/ELV\" title=\"Elevance Health, Inc.\">ELV</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317447094/image_1317447094.jpg",
            "link": "https://seekingalpha.com/news/4403590-elon-musks-doge-agents-access-medicare-systems",
            "pub_date": "2025-02-05 19:35:24",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403592",
            "title": "TotalEnergies CEO expects U.S. financing for Mozambique LNG project in coming weeks",
            "description": "<html><body><p>TotalEnergies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a></span>) CEO Patrick Pouyanne said Wednesday that he expects financing from the U.S. for its $20B Mozambique LNG project will be <a href=\"https://www.reuters.com/business/energy/totalenergies-ceo-says-us-financing-mozambique-lng-project-expected-coming-weeks-2025-02-05/\" rel=\"nofollow\" target=\"_self\" title=\"approved in coming weeks\">approved in the coming weeks</a>, with other credit agencies to follow shortly thereafter, Reuters reported.</p> <p>The company is<span class=\"paywall-full-content invisible\"> waiting for loan re-approvals from the U.S., U.K. and Dutch export credit agencies before lifting a force majeure on the project that has been in place since 2021; the U.K. government reportedly is taking legal advice to </span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/news/4403121-u-k-taking-legal-advice-to-pull-out-of-totalenergies-20b-mozambique-lng-project-ft\" target=\"_self\" title=\"determine whether it can withdraw\">determine whether it can withdraw</a><span class=\"paywall-full-content invisible\"> from the controversial project.</span></p> <p class=\"paywall-full-content invisible\">The U.S. Export-Import Bank previously agreed a $4.7B loan for the project but it needs to be re-approved, after construction on the project was frozen in 2021 due to violent unrest near the project site.</p> <p class=\"paywall-full-content invisible\">Pouyanne said the Mozambique LNG project completion date would need to be pushed back to 2029-30 from its previously planned 2027.</p> <p class=\"paywall-full-content invisible\">The CEO also said he expects TotalEnergies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a></span>) will be able to continue investing in renewable energy in the U.S.; the French company is the largest LNG exporter to the U.S., with more than 10M tons under contract.</p> <p class=\"paywall-full-content invisible\">TotalEnergies (<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a>) <span style=\"color: #008000;\">+2%</span> on Wednesday after reporting better than expected <a href=\"https://seekingalpha.com/news/4403294-totalenergies-beats-top-line-and-bottom-line-estimates-initiates-fy25-outlook\" target=\"_self\" title=\"Q4 adjusted earnings\">Q4 adjusted earnings</a>, as higher trading profits in the gas market helped it offset some of the impact of low oil prices and weak fuel demand.</p> <p class=\"paywall-full-content invisible\">The company announced a 7% increase in the 2024 dividend to €3.22/share, and confirmed stock buybacks of $2B per quarter for 2025.</p> <p class=\"paywall-full-content invisible\">RBC Capital analyst Biraj Borkhataria said TotalEnergies' (<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a>) announced dividend growth was <a href=\"https://www.reuters.com/business/energy/totalenergies-posts-drop-fourth-quarter-profit-weak-oil-demand-2025-02-05/\" rel=\"nofollow\" target=\"_self\" title=\"higher than anticipated\">higher than anticipated</a>, and the company's reported 8% gearing \"should allay any concerns around debt levels.\"</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331308062/image_1331308062.jpg",
            "link": "https://seekingalpha.com/news/4403592-totalenergies-ceo-expects-u_s_-financing-for-mozambique-lng-project-in-coming-weeks",
            "pub_date": "2025-02-05 19:27:33",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403622",
            "title": "Illinois Tool Works targets 3% organic growth in 2025 with higher margins",
            "description": "<html><body><p>Earnings Call Insights: Illinois Tool Works (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ITW\" title=\"Illinois Tool Works Inc.\">ITW</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li><p>CEO Chris O'Herlihy highlighted a solid Q4 performance, with GAAP EPS rising 7% to $2.54 and operating income increasing 4% to $1.03 billion despite a 1.3% total revenue decline. Organic revenue growth turned positive at 0.4% when<span class=\"paywall-full-content invisible\"> excluding product line simplification (PLS). Record operating margins reached 26.2%, driven by a 140 basis point improvement, including contributions from enterprise initiatives.</span></p></li> <li class=\"paywall-full-content invisible\"><p>O'Herlihy emphasized the company’s focus on driving above-market organic growth and achieving a 3% customer-backed innovation (CBI) yield by 2030, with patent filings increasing 18% in 2024. He stated that ITW is \"well-positioned to capitalize on an improving demand environment if it should materialize.\"</p></li> <li class=\"paywall-full-content invisible\"><p>CFO Michael Larsen noted that six out of seven segments expanded operating margins in Q4, with enterprise initiatives contributing 120 basis points. He also mentioned free cash flow reaching a record $1 billion, with a conversion rate of 133%.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li><p>ITW provided full-year 2025 guidance, projecting organic growth of 1% to 3%, excluding a 1% decline from PLS. GAAP EPS is forecasted between $10.15 and $10.55, with a midpoint of $10.35 reflecting non-operational headwinds, including a $0.30 foreign currency impact.</p></li> <li><p>Operating margins are expected to improve by 100 basis points to a range of 26.5% to 27.5%. Enterprise initiatives will contribute approximately 100 basis points to margin improvement across segments.</p></li> <li><p>Management stated that Q1 2025 EPS would represent about 22% of the year's total due to seasonal revenue declines and increased restructuring expenses.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li><p>GAAP EPS for Q4 2024 came in at $2.54, exceeding analysts' estimates of $2.50. Revenue was $3.98 billion, compared to an analysts' estimate of $3.98 billion.</p></li> <li><p>Automotive OEM revenue declined 2% in Q4, but margins improved by 230 basis points, reaching 19.6% for the full year. The segment is on track to achieve its low-to-mid 20% operating margin target in the next few years.</p></li> <li><p>Food Equipment grew 3.5% organically in Q4, driven by equipment and service growth. Asia-Pacific sales were particularly strong, growing 11%, with operating margins improving by 170 basis points to 27%.</p></li> <li><p>Specialty Products saw a 4% organic revenue decline due to strategic PLS but achieved a record 28.4% margin. Management expects this segment to grow in 2025 despite ongoing PLS.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Stephen Volkmann, Jefferies, inquired about enterprise initiative benefits by segment. CFO Michael Larsen explained that Automotive OEM saw the largest improvement with 190 basis points, while Welding experienced 60 basis points.</p></li> <li><p>Scott Davis, Melius Research, asked about margin sustainability in a down volume environment. CEO Chris O'Herlihy highlighted the role of enterprise initiatives and CBI in driving continuous improvement, noting, \"These initiatives are independent of volume and deliver meaningful contributions.\"</p></li> <li><p>Andrew Kaplowitz, Citi Group, sought clarity on sales momentum. Larsen emphasized that while some end markets, including semiconductors, showed positive signs, ITW’s guidance is based on current demand levels.</p></li> <li><p>Jamie Cook, Truist Securities, asked about potential growth challenges in certain segments. O'Herlihy reaffirmed confidence in all segments achieving 4%-plus growth, citing the success of CBI initiatives across the portfolio.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Analysts expressed cautious optimism, focusing on margin sustainability and growth potential in challenging markets. Questions were balanced, with some pressing for details on specific contributions from enterprise initiatives and recovery timelines in key segments.</p></li> <li><p>Management maintained a confident tone, particularly when discussing operational improvements and strategic progress. Phrases like \"well-positioned\" and \"strong execution\" dominated their remarks, reflecting optimism despite market headwinds.</p></li> <li><p>Compared to Q3, management displayed slightly more confidence in near-term growth opportunities, particularly in segments like Food Equipment and Automotive OEM.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Q4 organic revenue at -0.5% was an improvement over Q3’s -1.4%, signaling stabilization in demand. Operating margin rose to 26.2% from 26.5% in Q3, reflecting continued operational efficiency.</p></li> <li><p>Automotive OEM maintained its trajectory toward margin improvement despite lower volumes. Food Equipment rebounded with 3.5% organic growth, compared to flat growth in Q3.</p></li> <li><p>Management’s tone shifted from cautious in Q3 to slightly more optimistic in Q4, supported by improved performance metrics and progress on strategic priorities like CBI.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management noted ongoing non-operational headwinds, including foreign currency translation and restructuring expenses. They also highlighted uncertainty in demand recovery timing, particularly in Construction Products and Automotive OEM.</p></li> <li><p>Analysts raised concerns about potential tariff impacts on automotive and other segments, though management downplayed the risks, citing their \"produce where we sell\" strategy.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Illinois Tool Works delivered a strong finish to 2024, with record free cash flow and operating margins. The company’s focus on customer-backed innovation and enterprise initiatives positions it for growth in 2025, supported by a robust margin outlook. While challenges persist in automotive and construction markets, ITW remains confident in its ability to outperform end markets and sustain profitability.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/ITW/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403622-illinois-tool-works-targets-3-percent-organic-growth-in-2025-with-higher-margins",
            "pub_date": "2025-02-05 19:29:23",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}