{
    "data": [
        {
            "id": "4402737",
            "title": "BP may spend up to $25B to develop four oil and gas fields at Iraq’s Kirkuk - Reuters",
            "description": "<html><body><p>BP (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a></span>) is expected to spend as much as $25B to redevelop four Kirkuk oil and gas fields, a senior Iraqi oil official told Reuters, as the country seeks to win back foreign investment.</p> <p>If the deal is signed, which the<span class=\"paywall-full-content invisible\"> anonymous official said could occur in the coming weeks, it would mark a breakthrough for Iraq, where production has been constrained by years of war, corruption and sectarian tensions.</span></p> <p class=\"paywall-full-content invisible\">BP (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a></span>) would spend $20B-$25B in a profit-sharing agreement that would last more than 25 years, with the aim of raising capacity to 450K bbl/day in 2-3 years, according to the <a href=\"https://www.reuters.com/business/energy/bp-poised-invest-up-25-billion-iraqs-kirkuk-oil-gas-2025-02-04/\" rel=\"nofollow\" target=\"_self\" title=\"report\">report</a>.</p> <p class=\"paywall-full-content invisible\">The deal reportedly is focused on rehabilitating facilities in four oilfields and developing natural gas to support Iraq's domestic energy needs, and BP (<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a>) would boost crude production capacity from the four oilfields in Kirkuk by 150K bbl/day from current capacity of 300K bbl/day.</p> <p class=\"paywall-full-content invisible\">Under the profit-sharing model being discussed, the senior oil official told Reuters that BP (<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a>) would be able to recover costs and start making profits once it has increased output beyond current levels.</p> <p class=\"paywall-full-content invisible\">A prospective agreement with BP (<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a>) would be the second major deal between Iraq and an international oil company in as many years after an agreement with TotalEnergies valued at ~$27B.</p> <p class=\"paywall-full-content invisible\">BP (<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a>) was a member of the consortium of companies that discovered oil in Kirkuk in the 1920s and has estimated the area holds ~9B barrels of recoverable oil.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1342084394/image_1342084394.jpg",
            "link": "https://seekingalpha.com/news/4402737-bp-may-spend-up-to-25b-to-develop-four-oil-and-gas-fields-at-iraqs-kirkuk-reuters",
            "pub_date": "2025-02-04 18:43:02",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402749",
            "title": "Fox Corporation targets D2C launch by year-end, sees Tubi revenue crossing $1B in FY2025",
            "description": "<html><body><p>Earnings Call Insights: Fox Corporation (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/FOX\" title=\"Fox Corporation\">FOX</a></span>) Q2 2025</p> <h3>Management View</h3> <ul> <li>Lachlan Murdoch highlighted a strong quarter with EBITDA more than doubling year-over-year to $781 million and revenue increasing 20% to over $5 billion. He emphasized the role of political revenue, strong sports programming, and continued growth<span class=\"paywall-full-content invisible\"> at Tubi, which achieved a 31% increase in ad revenues.</span> </li> <li class=\"paywall-full-content invisible\">Fox News achieved its highest-ever quarterly share of the PrimeTime cable news audience at over 60%, supported by record-breaking presidential election coverage and strong advertiser demand. Murdoch also confirmed all affiliate renewals affecting FY2025 were successfully completed.</li> <li class=\"paywall-full-content invisible\">Tubi's first-ever Super Bowl live stream was announced, aimed at engaging new users and capturing first-party data, with low incremental costs expected.</li> <li class=\"paywall-full-content invisible\">CFO Steve Tomsic noted a 123% increase in EBITDA and strong advertising revenue growth of 21%, driven by political ad spend, robust sports pricing, and Tubi’s momentum.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Murdoch confirmed plans to launch a direct-to-consumer (D2C) service targeting cord-cutters and cord-nevers by the end of calendar year 2025. He clarified that the service would not incur incremental rights costs and would be priced modestly.</li> <li>Tubi is expected to surpass $1 billion in revenue for FY2025, driven by its large AVOD library and targeted advertising capabilities.</li> <li>Political advertising trends are expected to remain strong, with digital platforms like Tubi playing a critical role in capturing targeted ad spend.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Adjusted EPS came in at $0.96, exceeding analysts’ estimate of $0.64. Revenue totaled over $5 billion, surpassing the $4.82 billion estimate.</li> <li>Cable network revenues grew 31%, supported by a 32% rise in advertising revenues and a 4% increase in affiliate fee revenues. Television segment revenues increased 16%, driven by strong political ad spend, NFL viewership, and growth at Tubi.</li> <li>Free cash flow reflected a deficit of $436 million due to seasonality in working capital, with advertising receivables expected to reverse in the second half of the fiscal year.</li> <li>Shareholder returns included $550 million in share buybacks and a 27% dividend increase.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>John Hodulik, UBS: Asked about the D2C launch timeline and affiliate pricing trends. Lachlan Murdoch confirmed the D2C service would launch by year-end, targeting cord-nevers and cord-cutters without affecting traditional distribution customers. Steve Tomsic added that affiliate pricing remained strong due to the focused channel portfolio.</li> <li>Michael Morris, Guggenheim: Questioned sustainability of Fox News advertising strength and the Tubi Super Bowl live stream. Murdoch attributed ad growth to record ratings and over 100 new national advertisers. He highlighted the Super Bowl live stream’s potential to drive first-party data acquisition at minimal cost.</li> <li>Thomas Yeh, Morgan Stanley: Inquired about Tubi’s investment outlook and sports betting licensing. Murdoch stated Tubi’s profitability timeline remains on track and confirmed progress in obtaining sports betting licenses across 26 states.</li> <li>Michael Ng, Goldman Sachs: Asked about subscriber trends and digital investment. Murdoch noted improving subscriber declines at 7% and expressed optimism about the financial potential of new skinny bundles. Tomsic reaffirmed digital losses are on track to decrease significantly this year.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts showed cautious optimism, focusing on D2C plans, Tubi growth, and advertising sustainability. Questions about subscriber declines and digital investment reflected skepticism but were addressed with confident responses.</li> <li>Management remained positive, emphasizing strong financial performance, strategic growth initiatives, and shareholder returns. Murdoch consistently highlighted momentum across key segments, while Tomsic provided detailed financial clarity.</li> <li>Compared to the previous quarter, management’s tone was more confident, backed by record-breaking metrics and clear strategic direction.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Revenue growth accelerated from 11% in Q1 to 20% in Q2, driven by political ad spend and sports programming.</li> <li>Tubi’s revenue growth increased from 19% to 31% quarter-over-quarter, supported by political advertising and audience expansion.</li> <li>Management tone and confidence improved as affiliate renewals were completed and D2C plans progressed.</li> <li>Analysts’ focus shifted from general performance to strategic initiatives like the D2C launch and Tubi’s profitability timeline.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Subscriber declines, while improving, remain a challenge, with cord-cutting trends continuing to affect the traditional cable bundle.</li> <li>Legal hurdles surrounding the Venu sports streaming joint venture were cited as a disappointment, potentially limiting sports content distribution options.</li> <li>Analysts raised concerns about long-term sustainability of advertising demand, particularly at Fox News.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Fox Corporation delivered a record-breaking quarter, driven by strong political ad revenue, robust sports programming, and Tubi’s accelerating growth. The planned D2C launch by year-end 2025 could unlock additional revenue streams while targeting cord-cutters and cord-nevers. With Tubi expected to surpass $1 billion in annual revenue and improving subscriber trends, management’s confidence in its diversified strategy remains high, though challenges in subscriber retention and legal issues around Venu persist.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/FOX/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402749-fox-corporation-targets-d2c-launch-by-year-end-sees-tubi-revenue-crossing-1b-in-fy2025",
            "pub_date": "2025-02-04 18:43:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402739",
            "title": "Evolent Health gains as activist Engaged Capital reaches cooperation agreement",
            "description": "<html><body><p>Evolent Health (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/EVH\" title=\"Evolent Health, Inc.\">EVH</a></span>)<span style=\"color: #008000;\"> rose 1.2%</span> after activist investor Engaged Capital reached a cooperation agreement with the healthcare services company.</p> <p>Evolent (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/EVH\" title=\"Evolent Health, Inc.\">EVH</a></span>) will add Brendan Springstubb to its board, according to a<a href=\"https://seekingalpha.com/pr/19990166-evolent-health-announces-changes-to-board-of-directors\" rel=\"noopener\" target=\"_blank\" title=\" statement \"> statement </a>on Tuesday. Springstubb was previously a<span class=\"paywall-full-content invisible\"> principal at Engaged Capital. He also held multiple roles at Relational Investors. </span></p> <p class=\"paywall-full-content invisible\">Rich Jelinek, who joined the Evolent (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/EVH\" title=\"Evolent Health, Inc.\">EVH</a></span>) board as independent director in 2023, will be named chair at the 2025 annual meeting, succeeding <span class=\"person\">Cheryl Scott</span>. </p> <p class=\"paywall-full-content invisible\">\"Having worked with Brendan for over 15 years, I know he will be a strong shareholder advocate in the Evolent boardroom,\" <span class=\"person\">Glenn W. Welling</span>, Founder and CIO of Engaged Capital, said in the statement. </p> <p class=\"paywall-full-content invisible\">The agreement with Engaged Capital comes after Evolent shares have tumbled almost 60% since early November when the healthcare company released a Q3 earnings report that fell short of Street estimates and<a href=\"https://seekingalpha.com/news/4263578-evolent-stock-tumbles-post-market-on-q3-report-lowered-guidance\" rel=\"noopener\" target=\"_blank\" title=\" lowered its 2024 guidance.\"> lowered its 2024 guidance. </a></p> <p class=\"paywall-full-content invisible\">There was a report in August that several private equity firms were interested in a<a href=\"https://seekingalpha.com/news/4143895-evolent-health-dips-on-report-elevance-dropped-out-of-bidding\" rel=\"noopener\" target=\"_blank\" title=\" potential deal \"> potential deal </a> for Evolent Health.</p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1460028504/image_1460028504.jpg",
            "link": "https://seekingalpha.com/news/4402739-evolent-heallth-gains-as-activist-engaged-capital-reaches-cooperation-agreement",
            "pub_date": "2025-02-04 18:37:05",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402528",
            "title": "Dow, S&P, and Nasdaq rise despite China hitting back with tariffs on U.S. imports",
            "description": "<html><body><p class=\"MsoNormal\">Wall Street trades higher on Tuesday despite the fact that China retaliated with a levy of tariffs on imports of multiple U.S. products.</p> <p class=\"MsoNormal\">Early on and the S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>) was <span style=\"color: #008000;\">+0.4%</span>, the Nasdaq Composite (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/COMP:IND\" title=\"NASDAQ Composite Index\">COMP:IND</a></span></span></span></span></span><span class=\"paywall-full-content invisible\">) was </span><span class=\"paywall-full-content invisible\" style=\"color: #008000;\">+1.1%</span><span class=\"paywall-full-content invisible\">, and the Dow (</span><span class=\"ticker-hover-wrapper paywall-full-content invisible\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DJI\" title=\"Dow Jones Industrial Average Index\">DJI</a></span></span></span></span></span><span class=\"paywall-full-content invisible\">) was near flat.</span></p> <p class=\"MsoNormal paywall-full-content invisible\">The 10-year Treasury yield (<a href=\"https://seekingalpha.com/symbol/US10Y\" title=\"United States 10-Year Bond Yield\">US10Y</a>) rose 1 basis point to 4.58%. The 2-year yield (<a href=\"https://seekingalpha.com/symbol/US2Y\" title=\"United States 2-Year Bond Yield\">US2Y</a>) fell 1 basis point to 4.24%.</p> <p class=\"MsoNormal paywall-full-content invisible\">The tech focused Nasdaq has been helped by shares of Palantir Technologies (<a href=\"https://seekingalpha.com/symbol/PLTR\" title=\"Palantir Technologies Inc.\">PLTR</a>) which popped over <span style=\"color: #008000;\">25%</span> after the firm's fourth quarter 2024 results and outlook blasted past expectations.</p> <p class=\"MsoNormal paywall-full-content invisible\">On the tariff front, the <a href=\"https://seekingalpha.com/news/4402411-tit-for-tat-china-hits-back-with-tariffs-on-u_s_-coal-lng-vehicles\" rel=\"noopener\" target=\"_blank\" title=\"Chinese government\">Chinese government</a> said it would implement a 15% tariff on coal and liquefied natural gas products, as well as a 10% tariff on crude oil, agricultural machinery, and large-displacement cars.</p> <p class=\"MsoNormal paywall-full-content invisible\">Wall Street closed lower on Monday after President Donald Trump announced new tariffs on Canada and Mexico over the weekend. While it was a red day, markets were able to recoup some earlier losses after delays were announced against tariffs towards Mexico.</p> <p class=\"MsoNormal paywall-full-content invisible\">\"The past 24 hours have seen a big roundtrip for many assets classes as strongly negative sentiment gave way to a relief rally on news that the planned 25% tariffs against Mexico and Canada would be delayed,\" Deutsche Bank's Jim Reid said.</p> <p class=\"MsoNormal paywall-full-content invisible\">\"Taxing goods from China is still happening, and China has retaliated. The inflation consequences of these taxes are less obvious to US consumers,\" UBS' Paul Donovan said.</p> <p class=\"MsoNormal paywall-full-content invisible\">On the earnings side, Google parent <a href=\"https://seekingalpha.com/news/4402150-alphabet-q4-preview-eyes-on-ad-business-cloud-sales-and-capital-spend\" rel=\"noopener\" target=\"_blank\" title=\"Alphabet\">Alphabet</a> (<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>) (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>) is expected to release its fourth quarter results today. </p> <p class=\"MsoNormal paywall-full-content invisible\"><a href=\"https://seekingalpha.com/news/4402730-factory-orders-fall-more-than-expected-in-december\" rel=\"noopener\" target=\"_blank\" title=\"U.S. factory orders\">U.S. factory orders</a> fell 0.9% M/M to $578.5B in December. Additionally, <a href=\"https://seekingalpha.com/news/4402713-job-openings-drop-more-than-expected-in-december-hiring-rate-stagnates\" rel=\"noopener\" target=\"_blank\" title=\"job openings\">job openings</a> drop more than expected in December while hiring rate stagnates.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/165581156/image_165581156.jpg",
            "link": "https://seekingalpha.com/news/4402528-sp500-nasdaq-dow-jones-outlook-stock-market",
            "pub_date": "2025-02-04 18:34:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402742",
            "title": "Glucotrack soars on completion of first human clinical study of continuous blood glucose monitor",
            "description": "<html><body><p>Glucotrack (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/GCTK\" title=\"GlucoTrack, Inc.\">GCTK</a></span>) on Tuesday reported the successful completion of its first in human clinical study, sending shares up <span style=\"color: #008000;\">~60% </span>in the morning trade.</p> <p>This study represents first real-time, continuous blood glucose monitor (CBGM) placed in the subclavian vein, offering the potential for direct blood<span class=\"paywall-full-content invisible\"> glucose measurement without the limitations often seen with traditional continuous glucose monitors, the company said.</span></p> <p class=\"paywall-full-content invisible\">“While neither the study nor prototype system was designed to evaluate sensor accuracy, the system performed as expected with similar accuracy results as previously seen in our animal studies,” said Glucotrack (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/GCTK\" title=\"GlucoTrack, Inc.\">GCTK</a></span>) CEO <span class=\"person\">Paul V. Goode</span>. </p> <p class=\"paywall-full-content invisible\">“With these positive results, the promise of continuous blood glucose monitoring is one step closer to reality.”</p> <p class=\"paywall-full-content invisible\">The study met its primary endpoint, with no procedure or device related serious adverse events reported from implant through seven days post-removal of the CBGM sensor lead. </p> <p class=\"paywall-full-content invisible\">Glucotrack (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/GCTK\" title=\"GlucoTrack, Inc.\">GCTK</a></span>) is down 84% year-to-date.</p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1215230221/image_1215230221.jpg",
            "link": "https://seekingalpha.com/news/4402742-glucotrack-soars-on-completion-of-first-human-clinical-study-of-continuous-blood-glucose-monitor",
            "pub_date": "2025-02-04 18:34:20",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402668",
            "title": "Regeneron's new dividend, Dupixent growth support strong Q4",
            "description": "<html><body><ul> <li>While Regeneron's (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/REGN\" title=\"Regeneron Pharmaceuticals, Inc.\">REGN</a></span>) Q4 financial results were a top and bottom line beat, perhaps the biggest development from the release was the announcement of the company's first dividend payment.</li> <li>It will be a quarterly dividend of $0.88/share for a 0.53% forward yield. It<span class=\"paywall-full-content invisible\"> is payable March 20 for shareholders of record as of Feb. 20.</span> </li> <li class=\"paywall-full-content invisible\">In the quarter, Regeneron (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/REGN\" title=\"Regeneron Pharmaceuticals, Inc.\">REGN</a></span>) <a href=\"https://seekingalpha.com/news/4402560-regeneron-pharmaceuticals-beats-top-line-and-bottom-line-estimates-initiates-fy25-outlook\" target=\"_self\" title=\"saw\">saw</a> its non-GAAP net income increase 2% to ~$1.4B ($12.07 per share, diluted).</li> <li class=\"paywall-full-content invisible\">Global sales of Dupixent (dupilumab), which is co-marketed with Sanofi (<a href=\"https://seekingalpha.com/symbol/SNY\" title=\"Sanofi\">SNY</a>) rose 15% to $3.7B compared to Q4 2023.</li> <li class=\"paywall-full-content invisible\">Worldwide sales for the Eylea (aflibercept) franchise rose 2% year over year to $1.5B.</li> <li class=\"paywall-full-content invisible\">In the quarter, Regeneron also repurchased $976M worth of stock.</li> </ul> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/186281544/image_186281544.jpg",
            "link": "https://seekingalpha.com/news/4402668-regeneron-new-dividend-dupixent-growth-support-strong-q4",
            "pub_date": "2025-02-04 18:27:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402744",
            "title": "Premier raises EPS guidance amid supply chain services growth and new member wins",
            "description": "<html><body><p>Earnings Call Insights: Premier, Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/PINC\" title=\"Premier, Inc.\">PINC</a></span>) Q2 2025</p> <h3>Management View</h3> <ul> <li>President and CEO Michael J. Alkire stated that overall revenue and profitability for the first half of fiscal 2025 aligned with expectations, driven by better-than-expected results in the supply chain services segment. The<span class=\"paywall-full-content invisible\"> company reaffirmed total net revenue guidance and raised its adjusted EPS guidance despite challenges in the performance services segment. </span> </li> <li class=\"paywall-full-content invisible\">The company announced the successful transition of its digital supply chain strategy beyond the pilot phase, signing its first agreement with a major partner. This reflects the growing demand for Premier's provider-focused data and market intelligence.</li> <li class=\"paywall-full-content invisible\">David Zito was introduced as the new President of Performance Services, bringing extensive healthcare consulting expertise to drive innovation and growth in the segment.</li> <li class=\"paywall-full-content invisible\">CFO Glenn Coleman highlighted that second-quarter revenue and adjusted EBITDA were below expectations, but adjusted EPS of $0.25 met expectations due to share repurchases. He noted that net revenue of $240 million reflected a decline, primarily driven by lower net administrative fees in Supply Chain Services and decreased consulting revenue in Performance Services.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Premier raised its adjusted EPS guidance midpoint by $0.08, reflecting the positive impact of the $200 million share repurchase completed in January. </li> <li>Supply Chain Services revenue guidance midpoint was increased by $25 million due to favorable fee share trends and new member wins, including AllSpire Health Partners.</li> <li>The company anticipates flat to slightly higher net administrative fees in the third quarter, followed by a sequential increase in the fourth quarter as new member spending ramps up. Performance Services revenue is expected to remain back-end weighted, with stronger contributions in the fourth quarter.</li> <li>Adjusted EBITDA and adjusted EPS for the second half of fiscal 2025 are projected to be slightly more weighted toward the fourth quarter.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Revenue for Q2 2025 was reported at $240 million, below analysts’ revenue estimate of $243.2 million. Adjusted EPS of $0.25 also missed analysts’ estimate of $0.30.</li> <li>GAAP net loss from continuing operations was $46 million, primarily driven by a $127 million goodwill impairment charge related to the Performance Services segment.</li> <li>Adjusted EBITDA was $50 million, with a margin of 20.8%, impacted by lower revenue. </li> <li>Free cash flow for the first half of fiscal 2025 totaled $74 million, up $33 million year-over-year, supported by a derivative lawsuit settlement and minority investment distributions. </li> <li>As of December 31, 2024, cash and cash equivalents stood at $86 million, with $100 million outstanding on the company’s $1 billion credit facility.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Michael Cherny, Leerink Partners: Questioned the company's strategies to address potential tariff impacts and ensure supply chain resiliency. CEO Alkire responded that contracts include protections against taxes and tariffs, and efforts are ongoing to diversify suppliers and reduce reliance on Southeast Asia.</li> <li>Eric Percher, Nephron Research: Sought clarification on the drivers behind the improved net administrative fees performance. CFO Coleman stated that growth in gross administrative fees, favorable fee share impacts, and new member wins contributed positively.</li> <li>Kevin Caliendo, UBS: Asked about the confidence behind the anticipated fourth-quarter strength in Performance Services. CFO Coleman attributed this to a strong funnel in Applied Sciences, timing of enterprise license agreements, and leadership efforts to build collaborative capabilities.</li> <li>Richard Close, Canaccord Genuity: Inquired about consulting services challenges. CEO Alkire emphasized efforts to refresh advisory capabilities with technology-driven solutions and co-management opportunities to meet market demands.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed concerns over tariff impacts, Performance Services weakness, and the goodwill impairment charge. Their tone was slightly negative but constructive, indicating interest in understanding mitigation strategies.</li> <li>Management displayed confidence during prepared remarks, particularly in Supply Chain Services and strategic initiatives like digital supply chain advancements. However, there was a slightly defensive tone during Q&amp;A, with responses emphasizing ongoing efforts to address challenges.</li> <li>Compared to the previous quarter, analysts appeared more focused on risks, while management maintained a consistent tone of optimism about long-term strategies.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Adjusted EPS guidance was raised this quarter, unlike Q1 2025, when guidance was reaffirmed. Revenue performance in Q2 2025 fell below expectations, contrasting with Q1's stronger-than-expected results.</li> <li>Strategic focus shifted to digital supply chain advancements and leadership changes in Performance Services, while Q1 emphasized contract renewals and hurricane-related supply chain mitigation.</li> <li>Analysts showed increased interest in tariff impacts and net administrative fees dynamics this quarter, compared to broader utilization and contract penetration discussions in Q1.</li> <li>Management's confidence in long-term strategies remained consistent, with enhanced focus on addressing short-term headwinds in Performance Services.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>A $127 million goodwill impairment charge in the Performance Services segment highlighted challenges in the data and technology business.</li> <li>Analysts raised concerns about potential tariff impacts on supply chains and Premier’s ability to mitigate associated risks.</li> <li>Declining consulting revenue and a shift from license agreements to SaaS subscription engagements in Applied Sciences posed short-term headwinds.</li> <li>Potential impacts of member departures and the ongoing contract renewal process added operational uncertainty.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Premier, Inc. demonstrated resilience in its supply chain services segment, driven by favorable administrative fee trends and new member wins. However, challenges in the Performance Services segment, including a significant goodwill impairment charge, tempered overall results. Management's efforts to advance digital supply chain strategies and strengthen Performance Services under new leadership provide a pathway for future growth, but near-term headwinds warrant close monitoring by investors.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/PINC/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402744-premier-raises-eps-guidance-amid-supply-chain-services-growth-and-new-member-wins",
            "pub_date": "2025-02-04 18:28:31",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402705",
            "title": "SA Sentiment: Trump tariffs are paused, but still lack support",
            "description": "<html><body><p>Tariffs have been in the spotlight since Donald Trump took office, and any development has prompted swift reaction in equity markets. </p> <p>Trump over the weekend announced 25% tariffs on Mexico and Canada, starting a trade war as both countries vowed to retaliate<span class=\"paywall-full-content invisible\"> with their own duties. This led to a market selloff on Monday as traders fled to safe-haven assets like gold. </span></p> <p class=\"paywall-full-content invisible\">But the White House later agreed to <a href=\"https://seekingalpha.com/news/4402020-us-to-delay-tariffs-on-mexico-after-mexico-agrees-to-deploy-10000-border-troops\" rel=\"noopener\" target=\"_blank\" title=\"delay tariffs\">delay the tariffs</a> for a month after the two countries committed to reinforce <a href=\"https://seekingalpha.com/news/4402333-us-will-delay-canada-tariffs-as-countries-work-on-beefing-up-border-security\" rel=\"noopener\" target=\"_blank\" title=\"border security\">border security</a>, leading to markets <a href=\"https://seekingalpha.com/news/4402227-nasdaq-sp-and-dow-closed-lower-to-start-the-week-as-tariff-talks-heat-up\" rel=\"noopener\" target=\"_blank\" title=\"paring\">paring</a> some losses. </p> <p class=\"paywall-full-content invisible\">Trump also announced 10% tariffs on China, which will go into effect on Tuesday, for now. Trump plans to speak with Chinese President Xi Jinping some time this week, so markets are expecting some updates here.</p> <p class=\"paywall-full-content invisible\">It appears as though Wall Street's initial expectations of Trump using tariffs as a bargaining chip may have been right after all. But the tariffs are quite unpopular with Seeking Alpha readers.</p> <p class=\"paywall-full-content invisible\">According to Monday's <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfw-AEV6C7-u7rWRpnRsG7JCXcQ40PnjDse9O9GUNVe8L7EHg/viewanalytics\" rel=\"noopener\" target=\"_blank\" title=\"Sentiment Survey\">Sentiment Survey</a>, more than three-quarters of the nearly 5,000 respondents do not support the new tariffs on Canada, Mexico and China.</p> <p class=\"paywall-full-content invisible\"> </p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><a href=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/4f7eba015a6268a5eb18249a28928e36.png\" rel=\"lightbox\"><img alt=\"Seeking Alpha survey results\" data-caption=\"\" data-original-src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/4f7eba015a6268a5eb18249a28928e36.png\" data-source=\"Seeking Alpha\" height=\"455\" src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/4f7eba015a6268a5eb18249a28928e36.png?io=getty-c-w900\" width=\"805\"/></a><figcaption class=\"overlay-title\"><p class=\"item-caption\"><span class=\"item-source\">Seeking Alpha</span></p></figcaption></figure><p class=\"paywall-full-content invisible\"> </p> <p class=\"paywall-full-content invisible\">Investing Group Leader Lawrence Fuller warned that <a href=\"https://seekingalpha.com/article/4754609-tariffs-wont-last-but-the-uncertainty-will-weigh-heavily\" rel=\"noopener\" target=\"_blank\" title=\"tariff threats damage\">tariff threats damage</a> investor, consumer, and business sentiment, and increase uncertainty. \"I believe Trump will ultimately retract the tariffs due to their widely advertised negative economic impacts, including reduced GDP and S&amp;P 500 earnings.\"</p> <p class=\"paywall-full-content invisible\">On the other hand, James Foord believes tariffs are just what the market needs. \"Tariffs can <a href=\"https://seekingalpha.com/article/4754343-trump-tariffs-just-what-market-needs\" rel=\"noopener\" target=\"_blank\" title=\"reduce economic activity\">reduce economic activity</a> and act as a sales tax, which could help ease inflation and set the stage for renewed quantitative easing.\"</p> <p class=\"paywall-full-content invisible\">As for Trump using tariffs <a href=\"https://seekingalpha.com/article/4754419-lets-talk-about-tariffs\" rel=\"noopener\" target=\"_blank\" title=\"as a negotiating tactic\">as a negotiating tactic</a>, SA analyst Cullen Roche said it could potentially get countries to do his bidding. \"But how much pain is Trump willing to endure to play this game of chicken?\"</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/926907538/image_926907538.jpg",
            "link": "https://seekingalpha.com/news/4402705-sa-sentiment-trump-tariffs-are-paused-but-still-lack-support",
            "pub_date": "2025-02-04 18:22:23",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402740",
            "title": "Small Caps could have an opportunity in a trade war scenario – Barclays",
            "description": "<html><body><p class=\"MsoNormal\">The one-month delay of tariffs against Mexico and Canada turnaround highlights the exceptional uncertainty surrounding a trade war that has price reaction and interest rate implications, according to Stefano Pascale, head of equity derivatives strategy at Barclays.</p> <p class=\"MsoNormal\">Barclays economists believe<span class=\"paywall-full-content invisible\"> that the implementation of 25% tariffs would boost U.S. CPI and PCE inflation by 10-15 basis points on a percentage year-over-year basis and hit GDP by about 25-50 basis points. The Federal Reserve would then face an inflationary economy and could be forced to cut interest rates more aggressively.</span></p> <p class=\"MsoNormal paywall-full-content invisible\">“Insofar as the recent events represent one salvo in a trade war, and to the extent that it matters greatly for the Fed reaction, this debate will remain crucial for equity markets,” said Pascale.</p> <p class=\"MsoNormal paywall-full-content invisible\">Markets expectations around Federal Reserve cuts did not change much in the past few days, but if the Fed is forced to aggressively reduce rates in response to lower growth, “small caps could actually outperform on an equity sell-off.”</p> <p class=\"MsoNormal paywall-full-content invisible\">If this were to happen, analysts said, they recommend investors to buy S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SPX\" title=\"S&amp;P 500 Index\">SPX</a>) puts “partly funded by selling Russell 2000 (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/RTY\" title=\"Russell 2000 Index\">RTY</a></span></span>) puts.”</p> <p class=\"MsoNormal paywall-full-content invisible\">“To hedge such a potential scenario, we would consider buying S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SPX\" title=\"S&amp;P 500 Index\">SPX</a>) June 25 6150 puts (ref. 5994.57, 51-delta) and selling 0.7x Russell 2000 (<a href=\"https://seekingalpha.com/symbol/RTY\" title=\"Russell 2000 Index\">RTY</a>) June 25 2300 puts (ref. 2258.42, 49-delta) for zero at inception.”</p> <p class=\"MsoNormal paywall-full-content invisible\">“At current costs, the historical return would have been favorable, especially in the wings (average gains greater than 90<sup>th</sup> percentile of 8.7% is 1.5x larger than the average loss greater than 95th percentile of -6.0%).”</p> <p class=\"MsoNormal paywall-full-content invisible\">To conclude, Pascale said that a trade war would be more damaging to internationally exposed companies. Lower interest rates would also be more beneficial to small caps (<a href=\"https://seekingalpha.com/symbol/IWM\" title=\"iShares Russell 2000 ETF\">IWM</a>), (<a href=\"https://seekingalpha.com/symbol/RTY\" title=\"Russell 2000 Index\">RTY</a>).</p> <p class=\"MsoNormal paywall-full-content invisible\">Lastly, CTAs (commodity trading advisors) positioning on the Russell 2000 (<a href=\"https://seekingalpha.com/symbol/RTY\" title=\"Russell 2000 Index\">RTY</a>) is currently the most short, while S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>), (<a href=\"https://seekingalpha.com/symbol/SPX\" title=\"S&amp;P 500 Index\">SPX</a>) exposure is higher.</p> <p class=\"MsoNormal paywall-full-content invisible\">“The RTY vs. S&amp;P volatility spread has compressed materially over the past month, but remains historically high; notably, the onset of the trade war during Trump 1.0 marked a regime shift lower in the spread from levels comparable to present,” he said.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1484268303/image_1484268303.jpg",
            "link": "https://seekingalpha.com/news/4402740-small-caps-could-have-an-opportunity-in-a-trade-war-scenario-barclays",
            "pub_date": "2025-02-04 18:23:32",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402657",
            "title": "Juniper upgraded ahead of earnings as potential acquisition by HPE heads to court",
            "description": "<html><body><p>Juniper Networks (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/JNPR\" title=\"Juniper Networks, Inc.\">JNPR</a></span>) was upgraded to Outperform from In Line by Evercore ISI ahead of its Q4 2024 earnings report and a looming case by the U.S. Department of Justice regarding a planned $14B acquisition by Hewlett Packard Enterprise (<span class=\"ticker-hover-wrapper paywall-full-content invisible\">NYSE:<a href=\"https://seekingalpha.com/symbol/HPE\" title=\"Hewlett Packard Enterprise Company\">HPE</a></span><span class=\"paywall-full-content invisible\">).</span></p> <p class=\"paywall-full-content invisible\">Evercore believes there is upside to Juniper shareholders regardless of the outcome in the upcoming <a href=\"https://seekingalpha.com/news/4402200-juniper-networks-drops-as-biden-appointee-named-as-judge-to-preside-over-hpe-case\" rel=\"noopener\" target=\"_blank\" title=\"trial\">trial</a>.</p> <p class=\"p1 paywall-full-content invisible\">\"HPE is successful in their bid for JNPR, and JNPR shareholders will end-up with $40/share (15% upside),\" said Evercore analysts, led by Amit Daryanani, in a Tuesday investor note. \"HPE loses the DOJ trial, JNPR is an independent company, and in that scenario we think there are a host of fundamental levers that would make JNPR a good stock in 2025 – networking recovery, MIST share gains, cloud ramps (xAI and more) + margin expansion.\"</p> <p class=\"p1 paywall-full-content invisible\">Regardng the lawsuit, HPE has already received approval for the acquisition by the E.U., United Kingdom, India, South Korea and Australia. However, the U.S. DOJ <a href=\"https://seekingalpha.com/news/4400880-juniper-networks-sinks-after-doj-sues-to-block-14b-sale-to-hewlett-packard-enterprise\" rel=\"noopener\" target=\"_blank\" title=\"argues\">argues</a> that a merger between HPE and Juniper would minimize competition in the enterprise wireless market.</p> <p class=\"p1 paywall-full-content invisible\">Juniper is slated to report its fourth quarter results after the bell today. The consensus <a href=\"https://seekingalpha.com/symbol/JNPR/earnings\" rel=\"noopener\" target=\"_blank\" title=\"estimate\">estimate</a> for adjusted earnings per share is $0.57 on revenue of $1.39B. </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1256603011/image_1256603011.jpg",
            "link": "https://seekingalpha.com/news/4402657-juniper-upgraded-ahead-of-earnings-as-potential-acquisition-by-hpe-heads-to-court",
            "pub_date": "2025-02-04 18:19:45",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}