{
    "data": [
        {
            "id": "4403231",
            "title": "CNH Industrial projects 12%-17% revenue decline in 2025 with focus on inventory reduction",
            "description": "<html><body><p>Earnings Call Insights: CNH Industrial N.V. (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CNH\" title=\"CNH Industrial N.V.\">CNH</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Gerrit Marx emphasized the strategic focus on inventory reduction, cost management, and operational efficiencies to position the company for long-term success. He highlighted a 34% year-over-year reduction in agricultural production hours during<span class=\"paywall-full-content invisible\"> Q4, which helped reduce dealer inventory by over $700 million, though further reductions are planned for the first half of 2025.</span> </li> <li class=\"paywall-full-content invisible\">The company achieved $600 million in cost savings by the end of 2024, on top of $185 million saved in 2023. Marx stated that these structural reductions are crucial for navigating the current market downturn and preparing for the industry's eventual upcycle.</li> <li class=\"paywall-full-content invisible\">CFO Oddone Incisa reported Q4 net sales of industrial activities at $4.1 billion, a 31% year-over-year decline, driven by weaker industry demand and channel destocking. Adjusted diluted EPS for the quarter was $0.15, down from $0.39 in Q4 2023. Free cash flow from industrial activities for Q4 was $848 million, but full-year cash flow ended with an outflow of $401 million.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>CNH Industrial expects global agricultural industry demand to decline by 5%-10% in 2025, translating to a 10%-15% decline for the company due to its exposure to cash crop equipment in North America. Agricultural net sales are forecasted to decrease by 13%-18%, with production hours planned to drop another 15%-20% year-over-year.</li> <li>Construction net sales are expected to decline by 5%-10% in 2025, with EBIT margin projected between 4%-5%. Combined industrial net sales are forecasted to decline 12%-17%, with adjusted EBIT margin anticipated between 6%-7%.</li> <li>The company forecasts full-year EPS for 2025 to range between $0.65 and $0.75. Free cash flow is expected to be positive, ranging from $200 million to $500 million, contingent on working capital dynamics.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Full-year 2024 net sales for industrial activities were $17.1 billion, down 23% year-over-year. Agricultural net sales fell 31% in Q4 and 23% for the full year, while construction net sales declined 33% in Q4 and 22% for the year.</li> <li>Adjusted EBIT margin for industrial activities in Q4 was 7.2%, ending the year at 10.5%. The gross margin for Q4 was 20.6%, impacted by lower volumes but partly offset by cost reduction initiatives.</li> <li>Precision-related components contributed $800 million in 2024 net sales, consistent with overall sales declines. The company increased the share of in-house solutions from 60% in 2023 to 80% in 2024.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Tami Zakaria, JPMorgan: Asked about pricing expectations for 2025 by segment and half-year breakdown. CEO Marx indicated pricing would be flat to slightly positive for the full year, with flat to slightly negative pricing in the first half and potential mid-single-digit growth in the second half.</li> <li>Mig Dobre, Baird: Inquired about potential production adjustments due to tariffs. Marx confirmed the company has flexibility to adjust production and pricing strategies but emphasized the need for stable policy conditions before making significant moves.</li> <li>David Raso, Evercore ISI: Asked about production versus retail alignment by geography. Marx explained that production hours in Q1 2025 are expected to decline by 10%-15% year-over-year, with further reductions in the first half to align with retail demand.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed concern over inventory levels, pricing pressures, and geopolitical uncertainties impacting demand visibility. The tone was slightly negative, with recurring questions about destocking and pricing discipline.</li> <li>Management maintained a cautiously optimistic tone during prepared remarks, citing structural cost improvements and strategic inventory management as key enablers for long-term growth. However, the Q&amp;A session revealed a more defensive tone, especially regarding tariff impacts and production adjustments.</li> <li>Compared to the previous quarter, management appears more focused on mitigating immediate risks while emphasizing long-term positioning.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance language shifted to emphasize a more conservative outlook for 2025, with net sales projected to decline 12%-17% compared to the prior year's forecast of stabilization.</li> <li>Management confidence in structural cost savings and operational efficiencies remains consistent, but analysts' skepticism has increased due to prolonged demand weakness and inventory challenges.</li> <li>Analysts' focus has shifted from production cuts to broader concerns about pricing discipline and geopolitical risks.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management highlighted geopolitical uncertainties, including potential tariffs and the ongoing conflict in Ukraine, as key risks for 2025.</li> <li>Inventory destocking remains a significant challenge, with channel inventory levels still above targets in North America and Europe.</li> <li>Analysts raised concerns about pricing pressures in Latin America and Europe, as well as the potential for further demand deterioration in North America’s cash crop equipment market.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">CNH Industrial is navigating a challenging market environment with strategic cost-saving measures, aggressive inventory management, and a focus on long-term positioning for an industry rebound. While 2025 is expected to be a trough year with significant declines in net sales and production volumes, the company remains committed to maintaining pricing discipline and advancing its product pipeline. However, geopolitical uncertainties and prolonged demand weakness present ongoing risks to near-term performance.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/CNH/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403231-cnh-industrial-projects-12-percentminus-17-percent-revenue-decline-in-2025-with-focus-on",
            "pub_date": "2025-02-05 02:35:47",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403232",
            "title": "Cirrus Logic projects Q4 FY25 revenue of $350M-$410M with PC market expansion",
            "description": "<html><body><p>Earnings Call Insights: Cirrus Logic (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/CRUS\" title=\"Cirrus Logic, Inc.\">CRUS</a></span>) Q3 2025</p> <h3>Management View</h3> <ul> <li><p>CEO John Forsyth highlighted Q3 FY25 revenue of $555.7 million, which exceeded the top end of the guidance range, driven by stronger-than-expected demand for smartphone components. He emphasized strategic progress in maintaining leadership in<span class=\"paywall-full-content invisible\"> smartphone audio, expanding mixed-signal content, and entering new markets such as laptops and automotive.</span></p></li> <li class=\"paywall-full-content invisible\"><p>Forsyth discussed the successful launch of the 22-nanometer smart codec and custom-boosted amplifier, which enhance power efficiency and audio quality in flagship smartphones. These products are expected to contribute sustained revenue over multiple generations.</p></li> <li class=\"paywall-full-content invisible\"><p>The company saw growth in camera controller revenues, benefiting from a favorable mix of smartphones and continued R&amp;D investment to expand camera-related features.</p></li> <li class=\"paywall-full-content invisible\"><p>Forsyth announced the sampling of timing products aimed at the automotive and professional audio markets, signaling potential long-term growth opportunities.</p></li> <li class=\"paywall-full-content invisible\"><p>A leadership change was announced, with Jeff Woolard set to join as CFO, bringing significant semiconductor industry and financial expertise. Interim CFO Ulf Habermann will continue in his role as Principal Accounting Officer.</p></li> <li class=\"paywall-full-content invisible\"><p>Interim CFO Ulf Habermann noted free cash flow of $218.6 million and highlighted a $70 million share repurchase during Q3. The company ended the quarter with $816.6 million in cash and investments.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management guided Q4 FY25 revenue between $350 million and $410 million. GAAP gross margin is expected to range from 51% to 53%, with non-GAAP operating expenses projected between $119 million and $125 million.</p></li> <li><p>Forsyth reiterated the company’s focus on growing the laptop business, expecting fiscal 2026 revenue from this segment to roughly double compared to FY25.</p></li> <li><p>The company anticipates inventory peaking in the first half of FY26 to meet demand and fulfill wafer purchase commitments with GlobalFoundries.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Revenue for Q3 FY25 was $555.7 million, up 3% sequentially but down 10% year-over-year due to lower smartphone unit volumes and one less week in the quarter compared to FY24.</p></li> <li><p>Non-GAAP gross profit was $298.1 million, with a gross margin of 53.6%, reflecting a sequential increase of 140 basis points due to favorable product mix and lower supply chain costs.</p></li> <li><p>Non-GAAP operating income reached $168.9 million, with non-GAAP EPS of $2.51, surpassing analysts' consensus estimate of $2.04.</p></li> <li><p>Cash flow from operations was $218.6 million, with a non-GAAP free cash flow margin of 38%.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Tore Svanberg from Stifel asked about the timing business and whether it leverages MEMS IP. Forsyth clarified that the timing products rely on newly developed IP and are targeted at automotive and professional audio markets. The impact will be long-term, with no immediate material contribution.</p></li> <li><p>Thomas O'Malley from Barclays queried the mix dynamics in the March quarter. Forsyth stated there were no significant mix shifts and noted steady demand in Q3, which slightly exceeded guidance.</p></li> <li><p>David Williams from The Benchmark Company inquired about gross margin drivers. Forsyth attributed the record gross margin to improved efficiencies, supply chain cost reductions, and favorable product mix.</p></li> <li><p>Christopher Rolland from Susquehanna asked about the timeline for HPMS (high-performance mixed-signal) revenue parity with audio. Forsyth indicated it is a mid-to-long-term goal, with HPMS representing a larger portion of the company’s total addressable market.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Analysts expressed cautious optimism, focusing on growth in new markets such as laptops and automotive while probing for clarity on smartphone-related demand trends.</p></li> <li><p>Management's tone during prepared remarks was confident, emphasizing strategic progress and long-term growth opportunities. Forsyth used phrases like \"we are very optimistic\" and \"we are excited\" to convey confidence.</p></li> <li><p>During the Q&amp;A, Forsyth maintained a measured tone, particularly when discussing uncertainties in smartphone seasonality and long-term project timelines.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Revenue grew sequentially from $541.9 million in Q2 FY25 to $555.7 million in Q3 FY25, while gross margin increased from 52.2% to 53.6% due to higher-margin product contributions.</p></li> <li><p>Laptop-related revenue remains on track for low tens of millions in FY25, with expectations for significant growth in FY26.</p></li> <li><p>The Q4 FY25 revenue guidance of $350 million-$410 million represents a significant sequential decline due to seasonal factors and reduced smartphone demand.</p></li> <li><p>Inventory levels increased slightly from $271.8 million in Q2 to $275.6 million in Q3, with further increases expected into early FY26.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management identified potential risks in smartphone unit demand and geopolitical headwinds in the Android market. The company is mitigating these risks by diversifying into new markets such as laptops and automotive.</p></li> <li><p>Analysts raised concerns about seasonality in the March quarter and the potential impact of wafer purchase obligations on inventory levels.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Cirrus Logic delivered robust Q3 FY25 results, exceeding revenue and EPS expectations driven by strong demand for smartphone components and favorable product mix. The company continues to diversify its portfolio with significant progress in laptops and automotive markets. While Q4 guidance reflects seasonal headwinds, management remains optimistic about long-term growth opportunities, particularly in high-performance mixed-signal solutions and new market segments. The addition of a new CFO underscores the company’s focus on executing its strategic vision for sustained shareholder value.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/CRUS/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403232-cirrus-logic-projects-q4-fy25-revenue-of-350m-410m-with-pc-market-expansion",
            "pub_date": "2025-02-05 02:46:30",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403229",
            "title": "WEC targets $5.17-$5.27 EPS for 2025 with $28B capital plan expansion",
            "description": "<html><body><p>Earnings Call Insights: WEC Energy Group (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/WEC\" title=\"WEC Energy Group, Inc.\">WEC</a></span>) Q4 2024 </p> <h3>Management View</h3> <ul> <li>Scott Lauber, CEO, highlighted that WEC Energy Group delivered $4.88 in adjusted EPS for 2024, exceeding expectations despite weather challenges. He reiterated the company’s commitment to a long-term EPS growth rate of 6.5%-7% and reaffirmed<span class=\"paywall-full-content invisible\"> the 2025 guidance of $5.17-$5.27 per share.</span> </li> <li class=\"paywall-full-content invisible\">The company announced a $28 billion five-year capital plan, its largest ever, driven by economic growth in Wisconsin. Investments include $9.1 billion for renewable energy and 4,300 megawatts of generation capacity.</li> <li class=\"paywall-full-content invisible\">Lauber emphasized significant data center developments, including Microsoft's $3.3 billion investment and Cloverleaf’s 1,700-acre project, both expected to drive incremental demand. \"Microsoft purchased an additional 240 acres of land last week for another data center development,\" Lauber noted.</li> <li class=\"paywall-full-content invisible\">CFO Xia Liu explained that 2024 adjusted EPS increased by $0.25 year-over-year, overcoming a $0.25 weather-related headwind through operational initiatives. Liu also highlighted reduced O&amp;M growth at 2% versus the original 6%-7% guidance.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>WEC reaffirmed its annual 2025 EPS guidance range of $5.17-$5.27, supported by economic growth and a robust capital plan.</li> <li>First quarter 2025 earnings are projected between $2.13 and $2.23 per share, assuming normal weather for the rest of the quarter.</li> <li>Management indicated continued investments in reliability and a balanced mix of renewable and natural gas generation. The company expects its Wisconsin weather-normal retail electric sales to grow 0.7% in 2025 and retail gas sales to grow 1.9%.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Adjusted EPS for 2024 reached $4.88, compared to $4.63 in 2023, despite the warmest winter on record. </li> <li>Utility operations added $0.06 per share year-over-year, with rate-based growth offsetting higher O&amp;M and interest expenses.</li> <li>The American Transmission Company contributed an additional $0.07 per share, supported by capital investments and FERC's ruling on a 10.48% ROE.</li> <li>WEC's infrastructure segment generated $0.13 per share growth, driven by renewable investments and tax credits.</li> <li>O&amp;M expenses rose 2% year-over-year, significantly lower than the initially guided 6%-7% increase.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Shar Pourreza, Guggenheim Partners, asked about the timing and impacts of the Cloverleaf data center project. CEO Lauber confirmed the project remains in early stages and its potential one-gigawatt load is incremental to the current plan.</li> <li>Bill Appicelli, UBS, inquired about additional generation investments to support future demand. Lauber stated that new projects like Cloverleaf and Microsoft's expansion would likely require further investments in both natural gas and renewables.</li> <li>Julien Dumoulin-Smith, Jefferies, asked about the timeline for megawatt demand growth. Lauber noted that while some projects might start construction this fall, substantial energy flow is expected in 2028-2029.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed cautious optimism, focusing on the potential for incremental demand from data centers and its impact on future capital needs. Questions revolved around capacity, regulatory approvals, and economic growth.</li> <li>Management maintained a confident tone, emphasizing strong execution on capital plans and economic development opportunities. CEO Lauber frequently used affirming phrases such as \"we are confident\" and \"all positive.\"</li> <li>Compared to the previous quarter, management's sentiment remained steady, with continued optimism about Wisconsin's economic prospects and renewable expansion.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance reaffirmed at $5.17-$5.27 for 2025, consistent with Q3 statements.</li> <li>Incremental updates included Microsoft's land acquisition and Cloverleaf’s data center announcement, signaling increased demand projections in Wisconsin.</li> <li>Reduced O&amp;M growth in 2024 (2% vs. Q3 projection of 6%-7%) highlighted cost control measures.</li> <li>Analysts' questions shifted slightly from Illinois regulatory uncertainties in Q3 to data center-related demand growth in Q4.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management acknowledged regulatory uncertainties in Illinois, particularly regarding the Safety Modernization Program.</li> <li>Analysts raised concerns about capacity constraints and the lead time required for new generation development to meet rising demand from data centers.</li> <li>CEO Lauber highlighted potential risks from tariffs and supply chain challenges but expressed confidence in mitigating these impacts.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">WEC Energy Group demonstrated strong execution in Q4 2024 with a record capital plan and adjusted EPS near the top of guidance. The company’s strategic focus on renewable energy and economic growth in Wisconsin, including significant data center developments, positions it well for sustained performance. Management’s reaffirmation of 2025 guidance and disciplined expense management further underscore WEC’s growth trajectory, while incremental demand projections signal potential upside for future capital investments.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/WEC/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403229-wec-targets-5_17-5_27-eps-for-2025-with-28b-capital-plan-expansion",
            "pub_date": "2025-02-05 02:23:09",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403226",
            "title": "BNP Paribas sees 8% EPS growth CAGR through 2026 with strategic expansions",
            "description": "<html><body><p>Earnings Call Insights: BNP Paribas SA (<a href=\"https://seekingalpha.com/symbol/BNPQF\" title=\"BNP Paribas SA\">OTCQX:BNPQF</a>) Q4 2024</p> <h3>Management View</h3> <ul> <li>Jean-Laurent Bonnafé announced a 16% year-over-year increase in Q4 2024 net profit to €2.3 billion, driven by a 10.8% revenue growth, a 6.5-point jaws effect, and a low cost of risk. He highlighted a CET1 ratio<span class=\"paywall-full-content invisible\"> increase to 12.9%, supported by retained earnings and securitization operations.</span> </li> <li class=\"paywall-full-content invisible\">The CEO confirmed a 60% payout ratio for 2024, including a €4.79 dividend per share and a €1.08 billion share buyback program. Additionally, BNP Paribas will implement an interim dividend equivalent to 50% of H1 EPS, payable from September 2025.</li> <li class=\"paywall-full-content invisible\">Lars Machenil emphasized the strength of CIB with 20.1% revenue growth, particularly in global markets (32.4% growth). CPBS revenue increased by nearly 5%, while IPS posted 8.4% growth, mainly from insurance, wealth management, and asset management.</li> <li class=\"paywall-full-content invisible\">Machenil highlighted €600 million of additional savings targeted for 2026, complementing the previously announced €600 million for 2025, while noting efficiency improvements through cost discipline and outsourcing initiatives.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management reaffirmed its 2026 targets, including an 11.1% return on tangible equity for 2025, 12% for 2026, and an EPS growth CAGR of more than 8%. Lars Machenil stated the bank is \"FRTB-ready\" for January 2026.</li> <li>Bonnafé outlined plans to enhance CPBS profitability, aiming for a return on national equity of 17% by 2028, while continuing strategic investments in insurance, asset management, and wealth management.</li> <li>BNP Paribas expects Eurozone commercial banks to benefit from normalized yield curves, targeting 3% top-line growth in 2025 and higher growth in 2026.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Group revenues grew by 10.8% year-over-year in Q4 2024. CIB achieved notable gains with 20.1% revenue growth, driven by strong performances in global banking, global markets, and securities services.</li> <li>CPBS revenues increased nearly 5%, supported by higher deposits and stable loans. The specialized businesses within CPBS experienced stable results despite ongoing pressure from used car prices at Arval.</li> <li>IPS revenues were up 8.4% year-over-year, with contributions from strong fee growth and assets under management.</li> <li>The cost of risk decreased to 38 basis points, meeting the stated goal to remain below 40 basis points.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Tariq El Mejjad, Bank of America: Questioned the potential return on equity beyond 2026 and the impact of Capital Markets Union (<a href=\"https://seekingalpha.com/symbol/CMU\" title=\"MFS® High Yield Municipal Trust\">CMU</a>). Bonnafé projected a return on tangible equity of 13%-14% by 2030, supported by AXA IM synergies, personal finance improvements, and wealth management expansions.</li> <li>Delphine Lee, JPMorgan: Asked about the revenue trajectory for specialized businesses and Eurozone retail. Lars Machenil confirmed a 2% revenue growth target for specialized businesses, despite a 10% expected decline in Arval revenues due to used car prices. For Eurozone retail, he indicated a 3% growth target for 2025.</li> <li>Joseph Dickerson, Jefferies: Questioned the gap between BNP Paribas' 11.5% 2025 ROTE guidance and consensus at 10.3%. Bonnafé attributed the difference to underestimated CIB and Eurozone commercial bank performance as well as external growth contributions.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed concerns over the timing of Eurozone retail recovery, used car price normalization at Arval, and the potential execution risks in recent acquisitions like AXA IM. Management maintained a confident tone, emphasizing strong growth drivers and operational efficiencies.</li> <li>Management's prepared remarks were optimistic, highlighting strategic progress and solid results. During Q&amp;A, they appeared slightly defensive when addressing detailed queries on ROE targets and the Capital Markets Union.</li> <li>Compared to the previous quarter, management's tone was more assertive, particularly regarding future growth projections and the 2026 trajectory.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 2024 net profit growth of 16% year-over-year marked an acceleration compared to the 5.9% growth in Q3 2024.</li> <li>CIB revenue growth improved significantly, from 9% in Q3 to 20.1% in Q4, supported by robust global markets performance.</li> <li>Cost of risk decreased to 38 basis points in Q4, compared to 32 basis points in Q3, reflecting strong risk management.</li> <li>Management reiterated confidence in a 12% ROTE by 2026, with updated guidance on EPS growth and capital allocation strategies.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Continued normalization of used car prices at Arval could weigh on specialized business revenues in the near term.</li> <li>Potential regulatory headwinds, including Basel IV and FRTB impacts, could affect CET1 ratio flexibility.</li> <li>Execution risks in integrating AXA IM and other acquisitions remain a key concern for analysts.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">BNP Paribas delivered strong Q4 2024 results, supported by robust growth in CIB and IPS, while maintaining cost discipline and low risk levels. Management's confidence in achieving a 12% ROTE by 2026 is bolstered by strategic investments in IPS, efficiency improvements, and a focus on high-growth, high-margin segments. Despite challenges in Eurozone retail and Arval, the bank's proactive measures and clear growth trajectory position it well for sustained profitability.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/BNPQF/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403226-bnp-paribas-sees-8-percent-eps-growth-cagr-through-2026-with-strategic-expansions",
            "pub_date": "2025-02-05 02:06:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403227",
            "title": "Intesa Sanpaolo signals net income surpassing €9B in 2025 driven by fee growth and cost efficiency",
            "description": "<html><body><p>Earnings Call Insights: Intesa Sanpaolo (<a href=\"https://seekingalpha.com/symbol/ISNPY\" title=\"Intesa Sanpaolo S.p.A.\">OTCPK:ISNPY</a>) Q4 2024</p> <h3>Management View</h3> <ul> <li><p>Intesa Sanpaolo delivered a record net income of €8.7 billion in 2024, increasing to €9 billion when adjusted for non-recurring items and managerial actions. CEO Carlo Messina noted, \"This excellent performance enabled us to reward<span class=\"paywall-full-content invisible\"> shareholders with cash dividends of €6.1 billion for 2024.\" The company also announced a €2 billion share buyback, subject to shareholder approval.</span></p></li> <li class=\"paywall-full-content invisible\"><p>Customer financial assets expanded by €77 billion, supported by strong growth in direct deposits, assets under management (<a href=\"https://seekingalpha.com/symbol/AUM\" title=\"Intl Sec Exch ISE Spot AUDUSD Index\">AUM</a>), and assets under administration. Isybank, the company's digital platform, gained over 500,000 new clients in Q4, bringing its total customer base to nearly 900,000.</p></li> <li class=\"paywall-full-content invisible\"><p>CFO Luca Bocca highlighted stable operating costs and a best-in-class cost-income ratio below 43%. He also emphasized the company's resilience in asset quality, with net non-performing loans below €5 billion and a cost of risk at 26 basis points.</p></li> <li class=\"paywall-full-content invisible\"><p>Investments in technology amounted to €4.2 billion, with over 60% of applications cloud-based. The company plans to continue leveraging its digital transformation and efficiency gains.</p></li> <li class=\"paywall-full-content invisible\"><p>Intesa Sanpaolo reached an agreement with BlackRock to create a new digital wealth management platform targeting private and affluent clients in Europe, beginning with Belgium and Luxembourg.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management raised its net income guidance for 2025 to \"well above €9 billion,\" emphasizing sustainability in the coming years. Messina stated, \"Our well-diversified business model for wealth management and protection will deliver in any interest rate scenario.\"</p></li> <li><p>The company anticipates double-digit growth in fees and commissions from its wealth management and protection businesses in 2025. Plans include hiring 800 global advisors to accelerate growth in these sectors.</p></li> <li><p>Intesa Sanpaolo expects operating costs to decline further due to the departure of 4,000 employees in 2025 and continued investments in technology.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Net income for 2024 reached €8.7 billion, with core revenues up 8%. Q4 core revenues rose 2% year-over-year, driven by a 14% rise in commissions and robust insurance income.</p></li> <li><p>Personnel costs in Q4 were impacted by non-recurring variable compensation tied to the company's performance. Administrative costs decreased by 2% for the year.</p></li> <li><p>The common equity Tier 1 (CET1) ratio stood at 13.9%, or 13.3% accounting for the €2 billion share buyback. Liquidity and MREL ratios exceeded targets.</p></li> <li><p>The company reduced its Russia exposure, taking provisions of over €260 million to offset net income generated locally.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Antonio Reale, Bank of America: \"Can NII resilience be sustained in 2025 given deposit growth?\" CEO Messina explained that while reductions in Euribor will negatively affect markdown contributions, positive factors such as hedging strategies, loan growth, and financial portfolio increases will support net interest income. He expects NII to exceed 2023 levels.</p></li> <li><p>Pamela Zuluaga, Morgan Stanley: \"What are the expectations for AUM margins and insurance income?\" Messina noted a potential slight reduction in AUM margins but highlighted the positive trajectory for life insurance inflows, signaling growth in the insurance business for 2025.</p></li> <li><p>Andrea Filtri, Mediobanca: \"How do you interpret the guidance of well above €9 billion?\" Messina clarified that this guidance includes potential net income reaching up to €10 billion, though this is not the base case.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Analysts expressed optimism regarding the company's fee-based growth prospects and strong capital position, though questions on NII demonstrated some caution about interest rate impacts. The overall tone of analysts was slightly positive.</p></li> <li><p>Management maintained a confident tone, emphasizing Intesa's unique positioning in wealth management and digital transformation. Messina frequently underscored the sustainability of net income and capital generation.</p></li> <li><p>Compared to the previous quarter, management demonstrated increased confidence, particularly in fee income growth and digital advancements.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Guidance for 2025 net income improved from \"around €9 billion\" in Q3 to \"well above €9 billion\" in Q4, reflecting stronger confidence in fee-based revenue growth.</p></li> <li><p>Q4 highlighted an acceleration in AUM net inflows, up more than €5 billion, compared to previous quarters. The company also achieved a significant milestone with Isybank's growing user base.</p></li> <li><p>Management tone in Q4 was more assertive, focusing heavily on profitability, digital transformation, and capital distribution strategies.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Analysts raised concerns about potential declines in net interest income due to falling Euribor rates. Management addressed these concerns by pointing to hedging strategies and portfolio growth.</p></li> <li><p>Cost pressures from IT investments and variable compensation were noted, though management emphasized ongoing efficiency initiatives.</p></li> <li><p>Regulatory risks surrounding Basel IV implementation and market volatility were acknowledged but deemed manageable given the company's strong capital position.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Intesa Sanpaolo delivered record financial results in 2024, driven by robust fee-based revenue growth, effective cost management, and strategic investments in technology. With a raised net income guidance of well above €9 billion for 2025 and a focus on wealth management and digital transformation, the company remains poised for sustainable growth. Shareholder rewards through dividends and buybacks further enhance its investment appeal, while its strong capital and liquidity position mitigate potential risks.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/ISNPY/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403227-intesa-sanpaolo-signals-net-income-surpassing-9b-in-2025-driven-by-fee-growth-and-cost",
            "pub_date": "2025-02-05 02:12:13",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403224",
            "title": "Valero Energy announces pricing of $650 million notes offering",
            "description": "<html><body><ul> <li>Valero Energy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/VLO\" title=\"Valero Energy Corporation\">VLO</a></span>) on Tuesday said it has priced a public offering of $650 million aggregate principal amount of 5.150% Senior Notes due 2030.</li> <li>The offering is expected to close on February 7, 2025.</li> <li>Valero intends to use the net<span class=\"paywall-full-content invisible\"> proceeds from the offering for general corporate purposes, including the repayment, repurchase, or redemption of its outstanding 3.650% senior notes due 2025 and 2.850% senior notes due 2025.</span> </li> <li class=\"paywall-full-content invisible\">VLO <span class=\"red\">-0.17%</span> after hours to $142.74.</li> <li class=\"paywall-full-content invisible\">Source: <a href=\"https://seekingalpha.com/pr/19991747-valero-energy-corporation-announces-pricing-of-notes-offering\">Press Release</a> </li> </ul> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403224-valero-energy-announces-pricing-of-650-million-notes-offering",
            "pub_date": "2025-02-05 02:01:04",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403225",
            "title": "KKR Real Estate Finance Trust sees $225M loans closed in January while projecting over $1B repayments in 2025",
            "description": "<html><body><p>Earnings Call Insights: KKR Real Estate Finance Trust Inc. (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/KREF\" title=\"KKR Real Estate Finance Trust Inc.\">KREF</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Matt Salem highlighted KREF's ability to leverage KKR's extensive resources, managing $80 billion of real estate assets globally. He emphasized the company's proactive approach in addressing challenges, which decreased<span class=\"paywall-full-content invisible\"> the watchlist percentage from 13% a year ago to 8%.</span> </li> <li class=\"paywall-full-content invisible\">Salem noted that KREF closed two loans worth $225 million in January, including a four-property multifamily portfolio. He expressed optimism about 2025, stating, \"We continue to feel confident in our offensive positioning and look forward to the opportunity that we have in front of us.\"</li> <li class=\"paywall-full-content invisible\">CFO Kendra Decious reported GAAP net income of $14.6 million or $0.21 per share, along with a book value of $14.76 per share, which is relatively flat quarter-over-quarter. Distributable loss stood at (-$14.7 million) or (-$0.21) per share.</li> <li class=\"paywall-full-content invisible\">President Patrick Mattson revealed $450 million in repayments during Q4, leading to full-year repayments of $1.5 billion. He further noted that KREF repurchased $10 million of stock at an average price of $11.64, underscoring the company’s commitment to shareholder value.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management anticipates over $1 billion in repayments for 2025 and expects originations to exceed repayments in the near term due to low leverage levels. Mattson stated, \"We anticipate originations to outpace repayments in the near term.\"</li> <li>Salem highlighted a robust pipeline, with sentiment around commercial real estate improving and liquidity returning for high-quality assets. He mentioned that the CMBS market had a healthy 2025 pipeline, supported by $3.5 billion in office SASB issuance in 2024.</li> <li>KREF remains focused on high-quality assets in sectors such as multifamily, industrial, and life sciences. Europe was identified as a potential growth market for geographic diversification.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>KREF reported GAAP net income of $14.6 million for Q4 2024, translating to $0.21 per share. Distributable loss was (-$14.7 million) or (-$0.21) per share.</li> <li>Book value at the end of the quarter was $14.76 per share, relatively unchanged from the previous quarter.</li> <li>Cash liquidity remains strong, with $685 million available at the end of Q4.</li> <li>Fourth-quarter repayments totaled $450 million, while full-year repayments reached $1.5 billion, representing 19% of the portfolio.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Tom Catherwood, BTIG: Asked about the timing of repayments and whether $1 billion-plus repayments in 2025 would occur early or be spread out through the year. Patrick Mattson responded that while difficult to forecast, repayments are expected to be \"middle to back-ended\" for the year.</li> <li>Don Fandetti, Wells Fargo: Inquired about book value stability amid cross-currents in the market. CEO Salem acknowledged challenges but indicated an expectation of \"much more book value stability\" moving forward.</li> <li>Steve Delaney, Citizens JMP: Asked about portfolio growth expectations. Mattson projected a steady-state portfolio size of $6.6 billion to $6.7 billion by leveraging current equity and liquidity levels.</li> <li>Jason Sabshon, KBW: Queried about KREF's life science deals. Salem highlighted \"green shoots\" in tenant demand for high-quality assets and expressed optimism about leasing activity in these sectors.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed cautious optimism, focusing on repayment timing, book value stability, and sector-specific risks like life sciences and office assets. Concerns about prolonged macroeconomic uncertainty and interest rate impacts were evident.</li> <li>Management maintained a confident tone in both prepared remarks and Q&amp;A, emphasizing liquidity, proactive asset management, and a robust pipeline. Salem stated, \"We are optimistic heading into 2025,\" signaling confidence in the company's positioning.</li> <li>Compared to the previous quarter, sentiment showed slight improvement, with management projecting more stability and outlining specific growth opportunities.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance language evolved, with management projecting originations to exceed repayments in the near term, contrasting with the prior quarter's focus on cautious portfolio management.</li> <li>Watchlist loans decreased from 13% to 8%, reflecting improved portfolio quality.</li> <li>Liquidity improved quarter-over-quarter, increasing from $638 million to $685 million.</li> <li>Analysts shifted focus from addressing watchlist concerns to exploring growth opportunities, particularly in Europe and data centers.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management acknowledged the potential for further credit migration and challenges in the office sector. They emphasized the need for patience with REO assets, particularly in office and life sciences markets.</li> <li>Analysts raised concerns about prolonged macroeconomic volatility, rising interest rates, and potential impacts on book value stability.</li> <li>KREF plans to mitigate risks through proactive asset management and leveraging KKR's global resources.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">KREF demonstrated progress in addressing portfolio challenges while highlighting growth opportunities for 2025, including over $1 billion in anticipated repayments and robust origination prospects. Management emphasized liquidity strength, improved portfolio quality, and confidence in market positioning, supported by KKR's global platform. Analysts acknowledged positive developments but maintained caution around macroeconomic uncertainties and specific sector risks.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/KREF/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403225-kkr-real-estate-finance-trust-sees-225m-loans-closed-in-january-while-projecting-over-1b",
            "pub_date": "2025-02-05 02:02:20",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403218",
            "title": "Gold extends rise to another record high as uncertainty lingers over Trump policies",
            "description": "<html><body><p>Gold futures added to all-time highs Tuesday, as investors continued to seek safe-haven assets after China retaliated with tariffs on the U.S. in response to President Trump's 10% tariffs on China.</p> <p>There's unease about what may happen, burnishing gold's appeal as<span class=\"paywall-full-content invisible\"> a store of value in uncertain times, and \"Trump's erratic tariff decisions are fuelling further uncertainty, which is benefiting gold as a safe haven,\" Commerzbank analyst Carsten Fritsch </span><a class=\"paywall-full-content invisible\" href=\"https://finance.yahoo.com/news/gold-holds-near-record-high-001514122.html\" rel=\"nofollow\" target=\"_self\" title=\"wrote\">wrote</a><span class=\"paywall-full-content invisible\">.</span></p> <p class=\"paywall-full-content invisible\">The move keeps <a href=\"https://www.wsj.com/finance/commodities-futures/gold-edges-higher-on-safe-haven-demand-a767140c\" rel=\"nofollow\" target=\"_self\" title=\"gold's positive momentum\">gold's positive momentum</a> going after it recorded net outflows in last week's trading, according to data from J.P. Morgan, which said open interest in precious metals fell 4.6%, or $11.3B, for the week ended January 31.</p> <p class=\"paywall-full-content invisible\">The bank attributed the decline to outflows in gold contracts, but it said uncertainty around trade tariffs is pushing investors back into the safe haven asset.</p> <p class=\"paywall-full-content invisible\">The overall upward trend for gold remains intact, and any corrective pullbacks should be seen as buying opportunities since supportive factors have not fundamentally changed, XS.com's Rania Gule said, adding that as markets remain uncertain, gold likely will reamin a focus for investors both as a hedge and an investment opportunity.</p> <p class=\"paywall-full-content invisible\">Front-month Comex gold (<a href=\"https://seekingalpha.com/symbol/XAUUSD:CUR\" title=\"Gold Spot Price\">XAUUSD:CUR</a>) for February delivery finished <span style=\"color: #008000;\">+0.7%</span> to $2,853.30<span style=\"color: #000000;\">/oz, another all-time settlement high, and front-month February silver (<a href=\"https://seekingalpha.com/symbol/XAGUSD:CUR\" title=\"Silver Spot Price\">XAGUSD:CUR</a>) closed <span style=\"color: #008000;\">+1.5%</span> to $32.888/oz, its best settlement since October 30.</span></p> <p class=\"paywall-full-content invisible\"><span style=\"color: #000000;\">ETFs: (<span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/GLD\" title=\"SPDR® Gold Shares ETF\">GLD</a></span>), (<span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/GDX\" title=\"VanEck Gold Miners ETF\">GDX</a></span>), (<a href=\"https://seekingalpha.com/symbol/GDXJ\" title=\"VanEck Vectors Junior Gold Miners ETF\">GDXJ</a>), (<a href=\"https://seekingalpha.com/symbol/IAU\" title=\"iShares Gold Trust ETF\">IAU</a>), (<a href=\"https://seekingalpha.com/symbol/NUGT\" title=\"Direxion Daily Gold Miners Index Bull 2x Shares ETF\">NUGT</a>), (<a href=\"https://seekingalpha.com/symbol/PHYS\" title=\"Sprott Physical Gold Trust\">PHYS</a>), (<a href=\"https://seekingalpha.com/symbol/GLDM\" title=\"World Gold Trust - SPDR Gold MiniShares Trust\">GLDM</a>), (<a href=\"https://seekingalpha.com/symbol/AAAU\" title=\"Goldman Sachs Physical Gold ETF\">AAAU</a>), (<a href=\"https://seekingalpha.com/symbol/SGOL\" title=\"Aberdeen Standard Physical Gold Shares ETF\">SGOL</a>), (<a href=\"https://seekingalpha.com/symbol/RING\" title=\"iShares MSCI Global Gold Miners ETF\">RING</a>), (<a href=\"https://seekingalpha.com/symbol/BAR\" title=\"GraniteShares Gold Trust\">BAR</a>), (<a href=\"https://seekingalpha.com/symbol/OUNZ\" title=\"VanEck Merk Gold Trust\">OUNZ</a>), (<a href=\"https://seekingalpha.com/symbol/SLV\" title=\"iShares Silver Trust ETF\">SLV</a>), (<a href=\"https://seekingalpha.com/symbol/PSLV\" title=\"Sprott Physical Silver Trust\">PSLV</a>), (<a href=\"https://seekingalpha.com/symbol/SIVR\" title=\"Aberdeen Standard Physical Silver Shares ETF\">SIVR</a>), (<a href=\"https://seekingalpha.com/symbol/SIL\" title=\"Global X Silver Miners ETF\">SIL</a>), (<a href=\"https://seekingalpha.com/symbol/SILJ\" title=\"ETFMG Prime Junior Silver Miners ETF\">SILJ</a>)</span></p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1264928464/image_1264928464.jpg",
            "link": "https://seekingalpha.com/news/4403218-gold-extends-rise-to-another-record-high-as-uncertainty-lingers-over-trump-policies",
            "pub_date": "2025-02-05 01:56:06",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403221",
            "title": "Treasury grants 'read-only' access to payments system to Musk DOGE staff",
            "description": "<html><body><ul> <li>The Treasury Department has granted \"read-only\" access to members of the Elon Musk-led Department of Government Efficiency to examine \"coded data\" of the federal government's payment system.</li> <li>Treasury Principal Deputy Assistant Secretary for Legislative Affairs Jonathan Blum, in a Tuesday letter<span class=\"paywall-full-content invisible\"> to Sen. Ron Wyden (D-Ore.), wrote that no requests from agencies requesting payments have been quashed by DOGE's work, </span><em class=\"paywall-full-content invisible\">Bloomberg</em> <a class=\"paywall-full-content invisible\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/treasury-says-musk-team-has-read-only-access-to-payment-data\" rel=\"noopener\" target=\"_blank\" title=\"reported\">reported</a><span class=\"paywall-full-content invisible\">.</span> </li> <li class=\"paywall-full-content invisible\">Wyden had previously messaged Treasury Secretary Scott Bessent about concerns over DOGE access to the system. DOGE is seeking a review of operational efficiency within the system.</li> <li class=\"paywall-full-content invisible\">\"Treasury is committed to safeguarding the integrity and security of the system, given the implications of any compromise or disruption to the US economy,\" Blum wrote.</li> <li class=\"paywall-full-content invisible\"> <strong>Dear readers:</strong> We recognize that politics often intersects with the financial news of the day, so we invite you to <a href=\"https://seekingalpha.com/article/4752436-politics-and-the-markets-020425\" target=\"_self\" title=\"click here to join the separate political discussion\">click here to join the separate political discussion</a>.</li> </ul> <h2 class=\"paywall-full-content invisible\">More on DOGE and Elon Musk</h2> <ul class=\"paywall-full-content invisible\"> <li><p class=\"mb-18 break-words text-6x-large-b text-share-text md:mb-16 lg:text-7x-large-b\" data-test-id=\"post-title\"><a href=\"https://seekingalpha.com/news/4401711-elon-musks-doge-gains-access-to-treasury-departments-payments-system-nyt\" target=\"_self\" title=\"Elon Musk's DOGE gains access to Treasury Department’s payments system: NYT\">Elon Musk's DOGE gains access to Treasury Department’s payments system: NYT</a></p></li> <li><p class=\"mb-18 break-words text-6x-large-b text-share-text md:mb-16 lg:text-7x-large-b\" data-test-id=\"post-title\"><a href=\"https://seekingalpha.com/news/4398674-musk-discussing-blockchain-use-at-department-of-government-efficiency\" target=\"_self\" title=\"Musk discussing blockchain use at Department of Government Efficiency\">Musk discussing blockchain use at Department of Government Efficiency</a></p></li> <li><p class=\"mb-18 break-words text-6x-large-b text-share-text md:mb-16 lg:text-7x-large-b\" data-test-id=\"post-title\"><a href=\"https://seekingalpha.com/news/4401763-musk-calls-usaid-beyond-repair-as-he-moves-to-shut-down-aid-agency\" target=\"_self\" title=\"Musk calls USAID 'beyond repair' as he moves to shut down aid agency\">Musk calls USAID 'beyond repair' as he moves to shut down aid agency</a></p></li> <li><p class=\"mb-18 break-words text-6x-large-b text-share-text md:mb-16 lg:text-7x-large-b\" data-test-id=\"post-title\"><a href=\"https://seekingalpha.com/news/4393877-elon-musk-doubts-doge-can-achieve-2t-in-u-s-budget-cuts-under-trump\" target=\"_self\" title=\"Elon Musk doubts DOGE can achieve $2T in U.S. budget cuts under Trump\">Elon Musk doubts DOGE can achieve $2T in U.S. budget cuts under Trump</a></p></li> </ul></body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2194909034/image_2194909034.jpg",
            "link": "https://seekingalpha.com/news/4403221-treasury-grants-read-only-access-payments-system-musk-doge-staff",
            "pub_date": "2025-02-05 01:59:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403220",
            "title": "Nissan Motor likely to reject Honda offer - reports",
            "description": "<html><body><p>Nissan Motor (<a href=\"https://seekingalpha.com/symbol/NSANY\" title=\"Nissan Motor Co., Ltd.\">OTCPK:NSANY</a>) is prepared to decline a takeover offer from Honda Motor Co. (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/HMC\" title=\"Honda Motor Co., Ltd.\">HMC</a></span>) that would make it a subsidiary of the Japanese carmaker. </p> <p>Nissan (<a href=\"https://seekingalpha.com/symbol/NSANY\" title=\"Nissan Motor Co., Ltd.\">OTCPK:NSANY</a>) plans to hold a board meeting as soon as Wednesday afternoon, where it's<span class=\"paywall-full-content invisible\"> expected to vote against the Honda (</span><span class=\"ticker-hover-wrapper paywall-full-content invisible\">NYSE:<a href=\"https://seekingalpha.com/symbol/HMC\" title=\"Honda Motor Co., Ltd.\">HMC</a></span><span class=\"paywall-full-content invisible\">) offer, according to a</span><a class=\"paywall-full-content invisible\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/nissan-said-likely-to-reject-honda-offer-in-blow-to-tie-up-plan\" rel=\"noopener\" target=\"_blank\" title=\" Bloomberg report \"> Bloomberg report</a><span class=\"paywall-full-content invisible\" style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><a href=\"https://www.bloomberg.com/news/articles/2025-02-04/nissan-said-likely-to-reject-honda-offer-in-blow-to-tie-up-plan\" rel=\"noopener\" target=\"_blank\"> </a></span><span class=\"paywall-full-content invisible\">on Tuesday, which cited a person familiar with the matter. The board's final decision is still in limbo, as some senior executives support Honda (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/HMC\" title=\"Honda Motor Co., Ltd.\">HMC</a><span class=\"paywall-full-content invisible\">) deal. </span></p> <p class=\"paywall-full-content invisible\">Nissan and Honda told Bloomberg that they have not made any announcements about the status of the talks, other than that the discussions are ongoing ahead of<a href=\"https://seekingalpha.com/news/4401315-honda-and-nissan-are-expected-to-announce-merger-plans-within-a-few-weeks\" rel=\"noopener\" target=\"_blank\" title=\" mid-February timing \"> mid-February timing</a> for a deal outline.</p> <p class=\"paywall-full-content invisible\">The Bloomberg report comes after Japan's <a href=\"https://www.asahi.com/articles/AST244RNXT24ULFA01XM.html?iref=comtop_7_01\" rel=\"noopener\" target=\"_blank\" title=\" Asahi newspaper \"> Asahi newspaper </a>said earlier that the two companies may abandon talks due to slow progress. Nissan ADRs<span style=\"color: #ff0000;\"> fell 3%</span> in regular trading on Tuesday, while Honda ADRs <span style=\"color: #008000;\">rose 2.4%.</span></p> <p class=\"paywall-full-content invisible\">Japanese automakers Honda Motor (<a href=\"https://seekingalpha.com/symbol/HMC\" title=\"Honda Motor Co., Ltd.\">HMC</a>) and Nissan (<a href=\"https://seekingalpha.com/symbol/NSANY\" title=\"Nissan Motor Co., Ltd.\">OTCPK:NSANY</a>) in December announced that they had <a href=\"https://seekingalpha.com/news/4389807-honda-rallies-after-merger-talks-with-nissan-are-confirmed\" rel=\"noopener\" target=\"_blank\" title=\"entered into official talks to merge\">entered into official talks to merge</a>. A finished deal would create the world’s third-largest automaker by sales, behind only Toyota (<a href=\"https://seekingalpha.com/symbol/TM\" title=\"Toyota Motor Corporation\">TM</a>) and Volkswagen (<a href=\"https://seekingalpha.com/symbol/VLKAF\" title=\"Volkswagen AG\">OTCPK:VLKAF</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1213537865/image_1213537865.jpg",
            "link": "https://seekingalpha.com/news/4403220-nissan-motor-likely-to-reject-honda-offer-reports",
            "pub_date": "2025-02-05 01:52:24",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}