{
    "data": [
        {
            "id": "4558544",
            "title": "Earnings Snapshot: Duolingo DAU growth slows, EBITDA margins dip before rebounding in Q4, and revenue to rise 15–18% in 2026",
            "description": "<html><body><p data-eci=\"true\"> </p>\n<figure class=\"regular-img-figure\" contenteditable=\"false\"><span><img alt=\" \" data-caption=\"\" data-original-src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/98246b30838349d8022d561fc194e1bf.png\" data-rel=\"lightbox\" data-source=\"Seeking Alpha\" fetchpriority=\"high\" height=\"445\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\" src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/98246b30838349d8022d561fc194e1bf.png?io=w640\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/98246b30838349d8022d561fc194e1bf.png?io=w750 750w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/98246b30838349d8022d561fc194e1bf.png?io=w640 640w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/98246b30838349d8022d561fc194e1bf.png?io=w480 480w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/98246b30838349d8022d561fc194e1bf.png?io=w320 320w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/98246b30838349d8022d561fc194e1bf.png?io=w240 240w\" width=\"900\"/></span><figcaption class=\"overlay-title\"><p class=\"item-caption\"><span class=\"item-source\">Seeking Alpha</span></p></figcaption></figure><p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/98246b30838349d8022d561fc194e1bf.png?io=w640",
            "link": "https://seekingalpha.com/news/4558544-earnings-snapshot-duolingo-dau-growth-slows-ebitda-margins-dip-before-rebounding-in-q4-and-revenue-to-rise-1518-in-2026",
            "pub_date": "2026-02-27 16:26:44",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558548",
            "title": "Compañía de Minas Buenaventura beats Q4 estimates",
            "description": "<html><body><ul>\n<li>Compañía de Minas Buenaventura <a href=\"https://seekingalpha.com/pr/20417059-buenaventura-announces-fourth-quarter-and-full-year-2025-results\">press release</a>  (BVN): Q4  GAAP EPS of $1.51 <font color=\"green\"> beats by $0.75</font>.</li>\n<li>Revenue of $623.4M (+108.1% Y/Y) <font color=\"green\"> beats by $171.8M</font>.</li>\n<li>Buenaventura's 4Q25 consolidated silver production increased by 2% YoY driven by increased production at Tambomayo. Lead production increased by 58% YoY.</li>\n<li>4Q25 EBITDA from direct operations was US$ 353.5 million, compared to US$ 93.4 million reported in 4Q24.</li>\n<li>4Q25 net income reached US$ 383.6 million, compared to US$ 33.6 million in the same period of 2024.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558548-compaa-de-minas-buenaventura-beats-q4-estimates",
            "pub_date": "2026-02-27 16:26:44",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558546",
            "title": "Pebblebrook outlines 2% to 4% RevPAR growth for 2026 while strengthening cost controls and capital flexibility",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Pebblebrook Hotel Trust (PEB) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Jon Bortz, Chairman &amp; CEO, highlighted that \"we wrapped up 2025 with stronger-than-expected fourth quarter growth despite the demand disruption from the government shutdown.\" He emphasized a 2.9% increase in same-property total RevPAR and a 3.9% growth in same-property hotel EBITDA, exceeding the midpoint of the company’s outlook, with performance led by San Francisco, Boston, Chicago, and redeveloped resorts. Bortz indicated that strategic revenue management, prioritizing occupancy to drive incremental profits, would remain core in 2026.</li>\n<li>Raymond Martz, Co-President, CFO, Treasurer &amp; Secretary, stated, \"adjusted EBITDA climbed 11.1% to $69.7 million, about $6 million above the midpoint, supported by strong hotel results, lower corporate G&amp;A and slightly higher-than-expected business interruption income related to LaPlaya.\"</li>\n<li>Bortz further noted, \"the hotel demand growth engines are getting stronger and several of last year's headwinds are fading and should increasingly become tailwinds.\" He added that the company's completed multi-year strategic reinvestment program at resorts is yielding strong returns, citing Newport Harbor Island Resort's total RevPAR increase of 38.5% and EBITDA jump of $9.3 million to $17.7 million for the year. </li>\n<li>The company completed two strategic asset dispositions for over $116 million and repurchased approximately 6.3 million common shares at an average price of $11.37 per share. Martz emphasized, \"these repurchases represent an attractive discount to the underlying value of our portfolio and a high return use of capital that directly increases value per share.\"</li>\n<li>Pebblebrook refinanced near-term maturities with a new $450 million senior unsecured term loan due 2031, extending its debt profile and providing flexibility.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>For the first quarter of 2026, Pebblebrook forecasts RevPAR growth between 7.5% and 9% and total RevPAR growth of 6% to 7.5%. For the full year, RevPAR growth is expected to range from 2% to 4% and total RevPAR between 2.25% and 4.25%.</li>\n<li>As of the end of January, combined group and transient pace for 2026 is ahead by $21 million over last year, with widespread growth except for Washington, D.C.</li>\n<li>The company expects same-property EBITDA to increase by 2.1% to 6% in 2026, with the midpoint at 4%.</li>\n<li>Management described its outlook as \"appropriately cautious given policy and geopolitical risks,\" but indicated confidence in the recovery trajectory and operating efficiencies.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Same-property occupancy rose 190 basis points while ADR declined 1.6%, resulting in a 1.2% RevPAR increase. Non-room RevPAR climbed 5.5%, driving total RevPAR growth of 2.9%.</li>\n<li>For the full year, resort EBITDA increased 1.3%, with redeveloped resorts showing strong performance. LaPlaya Beach Resort and Club recorded $3.1 million in business interruption proceeds in Q4, with total proceeds for 2025 at $12.7 million.</li>\n<li>Pebblebrook invested $74.6 million in capital improvements in 2025 and expects $65 million to $75 million in 2026. Run-rate corporate cash G&amp;A is forecasted to decline modestly in 2026 following a 10% reduction in corporate staffing levels.</li>\n<li>Two hotels were sold in Q4 for over $116 million, with proceeds redeployed to debt reduction and share repurchases. The company reported $150 million of cash on hand and roughly $640 million of revolver capacity.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Bennett Rose, Citigroup: Asked about group side visibility and composition. Jon Bortz responded that most of the pace advantage is in transient segments, with group room nights down 0.6% for the year, ADR up 2.4%, and group revenue up 1.8%. Transient room nights are up 11.6%, ADR up 0.6%, and revenue up 12.2%.</li>\n<li>Richard Hightower, Barclays: Inquired about unlevered cash returns on resort redevelopment CapEx. Raymond Martz explained, \"for these projects, that's actually closer to an ROI -- a cash ROI in that 22% to 26% range... our strategic reinvestment program... we're averaging closer to that 16% to 17% annualized cash-on-cash ROI return.\"</li>\n<li>Cooper Clark, Wells Fargo: Questioned the more conservative implied Q2–Q4 RevPAR guidance. Bortz said, \"we're being very conservative where we don't have full visibility, knowing that there are disruptions that can pop up... implied RevPAR growth of 1% to 2% for our range.\"</li>\n<li>Aryeh Klein, BMO: Asked about the transaction market. Thomas Fisher noted, \"the market is becoming certainly more constructive... debt continues to improve... I think you'll continue to see us be engaged and be heavy participants in the market as well.\"</li>\n<li>Michael Bellisario, Baird: Asked about balancing performance with further asset sales and deleveraging. Bortz replied, \"our strategy continues to be a dual approach... we'll continue to sell assets... and use that capital to do 2 things. One is pay down debt... and two, to buy back our stock, both common and preferred, trading at material discounts.\"</li>\n<li>Chris Darling, Green Street: Asked about lower CapEx and deferred maintenance risk. Bortz said, \"we're not doing a trade-off in capital. We're not deferring capital... we continue to do what we've always done, which is protect the real estate, do all the infrastructure improvement and capital investing.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts displayed a neutral to slightly positive tone, focusing on visibility in group trends, ROI on redevelopment, guidance conservatism, and transaction market prospects, with questions often seeking clarity on cautious assumptions or strategic flexibility.</li>\n<li>Management maintained a positive and confident tone in prepared remarks, emphasizing strong trends, recovery, and capital discipline. In the Q&amp;A, management was measured and sometimes defensive, particularly regarding the rationale for conservative guidance and capital allocation, but consistently provided detailed explanations.</li>\n<li>Compared to the previous quarter, both management and analysts’ tone remains constructive, but there is increased emphasis on risk management and conservatism in forward guidance.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter shows improved RevPAR and EBITDA growth, with San Francisco and resorts as key drivers, compared to the previous quarter’s challenges from government shutdowns and event disruptions.</li>\n<li>Management’s guidance language shifted from \"cautiously optimistic\" to \"appropriately cautious,\" explicitly citing policy and geopolitical risks as reasons for conservatism, despite strong early 2026 trends.</li>\n<li>Analysts’ questions in both quarters focused on group trends, redevelopment ROI, and asset sales, but current quarter exchanges delved further into guidance methodology and capital allocation priorities.</li>\n<li>Strategic focus continues on asset rotation, share buybacks, and efficiency, with greater clarity and confidence in the portfolio’s recovery trajectory.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited policy and geopolitical risks as significant uncertainties, justifying a conservative outlook for 2026.</li>\n<li>Group demand remains soft in government and government-impacted segments, with Bortz noting, \"we do continue to see the same softness when it comes to government and government-related government-impacted industries.\"</li>\n<li>Weather disruptions and macroeconomic shocks were acknowledged as ongoing risks, but management noted improved weather resiliency and insurance settlements at LaPlaya.</li>\n<li>Analyst concerns centered on the sustainability of cost controls, capital allocation discipline, and the risk of deferred maintenance from lower CapEx, which management addressed by emphasizing ongoing investment and asset quality.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Pebblebrook Hotel Trust signals a favorable operating setup for 2026, projecting RevPAR growth between 2% and 4% and maintaining a disciplined approach to cost controls and capital allocation. Management highlights strong recovery in key markets, robust performance at redeveloped resorts, and enhanced financial flexibility through asset sales and refinancing. While policy and geopolitical risks temper the outlook, the company is positioned for continued margin expansion and free cash flow growth, with ongoing investment in property quality and strategic share repurchases supporting long-term value creation.</p>\n<p><a href=\"https://seekingalpha.com/symbol/peb/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558546-pebblebrook-outlines-2-percent-to-4-percent-revpar-growth-for-2026-while-strengthening-cost",
            "pub_date": "2026-02-27 16:21:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558545",
            "title": "Sunoco prices upsized $1.2B senior notes",
            "description": "<html><body><div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558545-sunoco-prices-upsized-12b-senior-notes",
            "pub_date": "2026-02-27 16:21:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558543",
            "title": "Avalon GloboCare announces $9.75M private placement",
            "description": "<html><body><ul>\n<li><span>Avalon GloboCare (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ALBT\" title=\"Avalon GloboCare Corp.\">ALBT</a></span>) announced a private placement to raise up to $9.75M.</span></li>\n<li><span>The offering involves issuing ~6.37M shares plus Series A-1 and A-2 warrants to purchase up to same number of shares, all at $0.51 per share.</span></li>\n<li><span>It provides $3.25M in upfront gross proceeds, with potential additional $6.5M if warrants are fully exercised on a cash basis.</span></li>\n<li><span>The net proceeds will repay certain debt and support general working capital needs.</span></li>\n<li><span>The offering is expected to close on February 27, 2026.</span></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558543-avalon-globocare-announces-9_75m-private-placement",
            "pub_date": "2026-02-27 16:15:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558532",
            "title": "Venezuela oil sales under U.S. deal seen hitting $2B by February-end, Wright says",
            "description": "<html><body><p data-eci=\"true\">Sales of Venezuelan oil under the flagship supply agreement with the United States are expected to reach $2B by the end of February, U.S. Energy Secretary Chris Wright told reporters in Texas on Thursday.</p>\n<p>The deal, which began after U.S. forces captured President Nicolás Maduro in early January, gives Washington control over Venezuela’s oil exports, with proceeds directed into a U.S.-supervised fund in Qatar.</p>\n<p>Under the pact, major trading houses Vitol and Trafigura have been marketing most of Venezuela’s crude, while partners of state oil company PDVSA, particularly Chevron (<a href=\"https://seekingalpha.com/symbol/CVX\" title=\"Chevron Corporation\">CVX</a>), are boosting production and shipments.</p>\n<p>Earlier in February, Wright projected that total sales from Venezuela could reach $5B within a few months as exports expand. About 40M barrels are expected to have been sold by the end of February at roughly $50 per barrel, he said.</p>\n<p>\"Most of that oil will go here to the U.S. Gulf Coast, but it'll go to India, it'll go to Asia, it's going to Europe,\" Wright said. \"Every barrel you produce will be sold, so the question is just where.\"</p>\n<p>Chinese independent refineries, which had previously imported sanctioned Venezuelan crude, are now able to buy it on the open market under the deal, Wright added.</p>\n<p>Crude (<a href=\"https://seekingalpha.com/symbol/CL1:COM\" title=\"Crude Oil Futures\">CL1:COM</a>) futures were up 0.46% at $65.77/bbl at press time, while Brent crude (<a href=\"https://seekingalpha.com/symbol/CO1:COM\" title=\"Brent Futures\">CO1:COM</a>) traded around $71.34. Front-month Nymex natural gas (<a href=\"https://seekingalpha.com/symbol/NG1:COM\" title=\"Natural Gas Futures\">NG1:COM</a>) shed nearly 1% to $2.84/MMBtu.</p>\n<p>ETFs: (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/USO\" title=\"United States Oil Fund LP ETF\">USO</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BNO\" title=\"United States Brent Oil Fund LP ETF\">BNO</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/UCO\" title=\"ProShares Ultra Bloomberg Crude Oil ETF\">UCO</a></span></span>), (<a href=\"https://seekingalpha.com/symbol/SCO\" title=\"ProShares UltraShort Bloomberg Crude Oil ETF\">SCO</a>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/USL\" title=\"United States 12 Month Oil Fund LP ETF\">USL</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DBO\" title=\"Invesco DB Oil Fund ETF\">DBO</a></span></span>), (<a href=\"https://seekingalpha.com/symbol/DRIP\" title=\"Direxion Daily S&amp;P Oil &amp; Gas Exp &amp; Prod Br 2X Shs ETF\">DRIP</a>), (<a href=\"https://seekingalpha.com/symbol/GUSH\" title=\"Direxion Daily S&amp;P Oil &amp; Gas Exp &amp; Prod Bl 2X Shs ETF\">GUSH</a>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/USOI\" title=\"UBS ETRACS Crude Oil Shares Covered Call ETN\">USOI</a></span></span>), (<a href=\"https://seekingalpha.com/symbol/UNG\" title=\"United States Natural Gas Fund LP ETF\">UNG</a>), (<a href=\"https://seekingalpha.com/symbol/BOIL\" title=\"ProShares Ultra Bloomberg Natural Gas ETF\">BOIL</a>), (<a href=\"https://seekingalpha.com/symbol/KOLD\" title=\"ProShares UltraShort Bloomberg Natural Gas ETF\">KOLD</a>), (<a href=\"https://seekingalpha.com/symbol/UNL\" title=\"United States 12 Month Natural Gas Fund LP ETF\">UNL</a>), (<a href=\"https://seekingalpha.com/symbol/FCG\" title=\"First Trust Natural Gas ETF\">FCG</a>), (<a href=\"https://seekingalpha.com/symbol/XLE\" title=\"State Street Energy Select Sector SPDR ETF\">XLE</a>)</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558532-venezuela-oil-sales-under-us-deal-seen-hitting-2b-by-february-end-wright-says",
            "pub_date": "2026-02-27 16:15:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558537",
            "title": "Frontline Q4 topline beats estimates, earnings miss",
            "description": "<html><body><ul>\n<li>Frontline <a href=\"https://www.frontlineplc.cy/fro-fourth-quarter-and-full-year-2025-results/\" rel=\"nofollow\" target=\"_blank\">press release</a>  (FRO): Q4  Non-GAAP EPS of $1.03 <font color=\"red\"> misses by $0.10</font>.</li>\n<li>Revenue of $624.5M (+46.7% Y/Y) <font color=\"green\"> beats by $167.6M</font>.</li>\n<li>Profit of $227.9 million, or $1.02 per share for the fourth quarter of 2025.</li>\n<li>Achieved average daily spot time charter equivalent earnings (“TCEs”)1 for VLCCs, Suezmax tankers and LR2/Aframax tankers in the fourth quarter of $74,200, $53,800 and $33,500 per day, respectively.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558537-frontline-q4-topline-beats-estimates-earnings-miss",
            "pub_date": "2026-02-27 16:06:40",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558536",
            "title": "Goldman Sachs BDC reports Q4 results",
            "description": "<html><body><ul>\n<li>Goldman Sachs BDC <a href=\"https://seekingalpha.com/pr/20417034-goldman-sachs-bdc-inc-reports-december-31-2025-financial-results-and-announces-first\">press release</a>  (GSBD): Q4 GAAP EPS of $0.21.</li>\n<li>Net investment income and adjusted net investment income per share for the quarter ended December 31, 2025 was $0.37.</li>\n<li>Total investment income for the three months ended December 31, 2025 and September 30, 2025 was $86.1 million and $91.6 million, respectively.</li>\n<li>As of December 31, 2025, the company’s total investments at fair value and commitments were $3,898.2 million.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558536-goldman-sachs-bdc-reports-q4-results",
            "pub_date": "2026-02-27 16:00:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558531",
            "title": "Generate Biomedicines prices IPO at $16 per share",
            "description": "<html><body><ul>\n<li><span>Generate Biomedicines (<a href=\"https://seekingalpha.com/symbol/GENB\" title=\"Generate Biomedicines Inc\">GENB</a>) <a href=\"https://seekingalpha.com/pr/20417024-generate-biomedicines-inc-announces-pricing-of-initial-public-offering\" target=\"_blank\" title=\"priced\">priced</a> its IPO of 25M shares at a public offering price of $16.00 per share. </span></li>\n<li><span>The gross proceeds are expected to be $400M.</span></li>\n<li><span>The underwriters have a 30-day option to purchase up to an additional 3.75M shares.</span></li>\n<li><span>The stock is expected to begin trading on the Nasdaq Global Select Market on February 27, 2026, under the ticker symbol \"GENB.\" </span></li>\n<li><span>The offering is expected to close on March 2, 2026.</span></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558531-generate-biomedicines-prices-ipo-at-16-per-share",
            "pub_date": "2026-02-27 16:00:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558533",
            "title": "Energy Fuels gives mixed FY numbers",
            "description": "<html><body><ul>\n<li>Energy Fuels <a href=\"https://seekingalpha.com/pr/20417009-energy-fuels-announces-2025-results-and-2026-guidance\">press release</a>  (UUUU): FY  GAAP EPS of -$0.38 <font color=\"red\"> misses by $0.06</font>.</li>\n<li>Revenue of $65.92M (-15.6% Y/Y) <font color=\"green\"> beats by $1.39M</font>.</li>\n<li>2026 Guidance: The Company expects to continue mining its Pinyon Plain, La Sal and Pandora mines to process and/or stockpile ore and mineralized material at the Mill to meet its contract deliveries and complete potential spot sales, subject to market conditions. The Company's production and sales guidance for 2026 is as follows:</li>\n<div><div class=\"table-responsive\">\n<span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><div class=\"table-responsive\">\n<span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table><tbody>\n<tr>\n<td colspan=\"1\" rowspan=\"1\"> </td>\n<td colspan=\"1\" rowspan=\"1\"> </td>\n<td colspan=\"1\" rowspan=\"1\"><p data-eci=\"true\">Low</p></td>\n<td colspan=\"1\" rowspan=\"1\"> </td>\n<td colspan=\"1\" rowspan=\"1\"><p>High</p></td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\"><p>Mined (contained pounds of U<sub>3</sub>O<sub>8</sub>)</p></td>\n<td colspan=\"1\" rowspan=\"1\"> </td>\n<td colspan=\"1\" rowspan=\"1\"><p>2,000,000</p></td>\n<td colspan=\"1\" rowspan=\"1\"> </td>\n<td colspan=\"1\" rowspan=\"1\"><p>2,500,000</p></td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\"><p>Processed (finished pounds of U<sub>3</sub>O<sub>8</sub>)<sup>(1)</sup></p></td>\n<td colspan=\"1\" rowspan=\"1\"> </td>\n<td colspan=\"1\" rowspan=\"1\"><p>1,500,000</p></td>\n<td colspan=\"1\" rowspan=\"1\"> </td>\n<td colspan=\"1\" rowspan=\"1\"><p>2,500,000</p></td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\"><p>Sales (pounds of U<sub>3</sub>O<sub>8</sub>)<sup>(2)</sup></p></td>\n<td colspan=\"1\" rowspan=\"1\"> </td>\n<td colspan=\"1\" rowspan=\"1\"><p>1,500,000</p></td>\n<td colspan=\"1\" rowspan=\"1\"> </td>\n<td colspan=\"1\" rowspan=\"1\"><p>2,000,000</p></td>\n</tr>\n</tbody></table>\n<span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button class=\"sa-table-enlarge-button\" type=\"button\">Click to enlarge</button>\n</div>\n<span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button class=\"sa-table-enlarge-button\" type=\"button\">Click to enlarge</button>\n</div></div>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558533-energy-fuels-gives-mixed-fy-numbers",
            "pub_date": "2026-02-27 15:55:47",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}