{
    "data": [
        {
            "id": "4402779",
            "title": "Wells Fargo confirms termination of two Fed consent orders",
            "description": "<html><body><p>Wells Fargo (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/WFC\" title=\"Wells Fargo &amp; Company\">WFC</a></span>), which has been working for years to resolve a string of regulatory issues, confirmed on Tuesday that the Federal Reserve <a href=\"https://seekingalpha.com/pr/19991186-wells-fargo-confirms-termination-of-two-longstanding-federal-reserve-consent-orders\" rel=\"noopener\" target=\"_blank\" title=\"terminated two longstanding consent orders\">terminated two longstanding consent orders</a> — a 2011 consent order regarding its legacy servicing activities and<span class=\"paywall-full-content invisible\"> a 2011 consent order regarding its Wells Fargo Financial businesses.</span></p> <p class=\"paywall-full-content invisible\">Wells Fargo (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/WFC\" title=\"Wells Fargo &amp; Company\">WFC</a></span>) stock <span style=\"color: #008000;\">rose 1.8% </span>in late morning trading on Tuesday.</p> <p class=\"paywall-full-content invisible\">The bank has closed nine consent orders since 2019, it said.</p> <p class=\"paywall-full-content invisible\">\"Coupled with last week’s announcement that the CFPB’s 2022 consent order terminated, today’s news is another important sign that we continue to make clear, meaningful progress to resolve our historical matters,\" said <span class=\"person\">Charlie Scharf, who served as CEO in 2019.</span></p> <p class=\"paywall-full-content invisible\"><span class=\"person\">The company is still subject to its $1.95T asset cap imposed by the Fed in 2018.</span></p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517157906/image_517157906.jpg",
            "link": "https://seekingalpha.com/news/4402779-wells-fargo-confirms-termination-of-two-fed-consent-orders",
            "pub_date": "2025-02-04 19:26:03",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402792",
            "title": "Flexsteel outlines Q3 2025 revenue guidance of $110M-$115M amid tariff concerns",
            "description": "<html><body><p>Earnings Call Insights: Flexsteel Industries (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/FLXS\" title=\"Flexsteel Industries, Inc.\">FLXS</a></span>) Q2 2025</p> <h3>Management View</h3> <ul> <li>CEO Derek Schmidt highlighted a sales growth of 8.4% year-over-year, exceeding the high end of the guidance range and marking the fifth consecutive quarter of mid-single to low double-digit growth. He attributed the<span class=\"paywall-full-content invisible\"> momentum to broad-based growth across both core and expanded markets, including Zecliner, Flex, Charisma, Big Box distribution, and Casegoods. </span> </li> <li class=\"paywall-full-content invisible\">Schmidt emphasized improvements in operating margin, which rose to 6.1% compared to 4.6% in the prior year quarter. He noted strong operational execution and product portfolio management as critical drivers. </li> <li class=\"paywall-full-content invisible\">Retailer engagement trends were positive, with a reported 18% increase in appointments at the Las Vegas market and strong feedback on new product launches.</li> <li class=\"paywall-full-content invisible\">CFO Mike Ressler reported Q2 net sales of $108.5 million, surpassing the guidance range of $103 million to $107 million. GAAP operating income was $11.7 million, including a $5 million pretax gain from a property sale, while adjusted operating income was $6.7 million or 6.1% of sales.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management provided Q3 2025 sales guidance of $110 million to $115 million, representing 3% to 7% growth over the prior year. Operating margin is expected to range between 6.0% and 7.0%, excluding potential tariff impacts. </li> <li>Gross margin is forecasted between 21% and 22%, supported by sales growth leverage but moderated by ocean freight costs and wage inflation in Mexico.</li> <li>Capital expenditures are projected between $0.7 million and $1 million, primarily for ERP modernization and supply chain maintenance.</li> <li>Schmidt identified tariffs as the most significant near-term risk, with potential 25% tariffs on Mexico and Canada posing a material impact to margins. To mitigate these risks, Flexsteel is broadening its dual-sourcing capabilities and exploring alternative supply chain configurations.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q2 net sales reached $108.5 million, up from $100.1 million in the prior year quarter. Positive drivers included strong unit volume growth and increased contributions from new product lines.</li> <li>Adjusted operating margin improved to 6.1%, supported by sales leverage and cost-saving initiatives. </li> <li>Flexsteel ended the quarter debt-free, with $11.8 million in cash and $98.1 million in working capital. Free cash flow for the quarter was reported at $6.7 million, aided by proceeds from a property sale.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Anthony Lebiedzinski, Sidoti &amp; Co.: Asked about revenue outperformance and its drivers. Derek Schmidt explained that growth was broad-based, with notable gains in new market initiatives and Flexsteel-branded core markets, though the ready-to-assemble Homestyles brand remained a weak point.</li> <li>Lebiedzinski inquired about ocean freight surcharges. CFO Mike Ressler noted volatility in rates and stated that surcharges are assessed regularly to maintain competitive pricing without margin expansion.</li> <li>On SG&amp;A trends, Schmidt stated that SG&amp;A costs are expected to remain within 15% to 15.5% of sales, balancing structural cost management with reinvestment in high ROI initiatives.</li> <li>Regarding tariffs, Ressler estimated a potential cost impact of $1.5 million to $2 million per month from a 25% tariff on Mexico. Schmidt emphasized that plans are in place to mitigate risks through diversified sourcing and supplier negotiations.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts raised concerns regarding tariffs and their financial impact, reflecting a cautious tone. Questions focused on contingency plans and structural cost management.</li> <li>Management maintained a confident tone during prepared remarks, citing positive sales momentum and supply chain agility. However, their tone was more cautious during Q&amp;A, particularly around tariff risks and macroeconomic uncertainties.</li> <li>Compared to the previous quarter, the tone from both analysts and management indicated heightened sensitivity to external risks, such as tariffs and freight costs.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Sales growth slowed slightly from Q1’s 9.9% to Q2’s 8.4%, though it still exceeded guidance. Operating margin improved from 5.8% to 6.1% quarter-over-quarter.</li> <li>Tariff risks emerged as a new focus this quarter, with management outlining detailed mitigation strategies.</li> <li>Analysts maintained a consistent focus on SG&amp;A management and e-commerce performance across the two calls. However, this quarter saw intensified scrutiny on external risks such as trade policy changes.</li> <li>Management’s confidence in supply chain resilience remained steady, but tariff discussions introduced a more cautious tone compared to the prior quarter.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Tariffs on Mexico and Canada remain a significant risk, with potential cost impacts of $1.5 million to $2 million per month. Management is exploring dual-sourcing strategies and alternative supplier networks to mitigate exposure.</li> <li>Ocean freight cost volatility continues to pressure margins, though surcharges are being used to offset expenses.</li> <li>Competitive pressures in the low-cost ready-to-assemble furniture segment, particularly for the Homestyles brand, persist as a challenge.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Flexsteel Industries demonstrated strong revenue growth and margin improvement in Q2 2025, surpassing guidance expectations. Management remains optimistic about sustaining growth through diversified market initiatives and operational efficiency. However, heightened risks from potential tariffs and freight cost volatility could pose challenges ahead. Strategic mitigation plans, including diversified sourcing and high ROI investments, position the company to navigate these uncertainties while maintaining its growth trajectory.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/FLXS/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402792-flexsteel-outlines-q3-2025-revenue-guidance-of-110m-115m-amid-tariff-concerns",
            "pub_date": "2025-02-04 19:30:10",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402781",
            "title": "Industrials see the most bullish sentiment among ETFs – Barclays",
            "description": "<html><body><p class=\"MsoNormal\">The latest ISM Manufacturing data is fueling bullish sentiment for the industrial sector and its fund ETF (<span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/XLI\" title=\"The Industrial Select Sector SPDR® Fund ETF\">XLI</a></span>).</p> <p class=\"MsoNormal\">The ISM Manufacturing PMI for the U.S. rose to 50.9 in January 2025 – for the first time since late 2022 – up from 49.2 in December, and<span class=\"paywall-full-content invisible\"> beating forecasts of 49.8.</span></p> <p class=\"MsoNormal paywall-full-content invisible\">“However, improvement may be exaggerated by the renormalization from disruptions due to hurricanes and the recent Boeing (<a href=\"https://seekingalpha.com/symbol/BA\" title=\"The Boeing Company\">BA</a>) strike,” wrote Stefano Pascale, head of equity derivatives strategy at Barclays, in a note.</p> <p class=\"MsoNormal paywall-full-content invisible\">Here are the most bullish ETFs, ranked by market sentiment:</p> <ol class=\"paywall-full-content invisible\"> <li class=\"MsoNormal\">The Industrial Select Sector SPDR Fund ETF (<span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/XLI\" title=\"The Industrial Select Sector SPDR® Fund ETF\">XLI</a></span>) – Market sentiment: 25%</li> <li class=\"MsoNormal\">iShares TIPS Bond ETF (<a href=\"https://seekingalpha.com/symbol/TIP\" title=\"iShares TIPS Bond ETF\">TIP</a>) – Market sentiment: 28%</li> <li class=\"MsoNormal\">Invesco Senior Loan ETF (<a href=\"https://seekingalpha.com/symbol/BKLN\" title=\"Invesco Senior Loan ETF\">BKLN</a>) – Market sentiment: 29%</li> <li class=\"MsoNormal\">SPDR S&amp;P Metals and Mining ETF (<a href=\"https://seekingalpha.com/symbol/XME\" title=\"SPDR S&amp;P Metals and Mining ETF\">XME</a>) – Market sentiment: 31%</li> <li class=\"MsoNormal\">The Health Care Select Sector SPDR Fund ETF (<a href=\"https://seekingalpha.com/symbol/XLV\" title=\"Health Care Select Sector SPDR® Fund ETF\">XLV</a>) – Market sentiment: 32%</li> <li class=\"MsoNormal\">The Financial Select Sector SPDR Fund ETF (<a href=\"https://seekingalpha.com/symbol/XLF\" title=\"Financial Select Sector SPDR® Fund ETF\">XLF</a>) – Market sentiment: 33%</li> <li class=\"MsoNormal\">iShares MSCI Turkey ETF (<a href=\"https://seekingalpha.com/symbol/TUR\" title=\"iShares MSCI Turkey ETF\">TUR</a>) – Market sentiment: 35%</li> <li class=\"MsoNormal\">KraneShares CSI China Internet ETF (<a href=\"https://seekingalpha.com/symbol/KWEB\" title=\"KraneShares CSI China Internet ETF\">KWEB</a>) – Market sentiment: 35%</li> <li class=\"MsoNormal\">SPDR S&amp;P Homebuilders ETF (<a href=\"https://seekingalpha.com/symbol/XHB\" title=\"SPDR Homebuilders ETF\">XHB</a>) – Market sentiment: <span style=\"mso-spacerun: yes;\"> </span>36%</li> <li class=\"MsoNormal\">iShares MSCI United Kingdom ETF (<a href=\"https://seekingalpha.com/symbol/EWU\" title=\"iShares MSCI United Kingdom ETF\">EWU</a>) – Market sentiment: 36%</li> </ol> <p class=\"MsoNormal paywall-full-content invisible\">And here are the most bearish ETFs, ranked by market sentiment:</p> <ol class=\"paywall-full-content invisible\"> <li class=\"MsoNormal\">VanEck Gold Miners ETF (<a href=\"https://seekingalpha.com/symbol/GDX\" title=\"VanEck Vectors Gold Miners ETF\">GDX</a>) – Market sentiment: 93%</li> <li class=\"MsoNormal\">SPDR Gold Shares ETF (<a href=\"https://seekingalpha.com/symbol/GLD\" title=\"SPDR Gold Trust ETF\">GLD</a>) – Market sentiment: 86%</li> <li class=\"MsoNormal\">iShares Silver Trust ETF (<a href=\"https://seekingalpha.com/symbol/SLV\" title=\"iShares Silver Trust ETF\">SLV</a>) – Market sentiment: 84%</li> <li class=\"MsoNormal\">VanEck Junior Gold Miners ETF (<a href=\"https://seekingalpha.com/symbol/GDXJ\" title=\"VanEck Vectors Junior Gold Miners ETF\">GDXJ</a>) – Market sentiment: 83%</li> <li class=\"MsoNormal\">iShares Semiconductor ETF (<a href=\"https://seekingalpha.com/symbol/SOXX\" title=\"iShares Semiconductor ETF\">SOXX</a>) – Market sentiment: 79%</li> <li class=\"MsoNormal\">VanEck Semiconductor ETF (<a href=\"https://seekingalpha.com/symbol/SMH\" title=\"VanEck Semiconductor ETF\">SMH</a>) – Market sentiment: 75%</li> <li class=\"MsoNormal\">iShares MSCI South Korea ETF (<a href=\"https://seekingalpha.com/symbol/EWY\" title=\"iShares MSCI South Korea Capped ETF\">EWY</a>) – Market sentiment: 71%</li> <li class=\"MsoNormal\">iShares MSCI Taiwan ETF (<a href=\"https://seekingalpha.com/symbol/EWT\" title=\"iShares MSCI Taiwan Capped ETF\">EWT</a>) – Market sentiment: 70%</li> <li class=\"MsoNormal\">SPDR S&amp;P 500 ETF Trust (<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"SPDR® S&amp;P 500 ETF Trust\">SPY</a>) – Market sentiment: 65%</li> <li class=\"MsoNormal\">The Energy Select Sector SPDR Fund ETF (<a href=\"https://seekingalpha.com/symbol/XLE\" title=\"Energy Select Sector SPDR® Fund ETF\">XLE</a>) – Market sentiment: 65%</li> </ol> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1407027026/image_1407027026.jpg",
            "link": "https://seekingalpha.com/news/4402781-industrials-see-the-most-bullish-sentiment-among-etfs-barclays",
            "pub_date": "2025-02-04 19:22:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402785",
            "title": "PayPal targets $15.2B-$15.4B transaction margin dollars in 2025 amid innovation and partnerships",
            "description": "<html><body><p>Earnings Call Insights: PayPal (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/PYPL\" title=\"PayPal Holdings, Inc.\">PYPL</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Alex Chriss emphasized that 2024 marked a transition year, with the company narrowing focus on strategic initiatives to drive growth. Key highlights included a 10% increase in total payment volume to $1.7 trillion and $32<span class=\"paywall-full-content invisible\"> billion in annual revenue, up 7%. Venmo monetization showed over 20% growth in debit card and active Pay with Venmo accounts.</span> </li> <li class=\"paywall-full-content invisible\">The company introduced several innovations, including branded checkout enhancements, PayPal Everywhere, Fastlane, and expanded PayPal Complete Payments. Partnerships with NBCUniversal, Roku, and StockX were announced to drive Fastlane adoption.</li> <li class=\"paywall-full-content invisible\">CFO Jamie Miller highlighted a strong Q4 performance with 5% growth in transaction margin dollars, excluding interest on customer balances, and a year-over-year 21% increase in non-GAAP EPS.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>PayPal projects full-year 2025 transaction margin dollars of $15.2 billion to $15.4 billion, representing 4.5% growth at the midpoint. Excluding interest on customer balances, growth is expected to be at least 5%.</li> <li>Non-GAAP EPS for 2025 is forecasted at $4.95 to $5.10, up 8% at the midpoint. Free cash flow is anticipated between $6 billion and $7 billion.</li> <li>Key strategic priorities for 2025 include scaling branded checkout globally, expanding omnichannel offerings, growing Venmo adoption, and enhancing small business solutions.</li> <li>Management plans to further leverage AI for customer experience and operational efficiencies.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 2024 revenue grew 4% to $7.6 billion, and non-GAAP EPS came in at $1.19, a 5% increase year-over-year.</li> <li>Total payment volume reached $438 billion in Q4, with branded checkout volume improving 6% and Venmo TPV up 10%.</li> <li>PayPal generated $2.2 billion in Q4 free cash flow, contributing to $6.8 billion for the full year. Share repurchases totaled $6 billion in 2024.</li> <li>Transaction margin percent increased by more than 100 basis points, supported by branded checkout, Venmo, Braintree, and interest income.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Andrew Schmidt, Citi: Asked about branded volume growth in Q4 and expectations for 2025. CEO Chriss explained improvements in mobile checkout and continued rollout, noting that 25% of U.S. traffic is now on modern checkout experiences.</li> <li>Ramsey El-Assal, Barclays: Inquired about unbranded volume growth. Chriss emphasized strategic conversations with merchants, focusing on value-added services and leveraging PayPal’s two-sided network.</li> <li>Harshita Rawat, Bernstein: Questioned Fastlane adoption among large merchants. Chriss highlighted over 1,000 merchants onboarded and ongoing multiprocessor strategy to support enterprise adoption.</li> <li>Trevor Williams, Jefferies: Asked about Venmo's contribution to transaction margin dollars. CFO Miller noted Venmo TPV growth of 10% and increased monetization through debit cards and Pay with Venmo, with further details to be shared during the upcoming Investor Day.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts largely expressed optimism but sought clarity on branded checkout growth, unbranded volume dynamics, and Fastlane adoption. Concerns about interest rate impacts on transaction margins were noted.</li> <li>Management displayed confidence in ongoing innovation, strategic partnerships, and financial discipline. Chriss emphasized durable growth drivers, while Miller provided clarity on headwinds from interest rates and transaction loss normalization.</li> <li>Compared to the previous quarter, management’s tone was more assertive, with a focus on execution and scaling innovations.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance for 2025 reflects increased confidence in transaction margin dollar growth and operational efficiency, compared to a cautious outlook in Q3.</li> <li>Branded checkout adoption advanced, with 25% of U.S. traffic now utilizing modern experiences, up from 5% in Q3.</li> <li>Analysts’ focus shifted toward the scaling of Fastlane and Venmo monetization, compared to broader concerns about macroeconomic headwinds in Q3.</li> <li>Management’s sentiment appeared more confident and focused as key innovations gained traction.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management acknowledged potential headwinds from interest rate cuts, expected to reduce transaction margin dollars by $150 million in 2025.</li> <li>Transaction loss normalization was flagged as a potential challenge, particularly with the rollout of new products.</li> <li>Analysts raised concerns about the pacing of branded checkout growth and the competitive landscape for unbranded processing.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">PayPal concluded 2024 with solid financial results and significant progress in innovation, partnerships, and monetization efforts. The company’s focus on branded checkout improvements, Venmo growth, and omnichannel expansion underpins its 2025 guidance, with transaction margin dollars projected to grow by at least 5% excluding interest income. While challenges from interest rate impacts and transaction loss normalization persist, management’s confident tone and strategic execution suggest a positive outlook for sustained growth.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/PYPL/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402785-paypal-targets-15_2b-15_4b-transaction-margin-dollars-in-2025-amid-innovation-and",
            "pub_date": "2025-02-04 19:22:40",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402780",
            "title": "Apollo Global Management targets 20% FRE growth and $275B annual origination by 2029",
            "description": "<html><body><p>Earnings Call Insights: Apollo Global Management (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/APO\" title=\"Apollo Global Management, Inc.\">APO</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Marc Rowan highlighted a record quarter with fee-related earnings (FRE) of $554 million, spread-related earnings (<a href=\"https://seekingalpha.com/symbol/SRE\" title=\"Sempra\">SRE</a>) of $841 million, and adjusted net income (ANI) of $1.4 billion. He emphasized the company's strategic inclusion<span class=\"paywall-full-content invisible\"> in the S&amp;P 500 as a reflection of its growth and institutionalization.</span> </li> <li class=\"paywall-full-content invisible\">Rowan reiterated Apollo’s five-year targets, which include 20% average annual FRE growth, 10% SRE growth, and doubling ANI by 2029. He stressed a focus on execution and origination capabilities to capitalize on four key market drivers: global industrial renaissance, retirement services, individual investor growth, and public-private asset convergence.</li> <li class=\"paywall-full-content invisible\">The CEO announced the acquisition of Argo, an infrastructure manager, adding $6 billion to assets under management (<a href=\"https://seekingalpha.com/symbol/AUM\" title=\"Intl Sec Exch ISE Spot AUDUSD Index\">AUM</a>) and 20 origination professionals to expand Apollo’s infrastructure capabilities.</li> <li class=\"paywall-full-content invisible\">CFO Martin Kelly noted that FRE grew 17% year-over-year, driven by management fees and capital solutions fees. He also confirmed key investments in global wealth, third-party credit, and private equity-adjacent businesses to fuel future growth.</li> <li class=\"paywall-full-content invisible\">President Jim Zelter highlighted record origination volumes of $222 billion in 2024, supported by a diversified portfolio of debt and equity strategies.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management reaffirmed its five-year plan, targeting annual origination of $275 billion by 2029. Rowan stated that origination growth will be balanced across Atlas SP, lender finance, and direct lending platforms.</li> <li>FRE is expected to grow by 15%-20% in 2025, aligning with non-flagship private equity years, while SRE is projected to reach approximately $3.5 billion, assuming an 11% alternatives return and consistent interest rate headwinds.</li> <li>Rowan reiterated Apollo’s ambition to double its credit business and significantly grow its equity business, particularly in hybrid equity, over the five-year plan.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>FRE reached a quarterly record of $554 million, while SRE totaled $841 million. Full-year ANI hit $4.6 billion, reflecting strong execution across segments.</li> <li>Total AUM reached a record $751 billion, supported by $150 billion in inflows and $220 billion in origination volume.</li> <li>Athene, Apollo’s retirement services arm, generated over $70 billion in organic inflows for 2024, with January 2025 inflows exceeding $9 billion.</li> <li>Atlas SP, Apollo’s warehouse financing platform, contributed significantly to origination growth, with $95 billion from 16 platforms and $25 billion from high-grade corporate solutions.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Bill Katz, TD Cowen, inquired about Apollo’s strategy for retirement accounts without legislative changes. Rowan emphasized the opportunity in integrating private assets into retirement solutions, highlighting potential 50%-100% better outcomes compared to public-only portfolios.</li> <li>Glenn Schorr, Evercore ISI, asked about the convergence of public and private assets. Rowan responded that traditional asset managers are increasingly adopting private assets to remain competitive, predicting significant demand for private investment-grade products.</li> <li>Alex Blostein, Goldman Sachs, questioned origination growth and M&amp;A strategy. Zelter emphasized geographic expansion and the scaling of hybrid origination, citing partnerships with European banks and other global institutions.</li> <li>Patrick Davitt, Autonomous Research, asked about costs in retail distribution. CFO Martin Kelly clarified that most costs are netted against revenue, with no expected margin degradation.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed cautious optimism, focusing on Apollo’s ability to execute its ambitious five-year plan amid macroeconomic uncertainties. Questions centered on origination growth, regulatory risks, and retail expansion.</li> <li>Management maintained a confident tone, emphasizing strategic milestones while acknowledging challenges. Rowan’s repeated focus on execution and origination highlighted the firm’s commitment to disciplined growth.</li> <li>Compared to the previous quarter, analysts appeared more focused on regulatory and competitive dynamics, while management showed consistent confidence in its long-term strategy.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>FRE increased from $531 million to $554 million, reflecting continued growth in fee-related revenues. Adjusted net income also grew significantly from $1.1 billion in Q3 to $1.4 billion in Q4.</li> <li>Origination volumes grew from $194 billion year-to-date in Q3 to a record $222 billion for the full year, driven by Atlas and other platforms.</li> <li>Management’s tone remained confident, but the focus shifted more toward execution risks and competitive pressures compared to Q3’s emphasis on broad market opportunities.</li> <li>Analysts in Q4 raised more questions about regulatory and competitive challenges, indicating a slight shift in focus from growth to operational risks.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Rowan identified internal execution as the primary risk to achieving Apollo’s five-year targets, emphasizing the need to align resources and maintain a growth-oriented culture.</li> <li>Regulatory changes in retirement and insurance markets could impact Apollo’s ability to scale its business. Rowan noted potential risks related to offshore capital regimes and industry-wide consolidation.</li> <li>Analysts expressed concerns about competitive pressures in private credit and retirement services, particularly as other asset managers enter these markets.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Apollo Global Management delivered a record quarter, showcasing strong growth across fee-related and spread-related earnings. With ambitious five-year targets of 20% FRE growth and $275 billion annual origination, the firm remains focused on execution and expanding its origination capabilities. Key market drivers, including retirement services and public-private asset convergence, position Apollo for sustained long-term growth, despite competitive and regulatory challenges.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/APO/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402780-apollo-global-management-targets-20-percent-fre-growth-and-275b-annual-origination-by-2029",
            "pub_date": "2025-02-04 19:18:22",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402526",
            "title": "OpenAI, Kakao team up for AI products; talks with SoftBank, Samsung on Stargate",
            "description": "<html><body><p><em>Update: The story was updated with Kakao's media release.</em></p> <p>Microsoft (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a></span>)-backed OpenAI said on Tuesday that it will build AI products for South Korea with local chat and video app operator Kakao.</p> <p>OpenAI's CEO Sam Altman is visiting Asia. On Monday, the<span class=\"paywall-full-content invisible\"> company already announced a joint </span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/news/4401737-softbank-openai-set-up-an-ai-focused-joint-venture-in-japan\" rel=\"noopener\" target=\"_blank\" title=\"venture\">venture</a><span class=\"paywall-full-content invisible\"> with SoftBank (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/SFTBY\" title=\"SoftBank Group Corp.\">OTCPK:SFTBY</a><span class=\"paywall-full-content invisible\">) in Japan called SB OpenAI Japan, aimed at delivering advanced AI solutions to enterprises. Altman is also expected to </span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/news/4400203-openais-ceo-sam-altman-plans-to-visit-india\" rel=\"noopener\" target=\"_blank\" title=\"reach\">reach</a><span class=\"paywall-full-content invisible\"> India on Wednesday, where he intends to meet Prime Minister Narendra Modi. </span></p> <p class=\"paywall-full-content invisible\">Kakao, which operates South Korea's dominant messaging app KakaoTalk, noted that it would be using technology developed by OpenAI for its services.</p> <p class=\"paywall-full-content invisible\">Key areas of focus will include — Kanana, a new and enhanced communication service, a user-friendly “AI mate” which that delivers personalized, context-aware responses that will be powered by OpenAI’s advanced models, according to a Korean press release by Kakao provided by OpenAI to Seeking Alpha.</p> <p class=\"paywall-full-content invisible\">The collaboration will also expand OpenAI’s integration within Kakao’s digital ecosystem, including core services like KakaoTalk. The South Korean company plans to deploy ChatGPT Enterprise to employees to enable smarter workflows and boost workplace productivity.</p> <p class=\"paywall-full-content invisible\">The details of the collaboration were announced at a joint press conference by Kakao CEO Shina Chung and OpenAI's CEO Sam Altman in Seoul on Tuesday.</p> <p class=\"paywall-full-content invisible\">The company is seeing AI as a new growth opportunity but analysts say it has lagged local rival Naver in the AI competition, according to <a href=\"https://www.reuters.com/technology/artificial-intelligence/openai-kakao-jointly-develop-ai-products-south-korea-2025-02-04/\" rel=\"noopener\" target=\"_blank\" title=\"report\">report</a> from Reuters.</p> <p class=\"paywall-full-content invisible\">\"We are particularly interested in AI and messaging,\" Altman said at the conference, as per the report.</p> <p class=\"paywall-full-content invisible\">In addition, Altman said many Korean companies will be vital in contributing to the Stargate data center project, a venture between OpenAI and Oracle (<a href=\"https://seekingalpha.com/symbol/ORCL\" title=\"Oracle Corporation\">ORCL</a>) to build AI capacity in the U.S., the report noted.</p> <p class=\"paywall-full-content invisible\">Last month, U.S. President Donald Trump was joined by Altman, SoftBank CEO Masayoshi Son and Oracle's Co-Founder and Chairman Larry Ellison when he <a href=\"https://seekingalpha.com/news/4397132-stargate-project-receives-official-announcement-from-trump-openai\" rel=\"noopener\" target=\"_blank\" title=\"announced\">announced</a> the $500B, four-year initiative Stargate to build out AI infrastructure.</p> <p class=\"paywall-full-content invisible\">On Tuesday, Altman also met SK Group Chairman Chey Tae-won. He also plans to meet Samsung Electronics (<a href=\"https://seekingalpha.com/symbol/SSNLF\" title=\"Samsung Electronics Co., Ltd.\">OTCPK:SSNLF</a>) Chairman Jay Y. Lee and SoftBank's Masayoshi Son later in the day, Maeil Business Newspaper reported.</p> <p class=\"paywall-full-content invisible\">Son said to reporters on Tuesday that he would discuss updates on Stargate and a \"potential cooperation\" with Samsung, while he was about to go in Samsung's Seoul office. When asked if he will request Samsung to invest in the project, he said, \"nothing specific\", and noted that they have to begin cooperation discussions, according to the report.</p> <p class=\"paywall-full-content invisible\">South Korean companies SK hynix and Samsung both make high bandwidth memory, or HBM, chips used in AI processors.</p> <p class=\"paywall-full-content invisible\">Samsung and SoftBank did not immediately respond to a request for comment from Seeking Alpha.</p> <p class=\"paywall-full-content invisible\">When asked if OpenAI was thinking of joining and investing in South Korea's AI computing center project, Altman noted that the ChatGPT creator was \"actively considering\" such a move, the report added.</p> <p class=\"paywall-full-content invisible\">In January, the South Korean government said it intends to set up national AI computing center plans for the Stargate data center project, the report noted.</p> <p class=\"paywall-full-content invisible\">Altman noted that South Korea's energy, semiconductor and internet companies made the Asian nation a vital market for OpenAI, adding that Korean demand that would draw on investment from the public and private sectors worth up to 2T won (about$1.4B), the report added.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197366908/image_2197366908.jpg",
            "link": "https://seekingalpha.com/news/4402526-openai-kakao-team-up-for-ai-products-talks-with-softbank-samsung-on-stargate",
            "pub_date": "2025-02-04 19:18:44",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402768",
            "title": "PVH Corp lands on China's 'Unreliable Entity' list",
            "description": "<html><body><p class=\"MsoNormal\">Weighed down by retaliatory actions by China’s Commerce Ministry, shares of PVH Corp (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/PVH\" title=\"PVH Corp.\">PVH</a></span>) fell to their lowest level in 15 months, trading in the red for a third consecutive day.</p> <p class=\"MsoNormal\">In the wake of U.S. trade policy enacting 10% tariffs on<span class=\"paywall-full-content invisible\"> all products imported from China, Beijing slapped levies of 10% to 15% on certain U.S. products beginning Feb 10, including those from the parent company of Tommy Hilfiger and Calvin Klein, placing PVH (</span><span class=\"ticker-hover-wrapper paywall-full-content invisible\">NYSE:<a href=\"https://seekingalpha.com/symbol/PVH\" title=\"PVH Corp.\">PVH</a></span><span class=\"paywall-full-content invisible\">) on its “unreliable entity list.”</span></p> <p class=\"MsoNormal paywall-full-content invisible\">“China has taken necessary countermeasures in accordance with relevant laws and regulations and the basic principles of international law, which are completely justified and reasonable. Meanwhile, China has filed a lawsuit with the WTO to firmly safeguard its legitimate rights and interests,” a spokesperson for China’s embassy in the U.S. said.</p> <p class=\"MsoNormal paywall-full-content invisible\">Beijing specifically targeted PVH Corp (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/PVH\" title=\"PVH Corp.\">PVH</a></span>) because of the company’s refusal to source cotton from the Xinjiang region in light of widespread accusations of human rights abuses and forced labor against Uyghur Muslims. The boycott spurred China to <a href=\"https://www.wilmerhale.com/en/insights/client-alerts/20241014-mofcom-initiates-investigation-into-pvh-group-under-chinas-unreliable-entity-list-regime\" rel=\"noopener\" target=\"_blank\" title=\"launched an investigation\">launch an investigation</a> into PVH (<a href=\"https://seekingalpha.com/symbol/PVH\" title=\"PVH Corp.\">PVH</a>) in September alleging violations of “normal market transaction principles by disrupting transactions with Chinese enterprises, organizations, or individuals and implementing discriminatory measures related to Xinjiang products.”</p> <p class=\"MsoNormal paywall-full-content invisible\">“We are surprised and deeply disappointed to learn of the decision from the Chinese Ministry of Commerce,” a spokesperson for PVH said in a statement cited by CNN. “In our 20 years of operating in China and proudly serving our consumers, as a matter of policy, PVH maintains strict compliance with all relevant laws and regulations and operates in line with established industry standards and practices.”</p> <p class=\"MsoNormal paywall-full-content invisible\">The company added it will work with Chinese authorities to resolve the situation.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/164662512/image_164662512.jpg",
            "link": "https://seekingalpha.com/news/4402768-pvh-corp-lands-on-chinas-unreliable-entity-list",
            "pub_date": "2025-02-04 19:10:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402762",
            "title": "Consumer data: Coca-Cola, Procter & Gamble and Sazerac impress in the latest Nielsen report",
            "description": "<html><body><p>The latest batch of Nielsen data showed some interesting trends in the consumer sector.</p> <p>Coca-Cola Company (<a href=\"https://seekingalpha.com/symbol/KO\" title=\"The Coca-Cola Company\">KO</a>) led the beverage category over the four-week sales period tracked by Nielsen that ended on January 28. The Atlanta-based beverage giant saw an<span class=\"paywall-full-content invisible\"> increase of 8.3% at the retail channels checked. The level of sales growth for Coca-Cola (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/KO\" title=\"The Coca-Cola Company\">KO</a><span class=\"paywall-full-content invisible\">) easily outpaced Keurig Dr Pepper (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/KDP\" title=\"Keurig Dr Pepper Inc.\">KDP</a><span class=\"paywall-full-content invisible\">), Monster Beverage (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/MNST\" title=\"Monster Beverage Corporation\">MNST</a><span class=\"paywall-full-content invisible\">), and PepsiCo (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/PEP\" title=\"PepsiCo, Inc.\">PEP</a><span class=\"paywall-full-content invisible\">). Meanwhile, Celsius Holdings (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/CELH\" title=\"Celsius Holdings, Inc.\">CELH</a><span class=\"paywall-full-content invisible\">) saw sales drop over the four weeks. Notably, Monster's (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/MNST\" title=\"Monster Beverage Corporation\">MNST</a><span class=\"paywall-full-content invisible\">) Bang continued its recovery.</span></p> <p class=\"paywall-full-content invisible\">In the beer category, Constellation Brands (<a href=\"https://seekingalpha.com/symbol/STZ\" title=\"Constellation Brands, Inc.\">STZ</a>) saw sales growth, while Anheuser-Busch InBev (<a href=\"https://seekingalpha.com/symbol/BUD\" title=\"Anheuser-Busch InBev SA/NV\">BUD</a>) clawed back a little bit more market share from Molson Coors (<a href=\"https://seekingalpha.com/symbol/TAP\" title=\"Molson Coors Beverage Company\">TAP</a>).</p> <p class=\"paywall-full-content invisible\">Diageo (<a href=\"https://seekingalpha.com/symbol/DEO\" title=\"Diageo plc\">DEO</a>) added spirits market share over the four weeks as strong demand for Don Julio (+31%) and Crown Royal (+12%) boosted results. Sazerac also outpaced spirits peers, with its brands Southern Comfort, Buffalo Trace, and Fireball Cinnamon Whiskey showing solid demand.</p> <p class=\"paywall-full-content invisible\">Procter &amp; Gamble (<a href=\"https://seekingalpha.com/symbol/PG\" title=\"The Procter &amp; Gamble Company\">PG</a>) and Church Dwight (<a href=\"https://seekingalpha.com/symbol/CHD\" title=\"Church &amp; Dwight Co., Inc.\">CHD</a>) were the big winners in the household products sector, with both companies seeing sales up 5.4% over the four-week period. However, sales growth was negative for Coty (<a href=\"https://seekingalpha.com/symbol/COTY\" title=\"Coty Inc.\">COTY</a>), Edgewell Personal Care (<a href=\"https://seekingalpha.com/symbol/EPC\" title=\"Edgewell Personal Care Company\">EPC</a>), and Newell Brands (<a href=\"https://seekingalpha.com/symbol/NWL\" title=\"Newell Brands Inc.\">NWL</a>).</p> <p class=\"paywall-full-content invisible\">Vital Farms (<a href=\"https://seekingalpha.com/symbol/VITL\" title=\"Vital Farms, Inc.\">VITL</a>) and BellRing Brands (<a href=\"https://seekingalpha.com/symbol/BRBR\" title=\"BellRing Brands, Inc.\">BRBR</a>) continued their strong run in the packaged food sector with double-digit sales growth recorded. Simply Good Foods (<a href=\"https://seekingalpha.com/symbol/SMPL\" title=\"The Simply Good Foods Company\">SMPL</a>) also stood out with sales up 8.4%.</p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1284930561/image_1284930561.jpg",
            "link": "https://seekingalpha.com/news/4402762-consumer-data-coca-cola-procter-gamble-and-sazerac-impress-in-the-latest-nielsen-report",
            "pub_date": "2025-02-04 19:12:32",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402695",
            "title": "Cathie Wood: 'The AI movement has just begun'",
            "description": "<html><body><p>Cathie Wood, CEO and CIO of Ark Invest, highlighted that one of the dominant themes of 2025 will be the ongoing investment in artificial intelligence (AI). In a CNBC interview, Wood stated that \"the AI movement has just begun,\" signaling that the transformative potential of AI is<span class=\"paywall-full-content invisible\"> still in its early stages, with much more to come in the years ahead.</span></p> <p class=\"paywall-full-content invisible\">Wood also revealed a strategic shift in Ark Invest's AI focus, moving away from traditional hardware technology and placing greater emphasis on software. She noted, “We have been transitioning from hardware-centric technologies, including infrastructure, towards software,” highlighting a clear pivot in the firm's investment strategy to align with evolving market trends. </p> <p class=\"paywall-full-content invisible\">Wood also touted shares of Palantir Technologies (<a href=\"https://seekingalpha.com/symbol/PLTR\" title=\"Palantir Technologies Inc.\">PLTR</a>) as a software player in the AI world noting that it is a “very expensive stock but there is nothing like it in the software space.”</p> <p class=\"paywall-full-content invisible\">PLTR is coming off a strong fourth quarter earnings results and outlook beat expectations which has the stock up over 20% on Tuesday.</p> <p class=\"paywall-full-content invisible\">Moreover, Wood and her team are some of the biggest owners of PLTR as the stock is held in five of her six actively managed exchange traded funds. </p> <p class=\"paywall-full-content invisible\">Aside from the more obvious big tech and semiconductor world, Wood said that she believes one area of the market that AI has some of the most applications to introduce change is within the Healthcare sector.</p> <p class=\"paywall-full-content invisible\">“I think the most underappreciated application of AI is healthcare,” and spotlighted shares of Illumina (<a href=\"https://seekingalpha.com/symbol/ILMN\" title=\"Illumina, Inc.\">ILMN</a>) which is a holding in the ARK Genomic Revolution ETF (<span class=\"ticker-hover-wrapper\">BATS:<a href=\"https://seekingalpha.com/symbol/ARKG\" title=\"ARK Genomic Revolution ETF\">ARKG</a></span>) and ARK Innovation ETF (<a href=\"https://seekingalpha.com/symbol/ARK\" title=\"5G Edge Acquisition Corp.\">ARK</a>).</p> <p class=\"paywall-full-content invisible\">Furthermore, see below how Woods' six actively managed exchange traded funds are trading to start off the 2025 year.</p> <ul class=\"paywall-full-content invisible\"> <li>ARK Innovation ETF (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/ARKK\" title=\"ARK Innovation ETF\">ARKK</a></span></span>) <span style=\"color: #008000;\">+8.8%</span> YTD. </li> <li>ARK Next Generation Internet ETF (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/ARKW\" title=\"ARK Next Generation Internet ETF\">ARKW</a></span></span>) <span style=\"color: #008000;\">+9.8%</span> YTD.</li> <li>ARK Autonomous Technology &amp; Robotics ETF (<a href=\"https://seekingalpha.com/symbol/ARKQ\" title=\"ARK Autonomous Technology &amp; Robotics ETF\">ARKQ</a>) <span style=\"color: #008000;\">+4% </span>YTD.</li> <li>ARK Genomic Revolution ETF (<span class=\"ticker-hover-wrapper\">BATS:<a href=\"https://seekingalpha.com/symbol/ARKG\" title=\"ARK Genomic Revolution ETF\">ARKG</a></span>) <span style=\"color: #008000;\">+12.8%</span> YTD.</li> <li>ARK Fintech Innovation ETF (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/ARKF\" title=\"ARK Fintech Innovation ETF\">ARKF</a></span></span>) <span style=\"color: #008000;\">+11%</span> YTD.</li> <li> ARK Space Exploration &amp; Innovation ETF (<a href=\"https://seekingalpha.com/symbol/ARKX\" title=\"ARK Space Exploration &amp; Innovation ETF\">ARKX</a>) <span style=\"color: #008000;\">+5%</span> YTD.</li> </ul> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2192140300/image_2192140300.jpg",
            "link": "https://seekingalpha.com/news/4402695-cathie-wood-the-ai-movement-has-just-begun",
            "pub_date": "2025-02-04 19:07:04",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402745",
            "title": "Communication Services leads 2025 while Tech struggles: See SA's complete sector ranking",
            "description": "<html><body><p>The 2025 trading year has observed strong momentum, as the Communication Services sector outpaced all other S&amp;P segments, while the once-dominant Information Technology sector has faced the steepest declines. This shift in sector performance comes amid a mixed economic backdrop in January, highlighted by<span class=\"paywall-full-content invisible\"> robust nonfarm payrolls data, a cooler-than-expected core CPI report, a market surge driven by DeepSeek, and escalating tensions over ongoing tariff disputes.</span></p> <p class=\"paywall-full-content invisible\">As a result, Seeking Alpha ranked each sector of the S&amp;P in accordance with its quant metrics. Regarding each sector, SA used the Select Sector SPDR ETFs as proxy names.</p> <p class=\"paywall-full-content invisible\">For reference, Seeking Alpha's Quant system is driven by powerful computer processing and SA's special 'Quantamental' analysis. It awards grades to stocks based on collective value, growth, profitability, earnings per share revisions, and price momentum metrics.</p> <p class=\"paywall-full-content invisible\"><strong>SA Sector Rankings </strong></p> <p class=\"paywall-full-content invisible\">No. 11: The Real Estate Select Sector SPDR Fund ETF (<a href=\"https://seekingalpha.com/symbol/XLRE\" title=\"The Real Estate Select Sector SPDR Fund ETF\">XLRE</a>), quant grade of 2.39.</p> <p class=\"paywall-full-content invisible\">No. 10: The Consumer Staples Select Sector SPDR Fund ETF (<a href=\"https://seekingalpha.com/symbol/XLP\" title=\"Consumer Staples Select Sector SPDR® Fund ETF\">XLP</a>), quant grade of 2.62.</p> <p class=\"paywall-full-content invisible\">No. 9: The Energy Select Sector SPDR Fund ETF (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/XLE\" title=\"The Energy Select Sector SPDR® Fund ETF\">XLE</a></span></span>), quant grade of 2.86.</p> <p class=\"paywall-full-content invisible\">No. 8: The Technology Select Sector SPDR Fund ETF (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/XLK\" title=\"The Technology Select Sector SPDR® Fund ETF\">XLK</a></span></span>), quant grade of 2.90. </p> <p class=\"paywall-full-content invisible\">No. 7: The Health Care Select Sector SPDR Fund ETF (<a href=\"https://seekingalpha.com/symbol/XLV\" title=\"Health Care Select Sector SPDR® Fund ETF\">XLV</a>), quant grade of 3.21. </p> <p class=\"paywall-full-content invisible\">No. 6: The Materials Select Sector SPDR Fund ETF (<a href=\"https://seekingalpha.com/symbol/XLB\" title=\"Materials Select Sector SPDR® Fund ETF\">XLB</a>), quant grade of 3.55.</p> <p class=\"paywall-full-content invisible\">No. 5: The Utilities Select Sector SPDR Fund ETF (<a href=\"https://seekingalpha.com/symbol/XLU\" title=\"Utilities Select Sector SPDR® Fund ETF\">XLU</a>), quant grade of 3.84.</p> <p class=\"paywall-full-content invisible\">No. 4: The Industrial Select Sector SPDR Fund ETF (<a href=\"https://seekingalpha.com/symbol/XLI\" title=\"Industrial Select Sector SPDR® Fund ETF\">XLI</a>), quant grade of 4.14. </p> <p class=\"paywall-full-content invisible\">No. 3: The Consumer Discretionary Select Sector SPDR Fund ETF (<a href=\"https://seekingalpha.com/symbol/XLY\" title=\"Consumer Discretionary Select Sector SPDR® Fund ETF\">XLY</a>), quant grade of 4.29. </p> <p class=\"paywall-full-content invisible\">No. 2: The Communication Services Select Sector SPDR ETF Fund (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/XLC\" title=\"The Communication Services Select Sector SPDR® ETF Fund\">XLC</a></span></span>), quant grade of 4.36.</p> <p class=\"paywall-full-content invisible\">No. 1: The Financial Select Sector SPDR Fund ETF (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/XLF\" title=\"The Financial Select Sector SPDR® Fund ETF\">XLF</a></span></span>), quant grade of 4.40. </p> <p class=\"paywall-full-content invisible\">Year-to-date performance: XLRE <span style=\"color: #008000;\">+0.9%</span>, XLP <span style=\"color: #ff0000;\">-0.1%</span>, XLE <span style=\"color: #008000;\">+3.4%</span>, XLK<span style=\"color: #ff0000;\"> -1.5%</span>, XLV <span style=\"color: #008000;\">+6.4%</span>, XLB <span style=\"color: #008000;\">+5.9%</span>, XLU <span style=\"color: #008000;\">+1.5%</span>, XLI <span style=\"color: #008000;\">+4%</span>, XLY <span style=\"color: #008000;\">+2.5%</span>, XLC <span style=\"color: #008000;\">+6.5%</span>, and XLF <span style=\"color: #008000;\">+5.8%</span>.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1227059860/image_1227059860.jpg",
            "link": "https://seekingalpha.com/news/4402745-communication-services-leads-2025-while-tech-struggles-see-sas-complete-sector-ranking",
            "pub_date": "2025-02-04 19:07:20",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}