{
    "data": [
        {
            "id": "4558641",
            "title": "Via Transportation, Inc. reports Q4 results",
            "description": "<html><body><ul>\n<li>Via Transportation, Inc. <a href=\"https://seekingalpha.com/pr/20417238-via-announces-fourth-quarter-and-full-year-2025-results\">press release</a>  (VIA): Q4 Adjusted net loss of ~$4.8M</li>\n<li>Revenue of $118.91M (+29.7% Y/Y) <font color=\"green\"> beats by $4.04M</font>.</li>\n<li><p data-eci=\"true\">In Q4, revenue grew 30% as Via executed on its vision to lead a generational transformation of public transit for cities and local government.</p></li>\n<li><p>Q4 revenue of $119 million and Annual Run-Rate Revenue of $476 million, up 30% year-over-year.</p></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558641-via-transportation-inc-reports-q4-results",
            "pub_date": "2026-02-27 20:15:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558640",
            "title": "Gogo GAAP EPS of -$0.07 misses by $0.08, revenue of $230.6M beats by $7.95M",
            "description": "<html><body><ul>\n<li>Gogo <a href=\"https://seekingalpha.com/pr/20417271-gogo-announces-fourth-quarter-and-full-year-2025-results\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GOGO\" title=\"Gogo Inc.\">GOGO</a></span>): Q4 GAAP EPS of -$0.07 <span> misses by $0.08</span>.</li>\n<li>Revenue of $230.6M (+67.3% Y/Y) <span> beats by $7.95M</span>.</li>\n<li>ATG equipment units sold in Q4 totaled 472, an all-time record, and were up 8% compared to Q3 2025.<ul>\n<li>AVANCE units sold<sup>(1</sup><sup>)</sup><span> </span>in Q4 totaled 175, a decrease of 16% compared to both Q4 2024 and Q3 2025.</li>\n<li>C-1 units sold in Q4 totaled 297, an increase of 30% compared to Q3 2025. Cumulative C-1 units sold reached 736. Gogo's C-1 solution is a simple box swap designed to allow connectivity for Classic ATG customers on Gogo's new LTE network which is expected to come online in 2026.</li>\n</ul>\n</li>\n<li>Total AVANCE ATG aircraft online (“AOL”)<sup>(1</sup><sup>)</sup><span> </span>as of December 31, 2025, grew to 4,956, an increase of 8% compared to December 31, 2024 and 1% compared to September 30, 2025. C-1 AOL reached 330 as of December 31, 2025, an increase from 101 as of September 30, 2025. Total ATG AOL<sup>(1</sup><sup>)</sup><span> </span>of 6,402 decreased 9% compared to December 31, 2024 and 2% compared to September 30, 2025.<ul><li>AVANCE units comprised approximately 77% of total ATG AOL as of December 31, 2025, up from 65% as of December 31, 2024 and up from 75% as of September 30, 2025.</li></ul>\n</li>\n<li>Average Monthly Connectivity Service Revenue per ATG aircraft online (“ARPU”)<sup>(1</sup><sup>)</sup><span> </span>for the fourth quarter was $3,378, a decrease of 3% compared to Q4 2024 and 1% compared to Q3 2025.</li>\n<li> </li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558640-gogo-gaap-eps-of-0_07-misses-by-0_08-revenue-of-230_6m-beats-by-7_95m",
            "pub_date": "2026-02-27 20:15:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558635",
            "title": "Accelerant Holdings reports Q4 results",
            "description": "<html><body><ul>\n<li>Accelerant Holdings <a href=\"https://seekingalpha.com/pr/20416793-accelerant-announces-unaudited-preliminary-fourth-quarter-and-full-year-2025-financial\">press release</a>  (ARX): Q4 Adjusted EBITDA* is expected to be $71 million, an increase of 52% compared to the fourth quarter 2024.</li>\n<li>Revenue of $248M (+30% Y/Y) <font color=\"green\"> beats by $4.3M</font>.</li>\n<li>Total fourth quarter Exchange Written Premium is expected to be $1.09 billion, an increase of 24% compared to the fourth quarter 2024</li>\n<li>Total fourth quarter Third-Party Direct Written Premium is expected to be 40% of Exchange Written Premium, compared to 21% for the fourth quarter 2024</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558635-accelerant-holdings-reports-q4-results",
            "pub_date": "2026-02-27 20:06:48",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558634",
            "title": "ANI Pharmaceuticals Non-GAAP EPS of $2.33 beats by $0.35, and revenue of $247.1M beats by $16.07M",
            "description": "<html><body><ul>\n<li>ANI Pharmaceuticals <a href=\"https://seekingalpha.com/pr/20417219-ani-pharmaceuticals-reports-record-fourth-quarter-and-full-year-2025-financial-results-and\">press release</a> (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ANIP\" title=\"ANI Pharmaceuticals, Inc.\">ANIP</a></span></span></span>): Q4 Non-GAAP EPS of $2.33 <span>beats by $0.35</span>.</li>\n<li>Revenue of $247.1M (+29.6% Y/Y) <span>beats by $16.07M</span>.</li>\n<li><p data-eci=\"true\">ANI expects a full-year total company adjusted non-GAAP gross margin between 59.3% and 60.3%. The Company will continue to tax-effect non-GAAP adjustments for computation of adjusted non-GAAP diluted earnings per share at a tax rate of 26%, unless the item being adjusted is not tax deductible in whole or in part.</p></li>\n<li><p><span>The Company anticipates approximately 21.5 million and 21.8 million shares outstanding for the purpose of calculating full-year adjusted non-GAAP diluted EPS and expects its annual</span><span> </span><span>U.S.</span><span> GAAP effective tax rate to be between 26% and 28%.</span></p></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558634-ani-pharmaceuticals-non-gaap-eps-of-2_33-beats-by-0_35-revenue-of-247_1m-beats-by-16_07m",
            "pub_date": "2026-02-27 20:06:48",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558623",
            "title": "Even after the stock surge, Netflix and Paramount have to make up lost ground",
            "description": "<html><body><p data-eci=\"true\">That was a good way to make a few billion dollars. Netflix (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a></span>) has scored a $2.8B breakup fee after walking away from a deal to acquire Warner Bros. (<a href=\"https://seekingalpha.com/symbol/WBD\" title=\"Warner Bros. Discovery, Inc.\">WBD</a>), with Paramount Skydance (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a></span>) <a href=\"https://seekingalpha.com/news/4558365-paramount-wins-the-bidding-war-for-warner-bros-as-netflix-walks-away\" target=\"_blank\" title=\"serving up an offer\">serving up an offer</a> the former studio didn't want to outbid. The advance from Paramount (<a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a>) is valued at $111B vs. the $82.7B that Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>) made to reach the initial deal—translating into a staggering $28.3B spread between both their proposals.</p>\n<p><em>The reaction:</em> The loser is winning on Wall Street, with shares of Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>) surging 7% premarket, though the winner is logging even larger gains. Paramount Skydance (<a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a>), which has agreed to cover the breakup fee, is up 9% in early trade as investors digest what the impact will be for both companies. Note that even after factoring in the big gains from this morning, shares of NFLX are still down 12% since it first agreed to the deal with Warner Bros. (<a href=\"https://seekingalpha.com/symbol/WBD\" title=\"Warner Bros. Discovery, Inc.\">WBD</a>), while Paramount Skydance (<a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a>) is 18% lower. Their stocks are also down by more than a third since talks got serious in October and November, meaning they both have significant ground to recover.</p>\n<p>\"We've always been disciplined, and at the price required to match Paramount Skydance’s latest offer, the deal is no longer financially attractive,\" Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>) said in a statement. \"This transaction was always a 'nice to have' at the right price, not a 'must have' at any price.\" Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>) shareholders have also been wary about the theatrical Hollywood deal, worrying that it could compromise the company's current internet business model, as well as the massive new debt load it would incur to finance the merger to the tune of more than $50B.</p>\n<p><strong>In comparison: </strong>David Ellison's Paramount Skydance (<a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a>) sees things very differently. The studio is hungry to expand after Skydance Media and Paramount Global closed their merger last summer despite losses that <a href=\"https://seekingalpha.com/news/4557183-paramount-skydance-corporation-non-gaap-eps-of-0_12-misses-by-0_11-revenue-of-8_15b-misses-by\" target=\"_blank\" title=\"continue to pile up\">continue to pile up</a>. It sees Warner Bros. (<a href=\"https://seekingalpha.com/symbol/WBD\" title=\"Warner Bros. Discovery, Inc.\">WBD</a>) as the key to its turnaround strategy, staying on top of the industry with a gigantic content library and franchises, and creating a must-have subscription service for consumers. In terms of debt concerns, Larry Ellison, one of the world's richest people, has personally backstopped much of the deal, giving him an outsized media influence with new stakes in CBS, Paramount, CNN, HBO, and TikTok (through Oracle's (<a href=\"https://seekingalpha.com/symbol/ORCL\" title=\"Oracle Corporation\">ORCL</a>) <a href=\"https://seekingalpha.com/news/4533340-tiktok-deal-sends-oracle-shares-up-6-but-what-is-the-cloud-providers-role\" target=\"_blank\" title=\"cloud provider relationship\">cloud provider relationship</a>).</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558623-even-after-stock-surge-netflix-and-paramount-have-to-make-up-lost-ground",
            "pub_date": "2026-02-27 20:01:25",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558630",
            "title": "Wolverine projects 5.2% revenue growth in 2026 as Saucony and Merrell momentum accelerates",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Wolverine World Wide (WWW) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Christopher Hufnagel highlighted \"substantial progress in advancing our strategy and further transforming the company while delivering solid financial results in the process.\" He emphasized that \"Merrell drove high single digit growth for the year, while Saucony posted a record year with a 30% increase compared to 2024.\" Hufnagel stated the company \"delivered top and bottom line results that exceeded our expectations,\" with annual adjusted earnings per share up over 50% compared to the prior year and continued strengthening of the balance sheet.</li>\n<li>Hufnagel outlined ongoing brand momentum, reporting that \"brand awareness and affinity are trending positively for Merrell, Saucony, Sweaty Betty and Wolverine.\" He noted market share gains in key categories, progress in the DTC business, and well-defined plans to deliver mid-single digit top line growth, supported by the current order book.</li>\n<li>The Merrell brand grew revenue 5% in Q4 with balanced growth across regions and channels, driven by strong DTC performance and less promotional activity. The Moab Speed 2 nearly doubled sell-through year-over-year at U.S. retail, and new product launches, including the Agility Peak 6 and the upcoming SpeedARC Peak, are expected to bolster growth in 2026.</li>\n<li>Saucony delivered a 24% revenue increase in Q4 and finished the year with a 30% annual increase. The brand saw mid-teens growth in DTC and gains in both Performance and Lifestyle categories. Key launches included the Endorphin Azura, which has experienced strong early demand. Saucony plans the largest annual marketing investment ever in 2026 and anticipates another year of double-digit growth.</li>\n<li>Sweaty Betty achieved mid-single digit revenue growth in Q4, with momentum in the U.K. and expanded distribution internationally, though the U.S. reset remains a near-term headwind.</li>\n<li>The Wolverine brand declined approximately 11% in Q4 but saw share gains in work boots, with the Rancher Pro and Infinity System driving performance. New leadership has been appointed, and the product pipeline is being refreshed.</li>\n<li>CFO Taryn Miller reported, \"Fiscal 2025 revenue was $1.874 billion, an increase of 7% compared to 2024 on a reported basis.\" Miller said, \"Gross margin was 47.3%, an increase of 300 basis points compared to the prior year,\" and adjusted diluted earnings per share rose 53% to $1.35.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Miller stated, \"For full year 2026, revenue is expected to be in the range of $1.96 billion to $1.985 billion, representing reported growth of approximately 5.2% at the midpoint.\"</li>\n<li>Active Group revenue is expected to increase mid-single digits, Work Group revenue is expected to be approximately flat, and Merrell revenue is projected to increase mid-single digits. Saucony is expected to achieve low to mid-teens growth, while Sweaty Betty revenue is expected to decline low single digits. Wolverine revenue is anticipated to be flat.</li>\n<li>Gross margin is expected to be approximately 46%, down 130 basis points due to higher tariff costs, with adjusted operating margin expected at 9.1%. Adjusted diluted earnings per share is expected to be in the range of $1.35 to $1.50.</li>\n<li>Operating free cash flow is projected at $105 million to $120 million.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Fourth quarter revenue was $517 million, above the $506 million midpoint of guidance. Reported revenue growth was 5% year-over-year, or 3% on a constant currency basis.</li>\n<li>Wholesale revenue increased 3%, DTC revenue increased 4%, and the Active Group grew 10% in Q4. Work Group revenue declined 12%.</li>\n<li>Merrell revenue increased 5% in Q4, Saucony revenue increased 24%, and Sweaty Betty revenue increased 5%. Wolverine revenue declined 11%.</li>\n<li>Consolidated gross margin for Q4 was 47%, up 340 basis points, with adjusted operating margin at 11% and adjusted diluted earnings per share at $0.45.</li>\n<li>Operating free cash flow for 2025 was $126 million, and net debt was reduced by $81 million, ending the year at $415 million.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Jonathan Komp, Baird: Asked about Saucony’s outlook and U.S. distribution. Hufnagel responded that Saucony is targeting low to mid-teen growth in 2026 with broad-based gains: \"Performance piece is a very encouraging part of that business, the biggest piece... We're coupling a very strong product pipeline with a record year of investments.\"</li>\n<li>Komp also inquired about tariff mitigation. Miller responded, \"Our mitigation strategy...is unchanged...pricing actions, the product cost savings, the focus on that full price discipline and discretionary savings.\"</li>\n<li>Mitchel Kummetz, Seaport: Asked about U.S. Lifestyle growth and door count rationalization. Hufnagel said, \"U.S. Lifestyle will contract this year just based on lapping that door count.\"</li>\n<li>Peter McGoldrick, Stifel: Queried about DTC growth. Miller said, \"We would expect growth in both DTC and wholesale contributing to the business.\"</li>\n<li>Anna Andreeva, Piper Sandler: Asked about SG&amp;A leverage and marketing spend. Miller said, \"SG&amp;A leverage in '26 is driven by a combination of the scale efficiencies and the targeted cost actions that we've been taking over the last 2 years.\"</li>\n<li>Mauricio Serna Vega, UBS: Asked about the Endorphin Azura franchise. Hufnagel said, \"We anticipate it to be the single biggest debut launch in the history of the brand to-date.\"</li>\n<li>Laurent Vasilescu, BNP: Asked about Saucony door count and FIFO accounting change. Hufnagel said, \"We anticipate for U.S. Saucony Lifestyle to being about 1,000 doors in the first half of '26 and the second half of '26.\"</li>\n<li>Ashley Owens, KeyBanc: Inquired about distribution guardrails and full price mix. Miller stated, \"The market response has been in line with our expectations... Across the business, we have taken deliberate actions...to offset the tariffs and improve our cost structure.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts' tone was generally positive, with focus on Saucony’s growth, distribution strategy, and tariff impacts, but included pressing questions about margin durability and channel performance.</li>\n<li>Management's tone was confident during prepared remarks and responses, highlighting achievements and transparent about challenges, using phrases like \"we are pleased,\" \"very optimistic,\" and \"bullish on the Azura.\" Responses were direct but occasionally hedged around precise figures or future challenges, especially regarding tariffs and the U.S. Lifestyle business.</li>\n<li>Compared to the previous quarter, analyst sentiment remained constructive but became slightly more probing on distribution and tariff topics. Management’s confidence appeared to increase, particularly on Saucony and Merrell momentum.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 is more detailed, including quantified revenue and margin targets, reflecting increased visibility and confidence compared to the previous quarter, when formal 2026 guidance was not issued.</li>\n<li>Strategic focus continues on scaling Merrell and Saucony, with more explicit plans for marketing investment and product innovation.</li>\n<li>Saucony’s growth narrative shifted from expansion mode to a more disciplined approach, rationalizing door count and emphasizing sell-through over sell-in.</li>\n<li>Analysts' questions shifted from near-term performance to more granular channel and product mix concerns, as well as the impact of tariffs.</li>\n<li>Management tone moved from cautious optimism to greater confidence, especially in product pipeline and global execution.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management acknowledged ongoing headwinds from tariffs, estimating a $60 million unmitigated impact in 2026, and noted that any policy change could affect the second half of the year. Mitigation efforts include pricing, product cost savings, and full price discipline.</li>\n<li>The U.S. reset for Sweaty Betty remains a near-term headwind, with further work needed to establish a healthier foundation.</li>\n<li>Wolverine’s turnaround is ongoing; management expects flat revenue in 2026 and continued recalibration of the marketplace.</li>\n<li>Analyst concerns focused on the durability of SG&amp;A leverage, the impact of higher average unit retails on consumer demand, door count rationalization, and tariff effects on margins.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Wolverine World Wide’s management underscored substantial progress in transforming the business, with record performance from Saucony and Merrell and clear strategic investments in brand-building, product innovation, and marketing. The company projects 5.2% revenue growth for 2026, with Saucony and Merrell leading momentum and ongoing discipline in channel management and profitability, while navigating tariff headwinds and repositioning Sweaty Betty and Wolverine for future growth.</p>\n<p><a href=\"https://seekingalpha.com/symbol/www/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558630-wolverine-projects-5_2-percent-revenue-growth-in-2026-as-saucony-and-merrell-momentum",
            "pub_date": "2026-02-27 20:01:25",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558627",
            "title": "Wolford AG appoints Marco Pozzo as CEO and Chairman",
            "description": "<html><body><ul>\n<li>Lanvin Group (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/LANV\" title=\"Lanvin Group Holdings Limited\">LANV</a></span>) <a href=\"https://seekingalpha.com/pr/20417173-wolford-ag-names-marco-pozzo-ceo-and-chairman-to-advance-restructuring-and-strategic\" target=\"_blank\" title=\"said\">said</a> on Friday that Marco Pozzo will be appointed CEO and Chairman of the Management Board of Wolford AG, effective March 1, 2026.</li>\n<li>Pozzo has been a member of the Board since July 7, 2025, and previously served as deputy CEO.</li>\n<li>Shares +0.58%.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558627-wolford-ag-appoints-marco-pozzo-as-ceo-and-chairman",
            "pub_date": "2026-02-27 19:55:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558629",
            "title": "PACS Group GAAP EPS of $1.22, revenue of $5.29B",
            "description": "<html><body><ul>\n<li>PACS Group <a href=\"https://seekingalpha.com/pr/20416689-pacs-group-inc-reports-fiscal-year-and-fourth-quarter-2025-results\">press release</a>  (PACS): FY  GAAP EPS of $1.22.</li>\n<li>Revenue of $5.29B (+29.3% Y/Y).</li>\n<li>\n<p data-eci=\"true\">Full-Year 2026 Business Outlook</p>\n<p>Based on information available as of today, PACS is providing the following guidance for full year 2026:</p>\n<ul>\n<li>Revenue is expected to be in the range of $5.65 billion to $5.75 billion</li>\n<li>Adjusted EBITDA is expected to be in the range of $555 million to $575 million</li>\n</ul>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558629-pacs-group-gaap-eps-of-1_22-revenue-of-5_29b",
            "pub_date": "2026-02-27 19:55:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558625",
            "title": "Laurentian Bank of Canada Non-GAAP EPS of C$0.65, revenue of C$251.6M",
            "description": "<html><body><ul>\n<li>Laurentian Bank of Canada <a href=\"https://seekingalpha.com/pr/20417198-laurentian-bank-of-canada-reports-first-quarter-2026-results\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/LRCDF\" title=\"Laurentian Bank of Canada\">LRCDF</a></span>): Q1 Non-GAAP EPS of C$0.65.</li>\n<li>Revenue of  C$251.6M (+0.8% Y/Y).</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558625-laurentian-bank-of-canada-non-gaap-eps-of-c065-revenue-of-c2516m",
            "pub_date": "2026-02-27 19:46:33",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558616",
            "title": "Delek US Non-GAAP EPS of $2.31 beats by $2.50, revenue of $2.43B misses by $120M",
            "description": "<html><body><ul>\n<li>Delek US <a href=\"https://seekingalpha.com/pr/20417203-delek-us-holdings-reports-fourth-quarter-2025-results\">press release</a>  (DK): Q4  Non-GAAP EPS of $2.31 <font color=\"green\"> beats by $2.50</font>.</li>\n<li>Revenue of $2.43B (+2.5% Y/Y) <font color=\"red\"> misses by $120M</font>.</li>\n<li>Initiated 2026 adjusted EBITDA guidance of $520 million to $560 million</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558616-delek-us-non-gaap-eps-of-2_31-beats-by-2_50-revenue-of-2_43b-misses-by-120m",
            "pub_date": "2026-02-27 19:41:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}