{
    "data": [
        {
            "id": "4558910",
            "title": "XTL announces receipt of staff delisting letter from Nasdaq",
            "description": "<html><body><ul> <li>XTL Biopharmaceuticals (<a href=\"https://seekingalpha.com/symbol/XTLB\">XTLB</a>) has received a letter from Nasdaq notifying that it believes the company is a “public shell”, and that the continued listing of XTLB's American Depositary Shares is no longer warranted.</li>\n<li>The company intends to request a hearing to appeal the delisting process before a Nasdaq Hearings Panel. A hearing request will stay the suspension of the ADSs and delisting pending the panel’s decision.</li> <li>The letter stated that the staff believes the company no longer has an operating business, citing it’s prior public disclosure that its wholly owned subsidiary, The Social Proxy, had filed a formal application with the competent Israeli court for the commencement of insolvency proceedings and that on February 22, 2026, the court ordered The Social Proxy's liquidation and the appointment of a trustee for the insolvency proceedings.</li>\n<li>The staff noted that the company’s purported shell status could lead to the ADSs being subject to market abuses and other violative conduct.</li> <li>Additionally, the staff notified the company that it did not comply with the minimum $2.5M stockholders’ equity requirement and on December 20, 2025, the Staff notified the Company that its ADSs were no longer in compliance with the minimum $1 bid price.</li> <li>Unless the company requests the Hearing by March 4, 2026, trading of the company’s ADSs will be suspended from The Nasdaq Capital Market at the opening of business on March 6, 2026, and will subsequently be removed from listing.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20418097-xtl-announces-receipt-of-staff-delist-determination-from-nasdaq-and-plans-to-request-hearing\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558910-xtl-announces-receipt-of-staff-delisting-letter-from-nasdaq",
            "pub_date": "2026-02-28 05:46:29",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558911",
            "title": "American Eagle Gold plans C$34.5M financing; Eric Sprott to acquire 9.9% stake",
            "description": "<html><body><ul>\n<li>American Eagle Gold (AE:CA) <a href=\"https://seekingalpha.com/pr/20418126-american-eagle-announces-23-million-strategic-investment-backed-by-eric-sprott\">intends to raise</a> up to C$34.54M through a combined charity flow-through and concurrent share offering.</li>\n<li>The charity flow-through offering will include up to 19.2M shares at C$1.20 per share for gross proceeds of C$23.04M.</li>\n<li>The concurrent offering will consist of up to 14.94M common shares at C$0.77/share for up to C$11.5M.</li>\n<li>Eric Sprott, through 2176423 Ontario, has agreed to acquire an ~9.9% equity stake in the company.</li>\n<li>Sprott will purchase 19.2M shares underlying the charity flow-through offering at a back-end price of C$0.77/share, representing the full C$23.04M portion of that offering.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558911-american-eagle-gold-plans-c345m-financing-eric-sprott-to-acquire-99-stake",
            "pub_date": "2026-02-28 05:46:29",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558907",
            "title": "Tencent snaps six straight sessions of losses",
            "description": "<html><body><p data-eci=\"true\">Tencent (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TCEHY\" title=\"Tencent Holdings Limited\">TCEHY</a></span>) rebounded on Friday after closing in the red for six straight sessions. The stock closed 0.15% higher at $65.70.</p>\n<p>The Chinese firm lost nearly 4% in the previous six sessions. On February 26, the stock ended 1.90% lower, further pressuring its price. The stock has closed in the red for the majority of February, barring just four sessions of gains.</p>\n<p>As per Seeking Alpha’s quant rating, the stock has a Hold rating with a score of 3.22 out of 5. Tencent has been rated an A+ for profitability, while it has been graded an F for valuation. However, both Seeking Alpha and Wall Street analysts have rated the company as Buy.</p>\n<p>Last month, Seeking Alpha analyst <a href=\"https://seekingalpha.com/article/4863685-tencent-stock-china-emphasizing-domestic-and-international-services-growth-bodes-well\" target=\"_blank\" title=\"APAC Investment News\">APAC Investment News</a> issued a Buy rating for the stock, arguing that it is well-positioned to benefit from China’s pivot toward services and the knowledge economy.</p>\n<p>“Despite a touch-high valuation, TCEHY offers robust growth, strong margins, and potential AI upside, justifying a buy rating,” the analyst said.</p>\n<p>The company is expected to benefit from China’s support via the upcoming five-year plan and increased domestic consumption.</p>\n<p><span>“…we do know that when China does decide to support a specific industry, generous support can fuel growth. The last few five-year plans have emphasized electric vehicles, for example, and now China is the world’s leader in many areas of EV technology, and globally it’s now the biggest producer of EVs. I suspect the overall knowledge economy and services sector will enjoy a high degree of support going forward, which should buoy Tencent and other services firms,” it added.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558907-tencent-snaps-six-straight-sessions-of-losses",
            "pub_date": "2026-02-28 05:40:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558904",
            "title": "Cadence plans to sell up to 3.2M shares of common stock",
            "description": "<html><body><p data-eci=\"true\">Cadence Design Systems (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CDNS\" title=\"Cadence Design Systems, Inc.\">CDNS</a></span>) plans to sell up to 3.2M shares of its common stock, according to a filing on Friday with the U.S. Securities and Exchange Commission.</p>\n<p>The planned stock sale is related to its completed <a href=\"https://seekingalpha.com/pr/20409025-cadence-completes-acquisition-of-hexagon-s-design-and-engineering-business-advancing\" target=\"_blank\" title=\"acquisition\">acquisition</a> of Hexagon AB's design and engineering business. Cadence completed the acquisition on Monday, Feb. 23, for approximately <span>€2.7B, or $3.19B. Cadence expects the incoming business to add an incremental $160M to its 2026 revenue.</span></p>\n<p><span>\"On September 4, 2025, we entered into the Purchase Agreement, pursuant to which we issued 3,224,473 shares of common stock as partial consideration in connection with the acquisition of the design and engineering business of Hexagon Smart Solutions AB,\" Cadence said in the <a href=\"https://seekingalpha.com/filing/176255402\" target=\"_blank\" title=\"filing\">filing</a>. \"We issued the shares of common stock in reliance upon the exemptions from registration afforded by Regulation S promulgated under the Securities Act and/or Section 4-a-2 of the Securities Act. In accordance with our obligations under the Purchase Agreement, we agreed to register the resale of the shares of common stock offered by the selling stockholder hereby.\"</span></p>\n<p><span><span>\"This acquisition marks a major milestone in advancing our vision for intelligent system design,\" said Cadence CEO </span>Anirudh Devgan. \"By combining our industry-leading computational software and AI-driven design expertise with MSC Software's world-class structural and physics-based analysis technologies, we're empowering customers to push the boundaries of what's possible—from autonomous systems and advanced robotics to the future of transportation.\"</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558904-cadence-plans-to-sell-up-to-3_2m-shares-of-common-stock",
            "pub_date": "2026-02-28 05:40:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558899",
            "title": "U.S. drilling rig count drops one in latest Baker Hughes survey",
            "description": "<html><body><p data-eci=\"true\"><span>The </span><span>number of oil and gas rigs actively drilling in the U.S. declined by 1 to 550, Baker Hughes reported Friday in its <a href=\"https://rigcount.bakerhughes.com/rig-count-overview\" rel=\"nofollow\" target=\"_self\" title=\"latest weekly survey\">latest weekly survey</a>.</span></p>\n<p><span>During the week ended February 27, the number of active drilling rigs targeting<span> crude oil in the</span><span> U.S. fell by 2 to 407,<span> while gas rigs gained 1 to 134, and 9 rigs remained classified as miscellaneous.</span></span></span></p>\n<p><span><span><span>The total rig count was down by 43, or 7.8%, from the same time last year.</span></span></span></p>\n<p><span><span><span>The number of rigs targeting oil in the Permian Basin remained unchanged at 239, while the oil rig count in the Eagle Ford and Williston each totaled 28.</span></span></span></p>\n<p><span><span><span>ETFs: (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/USO\" title=\"United States Oil Fund LP ETF\">USO</a></span>), (<a href=\"https://seekingalpha.com/symbol/UCO\" title=\"ProShares Ultra Bloomberg Crude Oil ETF\">UCO</a>), (<a href=\"https://seekingalpha.com/symbol/SCO\" title=\"ProShares UltraShort Bloomberg Crude Oil ETF\">SCO</a>), (<a href=\"https://seekingalpha.com/symbol/USL\" title=\"United States 12 Month Oil Fund LP ETF\">USL</a>), (<a href=\"https://seekingalpha.com/symbol/DBO\" title=\"Invesco DB Oil Fund ETF\">DBO</a>), (<a href=\"https://seekingalpha.com/symbol/DRIP\" title=\"Direxion Daily S&amp;P Oil &amp; Gas Exp &amp; Prod Br 2X Shs ETF\">DRIP</a>), (<a href=\"https://seekingalpha.com/symbol/GUSH\" title=\"Direxion Daily S&amp;P Oil &amp; Gas Exp &amp; Prod Bl 2X Shs ETF\">GUSH</a>), (<a href=\"https://seekingalpha.com/symbol/USOI\" title=\"UBS ETRACS Crude Oil Shares Covered Call ETN\">USOI</a>), (<a href=\"https://seekingalpha.com/symbol/UNG\" title=\"United States Natural Gas Fund LP ETF\">UNG</a>), (<a href=\"https://seekingalpha.com/symbol/BOIL\" title=\"ProShares Ultra Bloomberg Natural Gas ETF\">BOIL</a>), (<a href=\"https://seekingalpha.com/symbol/KOLD\" title=\"ProShares UltraShort Bloomberg Natural Gas ETF\">KOLD</a>), (<a href=\"https://seekingalpha.com/symbol/UNL\" title=\"United States 12 Month Natural Gas Fund LP ETF\">UNL</a>), (<a href=\"https://seekingalpha.com/symbol/FCG\" title=\"First Trust Natural Gas ETF\">FCG</a>)</span></span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558899-u-s-drilling-rig-count-drops-one-in-latest-baker-hughes-survey",
            "pub_date": "2026-02-28 05:35:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558908",
            "title": "Chart Industries Non-GAAP EPS of $2.51 misses by $0.50, revenue of $1.08B misses by $110M",
            "description": "<html><body><ul>\n<li>Chart Industries <a href=\"https://seekingalpha.com/pr/20418105-chart-industries-reports-fourth-quarter-and-full-year-2025-financial-results\">press release</a>  (GTLS): Q4  Non-GAAP EPS of $2.51 <font color=\"red\"> misses by $0.50</font>.</li>\n<li>Revenue of $1.08B (-2.7% Y/Y) <font color=\"red\"> misses by $110M</font>.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558908-chart-industries-non-gaap-eps-of-2_51-misses-by-0_50-revenue-of-1_08b-misses-by-110m",
            "pub_date": "2026-02-28 05:35:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558900",
            "title": "Prothena authorizes up to $100 million share repurchase plan",
            "description": "<html><body><ul>\n<li>Prothena Corporation (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/PRTA\" title=\"Prothena Corporation plc\">PRTA</a></span>) on Friday said that its board had authorized a share repurchase plan of up to $100 million of the company’s outstanding ordinary shares.</li>\n<li><p data-eci=\"true\" data-end=\"536\" data-start=\"258\">The biotechnology company said it had $308.4 million in cash, cash equivalents and restricted cash and no debt as of December 31, 2025.</p></li>\n<li><p data-end=\"536\" data-start=\"258\">Excluding any purchases under the plan, it expects to end 2026 with about $255 million in cash, cash equivalents and restricted cash.</p></li>\n<li><p data-pm-slice=\"0 0 []\">The company said the guidance does not include the potential to earn up to $105 million in aggregate clinical milestone payments in 2026 from partners related to the advancement of coramitug for ATTR amyloidosis with cardiomyopathy by Novo Nordisk and PRX019 for neurodegenerative diseases by Bristol Myers Squibb.</p></li>\n<li><p data-pm-slice=\"0 0 []\">Repurchases may be made from time to time in open market transactions, including under Rule 10b-18 and through Rule 10b5-1 plans.</p></li>\n<li><p data-pm-slice=\"0 0 []\">The plan will expire on December 31, 2026, and may be suspended or discontinued at any time, the company said.</p></li>\n<li>PRTA <span>+13.61%</span> after hours to $9.85.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20418057-prothena-announces-up-to-100-million-share-repurchase-plan\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558900-prothena-authorizes-up-to-100-million-share-repurchase-plan",
            "pub_date": "2026-02-28 05:26:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558901",
            "title": "American Healthcare REIT outlines 2026 NFFO growth target of up to $2.05 per share, backed by strong SHOP and Trilogy performance",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: American Healthcare REIT (AHR) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Jeffrey Hanson, Chairman and Interim CEO &amp; Interim President, began by addressing the leadership transition, stating \"I stepped into the role of Interim CEO, while Danny is on a medical leave of absence. I'm pleased to share that he's at home recovering well and is in good spirits... He intends to return in the relative near term, but it's too early to have timing visibility at this point.\" Hanson emphasized \"This is a seamless continuation of the strategy and execution you've grown to expect from this team... There's no change in strategy. Our investment in capital allocation strategy, risk management framework, balance sheet posture and long-term value orientation remain unchanged.\"</li>\n<li>Gabriel Willhite, Chief Operating Officer, highlighted \"the fourth quarter capped off another exceptional year of outsized NOI growth for AHR. We delivered total portfolio same-store NOI growth of 11.8% in the fourth quarter and 14.2% for the full year 2025.\" Willhite credited the operating portfolio, especially the Trilogy and SHOP segments, for this performance, noting \"same-store occupancy reached 90.6% in Q4, up 275 basis points year-over-year.\"</li>\n<li>Stefan K. Oh, Chief Investment Officer, reported \"We closed on over $950 million of new investments across our Trilogy and SHOP segments... The majority of our acquisition volume this year was within SHOP, where we added newer assets in attractive submarkets... our SHOP segment as the second largest within our diversified portfolio in terms of cash NOI.\"</li>\n<li>Brian Peay, Chief Financial Officer, stated \"We reported normalized funds from operations attributable to common stockholders, or NFFO of $0.46 per diluted share in the fourth quarter of 2025 and $1.72 per diluted share for all of 2025. That represents 22% year-over-year NFFO per share growth in 2025 as compared to 2024.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Brian Peay outlined 2026 guidance, stating \"we issued 2026 NFFO guidance of $1.99 to $2.05 per diluted share. This implies another year of double-digit NFFO per share growth and only includes the previously consummated 2026 acquisitions that Stefan mentioned earlier of $117.5 million.\" Peay provided total portfolio same-store NOI growth guidance for 2026 \"between 7% and 11%. That range is comprised of the following segment level same-store NOI growth ranges: 8% to 12% growth in Trilogy, 15% to 19% growth in SHOP, 0% to 2% growth in Outpatient Medical and a range of 2% to 3% growth in our Triple-Net Leased Properties segment.\"</li>\n<li>Management indicated no change in strategy or risk posture from prior quarters.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Peay reported \"normalized funds from operations attributable to common stockholders, or NFFO of $0.46 per diluted share in the fourth quarter of 2025 and $1.72 per diluted share for all of 2025.\"</li>\n<li>Willhite highlighted \"total portfolio same-store NOI growth of 11.8% in the fourth quarter and 14.2% for the full year 2025.\"</li>\n<li>Trilogy segment delivered \"same-store NOI increased 14% in the fourth quarter and 18.4% for the full year. Same-store occupancy reached 90.6% in Q4, up 275 basis points year-over-year.\"</li>\n<li>SHOP segment \"same-store NOI increased 24.6% in Q4 and 25.2% for 2025 compared to the same period in 2024.\"</li>\n<li>The company improved debt to EBITDA by nearly a full turn in 2025 and ended the year with a 3.4x net debt-to-EBITDA ratio.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Wesley Golladay, Baird, asked about the acquisition environment. Stefan K. Oh responded that the company continues to focus on higher acuity SHOP assets, noting \"for the most part, we're sticking with the higher acuity asset class.\"</li>\n<li>Ronald Kamdem, Morgan Stanley, inquired about SHOP guidance and occupancy. Peay stated \"the more occupied our buildings get, the more pricing power we have. And at 90.6%... we have more and more pricing power.\"</li>\n<li>Kamdem also asked about Trilogy occupancy and mix shift. Willhite explained \"the key thing with Q mix is going to be shifting to the higher payer sources... more people in Medicare setting and Medicare Advantage settings helps and fewer in the Medicaid setting helps.\"</li>\n<li>Austin Wurschmidt, KeyBanc, pressed on Trilogy's NOI growth outlook. Willhite responded \"we've got upside potential that's disproportionate to downside risk... If that trend holds true, then I think you can expect some upside in our occupancy assumptions.\"</li>\n<li>Michael Carroll, RBC, asked about the rollout of the revenue management platform. Willhite said it is \"still too early for us to release the results from it\" but highlighted the collaborative approach with operators.</li>\n<li>Michael Stroyeck, Green Street, asked about seasonality impact on SHOP occupancy. Willhite noted \"through early 2026, we're seeing much less of a flu impact... occupancy is not deeply impacted at least through February.\"</li>\n<li>Stroyeck inquired on triple-net portfolio hospital coverage. Peay said the volatility is due to operational shifts but emphasized the strength of the tenant's commitment and lease guarantee.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts' questions centered on acquisition strategy, occupancy trends, and operational leverage, with a generally positive but probing tone, especially regarding growth sustainability and competitive positioning.</li>\n<li>Management maintained a confident and steady tone, emphasizing continuity, strong operating results, and a robust acquisition pipeline. Hanson stated \"This is a seamless continuation of the strategy and execution you've grown to expect from this team,\" and Peay expressed \"We are entering 2026 from a position of strength.\"</li>\n<li>Compared to the previous quarter, sentiment from both analysts and management remains confident, with slightly more focus on the impact of leadership transition and sustainability of growth.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 NFFO per diluted share increased to $1.99 to $2.05, compared to previous 2025 guidance of $1.69 to $1.72.</li>\n<li>Total portfolio same-store NOI growth guidance for 2026 set at 7% to 11%, lower than the full year 2025 result of 14.2%.</li>\n<li>SHOP and Trilogy segments continue to be highlighted as key growth drivers, with segment-level guidance reflecting expectations for continued, though moderating, growth.</li>\n<li>Management tone in both quarters emphasized confidence and strategic consistency, but the current quarter provided more detail on leadership continuity due to the CEO’s medical leave.</li>\n<li>Analysts’ focus shifted slightly toward sustainability of high growth rates and implementation of technology-driven revenue management across the portfolio.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management acknowledged the CEO’s medical leave but reassured stakeholders about leadership stability and continuity.</li>\n<li>Willhite discussed seasonality risks, noting flu season had less impact so far in early 2026 but indicated continued monitoring.</li>\n<li>Peay addressed volatility in the triple-net portfolio's hospital coverage, referencing operational changes but emphasizing strong tenant commitment.</li>\n<li>Analysts probed on acquisition timing and competitive dynamics, particularly regarding cap rate compression and asset quality.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>American Healthcare REIT emphasized that its leadership transition has not altered strategic direction or operational focus. The company reported another year of double-digit NFFO growth, driven by strong performance in the Trilogy and SHOP segments, disciplined acquisitions, and a robust pipeline. Guidance for 2026 targets continued growth, supported by high occupancy rates, expanding revenue management initiatives, and an active investment program. Management underscored a position of strength entering the new year, with stable leverage metrics and a clear focus on long-term value creation for shareholders.</p>\n<p><a href=\"https://seekingalpha.com/symbol/ahr/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558901-american-healthcare-reit-outlines-2026-nffo-growth-target-of-up-to-2_05-per-share-backed-by",
            "pub_date": "2026-02-28 05:21:24",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558898",
            "title": "President Trump tells federal agencies to cut ties with Anthropic amid AI dispute",
            "description": "<html><body><p data-eci=\"true\">President Trump demanded on Friday that U.S. government agencies cut their existing ties with generative artificial intelligence company Anthropic (<a href=\"https://seekingalpha.com/symbol/ANTHRO\" title=\"Anthropic\">ANTHRO</a>) amid a dispute over how its AI models are used. </p>\n<p>“The Leftwing nut jobs at Anthropic have made a DISASTROUS MISTAKE trying to STRONG-ARM the Department of War, and force them to obey their Terms of Service instead of our Constitution,” the president wrote on Truth Social. “Their selfishness is putting AMERICAN LIVES at risk, our Troops in danger, and our National Security in JEOPARDY. Therefore, I am directing EVERY Federal Agency in the United States Government to IMMEDIATELY CEASE all use of Anthropic’s technology. We don’t need it, we don’t want it, and will not do business with them again! There will be a Six Month phase out period for Agencies like the Department of War who are using Anthropic’s products, at various levels. Anthropic better get their act together, and be helpful during this phase out period, or I will use the Full Power of the Presidency to make them comply, with major civil and criminal consequences to follow.”</p>\n<p>Anthropic on Thursday said that the company “cannot in good conscience” allow the Department of Defense to use its models in all lawful use cases without limitation, adding that the agency’s threats do not change its position.</p>\n<p>“It is the Department’s prerogative to select contractors most aligned with their vision,” CEO Dario Amodei wrote in a <a href=\"https://www.anthropic.com/news/statement-department-of-war\" rel=\"nofollow\" target=\"_blank\" title=\"statement\">statement</a>. “But given the substantial value that Anthropic’s technology provides to our armed forces, we hope they reconsider.”</p>\n<p><span>“Partially autonomous weapons, like those used today in Ukraine, are vital to the defense of democracy. Even </span><em>fully<span> </span></em><span>autonomous weapons (those that take humans out of the loop entirely and automate selecting and engaging targets) may prove critical for our national defense. But today, frontier AI systems are simply not reliable enough to power fully autonomous weapons. We will not knowingly provide a product that puts America’s warfighters and civilians at risk,” Amodei added. </span></p>\n<p>The<span> AI </span>startup had been engaged in tense negotiations with the Pentagon lately, and it said Thursday that those discussions were still ongoing. Defense Secretary Pete Hegseth had threatened to label Anthropic a “supply chain risk” or to invoke the Defense Production Act to force the company to comply with its demands.</p>\n<p><span>Hegseth</span><span> </span>met with <span>Amodei</span><span> </span>at the<span> </span><span>Pentagon</span><span> </span>on Tuesday and gave<span> </span><span>Anthropic</span><span> </span>until Friday evening to accept his agency’s terms. According to a senior Pentagon official, the<span> </span><span>U.S. Department of Defense</span><span> </span>delivered its “last and final offer” to Anthropic on Wednesday night, CNBC reported.</p>\n<p>Chief Pentagon spokesman Sean Parnell said Thursday that the DoD had “no interest” in using Anthropic’s models for fully autonomous weapons or to conduct mass surveillance of Americans, which he noted is illegal. He emphasized that the agency wants the company to agree to allow its models to be used for “all lawful purposes.”</p>\n<p>“This is a simple, common-sense request that will prevent Anthropic from jeopardizing critical military operations and potentially putting our warfighters at risk,” Parnell wrote in<span> </span><a href=\"https://x.com/SeanParnellASW/status/2027072228777734474?s=20\" rel=\"noopener\" target=\"_blank\">a post<span> </span></a>on X on Thursday. “We will not let ANY company dictate the terms regarding how we make operational decisions.”</p>\n<p data-end=\"213\" data-start=\"0\"><span>Anthropic </span>signed a $200M contract with the<span> </span><span>United States Department of Defense</span><span> </span>in July, becoming the first lab to deploy its models in mission workflows on classified networks. Rivals<span> </span><span>OpenAI (<a href=\"https://seekingalpha.com/symbol/OPENAI\" title=\"OpenAI\">OPENAI</a>)</span>,<span> </span><span>Google</span><span> </span>(<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a></span>) (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a></span>), and <span>xAI</span><span> </span>(<a href=\"https://seekingalpha.com/symbol/X.AI\" title=\"xAI\">X.AI</a>) also received DoD awards worth up to $200M last year.</p>\n<div><div data-module=\"mps-slot\" id=\"MidResponsive-1\"></div></div>\n<div class=\"signup_widget_placeholder\"></div>\n\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558898-president-trump-tells-federal-agencies-to-cut-ties-with-anthropic-amid-ai-dispute",
            "pub_date": "2026-02-28 05:21:24",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558896",
            "title": "Hawaiian Electric GAAP EPS of $0.23, revenue of $805.82M",
            "description": "<html><body><ul>\n<li>Hawaiian Electric <a href=\"https://seekingalpha.com/pr/20418039-hei-reports-fourth-quarter-and-full-year-2025-results\">press release</a>  (HE): Q4  GAAP EPS of $0.23.</li>\n<li>Revenue of $805.82M (+0.8% Y/Y).</li>\n<li>Shares <font color=\"green\">+1.68%</font> AH.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558896-hawaiian-electric-gaap-eps-of-0_23-revenue-of-805_82m",
            "pub_date": "2026-02-28 05:16:08",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}