{
    "data": [
        {
            "id": "4558508",
            "title": "Michael Saylor’s Strategy tops U.S. short lists, but high short interest may not signal pure bearishness",
            "description": "<html><body><p data-eci=\"true\">Shares of <span>Billionaire Michael Saylor's Strategy </span><span>(<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MSTR\" title=\"Strategy Inc\">MSTR</a></span>)</span>, a major <span>Bitcoin</span> holder, are among the most “heavily shorted” - a market term indicating strong bearish bets - according to data from FactSet and <span>Goldman Sachs</span>. However, some analysts say this positioning may not necessarily signal investor expectations of a prolonged price decline.</p>\n<p>According to Goldman's report released last week, bearish short bets on Strategy (<a href=\"https://seekingalpha.com/symbol/MSTR\" title=\"Strategy Inc\">MSTR</a>) equaled 14% of its market capitalization of $34 billion at the time, making it the most shorted stock by that measure. Cryptocurrency exchange Coinbase (<a href=\"https://seekingalpha.com/symbol/COIN\" title=\"Coinbase Global, Inc.\">COIN</a>) ranked fourth, accounting for 11% of its market cap. The report tracked positioning in stocks with a market capitalization of over $25 billion.</p>\n<div><article data-scroll-anchor=\"true\" data-testid=\"conversation-turn-26\" data-turn=\"assistant\" data-turn-id=\"request-WEB:ca842a6a-d2ac-4003-9b01-69d551561024-12\" dir=\"auto\" tabindex=\"-1\"><div><div tabindex=\"-1\"><div><div data-message-author-role=\"assistant\" data-message-id=\"27f261cd-edc5-42dd-bef8-a67795fa2aeb\" data-message-model-slug=\"gpt-5-mini\" dir=\"auto\"><div><div>\n<p data-end=\"273\" data-is-last-node=\"\" data-is-only-node=\"\" data-start=\"0\">This move follows <span>Strategy</span>’s (<a href=\"https://seekingalpha.com/symbol/MSTR\" title=\"Strategy Inc\">MSTR</a>) roughly $7 billion unrealized loss on its <span>Bitcoin</span> holdings. Since it started adding BTC to its balance sheet in 2020, the company has accumulated 717,722 bitcoins, now valued at $47 billion. As of writing, its market cap stood at <span>$45.31B</span> billion, despite the stock falling 12% year-to-date. <span>Bitcoin, meanwhile, which hit its peak of $126,080 on Oct. 6, is trading at $67,577.43 at press time.</span></p>\n<p>According to a CoinDesk report, one explanation for the elevated short interest offered by analysts is the basis trade – a strategy that seeks to profit from the price difference between two related markets. In this context, traders may buy bitcoin spot ETFs, such as BlackRock's IBIT, while simultaneously shorting MSTR stock to profit from a narrowing of MSTR's premium to its BTC holdings narrows, plus any funding from paired futures if layered on, while staying market neutral.</p>\n<p>\"I suspect a lot of this short interest is still MSTR / BTC basis trade. Jane Street, in particular, has recently acquired a conspicuously large IBIT position,\" Brian Brookshire, specialist in bitcoin treasury companies,<span> </span><a href=\"https://x.com/btc_overflow/status/2026394668397691209\" rel=\"noopener\" target=\"_blank\">said</a>.</p>\n</div></div></div></div></div></div></article></div>\n<p>According to<span> </span><a href=\"https://www.sec.gov/Archives/edgar/data/1595888/000159588826000023/xslForm13F_X02/q4_2025-13f.xml\" rel=\"nofollow\" target=\"_blank\" title=\"recent 13F filings\">recent 13F filings</a>, Jane Street purchased well over 7 million shares of BlackRock's iShares Bitcoin Trust (<a href=\"https://seekingalpha.com/symbol/IBIT\" title=\"iShares Bitcoin Trust ETF\">IBIT</a>). It also held a large position in MSTR.</p>\n<p>Of note, Anchorage Digital co-founder and CEO Nathan McCauley<span> </span><a data-rapid_p=\"15\" data-v9y=\"1\" data-yga='{\"yLinkID\":\"1wwishz1mjk55a159hoh\"}' data-ylk=\"slk:revealed;elm:context_link;itc:0;sec:content-canvas\" href=\"https://x.com/nathanmccauley/status/2026451177219698982\" rel=\"noopener\" target=\"_blank\">revealed</a><span> </span>on Feb. 25 that the digital bank holds Strategy's perpetual preferred stock, STRC (<a href=\"https://seekingalpha.com/symbol/STRC\" title=\"Strategy Inc 9.0% SERIES A PERPETUAL STRETCH PREF STK\">STRC</a>), on its balance sheet.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558508-michael-saylors-microstrategy-short-interest-not-purely-bearish",
            "pub_date": "2026-02-27 14:50:50",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558525",
            "title": "DoubleVerify outlines 8%–10% revenue growth target for 2026 while accelerating AI and social product innovation",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: DoubleVerify Holdings, Inc. (DV) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Mark Zagorski opened the call by highlighting a \"strong 38% adjusted EBITDA margin and 8% year-over-year growth in revenue,\" noting that revenue came in below expectations due to late-quarter retail campaign pullbacks from agency-related changes. He emphasized \"exceptional strength across multiple sectors in the fourth quarter, including health care and technology\" and pointed out \"no new deactivations among our Top 100 customers in Q4 and usage across social and streaming TV continues to scale.\"</li>\n<li>Zagorski stated, \"Social activation accelerated meaningfully growing at approximately 60% year-over-year in Q4 and starting 2026 at an even stronger year-over-year growth rate.\" He also reported \"Authentic AdVantage on YouTube is entering the year with $8 million of expected ACV\" and that CTV measurement impression volumes were \"up 22% for the quarter.\"</li>\n<li>He elaborated on product innovation, explaining, \"Our product innovation in 2025 harnessed the power of AI to expand TAM, improved solution efficacy and drove stronger margins and also helped deliver solid results that will set the stage for future growth.\"</li>\n<li>Zagorski discussed share repurchases: \"As of today, we have $300 million authorized for share repurchases, the largest amount in DV's history, which we plan to actively deploy in 2026 at increased levels versus prior years.\"</li>\n<li>CFO Nicola Allais reported, \"For the fourth quarter, revenue was $206 million, representing 8% year-over-year growth. For the full year, revenue was $748 million, representing 14% year-over-year growth despite variability driven by the retail sector in the second half.\"</li>\n<li>Allais noted, \"In the fourth quarter, activation revenue increased 6% year-over-year and measurement revenue increased 8% year-over-year, both driven primarily by Social.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Allais guided, \"For the first quarter, we expect revenue to range between $177 million and $183 million, representing a year-over-year increase of approximately 9% at the midpoint and adjusted EBITDA to range between $48 million and $52 million.\"</li>\n<li>For full year 2026, \"we expect revenue to range between $810 million and $826 million, representing an 8% to 10% year-over-year increase.\"</li>\n<li>Allais described the growth drivers: \"Incremental growth in 2026 off the base will be driven by 3 product-led growth engines: first, adoption and scale deployment of the recently launched solutions across Social and Streaming TV; second, incremental revenue growth from existing enterprise clients scaling across our product offering; and third, continued new customer acquisition driven by DV's differentiated MAP product vision.\"</li>\n<li>She added, \"We expect adjusted EBITDA margins of approximately 34%\" for 2026.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Allais stated, \"In the fourth quarter, total advertiser revenue, which includes activation and measurement grew 7% year-over-year driven by 8% growth in volume or MTM, partially offset by a 3% decline in price or MTF.\"</li>\n<li>\"Fourth quarter activation revenue grew 6%, with ABS representing 52% of activation revenue in the quarter.\"</li>\n<li>\"Measurement revenue grew 8% year-over-year, with Social measurement revenue increasing 11% and representing 49% of measurement revenue and international revenue increasing 5% and representing 29% of measurement revenue.\"</li>\n<li>\"For the full year, we achieved a net revenue retention rate of 109%, and gross revenue retention remained above 95% for the fifth consecutive year.\"</li>\n<li>Free cash flow was reported as \"approximately $173 million, representing a conversion rate of approximately 70%, up from 61% in 2024.\"</li>\n<li>\"We ended 2025 with approximately 162 million shares outstanding, approximately $260 million in cash and no long-term debt.\"</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Matthew Swanson, RBC Capital Markets, asked about the AI revolution and product cycle. CEO Zagorski responded, \"We're early first inning. Like we're just scratching the surface right now, which makes it so exciting. As we noted, we see AI as nothing but a huge opportunity for DV.\"</li>\n<li>Swanson also inquired about bundling strategy (MAP). Zagorski answered, \"It's been a really solid response to our first integrated product, which is Authentic AdVantage. That's for YouTube that is bundling together prebid social filtering plus post-bid measurement plus optimization on YouTube. That helped drive Social Activation to 60% growth year-over-year.\"</li>\n<li>Matthew Condon, Citizens JMP Securities, asked about Q4 spend pullbacks and Q1 confidence. CFO Allais explained, \"What happened at the end of the quarter is related to the retail vertical...additional pullback from specific customers that were going through agency changes. That was not something that we had anticipated when we had given the Q4 guidance.\"</li>\n<li>Condon also asked about accelerating social activation. Zagorski replied, \"There's always a testing process...as it gets more accurate, as it gets to be a more effective arbiter of eliminating waste and finding challenges on those platforms, it's easier uptake for us.\"</li>\n<li>Alexander Vegliante, Goldman Sachs, inquired about investments. Zagorski replied, \"We're actually looking to stabilize or decrease [headcount] over time. The efficiencies that we're getting out of AI tools have been exceptional.\"</li>\n<li>Brian Pitz, BMO, asked about CPG recovery. Allais stated, \"CPG did well. As you'll recall, we had one client at the beginning of the year, suspending its service with us. But the category did well because we acquired clients in 2024 that scaled into 2025.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts displayed a slightly positive tone, frequently referencing excitement about AI opportunities, product bundling strategies, and the pace of adoption in social and CTV, while probing on retail softness and growth levers.</li>\n<li>Management’s sentiment was confident during prepared remarks: \"We have confidence in the performance of our business and our priorities are clear: deepen adoption of core products with core customers, accelerate the growth of our solutions for Social, Streaming TV and AI, and drive industry-leading margins by leveraging the power of AI.\" During Q&amp;A, management maintained a constructive tone but acknowledged challenges in retail and pricing.</li>\n<li>Compared to the previous quarter, overall sentiment remained optimistic but with a greater emphasis on diversification and efficiency gains from AI.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The company maintained strong EBITDA margin performance, with Q4 at 38% and a full-year margin guidance increase to 34% for 2026 versus 33% in previous guidance.</li>\n<li>Social activation ramped up, with growth accelerating from 20% in Q3 to 60% in Q4, and CTV measurement volumes growth of 22% in Q4 versus 30% in Q3.</li>\n<li>Retail sector softness persisted but was more pronounced in Q4, as opposed to the broader but less acute pressure described in Q3.</li>\n<li>Management’s tone shifted to stress diversification across sectors and products, while analysts maintained focus on product adoption and potential for upside from new solutions.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited \"further pullbacks of a customer campaign spend late in the quarter, primarily due to agency-related changes\" as an unexpected headwind.</li>\n<li>Persisting retail softness and pricing pressure continue to impact results, reflected in a 3% decline in MTF.</li>\n<li>The company expects \"volumes to remain the primary driver of growth in 2026\" while monitoring sector diversification to offset retail volatility.</li>\n<li>Analysts raised questions about the speed of product adoption, retail sector headwinds, and the impact of pricing dynamics.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>DoubleVerify’s Q4 2025 results highlighted strong margins, robust product innovation across social, streaming TV, and AI, and efficient capital allocation. Management projects 8%–10% revenue growth for 2026, supported by a diversified product portfolio and continued sectoral expansion beyond retail. The company remains focused on accelerating adoption of new solutions, driving operational efficiencies through AI, and actively deploying its increased share repurchase authorization to enhance shareholder value.</p>\n<p><a href=\"https://seekingalpha.com/symbol/dv/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558525-doubleverify-outlines-8-percent-10-percent-revenue-growth-target-for-2026-while-accelerating",
            "pub_date": "2026-02-27 14:50:50",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558518",
            "title": "Aura Minerals raises dividend by 37.5% to $0.66",
            "description": "<html><body><ul>\n<li>Aura Minerals (AUGO) declares <a href=\"https://seekingalpha.com/pr/20416984-aura-declares-dividend-of-us-0_66-per-share-and-us-0_22-per-bdr-based-on-q4-2025-results\" target=\"_blank\">$0.66/share quarterly dividend</a>, <font color=\"green\">37.5% increase</font> from prior dividend of $0.48.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/AUGO/dividends/yield?source=news_bullet\">Forward yield</a> 2.94%</li>\n<li>Payable March 18; for shareholders of record March 11; ex-div March 11.</li>\n<li><a href=\"https://seekingalpha.com/symbol/AUGO/dividends?source=news_bullet\">See AUGO Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558518-aura-minerals-raises-dividend-by-375-to-066",
            "pub_date": "2026-02-27 14:30:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558521",
            "title": "Willdan outlines 2026 guidance with net revenue target up to $405M as data center opportunities accelerate",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Willdan Group, Inc. (WLDN) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Michael Bieber, CEO, stated that \"We closed 2025 with record financial performance and strong momentum across our business. For 2025, both contract and net revenue grew greater than 20%, led by our energy work. Adjusted EBITDA grew 40%, and yearly margins expanded to above our 20% target for the first time in 2025.\" He highlighted $71 million of free cash flow and a net cash position, attributing organic net revenue growth of 17% largely to expansion with existing customers. Bieber emphasized that \"electric load growth has returned to the United States after about 15 years of stagnation\" and that AI and data centers are driving electricity demand at unprecedented levels.</li>\n<li>Bieber explained that the company is seeing strong demand from utilities, state and local governments, and commercial customers, with commercial clients—especially data centers—now accounting for 11% of revenue and described as \"the most fertile business environment we serve.\" He also pointed to a robust acquisition pipeline entering 2026.</li>\n<li>Creighton Early, CFO, stated, \"For the fourth quarter of 2025, contract revenue increased 21% to $174 million, and net revenue grew 13% to $89.5 million for the quarter. Adjusted EBITDA also increased 13% compared to the prior year, totaling $20 million for the quarter, and adjusted earnings per share more than doubled to $1.57, which is $1.23 on a GAAP basis, aided by exceptional tax deductions from energy efficiency incentives under Section 179D.\" Early also noted, \"We ended the year with $66 million of unrestricted cash and a net positive cash position of $17 million, the first time since 2017 and effectively 0 leverage compared to the 0.3x EBITDA at the end of 2024.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Early stated, \"We expect net revenue in the range of $390 million to $405 million, adjusted EBITDA in the range of $85 million to $90 million and adjusted earnings per share in the range of $4.50 to $4.70 per share. These targets assume a full year effective tax benefit of approximately 10% and 15.8 million diluted shares outstanding. These numbers exclude any future acquisitions, though we expect to make acquisitions during the year, and our guidance will be updated accordingly.\"</li>\n<li>Bieber added, \"We have a particularly robust acquisition pipeline entering 2026 that will better enable us to serve customers in the future.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Willdan reported contract revenue of $174 million and net revenue of $89.5 million for the quarter. Adjusted EBITDA was $20 million, and adjusted EPS was $1.57, with GAAP EPS of $1.23. For the full year, contract revenue reached $682 million, net revenue was $365 million, and adjusted EBITDA was $79.5 million. Net income more than doubled to $52.6 million, or $3.49 per diluted share GAAP, and adjusted EPS increased to $4.89. Gross profit increased 26.1% to $256 million, with gross margin expanding to 37.5% from 35.8% the prior year. Free cash flow for the year was $71 million.</li>\n<li>Early stated, \"We generated $80 million in cash flow from operations as continued improvements in working capital levels supplemented the strong earnings and $71 million in free cash flow or $4.69 per share in 2025.\"</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Craig Irwin, ROTH Capital Partners: \"Your EPS guide of $4.50 to $4.70 is fantastic, but it is below the $4.93 last year... Can you maybe walk us through what your assumptions are for 179D in 2026...?\" Creighton Early: \"The 179D is set to expire at the end of June for this year. So that inability to carry that through to the end of the year means that we can only take advantage of that through projects that are started within the first 6 months of 2026, so that's the single biggest factor there.\"</li>\n<li>Irwin: \"When I look at this, I know your markets are helping in a big way, but... are there operating improvements that might be improving the fundamental profitability...?\" Michael Bieber: \"...over the last 5 years, is that we've moved up the value scale and are able to charge more for the work that we do... As we've grown the company, corporate costs are not growing at nearly the rate of the top line. So we think that's going to continue, and it's reflected in our guidance.\"</li>\n<li>Tim Moore, Clear Street LLC: \"Did you mention that you thought data centers could double in 2026 for revenue?\" Bieber: \"We were talking specifically about the APG acquisition that does that type of substation design and construction management for those data centers, and we are expecting that to more than double for us this year.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed on the sustainability of EPS growth, tax assumptions, and the trajectory of data center and utility demand, showing a neutral-to-slightly-positive tone as they acknowledged positive execution but probed on future risks and drivers.</li>\n<li>Management maintained a confident tone in both prepared remarks and responses, emphasizing continued margin expansion, strategic positioning, and a robust acquisition pipeline, though they acknowledged headwinds from tax incentives expiring.</li>\n<li>Compared to the previous quarter, analysts' tone shifted slightly to a more cautious approach, focusing on guidance and the impact of expiring tax benefits, while management remained consistently confident but offered more granular explanations for future guidance.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 net revenue ($390M–$405M) and adjusted EPS ($4.50–$4.70) reflects a modest increase in revenue targets but a lower EPS projection, primarily due to the non-renewal of the 179D tax deduction after June 2026. The previous quarter's call raised 2025 guidance for net revenue to $360M–$365M and adjusted EPS to $4.10–$4.20.</li>\n<li>Strategic focus continues to shift toward commercial customers, particularly data centers, with management highlighting more than doubling of APG’s contribution in 2026 and a deliberate push to expand commercial sector capabilities.</li>\n<li>Analysts’ questions in both quarters revolved around growth sustainability, resource management, and execution risk, but the current quarter included more pointed questions about tax effects and margin durability.</li>\n<li>Management’s tone remained confident, but with increased emphasis on explaining the impacts of tax changes and acquisition strategies.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>The primary risk cited was the expiration of the 179D tax deduction at the end of June 2026, which will reduce some tax benefits for the remainder of the year.</li>\n<li>Management noted project mix changes, with fewer qualifying buildings in new contracts compared to prior periods, affecting the eligibility for tax incentives.</li>\n<li>Analyst concerns centered on the sustainability of EPS growth and margin improvement in light of these tax changes and the ability to maintain momentum in the commercial sector.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Willdan’s management underscored record financial performance in 2025, marked by double-digit revenue and profit growth, margin expansion, and strong cash flow. The company's 2026 outlook projects continued top-line growth and margin strength, supported by a growing backlog, increased activity in the commercial sector—especially data centers—and a robust acquisition pipeline. While EPS guidance is lower due to expiring tax incentives, management emphasized durable demand, scalable operations, and a strategic focus on higher-value work and commercial diversification as key drivers for sustained performance.</p>\n<p><a href=\"https://seekingalpha.com/symbol/wldn/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558521-willdan-outlines-2026-guidance-with-net-revenue-target-up-to-405m-as-data-center",
            "pub_date": "2026-02-27 14:30:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558517",
            "title": "Bain Capital Specialty Finance declares $0.42 dividend",
            "description": "<html><body><ul>\n<li>Bain Capital Specialty Finance (BCSF) declares <a href=\"https://seekingalpha.com/pr/20416955-bain-capital-specialty-finance-inc-announces-december-31-2025-financial-results-and-declares\" target=\"_blank\">$0.42/share quarterly dividend</a>, in line with previous.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/BCSF/dividends/yield?source=news_bullet\">Forward yield</a> 13.18%</li>\n<li>Payable March 30; for shareholders of record March 16; ex-div March 16.</li>\n<li><a href=\"https://seekingalpha.com/symbol/BCSF/dividends?source=news_bullet\">See BCSF Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder_news_bottom\"></div></body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558517-bain-capital-specialty-finance-declares-0_42-dividend",
            "pub_date": "2026-02-27 14:21:33",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558514",
            "title": "Starz expects $80M–$120M free cash flow in 2026 as it targets 2.7x leverage and OTT revenue growth",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Starz Entertainment Corp. (STRZ) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Jeffrey Hirsch, President and CEO, stated that \"2025 was a very successful year, one in which we exceeded all of our financial guidance. It's a feat we're especially proud of amidst the pressures you see happening across the industry.\" He highlighted ending the year at an all-time high of 12.7 million OTT subscribers, representing a 7.6% year-over-year increase, and noted the addition of 370,000 OTT subscribers in the fourth quarter alone. Hirsch emphasized that Starz exceeded its $200 million adjusted OIBDA outlook by 2%, delivering $204 million, and finished the year with leverage at 2.9x versus a 3.1x guide.</li>\n<li>Hirsch reported that original programming such as Spartacus and Power Book IV: Force Season 3 fueled subscriber growth, with Power Book IV achieving a 57% increase in in-season viewership. He also detailed a slate of anticipated 2026 originals, including the conclusion of Outlander, Power Book III: Raising Kanan, Fightland, Blood of My Blood, and the return of P-Valley.</li>\n<li>The company restructured its Canadian business into a licensing revenue stream and completed production on Fightland, now with Sky as a co-commission partner. Hirsch announced, \"we will not be disclosing subscribers starting with the March 2026 quarter\" and will focus on OTT revenue growth, profitability, and deleveraging.</li>\n<li>Hirsch added that Starz is \"uniquely positioned to capitalize on potential M&amp;A opportunities\" due to its tech stack and digital conversion record.</li>\n<li>Scott MacDonald, Chief Financial Officer, stated, \"Adjusted OIBDA for the quarter was $56 million, up over 100% sequentially due to lower programming amortization, lower advertising marketing and higher revenue.\" MacDonald noted net debt of $589 million, total gross debt of $625 million, and cash of $36 million at quarter end.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Hirsch reported, \"Our outlook for 2026 is strong. We expect OTT revenue to grow. We expect to deliver low single-digit percentage adjusted OIBDA growth versus 2025. We anticipate generating between $80 million to $120 million of positive unlevered free cash flow, converting the business to positive equity free cash flow. And we expect to end the year at approximately 2.7x leverage.\"</li>\n<li>MacDonald indicated that the improvement in cash flow is expected to come from \"lower cash content spend in 2026 versus 2025, which drives a closer alignment of cash content spend with the programming amortization expense reflected on our income statement.\"</li>\n<li>The company confirmed a strategic shift away from reporting quarterly subscriber counts, emphasizing revenue, cash flow, and margin expansion.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>MacDonald reported, \"Total revenue in the quarter was $323 million, up 60 basis points on a sequential basis.\" The revenue increase was primarily driven by content licensing revenue from the restructured Canadian business.</li>\n<li>Adjusted OIBDA for the full year reached $204 million, surpassing the $200 million outlook, and leverage at year-end stood at 2.9x.</li>\n<li>The company ended the quarter with $589 million in net debt, $625 million in gross debt, and $36 million in cash, with no borrowings outstanding on its $150 million revolving credit facility.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Brent Penter, Raymond James: Asked about drivers behind the 2026 margin target and revenue trajectory. Hirsch responded, \"You'll see a slight improvement in '26, but the lion's share of the improvement really comes in '27 and '28 when you start to see the Starz originals really become a lion's share of our programming slate.\"</li>\n<li>Penter also inquired about M&amp;A constraints. Hirsch explained that, \"any kind of deal that we do, we'd have to stick within that kind of leverage constraint to keep it around. We don't really want to operate in a business that's 4x, 5x, 6x levered.\"</li>\n<li>Thomas Yeh, Morgan Stanley: Sought insight on OTT subscriber retention. Hirsch indicated that a combination of a strong slate and longer-term annual offers is \"really lead[ing] us to push churn down over the next 12 to 18 months.\"</li>\n<li>Yeh asked about distribution partnerships. Alison Hoffman, President of STARZ Networks, stated, \"The bundles that we have in place are expanding our TAM... They're revenue accretive and then also ultimately are driving better retention for the business.\"</li>\n<li>David Joyce, Seaport Research Partners: Probed about OIBDA and free cash flow cadence. MacDonald replied, \"From a P&amp;L cadence, you'll see very consistent over the year, especially in the first 3 quarters. The fourth quarter in '26 will be a more positive quarter.\"</li>\n<li>Vikram Kesavabhotla, Baird: Asked about the Sky partnership and international content demand. Hirsch responded, \"the slate that we've designed, we've obviously designed it with international revenue in mind.\"</li>\n<li>Douglas Wardlaw, JPMorgan: Asked about the balance between spin-offs and new originals. Hoffman explained, \"what you'll see is you'll see us using these reliable franchises to launch new IP and establish new IPs with audiences.\"</li>\n<li>Matthew Harrigan, Benchmark: Inquired about AI and post-Lionsgate development. Hirsch stated, \"AI is a -- it's going to be a very powerful tool to enhance the business... but I think the business is really grown on the success of the uniqueness of our originals.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts expressed constructive, but probing interest in free cash flow, M&amp;A strategy, and international growth, occasionally pressing for greater detail on margin improvement and capital allocation priorities.</li>\n<li>Management maintained a confident and forward-looking tone, repeatedly emphasizing strong guidance, cash flow improvements, and strategic discipline. Hirsch stated, \"We expect to deliver low single-digit percentage adjusted OIBDA growth versus 2025,\" and MacDonald described cash flow improvement as \"a significant improvement over the year.\"</li>\n<li>Compared with the previous quarter, management's tone was more assertive about the company's positioning, while analysts continued to focus on operational execution and long-term value.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance language shifted from affirming prior targets to outlining specific financial and operational milestones for 2026, including the move away from reporting subscriber counts.</li>\n<li>Strategic focus moved further toward owned content, international licensing, and bundling partnerships.</li>\n<li>Analysts in both quarters sought clarity on margin expansion and M&amp;A, but recent questions highlighted capital allocation as leverage approaches the 2.5x target.</li>\n<li>Key metrics showed sequential revenue and OIBDA growth and a reduction in leverage from 3.4x to 2.9x.</li>\n<li>Management's tone was more confident, underscoring the business's transformation and cash flow trajectory.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited ongoing declines in traditional linear customers and the impact of seasonal promotions on revenue.</li>\n<li>The transition from linear to digital continues to present operational and subscriber churn risks.</li>\n<li>The company acknowledged that content spend alignment and cash flow normalization are still in progress, especially in early 2026.</li>\n<li>Hirsch indicated that any M&amp;A activity would be managed conservatively to avoid over-leveraging the business.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Starz closed 2025 with all-time high OTT subscribers, exceeded its adjusted OIBDA outlook, and achieved sequential revenue growth, propelled by original programming and a restructured Canadian business. Looking ahead, the company targets $80 million to $120 million in unlevered free cash flow, low-single-digit OIBDA growth, and a further reduction in leverage to 2.7x by the end of 2026, all while shifting focus to revenue and cash flow rather than subscriber counts. Management points to continued content investment, international expansion, and disciplined capital allocation as drivers for future growth and profitability.</p>\n<p><a href=\"https://seekingalpha.com/symbol/strz/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558514-starz-expects-80m-120m-free-cash-flow-in-2026-as-it-targets-2_7x-leverage-and-ott-revenue",
            "pub_date": "2026-02-27 14:10:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558515",
            "title": "Atrium Mortgage Investment Corporation declares $0.0775 dividend",
            "description": "<html><body><ul>\n<li>Atrium Mortgage Investment Corporation (AI:CA) declares <a href=\"https://seekingalpha.com/pr/20416867-atrium-mortgage-investment-corporation-reports-strong-2025-annual-results-declares-0_10\" target=\"_blank\">$0.0775/share monthly dividend</a>, in line with previous.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/AI:CA/dividends/yield?source=news_bullet\">Forward yield</a> 7.8%</li>\n<li>Payable May 13; for shareholders of record April 30; ex-div April 30.</li>\n<li>Payable June 12; for shareholders of record May 29; ex-div May 29.</li>\n<li>Payable July 10; for shareholders of record June 30; ex-div June 30.</li>\n<li><a href=\"https://seekingalpha.com/symbol/AI:CA/dividends?source=news_bullet\">See AI:CA Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558515-atrium-mortgage-investment-corporation-declares-0_0775-dividend",
            "pub_date": "2026-02-27 14:10:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558507",
            "title": "Capital City Bank raises dividend by 4% to $0.27",
            "description": "<html><body><ul>\n<li>Capital City Bank (CCBG) declares <a href=\"https://seekingalpha.com/pr/20416789-capital-city-bank-group-inc-increases-cash-dividend\" target=\"_blank\">$0.27/share quarterly dividend</a>, <font color=\"green\">3.8% increase</font> from prior dividend of $0.26.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/CCBG/dividends/yield?source=news_bullet\">Forward yield</a> 2.49%</li>\n<li>Payable March 23; for shareholders of record March 9; ex-div March 9.</li>\n<li><a href=\"https://seekingalpha.com/symbol/CCBG/dividends?source=news_bullet\">See CCBG Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558507-capital-city-bank-raises-dividend-by-4-to-027",
            "pub_date": "2026-02-27 14:05:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558509",
            "title": "Toll Brothers raises dividend by 32% to $0.33",
            "description": "<html><body><ul>\n<li>Toll Brothers (TOL) declares <a href=\"https://seekingalpha.com/pr/20416822-globe-life-inc-declares-dividend-and-announces-appointment-of-two-new-board-members\" target=\"_blank\">$0.33/share quarterly dividend</a>, <font color=\"green\">32% increase</font> from prior dividend of $0.25.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/TOL/dividends/yield?source=news_bullet\">Forward yield</a> 0.83%</li>\n<li>Payable May 5; for shareholders of record April 3; ex-div April 3.</li>\n<li><a href=\"https://seekingalpha.com/symbol/TOL/dividends?source=news_bullet\">See TOL Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558509-toll-brothers-raises-dividend-by-32-to-033",
            "pub_date": "2026-02-27 14:05:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558504",
            "title": "Alerus Financial declares $0.21 dividend",
            "description": "<html><body><ul>\n<li>Alerus Financial (ALRS) declares <a href=\"https://seekingalpha.com/pr/20416774-alerus-financial-corporation-declares-cash-dividend-on-common-shares\" target=\"_blank\">$0.21/share quarterly dividend</a>, in line with previous.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/ALRS/dividends/yield?source=news_bullet\">Forward yield</a> 3.37%</li>\n<li>Payable April 10; for shareholders of record March 27; ex-div March 27.</li>\n<li><a href=\"https://seekingalpha.com/symbol/ALRS/dividends?source=news_bullet\">See ALRS Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558504-alerus-financial-declares-0_21-dividend",
            "pub_date": "2026-02-27 13:56:31",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}