{
    "data": [
        {
            "id": "4403436",
            "title": "Disney beats on core metrics and guides upbeat profit growth for 2025; shares seesaw (update)",
            "description": "<html><body><p data-pm-slice=\"1 1 []\">Disney (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a></span>) beat on top and bottom line numbers for the first quarter, helped by <em>\"Moana 2\"</em> outperformance and the media conglomerate provided a forecast for the full year that was within Wall Street expectations.</p> <p>Shares of the company have<span class=\"paywall-full-content invisible\"> been dilly-dallying between green and red after reporting results; DIS stock is down 1% ahead of midday trading on the NYSE.</span></p> <p class=\"paywall-full-content invisible\">For the full year, the company expects adjusted earnings per share growth in the high single-digit range and cash flow from operations of about $15B. The Bloomberg consensus estimate for adj. EPS growth is 8.1%, and cash flow is $15.09B.</p> <p class=\"paywall-full-content invisible\">The company also expects to incur $200M related to Disney Cruise Line pre-opening expenses and record a $300M equity loss due to the purchase accounting of the Star India deconsolidation in 2025.</p> <p class=\"paywall-full-content invisible\">In Q2, the company expects a modest decline in Disney+ subscribers sequentially, and expects an impact of $100M on sports operating income from college sports and an additional NFL game, and about $50M from exiting the Venu Sports joint venture.</p> <p class=\"paywall-full-content invisible\">During Q1, total Disney+ subscribers came in at 124.6M, which included 56.8M domestic users and 67.8M internationally. Total Hulu subscribers were 53.6M.</p> <p class=\"paywall-full-content invisible\" data-pm-slice=\"1 1 []\">Domestic Disney+ average monthly revenue per paid subscriber increased to $7.99 from $7.70; International Disney+ average monthly revenue per paid subscriber increased to $7.19 from $6.78.</p> <p class=\"paywall-full-content invisible\" data-pm-slice=\"1 1 []\">Most notably, revenue from content sales/licensing saw a 34% jump in Q1, helped by higher theatrical distribution, reflecting the strong performance of <em>Moana 2</em>, the company said.</p> <p class=\"paywall-full-content invisible\">Results at domestic parks and experiences were \"unfavorably impacted\" by Hurricane Milton and Hurricane Helene, the company said. <span class=\"location\">Walt Disney World Resort</span> was closed for a day and the cruise itinerary was canceled as a result of Hurricane Milton.</p> <p class=\"paywall-full-content invisible\">In his initial reaction to the report, Seeking Alpha analyst and leader of the Investing Group \"Cash Flow Club,\" <a class=\"c-link\" data-sk=\"tooltip_parent\" data-stringify-link=\"https://seekingalpha.com/author/jonathan-weber#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" href=\"https://seekingalpha.com/author/jonathan-weber#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" rel=\"noopener noreferrer\" target=\"_blank\">Jonathan Weber</a>, said, <em>\"</em>Disney delivered a double beat, growing slightly faster than expected. The Disney+ subscriber number declined sequentially, and the same is expected for the current quarter. That being said, other business units performed reasonably well, and management foresees a nice HSD EPS increase for the current year.\"</p> <p class=\"paywall-full-content invisible\">Net income for the three months ended December 31 was $2.64B, compared to $2.15B for the same period last year.</p> <p class=\"paywall-full-content invisible\">On a per-share basis, the company earned $1.40, beating the average analyst estimate by 9 cents.</p> <p class=\"paywall-full-content invisible\">Revenue rose 5% to $24.7B and was ahead of expectations by $150M.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2186902541/image_2186902541.jpg",
            "link": "https://seekingalpha.com/news/4403436-disney-beats-on-core-metrics-and-guides-an-upbeat-profit-growth-for-2025",
            "pub_date": "2025-02-05 19:34:45",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403590",
            "title": "Elon Musk’s DOGE agents said to have gained access to Medicare systems",
            "description": "<html><body><p>Representatives of the Elon Musk-run Department of Government Efficiency have gained access to key payment and contracting systems of the U.S. Centers for Medicare and Medicaid Services in a bid to identify areas of potential fraud or waste, <em>The Wall<span class=\"paywall-full-content invisible\"> Street Journal </span></em><span class=\"paywall-full-content invisible\">reported Wednesday.</span></p> <p class=\"paywall-full-content invisible\">Citing people familiar with the matter, the publication said that DOGE agents have entered the CMS offices this week to study the agency's system technology and associated spending flows so as to highlight areas of possible fraud or waste.</p> <p class=\"paywall-full-content invisible\">DOGE is also said to be looking at the agency's organizational structure and its staffing methods.</p> <p class=\"paywall-full-content invisible\">CMS said it has two senior agency officials leading the coordination with DOGE. And they are “taking a thoughtful approach to see where <a href=\"https://www.wsj.com/health/healthcare/elon-musk-doge-medicare-medicaid-fraud-e697b162?st=ZRo1B6&amp;reflink=desktopwebshare_permalink\" rel=\"noopener\" target=\"_blank\">there may</a> be opportunities for more effective and efficient spending in line with meeting the goals of President Trump,” a CMS official said.</p> <p class=\"paywall-full-content invisible\">DOGE, created by President Donald Trumpunder the leadership of Elon Musk, billionaire CEO of Tesla (<a href=\"https://seekingalpha.com/symbol/TSLA\" title=\"Tesla, Inc.\">TSLA</a>) via an executive order on his first day in office has previously accessed the Treasury Department’s payments system, <em>The New York <a href=\"https://seekingalpha.com/news/4401711-elon-musks-doge-gains-access-to-treasury-departments-payments-system-nyt\" rel=\"noopener\" target=\"_blank\">Times </a></em><a href=\"https://seekingalpha.com/news/4401711-elon-musks-doge-gains-access-to-treasury-departments-payments-system-nyt\" rel=\"noopener\" target=\"_blank\">reported Saturday.</a></p> <p class=\"paywall-full-content invisible\">Major health insurers working with the CMS include UnitedHealth (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/UNH\" title=\"UnitedHealth Group Incorporated\">UNH</a></span>), Humana (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/HUM\" title=\"Humana Inc.\">HUM</a></span></span>), CVS Health (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CVS\" title=\"CVS Health Corporation\">CVS</a></span>),<span style=\"mso-spacerun: yes;\"> </span>Cigna (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CI\" title=\"The Cigna Group\">CI</a></span>), Clover Health (<a href=\"https://seekingalpha.com/symbol/CLOV\" title=\"Clover Health Investments, Corp.\">CLOV</a>) and Alignment Healthcare (<a href=\"https://seekingalpha.com/symbol/ALHC\" title=\"Alignment Healthcare, Inc.\">ALHC</a>), Centene (<a href=\"https://seekingalpha.com/symbol/CNC\" title=\"Centene Corporation\">CNC</a>), Molina Healthcare (<a href=\"https://seekingalpha.com/symbol/MOH\" title=\"Molina Healthcare, Inc.\">MOH</a>), Elevance Health (<a href=\"https://seekingalpha.com/symbol/ELV\" title=\"Elevance Health, Inc.\">ELV</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317447094/image_1317447094.jpg",
            "link": "https://seekingalpha.com/news/4403590-elon-musks-doge-agents-access-medicare-systems",
            "pub_date": "2025-02-05 19:35:24",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403592",
            "title": "TotalEnergies CEO expects U.S. financing for Mozambique LNG project in coming weeks",
            "description": "<html><body><p>TotalEnergies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a></span>) CEO Patrick Pouyanne said Wednesday that he expects financing from the U.S. for its $20B Mozambique LNG project will be <a href=\"https://www.reuters.com/business/energy/totalenergies-ceo-says-us-financing-mozambique-lng-project-expected-coming-weeks-2025-02-05/\" rel=\"nofollow\" target=\"_self\" title=\"approved in coming weeks\">approved in the coming weeks</a>, with other credit agencies to follow shortly thereafter, Reuters reported.</p> <p>The company is<span class=\"paywall-full-content invisible\"> waiting for loan re-approvals from the U.S., U.K. and Dutch export credit agencies before lifting a force majeure on the project that has been in place since 2021; the U.K. government reportedly is taking legal advice to </span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/news/4403121-u-k-taking-legal-advice-to-pull-out-of-totalenergies-20b-mozambique-lng-project-ft\" target=\"_self\" title=\"determine whether it can withdraw\">determine whether it can withdraw</a><span class=\"paywall-full-content invisible\"> from the controversial project.</span></p> <p class=\"paywall-full-content invisible\">The U.S. Export-Import Bank previously agreed a $4.7B loan for the project but it needs to be re-approved, after construction on the project was frozen in 2021 due to violent unrest near the project site.</p> <p class=\"paywall-full-content invisible\">Pouyanne said the Mozambique LNG project completion date would need to be pushed back to 2029-30 from its previously planned 2027.</p> <p class=\"paywall-full-content invisible\">The CEO also said he expects TotalEnergies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a></span>) will be able to continue investing in renewable energy in the U.S.; the French company is the largest LNG exporter to the U.S., with more than 10M tons under contract.</p> <p class=\"paywall-full-content invisible\">TotalEnergies (<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a>) <span style=\"color: #008000;\">+2%</span> on Wednesday after reporting better than expected <a href=\"https://seekingalpha.com/news/4403294-totalenergies-beats-top-line-and-bottom-line-estimates-initiates-fy25-outlook\" target=\"_self\" title=\"Q4 adjusted earnings\">Q4 adjusted earnings</a>, as higher trading profits in the gas market helped it offset some of the impact of low oil prices and weak fuel demand.</p> <p class=\"paywall-full-content invisible\">The company announced a 7% increase in the 2024 dividend to €3.22/share, and confirmed stock buybacks of $2B per quarter for 2025.</p> <p class=\"paywall-full-content invisible\">RBC Capital analyst Biraj Borkhataria said TotalEnergies' (<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a>) announced dividend growth was <a href=\"https://www.reuters.com/business/energy/totalenergies-posts-drop-fourth-quarter-profit-weak-oil-demand-2025-02-05/\" rel=\"nofollow\" target=\"_self\" title=\"higher than anticipated\">higher than anticipated</a>, and the company's reported 8% gearing \"should allay any concerns around debt levels.\"</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331308062/image_1331308062.jpg",
            "link": "https://seekingalpha.com/news/4403592-totalenergies-ceo-expects-u_s_-financing-for-mozambique-lng-project-in-coming-weeks",
            "pub_date": "2025-02-05 19:27:33",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403622",
            "title": "Illinois Tool Works targets 3% organic growth in 2025 with higher margins",
            "description": "<html><body><p>Earnings Call Insights: Illinois Tool Works (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ITW\" title=\"Illinois Tool Works Inc.\">ITW</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li><p>CEO Chris O'Herlihy highlighted a solid Q4 performance, with GAAP EPS rising 7% to $2.54 and operating income increasing 4% to $1.03 billion despite a 1.3% total revenue decline. Organic revenue growth turned positive at 0.4% when<span class=\"paywall-full-content invisible\"> excluding product line simplification (PLS). Record operating margins reached 26.2%, driven by a 140 basis point improvement, including contributions from enterprise initiatives.</span></p></li> <li class=\"paywall-full-content invisible\"><p>O'Herlihy emphasized the company’s focus on driving above-market organic growth and achieving a 3% customer-backed innovation (CBI) yield by 2030, with patent filings increasing 18% in 2024. He stated that ITW is \"well-positioned to capitalize on an improving demand environment if it should materialize.\"</p></li> <li class=\"paywall-full-content invisible\"><p>CFO Michael Larsen noted that six out of seven segments expanded operating margins in Q4, with enterprise initiatives contributing 120 basis points. He also mentioned free cash flow reaching a record $1 billion, with a conversion rate of 133%.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li><p>ITW provided full-year 2025 guidance, projecting organic growth of 1% to 3%, excluding a 1% decline from PLS. GAAP EPS is forecasted between $10.15 and $10.55, with a midpoint of $10.35 reflecting non-operational headwinds, including a $0.30 foreign currency impact.</p></li> <li><p>Operating margins are expected to improve by 100 basis points to a range of 26.5% to 27.5%. Enterprise initiatives will contribute approximately 100 basis points to margin improvement across segments.</p></li> <li><p>Management stated that Q1 2025 EPS would represent about 22% of the year's total due to seasonal revenue declines and increased restructuring expenses.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li><p>GAAP EPS for Q4 2024 came in at $2.54, exceeding analysts' estimates of $2.50. Revenue was $3.98 billion, compared to an analysts' estimate of $3.98 billion.</p></li> <li><p>Automotive OEM revenue declined 2% in Q4, but margins improved by 230 basis points, reaching 19.6% for the full year. The segment is on track to achieve its low-to-mid 20% operating margin target in the next few years.</p></li> <li><p>Food Equipment grew 3.5% organically in Q4, driven by equipment and service growth. Asia-Pacific sales were particularly strong, growing 11%, with operating margins improving by 170 basis points to 27%.</p></li> <li><p>Specialty Products saw a 4% organic revenue decline due to strategic PLS but achieved a record 28.4% margin. Management expects this segment to grow in 2025 despite ongoing PLS.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Stephen Volkmann, Jefferies, inquired about enterprise initiative benefits by segment. CFO Michael Larsen explained that Automotive OEM saw the largest improvement with 190 basis points, while Welding experienced 60 basis points.</p></li> <li><p>Scott Davis, Melius Research, asked about margin sustainability in a down volume environment. CEO Chris O'Herlihy highlighted the role of enterprise initiatives and CBI in driving continuous improvement, noting, \"These initiatives are independent of volume and deliver meaningful contributions.\"</p></li> <li><p>Andrew Kaplowitz, Citi Group, sought clarity on sales momentum. Larsen emphasized that while some end markets, including semiconductors, showed positive signs, ITW’s guidance is based on current demand levels.</p></li> <li><p>Jamie Cook, Truist Securities, asked about potential growth challenges in certain segments. O'Herlihy reaffirmed confidence in all segments achieving 4%-plus growth, citing the success of CBI initiatives across the portfolio.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Analysts expressed cautious optimism, focusing on margin sustainability and growth potential in challenging markets. Questions were balanced, with some pressing for details on specific contributions from enterprise initiatives and recovery timelines in key segments.</p></li> <li><p>Management maintained a confident tone, particularly when discussing operational improvements and strategic progress. Phrases like \"well-positioned\" and \"strong execution\" dominated their remarks, reflecting optimism despite market headwinds.</p></li> <li><p>Compared to Q3, management displayed slightly more confidence in near-term growth opportunities, particularly in segments like Food Equipment and Automotive OEM.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Q4 organic revenue at -0.5% was an improvement over Q3’s -1.4%, signaling stabilization in demand. Operating margin rose to 26.2% from 26.5% in Q3, reflecting continued operational efficiency.</p></li> <li><p>Automotive OEM maintained its trajectory toward margin improvement despite lower volumes. Food Equipment rebounded with 3.5% organic growth, compared to flat growth in Q3.</p></li> <li><p>Management’s tone shifted from cautious in Q3 to slightly more optimistic in Q4, supported by improved performance metrics and progress on strategic priorities like CBI.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management noted ongoing non-operational headwinds, including foreign currency translation and restructuring expenses. They also highlighted uncertainty in demand recovery timing, particularly in Construction Products and Automotive OEM.</p></li> <li><p>Analysts raised concerns about potential tariff impacts on automotive and other segments, though management downplayed the risks, citing their \"produce where we sell\" strategy.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Illinois Tool Works delivered a strong finish to 2024, with record free cash flow and operating margins. The company’s focus on customer-backed innovation and enterprise initiatives positions it for growth in 2025, supported by a robust margin outlook. While challenges persist in automotive and construction markets, ITW remains confident in its ability to outperform end markets and sustain profitability.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/ITW/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403622-illinois-tool-works-targets-3-percent-organic-growth-in-2025-with-higher-margins",
            "pub_date": "2025-02-05 19:29:23",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403612",
            "title": "Capri forecasts $4.4B FY 2025 revenue with recovery expected in FY 2026",
            "description": "<html><body><p>Earnings Call Insights: Capri Holdings Limited (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CPRI\" title=\"Capri Holdings Limited\">CPRI</a></span>) Q3 2025</p> <h3>Management View</h3> <ul> <li>CEO John D. Idol acknowledged that the business faced significant challenges during the quarter, with a 12% decline in revenue driven by softening demand for luxury fashion goods globally, particularly in China, and strategic<span class=\"paywall-full-content invisible\"> missteps at Versace and Michael Kors. He highlighted plans to share detailed strategies for growth at the upcoming Investor Day.</span> </li> <li class=\"paywall-full-content invisible\">Versace revenue decreased 15% due to global luxury demand declines and adjustments in product positioning. The brand's AUR in the full-price channel increased mid-single digits. Idol noted adjustments to Versace's pricing and product architecture, aiming to balance luxury with aspirational elements.</li> <li class=\"paywall-full-content invisible\">Jimmy Choo revenue declined 4%, with strength reported in women's accessories and casual footwear sales within the retail channel. The brand plans to expand its accessories mix while leveraging high-profile collaborations and campaigns.</li> <li class=\"paywall-full-content invisible\">Michael Kors revenue dropped 12% due to demand softness and strategic adjustments. Plans include refocusing on the brand's heritage, realigning pricing, and rebuilding core product assortments to drive higher full-price sell-throughs.</li> <li class=\"paywall-full-content invisible\">CFO Thomas J. Edwards Jr. reported total company revenue of $1.3 billion, a 12% year-over-year decrease, citing declines across all brands and geographies. Operating margin was 6%, down from 12.1% last year. He emphasized the company's financial strength and plans to improve margins through cost-saving measures and strategic initiatives.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Fourth quarter revenue is expected to decline 20% to $975 million, with wholesale revenue forecasted to drop by 30%. Versace revenue is projected at $200 million, Jimmy Choo at $125 million, and Michael Kors at $650 million.</li> <li>FY 2025 revenue is forecasted at $4.4 billion with operating income of approximately $100 million. For FY 2026, revenue is expected to stabilize at $4.1 billion, including $160 million in negative impacts from foreign currency and store closures. Operating income is anticipated to reach $150 million, supported by $150 million in cost reductions.</li> <li>Management expects Versace revenue to reach $800 million, Jimmy Choo $550 million, and Michael Kors $2.75 billion in FY 2026. Gross margin improvement and operating margin expansion are anticipated through cost reductions and pricing adjustments.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Total company revenue declined 12%, with retail sales down low double digits and e-commerce down high single digits. Geography-wise, revenue fell 11% in the Americas, 9% in EMEA, and 20% in Asia.</li> <li>Gross margin declined to 64.4%, impacted by lower full-price sell-throughs. Operating expenses decreased by $20 million but deleveraged as a percentage of revenue.</li> <li>Versace posted an operating margin of negative 10.9%, Jimmy Choo negative 3.8%, and Michael Kors 16.2%. Net income for the quarter was $54 million, or $0.45 per diluted share, including $23 million in foreign currency losses.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Simeon Siegel, BMO Capital Markets: Asked about the promotional environment and gross margin guidance. John Idol explained that competitive dynamics remain unchanged, with consumers becoming more price-sensitive, particularly at Michael Kors. CFO Edwards highlighted expectations for modest gross margin improvement in FY 2026.</li> <li>Robert Drbul, Guggenheim Securities: Inquired about pricing strategies and marketing spend. Idol noted that pricing adjustments at Michael Kors, including introducing a good, better, best strategy, have shown early positive results. He added that marketing efforts will focus on reconnecting with the brand's heritage.</li> <li>Brooke Roach, Goldman Sachs: Asked about retail performance assumptions. Idol emphasized product innovation, pricing adjustments, and marketing strategies as key drivers for improving retail trends.</li> <li>Paul Lejuez, Citigroup Inc.: Questioned the impact of the terminated merger and leadership changes. Idol acknowledged the merger's distractions but affirmed that the team is now fully focused on executing its growth strategies.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed skepticism about the company's ability to execute its turnaround plan, particularly regarding wholesale declines and pricing adjustments. Questions were pressing yet focused on understanding strategic shifts.</li> <li>Management maintained a cautiously optimistic tone, emphasizing confidence in the revised strategies and the potential for recovery. Idol frequently referenced data-driven insights and early positive indicators to support the outlook.</li> <li>Compared to prior remarks, management's tone in addressing challenges appeared more resolute, with a clear focus on long-term strategic execution.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance language shifted toward a long-term recovery focus, with FY 2027 positioned as the year of returning to growth.</li> <li>Analysts’ questions this quarter emphasized concerns about pricing and wholesale trends, diverging from previous focus areas.</li> <li>Management demonstrated greater clarity in articulating brand-specific strategies and financial targets.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Challenges include declining demand for luxury goods, particularly in China, and potential execution risks related to pricing and repositioning strategies.</li> <li>Wholesale channel softness remains a significant headwind. Management plans to stabilize this through strategic pricing adjustments and product realignment.</li> <li>Analysts raised concerns about the impact of further store closures and the potential for continued pressure on margins.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Capri Holdings reported a challenging quarter, with revenue declines across all brands and regions. Management outlined comprehensive strategies to address missteps, including pricing adjustments and product repositioning at Versace and Michael Kors, while expanding Jimmy Choo's accessories and casual footwear offerings. Despite near-term challenges, the company projects stabilization in FY 2026 and a return to growth in FY 2027. Investors will closely watch the execution of these initiatives and the upcoming Investor Day for further clarity.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/CPRI/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403612-capri-forecasts-4_4b-fy-2025-revenue-with-recovery-expected-in-fy-2026",
            "pub_date": "2025-02-05 19:18:12",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403614",
            "title": "T. Rowe Price targets positive flows in 2025 with improved sales momentum and ETF growth",
            "description": "<html><body><p>Earnings Call Insights: T. Rowe Price Group, Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/TROW\" title=\"T. Rowe Price Group, Inc.\">TROW</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Rob Sharps highlighted a reduction in net outflows for 2024, which decreased nearly 50% year-over-year to $43.2 billion. He expressed optimism about achieving positive flows in 2025, supported by improved investment<span class=\"paywall-full-content invisible\"> performance and increased gross sales across channels.</span> </li> <li class=\"paywall-full-content invisible\">The company expanded its ETF portfolio to 17 funds, closing the year with $8 billion in ETF AUM. Target date funds led with $16.3 billion in net inflows for the year, its strongest since 2019. New launches included personalized retirement manager and managed lifetime income products.</li> <li class=\"paywall-full-content invisible\">A strategic partnership with Aspida was announced, expected to enhance T. Rowe’s insurance asset management offerings, particularly in public and private assets.</li> <li class=\"paywall-full-content invisible\">CFO Jen Dardis emphasized that Q4 adjusted diluted EPS was $2.12, bringing the full-year EPS to $9.33, up 23% from 2023. Adjusted net revenue for Q4 reached $1.8 billion, contributing to a full-year revenue of nearly $7.2 billion, a 10.1% increase over the prior year.</li> <li class=\"paywall-full-content invisible\">Head of Global Investments Eric Veiel noted that 54% of funds exceeded peer group medians for the year, with strong performances in U.S. equity research and several sector-specific strategies. However, he acknowledged challenges in mid-cap growth and emerging markets equity performance.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management expects 2025 to show further improvements in net flows, though achieving full-year positive flows remains uncertain. CEO Rob Sharps stated, “Our base-case is that in 2025, we further reduce net outflows and set the stage to return to organic growth.”</li> <li>Operating expenses for 2025 are forecasted to rise 4-6% over 2024 levels, driven by strategic investments and real-estate costs related to the new Baltimore headquarters.</li> <li>The company plans further expansion in ETFs, targeting launches in 2025 and 2026, including strategies like the capital appreciation premium income ETF.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 adjusted net revenue was $1.8 billion, up 16% year-over-year. Investment advisory revenue reached $1.7 billion, supported by higher average AUM and positive flows in fixed income and alternatives.</li> <li>Net outflows for Q4 totaled $19.3 billion, primarily impacted by a large subadvised variable annuity redemption. However, December saw several sizable mandate wins, including $1.4 billion in ETF net flows.</li> <li>Annualized effective fee rate declined to 40.5 basis points due to a shift towards lower-fee products and vehicles.</li> <li>Full-year capital returns to stockholders amounted to over $1.4 billion, including $355 million in share buybacks.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li> <strong>Bill Katz, TD Cowen:</strong> Asked about the Aspida partnership and insurance opportunities. CEO Rob Sharps explained that Aspida allows T. Rowe to refine its insurance asset management offerings, particularly in fixed income and private assets, and is expected to yield direct benefits in 2025.</li> <li> <strong>Benjamin Budish, Barclays Capital:</strong> Inquired about fee rate dynamics and trends into 2025. CFO Jen Dardis noted that elevated redemptions in higher-fee mutual funds and growth in lower-fee vehicles like ETFs and institutional accounts have compressed fee rates by 2% in 2024.</li> <li> <strong>Dan Fannon, Jefferies:</strong> Sought clarification on gross sales trends. CEO Sharps emphasized broad-based improvements across channels, making 2024 the best year for gross sales since 2021, with particular strength in retirement date funds and institutional fixed income.</li> <li> <strong>Ken Worthington, JPMorgan:</strong> Questioned the ETF franchise’s impact on customer reach. CEO Sharps explained ETFs are reaching new buyers, particularly ETF-focused advisors, while acknowledging some cannibalization from mutual funds.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed cautious optimism about the company’s ability to reduce outflows and achieve positive flows, particularly in light of improving gross sales. However, concerns over fee compression and equity performance lingered.</li> <li>Management demonstrated confidence in strategic initiatives, frequently referencing momentum in ETFs, retirement date funds, and alternatives. CEO Rob Sharps’ tone reflected optimism about achieving organic growth, but he acknowledged challenges such as market conditions and fee pressures.</li> <li>Compared to the prior quarter, management’s tone was more positive, buoyed by strong December flows and strategic partnerships. Analysts maintained a slightly skeptical tone, probing for clarity on fee trends and competitive positioning.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Net outflows increased from $12.2 billion in Q3 to $19.3 billion in Q4, largely due to a previously disclosed subadvised variable annuity redemption.</li> <li>Gross sales improved notably in Q4, driven by strong December wins across asset classes and channels.</li> <li>Operating expenses guidance for 2025 indicates slower growth compared to the 6-8% range for 2024.</li> <li>Management tone during the Q4 call was more optimistic compared to Q3, reflecting confidence in improved flows and strategic progress.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Fee compression driven by a shift towards lower-fee vehicles and pricing pressures remains a challenge.</li> <li>Equity performance, while improving in some areas, continues to lag in key strategies like mid-cap growth and emerging markets equity.</li> <li>Regulatory and liquidity hurdles could delay broader adoption of private market allocations in target date funds and retirement products.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">T. Rowe Price is making progress in reducing outflows and building momentum in key growth areas like ETFs, target date funds, and insurance asset management. While challenges such as fee compression and uneven equity performance persist, management’s strategic initiatives and optimistic outlook for 2025 signal potential for improved financial and operational performance.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/TROW/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403614-t-rowe-price-targets-positive-flows-in-2025-with-improved-sales-momentum-and-etf-growth",
            "pub_date": "2025-02-05 19:18:44",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403582",
            "title": "Kenvue confirms activist Starboard nominations for board",
            "description": "<html><body><p>Kenvue Inc. (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/KVUE\" title=\"Kenvue Inc.\">KVUE</a></span>) confirmed that it received activist Starboard Value's submission of four nominees for the consumer health company's board for the 2025 annual meeting.</p> <p>Kenvue's (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/KVUE\" title=\"Kenvue Inc.\">KVUE</a></span>) board has been reviewing Starboard's nominees and will present its formal recommendations<span class=\"paywall-full-content invisible\"> at some point, the company said in a </span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/pr/19992791-kenvue-highlights-commitment-to-shareholder-value\" rel=\"noopener\" target=\"_blank\" title=\"statement\">statement</a><span class=\"paywall-full-content invisible\"> on Wednesday. Members of Kenvue's board and management team have had several discussions with Starboard.</span></p> <p class=\"paywall-full-content invisible\">The Starboard nominees include – Michelle Millstone-Shroff, Cara Robinson, Bindu Shah and Starboard founder and head Jeffrey C. Smith, according to a<a href=\"https://seekingalpha.com/filing/9514241\" rel=\"noopener\" target=\"_blank\" title=\" filing \"> filing </a>on Wednesday. Kenue highlighted in its statement that it appointed two new independent directors with the resignation of two Johnson &amp; Johnson (<a href=\"https://seekingalpha.com/symbol/JNJ\" title=\"Johnson &amp; Johnson\">JNJ</a>) executives from the board.</p> <p class=\"paywall-full-content invisible\">Starboard disclosed in October that the fund <a href=\"https://seekingalpha.com/news/4181820-activist-investor-starboard-takes-stake-in-kenvue-wsj#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">accumulated a stake </a>and was pushing for changes to help the company's stock price. Kenvue<a href=\"https://seekingalpha.com/news/4190403-kenvue-needs-to-fix-its-skin-health-beauty-segments-starboards-jeff-smith-says#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\"> needs to focus on fixing its skin, health and beauty</a> segments, Smith said at the time after he presented at an activist conference.</p> <p class=\"paywall-full-content invisible\">\"We believe that meaningful change is required on the Board in order to provide renewed accountability to stockholders and unlock the Company’s trapped potential,\" Smith said in the filing. \"We firmly believe that with the right Board in place, Kenvue can become a best-in-class company in its industry.\"</p> <p class=\"paywall-full-content invisible\">Shares of Kenvue (<a href=\"https://seekingalpha.com/symbol/KVUE\" title=\"Kenvue Inc.\">KVUE</a>)<span style=\"color: #ff0000;\"> ticked lower by 0.6% </span>on Wednesday.</p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/458549551/image_458549551.jpg",
            "link": "https://seekingalpha.com/news/4403582-kenvue-confirms-activist-starboard-nominations-for-board",
            "pub_date": "2025-02-05 19:11:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403606",
            "title": "The top 10 Growth stocks by BofA: ALL, CRWD, DOW, and more",
            "description": "<html><body><p class=\"MsoNormal\">Bank of America updated their “Growth 10” stocks, which are the 10 highest ranking growth stocks according to their methodology.</p> <p class=\"MsoNormal\">Analysts replaced Uber Technologies (<a href=\"https://seekingalpha.com/symbol/UBER\" title=\"Uber Technologies, Inc.\">UBER</a>) by Merck &amp; Co. (<a href=\"https://seekingalpha.com/symbol/MRK\" title=\"Merck &amp; Co., Inc.\">MRK</a>) as the BofA vs. Consensus EPS Surprise rating<span class=\"paywall-full-content invisible\"> fell below 5 for Uber (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/UBER\" title=\"Uber Technologies, Inc.\">UBER</a><span class=\"paywall-full-content invisible\">).</span></p> <p class=\"MsoNormal paywall-full-content invisible\">Criteria for the “Growth 10” stocks includes a BofA vs. Consensus EPS Surprise rating of 1; a “buy” opinion; the stock must be rated top 1 or 2 by BofA vs. Consensus EPS Surprise model for less than 10 months; and be part of the select 10 stocks with the highest five-year projected EPS growth rate.</p> <p class=\"MsoNormal paywall-full-content invisible\">This group is up 7.3% year-to-date, compared to 2.7% for the S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>). Also, their annual total return for 2024 is 29%.</p> <p class=\"MsoNormal paywall-full-content invisible\">Here is the full list:</p> <ul class=\"paywall-full-content invisible\"> <li class=\"MsoNormal\">Allstate Corp. (<a href=\"https://seekingalpha.com/symbol/ALL\" title=\"The Allstate Corporation\">ALL</a>) – Next five-year EPS growth: 172.7</li> <li class=\"MsoNormal\">CrowdStrike (<a href=\"https://seekingalpha.com/symbol/CRWD\" title=\"CrowdStrike Holdings, Inc.\">CRWD</a>) – Next five-year EPS growth: 55.0</li> <li class=\"MsoNormal\">Dow Inc. (<a href=\"https://seekingalpha.com/symbol/DOW\" title=\"Dow Inc.\">DOW</a>) – Next five-year EPS growth: 32.5</li> <li class=\"MsoNormal\">KKR &amp; Co. Inc. (<a href=\"https://seekingalpha.com/symbol/KKR\" title=\"KKR &amp; Co. Inc.\">KKR</a>) – Next five-year EPS growth: 28.6</li> <li class=\"MsoNormal\">Eli Lilly &amp; Co. (<a href=\"https://seekingalpha.com/symbol/LLY\" title=\"Eli Lilly and Company\">LLY</a>) – Next five-year EPS growth: 44.8</li> <li class=\"MsoNormal\">Meta Platforms (<a href=\"https://seekingalpha.com/symbol/META\" title=\"Meta Platforms, Inc.\">META</a>) – Next five-year EPS growth: 13.8</li> <li class=\"MsoNormal\">Merck &amp; Co. (<a href=\"https://seekingalpha.com/symbol/MRK\" title=\"Merck &amp; Co., Inc.\">MRK</a>) – Next five-year EPS growth: 54.9</li> <li class=\"MsoNormal\">Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>) – Next five-year EPS growth: 22.9</li> <li class=\"MsoNormal\"> <span lang=\"FR\" style=\"mso-ansi-language: FR;\">Progressive Corp. </span>(<a href=\"https://seekingalpha.com/symbol/PGR\" title=\"The Progressive Corporation\">PGR</a>) – Next five-year EPS growth: 15.9</li> <li class=\"MsoNormal\">Warner Bros. (<a href=\"https://seekingalpha.com/symbol/WBD\" title=\"Warner Bros. Discovery, Inc.\">WBD</a>) – Next five-year EPS growth: 13.2</li> </ul> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/168522145/image_168522145.jpg",
            "link": "https://seekingalpha.com/news/4403606-the-top-10-growth-stocks-by-bofa-all-crwd-dow-and-more",
            "pub_date": "2025-02-05 19:14:35",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403584",
            "title": "Dayforce targets 15% revenue growth for 2025 with 32% adjusted EBITDA margin",
            "description": "<html><body><p>Earnings Call Insights: Dayforce Inc. (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/DAY\" title=\"Dayforce Inc.\">DAY</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO David Ossip highlighted that Q4 sales exceeded expectations, contributing to a strong start for January 2025. He noted that sales cycles returned to historical levels, providing confidence in achieving 2025 sales targets. The<span class=\"paywall-full-content invisible\"> company starts the year with pipeline coverage approximately four times its sales target.</span> </li> <li class=\"paywall-full-content invisible\">Total revenue for 2024 reached $1.76 billion, growing 17% on a constant currency basis, while Dayforce recurring revenue excluding float grew 21%. Adjusted EBITDA margin expanded 140 basis points to 28.5%.</li> <li class=\"paywall-full-content invisible\">The company anticipates focusing on higher-margin areas of its business while phasing out legacy segments. Dayforce recurring revenue excluding float is expected to grow 15% to 17% in 2025 on a constant currency basis.</li> <li class=\"paywall-full-content invisible\">CFO Jeremy Johnson stated, \"In the fourth quarter, total revenue was $465.2 million, up 16.4% on a GAAP basis and 17% on a constant currency basis.\" Adjusted EBITDA reached $129.2 million, reflecting a 30.2% increase.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Dayforce projects total revenue growth of 14% to 15% for 2025, excluding float and on a constant currency basis. Adjusted EBITDA margin guidance was raised to 32%, up 100 basis points from prior Investor Day projections. Free cash flow margin is expected to improve by 230 basis points to 12%.</li> <li>Beyond 2025, the company anticipates maintaining total revenue growth near 15% while profitability improvements continue to outpace revenue growth, with adjusted EBITDA expected to expand by 100 to 150 basis points annually.</li> <li>For Q1 2025, total revenue excluding float is forecasted to grow 15% to 17% on a constant currency basis, with an adjusted EBITDA margin of 31% to 32%.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 2024 total revenue was $465.2 million, exceeding analysts' estimates of $455 million. Adjusted EPS was $0.48, surpassing the $0.45 analyst estimate.</li> <li>Dayforce recurring revenue excluding float grew 20% on a GAAP basis to $307.6 million. Professional services and other revenue increased 18% to $71.5 million.</li> <li>Adjusted cloud recurring gross margin expanded 230 basis points to 80.4%, while free cash flow for the full year grew 63.2% to $172 million.</li> <li>The company noted that the Dayforce Wallet product generated over $30 million in revenue in 2024, up from $12 million in 2023, and expects continued revenue momentum in 2025.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Siti Panigrahi, Mizuho Securities: Questioned Q4 recurring revenue impact and whether issues were one-time. CEO Ossip noted three key factors: lower employee volumes, reduced print and tax filing fees, and contract amendments. CFO Johnson added that these were isolated and did not affect future projections.</li> <li>Mark Murphy, JPMorgan Chase: Asked about muted Q4 employee volumes. CFO Johnson attributed it to seasonal factors and one-time events like severe weather.</li> <li>Raimo Lenschow, Barclays: Inquired about sales momentum translating to 2025. CEO Ossip confirmed strong performance across segments and regions, with 146 net new customers going live in Q4.</li> <li>Scott Berg, Needham &amp; Company: Asked about Dayforce AI Agent adoption. CEO Ossip highlighted strong initial demand with 60 Co-Pilot units sold since November, emphasizing AI's role in differentiation.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed positive sentiment regarding sales momentum and profitability improvements but probed recurring revenue impacts and macroeconomic assumptions. Questions reflected cautious optimism.</li> <li>Management adopted a confident tone during prepared remarks, emphasizing innovation, strong pipeline coverage, and cost optimization. Defensive responses were observed when addressing Q4 recurring revenue shortfalls, with phrases like \"all of them are small on a dollar basis\" used.</li> <li>Compared to Q3, management's tone showed increased confidence in profitability and operational efficiency.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance for 2025 maintained a similar revenue growth target of 14% to 15%, excluding float, consistent with prior projections. Adjusted EBITDA margin guidance was raised by 100 basis points to 32%.</li> <li>Analysts' focus shifted from elongated sales cycles in Q3 to exploring the impact of macroeconomic factors and AI adoption in Q4.</li> <li>Management's emphasis on profitability and free cash flow growth was stronger in Q4, reflecting a strategic shift toward efficiency.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management acknowledged lower-than-expected employee volumes, reduced print and tax filing fees, and contract amendments as minor Q4 revenue headwinds.</li> <li>Analysts highlighted potential risks from macroeconomic uncertainty, including employment levels and interest rate changes, which could impact recurring revenue.</li> <li>CFO Jeremy Johnson noted that foreign exchange headwinds and interest rate cuts could create challenges in 2025, though the impact is expected to be manageable.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Dayforce Inc. delivered strong Q4 results, with total revenue exceeding expectations and profitability metrics showing significant improvement. The company raised its adjusted EBITDA margin guidance for 2025 to 32% and projected sustained revenue growth of 14% to 15%. Strong demand for its Dayforce Wallet and AI-driven innovations further underscore its growth potential, while management's strategic focus on efficiency positions the company for continued profitability gains. Despite minor Q4 revenue impacts, Dayforce's positive sales momentum and robust pipeline coverage provide confidence for future performance.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/DAY/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403584-dayforce-targets-15-percent-revenue-growth-for-2025-with-32-percent-adjusted-ebitda-margin",
            "pub_date": "2025-02-05 19:01:05",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403583",
            "title": "New York Times projects 14%-17% digital subscription revenue growth for Q1 2025",
            "description": "<html><body><p>Earnings Call Insights: The New York Times Company (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/NYT\" title=\"The New York Times Company\">NYT</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>The company added 350,000 net new digital subscribers in Q4 2024, reaching 11.4 million total subscribers. The bundle product now represents 48% of the subscriber base, progressing towards a majority share<span class=\"paywall-full-content invisible\"> by the end of 2025.</span> </li> <li class=\"paywall-full-content invisible\">CEO Meredith Kopit Levien highlighted the 16% growth in digital subscription revenue during the quarter, driven by increases in both subscriber numbers and ARPU. The bundle product played a significant role in subscriber additions alongside strong engagement in news and lifestyle products.</li> <li class=\"paywall-full-content invisible\">Digital advertising revenue increased by 9.5% in Q4, supported by the company’s AI-powered BrandMatch product and expanded ad supply in The Athletic and games.</li> <li class=\"paywall-full-content invisible\">Wirecutter achieved its best Cyber Week sales period, contributing to a 16% increase in other revenues. The company also expanded content offerings across video and audio formats to enhance engagement.</li> <li class=\"paywall-full-content invisible\">CFO Will Bardeen reported AOP growth of 17% year-over-year to $455 million, with an AOP margin expansion of 150 basis points to 17.6%. Free cash flow for 2024 was $381 million, and the company returned $168 million to shareholders through share repurchases and dividends. A quarterly dividend increase from $0.13 to $0.18 and a new $350 million share repurchase authorization were announced.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>The company expects digital-only subscription revenues to grow by 14%-17% in Q1 2025, with total subscription revenues projected to increase by 7%-10%. Digital advertising revenues are anticipated to grow in the high single digits, and total advertising revenues are expected to range from a low single-digit decrease to a low single-digit increase.</li> <li>Adjusted operating costs are forecasted to increase by 5%-6% in Q1 2025, reflecting continued investments in premium journalism and digital product development.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 digital-only subscription revenue grew 16% to $335 million, aligning with the high end of previous guidance. Total subscription revenue increased 8% to $467 million. Digital subscription ARPU rose 4.4% to $9.65, driven by price increases and subscriber upgrades.</li> <li>Digital advertising revenue reached $118 million, marking a 9.5% increase, while total advertising revenue saw a modest 1% growth to $165 million.</li> <li>Other revenues grew by 16% to $95 million, supported by Wirecutter and licensing performance.</li> <li>Adjusted diluted EPS for Q4 rose $0.10 to $0.80, attributed to higher operating profit and interest income.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Benjamin Soff, Deutsche Bank: Questioned long-term targets and strategy adjustments given evolving industry dynamics. Meredith Kopit Levien reiterated confidence in the company’s essential subscription strategy, emphasizing resilience through engagement and diversified revenue streams. CFO Will Bardeen affirmed that the company remains on track to achieve midterm targets for subscriber growth and capital returns.</li> <li>Thomas Yeh, Morgan Stanley: Inquired about marketing ROI and its timing. CFO Will Bardeen explained that marketing investments in Q4 reflected high ROI opportunities and clarified that ROI realization occurs over multiple quarters.</li> <li>David Karnovsky, JP Morgan: Asked about impacts of AI-driven search results on traffic. CEO Meredith Kopit Levien acknowledged AI’s role in audience headwinds but emphasized the company’s focus on direct relationships and habit formation.</li> <li>Vasily Karasyov, Cannonball Research: Highlighted opportunities in advertising formats like video. CEO Meredith Kopit Levien pointed to continued strong CPMs and plans for format innovation in video and audio advertising.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed cautious optimism but raised concerns about traffic headwinds and questioned the sustainability of growth in areas like ARPU and subscription additions.</li> <li>Management maintained a confident tone during prepared remarks and Q&amp;A, emphasizing strategic execution and resilience against platform-driven audience challenges.</li> <li>Compared to Q3, management showed increased confidence in subscription growth and ARPU trajectory, supported by strong Q4 results and forward-looking guidance.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 digital subscriber additions of 350,000 exceeded the 260,000 added in Q3, reflecting stronger growth momentum.</li> <li>Digital advertising revenue growth accelerated to 9.5% in Q4 compared to 9% in Q3, driven by expanded ad supply and AI-driven targeting capabilities.</li> <li>ARPU growth was more pronounced in Q4, rising 4.4% compared to 1.8% in Q3, supported by pricing adjustments.</li> <li>Management’s tone in Q4 reflected greater confidence in hitting subscriber targets and navigating industry challenges, compared to a more cautious tone in Q3.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management acknowledged ongoing audience headwinds from declining platform traffic, compounded by AI-driven search tools. The company emphasized its strategy of driving direct relationships to mitigate these impacts.</li> <li>Analysts raised concerns about the sustainability of ARPU growth and potential disruptions from the ongoing tech employee strike, though management stated that Q4 guidance already incorporates strike-related estimates.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">The New York Times Company continues to execute its essential subscription strategy, achieving robust growth in digital subscribers, ARPU, and advertising revenue in Q4 2024. With strong forward-looking guidance for subscription revenue and confident management, the company remains focused on resilience through high-quality journalism, diversified revenue streams, and innovative product offerings. However, persistent audience headwinds and labor uncertainties warrant investor attention.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/NYT/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403583-new-york-times-projects-14-percentminus-17-percent-digital-subscription-revenue-growth-for-q1",
            "pub_date": "2025-02-05 18:59:44",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}