{
    "data": [
        {
            "id": "4558784",
            "title": "Merck's Keytruda shows overall survival benefit in ovarian cancer",
            "description": "<html><body><p data-eci=\"true\">Merck (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MRK\" title=\"Merck &amp; Co., Inc.\">MRK</a></span></span>) said that an analysis of a phase 3 trial found that treatment with Keytruda (pembrolizumab) led to a <span>significant improvement in overall survival regardless of an ovarian cancer patient's PD-L1 status.</span></p>\n<p><span>The pharma also noted that the results were seen with or without Avastin (bevacizumab).</span></p>\n<p><span><span>With a median follow-up of 32.7 months. Keytruda plus paclitaxel with or without Avastin <a href=\"https://seekingalpha.com/pr/20417701-keytruda-pembrolizumab-plus-paclitaxel-with-or-without-bevacizumab-significantly-improved-key\" target=\"_self\" title=\"reduced\">reduced</a> the risk of death by 18% compared to paclitaxel with or without Avastin alone. For those on Keytruda, median OS was 17.7 months compared to 14 months for those taking the placebo regimen.</span></span></p>\n<p><span><span>Merck had previously released data showing that the Keytruda regimen met its primary endpoint, progression-free survival. Overall survival was the secondary endpoint in the KEYNOTE-B96 trial. </span></span></p>\n<p><span><span>The European Medicines Agency’s Committee for Medicinal Products also adopted a positive opinion for approving the Keytruda regimen for platinum-resistant epithelial ovarian, fallopian tube, or primary peritoneal carcinoma in adults whose tumors express PD-L1 and who have received at least one or two prior treatments.</span></span></p>\n<p><span><span>The US FDA <a href=\"https://seekingalpha.com/news/4549898-merck-keytruda-gains-additional-indications-ovarian-fallopian-tube-carcinoma\" target=\"_self\" title=\"granted\">granted</a> that indication for Keytruda earlier in February.</span></span></p>\n<p><span><span>Merck also released data on Keytruda plus Pfizer (<a href=\"https://seekingalpha.com/symbol/PFE\" title=\"Pfizer Inc.\">PFE</a>) and Astellas' (<a href=\"https://seekingalpha.com/symbol/ALPMF\" title=\"Astellas Pharma Inc.\">ALPMF</a>)(<a href=\"https://seekingalpha.com/symbol/ALPMY\" title=\"Astellas Pharma Inc.\">ALPMY</a>) antibody-drug conjugate Padcev<span> (enfortumab vedotin) for muscle-invasive bladder cancer. Results <a href=\"https://seekingalpha.com/pr/20417665-keytruda-pembrolizumab-plus-padcev-enfortumab-vedotin-ejfv-reduced-risk-of-event-free\" target=\"_self\" title=\"showed\">showed</a> the combination reduced the risk of event-free survival events by 47% and cut the risk of death by 35% when given before and after surgery versus neoadjuvant chemotherapy and surgery.</span></span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558784-merck-keytruda-shows-overall-survival-benefit-ovarian-cancer",
            "pub_date": "2026-02-28 00:40:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558796",
            "title": "Caris Life Sciences targets 23–26% revenue growth and $1B milestone in 2026 while expanding early detection investments",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Caris Life Sciences (CAI) Q4 2025  </p>\n<h3>Management View</h3>\n<ul>\n<li>Brian Brille, Executive Vice Chairman &amp; Executive VP, highlighted Caris' record-breaking quarter, with total revenues increasing 125% year-over-year to $293 million, driven by strong clinical profiling, and noted \"Molecular profiling services revenues increased to $282 million in the fourth quarter representing an increase of 199% year-over-year.\" Brille emphasized the achievement of positive GAAP net income of $82 million, adjusted EBITDA of $106 million, and free cash flow of $39.7 million, stating \"This is our third straight quarter of positive adjusted EBITDA and positive free cash flow. This strong profitability profile is unique in our industry and provides valuable strategic flexibility for ongoing investment.\"</li>\n<li>The company achieved a significant milestone with its molecular data set now exceeding 1 million profiled cases, enhancing its position as a key clinical genomic resource. Brille announced the launch plans for Caris Detect, a new cancer early detection test, in 2026: \"Caris Detect has the potential to bend the cancer mortality curve and ultimately make cancer a curable disease.\"</li>\n<li>A new Chief Commercial Officer, Bobby Hill, was appointed in the fourth quarter to drive commercial expansion and sales force growth. Hill stated, \"Our Q4 growth was 20%, which was sequential improvement from 18% in Q3 '25, with Caris Assure delivering 59% year-over-year growth in Q4 '25 and continuing to gain traction.\"</li>\n<li>President David Spetzler presented interim results for the ACHIEVE-1 study, supporting the upcoming launch of Caris Detect, reporting \"Stage I and II combined, ACHIEVE-1 reported 63.1% sensitivity… specificity in the screening population…99.1%.\"</li>\n<li>CFO Luke Power explained the strategic approach to investments: \"For the full year of 2026, we expect total revenue for existing solutions to be in the range of $1.0 billion to $1.02 billion, which represents growth of approximately 23% to 26% compared to 2025.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Caris projects 2026 total revenue in the range of $1.0 billion to $1.02 billion, anticipating molecular profiling growth of approximately 21% to 22%, and therapy selection volume growth of around 20% year-over-year.</li>\n<li>Power stated, \"Within the total revenue range, we expect molecular profiling to grow approximately 21% to 22% in 2026. But excluding prior year additional revenue from exceeding previous accruals, this implies a Molecular Profiling growth rate of approximately 26% to 28%.\"</li>\n<li>Tissue ASP is expected to reach approximately $4,000 per case in Q1 2026 and $4,200 for the full year, while blood ASP is guided to $2,400–$2,500.</li>\n<li>Pharma and research revenue is expected to be $75 million to $85 million for 2026.</li>\n<li>Operating expenses are expected between $590 million and $595 million, with CapEx rising to $60 million, primarily for early detection capacity.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Q4 2025 total revenues reached $293 million, up 125% year-over-year, with molecular profiling revenue at $282 million and pharma R&amp;D services at $10.8 million.</li>\n<li>Annual molecular profiling revenues were $766.7 million, up 120%, with clinical case volumes rising 22% to approximately 199,300 profiles and an average sales price increase of 79%.</li>\n<li>Gross margins improved to 75% in Q4 2025, up from 54% in Q4 2024, and sequentially up from 68% in Q3 2025.</li>\n<li>Caris reported positive adjusted EBITDA of $138 million and free cash flow of $67 million for the full year.</li>\n<li>Cash on hand ended above $800 million, up $43 million in Q4.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Daniel Brennan, TD Cowen, asked about volume growth breakdowns and revenue pacing. Luke Power answered, \"The 20% is broken up very similar to Q4. So lower teens for tissue and then high 50s, lower 60s for blood from a growth standpoint.\"</li>\n<li>Subhalaxmi Nambi, Guggenheim, inquired about specificity data for MCED and the pharma R&amp;D environment. David Spetzler clarified the clinical context of specificity; Power explained, \"the $75 million to $85 million, it's based on looking at what we've been able to do historically from a base run rate, knowing that we signed the additional Genentech deal.\"</li>\n<li>Michael Ryskin, BofA, questioned ASP guidance. Power responded, \"the $4,200 is kind of where I want to guide to right now. And then we'll progress throughout the year. We'll get additional contracts.\"</li>\n<li>Vijay Kumar, Evercore, probed ASP assumptions and OpEx spending rationale. Power confirmed, \"on tissue, we put out the metrics that obviously, over 75% of our tissue volume is going to be under the PLA code.\"</li>\n<li>Colleen Babington, Wolfe Research, asked about CapEx allocation. Power explained, \"One of the key items from the CapEx standpoint is, obviously, our new Assure assay is going to be switched over to the Nova X.\"</li>\n<li>Patrick Donnelly, Citi, and others focused on MCED sales force buildout and MRD product timelines, with management indicating a phased hiring approach and data-driven launch timing.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed for specificity on volume growth, ASP sustainability, and investment returns, with a neutral to slightly positive tone regarding the outlook and company strategy.</li>\n<li>Management maintained a confident, measured tone during prepared remarks, frequently referencing the company's strong financial position and strategic flexibility. During Q&amp;A, responses reflected caution and discipline, especially regarding guidance and spending, as seen in Power's statement, \"But from a guidance standpoint, like the $4,200 feels really, really good right now, and that's what I want to stick with from the guidance standpoint.\"</li>\n<li>Compared to the previous quarter, management's confidence level rose, reflecting stronger margins and financial results. Analysts maintained a similar level of cautious optimism, shifting focus slightly more toward execution of growth investments.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Revenue growth accelerated to 125% in Q4 2025 from 113% in Q3, with gross margins increasing to 75% from 68%.</li>\n<li>Management shifted guidance language from cautious to more assertive, outlining a clear path to $1 billion revenue and expanded investments in early detection and commercial infrastructure.</li>\n<li>Analysts' focus moved from platform expansion and margin sustainability to execution of commercial scale and pipeline launches.</li>\n<li>Operating expenses are planned to rise more significantly in 2026, reflecting a transition toward investment-heavy growth.</li>\n<li>The tone from management is more assertive, highlighting strategic flexibility and a readiness to invest from a position of financial strength, while analysts continue to probe for clarity on the pace and impact of these investments.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management acknowledged the need for measured investment in sales and R&amp;D, noting, \"we're taking a measured approach with our volume.\"</li>\n<li>The ramp-up in operating expenses and CapEx for early detection initiatives could pressure near-term profitability if returns on investment are delayed.</li>\n<li>Specificity and sensitivity data for Caris Detect, while promising, remain interim, with additional validation pending. Spetzler cautioned, \"These are interim results, which we are extremely excited about...that blinded validation is currently in process.\"</li>\n<li>Competitive landscape and reimbursement environment remain dynamic, requiring ongoing execution in payer contracting and commercial expansion.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Caris Life Sciences management highlighted a record-breaking fourth quarter with strong revenue growth, robust margins, and sustained profitability, positioning the company for a 23–26% revenue increase in 2026. The company is investing aggressively in its early detection platform and expanding its commercial organization, while maintaining financial discipline and a positive cash flow profile. Interim results from the Caris Detect study indicate promising clinical performance, with further validation expected. Management is confident in leveraging its strengthened balance sheet and proprietary data set to capitalize on market opportunities in precision medicine and early cancer detection throughout 2026.</p>\n<p><a href=\"https://seekingalpha.com/symbol/cai/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558796-caris-life-sciences-targets-23-26-percent-revenue-growth-and-1b-milestone-in-2026-while",
            "pub_date": "2026-02-28 00:40:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558790",
            "title": "Goldman Sachs BDC outlines 97% first lien focus and $1.2B new commitments amid AI risk mitigation",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Goldman Sachs BDC (GSBD) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Vivek Bantwal, Global Head of Financing Group, emphasized GSBD's ongoing integration into the broader direct lending platform, reporting \"the proportion of our portfolio benefiting from the 2022 reorganization has grown to 57%, while 43% still reflects deals made prior to the integration, which we call the legacy portfolio.\"</li>\n<li>Bantwal stated, \"Our exposure to first lien investments increased to 97% of the portfolio from 89% during that same period,\" highlighting the platform's preference for senior secured debt.</li>\n<li>He noted an 84% increase in median EBITDA of the portfolio since year-end 2021, reaching $71.8 million at year-end 2025, and a significant reduction in PIK as a percentage of total investment income to 9% in Q4 2025 from 15.3% in Q4 2024.</li>\n<li>Bantwal addressed software sector risks, explaining that AI's impact is \"highly company-specific and nuanced,\" and described the firm's proactive AI risk framework incorporated since early 2025.</li>\n<li>David Miller, Co-CEO, reported net investment income per share of $0.37 and net asset value per share of $12.64, with a supplemental dividend of $0.03 per share and a base dividend for Q1 2026 of $0.32 per share. He stated, \"GSBD committed approximately $1.2 billion in new commitments throughout the year in 35 new deals.\"</li>\n<li>Tucker Greene, President &amp; COO, detailed the portfolio's weighted average yield of 9.9%, net debt-to-EBITDA of 5.9x, and interest coverage of 2x, and highlighted the proactive sale of a software loan at $0.99 due to anticipated AI risk.</li>\n<li>Stanley Matuszewski, CFO, stated, \"We ended the fourth quarter of 2025 with total portfolio investments at fair value of $3.3 billion, outstanding debt of $1.9 billion and net assets of $1.4 billion.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management expects continued momentum in M&amp;A to drive credit demand, with Bantwal stating, \"A more favorable M&amp;A environment should stimulate greater demand for credit financing.\"</li>\n<li>The company anticipates spreads to \"moderately widen during the market dynamics we've seen over the past month.\"</li>\n<li>Miller expressed comfort with the current dividend level: \"We feel very comfortable with the dividend as it sits today.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Reported net investment income per share was $0.37 for Q4 2025, and net asset value per share was $12.64 at quarter end, down approximately 1% from Q3, largely due to net realized and unrealized losses.</li>\n<li>Total investment income for Q4 was $86.1 million, with GAAP and adjusted after-tax net investment income reported at $42.2 million and $41.8 million, respectively.</li>\n<li>The net debt-to-equity ratio increased to 1.27x from 1.17x in the prior quarter.</li>\n<li>Nonaccrual investments increased slightly to 2.8% and 1.9% of the portfolio at amortized cost and fair value, respectively, from 2.5% and 1.5% in Q3.</li>\n<li>Share repurchases totaled $15 million for the quarter, with $52.2 million repurchased since June 2025.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Finian O'Shea, Wells Fargo, asked about the distinct underwriting approach on the Clearwater deal. Bantwal responded that providing a \"100% solution\" for take-private transactions offers sponsors confidentiality and streamlined execution, and that in such cases, \"we get paid incremental economics for that.\"</li>\n<li>O'Shea inquired about semi-liquid structures and their risk, to which Bantwal explained, \"We don't have different standards for different vehicles or different types of investors. We have a single process that goes to a single investment committee.\"</li>\n<li>O'Shea questioned the dividend's sustainability; Miller replied, \"We feel very comfortable with the dividend as it sits today,\" noting optimism for spread widening.</li>\n<li>Heli Sheth, Raymond James, asked about spillover income strategy and deployment, with Matuszewski stating there are \"no current plans\" for a special distribution, but it remains an option.</li>\n<li>Sheth also asked about deal pipeline composition; Bantwal said, \"I wouldn't say the composition of the deal flow is changing.\"</li>\n<li>Ethan Kaye, Lucid Capital Markets, addressed AI risk framework application and legacy exposures. Miller admitted some legacy assets \"would be more point solutions,\" and noted proactive exits, stating, \"We sold it at $0.99 to other lenders that didn't have the same viewpoint.\"</li>\n<li>Kaye asked about share repurchases; Matuszewski indicated a measured approach, with $23 million of room remaining and decisions contingent on market opportunities and leverage.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts' tone was generally neutral, focused on clarity around underwriting, dividend sustainability, and risk management, with questions reflecting a search for transparency rather than skepticism.</li>\n<li>Management maintained a confident and measured tone in both prepared remarks and Q&amp;A, frequently emphasizing discipline, proactive risk management, and comfort with dividend and portfolio quality.</li>\n<li>Compared to the previous quarter, both analysts and management remained steady in sentiment, with slightly more emphasis on AI risk management and dividend sustainability this quarter.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance language shifted to emphasize AI risk and proactive portfolio management, with an increased focus on software sector diligence and legacy asset rotation.</li>\n<li>Net investment income per share decreased from $0.40 to $0.37, and net asset value per share declined from $12.75 to $12.64.</li>\n<li>The net debt-to-equity ratio rose from 1.17x to 1.27x.</li>\n<li>Share repurchases continued but at a reduced pace compared to the prior quarter.</li>\n<li>Management's confidence in underwriting and AI risk was more pronounced, while analysts continued to focus on dividend stability and risk exposures.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited the potential impact of AI on software business models as a key risk, noting continued vigilance and use of a formal AI disruption risk framework.</li>\n<li>Nonaccrual investments increased slightly, though management highlighted proactive exits and ongoing monitoring.</li>\n<li>Analysts raised concerns about dividend coverage, legacy asset risk, and the pace of originations versus repayments.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Goldman Sachs BDC management highlighted progress in portfolio rotation, a strong focus on first lien senior secured investments, and proactive risk mitigation, particularly around AI exposure in the software sector. The company reported disciplined origination, sustained share repurchases, and confidence in dividend coverage despite a modest decline in net investment income and an uptick in nonaccrual loans. Management remains focused on leveraging the Goldman Sachs platform to source quality opportunities and manage evolving market dynamics, with a clear process in place for handling legacy asset risks and AI-related disruptions.</p>\n<p><a href=\"https://seekingalpha.com/symbol/gsbd/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558790-goldman-sachs-bdc-outlines-97-percent-first-lien-focus-and-1_2b-new-commitments-amid-ai-risk",
            "pub_date": "2026-02-28 00:31:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558789",
            "title": "SA analyst upgrades/downgrades: NVDA, NKE, SMCI, NVO",
            "description": "<html><body><p data-eci=\"true\">Nvidia (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a></span>) receives an upgrade from Summit Research, which points to strong fiscal Q4 results and the company’s focus on tokenomics optimization as key drivers. Novo Nordisk (<a href=\"https://seekingalpha.com/symbol/NVO\" title=\"Novo Nordisk A/S\">NVO</a>) also sees an upgrade to Hold from KM Capital, though the analyst warns that stagnant earnings growth could make it a value trap. On the downgrade side, Super Micro Computer (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SMCI\" title=\"Super Micro Computer, Inc.\">SMCI</a></span>) faces a rating cut from Yiannis Zourmpanos due to margin compression and customer concentration risks, while Nike (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NKE\" title=\"NIKE, Inc.\">NKE</a></span>) gets downgraded to Hold by Daniel Jones amid declining profitability and elevated valuation multiples.</p>\n<h2>Upgrades</h2>\n<ul><li>\n<strong>Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>): Upgrade to Buy by <a href=\"https://seekingalpha.com/article/4875589-nvidia-the-3-horsemen-of-tokenomics-optimization-rating-upgrade\" target=\"_blank\" title=\"Summit Research\">Summit Research</a>.</strong><span> </span>The analyst cites Nvidia’s strong fiscal Q4 performance and resilient data center demand, with management’s emphasis on optimizing tokens-per-watt addressing key hyperscaler concerns about power constraints.</li></ul>\n<blockquote><p><em>“Robust demand signals have also increased management’s confidence that Nvidia is well-positioned to exceed the $500 billion revenue opportunity previously predicted for the current Blackwell roadmap and next-generation Rubin products.”</em></p></blockquote>\n<ul><li>\n<strong>Novo Nordisk A/S (<a href=\"https://seekingalpha.com/symbol/NVO\" title=\"Novo Nordisk A/S\">NVO</a>): Upgrade Sell to Hold by <a href=\"https://seekingalpha.com/article/4875740-novo-nordisk-trap-not-trade-upgrade\" target=\"_blank\" title=\"KM Capital\">KM Capital</a>.</strong><span> </span>The analyst upgrades the stock as its market cap returns to pre-GLP-1 mania levels, limiting further downside, though intensifying competition from Eli Lilly remains a headwind.</li></ul>\n<blockquote><p><em>“While I am highly skeptical about NVO's potential to demonstrate share price rebound, I have to acknowledge fundamental positives as well. The company's history is rich, and it has a proven record of delivering superior returns to shareholders.”</em></p></blockquote>\n<h2>Downgrades</h2>\n<ul><li>\n<strong>Super Micro Computer (<a href=\"https://seekingalpha.com/symbol/SMCI\" title=\"Super Micro Computer, Inc.\">SMCI</a>): Downgrade to Hold by <a href=\"https://seekingalpha.com/article/4875447-super-micros-billion-dollar-stress-test\" target=\"_blank\" title=\"Yiannis Zourmpanos\">Yiannis Zourmpanos</a>.</strong><span> </span>The analyst points to significant customer concentration risk with one data center customer representing 63% of revenue, alongside margin compression and rising inventory levels.</li></ul>\n<blockquote><p><em>“What I see as the biggest risk is customer concentration. A change in deployment schedules by the 63% customer could introduce volatility in revenue and working capital...Margin pressure could be more persistent than management expects. If component shortages continue or hyperscalers continue to pressure pricing, gross margin recovery could be slower than expected.”</em></p></blockquote>\n<ul><li>\n<strong>NIKE (<a href=\"https://seekingalpha.com/symbol/NKE\" title=\"NIKE, Inc.\">NKE</a>): Downgrade to Hold by <a href=\"https://seekingalpha.com/article/4875445-nikes-profit-issues-push-it-back-a-step-downgrade\" target=\"_blank\" title=\"Daniel Jones\">Daniel Jones</a>.</strong><span> </span>The analyst cites declining profitability despite modest revenue growth, with international operations—particularly in China—serving as a major drag on performance.</li></ul>\n<blockquote><p><em>“Revenue for the company continues to expand nicely. But on the bottom line, it is continuing to struggle. Profit margins have come under significant pressure, especially when it comes to certain international operations. And as a result, trading multiples have expanded even as the share price has contracted.”</em></p></blockquote>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558789-sa-analyst-upgrades-downgrades-nvda-nke-smci-nvo",
            "pub_date": "2026-02-28 00:31:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558769",
            "title": "Archer Aviation Q4 earnings on deck: What to expect",
            "description": "<html><body><p data-eci=\"true\" data-pm-slice=\"0 0 []\">Archer Aviation (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ACHR\" title=\"Archer Aviation Inc.\">ACHR</a></span></span>) <span>will report its results for the fourth quarter on Monday, after market close.</span></p>\n<p data-pm-slice=\"0 0 []\"><span><span>Wall Street </span><a href=\"https://seekingalpha.com/symbol/ACHR/earnings/estimates?period=quarterly\" target=\"_blank\" title=\"expects \">expects </a><span>the company to post a loss per share of $0.17, with no revenue anticipated.</span></span></p>\n<p data-pm-slice=\"0 0 []\">Archer reported progress in test flights, including an altitude milestone, and participated in a government program to demonstrate air taxi safety. The company won a competitive bid to acquire a patent portfolio from Lilium. It was selected by Korean Air to deploy its Midnight aircraft in Korea, and was named an air taxi partner for the Los Angeles Sports Commission, while its shares reacted to developments involving Tesla.</p>\n<p data-pm-slice=\"0 0 []\">It later announced a powertrain agreement, secured an air mobility deal in Saudi Arabia, and drew investment activity from Cathie Wood’s ARK Invest, alongside a dispute with Joby Aviation.</p>\n<p data-pm-slice=\"0 0 []\">The company subsequently announced a collaboration with Karem Aircraft, outlined plans for a metropolitan air taxi network in Miami, worked with Saudi Arabia’s General Authority of Civil Aviation to accelerate deployment, and faced broader sector pressure tied to potential tighter aviation safety rules and cautious industry views from Goldman Sachs favoring BETA Technologies.</p>\n<p data-pm-slice=\"0 0 []\"><span>According to </span><span>Alpha’s </span><a href=\"https://seekingalpha.com/symbol/ACHR/ratings/quant-ratings\" target=\"_blank\" title=\"Quant \">Quant </a><span></span><span>Rating system, ACHR is rated Hold with an overall score of 2.75 out of 5, reflecting grades of A- in terms of growth but a D- in terms of profitability.</span></p>\n<p data-pm-slice=\"0 0 []\">An <a href=\"https://seekingalpha.com/article/4873820-archer-aviation-stock-hawthorne-airport-deal-la28-olympics-catalyst\" target=\"_blank\" title=\"analyst said\">analyst said</a> the company has signed “definitive agreements to acquire control of Hawthorne Airport,” noting the site is intended to serve as “the operational hub for its planned LA air taxi network,” while adding that urban air mobility could mark “the most significant change in commercial aviation since the jet engine.”</p>\n<p data-pm-slice=\"0 0 []\">The note also cited Archer’s selection as the Official Air Taxi Provider for the LA28 Olympic Games as providing “the perfect opportunity to gain worldwide recognition” and highlighted a valuation comparison with Joby Aviation, stating the firms could form a “duopoly in the US,” while adding that key risks include certification delays and reliance on outsourced manufacturing.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558769-archer-aviation-q4-earnings-on-deck-what-to-expect",
            "pub_date": "2026-02-28 00:26:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558626",
            "title": "Tenth time's the charm: Paramount's pursuit of Warner Bros. and what lies ahead",
            "description": "<html><body><p data-eci=\"true\" data-pm-slice=\"1 1 []\">Paramount Skydance (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a></span>) kept trying until it succeeded, and it did. On late Thursday, Netflix (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a></span>) declined to raise its offer for Warner Bros. Discovery (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/WBD\" title=\"Warner Bros. Discovery, Inc.\">WBD</a></span>) after being engaged in a months-long bidding war against David Ellison's media company and let it have the coveted assets of the HBO parent. </p>\n<p>The streaming giant threw in the towel, saying the transaction was no longer financially attractive, and added that it was not fixated on having WBD's assets but didn't want to pass up the opportunity of owning such a reputed and prestigious media portfolio. </p>\n<h3>A quick recap</h3>\n<p>It was Ellison who started it all because Warner Bros. had other plans, to separate its streaming and studios segment from its declining linear TV business, just like Comcast (<a href=\"https://seekingalpha.com/symbol/CMCSA\" title=\"Comcast Corporation\">CMCSA</a>). </p>\n<p>But months after Skydance bought Paramount, which took over a year, Ellison set his eyes on Warner Bros. </p>\n<p>He kicked off with at least three private offers for the company last year in September, and that prompted Warner CEO David Zaslav to put the company up for sale in October.</p>\n<p>The move by Warner Bros. invited more players into the bidding process. Comcast, Netflix, and reportedly Starz (<a href=\"https://seekingalpha.com/symbol/STRZ\" title=\"Starz Entertainment Corp.\">STRZ</a>) participated in the early rounds. By December, Warner announced that Netflix will buy its streaming and studio businesses for $82.7B.</p>\n<p>Paramount then launched a hostile takeover process with a tender offer of $30 per WBD share. Warner kept recommending the Netflix transaction and asked shareholders to reject Paramount's tender offer.</p>\n<p>Ellison didn't back down. He kept adding sweeteners to the deal until Zaslav finally took notice and returned for negotiations. </p>\n<p>Netflix was clear from the start and wanted to maintain financial discipline. It was not going to overpay for the debt-laden CNN owner. Paramount finally emerged victorious after its tenth bid was deemed superior by Warner.</p>\n<h3>What is the price?</h3>\n<p>Paramount will pay $31 per share in cash to buy the whole of Warner Bros. and assume its debt in a deal valued at $111B. Without debt, Paramount is paying roughly $77B to $78B.</p>\n<p>Paramount's offer, among other things, includes</p>\n<ul>\n<li><p>An equity commitment of $45.7B from the Ellison Trust and personal guarantees from Oracle co-founder Larry Ellison.</p></li>\n<li><p>About $57.5B in debt commitments from Bank of America Merrill Lynch, Citi, and Apollo.</p></li>\n<li><p>A “ticking fee” of roughly $650M per quarter if the deal does not secure regulatory clearances by September 30, 2026.</p></li>\n<li><p>The $2.8B termination fee WBD owes Netflix for terminating the previous agreement.</p></li>\n<li><p>The elimination of about $1.5B in potential financing costs related to WBD's existing debt exchange.</p></li>\n</ul>\n<h3>What does Paramount get?</h3>\n<p>In streaming and studios, the company will become the new owner of Warner Bros. Entertainment, which includes Warner Bros. Pictures, New Line Cinema, Warner Bros. Television Group, access to all of HBO's portfolio and the Max streaming service, DC Entertainment, and Warner Bros. Games, among other things.</p>\n<p>In linear networks, the company will notably get CNN Worldwide, TNT Sports, Discovery Channel, Food Network, TLC, Animal Planet, TBS, Adult Swim, and Cartoon Network, among other things.</p>\n<h3>What happens next?</h3>\n<p>Warner Bros. has been the subject of numerous M&amp;A transactions and has had its fair share of ups and downs over the years. Wall Street will now closely watch how its new owners will unlock maximum shareholder value. </p>\n<p>Accurate execution at the combined entity will be of paramount importance. How it deleverages the balance sheet, which is expected to carry up to $100B in debt, will be closely monitored. Stagnating revenue, unsuccessful projects, or poor box office performance could hurt the stock.</p>\n<p>Warner and Paramount combined have a pro forma revenue of about $67B annually, still lagging behind Comcast and Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>) but ahead of Netflix. Warner was already the third-largest media company by revenue and will continue to retain that spot after the merger. </p>\n<p>Paramount said it forecasts up to $6B in cost synergies by getting rid of \"duplicative operations\" across the two companies, which means the possibility of job cuts cannot be ruled out.</p>\n<p>Soon after Ellison bought Paramount, he initiated a one-time mass layoff of 2,600 employees. Paramount at that time had a global workforce of over 18,000. Warner currently has about 35,000 employees worldwide.</p>\n<p>While there were concerns about a streaming industry monopoly had Warner gone with Netflix, the deal with Paramount will lead to consolidation of two of the \"Big Five\" Hollywood studios, and investors will closely watch what regulators make of that.</p>\n<p>On the movie side of things, Ellison had already committed to making films for the big screen when he bought Paramount, and he is expected to follow through on his promise with the Warner deal. Details on new annual film targets are expected in the days ahead. </p>\n<p>He is also likely to hold a press conference with journalists like he did for the Paramount transaction back in 2025 once the deal closes.</p>\n<p>Warner Bros. has its own history of having gone through <a href=\"https://seekingalpha.com/news/4456480-timeline-the-corporate-legacy-of-warner-bros-through-the-years\" target=\"_blank\" title=\"numerous corporate identity makeovers\">numerous corporate identity makeovers</a>, and the new name for the combined entity is expected in the coming days.</p>\n<p>Could it be \"Paramount Warner, a Skydance Corporation,\" or \"Warner Bros. Paramount\"? </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558626-tenth-times-the-charm-paramounts-pursuit-of-warner-bros-and-what-lies-ahead",
            "pub_date": "2026-02-28 00:26:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558786",
            "title": "Arcosa outlines $2.95B–$3.1B 2026 revenue target as company pivots to growth-focused portfolio",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Arcosa, Inc. (ACA) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Antonio Carrillo, President and CEO, highlighted \"2025 was an outstanding year for Arcosa, demonstrated by our exceptional financial performance and significant advancement of our strategic transformation.\" He emphasized record revenues of $2.9 billion, record adjusted EBITDA of $583 million, and a 20.2% adjusted EBITDA margin. Carrillo pointed out momentum in Construction Materials and Engineered Structures, with cyclical expansion in both barge and wind towers. He announced the sale of the barge business for $450 million in cash, stating, \"we believe this is the right time to transition the barge business to an owner aligned with its long-term growth plans.\" Carrillo underscored the divestiture's impact, noting, \"The barge transaction further reduces portfolio complexity and cyclicality, raises our overall margin profile and enhances the long-term resiliency of the company.\"</li>\n<li>Gail Peck, Chief Financial Officer, reported, \"During the quarter, we generated $120 million of operating cash flow...CapEx for the fourth quarter was $64 million, resulting in full year CapEx of $166 million, which was above the high end of our guidance range.\" Peck confirmed that free cash flow for the quarter was roughly $60 million and was $202 million for the full year. She commented, \"We ended the year with net debt to adjusted EBITDA of 2.3x comfortably within our target leverage range. This is down from 2.9x at the start of the year.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Carrillo set 2026 revenue guidance at $2.95 billion to $3.1 billion and adjusted EBITDA between $590 million and $640 million, both excluding the barge divestiture impact. He stated, \"Our 2026 guidance incorporates another record year for our growth businesses, Construction Materials and Engineered Structures.\"</li>\n<li>Barge business guidance for 2026 is full year revenues of $410 million to $430 million and adjusted EBITDA of $70 million to $75 million. The company will update full year guidance once the barge sale closes.</li>\n<li>Carrillo indicated, \"With combined double-digit adjusted EBITDA growth and margin uplift\" expected for growth businesses, and a \"short-term step-down in wind towers before recovering in 2027.\"</li>\n<li>Peck projected CapEx for 2026 of $220 million to $250 million, including $70 million to $80 million for growth and $150 million to $170 million for maintenance. Net interest expense is expected between $88 million and $90 million. Effective tax rate for 2026 is estimated at 17.5% to 19.5%.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Peck stated, \"Fourth quarter adjusted EBITDA increased 13% and margin expanded 90 basis points, with all segments contributing.\"</li>\n<li>Construction Products segment revenues decreased 2% in Q4, but excluding freight, revenues increased 4% and adjusted segment EBITDA grew 3% with 140 basis points of margin expansion.</li>\n<li>Aggregates business reported freight-adjusted revenues up roughly 8%, driven by 5% pricing growth and 2% volume improvement. Adjusted cash gross profit increased 6% and per ton increased 3%.</li>\n<li>Engineered Structures saw segment revenues rise 15%, led by a 20% increase for utility and related structures. Wind tower revenue increased 3%.</li>\n<li>Transportation Products revenues rose 19% and adjusted segment EBITDA increased 24%, mainly from higher tank barge volumes and favorable mix.</li>\n<li>Free cash flow for the quarter was roughly $60 million, and for the year $202 million. Liquidity stood at $915 million.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Ian Zaffino, Oppenheimer: Asked about redeployment of barge sale proceeds and future moves to reduce cyclicality. Carrillo responded, \"we have a very active pipeline of opportunities...mainly bolt-on acquisitions,\" and emphasized, \"now that we're a simpler company, we will focus our full attention into deploying the capital to generate additional value for our shareholders.\"</li>\n<li>Ethan Roberts, Stephens: Inquired about utility structures as a growth driver and offset to wind. Peck replied, \"we do see a path to that strong utility compensating for the step down in wind,\" and expects \"flat to maybe slight growth within the segment for next year.\"</li>\n<li>Garik Shmois, Loop Capital: Questioned Q1 impact from Northeast weather and gross profit per ton expectations. Peck answered, \"with the weather and the snow here recently, we'll see that percentage share drop just a little bit\" and anticipates \"solid unit profitability gains on -- for 2026.\"</li>\n<li>Julio Romero, Sidoti: Explored accelerating utility structures demand and customer reservations. Carrillo explained, \"we see the need to accelerate our capacity expansion because our customers need it...we had a market study by a third-party, analyze utility investment over the next 5 to 10 years.\"</li>\n<li>Brent Thielman, D.A. Davidson: Asked about Engineered Structures margin sustainability and M&amp;A pipeline. Peck responded, \"wind is going to have an impact for sure...a path to flat margins for the segment looks achievable.\" Carrillo reiterated disciplined capital allocation for M&amp;A.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts probed the sustainability of growth, impact of weather, and capital allocation, with a generally positive but inquisitive tone, seeking clarity on future growth drivers and margin implications.</li>\n<li>Management maintained a confident and optimistic stance throughout, with Carrillo stating, \"we are a simpler company, we will focus our full attention into deploying the capital to generate additional value for our shareholders.\" Peck’s tone was measured and precise regarding financial discipline and outlook.</li>\n<li>Compared to the previous quarter, both analysts and management were more focused on post-divestiture strategy and capital deployment, with management’s confidence levels remaining high.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 was introduced, with a revenue range of $2.95 billion to $3.1 billion and higher projected CapEx versus the previous quarter’s $145 million to $155 million range.</li>\n<li>The company announced a key strategic shift with the barge business sale, whereas the previous quarter emphasized strong performance across segments and steady deleveraging.</li>\n<li>Analyst questions shifted from clarifying past performance to future capital deployment and growth direction post-divestiture.</li>\n<li>Management’s tone remained confident, with greater focus on executing a streamlined, growth-focused strategy.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management referenced weather-related headwinds in the Northeast affecting Q1 results for Stavola and acknowledged ongoing policy uncertainty in the wind tower business.</li>\n<li>Carrillo cited, \"policy uncertainty makes it -- we need to get through the noise\" regarding wind towers, while also emphasizing risk mitigation through business rightsizing and facility transitions.</li>\n<li>Peck noted seasonality and weather as factors impacting quarterly financial cadence, particularly in Q1 2026.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Arcosa management underscored a pivotal year, marked by record performance, a strategic divestiture to simplify the business and strengthen its margin profile, and a sharpened focus on growth in Construction Materials and Engineered Structures. With clear 2026 financial targets, a robust M&amp;A pipeline, and continued investment in capacity expansion, management signaled confidence in leveraging infrastructure and power market tailwinds to create additional value for shareholders while navigating near-term headwinds in wind towers and weather-impacted regions.</p>\n<p><a href=\"https://seekingalpha.com/symbol/aca/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558786-arcosa-outlines-2_95b-3_1b-2026-revenue-target-as-company-pivots-to-growth-focused-portfolio",
            "pub_date": "2026-02-28 00:11:18",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558776",
            "title": "Venezuela halted planned sale of Halliburton assets at U.S. request - Bloomberg",
            "description": "<html><body><p data-eci=\"true\"><span>Venezuela <a href=\"https://www.bloomberg.com/news/articles/2026-02-27/venezuela-nixed-sale-of-halliburton-s-assets-at-us-request\" rel=\"nofollow\" target=\"_self\" title=\"canceled\">canceled</a> an auction of assets seized from </span><span>Halliburton (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/HAL\" title=\"Halliburton Company\">HAL</a></span>)</span><span> after the Trump administration intervened to stop the sale, a move that is expected to clear the path for the U.S. company's return to Venezuela, Bloomberg reported Friday.</span></p>\n<p><span><span>Halliburton (<a href=\"https://seekingalpha.com/symbol/HAL\" title=\"Halliburton Company\">HAL</a>) </span>shut down<span> its primary operations in Venezuela in 2020 after the U.S. tightened sanctions on the Maduro regime; in December, a Venezuelan court ordered the sale of the company's equipment, which was followed days later by a company lawsuit against the country filed at<span> the World Bank's international arbitration court.</span></span></span></p>\n<p><span><span><span><span>U.S. Energy Secretary Chris Wright traveled to Venezuela earlier this month and met acting President </span>Delcy Rodriguez; in the same week, a Halliburton (<a href=\"https://seekingalpha.com/symbol/HAL\" title=\"Halliburton Company\">HAL</a>) team visited facilities in the country where it holds assets still under their control, according to the report.</span></span></span></p>\n<p><span><span><span><span>Halliburton (<a href=\"https://seekingalpha.com/symbol/HAL\" title=\"Halliburton Company\">HAL</a>) CEO </span>Jeff Miller<span> <a href=\"https://seekingalpha.com/news/4541172-halliburton-says-prepared-to-quickly-restart-venezuela-operations\" target=\"_self\" title=\"said last month\">said last month</a> that the company was ready to quickly restart work in Venezuela once it obtained U.S. government approval and some sort of payment protections.</span></span></span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558776-venezuela-halted-planned-sale-of-halliburton-assets-at-u-s-request-bloomberg",
            "pub_date": "2026-02-28 00:06:07",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558777",
            "title": "OpenAI's massive funding round should benefit Microsoft, Oracle: BNP",
            "description": "<html><body><p data-eci=\"true\">OpenAI's (<a href=\"https://seekingalpha.com/symbol/OPENAI\" title=\"OpenAI\">OPENAI</a>) <a href=\"https://seekingalpha.com/news/4558700-openai-confirms-110b-funding-round-with-50b-from-amazon-and-30b-from-nvidia-softbank\" target=\"_blank\" title=\"announcement\">announcement</a> that it has raised $110B in new funding should alleviate the concerns about paying its bills and ultimately benefit Microsoft (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a></span>) and Oracle (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ORCL\" title=\"Oracle Corporation\">ORCL</a></span>), BNP Paribas said.</p>\n<p>“Broadly, the formal announcement of OpenAI’s $110B fundraise at a reported $730B pre-money valuation ($840B post-money) should be incrementally positive for Microsoft and Oracle, even if it’s been well telegraphed from media reports in recent months,” BNP analyst Stefan Slowinski wrote in a note to clients. “With fresh capital now secured, OpenAI appears well positioned to fund both its $250B compute contract with Microsoft and $300B compute contract with Oracle.”</p>\n<p>Slowinski added that OpenAI's updated cash burn forecasts imply roughly $180B in funding needs through 2030, which includes the $110B raised from Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>), Amazon (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>), and SoftBank (<a href=\"https://seekingalpha.com/symbol/SFTBY\" title=\"SoftBank Group Corp.\">SFTBY</a>). “As a result, with additional non-strategic investors layering in alongside the initial $110B raise, OpenAI could ultimately be most of the way towards addressing its cumulative cash needs,” Slowinski explained.</p>\n<p>He has a Buy rating on Microsoft and Oracle and respective price targets of $659 and $290.</p>\n<p>Beyond the ability to pay its bills, OpenAI's funding round has other implications for Microsoft and Oracle, Slowinski said. </p>\n<p>For Microsoft, the analyst believes the Satya Nadella-led company will report a “significant gain” in the fiscal third-quarter as its stake in OpenAI is likely to be valued higher. Assuming Microsoft is diluted with this funding round, he believes Microsoft owns roughly $200B worth of OpenAI, or about 7% of Microsoft's market cap. “Removing this from Microsoft’s valuation makes the current multiple that much more attractive,” he explained.</p>\n<p>For Oracle, Slowinski said the debate now moves on to whether Oracle can actually execute its contracts. “While we would have initially assumed that closing the raise would be viewed positively for Oracle, we worry the debate will simply shift to the ROI of AI and whether Oracle’s capital investments will ultimately deliver an attractive return, especially as OpenAI appears to be increasingly diversifying its cloud compute stack,” the analyst explained.</p>\n<p>Other questions may include whether OpenAI needs Oracle Cloud Infrastructure after Oracle delivers on its initial contract, given the increased commitment between OpenAI and Amazon Web Services, Slowinski said.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558777-openais-massive-funding-round-should-benefit-microsoft-oracle-bnp",
            "pub_date": "2026-02-28 00:00:54",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558743",
            "title": "Target's outlook remains “cloudy” and turnaround is stifled by competition, stagnant housing market -- BofA Securities",
            "description": "<html><body><p data-eci=\"true\"><span>Target</span> (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a></span></span>) is set to report quarterly results next Tuesday, March 3, with scrutiny centered on holiday-quarter execution, margin performance, and whether the new CEO can turn the company around.</p>\n<p>BofA Securities’ Christopher Nardone thinks Wall Street’s expectations for positive comparable sales growth beyond the fiscal first quarter may prove “aggressive” despite higher tax refunds, and an EPS recovery will take time.</p>\n<p>“We expect initial 2026 guidance will include a wide range of EPS outcomes; the lower end will likely contemplate continued weakness in comp trends, while the upper end will likely include comp progression driven by management’s actions to turn the business,” Nardone says.</p>\n<p>Meanwhile, Nardone believes Target’s (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) sales outlook remains “cloudy” due to limited green shoots in most discretionary categories, lagging sales in apparel and home (which makes up 50% of Target’s sales), “fierce” competition, and the impact the stagnant housing market is having on Target's (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) home segment, which will take time to recover. <span>  </span></p>\n<p>All of which leads Nardone to reinstate coverage of Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) with an Underperform rating and a $103 price target that assumes ~9% downside from current levels.</p>\n<p><span> </span>“We believe Target’s lack of scale versus larger competitors in digital advertising and third party online marketplaces may inhibit its ability to offset margin pressure and fund key strategic investments (including automation and AI),” Nardone says in his note to clients.</p>\n<p>In the fourth quarter, Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) is expected to have earned a profit of $2.15 per share on $30.5B in revenue, down 11% and 1.4% from the same quarter last year.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558743-targets-outlook-remains-cloudy-and-turnaround-is-stifled-by-competition-stagnant-housing-market",
            "pub_date": "2026-02-27 23:56:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}