{
    "data": [
        {
            "id": "4558602",
            "title": "Monster Beverage outlines global share gains and innovation pipeline as net sales reach $2.13B",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Monster Beverage Corporation (MNST) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Hilton Schlosberg announced new roles for Rob Gehring, Guy Carling, and Emelie Tirre, attributing ongoing success to their contributions. Schlosberg stated, \"We are pleased to report another quarter of strong financial results and cash generation with net sales crossing the $2 billion threshold for the first time in the company's history for a fiscal fourth quarter.\" He highlighted global market share gains and the impact of product innovation across diverse offerings and price points.</li>\n<li>Schlosberg emphasized the company's robust innovation pipeline and ongoing support from global marketing initiatives and the Coca-Cola partnership. He noted, \"Our business continues to be supported by robust marketing programs, impactful retail engagement and our strong global partnership with the Coca-Cola Company and its global bottling partners.\"</li>\n<li>Marketing updates include the Monster Energy sponsorship of the McLaren Formula One team, expansion of the Lando Norris Zero Sugar Energy Drink to 38 EMEA and OSP markets, and a full U.S. rollout scheduled for Q1 2026. Sponsorships with Call of Duty, Ducati MotoGP, UFC, and others were also cited as drivers of brand momentum.</li>\n<li>Schlosberg addressed the modest impact of tariffs and aluminum price increases, stating that the effect on Q4 results was limited but expects a \"further modest increase in our costs in at least the first half of 2026.\"</li>\n<li>CFO Tom Kelly reported, \"Net sales were $2.13 billion for the 2025 fourth quarter, was 17.6% higher than net sales of $1.81 billion in the 2024 fourth quarter.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management reiterated confidence in the global energy drink market, emphasizing that innovation and pricing actions will support growth. Schlosberg shared, \"We continue to review opportunities for price increases, both domestically and internationally.\"</li>\n<li>The innovation launch calendar is described as \"strategically staggered across our brand portfolio\" through summer 2026, aiming to drive incremental consumption and strengthen consumer engagement.</li>\n<li>Schlosberg stated, \"We're excited about our innovation pipeline for 2026 and beyond.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Net sales reached $2.13 billion in Q4 2025, reflecting a 17.6% year-over-year increase. Monster Energy Drinks segment net sales increased 18.9% to $1.99 billion, while the Strategic Brands segment rose to $110 million. The Alcohol Brands segment declined to $29 million.</li>\n<li>Gross profit as a percentage of net sales was 55.5%. Adjusted gross profit (excluding alcohol) was 56.1%.</li>\n<li>Operating income rose 42.3% to $542.6 million. Adjusted operating income increased 16% to $617.6 million.</li>\n<li>Net income per diluted share increased 64.9% to $0.46, and adjusted net income per diluted share was $0.51.</li>\n<li>International net sales rose 26.9% to $903.3 million, now representing 42% of total net sales. Gross profit increased in all international regions.</li>\n<li>EMEA net sales jumped 32.6%, APAC 11.5%, and Latin America 90.8% in dollars. Notable growth in China (78.9%) and India (54.2%) was reported. The company cited system disruption in Japan impacting sales.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Dara Mohsenian, Morgan Stanley: Asked about international market share gains and affordable energy strategy. Schlosberg explained the affordable category is growing, now estimated at 100 million unit cases in 2025, with key markets including Nigeria, Egypt, Kenya, Mexico, India, and China. Guy Carling added, \"25% of category consumers are new to the category in the last 12 months coming from a wide range of categories. Monster has been able to outperform the category.\"</li>\n<li>Filippo Falorni, Citi: Inquired about U.S. energy drink category growth and distribution expectations for 2026. Schlosberg stated, \"The energy drink business presents a value proposition to consumers... pricing and innovation, I think, will remain very much a part of where we are going.\"</li>\n<li>Matthew Smith, Stifel: Asked about margin performance and G&amp;A details. Schlosberg attributed gross margin increases to \"pricing actions, supply chain optimization, and product sales mix,\" with modest tariff impact offset by higher selling prices. He noted part of G&amp;A increase was due to digital transformation costs.</li>\n<li>Bonnie Herzog, Goldman Sachs: Queried further pricing actions and innovation phasing. Schlosberg confirmed continued review of price increases and said innovation launches will be staggered throughout the year.</li>\n<li>Carlos Laboy, HSBC: Requested India market update. Schlosberg reported strong excitement from the new bottler and progress for Monster and Predator brands.</li>\n<li>Andrea Teixeira, JPMorgan: Asked about margin outlook with international expansion and affordable offerings. Schlosberg acknowledged some margin pressure from aluminum costs in H1 2026 but highlighted gross margin improvements across all reported territories.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed for details on market share, margins, pricing, and international strategy, reflecting a slightly positive but probing tone.</li>\n<li>Management maintained a confident and optimistic tone in both prepared remarks and responses, expressing excitement about innovation and global growth, with phrases like \"we are well positioned\" and \"we're excited about the opportunities.\"</li>\n<li>Compared to the previous quarter, both analysts and management exhibited slightly increased confidence, with more focus on international opportunity and innovation cadence.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter introduced new executive appointments and highlighted expanding international market share, with affordable energy as a larger contributor, now quantified at 100 million unit cases.</li>\n<li>Net sales growth rate was consistent with the prior quarter, but international growth—especially in China and India—was more prominent.</li>\n<li>Management's tone shifted to greater confidence in global expansion and innovation, while analysts maintained a focus on margin sustainability and international performance.</li>\n<li>The innovation rollout strategy changed from concentrated launches to staggered releases across 2026.</li>\n<li>There was a more detailed discussion of margin drivers and tariff impacts in this quarter.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited the \"complicated and dynamic\" tariff landscape and potential for further modest cost increases in 2026 due to aluminum prices.</li>\n<li>System disruption in Japan affected APAC sales, though operations have normalized.</li>\n<li>Foreign currency fluctuations and bottler inventory changes in Mexico and Argentina impacted regional results.</li>\n<li>Digital transformation and SAP S/4HANA implementation entail ongoing investment and potential execution risks.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Monster Beverage Corporation closed 2025 with record fourth quarter net sales, robust international growth, and expanded market share, driven by innovation and strong execution across all regions. New executive roles and a staggered innovation pipeline set the stage for continued expansion in 2026, while management remains focused on navigating input cost pressures and leveraging its global partnership with Coca-Cola. The company maintains confidence in its ability to grow both core and affordable brands worldwide, supported by disciplined pricing and marketing strategies.</p>\n<p><a href=\"https://seekingalpha.com/symbol/mnst/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558602-monster-beverage-outlines-global-share-gains-and-innovation-pipeline-as-net-sales-reach-2_13b",
            "pub_date": "2026-02-27 19:00:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558603",
            "title": "SUI Group outlines 10% yield target and $10M stablecoin deployment while advancing Bluefin partnership",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: SUI Group Holdings Limited (SUIG) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Marius Barnett emphasized a maturing digital asset industry, highlighting “the regulatory engagement in the United States has shifted from an uncertainty towards structure” and described recent board strengthening with the appointment of Brian Quintenz as Independent Director, reinforcing the company's governance discipline.</li>\n<li>Barnett explained the company’s evolving strategy: “Our objective is not simply token accumulation. We aim to develop a public market gateway into one of the most technically differentiated layer 1 ecosystems in the market.” He spotlighted SUI’s partnership with Bluefin, noting its growth to over $4 billion in monthly trading volume and $82 billion in cumulative volume, as well as the launch of stablecoin infrastructure through suiUSDe and USDi in collaboration with Ethena and the SUI Foundation.</li>\n<li>The company seeded $10 million into the Ember-operated suiUSDe Vault to accelerate liquidity and ecosystem activation. Barnett stated, \"We are not simply accumulating an idle treasury. We are scaling it, staking it and strategically deploying it into high-impact ecosystem infrastructure, all within a regulated publicly traded framework built for transparency and institutional participation.\"</li>\n<li>Stephen Mackintosh, Chief Investment Officer, reported that the company generated approximately 1.13 million SUI in total staking rewards and lending activities since July 2025 and repurchased approximately 7.8 million shares at an average price of $2.02 per share in Q4, representing about 8.8% of shares outstanding at the time.</li>\n<li>Mackintosh highlighted, \"Our agreement to lend SUI into Bluefin and participate in revenue share aligns us directly with that growth vector.\"</li>\n<li>Douglas Polinsky, CEO, stated, “Our strategic center of gravity has shifted. Today, our primary focus is building a differentiated institutionally aligned digital asset treasury platform anchored to the SUI blockchain, leveraging the strength of our legacy business to support that long-term evolution.\"</li>\n<li>Joseph Geraci, CFO, reported, “Gross revenue and portfolio income for the fourth quarter 2025 increased 179% to $2.4 million, compared to approximately $869,000 in quarter 4 of 2024. The increase was primarily driven by the generation of staking revenue and digital lending interest income from our SUI digital asset treasury strategy.”</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management reiterated its focus on increasing SUI per share, scaling treasury growth, activating assets across staking, lending, derivatives, and stablecoin infrastructure, and maintaining opportunistic capital allocation, including share repurchases.</li>\n<li>Mackintosh outlined the company’s ongoing strategy: “Our focus remains on: a, scaling SUI per share through disciplined treasury growth; b, continuing to activate our treasury across staking, lending, derivatives and stablecoin infrastructure; c, maintaining opportunistic capital allocation, including share repurchases when appropriate; and b, operating with institutional-grade transparency.”</li>\n<li>Barnett indicated a long-term target of yielding close to 10% on SUI over the next 12 to 18 months through a blend of institutional and DeFi ecosystem lending.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>The company reported a $196.1 million noncash unrealized and realized loss related to mark-to-market adjustments on SUI and digital asset loan receivable holdings.</li>\n<li>Operating expenses, excluding net realized and unrealized gain on portfolio investments, were $203 million in Q4 2025.</li>\n<li>Excluding the unrealized and realized loss on digital assets and stock-based compensation, operating expenses for Q4 2025 were $4.8 million.</li>\n<li>Net loss for Q4 2025 was $221.8 million or $5.52 per diluted share.</li>\n<li>As of December 31, 2025, cash and cash equivalents were $21.9 million, SUI holdings were 105,086,451 SUI with a net value of $147.4 million, and digital asset loan receivable totaled 2,961,550 SUI valued at $3.6 million.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Neil Eloff, Citizens Bank: Asked about agentic AI’s impact on the blockchain ecosystem and SUI’s positioning. Mackintosh explained that SUI's architecture is suited for high-throughput agentic transactions and highlighted programmable transaction blocks enabling \"parallel execution of these bundles that can happen really kind of an infinite scale.\"</li>\n<li>Eloff: Inquired about prediction markets. Mackintosh responded that prediction markets could reach $1 trillion in annual volume by 2030 and noted SUI’s architectural advantages for new prediction market applications, especially in emerging markets.</li>\n<li>Brian Kinstlinger, Alliance Global Partners: Requested updates on cash position and buybacks. Barnett confirmed over 80 million shares repurchased and a cash balance of approximately $21 million, forecasting continued increases in cash absent new investments.</li>\n<li>Kinstlinger: Asked about the Google AP2 partnership and agentic AI launches. Barnett said, “We believe that payments for all of these bots and agents is meant to be built on blockchain… SUI is perfectly positioned for it,” and anticipates further integrations.</li>\n<li>Kinstlinger: Questioned Bluefin’s Q4 impact and revenue share. Barnett detailed a loan yielding approximately 17% to 18% per annum, paid weekly in SUI.</li>\n<li>Kinstlinger: Probed on business development demand amid crypto decline. Barnett described active pursuit of similar institutional lending deals, with a long-term yield target of 10% on SUI.</li>\n<li>Gareth Gacetta, Cantor Fitzgerald: Explored yield-generation strategy beyond staking. Barnett stated, “Every single transaction we do, we're looking at a balance of institutional lending and DeFi ecosystem lending,” highlighting risk-adjusted returns and parent guarantees.</li>\n<li>Gacetta: Asked about Meta’s stablecoin interest and SUI’s fit. Mackintosh discussed SUI’s object-centric architecture and the Move programming language, emphasizing scalability and suitability for agentic commerce.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed for details on yield generation, risk management, cash deployment, and partnerships, reflecting a slightly positive tone focused on strategic execution and risk mitigation.</li>\n<li>Management maintained a confident and constructive tone during both prepared remarks and Q&amp;A, frequently emphasizing SUI’s technical differentiation, risk discipline, and long-term focus. Phrases like “we are not simply accumulating an idle treasury” and “we are scaling it, staking it and strategically deploying it” signal high conviction.</li>\n<li>Compared to the previous quarter, both analysts and management exhibited increased specificity and optimism regarding yield targets, partnership expansion, and risk controls.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance language shifted from a general focus on ecosystem building and regulatory tailwinds in Q3 to a more explicit emphasis on yield generation, capital deployment, and risk-adjusted returns in Q4.</li>\n<li>Strategic focus evolved from establishing the SUI digital asset treasury and initial DeFi partnerships (e.g., Bluefin, Ethena) to scaling those deployments, targeting specific yield benchmarks (10%), and advancing stablecoin infrastructure.</li>\n<li>Analyst questions in Q4 centered more on yield generation, risk management, and cash deployment, compared to the prior quarter’s broader queries about partnerships and ecosystem growth.</li>\n<li>Key metric changes include a rise in gross revenue and portfolio income, increased share repurchases, and a significant noncash unrealized loss due to mark-to-market adjustments, highlighting the impact of digital asset price volatility.</li>\n<li>Management’s confidence in core initiatives, particularly yield and risk management, increased relative to Q3, as did analyst interest in granular yield and risk details.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management addressed digital asset price volatility through noncash mark-to-market losses and emphasized risk-adjusted capital deployment.</li>\n<li>Barnett and Mackintosh outlined disciplined risk management, leveraging institutional relationships and parent guarantees for lending, and maintaining flexibility.</li>\n<li>Analyst concerns centered on sustainability of yields, risk of lending losses, and the impact of digital asset price declines on financial results.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>SUI Group Holdings Limited’s Q4 2025 call underscored a strategic transition toward scaling digital asset treasury operations, targeting a 10% yield on SUI through a combination of institutional and DeFi lending, and deploying $10 million into stablecoin infrastructure. Management highlighted robust growth in ecosystem partnerships, increased share repurchases, and disciplined risk management, even as substantial noncash losses reflected digital asset market volatility. The company’s approach continues to focus on long-term value creation aligned with the expansion of the SUI blockchain and institutional adoption.</p>\n<p><a href=\"https://seekingalpha.com/symbol/suig/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558603-sui-group-outlines-10-percent-yield-target-and-10m-stablecoin-deployment-while-advancing",
            "pub_date": "2026-02-27 19:00:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558596",
            "title": "Aura Minerals reports Q4 results",
            "description": "<html><body><ul>\n<li>Aura Minerals <a href=\"https://seekingalpha.com/pr/20416960-aura-announces-q4-2025-and-fy-2025-financial-and-operational-results\">press release</a>  (AUGO): Q4</li>\n<li>Revenue of $321.7M (+29.8% Y/Y) <font color=\"red\"> misses by $1.49M</font>.</li>\n<li>Adjusted EBITDA reached a new all-time high of $207.9M in Q4 2025, marking the sixth consecutive quarterly record for Aura. The company's increase in production, while maintaining disciplined cost control, enabled it to fully capture the benefit of rising metal prices. As a result, adjusted EBITDA more than doubled compared to Q4 2024 and grew 37% over Q3 2025.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558596-aura-minerals-reports-q4-results",
            "pub_date": "2026-02-27 18:41:02",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558597",
            "title": "Golden Entertainment GAAP EPS of -$0.33, revenue of $155.6M",
            "description": "<html><body><ul>\n<li>Golden Entertainment <a href=\"https://seekingalpha.com/pr/20417165-golden-entertainment-reports-2025-fourth-quarter-and-full-year-2025-results\">press release</a>  (GDEN): Q4  GAAP EPS of -$0.33.</li>\n<li>Revenue of $155.6M (-5.2% Y/Y).</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558597-golden-entertainment-gaap-eps-of-0_33-revenue-of-155_6m",
            "pub_date": "2026-02-27 18:41:02",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558595",
            "title": "Jamieson Wellness reports Q4 results",
            "description": "<html><body><ul>\n<li>Jamieson Wellness <a href=\"https://seekingalpha.com/pr/20416597-jamieson-wellness-inc-reports-fourth-quarter-and-full-year-2025-results\">press release</a>  (JWEL:CA): Q4 Non-GAAP EPS of C$0.90.</li>\n<li>Consolidated revenue increased 13.4% to C$277.7 million, driven by 17.1% growth in Jamieson Brands, partially offset by an expected decline in Strategic Partners revenue</li>\n<li>Gross profit increased by C$18.5 million to C$118.7 million, mainly driven by higher Jamieson Brands revenues and increased margins.</li>\n<li>Consolidated revenue increased 13.4% to C$277.7 million, driven by 17.1% growth in Jamieson Brands, partially offset by an expected decline in Strategic Partners revenue</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558595-jamieson-wellness-reports-q4-results",
            "pub_date": "2026-02-27 18:35:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558587",
            "title": "LafargeHolcim reports FY results",
            "description": "<html><body><ul>\n<li><p data-eci=\"true\">LafargeHolcim <a href=\"https://www.holcim.com/media/media-releases/full-year-2025-results\" rel=\"nofollow\" target=\"_blank\">press release</a>  (HCMLF): FY Earnings per share of CHF 3.22, up 5.0%</p></li>\n<li>Full-year net sales of CHF 15 724 million, +3.0% in LC, up 3.4% in Q4 Recurring EBIT of CHF 2 876 million, +10.3% in LC, up 12.2% in Q4 </li>\n<li>Expansion of industry-leading recurring EBIT margin to 18.3%, +80bps</li>\n<li>Free cash flow of CHF 2 154 million, cash conversion of 54%</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558587-lafargeholcim-reports-fy-results",
            "pub_date": "2026-02-27 18:21:36",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558583",
            "title": "Diamond Hill Investment reports Q4 results",
            "description": "<html><body><ul>\n<li>Diamond Hill Investment <a href=\"https://seekingalpha.com/pr/20416576-diamond-hill-investment-group-inc-reports-2025-financial-results\">press release</a>  (DHIL): Q4 Adjusted earnings per share attributable to common shareholders - diluted was $11.56, compared to $12.92 in 2024.</li>\n<li>Assets under management (\"AUM\") and assets under advisement (\"AUA\") combined were $31.0 billion, compared to $31.9 billion as of December 31, 2024.</li>\n<li>Average AUM and AUA combined were 31.8 billion, compared to $31.6 billion during 2024.</li>\n<li>Net client outflows were $2.7 billion, compared to $0.3 billion of net outflows during 2024.</li>\n<li>Revenue was $147.1 million, compared to $151.1 million in 2024.</li>\n<li>Net operating profit margin was 25% in 2025, compared to 29% in 2024, respectively.</li>\n<li>Adjusted net operating profit margin<sup>1</sup> was 29% in 2025 compared to 32% in 2024.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558583-diamond-hill-investment-reports-q4-results",
            "pub_date": "2026-02-27 18:16:14",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558584",
            "title": "ECN Capital declares $0.01 dividend",
            "description": "<html><body><ul>\n<li>ECN Capital (ECN:CA) declares <a href=\"https://seekingalpha.com/pr/20416857-ecn-capital-reports-us-0_05-in-adjusted-net-income-per-common-share-in-q4-2025\" target=\"_blank\">C$0.01/share quarterly dividend</a>, in line with previous.</li>\n<li>Payable March 31; for shareholders of record March 20; ex-div March 20.</li>\n<li><a href=\"https://seekingalpha.com/symbol/ECN:CA/dividends?source=news_bullet\">See ECN:CA Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558584-ecn-capital-declares-0_01-dividend",
            "pub_date": "2026-02-27 18:16:14",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558576",
            "title": "LSI Industries prices $90M stock offering",
            "description": "<html><body><ul>\n<li>LSI Industries (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/LYTS\" title=\"LSI Industries Inc.\">LYTS</a></span>) has <a href=\"https://seekingalpha.com/pr/20417058-lsi-industries-prices-public-offering-of-common-stock\" target=\"_blank\" title=\" priced \">priced </a>its underwritten public offering of 4.6M shares at $19.75 per share to raise approximately $90M in gross proceeds.</li>\n<li>The firm has granted the underwriters a 30-day option to purchase up to an additional 690,000 shares at the public offering price, less underwriting discounts and commissions.</li>\n<li>The offering is expected to close on or about March 2, 2026, subject to the satisfaction of customary closing conditions.</li>\n<li>The firm plans to use the net proceeds to implement its growth and acquisition strategy, including payment of a portion of the purchase price for its proposed Royston Group acquisition, repayment of borrowings under the proposed senior secured credit facility commitment letter, dated January 21, 2026, and for general working capital and corporate purposes.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558576-lsi-industries-prices-90m-stock-offering",
            "pub_date": "2026-02-27 18:10:50",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558580",
            "title": "NetApp declares $0.52 dividend",
            "description": "<html><body><ul>\n<li>NetApp (NTAP) declares <a href=\"https://seekingalpha.com/pr/20416501-netapp-reports-third-quarter-of-fiscal-year-2026-results\" target=\"_blank\">$0.52/share quarterly dividend</a>, in line with previous.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/NTAP/dividends/yield?source=news_bullet\">Forward yield</a> 2.1%</li>\n<li>Payable April 22; for shareholders of record April 3; ex-div April 3.</li>\n<li><a href=\"https://seekingalpha.com/symbol/NTAP/dividends?source=news_bullet\">See NTAP Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558580-netapp-declares-0_52-dividend",
            "pub_date": "2026-02-27 18:10:50",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}