{
    "data": [
        {
            "id": "4558903",
            "title": "Trump calls for re-adjudication of SCOTUS ruling in social media post",
            "description": "<html><body><p data-eci=\"true\">U.S. President Donald Trump on Friday called for a re-adjudication of the Supreme Court's decision striking down his tariffs in a social media post.</p>\n<p>Last week, SCOTUS <a href=\"https://seekingalpha.com/news/4554697-us-supreme-court-strikes-down-trumps-global-tariffs\" target=\"_blank\" title=\"ruled\">ruled</a> in a 6-3 decision to strike down the tariffs. The ruling found that Trump did not have the authority to impose tariffs under the International Emergency Economic Powers Act.</p>\n<p>The court's decision raised concerns over whether importers will get refunds for duties already paid.</p>\n<p>Notably, Hasbro (<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a>) was reportedly <a href=\"https://seekingalpha.com/news/4558884-hasbro-sues-us-government-to-recover-tariff-costs\" target=\"_blank\" title=\"seeking to\">seeking to</a> recover tariffs that were paid to the U.S. government under the International Emergency Economic Powers Act following last week's decision.</p>\n<p>The toymaker was said to be the latest in a wave of companies trying to recover the billions of dollars that were collected between April 2025 and February 2026.</p>\n<p>\"The recent Decision of the United States Supreme Court concerning TARIFFS could allow for Hundreds of Billions of Dollars to be returned to Countries and Companies that have been 'ripping off' the United States of America for many years, <span>and now, according to this Decision, could actually continue to do so, at an even increased level,</span>\" said Trump in a Truth Social post.</p>\n<p>\"<span>It doesn’t make sense that Countries and Companies that took advantage of us for decades, receiving Billions and Billions of Dollars that they should not have been allowed to receive, would now be entitled to an undeserved 'windfall,' the likes of which the World has never seen before, as a result of this highly disappointing, to say the least, ruling,\" said the post.</span></p>\n<p><span>\"Is a Rehearing or Readjudication of this case possible???\" asked Trump in the post.</span></p>\n<p><span><strong id=\"docs-internal-guid-f9daf5ee-7fff-1ce7-21c1-b78105c3bbe0\">Dear readers<span>: </span></strong><span>We recognize that politics often intersects with the financial news of the day, so we invite you to </span><a href=\"https://seekingalpha.com/article/4867595-politics-and-the-markets-022726\" target=\"_blank\" title=\"click here\">click here</a><span> to join the separate political discussion.</span></span></p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558903-trump-calls-for-re-adjudication-of-scotus-ruling-in-social-media-post",
            "pub_date": "2026-02-28 05:51:20",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558912",
            "title": "InTEST outlines $125M–$130M 2026 revenue target amid backlog growth and diversification strategy",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: inTEST Corporation (INTT) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li><p>Nick Grant, President and CEO, described Q4 as “a strong finish to a challenging year,” highlighting that “orders once again exceeded $37 million,” and revenue reached $32.8 million, above guidance. Grant emphasized a “healthy year-end backlog of $53.9 million, representing a 36% increase over year-end 2024.” He credited diversification and new product launches, particularly from Alfamation and Acculogic, for driving top-line growth and advancing the company toward its Vision 2030 goal of 25% revenue from new products. Grant also noted, “With nearly 80% of fourth quarter revenue derived from non-semi end markets and momentum in new product sales contributing meaningfully to revenue and gross margin, we believe our strategy is working.”</p></li>\n<li><p>Duncan Gilmour, CFO, stated, “Revenue in Q4 increased $6.6 million or 25% from $26.2 million in Q3 to $32.8 million,” attributing gains to industrial, defense/aerospace, life sciences, and auto EV segments, partially offset by a decline in semi. Gilmour further explained, “Gross margin expanded 350 basis points sequentially from 41.9% in Q3 2025 to 45.4% in Q4 2025,” driven by higher sales of new Alfamation products. He added, “For the fourth quarter, net income was $1.2 million. Adjusted EBITDA was $3.2 million, representing an adjusted EBITDA margin of 9.7%.”</p></li>\n</ul>\n<h3>Outlook</h3>\n<ul><li>Management resumed offering full-year guidance, projecting 2026 revenue of $125 million to $130 million, “at the midpoint, this represents growth of approximately 12% over 2025's $113.8 million,” according to Gilmour. Q1 2026 revenue is expected to be $31 million to $33 million, with gross margin at approximately 44%. Full-year 2026 gross margin is forecasted at approximately 45%. Operating expenses are projected at $53 million to $55 million, amortization at $2.6 million, and capital expenditures at 1% to 2% of revenue. Gilmour specified, “Our guidance does not contemplate any material impact, positive or negative, from changes in tariff policy or the broader geopolitical environment.”</li></ul>\n<h3>Financial Results</h3>\n<ul><li>Revenue for Q4 2025 was $32.8 million, up from $26.2 million in Q3. Backlog at year-end was $53.9 million, up 9% sequentially and 36% year-over-year. Gross margin was 45.4%, a sequential increase of 350 basis points and a year-over-year increase of 570 basis points. Operating expenses were $13.6 million. Net income for Q4 was $1.2 million or $0.10 per diluted share, with adjusted EPS at $0.16. For full year 2025, there was a net loss of $2.5 million or $0.21 per share. Adjusted EBITDA for Q4 was $3.2 million, up from $0.4 million in Q3. Total debt at year-end was $7.5 million, and liquidity was approximately $58 million.</li></ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li><p>Maxwell Michaelis, Lake Street Capital Markets: Asked about the semi space and guidance language. Grant responded, “our guidance we provided there really is based on just modest recovery in semi, which, yes, could be conservative...we're well positioned to capture that if it does happen again.”</p></li>\n<li><p>Michaelis asked about the 2027 automotive program. Grant said, “auto has been a nice bright spot...we believe well positioned from an auto perspective with Alfamation to support these new model year programs...as the demand comes back, these new model programs come out and creates greater demand around the new tech and the cars.”</p></li>\n<li><p>Michaelis inquired about life sciences growth. Grant detailed, “this is really a concentrated effort we've made to go after MedTech...had really nice success with Alfamation, diversifying them in the MedTech space with some glucometer electronic testing...continue to see good momentum there.”</p></li>\n<li><p>Richard Ryan, Oak Ridge Financial: Asked about back-end and front-end semi positioning. Grant replied, “We're very well positioned in that back-end test space...new products we've been launching really has broadened our customer base...better position to benefit from the growth as the investments in these testing spaces take off.”</p></li>\n<li><p>Ryan followed up on silicon carbide and front-end semi outlook. Grant stated, “We're very well positioned in that space...as these technologies get adopted into new applications and creates more demand as auto comes back...we have the capacity to scale right up to support them at those levels and beyond.” Gilmour added, “modest increases in semi baked in...the front-end side has been slow. We think the outlook looks great, but we're really not banking on a great deal in 2026.”</p></li>\n<li><p>Edward Jackson, Northland Capital: Asked about gross margins and semi’s impact. Grant responded, “semi contribution was low...yet we still had a nice gross margin quarter...if that comes back in a strong fashion at some point, then we'd expect margin to tick up.”</p></li>\n<li><p>Jackson asked about cadence of guidance. Grant explained, “we're expecting cautious sequential growth throughout the year...if there was a really strong recovery in semi in particular, we would expect to see the benefits of that.”</p></li>\n<li><p>Jackson requested color on bookings activity. Grant said, “two strong quarters of bookings...our funnel -- overall funnel is healthy...for the most part, the funnels are healthy and the opportunities are there.”</p></li>\n<li><p>Jackson questioned OpEx guidance and incentive comp. Grant confirmed, “we have factored in the incentive comp side of the numbers that we've laid out with respect to the spending guidelines.”</p></li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li><p>Analysts expressed largely positive sentiment, frequently congratulating management and pressing for detail on growth opportunities in semi, auto, and life sciences. There were some probing questions about margin potential and guidance conservatism, but the tone remained constructive. </p></li>\n<li><p>Management’s prepared remarks and responses were confident and cautiously optimistic. Grant and Gilmour acknowledged conservatism in guidance, repeatedly used terms like “well positioned,” and demonstrated confidence in diversification and new product strategies. There was a consistent tone of cautious optimism, with several acknowledgments of macro uncertainty and deliberate conservatism in forecasts.</p></li>\n<li><p>Compared to the previous quarter, management’s tone remained optimistic but more confident, with greater willingness to discuss forward-looking guidance and growth expectations. Analysts’ tone also improved, focusing more on growth avenues than risk factors.</p></li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li><p>Guidance shifted from only providing next quarter outlook in Q3 to reinstating full-year guidance for 2026 in Q4, with a revenue target of $125 million to $130 million, signaling increased confidence.</p></li>\n<li><p>Strategic focus continued on diversification and new product launches, but management highlighted greater traction in non-semi markets and noted a 36% year-over-year increase in backlog.</p></li>\n<li><p>Analysts’ questions in Q4 centered more on growth opportunities and margin potential, whereas Q3 saw more focus on operational challenges and near-term revenue risk.</p></li>\n<li><p>Key financial metrics improved sequentially: revenue, gross margin, and adjusted EBITDA all increased from Q3 to Q4, while guidance suggests further growth in 2026.</p></li>\n<li><p>Management’s confidence and willingness to offer full-year guidance marked a notable shift from the prior quarter’s caution.</p></li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li><p>Management cited persistent softness in the semi business and macroeconomic uncertainties as ongoing challenges, but highlighted that “market diversification is creating broader order opportunities.”</p></li>\n<li><p>Gilmour noted that guidance does not include potential impacts from tariff policy or geopolitical events.</p></li>\n<li><p>Analysts raised questions about the pace of semi recovery, margin expansion, and the sustainability of life sciences and auto growth, with management acknowledging that upside in semi is not factored into guidance.</p></li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>inTEST management emphasized that strong backlog growth, a diversified revenue base, and momentum in new product adoption have positioned the company for a year of returning growth in 2026. With a revenue target of $125 million to $130 million, the company is focused on broadening its market reach and scaling operational efficiency while maintaining a conservative approach to semi market recovery. Management expressed confidence that recent structural changes and strategic initiatives will contribute to sustainable, profitable growth moving forward.</p>\n<p><a href=\"https://seekingalpha.com/symbol/intt/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558912-intest-outlines-125m-130m-2026-revenue-target-amid-backlog-growth-and-diversification",
            "pub_date": "2026-02-28 05:51:20",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558910",
            "title": "XTL announces receipt of staff delisting letter from Nasdaq",
            "description": "<html><body><ul> <li>XTL Biopharmaceuticals (<a href=\"https://seekingalpha.com/symbol/XTLB\">XTLB</a>) has received a letter from Nasdaq notifying that it believes the company is a “public shell”, and that the continued listing of XTLB's American Depositary Shares is no longer warranted.</li>\n<li>The company intends to request a hearing to appeal the delisting process before a Nasdaq Hearings Panel. A hearing request will stay the suspension of the ADSs and delisting pending the panel’s decision.</li> <li>The letter stated that the staff believes the company no longer has an operating business, citing it’s prior public disclosure that its wholly owned subsidiary, The Social Proxy, had filed a formal application with the competent Israeli court for the commencement of insolvency proceedings and that on February 22, 2026, the court ordered The Social Proxy's liquidation and the appointment of a trustee for the insolvency proceedings.</li>\n<li>The staff noted that the company’s purported shell status could lead to the ADSs being subject to market abuses and other violative conduct.</li> <li>Additionally, the staff notified the company that it did not comply with the minimum $2.5M stockholders’ equity requirement and on December 20, 2025, the Staff notified the Company that its ADSs were no longer in compliance with the minimum $1 bid price.</li> <li>Unless the company requests the Hearing by March 4, 2026, trading of the company’s ADSs will be suspended from The Nasdaq Capital Market at the opening of business on March 6, 2026, and will subsequently be removed from listing.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20418097-xtl-announces-receipt-of-staff-delist-determination-from-nasdaq-and-plans-to-request-hearing\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558910-xtl-announces-receipt-of-staff-delisting-letter-from-nasdaq",
            "pub_date": "2026-02-28 05:46:29",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558911",
            "title": "American Eagle Gold plans C$34.5M financing; Eric Sprott to acquire 9.9% stake",
            "description": "<html><body><ul>\n<li>American Eagle Gold (AE:CA) <a href=\"https://seekingalpha.com/pr/20418126-american-eagle-announces-23-million-strategic-investment-backed-by-eric-sprott\">intends to raise</a> up to C$34.54M through a combined charity flow-through and concurrent share offering.</li>\n<li>The charity flow-through offering will include up to 19.2M shares at C$1.20 per share for gross proceeds of C$23.04M.</li>\n<li>The concurrent offering will consist of up to 14.94M common shares at C$0.77/share for up to C$11.5M.</li>\n<li>Eric Sprott, through 2176423 Ontario, has agreed to acquire an ~9.9% equity stake in the company.</li>\n<li>Sprott will purchase 19.2M shares underlying the charity flow-through offering at a back-end price of C$0.77/share, representing the full C$23.04M portion of that offering.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558911-american-eagle-gold-plans-c345m-financing-eric-sprott-to-acquire-99-stake",
            "pub_date": "2026-02-28 05:46:29",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558907",
            "title": "Tencent snaps six straight sessions of losses",
            "description": "<html><body><p data-eci=\"true\">Tencent (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TCEHY\" title=\"Tencent Holdings Limited\">TCEHY</a></span>) rebounded on Friday after closing in the red for six straight sessions. The stock closed 0.15% higher at $65.70.</p>\n<p>The Chinese firm lost nearly 4% in the previous six sessions. On February 26, the stock ended 1.90% lower, further pressuring its price. The stock has closed in the red for the majority of February, barring just four sessions of gains.</p>\n<p>As per Seeking Alpha’s quant rating, the stock has a Hold rating with a score of 3.22 out of 5. Tencent has been rated an A+ for profitability, while it has been graded an F for valuation. However, both Seeking Alpha and Wall Street analysts have rated the company as Buy.</p>\n<p>Last month, Seeking Alpha analyst <a href=\"https://seekingalpha.com/article/4863685-tencent-stock-china-emphasizing-domestic-and-international-services-growth-bodes-well\" target=\"_blank\" title=\"APAC Investment News\">APAC Investment News</a> issued a Buy rating for the stock, arguing that it is well-positioned to benefit from China’s pivot toward services and the knowledge economy.</p>\n<p>“Despite a touch-high valuation, TCEHY offers robust growth, strong margins, and potential AI upside, justifying a buy rating,” the analyst said.</p>\n<p>The company is expected to benefit from China’s support via the upcoming five-year plan and increased domestic consumption.</p>\n<p><span>“…we do know that when China does decide to support a specific industry, generous support can fuel growth. The last few five-year plans have emphasized electric vehicles, for example, and now China is the world’s leader in many areas of EV technology, and globally it’s now the biggest producer of EVs. I suspect the overall knowledge economy and services sector will enjoy a high degree of support going forward, which should buoy Tencent and other services firms,” it added.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558907-tencent-snaps-six-straight-sessions-of-losses",
            "pub_date": "2026-02-28 05:40:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558904",
            "title": "Cadence plans to sell up to 3.2M shares of common stock",
            "description": "<html><body><p data-eci=\"true\">Cadence Design Systems (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CDNS\" title=\"Cadence Design Systems, Inc.\">CDNS</a></span>) plans to sell up to 3.2M shares of its common stock, according to a filing on Friday with the U.S. Securities and Exchange Commission.</p>\n<p>The planned stock sale is related to its completed <a href=\"https://seekingalpha.com/pr/20409025-cadence-completes-acquisition-of-hexagon-s-design-and-engineering-business-advancing\" target=\"_blank\" title=\"acquisition\">acquisition</a> of Hexagon AB's design and engineering business. Cadence completed the acquisition on Monday, Feb. 23, for approximately <span>€2.7B, or $3.19B. Cadence expects the incoming business to add an incremental $160M to its 2026 revenue.</span></p>\n<p><span>\"On September 4, 2025, we entered into the Purchase Agreement, pursuant to which we issued 3,224,473 shares of common stock as partial consideration in connection with the acquisition of the design and engineering business of Hexagon Smart Solutions AB,\" Cadence said in the <a href=\"https://seekingalpha.com/filing/176255402\" target=\"_blank\" title=\"filing\">filing</a>. \"We issued the shares of common stock in reliance upon the exemptions from registration afforded by Regulation S promulgated under the Securities Act and/or Section 4-a-2 of the Securities Act. In accordance with our obligations under the Purchase Agreement, we agreed to register the resale of the shares of common stock offered by the selling stockholder hereby.\"</span></p>\n<p><span><span>\"This acquisition marks a major milestone in advancing our vision for intelligent system design,\" said Cadence CEO </span>Anirudh Devgan. \"By combining our industry-leading computational software and AI-driven design expertise with MSC Software's world-class structural and physics-based analysis technologies, we're empowering customers to push the boundaries of what's possible—from autonomous systems and advanced robotics to the future of transportation.\"</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558904-cadence-plans-to-sell-up-to-3_2m-shares-of-common-stock",
            "pub_date": "2026-02-28 05:40:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558899",
            "title": "U.S. drilling rig count drops one in latest Baker Hughes survey",
            "description": "<html><body><p data-eci=\"true\"><span>The </span><span>number of oil and gas rigs actively drilling in the U.S. declined by 1 to 550, Baker Hughes reported Friday in its <a href=\"https://rigcount.bakerhughes.com/rig-count-overview\" rel=\"nofollow\" target=\"_self\" title=\"latest weekly survey\">latest weekly survey</a>.</span></p>\n<p><span>During the week ended February 27, the number of active drilling rigs targeting<span> crude oil in the</span><span> U.S. fell by 2 to 407,<span> while gas rigs gained 1 to 134, and 9 rigs remained classified as miscellaneous.</span></span></span></p>\n<p><span><span><span>The total rig count was down by 43, or 7.8%, from the same time last year.</span></span></span></p>\n<p><span><span><span>The number of rigs targeting oil in the Permian Basin remained unchanged at 239, while the oil rig count in the Eagle Ford and Williston each totaled 28.</span></span></span></p>\n<p><span><span><span>ETFs: (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/USO\" title=\"United States Oil Fund LP ETF\">USO</a></span>), (<a href=\"https://seekingalpha.com/symbol/UCO\" title=\"ProShares Ultra Bloomberg Crude Oil ETF\">UCO</a>), (<a href=\"https://seekingalpha.com/symbol/SCO\" title=\"ProShares UltraShort Bloomberg Crude Oil ETF\">SCO</a>), (<a href=\"https://seekingalpha.com/symbol/USL\" title=\"United States 12 Month Oil Fund LP ETF\">USL</a>), (<a href=\"https://seekingalpha.com/symbol/DBO\" title=\"Invesco DB Oil Fund ETF\">DBO</a>), (<a href=\"https://seekingalpha.com/symbol/DRIP\" title=\"Direxion Daily S&amp;P Oil &amp; Gas Exp &amp; Prod Br 2X Shs ETF\">DRIP</a>), (<a href=\"https://seekingalpha.com/symbol/GUSH\" title=\"Direxion Daily S&amp;P Oil &amp; Gas Exp &amp; Prod Bl 2X Shs ETF\">GUSH</a>), (<a href=\"https://seekingalpha.com/symbol/USOI\" title=\"UBS ETRACS Crude Oil Shares Covered Call ETN\">USOI</a>), (<a href=\"https://seekingalpha.com/symbol/UNG\" title=\"United States Natural Gas Fund LP ETF\">UNG</a>), (<a href=\"https://seekingalpha.com/symbol/BOIL\" title=\"ProShares Ultra Bloomberg Natural Gas ETF\">BOIL</a>), (<a href=\"https://seekingalpha.com/symbol/KOLD\" title=\"ProShares UltraShort Bloomberg Natural Gas ETF\">KOLD</a>), (<a href=\"https://seekingalpha.com/symbol/UNL\" title=\"United States 12 Month Natural Gas Fund LP ETF\">UNL</a>), (<a href=\"https://seekingalpha.com/symbol/FCG\" title=\"First Trust Natural Gas ETF\">FCG</a>)</span></span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558899-u-s-drilling-rig-count-drops-one-in-latest-baker-hughes-survey",
            "pub_date": "2026-02-28 05:35:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558908",
            "title": "Chart Industries Non-GAAP EPS of $2.51 misses by $0.50, revenue of $1.08B misses by $110M",
            "description": "<html><body><ul>\n<li>Chart Industries <a href=\"https://seekingalpha.com/pr/20418105-chart-industries-reports-fourth-quarter-and-full-year-2025-financial-results\">press release</a>  (GTLS): Q4  Non-GAAP EPS of $2.51 <font color=\"red\"> misses by $0.50</font>.</li>\n<li>Revenue of $1.08B (-2.7% Y/Y) <font color=\"red\"> misses by $110M</font>.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558908-chart-industries-non-gaap-eps-of-2_51-misses-by-0_50-revenue-of-1_08b-misses-by-110m",
            "pub_date": "2026-02-28 05:35:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558900",
            "title": "Prothena authorizes up to $100 million share repurchase plan",
            "description": "<html><body><ul>\n<li>Prothena Corporation (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/PRTA\" title=\"Prothena Corporation plc\">PRTA</a></span>) on Friday said that its board had authorized a share repurchase plan of up to $100 million of the company’s outstanding ordinary shares.</li>\n<li><p data-eci=\"true\" data-end=\"536\" data-start=\"258\">The biotechnology company said it had $308.4 million in cash, cash equivalents and restricted cash and no debt as of December 31, 2025.</p></li>\n<li><p data-end=\"536\" data-start=\"258\">Excluding any purchases under the plan, it expects to end 2026 with about $255 million in cash, cash equivalents and restricted cash.</p></li>\n<li><p data-pm-slice=\"0 0 []\">The company said the guidance does not include the potential to earn up to $105 million in aggregate clinical milestone payments in 2026 from partners related to the advancement of coramitug for ATTR amyloidosis with cardiomyopathy by Novo Nordisk and PRX019 for neurodegenerative diseases by Bristol Myers Squibb.</p></li>\n<li><p data-pm-slice=\"0 0 []\">Repurchases may be made from time to time in open market transactions, including under Rule 10b-18 and through Rule 10b5-1 plans.</p></li>\n<li><p data-pm-slice=\"0 0 []\">The plan will expire on December 31, 2026, and may be suspended or discontinued at any time, the company said.</p></li>\n<li>PRTA <span>+13.61%</span> after hours to $9.85.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20418057-prothena-announces-up-to-100-million-share-repurchase-plan\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558900-prothena-authorizes-up-to-100-million-share-repurchase-plan",
            "pub_date": "2026-02-28 05:26:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558901",
            "title": "American Healthcare REIT outlines 2026 NFFO growth target of up to $2.05 per share, backed by strong SHOP and Trilogy performance",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: American Healthcare REIT (AHR) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Jeffrey Hanson, Chairman and Interim CEO &amp; Interim President, began by addressing the leadership transition, stating \"I stepped into the role of Interim CEO, while Danny is on a medical leave of absence. I'm pleased to share that he's at home recovering well and is in good spirits... He intends to return in the relative near term, but it's too early to have timing visibility at this point.\" Hanson emphasized \"This is a seamless continuation of the strategy and execution you've grown to expect from this team... There's no change in strategy. Our investment in capital allocation strategy, risk management framework, balance sheet posture and long-term value orientation remain unchanged.\"</li>\n<li>Gabriel Willhite, Chief Operating Officer, highlighted \"the fourth quarter capped off another exceptional year of outsized NOI growth for AHR. We delivered total portfolio same-store NOI growth of 11.8% in the fourth quarter and 14.2% for the full year 2025.\" Willhite credited the operating portfolio, especially the Trilogy and SHOP segments, for this performance, noting \"same-store occupancy reached 90.6% in Q4, up 275 basis points year-over-year.\"</li>\n<li>Stefan K. Oh, Chief Investment Officer, reported \"We closed on over $950 million of new investments across our Trilogy and SHOP segments... The majority of our acquisition volume this year was within SHOP, where we added newer assets in attractive submarkets... our SHOP segment as the second largest within our diversified portfolio in terms of cash NOI.\"</li>\n<li>Brian Peay, Chief Financial Officer, stated \"We reported normalized funds from operations attributable to common stockholders, or NFFO of $0.46 per diluted share in the fourth quarter of 2025 and $1.72 per diluted share for all of 2025. That represents 22% year-over-year NFFO per share growth in 2025 as compared to 2024.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Brian Peay outlined 2026 guidance, stating \"we issued 2026 NFFO guidance of $1.99 to $2.05 per diluted share. This implies another year of double-digit NFFO per share growth and only includes the previously consummated 2026 acquisitions that Stefan mentioned earlier of $117.5 million.\" Peay provided total portfolio same-store NOI growth guidance for 2026 \"between 7% and 11%. That range is comprised of the following segment level same-store NOI growth ranges: 8% to 12% growth in Trilogy, 15% to 19% growth in SHOP, 0% to 2% growth in Outpatient Medical and a range of 2% to 3% growth in our Triple-Net Leased Properties segment.\"</li>\n<li>Management indicated no change in strategy or risk posture from prior quarters.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Peay reported \"normalized funds from operations attributable to common stockholders, or NFFO of $0.46 per diluted share in the fourth quarter of 2025 and $1.72 per diluted share for all of 2025.\"</li>\n<li>Willhite highlighted \"total portfolio same-store NOI growth of 11.8% in the fourth quarter and 14.2% for the full year 2025.\"</li>\n<li>Trilogy segment delivered \"same-store NOI increased 14% in the fourth quarter and 18.4% for the full year. Same-store occupancy reached 90.6% in Q4, up 275 basis points year-over-year.\"</li>\n<li>SHOP segment \"same-store NOI increased 24.6% in Q4 and 25.2% for 2025 compared to the same period in 2024.\"</li>\n<li>The company improved debt to EBITDA by nearly a full turn in 2025 and ended the year with a 3.4x net debt-to-EBITDA ratio.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Wesley Golladay, Baird, asked about the acquisition environment. Stefan K. Oh responded that the company continues to focus on higher acuity SHOP assets, noting \"for the most part, we're sticking with the higher acuity asset class.\"</li>\n<li>Ronald Kamdem, Morgan Stanley, inquired about SHOP guidance and occupancy. Peay stated \"the more occupied our buildings get, the more pricing power we have. And at 90.6%... we have more and more pricing power.\"</li>\n<li>Kamdem also asked about Trilogy occupancy and mix shift. Willhite explained \"the key thing with Q mix is going to be shifting to the higher payer sources... more people in Medicare setting and Medicare Advantage settings helps and fewer in the Medicaid setting helps.\"</li>\n<li>Austin Wurschmidt, KeyBanc, pressed on Trilogy's NOI growth outlook. Willhite responded \"we've got upside potential that's disproportionate to downside risk... If that trend holds true, then I think you can expect some upside in our occupancy assumptions.\"</li>\n<li>Michael Carroll, RBC, asked about the rollout of the revenue management platform. Willhite said it is \"still too early for us to release the results from it\" but highlighted the collaborative approach with operators.</li>\n<li>Michael Stroyeck, Green Street, asked about seasonality impact on SHOP occupancy. Willhite noted \"through early 2026, we're seeing much less of a flu impact... occupancy is not deeply impacted at least through February.\"</li>\n<li>Stroyeck inquired on triple-net portfolio hospital coverage. Peay said the volatility is due to operational shifts but emphasized the strength of the tenant's commitment and lease guarantee.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts' questions centered on acquisition strategy, occupancy trends, and operational leverage, with a generally positive but probing tone, especially regarding growth sustainability and competitive positioning.</li>\n<li>Management maintained a confident and steady tone, emphasizing continuity, strong operating results, and a robust acquisition pipeline. Hanson stated \"This is a seamless continuation of the strategy and execution you've grown to expect from this team,\" and Peay expressed \"We are entering 2026 from a position of strength.\"</li>\n<li>Compared to the previous quarter, sentiment from both analysts and management remains confident, with slightly more focus on the impact of leadership transition and sustainability of growth.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 NFFO per diluted share increased to $1.99 to $2.05, compared to previous 2025 guidance of $1.69 to $1.72.</li>\n<li>Total portfolio same-store NOI growth guidance for 2026 set at 7% to 11%, lower than the full year 2025 result of 14.2%.</li>\n<li>SHOP and Trilogy segments continue to be highlighted as key growth drivers, with segment-level guidance reflecting expectations for continued, though moderating, growth.</li>\n<li>Management tone in both quarters emphasized confidence and strategic consistency, but the current quarter provided more detail on leadership continuity due to the CEO’s medical leave.</li>\n<li>Analysts’ focus shifted slightly toward sustainability of high growth rates and implementation of technology-driven revenue management across the portfolio.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management acknowledged the CEO’s medical leave but reassured stakeholders about leadership stability and continuity.</li>\n<li>Willhite discussed seasonality risks, noting flu season had less impact so far in early 2026 but indicated continued monitoring.</li>\n<li>Peay addressed volatility in the triple-net portfolio's hospital coverage, referencing operational changes but emphasizing strong tenant commitment.</li>\n<li>Analysts probed on acquisition timing and competitive dynamics, particularly regarding cap rate compression and asset quality.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>American Healthcare REIT emphasized that its leadership transition has not altered strategic direction or operational focus. The company reported another year of double-digit NFFO growth, driven by strong performance in the Trilogy and SHOP segments, disciplined acquisitions, and a robust pipeline. Guidance for 2026 targets continued growth, supported by high occupancy rates, expanding revenue management initiatives, and an active investment program. Management underscored a position of strength entering the new year, with stable leverage metrics and a clear focus on long-term value creation for shareholders.</p>\n<p><a href=\"https://seekingalpha.com/symbol/ahr/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558901-american-healthcare-reit-outlines-2026-nffo-growth-target-of-up-to-2_05-per-share-backed-by",
            "pub_date": "2026-02-28 05:21:24",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}