{
    "data": [
        {
            "id": "4558761",
            "title": "UBS cuts US equities to benchmark, boosts emerging markets on dollar and growth outlook",
            "description": "<html><body><p data-eci=\"true\" data-end=\"362\" data-start=\"93\">UBS has downgraded U.S. equities to benchmark in a fully invested global portfolio, citing stretched valuations, fading buyback support, and rising risks from a weaker dollar, while reiterating a high-conviction overweight on emerging markets.</p>\n<p data-end=\"716\" data-start=\"364\">The bank said the United States has the lowest operational leverage among major regions and historically underperforms when global growth accelerates above 3.5%. UBS now forecasts global GDP growth of 3.4% in 2026, up from 2.7% previously, arguing that a broadening recovery could favor more cyclical markets.</p>\n<p data-end=\"1061\" data-start=\"718\">The bank also warned that a weaker dollar may weigh on unhedged U.S. returns, noting that currency losses have recently outweighed the earnings uplift typically associated with dollar depreciation. Meanwhile, U.S. buyback yields are now broadly in line with global peers, reducing a key pillar of support for earnings per share and valuations.</p>\n<p data-end=\"1189\" data-start=\"1063\">UBS flagged that sector-adjusted price-to-earnings ratios in the U.S. stand about 35% above peers, well above long-term norms.</p>\n<p data-end=\"1475\" data-is-last-node=\"\" data-is-only-node=\"\" data-start=\"1191\">By contrast, emerging markets are seen as benefiting from accelerating global growth, cheaper valuations, and potential dollar weakness. UBS said EM equities offer higher operational leverage, supportive currency dynamics, and improving earnings breadth, reinforcing its overweight stance.</p>\n<p data-end=\"1475\" data-is-last-node=\"\" data-is-only-node=\"\" data-start=\"1191\"><strong>Here are some market tracking funds: </strong><strong>Dow ETFs: </strong>(<a href=\"https://seekingalpha.com/symbol/DIA\" title=\"State Street SPDR Dow Jones Indust Avg ETF Trust\">DIA</a>), (<a href=\"https://seekingalpha.com/symbol/DDM\" title=\"ProShares Ultra Dow30 ETF\">DDM</a>), (<a href=\"https://seekingalpha.com/symbol/UDOW\" title=\"ProShares UltraPro Dow30 ETF\">UDOW</a>), (<a href=\"https://seekingalpha.com/symbol/DOG\" title=\"ProShares Short Dow30 ETF\">DOG</a>), (<a href=\"https://seekingalpha.com/symbol/DXD\" title=\"ProShares UltraShort Dow30 ETF\">DXD</a>), and (<a href=\"https://seekingalpha.com/symbol/SDOW\" title=\"ProShares UltraPro Short Dow30 ETF\">SDOW</a>).<strong>S&amp;P ETFs: </strong>(<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"State Street SPDR S&amp;P 500 ETF Trust\">SPY</a>), (<a href=\"https://seekingalpha.com/symbol/VOO\" title=\"Vanguard 500 Index Fund ETF\">VOO</a>), (<a href=\"https://seekingalpha.com/symbol/IVV\" title=\"iShares Core S&amp;P 500 ETF\">IVV</a>), (<a href=\"https://seekingalpha.com/symbol/RSP\" title=\"Invesco S&amp;P 500 Eql Wght ETF\">RSP</a>), (<a href=\"https://seekingalpha.com/symbol/SSO\" title=\"ProShares Ultra S&amp;P500 ETF\">SSO</a>), (<a href=\"https://seekingalpha.com/symbol/UPRO\" title=\"ProShares UltraPro S&amp;P500 ETF\">UPRO</a>), (<a href=\"https://seekingalpha.com/symbol/SH\" title=\"ProShares Short S&amp;P500 ETF\">SH</a>), (<a href=\"https://seekingalpha.com/symbol/SDS\" title=\"ProShares UltraShort S&amp;P500 ETF\">SDS</a>), and (<a href=\"https://seekingalpha.com/symbol/SPXU\" title=\"ProShares UltraPro Short S&amp;P500 ETF\">SPXU</a>).<strong>Nasdaq ETFs:</strong> (<a href=\"https://seekingalpha.com/symbol/QQQ\" title=\"Invesco QQQ Trust, Series 1 ETF\">QQQ</a>), (<a href=\"https://seekingalpha.com/symbol/QLD\" title=\"ProShares Ultra QQQ ETF\">QLD</a>), (<a href=\"https://seekingalpha.com/symbol/TQQQ\" title=\"ProShares UltraPro QQQ ETF\">TQQQ</a>), (<a href=\"https://seekingalpha.com/symbol/QID\" title=\"ProShares UltraShort QQQ ETF\">QID</a>), and (<a href=\"https://seekingalpha.com/symbol/SQQQ\" title=\"ProShares UltraPro Short QQQ ETF\">SQQQ</a>).</p>\n<p data-end=\"1475\" data-is-last-node=\"\" data-is-only-node=\"\" data-start=\"1191\"><strong>Here are some Emerging Market ETFs: </strong>(<a href=\"https://seekingalpha.com/symbol/IEMG\" title=\"iShares Core MSCI Emerging Markets ETF\">IEMG</a>), (<a href=\"https://seekingalpha.com/symbol/VWO\" title=\"Vanguard Emerging Markets Stock Index Fund ETF\">VWO</a>), (<a href=\"https://seekingalpha.com/symbol/EEM\" title=\"iShares MSCI Emerging Markets ETF\">EEM</a>), (<a href=\"https://seekingalpha.com/symbol/SPEM\" title=\"State Street SPDR Portfolio Emerging Markets ETF\">SPEM</a>), (<a href=\"https://seekingalpha.com/symbol/SCHE\" title=\"Schwab Emerging Markets Equity ETF\">SCHE</a>), and (<a href=\"https://seekingalpha.com/symbol/AVEM\" title=\"Avantis Emerging Markets Equity ETF\">AVEM</a>).</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558761-ubs-cuts-us-equities-to-benchmark-boosts-emerging-markets-on-dollar-and-growth-outlook",
            "pub_date": "2026-02-27 23:31:13",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558768",
            "title": "Laurentian Bank of Canada declares CAD 0.47 dividend",
            "description": "<html><body><ul>\n<li>Laurentian Bank of Canada (LB:CA) declares <a href=\"https://seekingalpha.com/pr/20417652-laurentian-bank-of-canada-declares-dividend-on-its-common-shares\" target=\"_blank\">CAD 0.47/share quarterly dividend</a>, in line with previous.</li>\n<li>Payable May 1; for shareholders of record April 1; ex-div April 1.</li>\n<li><a href=\"https://seekingalpha.com/symbol/LB:CA/dividends?source=news_bullet\">See LB:CA Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558768-laurentian-bank-of-canada-declares-cad-0_47-dividend",
            "pub_date": "2026-02-27 23:31:13",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558765",
            "title": "Amneal outlines 2026 guidance with 12% to 24% EPS growth target, signals acceleration in affordable medicines",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Amneal Pharmaceuticals (AMRX) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Chirag Patel, Co-Founder, Co-CEO, President &amp; Director, reported \"2025 was a defining year of excellent execution and portfolio expansion at Amneal,\" highlighting revenue growth of 8%, adjusted EBITDA up 10%, and adjusted EPS rising 43%. He stated the company is advancing toward \"becom[ing] America's #1 affordable medicines company\" and emphasized leadership in complex generics, injectables, and biosimilars.</li>\n<li>Patel indicated that the Affordable Medicines segment experienced an \"exceptional year for approvals and launches, particularly in complex generics and injectables,\" and forecasted meaningful acceleration in revenue growth for this segment in 2026 and 2027.</li>\n<li>In biosimilars, Patel noted, \"With biosimilar Xolair in the review, we remain on track to have 6 biosimilars in the U.S. market by 2027.\" He identified a \"significant long-term opportunity\" as biologic exclusivity periods expire in the coming decade.</li>\n<li>The collaboration with Pfizer on GLP-1s was described as \"progressing well,\" with Amneal providing manufacturing expertise and retaining marketing rights for 18 countries, including India and Southeast Asia.</li>\n<li>CREXONT, the specialty Parkinson’s therapy, reached 23,000 patients and over 3% market share, with peak U.S. sales potential stated as $300 million to $500 million. The new Brekiya auto-injector for migraine and cluster headache was launched in Q4 and is expected to reach peak sales of $50 million to $100 million.</li>\n<li>Chintu Patel, Co-Founder, Co-CEO &amp; Director, credited operational excellence and portfolio innovation, announcing that \"in 2025 was an exceptionally strong year\" for complex generics launches and highlighted the entry into inhalation medicines as a new growth platform.</li>\n<li>Anastasios Konidaris, Executive VP &amp; CFO, stated, \"The fourth quarter completed another terrific year for Amneal with strong top and bottom line growth as Q4 revenues grew 11%, adjusted EBITDA grew 13% and adjusted EPS grew 75%.\" He reported operating cash flow for the year of $340 million and reduction in net leverage to 3.5x.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Konidaris provided 2026 guidance with expected total company revenue of $3.05 billion to $3.15 billion, representing 1% to 4% growth, adjusted EBITDA growth of 5% to 10%, and adjusted EPS growth of 12% to 24% ($0.93 to $1.03).</li>\n<li>He forecasted Affordable Medicines segment growth of 7% to 8% in 2026, with revenue acceleration supported by new product approvals.</li>\n<li>Specialty segment revenues are projected to be flat in 2026, attributed to CREXONT growth offset by expected generic erosion of RYTARY, but growth is anticipated to resume in 2027 as branded products gain traction.</li>\n<li>Health Care segment revenue is expected between $625 million and $700 million in 2026, down from $745 million in 2025, described as a \"reset level\" due to loss of exclusivity for a key generic product and a shift away from low-margin distribution business.</li>\n<li>Adjusted gross margins are expected to exceed 44% in 2026, with operating cash flow guidance of $325 million to $375 million.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Q4 revenues were reported at $814 million. Affordable Medicines segment revenue was \"essentially flat to $437 million\" due to timing of launches. Specialty revenues increased 38% year-over-year to $167 million, driven by CREXONT, RYTARY, UNITHROID, and initial Brekiya sales. Health Care revenues grew 24% to $211 million, with about $50 million in Q4 from a significant new product line.</li>\n<li>Q4 adjusted EBITDA reached $175 million, and Q4 EPS was $0.21. Full-year 2025 revenue was $3 billion, adjusted EBITDA was $688 million, and adjusted EPS was $0.83. Adjusted gross margin expanded to approximately 43% for the year.</li>\n<li>Net leverage reduced from 3.9x at end of 2024 to 3.5x at end of 2025. Interest expense for 2025 was $217 million, down from $256 million in 2024.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Christopher Schott, JPMorgan: Asked about CREXONT market response post-Phase IV data and 2026 revenue/market share targets. Chirag Patel replied, \"Phase IV...showing 3.13 hours of 'Good On' time...80% of the IR patients are converting to CREXONT,\" and expects to \"more than double the revenue\" and reach 6%+ market share in 2026.</li>\n<li>Schott followed up on Health Care segment 2026 guidance. Konidaris explained the revenue decline is due to \"pivot away from distribution\" and competition for a previously exclusive generic, but said, \"the bottom line is not going to be impacted because...there is other more profitable parts of the business.\"</li>\n<li>Matthew Dellatorre, Goldman Sachs: Inquired about the Pfizer GLP-1 partnership and business development strategy. Chirag Patel responded, \"Facilities actually accelerated in manufacturing...we continue to have the marketing rights for 18 countries,\" and capital allocation will focus on biosimilar vertical integration first.</li>\n<li>David Amsellem, Piper Sandler: Probed on generic Omnipaque and Xolair biosimilar opportunities. Patel said, \"Iohexol...will pick up\" as more strengths are approved, while Xolair is expected to achieve \"immediate bump in the cells\" through private label channels.</li>\n<li>Leszek Sulewski, Truist Securities: Asked about CREXONT persistence and pricing. Patel stated, \"Our gross to net runs is typical in this category, about 40% to 45%.\" Joe Renda, Senior VP, added that CREXONT persistence \"is surpassing that of RYTARY.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on market share gains, new launches, and segment-specific growth dynamics, with a generally positive to slightly positive tone reflected in questions about CREXONT adoption, Health Care profitability, and biosimilar opportunities.</li>\n<li>Management maintained a confident and optimistic tone in both prepared remarks and responses, frequently referencing momentum, robust pipelines, and operational achievements. Phrases such as \"we are very excited\" and \"we remain confident\" were common. Management was more detailed and enthusiastic about future growth in this quarter compared to the prior quarter.</li>\n<li>Compared to Q3 2025, both analysts and management appear more focused on execution of new launches, with increased confidence in pipeline progression and cost controls.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance language evolved from general optimism in Q3 to specific 2026 targets for revenue, EBITDA, and EPS in Q4, and a more detailed focus on Affordable Medicines acceleration.</li>\n<li>Strategic focus shifted toward biosimilar vertical integration and GLP-1 manufacturing, with more explicit capital allocation priorities discussed in Q4.</li>\n<li>Analysts in Q4 concentrated on quantifying specialty product uptake, segment profitability, and competitive positioning, whereas Q3 questions were broader regarding partnerships and regulatory changes.</li>\n<li>Key metrics such as Q4 revenue, adjusted EPS, and gross margin all showed sequential improvement, with more explicit quantification in Q4. Management’s tone reflected greater conviction in sustaining growth, particularly as the company highlighted new launches and cost efficiency gains.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management identified competitive pressures in Health Care from loss of exclusivity on a key generic product and intentional reduction of low-margin distribution business.</li>\n<li>Supply chain complexity and competition were highlighted for new launches like Iohexol, with management noting the need to build capacity and secure approvals for all strengths.</li>\n<li>Analysts raised questions about potential outcomes from the Pfizer GLP-1 partnership and the impact of competitive dynamics in both biosimilars and specialty therapies.</li>\n<li>Management’s mitigation strategies include a focus on higher-margin business, operational cost controls, and targeted investment in vertical integration for biosimilars.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Amneal’s management underscored a year of robust execution and portfolio expansion, setting explicit 2026 targets for revenue and earnings growth. The company is leveraging multiple growth drivers—most notably specialty launches like CREXONT, new biosimilars, and a wave of complex medicines—to accelerate Affordable Medicines performance and offset sector-specific headwinds. With disciplined capital allocation, operational efficiencies, and a strong balance sheet, the company anticipates continued top and bottom line growth, supported by a diversified and innovation-driven portfolio.</p>\n<p><a href=\"https://seekingalpha.com/symbol/amrx/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558765-amneal-outlines-2026-guidance-with-12-percent-to-24-percent-eps-growth-target-signals",
            "pub_date": "2026-02-27 23:25:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558575",
            "title": "Biggest stock movers Friday: NFLX, XYZ, DELL, and more",
            "description": "<html><body><p data-eci=\"true\">Stock futures edged lower on Friday amid ongoing tech sector weakness and hotter-than-expected producer inflation data dragging sentiment.</p>\n<p>Here are some of Friday's biggest stock movers:</p> <h2>Biggest stock gainers</h2> <ul> <li>\n<strong>Block (<a href=\"https://seekingalpha.com/symbol/XYZ\">XYZ</a>) <font color=\"green\">+17%</font></strong> - Shares surged after announcing plans to cut its workforce by about 40%, reducing headcount to just under 6,000 from more than 10,000, with CEO Jack Dorsey citing AI-driven efficiencies. While Q4 results met expectations, the company issued strong guidance. The company expects Q1 gross profit of $2.80B (vs. $2.72B consensus) and adjusted operating income of $600M (vs. $572M est.), and FY2026 gross profit of $12.20B (vs. $11.9B est.) with adjusted operating income of $3.20B (vs. $2.70B est.).</li> <li>\n<strong>Dell Technologies (<a href=\"https://seekingalpha.com/symbol/DELL\">DELL</a>) <font color=\"green\">+18%</font></strong> - Shares jumped after posting a decisive FQ4 beat, with revenue surging 39% Y/T to $33.38B, driven by explosive AI-related demand in its Infrastructure Solutions Group, which grew 73% to $19.6B, including a 342% spike in servers and networking revenue to $9B, while its Client Solutions Group rose 14% to $13.49B. The company also issued significantly stronger-than-expected guidance, projecting Q1 FY2027 adjusted EPS of about $2.90 on revenue of $34.7B–$35.7B vs. estimates of $2.34 and $28.99B. For FY2027, the company expects EPS of roughly $12.90 and revenue of $138B–$142B, both well ahead of consensus. The company also announced a 20% dividend increase and a $10B expansion of its share buyback program, reinforcing confidence in sustained AI-driven growth momentum.</li>\n<li>\n<strong>MARA Holdings (<a href=\"https://seekingalpha.com/symbol/MARA\">MARA</a>) <font color=\"green\">+15%</font></strong> - Shares advanced despite a Q4 miss after announcing an accelerated push into AI and high-performance computing through a strategic partnership with Starwood Capital Group and its data center platform, Starwood Digital Ventures. Under the agreement, MARA will contribute select data center sites while Starwood leads development, tenant sourcing, and operations, targeting hyperscale and AI customers. CEO Fred Thiel called 2026 an inflection point as the company pivots toward next-generation digital infrastructure and enterprise AI capabilities.</li> <li>\n<strong>Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\">NFLX</a>) <font color=\"green\">+9%</font></strong> - Shares rose after the firm confirmed it will not increase its takeover bid for Warner Bros. Discovery (<a href=\"https://seekingalpha.com/symbol/WBD\">WBD</a>), stating that a higher offer was no longer financially attractive after WBD’s board deemed a sweetened all-company proposal from Paramount Skydance superior. The revised bid of $31 per share in cash, up from $30, values WBD at roughly $108B. Netflix added that it plans to invest about $20B this year in films and series while resuming share repurchases under its capital allocation policy. WBD is obligated to pay Netflix a $2.8B breakup fee for terminating their original agreement, helping cushion the strategic setback. Warner Bros. Discovery (<a href=\"https://seekingalpha.com/symbol/WBD\">WBD</a>) fell 2%, while Paramount Skydance (<a href=\"https://seekingalpha.com/symbol/PSKY\">PSKY</a>) was 8% higher.</li> </ul> <h2>Biggest stock losers</h2> <ul> <li>\n<strong>Duolingo (<a href=\"https://seekingalpha.com/symbol/DUOL\">DUOL</a>) <font color=\"red\">-17%</font></strong> - Shares plunged after issuing weaker-than-expected 2026 guidance despite topping Q4 earnings estimates, as management signaled a strategic shift toward prioritizing daily active user growth over near-term profitability. The company is targeting 20% DAU growth and 100M users by 2028, a push expected to pressure margins, with bookings growth projected to slow to 11% this year from the previously anticipated ~20% pace. Adjusted EBITDA margin is forecast to decline to 25%, while Q1 adjusted EBITDA is guided at $73.6M, well below the $84M consensus estimate, amplifying investor concerns about near-term earnings dilution.</li> <li>\n<strong>CoreWeave (<a href=\"https://seekingalpha.com/symbol/CRWV\">CRWV</a>) <font color=\"red\">-16%</font></strong> - Shares fell after posting mixed Q4 results and outlining an aggressive 2026 investment plan, even as management highlighted surging demand and backlog growth. Revenue backlog expanded to $66.8B, more than quadrupling Y/Y, while the company said it became the fastest cloud provider to reach $5B in annual revenue. For 2026, CoreWeave guided to $12B–$13B in revenue (around the $12.55B consensus) and adjusted operating income of $900M–$1.1B, with margins expected to ramp from low single digits in Q1 back to low double digits by Q4 as capacity scales. However, heavy CapEx of $30B–$35B and plans to double active power capacity to over 1.7 gigawatts by year-end appeared to weigh on shares despite strong long-term visibility.</li> <li>\n<strong>Zscaler (<a href=\"https://seekingalpha.com/symbol/ZS\">ZS</a>) <font color=\"red\">-14%</font></strong> - Shares dipped even after the cybersecurity company posted fiscal second-quarter results and guidance that topped Wall Street's estimates. The company forecast FQ3 adjusted EPS of $1.00–$1.01 on revenue of $834M–$836M, both above consensus. The company lifted its full-year revenue outlook to $3.309B–$3.322B from $3.282B–$3.301B previously, ahead of estimates, while annual recurring revenue is now seen at $3.73B–$3.745B and adjusted EPS at $3.99–$4.02, both topping consensus.</li>\n<li>\n<strong>Kratos Defense &amp; Security Solutions (KTOS) <font color=\"red\">-7%</font></strong> - Shares slipped after pricing an underwritten offering of approximately 14.29M shares at $84.00 per share, with expected net proceeds of about $1.17B. The underwriters were granted a 30-day option to purchase up to an additional 2.14M shares, and all shares in the offering are being sold by the company, with the transaction slated to close on March 2, 2026.</li> </ul> <div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558575-biggest-stock-movers-friday-nflx-xyz-dell-and-more",
            "pub_date": "2026-02-27 23:25:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558744",
            "title": "Las Vegas Strip gaming revenue tumbles amid international tourism slump, high pricing",
            "description": "<html><body><p data-eci=\"true\">Gaming win on the Las Vegas Strip fell 11.0% in January to $747.7M on a year-over-year comparison. The report from the Nevada Gaming Control Board once again confirmed that pricing concerns and the sharp decline in international tourism are impacting the Las Vegas Strip. The gambling mecca has now recorded three straight months of a year-over-year gaming win decline.</p>\n<p>Statewide gaming win was down 6.6% year-over-year in December to $1.35B. Downtown Las Vegas casinos saw gaming win decrease 5.2% during the month to $79.4 million. Meanwhile, Reno casinos reported gaming win increased 2.9% during the month to $69.1 million.</p>\n<p>On a fiscal year-to-date basis (July 2025-January 2026), Nevada gaming win was up only 0.7%, despite an event calendar seen as favorable for conventions and tourism.</p>\n<p><strong>Sector watch:</strong> Caesars Entertainment (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CZR\" title=\"Caesars Entertainment, Inc.\">CZR</a></span>), MGM Resorts (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MGM\" title=\"MGM Resorts International\">MGM</a></span>), Boyd Gaming (<a href=\"https://seekingalpha.com/symbol/BYD\" title=\"Boyd Gaming Corporation\">BYD</a>), Wynn Resorts (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/WYNN\" title=\"Wynn Resorts, Limited\">WYNN</a></span>), Full House Resorts (<a href=\"https://seekingalpha.com/symbol/FLL\" title=\"Full House Resorts, Inc.\">FLL</a>), Bally's Corporation (<a href=\"https://seekingalpha.com/symbol/BALY\" title=\"Bally's Corporation\">BALY</a>), VICI Properties (<a href=\"https://seekingalpha.com/symbol/VICI\" title=\"VICI Properties Inc.\">VICI</a>), Sportradar (<a href=\"https://seekingalpha.com/symbol/SRAD\" title=\"Sportradar Group AG\">SRAD</a>), Genius Sports (<a href=\"https://seekingalpha.com/symbol/GENI\" title=\"Genius Sports Limited\">GENI</a>), Gaming &amp; Leisure Properties (<a href=\"https://seekingalpha.com/symbol/GLPI\" title=\"Gaming and Leisure Properties, Inc.\">GLPI</a>), and Red Rock Resorts (<a href=\"https://seekingalpha.com/symbol/RRR\" title=\"Red Rock Resorts, Inc.\">RRR</a>).</p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558744-las-vegas-strip-gaming-revenue-tumbles-amid-international-tourism-slump-high-pricing",
            "pub_date": "2026-02-27 23:16:43",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558731",
            "title": "Ambarella cascades due to GoPro's patent victory despite posting solid Q4 results: analysts",
            "description": "<html><body><p data-eci=\"true\">Ambarella's (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/AMBA\" title=\"Ambarella, Inc.\">AMBA</a></span>) fourth quarter fiscal 2026 <a href=\"https://seekingalpha.com/news/4558196-ambarella-non-gaap-eps-of-0_13-beats-by-0_03-revenue-of-100_9m-beats-by-0_73m\" target=\"_blank\" title=\"results\">results</a> and first quarter outlook topped market expectations, but shares had tumbled 18% during morning market action on Friday due to a U.S. International Trade Commission decision.</p>\n<p>On Thursday, the U.S. ITC <span>upheld the administrative law judge's earlier ruling that Insta360 imported and sold products in </span><span>the United States</span><span> that infringe on GoPro's (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GPRO\" title=\"GoPro, Inc.\">GPRO</a></span>) intellectual property.</span></p>\n<p><span>GoPro shares had jumped 11%.</span></p>\n<p><span>Ambarella provides the advanced AI signal processor system-on-chip technology that drives Insta360's cameras.</span></p>\n<p>\"AMBA reported in-line results and solid FY27 guidance; however, the stock was down AMC following an ITC Final Determination against Insta360,\" said Needham analysts, led by N. Quinn Bolton, in a Friday investor note.</p>\n<p>However, the analysts at Oppenheimer do not expect the ruling to have any effect on Ambarella's fiscal 2027 outlook.</p>\n<p>\"This ruling effectively will lead to an 'important ban' on certain cameras/systems that infringe GoPro's design patent,\" said Oppenheimer analyst Martin Yang in a note. \"The ruling and its vague language caused panic selling in AMBA after hours. We believe the reaction is unjustified.\"</p>\n<p>\"We expect the ITC final ruling on GoPro/Insta360 to have no impact on AMBA's revenue outlook, given that the banned products from Insta360 are already obsolete in the US market,\" Yang added.</p>\n<p>Oppenheimer retained its Perform rating on Ambarella.</p>\n<p>Meanwhile, Needham reiterated its Buy rating and $100 price target on the stock.</p>\n<p>\"Ambarella guided FY27 revenue to increase +10-15% Y/Y, above our prior estimate of +9% Y/Y,\" Bolton said. \"Growth will be fueled by a combination of increased unit shipments and rising ASPs across new products. The company's CV75 and CV72 SoCs reached a high single-digit percentage of revenue in F4Q26 and are anticipated to further accelerate in FY27. Additionally, Automotive and IoT are both expected to grow Y/Y. The company guided FY27 NG gross margin to remain in its long-term range of 59-62%. We now model FY27 revenue growth of +12.6% Y/Y and NG GM of 59.8%. We model IoT and Automotive growing +12% Y/Y and +16% Y/Y, respectively.\"</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558731-ambarella-cascades-due-to-gopros-patent-victory-despite-posting-solid-q4-results-analysts",
            "pub_date": "2026-02-27 23:16:43",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558759",
            "title": "Black Diamond Group reports Q4 results",
            "description": "<html><body><ul>\n<li>Black Diamond Group <a href=\"https://seekingalpha.com/pr/20416850-black-diamond-reports-strong-fourth-quarter-and-year-end-results-and-declares-dividend\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BDIMF\" title=\"Black Diamond Group Limited\">BDIMF</a></span>): Q4 FFO of $0.57</li>\n<li>Revenue of $144M.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558759-black-diamond-group-reports-q4-results",
            "pub_date": "2026-02-27 23:11:16",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558760",
            "title": "Atrium Mortgage Investment Non-GAAP EPS of $1.03, revenue of $85.1M",
            "description": "<html><body><ul>\n<li>Atrium Mortgage Investment <a href=\"https://seekingalpha.com/pr/20416867-atrium-mortgage-investment-corporation-reports-strong-2025-annual-results-declares-0_10\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/AMIVF\" title=\"Atrium Mortgage Investment Corporation\">AMIVF</a></span>): FY Non-GAAP EPS of $1.03.</li>\n<li>Revenue of $85.1M.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558760-atrium-mortgage-investment-non-gaap-eps-of-1_03-revenue-of-85_1m",
            "pub_date": "2026-02-27 23:11:16",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558756",
            "title": "Pason Systems reports Q4 results",
            "description": "<html><body><ul>\n<li>Pason Systems <a href=\"https://seekingalpha.com/pr/20416912-pason-reports-fourth-quarter-2025-results-and-declares-quarterly-dividend\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/PSYTF\" title=\"Pason Systems Inc.\">PSYTF</a></span>): Q4 FFO of $0.11</li>\n<li>Revenue of $108.7M.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558756-pason-systems-reports-q4-results",
            "pub_date": "2026-02-27 23:06:03",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558723",
            "title": "As Block rallies, just 3 fintech stocks hold A-rated momentum grades",
            "description": "<html><body><p data-eci=\"true\">Block's (<a href=\"https://seekingalpha.com/symbol/XYZ\" title=\"Block, Inc.\">XYZ</a>) rally on Friday is putting payment fintechs in the spotlight, though momentum remains scarce. A screen of transaction and payment processing services stocks shows just three names with A-rated momentum grades.</p>\n<p>The Jack Dorsey-led company saw its shares surge double-digits after announcing that <span>would </span><a href=\"https://seekingalpha.com/news/4558139-block-stock-soars-20-after-slashing-headcount-delivering-strong-2026-guidance#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" rel=\"noopener\" target=\"_blank\" title=\"slashing its headcount\">slash its headcount</a><span> to just under 6K from 10K, with Dorsey attributing the drastic change to AI.</span> In addition, Block (<a href=\"https://seekingalpha.com/symbol/XYZ\" title=\"Block, Inc.\">XYZ</a>) <span>issued strong</span><span> guidance for 2026 and the first quarter of the year, and Q4 earnings merely<span> matched the Wall Street consensus.</span></span></p>\n<p><span><span>Against that backdrop, momentum leadership within payments remains highly concentrated. Only three stocks currently carry A-rated momentum grades: Sezzle (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SEZL\" title=\"Sezzle Inc.\">SEZL</a></span></span></span>), StoneCo (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/STNE\" title=\"StoneCo Ltd.\">STNE</a></span></span></span>) and NCR Alteos Corp. (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NATL\" title=\"NCR Atleos Corporation\">NATL</a></span></span></span>). Each stock in the group is up at least 10% year-to-date and holds an overall Quant rating of Hold. XYZ, by comparison, is still down around 3% YTD and carries an <a href=\"https://seekingalpha.com/symbol/XYZ/ratings/quant-ratings\" target=\"_blank\" title=\"overall Quant rating\">overall Quant rating</a> of Hold.</span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558723-as-block-rallies-just-3-fintech-stocks-hold-a-rated-momentum-grades",
            "pub_date": "2026-02-27 23:06:03",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}