{
    "data": [
        {
            "id": "4402817",
            "title": "Roche's Susvimo gets FDA approval for diabetic macular edema",
            "description": "<html><body><p dir=\"ltr\">Roche's (<a href=\"https://seekingalpha.com/symbol/RHHBY\" title=\"Roche Holding AG\">OTCQX:RHHBY</a>) Genentech unit has received FDA approval for its drug Susvimo 100 mg/mL injection for the treatment of diabetic macular edema, a leading cause of blindness for people with diabetes.</p> <p dir=\"ltr\">Susvimo, also known as ranibizumab injection, was first approved by the<span class=\"paywall-full-content invisible\"> FDA for the treatment of wet age-related macular degeneration in 2021.</span></p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1286971245/image_1286971245.jpg",
            "link": "https://seekingalpha.com/news/4402817-roches-susvimo-gets-fda-approval-for-diabetic-macular-edema",
            "pub_date": "2025-02-04 20:28:54",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402895",
            "title": "TransDigm projects $8.85B fiscal 2025 revenue with steady aftermarket growth",
            "description": "<html><body><p>Earnings Call Insights: TransDigm Group Incorporated (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TDG\" title=\"TransDigm Group Incorporated\">TDG</a></span>) Q1 2025</p> <h3>Management View</h3> <ul> <li><p>Kevin Stein, President &amp; CEO, highlighted a strong start to fiscal 2025, driven by robust growth in commercial aftermarket and defense revenues. Commercial OEM revenues were down slightly, impacted by supply chain disruptions and a machinist<span class=\"paywall-full-content invisible\"> strike at Boeing. He emphasized the company's focus on shareholder value creation through proprietary aerospace products and aftermarket revenues.</span></p></li> <li class=\"paywall-full-content invisible\"><p>Stein noted that TransDigm deployed $300 million for share repurchases in Q1, buying approximately 250,000 shares at an average price of $1,249 per share, aligning with long-term return objectives.</p></li> <li class=\"paywall-full-content invisible\"><p>CFO Sarah Wynne stated, \"Free cash flow was over $800 million for the quarter,\" attributing it to strong operational performance and timing of interest and tax payments. She confirmed fiscal 2025 free cash flow guidance remains at $2.3 billion.</p></li> <li class=\"paywall-full-content invisible\"><p>Joel Reiss, Co-COO, reported sequential and year-over-year bookings growth across all market channels, with commercial aftermarket revenue increasing 9% compared to the prior year.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li><p>The company reaffirmed fiscal 2025 guidance, projecting $8.85 billion in revenue, reflecting 11% growth. EBITDA is expected to reach $4.685 billion, up 12%, with a margin of 52.9%.</p></li> <li><p>Market channel growth assumptions include mid-single-digit growth in commercial OEM, high single-digit to low double-digit growth in commercial aftermarket, and high single-digit growth in defense.</p></li> <li><p>Adjusted EPS guidance was raised slightly to $36.47, reflecting share repurchases.</p></li> <li><p>Management reiterated that uncertainty around Boeing's production ramp-up remains a risk factor but maintained guidance given the current market fundamentals.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li><p>The company reported strong EBITDA margin performance at 52.9% in Q1, supported by a favorable commercial aftermarket mix and productivity initiatives.</p></li> <li><p>Free cash flow exceeded $800 million due to operational efficiencies and timing of payments. Cash on hand was approximately $2.5 billion at the end of the quarter.</p></li> <li><p>Commercial aftermarket revenues grew 9% year-over-year, supported by strong passenger air traffic and increased demand for engine-related products. Defense revenues also rose by 11%.</p></li> <li><p>Commercial OEM revenues declined by 4% year-over-year due to the Boeing machinist strike and supply chain delays.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Myles Walton, Wolf Research, asked about sequential EBITDA margin improvements. Sarah Wynne explained it was driven by a mix shift toward higher-margin commercial aftermarket and productivity initiatives. She noted the mix effect was significant in Q1.</p></li> <li><p>Noah Poponak, Goldman Sachs, questioned the flat margin guidance for the remainder of the year. Kevin Stein stated it reflects conservatism and the impact of acquisitions, which average down margins by approximately 1%.</p></li> <li><p>Robert Stallard, Vertical Research, inquired about submarket growth within the aftermarket. Stein pointed to freight as a lagging submarket but noted signs of stabilization.</p></li> <li><p>Jason Gursky, Citi, asked about refurbishment activity. Joel Reiss stated that interiors remain below 2019 levels due to constrained airline fleet planning, but noted that refurbishment would pick up as OEM deliveries improve.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Analysts expressed slight skepticism regarding OEM production recovery and margin stability, particularly in relation to Boeing’s performance.</p></li> <li><p>Management maintained a slightly positive tone, emphasizing operational resilience and confidence in achieving guidance. Kevin Stein remarked that \"we remain focused on our value drivers\" and highlighted improvements in supply chain dynamics.</p></li> <li><p>Compared to prior commentary, management appeared more cautious about OEM recovery timelines but remained firm on guidance.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"><li>No previous quarter transcript was available for comparison.</li></ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management highlighted ongoing challenges with Boeing’s machinist strike and its lingering supply chain effects, which could delay OEM production recovery.</p></li> <li><p>Analysts raised concerns about inventory unwinds and their impact on OEM revenues. Management acknowledged limited visibility into OEM inventory levels but indicated preparedness for fluctuations.</p></li> <li><p>Interiors in the aftermarket remain below pre-pandemic levels, with refurbishment activity delayed by constrained fleet availability.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">TransDigm Group started fiscal 2025 on a strong note, driven by robust growth in commercial aftermarket and defense revenues. Management reaffirmed full-year guidance of $8.85 billion in revenue and $4.685 billion in EBITDA while raising adjusted EPS expectations to $36.47. Despite uncertainties surrounding OEM production and refurbishment activity, the company remains confident in achieving its targets, supported by strong cash flow generation and a focus on capital allocation through share buybacks and M&amp;A opportunities.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/TDG/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402895-transdigm-projects-8_85b-fiscal-2025-revenue-with-steady-aftermarket-growth",
            "pub_date": "2025-02-04 20:29:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402799",
            "title": "Sen. Hagerty said to propose stablecoin bill for clear regulatory framework",
            "description": "<html><body><p>Senator Bill Hagerty (R-TN) is reportedly set to unveil a bill Tuesday that would create comprehensive regulatory guidelines for stablecoins, aligning with the GOP's push to foster a crypto-friendly environment under President Donald Trump.</p> <p>Stablecoins like tether (<a href=\"https://seekingalpha.com/symbol/USDT-USD\" title=\"Tether USD\">USDT-USD</a>) USDC (<a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/USDC-USD\" title=\"USCoin USD\">USDC-USD</a><span class=\"paywall-full-content invisible\">) and are a type of cryptocurrency designed to keep a steady value by being pegged to the U.S. dollar (or another stable asset). </span></p> <p class=\"paywall-full-content invisible\">“My legislation establishes a safe and pro-growth regulatory framework that will unleash innovation and advance the President’s mission to make America the world capital of crypto,” Hagerty said in a statement, Bloomberg reported.</p> <p class=\"paywall-full-content invisible\">The proposed Guiding and Establishing National Innovation for US Stablecoins — or GENIUS Act — lays out regulations for the issuance of stablecoin payments to back stablecoin payments with assets such as Federal Reserve notes and Treasury bills, <a href=\"https://www.bloomberg.com/news/articles/2025-02-04/new-stablecoin-bill-pushed-as-trump-sets-crypto-friendly-agenda?utm_content=markets&amp;cmpid%3D=socialflow-twitter-markets&amp;utm_campaign=socialflow-organic&amp;utm_source=twitter&amp;utm_medium=social\" rel=\"noopener\" target=\"_blank\" title=\"Bloomberg\">Bloomberg</a> explained, citing a draft bill.</p> <p class=\"paywall-full-content invisible\">If approved, the legislation will require stablecoin issuers to disclose monthly audited reports regarding their reserve mix. The <a href=\"https://seekingalpha.com/news/3891187-tether-reduces-commercial-debt-reserves-to-zero-replaces-with-t-bills\" rel=\"noopener\" target=\"_blank\" title=\"quality of reveres\">quality of reveres</a> that back stablecoins have drawn increased regulatory scrutiny in recent years, amid concerns about the liquidity of certain reserves in the event of market pressures.</p> <p class=\"paywall-full-content invisible\"><strong id=\"docs-internal-guid-25ff3fe7-7fff-11e6-47f1-aa6e22766927\">Dear readers: </strong>We recognize that politics often intersects with the financial news of the day, so we invite you to <a href=\"https://seekingalpha.com/article/4752436-politics-and-the-markets-020425\" rel=\"noopener\" target=\"_blank\" title=\"click here\">click here</a> to join the separate political discussion.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1489201893/image_1489201893.jpg",
            "link": "https://seekingalpha.com/news/4402799-sen_-hagerty-said-to-propose-stablecoin-bill-for-clear-regulatory-framework",
            "pub_date": "2025-02-04 20:15:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402852",
            "title": "ADM outlines $2B portfolio simplification opportunities amid cost management push",
            "description": "<html><body><p>Earnings Call Insights: Archer-Daniels-Midland Company (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ADM\" title=\"Archer-Daniels-Midland Company\">ADM</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>Juan Luciano, Chair of the Board and CEO, highlighted that ADM reported Q4 adjusted EPS of $1.14 and full-year adjusted EPS of $4.74, aligning with the midpoint of guidance. Total segment operating profit for Q4 reached $1.1B, with<span class=\"paywall-full-content invisible\"> full-year operating profit at $4.2B.</span> </li> <li class=\"paywall-full-content invisible\">Luciano emphasized operational improvements, such as record crush volumes in LATAM and enhanced performance in Starches &amp; Sweeteners, which achieved 3% higher production year-over-year. Two flavors acquisitions were successfully integrated, contributing to the EMEA region's performance.</li> <li class=\"paywall-full-content invisible\">ADM announced targeted cost reductions of $500M to $750M over the next three to five years, including $200M to $300M planned for 2025. This involves reducing 600 to 700 roles, realigning efforts, and identifying structural savings.</li> <li class=\"paywall-full-content invisible\">The company disclosed $2B in portfolio simplification opportunities, including potential divestitures and closures of underperforming assets or those with excess capacity.</li> <li class=\"paywall-full-content invisible\">CFO Monish Patolawala noted that while Q4 played out as expected, December faced pressure from unfavorable crush margins and higher manufacturing costs. The AS&amp;O segment operating profit declined by 32% year-over-year.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management expects a challenging first-half of 2025, with significantly lower soybean and canola crush margins. Soybean crush margins are projected between $45 to $55 per ton, down $5 per ton year-over-year, while canola crush margins are expected to range from $50 to $70 per ton, down $20 per ton.</li> <li>Patolawala stated that operational improvements and cost savings are expected to mitigate some market headwinds. For the full year, AS&amp;O segment performance is anticipated to be \"below to similar\" to 2024 levels.</li> <li>Nutrition segment operating profits are forecasted to improve in 2025, driven by stronger performance in Flavors and Animal Nutrition, alongside cost optimization. However, Q1 2025 is expected to remain under pressure due to ongoing challenges at the Decatur East facility.</li> <li>Adjusted EPS for 2025 is projected between $4.00 and $4.75, reflecting lower margins but offset by $200M to $300M in cost savings.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 adjusted EPS was $1.14, slightly below analysts' estimates of $1.15. Revenues for the quarter were not explicitly mentioned in the transcript.</li> <li>The AS&amp;O segment reported a Q4 operating profit of $644M, down 32% year-over-year, driven by weaker crush margins and higher costs. Full-year operating profit for the segment fell 40% compared to 2023.</li> <li>Carbohydrate Solutions' Q4 operating profit was flat year-over-year, supported by robust demand for ethanol and strong North American starches and sweeteners margins, partially offset by weaker EMEA results.</li> <li>Nutrition achieved Q4 operating profit of $88M, supported by improved mix and insurance recoveries. However, organic revenues in the segment declined due to demand challenges and higher manufacturing costs.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Tom Palmer, Citi: Questioned the expected recovery in nutrition profits in 2025. CEO Luciano explained that improvements would stem from the Decatur East facility resuming operations, strong growth in Flavors and Biotics, and margin improvements in Animal Nutrition.</li> <li>Andrew Strelzik, BMO: Asked about vegetable oil demand post-45Z guidance. Luciano noted expectations of a 5% increase in soybean oil's share of feedstock while emphasizing policy clarity's importance for stabilizing margins.</li> <li>Ben Theurer, Barclays: Sought clarification on the AS&amp;O segment’s expected Q1 decline. CFO Patolawala cited lower crush margins and reduced insurance proceeds but highlighted operational efficiencies expected to improve results later in the year.</li> <li>Heather Jones, Heather Jones Research: Inquired about potential cost recoveries in 2025. Patolawala estimated insurance proceeds would range between $50M to $100M in 2025 from the Decatur East incident.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed concerns over weak Q1 projections and the impact of policy uncertainties, highlighting skepticism about margin recoveries and operational headwinds.</li> <li>Management maintained a cautiously optimistic tone, emphasizing internal cost controls, portfolio simplification, and operational improvements as key levers for navigating a challenging environment.</li> <li>Compared to the previous quarter, management displayed consistent confidence in addressing operational inefficiencies, while analysts remained focused on unresolved headwinds and policy-related risks.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance for adjusted EPS was narrowed to $4.00-$4.75 for 2025, reflecting a more conservative outlook compared to the $4.50-$5.00 guidance from Q3 2024.</li> <li>Management’s focus shifted towards identifying $2B in portfolio opportunities, a new strategic initiative not emphasized in the prior quarter.</li> <li>The tone during Q4 was slightly more defensive, with management highlighting uncertainties in biofuel policies and trade environments compared to the broader optimism expressed in Q3.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Trade policy uncertainties with China and Canada could impact crush margins and export volumes.</li> <li>Regulatory ambiguities surrounding biofuel policies, including the 45Z guidance, add volatility to soybean oil demand.</li> <li>Ongoing operational challenges at the Decatur East facility continue to weigh on the Nutrition segment.</li> <li>Lower insurance recoveries in 2025 and cost pressures from inflation and manufacturing inefficiencies pose additional risks.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">ADM is navigating a challenging operating environment with a focus on cost management, operational improvements, and strategic portfolio simplification. While near-term headwinds, including weaker margins and policy uncertainties, weigh on the outlook, management’s emphasis on $2B in portfolio opportunities and targeted cost savings of up to $750M positions the company for long-term shareholder value creation.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/ADM/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402852-adm-outlines-2b-portfolio-simplification-opportunities-amid-cost-management-push",
            "pub_date": "2025-02-04 20:06:38",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402834",
            "title": "Cabot projects $7.40-$7.80 EPS for FY2025 amid growth in performance chemicals",
            "description": "<html><body><p>Earnings Call Insights: Cabot Corporation (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CBT\" title=\"Cabot Corporation\">CBT</a></span>) Q1 2025</p> <h3>Management View</h3> <ul> <li>CEO Sean Keohane emphasized strong execution despite a mixed economic environment, reporting adjusted EPS of $1.76 for Q1 2025, a 13% increase year-over-year. EBIT in Reinforcement Materials grew 1%, while Performance Chemicals saw a 32% rise due<span class=\"paywall-full-content invisible\"> to higher volumes and demand stabilization.</span> </li> <li class=\"paywall-full-content invisible\">The company generated $124 million in operating cash flow, with $77 million invested in growth projects, including new capacity in Indonesia for Reinforcement Materials and battery materials in China. $66 million was returned to shareholders through share repurchases and dividends.</li> <li class=\"paywall-full-content invisible\">CFO Erica McLaughlin highlighted a strong liquidity position of $1.3 billion and a net debt-to-EBITDA ratio of 1.3x. Capital expenditures for FY2025 are expected to be in the range of $250 million to $300 million.</li> <li class=\"paywall-full-content invisible\">Keohane reaffirmed Cabot’s long-term growth strategy centered on the \"Creating for Tomorrow\" pillars of grow, innovate, and optimize, targeting an adjusted EPS CAGR of 7%-10% over the next three years.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management reaffirmed FY2025 adjusted EPS guidance of $7.40 to $7.80, supported by stable Reinforcement Materials EBIT and growth in Performance Chemicals. Performance Chemicals is expected to maintain quarterly EBIT in the $45 million to $55 million range.</li> <li>Demand for infrastructure-related products, especially in wind energy and power distribution cables, is projected to drive growth, while auto-related sales are expected to align with flat global tire production levels.</li> <li>The company anticipates a gradual ramp-up of its Indonesia Reinforcement Materials capacity in the latter half of FY2025, with significant contributions expected in FY2026.</li> <li>Tariffs on US-Mexico-China trade are being assessed. The direct impact is expected to be minimal, but downstream effects on demand remain under evaluation.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Adjusted EPS for Q1 2025 was $1.76, up from $1.56 in Q1 2024, driven by EBIT growth in both business segments.</li> <li>Reinforcement Materials reported EBIT of $130 million, benefiting from higher volumes and favorable pricing but offset by a less favorable geographic mix and lower energy center revenue. Performance Chemicals’ EBIT improved by $11 million year-over-year, supported by an 8% volume increase.</li> <li>Total operating cash flow was $124 million, with discretionary free cash flow at $114 million. Shareholder returns included $24 million in dividends and $42 million in share repurchases.</li> <li>The operating tax rate for Q1 2025 was 28%, with the full-year tax rate expected to range between 27%-29%.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Chris Perrella, UBS: Asked about Reinforcement Materials contract terms and volumes. CEO Keohane explained base prices remained flat year-over-year, with volume increases in Europe offset by challenges in the Americas due to Asian tire imports. He noted modest EBIT gains in H2 2025 from Indonesia capacity.</li> <li>John Roberts, Mizuho: Inquired about the impact of rising oil prices on specialty blacks. Keohane indicated adjustments in spot pricing to maintain margins while emphasizing the company’s track record of margin management.</li> <li>Lydia Huang, J.P. Morgan: Queried drivers of Performance Chemicals’ 8% volume growth. CFO McLaughlin attributed growth primarily to fumed metal oxide products, which saw a 20% increase, and carbons and compounds, which grew by 5%-6%.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed cautious optimism, focusing on global demand shifts, margin management, and tariff impacts. Concerns centered on competitive pressures in the Americas and the outlook for tire production.</li> <li>Management maintained a confident tone during prepared remarks, emphasizing strategic execution and growth opportunities. However, during Q&amp;A, responses were more defensive, addressing challenges in Reinforcement Materials and trade dynamics.</li> <li>Compared to Q4 2024, both management and analysts displayed consistent confidence in long-term strategies, with analysts slightly more pressing on near-term risks.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Reinforcement Materials EBIT remained stable, but the Q1 2025 outlook included modest sequential improvement from seasonally higher volumes in Europe, contrasting with Q4 2024’s lower volumes.</li> <li>Performance Chemicals continued its recovery, with EBIT growth driven by demand stabilization and higher-margin applications. Q1 2025 results were stronger than Q4 2024, which had higher maintenance costs.</li> <li>Management's tone reflected continued confidence in strategic execution. Analysts maintained focus on competitive dynamics and cost pressures, similar to prior discussions.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Challenges include the impact of Asian tire imports on North American volumes, potential downstream effects from new tariffs, and competitive pressures in Reinforcement Materials.</li> <li>Management emphasized operational excellence and geographic diversification as mitigation strategies. The company also expects minimal direct impacts from tariffs due to existing agreements allowing cost pass-throughs.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Cabot Corporation delivered strong Q1 2025 results, with a 13% adjusted EPS growth and significant EBIT gains in Performance Chemicals. The company reaffirmed its FY2025 EPS guidance of $7.40 to $7.80, supported by infrastructure-driven demand and operational efficiencies. While competitive pressures and trade dynamics pose challenges, Cabot remains confident in its long-term strategy, underpinned by disciplined capital allocation and targeted capacity expansions in Indonesia and battery materials.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/CBT/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402834-cabot-projects-7_40-7_80-eps-for-fy2025-amid-growth-in-performance-chemicals",
            "pub_date": "2025-02-04 20:02:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402839",
            "title": "Atkore signals $375M-$425M adjusted EBITDA for FY 2025 amid pricing challenges and growth initiatives",
            "description": "<html><body><p>Earnings Call Insights: Atkore Inc. (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ATKR\" title=\"Atkore Inc.\">ATKR</a></span>) Q1 2025</p> <h3>Management View</h3> <ul> <li>CEO Bill Waltz highlighted that Q1 performance met expectations with net sales of $662 million and adjusted EBITDA of $99 million. Adjusted EPS reached $1.63, near the top end of their guidance range. Organic volume declined<span class=\"paywall-full-content invisible\"> 5% due to tough year-over-year comparisons.</span> </li> <li class=\"paywall-full-content invisible\">Waltz noted the company remains on track with growth initiatives related to water and global construction services, with planned contributions later in the year to support PVC and HDPE water products. He emphasized a focus on mitigating pricing pressures and advancing strategic initiatives to expand into new markets.</li> <li class=\"paywall-full-content invisible\">Management reduced their full-year adjusted EBITDA outlook to a midpoint of $400 million, down from previous estimates, citing larger-than-anticipated impacts from competitive pricing pressures in PVC and steel conduit markets.</li> <li class=\"paywall-full-content invisible\">CFO John Deitzer provided additional insights, stating that average selling prices decreased by 12% in Q1, primarily driven by PVC and steel conduit products, and outlined steps to manage costs and improve operational efficiency.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management provided Q2 guidance with net sales expected between $685 million and $715 million, adjusted EBITDA of $85 million to $95 million, and adjusted EPS of $1.30 to $1.50. For FY 2025, full-year adjusted EBITDA is projected in the range of $375 million to $425 million, with adjusted EPS between $5.75 and $6.85.</li> <li>Waltz mentioned that the company expects a stronger performance in the second half of FY 2025 due to seasonal construction activity and ramping up of growth initiatives. The guidance assumes no material benefit from tariffs on imported conduit but acknowledges potential upside if tariffs are enacted.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q1 net sales reached $662 million, with adjusted EBITDA of $99 million and a tax rate of 21%, up from 17.5% in the prior year. Organic volumes declined 5%, and average selling prices fell by 12%, driven primarily by PVC and steel conduit pricing pressures.</li> <li>Metal framing, cable management, and construction services grew mid-single digits, supported by global mega projects. In contrast, plastic pipe and conduit volumes declined mid-single digits, reflecting increased import competition and tough prior-year comparisons.</li> <li>Management highlighted improvements in operational performance at facilities such as Hobart, Indiana, which supported sequential margin gains within the S&amp;I segment.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Andy Kaplowitz, Citigroup, questioned the impact of PVC import competition and sought clarity on the dynamics affecting metal conduit volumes. Bill Waltz explained that PVC imports grew over 20% year-over-year and emphasized that the pricing pressures are factored into the revised guidance, which assumes market normalization to pre-COVID levels by year-end.</li> <li>Deane Dray, RBC, inquired about the drivers of the guidance cut and the contribution of PVC versus steel. CFO Deitzer clarified that approximately 75% of the pricing impact comes from PVC, with the remainder from steel conduit. Waltz added that additional domestic PVC capacity and imports have further pressured prices.</li> <li>Chris Moore, CJS Securities, asked about the fiscal 2025 bottoming outlook. Waltz highlighted ongoing productivity improvements, growth in water-related products, and contributions from global mega projects as key drivers for recovery.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts displayed a slightly negative tone, focusing on pricing pressures and the competitive landscape, particularly in PVC and steel conduit markets. Concerns centered around the company's ability to navigate these headwinds and deliver on revised guidance.</li> <li>Management adopted a cautiously optimistic tone, emphasizing operational improvements and growth initiatives. Waltz expressed confidence in the company's ability to manage challenges, stating, \"We remain committed to executing our strategy to deliver value for shareholders.\"</li> <li>Compared to the previous quarter, sentiment has shifted slightly more negative, reflecting increased competitive pressures and lowered guidance.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance was revised downward, with FY 2025 adjusted EBITDA projections reduced to a midpoint of $400 million from $500 million previously forecasted. This reflects a more cautious outlook on pricing dynamics in PVC and steel conduit markets.</li> <li>Analysts' focus shifted from general growth opportunities to concerns about competitive pressures and pricing sustainability.</li> <li>Management's tone was slightly less confident compared to Q4 2024, with a greater emphasis on mitigating risks and cost management.</li> <li>Growth initiatives such as water-related products and global mega projects remained key strategic priorities, consistent with earlier quarters.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Competitive pricing pressures in PVC and steel conduit markets were highlighted as significant challenges. Waltz cited increased imports and new domestic capacity as key factors.</li> <li>Analysts raised concerns about the ability of the company to stabilize pricing and sustain profitability amid these headwinds.</li> <li>Management outlined mitigation strategies, including cost structure optimization, productivity improvements, and advancing growth initiatives in water and construction services.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Atkore's Q1 2025 results met expectations, but competitive pressures in PVC and steel conduit markets prompted a downward revision to full-year guidance. Management remains focused on advancing growth initiatives in water-related products and global mega projects while navigating pricing headwinds. Analysts raised concerns about the ability to sustain profitability, but management highlighted productivity improvements and strategic investments as key drivers for recovery in the second half of the fiscal year and beyond.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/ATKR/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402839-atkore-signals-375m-425m-adjusted-ebitda-for-fy-2025-amid-pricing-challenges-and-growth",
            "pub_date": "2025-02-04 20:03:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402813",
            "title": "Disney's profit in focus during Q1 earnings",
            "description": "<html><body><p>Walt Disney’s (NYSE:<a href=\"https://seekingalpha.com/symbol/DIS\">DIS</a>) profitability will be in focus, when the entertainment giant reports first quarter results on Wednesday, before markets open.</p> <p>Wall Street expects the California-based company to <a href=\"https://seekingalpha.com/symbol/DIS/earnings/estimates?period=quarterly\">post</a> EPS of $1.43, indicating a 17% increase from last year, while revenue is expected to rise<span class=\"paywall-full-content invisible\"> nearly 5% to $24.55 billion.</span></p> <p class=\"paywall-full-content invisible\">Disney’s robust earnings projection, combined with growth in its flagship streaming video service and the success from Box Office hits including <em>Moana 2</em> and <em>Mufasa: The Lion King</em>, comes at a time when the Mouse House is preparing to name a new chief in early 2026, replacing veteran Bob Iger.</p> <p class=\"paywall-full-content invisible\">The company, in November, <a href=\"https://seekingalpha.com/news/4291193-disney-logs-best-post-earnings-gain-in-years-on-entertainment-strong-profit-guidance\">forecast</a> profit growth in FY2025 to reach high single digits and to increase to double-digit growth in earnings per share in fiscal 2026 and 2027, even as it is planning to make investments in theme parks and cruise ships. On the buyback front, Disney also set a target of $3 billion for the fiscal year.</p> <p class=\"paywall-full-content invisible\">Even though, analysts are positive on Disney’s Entertainment unit, many are focusing on the company’s Experiences segment, given the impact from hurricanes Helene and Milton and cruise ship pre-opening costs. The company also faced a slowdown in attendance after a post-covid surge.</p> <p class=\"paywall-full-content invisible\">BofA analyst Jessica Reif Ehrlich said he projects Q1 to be “the trough quarter of this fiscal year,” adding that it does not appear the recent Los Angeles fires have had a material impact on Disneyland attendance until now.</p> <p class=\"paywall-full-content invisible\">“We project a mid-single digit decline in F1Q25 (-5%) weighed down by Hurricane impacts and pre-opening costs for the Disney Treasure, improving to +4% in F2Q and full year growth of 7%,” noted Guggenheim analyst Michael Morris, while talking about the Experiences segment.</p> <p class=\"paywall-full-content invisible\">Disney Treasure is a cruise ship that began its maiden voyage in December last year. Disney cruises are part of the company’s experiences division, alongside theme parks, resorts and consumer products. </p> <p class=\"paywall-full-content invisible\">Over the last two years, Disney <a href=\"https://seekingalpha.com/symbol/DIS/earnings/eps-surprise-summary\">has beaten EPS estimates</a> 88% of the time and has beaten revenue estimates 50% of the time.</p> <p class=\"paywall-full-content invisible\">Wall Street and Seeking Alpha analysts are <a href=\"https://seekingalpha.com/symbol/DIS/ratings/quant-ratings#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">bullish</a> and recommended the company as a Buy, while Seeking Alpha’s Quant Ratings rated it as a Hold.</p> <p class=\"paywall-full-content invisible\">Over the last three months, EPS estimates have seen 13 <a href=\"https://seekingalpha.com/symbol/DIS/earnings/revisions\">upward revisions</a> compared to three downward revisions. Revenue estimates have been revised upward six times versus seven downward moves.</p> <p class=\"paywall-full-content invisible\">The company’s stock has gained 18% in the last one year, compared to the over 20% rise in the broader S&amp;P500 Index.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/458117347/image_458117347.jpg",
            "link": "https://seekingalpha.com/news/4402813-disneys-profit-in-focus-during-q1-earnings",
            "pub_date": "2025-02-04 19:57:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402796",
            "title": "Sky-high egg pricing prompts Waffle House to add a surcharge",
            "description": "<html><body><p>Egg prices continue to soar to unprecedented levels in a development that has pressured many food-related companies and caused significant concern among consumers. The average cost of a dozen Grade A large eggs was $4.15 in December, according to the Bureau of Labor<span class=\"paywall-full-content invisible\"> Statistics, but much higher prices are being reported in certain cities, particularly on the East Coast and West Coast.</span></p> <p class=\"paywall-full-content invisible\">By far, the most significant factor driving up egg prices is the ongoing outbreak of highly pathogenic avian influenza, also known as bird flu. This deadly strain of H5N1 has led to the culling of millions of chickens since 2022, severely impacting the egg supply chain. As of January 2025, more than 134 million birds have been affected in the United States, which has thrown the supply and demand balance out of whack.</p> <p class=\"paywall-full-content invisible\">The latest guidance from the USDA was that egg prices are likely to push even higher in 2025.</p> <p class=\"paywall-full-content invisible\">In a sign of the times, Georgia-based Waffle House has added a temporary surcharge of $0.50 per egg at its ~2,100 locations due to the elevated egg prices from the bird flu outbreak. \"The continuing egg shortage caused by HPAI (Bird Flu) has caused a dramatic increase in egg prices,\" noted Waffle House in a statement. \"Consumers and restaurants are being forced to make difficult decisions.\"</p> <p class=\"paywall-full-content invisible\">Meanwhile, grocery store operators Albertsons Companies (<a href=\"https://seekingalpha.com/symbol/ACI\" title=\"Albertsons Companies, Inc.\">ACI</a>), Kroger (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/KR\" title=\"The Kroger Co.\">KR</a></span>), Sprouts Farmers Markets (<a href=\"https://seekingalpha.com/symbol/SFM\" title=\"Sprouts Farmers Market, Inc.\">SFM</a>), Ingles Markets (<a href=\"https://seekingalpha.com/symbol/IMKTA\" title=\"Ingles Markets, Incorporated\">IMKTA</a>), Weis Markets (<a href=\"https://seekingalpha.com/symbol/WMK\" title=\"Weis Markets, Inc.\">WMK</a>), Natural Grocers by Vitamin Cottage (<a href=\"https://seekingalpha.com/symbol/NGVC\" title=\"Natural Grocers by Vitamin Cottage, Inc.\">NGVC</a>), and Whole Foods (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>) have all raised prices </p> <p class=\"paywall-full-content invisible\">Egg prices are also very relevant to producer Cal-Maine Foods (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/CALM\" title=\"Cal-Maine Foods, Inc.\">CALM</a></span>), which has seen a 91% share price rally over the last 52 weeks. Other companies that have mentioned egg prices on recent earnings conference calls include Tractor Supply (<a href=\"https://seekingalpha.com/symbol/TSCO\" title=\"Tractor Supply Company\">TSCO</a>), Vital Farms (<a href=\"https://seekingalpha.com/symbol/VITL\" title=\"Vital Farms, Inc.\">VITL</a>), McDonald's (<a href=\"https://seekingalpha.com/symbol/MCD\" title=\"McDonald's Corporation\">MCD</a>), Grocery Outlet (<a href=\"https://seekingalpha.com/symbol/GO\" title=\"Grocery Outlet Holding Corp.\">GO</a>), First Watch Restaurant Group (<a href=\"https://seekingalpha.com/symbol/FWRG\" title=\"First Watch Restaurant Group, Inc.\">FWRG</a>), and Post Holdings (<a href=\"https://seekingalpha.com/symbol/POST\" title=\"Post Holdings, Inc.\">POST</a>).</p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/88689316/image_88689316.jpg",
            "link": "https://seekingalpha.com/news/4402796-sky-high-egg-pricing-prompts-waffle-house-to-add-a-surcharge",
            "pub_date": "2025-02-04 19:58:05",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402743",
            "title": "Nasdaq up 1%, S&P rises as Wall Street shifts focus to earnings, sets aside tariff spat",
            "description": "<html><body><p class=\"MsoNormal\">Major equity averages gained ground Tuesday, with investors combing through another crop of corporate earnings reports while appearing to take in stride news of China's retaliatory tariffs against the U.S. </p> <p class=\"MsoNormal\">The Nasdaq Composite (<a href=\"https://seekingalpha.com/symbol/COMP:IND\" title=\"NASDAQ Composite Index\">COMP:IND</a>) <span style=\"color: #008000;\">+1.2%</span>, and the S&amp;P<span class=\"paywall-full-content invisible\"> 500 (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a><span class=\"paywall-full-content invisible\">) </span><span class=\"paywall-full-content invisible\" style=\"color: #008000;\">+0.6%. </span><span class=\"paywall-full-content invisible\">The Dow (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/DJI\" title=\"Dow Jones Industrial Average Index\">DJI</a><span class=\"paywall-full-content invisible\">) </span><span class=\"paywall-full-content invisible\" style=\"color: #008000;\">+0.2</span><span class=\"paywall-full-content invisible\">%. The Energy sector on the benchmark </span><span class=\"paywall-full-content invisible\" style=\"color: #008000;\">+1.8%</span><span class=\"paywall-full-content invisible\">, and paced six other advancing groups. Marathon Petroleum (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/MPC\" title=\"Marathon Petroleum Corporation\">MPC</a><span class=\"paywall-full-content invisible\">) </span><span class=\"paywall-full-content invisible\" style=\"color: #008000;\">+5.9%</span><span class=\"paywall-full-content invisible\"> after </span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/news/4402565-marathon-petroleum-non-gaap-eps-of-0_77-beats-by-0_75-revenue-of-33_47b-beats-by-1_53b\" rel=\"noopener\" target=\"_blank\" title=\"beating Q4 estimates\">beating Q4 estimates</a><span class=\"paywall-full-content invisible\">. </span></p> <p class=\"MsoNormal paywall-full-content invisible\">The Nasdaq and the S&amp;P 500 were helped by shares of Palantir Technologies (<a href=\"https://seekingalpha.com/symbol/PLTR\" title=\"Palantir Technologies Inc.\">PLTR</a>) <span style=\"color: #008000;\">+26%</span> after <a href=\"https://seekingalpha.com/news/4402385-palantir-projects-31-percent-revenue-growth-for-2025-amid-accelerating-ai-adoption\" rel=\"noopener\" target=\"_blank\" title=\"Q4 results\">Q4 results</a> outstripped Wall Street’s estimates. The software platform developer sees accelerating AI adoption driving 31% revenue growth for 2025. </p> <p class=\"MsoNormal paywall-full-content invisible\">Yields were lower. The 10-year Treasury yield (<a href=\"https://seekingalpha.com/symbol/US10Y\" title=\"United States 10-Year Bond Yield\">US10Y</a>) fell 3 basis points to 4.54%. The 2-year yield (<a href=\"https://seekingalpha.com/symbol/US2Y\" title=\"United States 2-Year Bond Yield\">US2Y</a>) fell 4 basis points to 4.23%.</p> <p class=\"MsoNormal paywall-full-content invisible\">On the tariff front, the <a href=\"https://seekingalpha.com/news/4402411-tit-for-tat-china-hits-back-with-tariffs-on-u_s_-coal-lng-vehicles\" rel=\"noopener\" target=\"_blank\" title=\"Chinese government\">Chinese government</a> responded to a 10% tariff that U.S. President Donald Trump ordered on Chinese products. China is implementing a 15% tariff on coal and liquefied natural gas products, as well as a 10% tariff on crude oil, agricultural machinery, and large-displacement cars.</p> <p class=\"MsoNormal paywall-full-content invisible\"><a href=\"https://seekingalpha.com/news/4402227-nasdaq-sp-and-dow-closed-lower-to-start-the-week-as-tariff-talks-heat-up\" rel=\"noopener\" target=\"_blank\" title=\"Stocks fell Monday\">Stocks fell Monday</a> after President Donald Trump announced new tariffs on Canada and Mexico over the weekend. While it was a red day, markets were able to recoup some losses after the U.S. delayed a 25% tariff on Mexico. A tariff delay for Canada was announced after trading closed. </p> <p class=\"MsoNormal paywall-full-content invisible\">\"The past 24 hours have seen a big roundtrip for many assets classes as strongly negative sentiment gave way to a relief rally,\" Deutsche Bank's Jim Reid said.</p> <p class=\"MsoNormal paywall-full-content invisible\">\"While Trump's aims could be primarily political, we estimate that his latest tariff announcements would amount to a low single-digit drag on SPX EPS if implemented and not rolled back this year,\" Barclays said. \"Energy, Materials, and Discretionary sectors appear most at risk.\"</p> <p class=\"MsoNormal paywall-full-content invisible\">On the earnings side, Google parent <a href=\"https://seekingalpha.com/news/4402150-alphabet-q4-preview-eyes-on-ad-business-cloud-sales-and-capital-spend\" rel=\"noopener\" target=\"_blank\" title=\"Alphabet\">Alphabet</a> (<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>) (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>) is expected to release its fourth quarter results after the closing bell. </p> <p class=\"MsoNormal paywall-full-content invisible\"><a href=\"https://seekingalpha.com/news/4402730-factory-orders-fall-more-than-expected-in-december\" rel=\"noopener\" target=\"_blank\" title=\"U.S. factory orders\">U.S. factory orders</a> fell 0.9% M/M to $578.5B in December. Additionally, <a href=\"https://seekingalpha.com/news/4402713-job-openings-drop-more-than-expected-in-december-hiring-rate-stagnates\" rel=\"noopener\" target=\"_blank\" title=\"job openings\">job openings</a> drop more than expected in December while hiring rate stagnates.</p> <p class=\"paywall-full-content invisible\" dir=\"ltr\">Among movers, Spotify (<a href=\"https://seekingalpha.com/symbol/SPOT\" title=\"Spotify Technology S.A.\">SPOT</a>) <span style=\"color: #008000;\">+9.9%</span> as the music streaming service posted its <a href=\"https://seekingalpha.com/news/4402752-spotify-targets-2025-as-year-of-accelerated-execution-with-31_5-percent-q1-gross-margin\">first full year of profitability</a> and said 2025 will be a year of accelerated execution.</p> <p class=\"MsoNormal paywall-full-content invisible\">Estée Lauder (<a href=\"https://seekingalpha.com/symbol/EL\" title=\"The Estée Lauder Companies Inc.\">EL</a>) was the S&amp;P 500’s (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>) steepest decliner, down <span style=\"color: #008000;\">-19%</span> after the cosmetics and skin care company <a href=\"https://seekingalpha.com/news/4402622-este-lauder-paints-ugly-picture-fq3-slashes-jobs-part-strategic-plan\">projected shrinking profitability</a> and plans for job cuts.</p> <p class=\"MsoNormal paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2022152397/image_2022152397.jpg",
            "link": "https://seekingalpha.com/news/4402743-sp500-nasdaq-dow-jones-outlook-stock-market",
            "pub_date": "2025-02-04 19:50:11",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402809",
            "title": "Westinghouse proposes using old nuclear sites to build small reactors in Italy",
            "description": "<html><body><p>Westinghouse has proposed using Italy's four decommissioned nuclear sites for the installation of small modular reactors, with the aim to start construction by 2030, Reuters reported Tuesday.</p> <p>The proposal was made by Fabio Presot, Westinghouse commercial sales manager, during a parliamentary hearing, according<span class=\"paywall-full-content invisible\"> to the </span><a class=\"paywall-full-content invisible\" href=\"https://www.reuters.com/business/energy/westinghouse-eyes-old-nuclear-sites-build-small-reactors-italy-2025-02-04/\" rel=\"nofollow\" target=\"_self\" title=\"report\">report</a><span class=\"paywall-full-content invisible\">.</span></p> <p class=\"paywall-full-content invisible\">Italy's Energy Minister Gilberto Pichetto Fratin announced in October that the country was in talks with several groups, including Westinghouse and EDF, as potential partners for a state-backed company to build advanced nuclear reactors.</p> <p class=\"paywall-full-content invisible\">Fratin said Italy is planning to finalize a strategy by the end of 2027 to reintroduce nuclear power plants, nearly 40 years after they were banned.</p> <p class=\"paywall-full-content invisible\">The government also has suggested that small modular reactors and advanced modular reactors could assist in the decarbonization of Italy's most polluting industries, including steel, glass, and tilemaking.</p> <p class=\"paywall-full-content invisible\">Westinghouse is owned by Brookfield Asset Management (<a href=\"https://seekingalpha.com/symbol/BAM\" title=\"Brookfield Asset Management Ltd.\">BAM</a>) with a 51% holding and Cameco (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CCJ\" title=\"Cameco Corporation\">CCJ</a></span>) with 49%.</p> <p class=\"paywall-full-content invisible\">ETFs: (<a href=\"https://seekingalpha.com/symbol/NLR\" title=\"VanEck Uranium+Nuclear Energy ETF\">NLR</a>), (<a href=\"https://seekingalpha.com/symbol/URA\" title=\"Global X Uranium ETF\">URA</a>), (<a href=\"https://seekingalpha.com/symbol/URNM\" title=\"Exchange Traded Concepts Trust - North Shore Global Uranium Mining ETF\">URNM</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1270632735/image_1270632735.jpg",
            "link": "https://seekingalpha.com/news/4402809-westinghouse-proposes-using-old-nuclear-sites-to-build-small-reactors-in-italy",
            "pub_date": "2025-02-04 19:54:24",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}