{
    "data": [
        {
            "id": "4558944",
            "title": "Myers declares $0.135 dividend",
            "description": "<html><body><ul>\n<li>Myers (MYE) declares <a href=\"https://seekingalpha.com/pr/20418093-myers-industries-announces-quarterly-dividend\" target=\"_blank\">$0.135/share quarterly dividend</a>, in line with previous.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/MYE/dividends/yield?source=news_bullet\">Forward yield</a> 2.41%</li>\n<li>Payable April 3; for shareholders of record March 13; ex-div March 13.</li>\n<li><a href=\"https://seekingalpha.com/symbol/MYE/dividends?source=news_bullet\">See MYE Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558944-myers-declares-0_135-dividend",
            "pub_date": "2026-02-28 14:00:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558913",
            "title": "Ascendis Pharma wins FDA approval for navepegritide for achondroplasia",
            "description": "<html><body><ul>\n<li>The US FDA has granted approval to Ascendis Pharma's (<a href=\"https://seekingalpha.com/symbol/ASND\" title=\"Ascendis Pharma A/S\">ASND</a>) Yuviwel (nav<span>epegritide)</span> to treat children with achondroplasia, also known as dwarfism.</li>\n<li>Yuviwel, which was developed under the name TransCon CNP, is dosed once a week for children two years and older. It will be available in Q2.</li>\n<li>Ascendis will need to conduct a post-market trial to confirm the treatment's benefit. </li>\n<li>\n<a href=\"https://seekingalpha.com/pr/20418210-fda-approves-once-weekly-yuviwel-navepegritide-for-children-with-achondroplasia-aged-2-years\" target=\"_blank\" title=\"Approval\">Approval</a> was based on <span>improvement in annualized growth velocity.</span>\n</li>\n<li>In late November 2025, the agency <a href=\"https://seekingalpha.com/news/4526551-ascendis-dwarfism-drug-candidate-review-extended-fda\" target=\"_self\" title=\"extended\">extended</a> the action date for the application to review additional information connected to the <span>post-marketing requirement.</span>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558913-ascendis-pharma-wins-fda-approval-navepegritide-achondroplasia",
            "pub_date": "2026-02-28 11:35:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558942",
            "title": "Oil jumps as market sees rising risk of U.S.-Iran conflict",
            "description": "<html><body><p data-eci=\"true\">Crude oil futures rose Friday by the most in more than a week, as traders headed into the weekend seeing heightened risk of U.S. military action against Iran after talks between the two countries ended without a breakthrough.</p>\n<p>President Trump said he was \"not happy\" with the way talks are going but that he has not made a final decision on next steps - he said he preferred not to take military action, \"but sometimes you have to.</p>\n<p>\"Iran \"<span>cannot have nuclear weapons, and we're not thrilled with the way they're negotiating,\" the president told reporters at the White House.</span></p>\n<p>The U.S. Embassy in Israel said the State Department authorized non-emergency staff and their families to leave the country, citing safety risks.</p>\n<p><span>The U.S. and Iran agreed to extend indirect negotiations into next week, but traders are growing more skeptical that an agreement between the two sides is possible.</span></p>\n<p><span>\"The likelihood Iran is going to agree to what the Trump administration wants doesn't seem possible,\" Price Futures Group senior analyst Phil Flynn said in a note. \"There's got to be an end game to this, and the market seems to think that's where we are headed.\"</span></p>\n<p><span><span>Saudi Arabia has been </span><a href=\"https://oilprice.com/Latest-Energy-News/World-News/Gulf-Oil-Producers-Open-the-Taps-as-Iran-Risk-Premium-Builds.html\" rel=\"nofollow\" target=\"_self\" title=\"hiking production and exports\">boosting production and exports</a><span> as part of a contingency plan ahead of a U.S. strike on Iran that could disrupt flows through the Strait of Hormuz; Saudi shipments jumped to ~7.3M bbl/day in the first 24 days of February, the highest since April 2023.</span></span></p>\n<p>Meanwhile, OPEC+ is expected to agree to resume production increases in April when it meets on Sunday; the group decided to keep output steady in Q1 following a series of production increases last year, but it is widely expected to resume hikes, starting with a modest increase of 137K bbl/day.</p>\n<p>Nevertheless, \"supply-demand fundamentals remain stacked against a meaningful recovery,\" Nikos Tzabouras of Tradu said in a note. \"Return of Venezuelan crude to an already well-supplied market and expectations of a resumption of OPEC+ output hikes keep glut fears in focus.\"</p>\n<p><span>Front-month Nymex crude (<a href=\"https://seekingalpha.com/symbol/CL1:COM\" title=\"Crude Oil Futures\">CL1:COM</a>) for April delivery closed +2.8% to $67.02/bbl, and front-month Brent April crude (<a href=\"https://seekingalpha.com/symbol/CO1:COM\" title=\"Brent Futures\">CO1:COM</a>) finished +2.4% to $72.48/bbl; for the week, the Nymex and Brent benchmarks gained 0.8% and 1%, respectively.</span></p>\n<p><span>U.S. natural gas futures (<a href=\"https://seekingalpha.com/symbol/NG1:COM\" title=\"Natural Gas Futures\">NG1:COM</a>) gained as strong LNG export demand provided support amid a bearish March weather outlook; the front-month Nymex April contract closed +1.1% at $2.859/MMBtu on Friday while falling 4.2% on the week.</span></p>\n<p><span>Energy stocks, as represented by the Energy Select Sector SPDR Fund (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/XLE\" title=\"State Street Energy Select Sector SPDR ETF\">XLE</a></span>), ended the week +1.9%.</span></p>\n<p><span>ETFs: (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/USO\" title=\"United States Oil Fund LP ETF\">USO</a></span>), (<a href=\"https://seekingalpha.com/symbol/BNO\" title=\"United States Brent Oil Fund LP ETF\">BNO</a>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/UCO\" title=\"ProShares Ultra Bloomberg Crude Oil ETF\">UCO</a></span>), (<a href=\"https://seekingalpha.com/symbol/SCO\" title=\"ProShares UltraShort Bloomberg Crude Oil ETF\">SCO</a>) (<a href=\"https://seekingalpha.com/symbol/USL\" title=\"United States 12 Month Oil Fund LP ETF\">USL</a>), (<a href=\"https://seekingalpha.com/symbol/DBO\" title=\"Invesco DB Oil Fund ETF\">DBO</a>), (<a href=\"https://seekingalpha.com/symbol/DRIP\" title=\"Direxion Daily S&amp;P Oil &amp; Gas Exp &amp; Prod Br 2X Shs ETF\">DRIP</a>), (<a href=\"https://seekingalpha.com/symbol/GUSH\" title=\"Direxion Daily S&amp;P Oil &amp; Gas Exp &amp; Prod Bl 2X Shs ETF\">GUSH</a>), (<a href=\"https://seekingalpha.com/symbol/USOI\" title=\"UBS ETRACS Crude Oil Shares Covered Call ETN\">USOI</a>), (<a href=\"https://seekingalpha.com/symbol/UNG\" title=\"United States Natural Gas Fund LP ETF\">UNG</a>), (<a href=\"https://seekingalpha.com/symbol/BOIL\" title=\"ProShares Ultra Bloomberg Natural Gas ETF\">BOIL</a>), (<a href=\"https://seekingalpha.com/symbol/KOLD\" title=\"ProShares UltraShort Bloomberg Natural Gas ETF\">KOLD</a>), (<a href=\"https://seekingalpha.com/symbol/UNL\" title=\"United States 12 Month Natural Gas Fund LP ETF\">UNL</a>), (<a href=\"https://seekingalpha.com/symbol/FCG\" title=\"First Trust Natural Gas ETF\">FCG</a>), (<a href=\"https://seekingalpha.com/symbol/XLE\" title=\"State Street Energy Select Sector SPDR ETF\">XLE</a>)</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558942-oil-jumps-as-market-sees-rising-risk-of-us-iran-conflict",
            "pub_date": "2026-02-28 08:46:35",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558940",
            "title": "Delta continues fleet renewal, ordering another 34 Airbus jets",
            "description": "<html><body><p data-eci=\"true\"><span>Delta Air Lines (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DAL\" title=\"Delta Air Lines, Inc.\">DAL</a></span>) said post-market </span><span>Friday it will <a href=\"https://news.delta.com/delta-continues-fleet-renewal-additional-narrowbody-aircraft\" rel=\"nofollow\" target=\"_self\" title=\"buy\">buy</a> 34 more Airbus (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EADSF\" title=\"Airbus SE\">EADSF</a></span>) (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EADSY\" title=\"Airbus SE\">EADSY</a></span>) </span><span>A321neo jets, its third aircraft order in less than six weeks, as the carrier continues its plan to refresh its fleet with aircraft that burn less fuel and offer more premium seats.</span></p>\n<p>Delta (<a href=\"https://seekingalpha.com/symbol/DAL\" title=\"Delta Air Lines, Inc.\">DAL</a>) said the <span>order lifts its total commitment for the A321neo to 189 aircraft; with 92 of the jets currently in service and firm orders for another 97, including the latest option exercise; the carrier also holds options for 36 additional A321neos.</span></p>\n<p><span>The company said the A321neo offers the lowest unit cost of any narrowbody jet in its fleet and is 20%–30% more fuel efficient than the current generation aircraft it replaces and carries more first-class and extra-legroom seats than any other narrowbody in its fleet.</span></p>\n<p><span><span>Last month, Delta (<a href=\"https://seekingalpha.com/symbol/DAL\" title=\"Delta Air Lines, Inc.\">DAL</a>) announced separate orders for 30 </span>Boeing<span> 787 Dreamliners and 31 Airbus (<a href=\"https://seekingalpha.com/symbol/EADSF\" title=\"Airbus SE\">EADSF</a>) (<a href=\"https://seekingalpha.com/symbol/EADSY\" title=\"Airbus SE\">EADSY</a>) A330-900 and A350-900 widebody jets.</span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558940-delta-continues-fleet-renewal-ordering-another-34-airbus-jets",
            "pub_date": "2026-02-28 07:51:38",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558938",
            "title": "Fulgent Genetics forecasts $350M 2026 revenue and 53% AP growth as Bako, StrataDx acquisitions reshape customer mix",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Fulgent Genetics (FLGT) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Ming Hsieh, Chairman &amp; CEO, highlighted strategic progress in both laboratory services and therapeutic development, noting, \"We have implemented the best-in-class technology across our platform and have the investment we have made in digital pathology and AI are paying off.\" He reported the launch of proprietary imaging management system Eziopath and the introduction of RNA integrated whole genome sequencing and ultra-rapid whole genome sequencing, stating, \"Our investment in AI and digital pathology solutions, coupled with our innovations across our laboratory service platform, we deliver the revenue and margin improvement in 2025.\"</li>\n<li>Hsieh addressed a significant transition in 2026 due to the company's largest customer moving significant volume in-house, but emphasized, \"We believe our technology platform will continue to get stronger and the strategic investment and the innovations we have made will continue to work at an accelerated pace.\"</li>\n<li>The CEO also detailed the advancement of clinical candidates, with FID-007 completing Phase II enrollment and progressing toward a Phase III trial, and FID-022 advancing in dose escalation.</li>\n<li>Brandon Perthuis, Chief Commercial Officer, reported fourth quarter revenue of $83.3 million, a 9% increase year-over-year, and full-year revenue of $322.7 million, up 14%. He announced acquisitions of Bako Diagnostics and StrataDx for $55.5 million, stating, \"This proposed acquisition will add new anatomic pathology services, proprietary PCR tests and a national client base.\"</li>\n<li>Perthuis highlighted regulatory approvals in New York for Nova and whole genome sequencing, and noted, \"As of today, we are approximately 100% digital across all of our cases, and they are being read on Eziopath.\"</li>\n<li>Paul Kim, Chief Financial Officer, stated, \"Full year revenue for 2025 totaled $322.7 million, growing approximately 14% compared to revenue of $283.5 million in 2024, which fell slightly short of the updated guidance we provided on last quarter's earnings call, but ahead of the original guidance we provided at the beginning of 2025.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Kim projected 2026 revenue of $350 million, representing 8.5% year-over-year growth, and noted, \"We would also expect total revenues to be approximately $350 million for 2026.\"</li>\n<li>He indicated the loss from the largest customer is expected to be partially or fully offset by $50–$55 million in revenue from Bako and StrataDx acquisitions. Anatomic pathology revenue is projected to reach $162 million, up 53% from 2025, while biopharma revenue is expected to decrease to $20 million. \"We expect non-GAAP gross margins for the full year to be slightly above 40% as the product mix shifts,\" Kim said.</li>\n<li>Non-GAAP EPS guidance for 2026 is projected at a loss of $1.45 per share, and ending 2026 with approximately $685 million in cash, assuming receipt of delayed tax refunds.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Fourth quarter revenue was $83.3 million, compared to $84.1 million in Q3 2025. Gross margin for Q4 on a non-GAAP basis was 41%. GAAP loss for the quarter was $23.4 million, compared to $6.6 million in Q3. Adjusted EBITDA for the fourth quarter was a loss of approximately $4.5 million versus a gain of $700,000 in Q3. Non-GAAP income for the quarter was $5.2 million or $0.16 per share, and for the year, $13.2 million or $0.42 per share.</li>\n<li>Operating expenses rose to $68.8 million (GAAP) in Q4 from $50.9 million in Q3, with non-GAAP operating expenses at $43.1 million versus $40.7 million in the prior quarter. The company ended 2025 with $705.5 million in cash and equivalents, not yet including a $106 million tax refund delayed by a government shutdown.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Lu Li, UBS: Asked about the revenue loss from the largest customer and risk of further in-housing. Paul Kim confirmed, \"The revenue from our largest customer was $70.8 million in 2025. And when we lay out the plan for 2026, the $350 million, we assume that we're going to be getting about $11.8 million from this customer.\"</li>\n<li>Lu Li, UBS: Inquired about growth drivers for Precision Diagnostics. Perthuis cited the Beacon test, expansion of whole genome sequencing, and the Lumera somatic assay as key drivers.</li>\n<li>David Westenberg, Piper Sandler: Asked about gross margin headwinds from the customer loss. Kim noted, \"We posted gross margins of approximately 41% in Q4 of 2025. We anticipate that to go down by approximately 4 points in the first quarter, about 2 points in the second quarter, but having a rebound in the third and the fourth quarter.\"</li>\n<li>Westenberg also queried sales synergies from Bako acquisition; Perthuis responded, \"We will be able to use our existing team to sell Bako products and the Bako team to sell Fulgent products.\"</li>\n<li>Andrew Cooper, Raymond James: Asked about cash burn and digital pathology integration. Kim explained, \"Our laboratory services business is going to be using cash, but not that much, which leaves a lot of cash for us to deploy for M&amp;A investment.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on risks from customer concentration, the impact of acquisitions, and margin pressure, expressing caution in tone with pointed questions on revenue loss and cost structure.</li>\n<li>Management maintained a confident and constructive tone throughout the call, frequently citing technology investments, product innovation, and acquisition synergies. Hsieh stated, \"We are feeling pretty strong at the present time, given the technology and the R&amp;D effort we have.\"</li>\n<li>Compared to the previous quarter, the tone shifted from optimistic growth and margin expansion to one of cautious confidence, with more focus on mitigating customer loss and integrating acquisitions.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance shifted from positive momentum and upward revisions in Q3 to a more measured forecast for 2026, reflecting the impact of the largest customer moving in-house.</li>\n<li>Strategic focus broadened to include acquisition integration and customer diversification. The tone in Q4 was more defensive, with management repeatedly addressing customer concentration and cost management, compared to the more upbeat Q3 discussion of organic growth and new product launches.</li>\n<li>Key financial metrics saw increased losses, higher operating expenses, and a slight year-over-year revenue increase, but a sequential decline in revenue and margins.</li>\n<li>Analysts in Q4 pressed more on risks, cash management, and the integration path for new acquisitions, while Q3 questions centered on margin expansion and product pipeline.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management identified the transition of the largest customer in-housing significant volume as a core risk for 2026 and expects a sharp decline in related revenue through Q2.</li>\n<li>Mitigation strategies include offsetting lost revenue with new acquisitions, expanding the product suite, and customer pipeline growth in Precision Diagnostics.</li>\n<li>Analysts raised concerns about margin headwinds, cash burn, and the risk of further in-housing or customer concentration.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Fulgent Genetics concluded the quarter underscoring confidence in its technology platform, product innovation, and acquisition-driven expansion, while candidly acknowledging the near-term impact from its largest customer’s transition to in-house testing. Management anticipates the combination of organic growth drivers, a diversified customer base, and the integration of Bako and StrataDx will support revenue growth and improve operating leverage in the longer term, despite temporary margin pressure and increased operating expenses in the first half of 2026.</p>\n<p><a href=\"https://seekingalpha.com/symbol/flgt/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558938-fulgent-genetics-forecasts-350m-2026-revenue-and-53-percent-ap-growth-as-bako-stratadx",
            "pub_date": "2026-02-28 07:11:31",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558939",
            "title": "Via targets 25%+ revenue growth and first profitable quarter in Q4 2026 amid AI-driven product expansion",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Via Transportation, Inc. (VIA) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li><p>CEO Daniel Ramot highlighted that \"Via delivered another exceptional quarter, exceeding expectations on both top and bottom line performance,\" with revenue growing 30% year-over-year to $119 million in Q4. He emphasized this as the eighth consecutive quarter with 30%+ year-over-year platform revenue growth and noted, \"Q4 was the strongest quarter in company history for net new platform revenue.\" Ramot cited product innovation, the addition of 94 new customers through the Downtowner acquisition, and a strategic focus on AI as key growth drivers. He stated, \"Our pipeline grew more than 50% year-over-year in 2025,\" and described the launch of AI Labs to extend Via's technology for broader municipal use.</p></li>\n<li><p>Ramot detailed customer wins, including Sarasota County, Florida, and a Missouri agency, each demonstrating significant cost savings and expanded transit reach using Via’s platform. He noted, \"For the past year, Via's net revenue retention was 119%. We also recorded the highest gross revenue retention in Via's history, 98%, beating the previous record set just a quarter earlier.\"</p></li>\n<li><p>Ramot explained the rationale for acquiring Downtowner: \"We believe that many of Downtowner's customers have additional transit technology needs that are well served by Via's platform. The average ARR per Downtowner customer is significantly lower than Via's current ARR per customer, providing an exciting opportunity for growth within the Downtowner customer base.\"</p></li>\n<li><p>CFO Clara Fain stated, \"Q4 net new revenue was the strongest in the company's history, and we exceeded our revenue and adjusted EBITDA guidance, showcasing our commitment to consistent execution and durable growth.\" Fain highlighted U.S. platform revenue up 39% year-over-year and described 821 customers on the platform, with 94 customers generating over $1 million in annual run rate revenue.</p></li>\n</ul>\n<h3>Outlook</h3>\n<ul><li>Fain provided guidance for Q1 2026 revenue between $123.3 million and $123.8 million, representing 25% to 25.5% year-over-year growth, and for full year 2026 revenue between $542.9 million and $545.1 million. She stated, \"We expect adjusted EBITDA margin to be between negative 2.3% and negative 1.4% compared to negative 8% in 2025.\" Fain also announced, \"We expect to deliver our first quarter of profitability in Q4 2026 with positive adjusted EBITDA, which will be a major milestone for Via.\" Long-term margin goals were reiterated at 20% to 25% adjusted EBITDA margin.</li></ul>\n<h3>Financial Results</h3>\n<ul>\n<li><p>Fain reported annual run rate revenue for Q4 2025 at $476 million, a 30% year-over-year increase. She noted, \"We wrapped up Q4 2025 with negative 6% adjusted EBITDA margin, our lowest loss on record compared to negative 10% in Q4 2024 and negative $0.5 million of operating cash flows.\" R&amp;D spending declined as a percentage of revenue despite foreign exchange headwinds.</p></li>\n<li><p>2025 platform revenue was $434 million, up 31% year-over-year, with adjusted EBITDA improving by 8 points. Recurring fees accounted for 97% of revenue, and upfront or one-time revenue was less than 3% of the total.</p></li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li><p>John DiFucci, Guggenheim Securities: Asked whether services-only contracts are an anomaly. Ramot responded, \"That specific contract that I believe you're referring to is an anomaly, and it's an outcome of a very specific set of circumstances. Generally, we don't see anything like that in the market across the U.S. or Europe or any of our other markets.\"</p></li>\n<li><p>Adam Hotchkiss, Goldman Sachs: Inquired about the RFP pipeline and gross margin outlook. Ramot explained, \"The number of these opportunities today that we're able to go after versus a year ago, feels much larger because of the expansion of the solutions that we're able to provide.\" Fain added, \"The breakdown of the mix of customers buying services was also consistent with about 20% of our customers buying services as well as software.\"</p></li>\n<li><p>Josh Baer, Morgan Stanley: Asked about Via’s go-to-market moat. Ramot emphasized, \"Access to that market is very challenging for a number of reasons... We've invested over a decade in doing that.\"</p></li>\n<li><p>Patrick Walravens, Citizens JMP: Queried about internal AI use and headcount. Ramot said, \"In our market, we are just scratching the surface as far as the number of customers that we're able to get to. For us, any gain in productivity that we can achieve, I would like to turn into selling more stuff to more customers faster rather than trying to use that to cut the team in any dramatic way.\"</p></li>\n<li><p>Brian Peterson, Raymond James: Asked about the Downtowner acquisition and future M&amp;A. Fain replied, \"The Downtowner acquisition was not about the revenue contribution. We acquired them to penetrate the Destination Cities market and add 94 customers.\"</p></li>\n<li><p>Brad Zelnick, Deutsche Bank: Asked about regional network effects and international progress. Fain reported a \"flywheel effect\" in 19 U.S. states and strong U.S. growth, while Ramot described regulatory headwinds slowing broader platform adoption in Germany.</p></li>\n<li><p>Aleksandr Zukin, Wolfe Research: Queried about AI and AV impact on gross margin. Fain noted, \"There are some potential step function changes to gross margin from organic efforts around AI and autonomous vehicles.\"</p></li>\n<li><p>Michael Turrin, Wells Fargo: Asked about growth visibility. Fain said, \"We have over 95% visibility in our revenue guidance for the next 12 months.\"</p></li>\n<li><p>Jonathan Ho, William Blair: Explored AI Labs expansion. Ramot explained, \"We have a way in a scalable way, not just one-off things that we then can't scale to build solutions that extend beyond transit.\"</p></li>\n<li><p>Scott Berg, Needham &amp; Company: Asked about gross retention. Fain noted, \"We've been executing at very high levels of gross revenue retention forever. So part of it is the mission criticality of the platform.\"</p></li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li><p>Analysts focused on the durability of growth, pipeline strength, margin progression, and the impact of new products and acquisitions. The tone was slightly positive, with multiple congratulations and targeted questions about growth visibility and strategic direction.</p></li>\n<li><p>Management maintained a confident and optimistic tone in prepared remarks and Q&amp;A. Phrases such as \"we couldn't be more bullish\" and \"we are confident\" signaled strong conviction. Management responses were direct, especially on questions about contract mix, margin levers, and market expansion.</p></li>\n<li><p>Compared to the previous quarter, both analysts and management displayed increased confidence, with management offering more detail on AI, M&amp;A, and product expansion strategies.</p></li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li><p>Guidance for 2026 targets 25%+ revenue growth and a first profitable quarter in Q4 2026, compared to previous guidance aiming for 30% growth and continued losses in 2025.</p></li>\n<li><p>Customer count increased sharply from 713 in Q3 to 821 in Q4, with the Downtowner acquisition adding 94 customers. Net revenue retention and gross revenue retention set new records.</p></li>\n<li><p>Management’s tone was more assertive on AI-driven product innovation and broader municipal market opportunities. Analysts shifted from questions about foundational growth to more nuanced inquiries about deal mix, AI monetization, and margin inflection.</p></li>\n<li><p>Strategic focus has expanded from core transit solutions to include broader AI-enabled municipal services via AI Labs.</p></li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li><p>Management acknowledged challenges in regulatory environments, especially in Europe, with Ramot stating, \"That next phase where adoption of our entire platform is becoming ubiquitous... is just proving to take longer than we would have liked.\"</p></li>\n<li><p>Analysts questioned the pace of gross margin improvement and the consistency of customer contract types. Fain addressed margin levers and highlighted the potential for AVs and AI to drive future step changes.</p></li>\n<li><p>Management reiterated the importance of disciplined M&amp;A and noted \"dislocation in the market\" as an opportunity for selective acquisitions.</p></li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Via closed 2025 with record-setting growth, rapid customer expansion, and continued progress toward profitability, driven by AI-powered product innovation, strategic acquisitions like Downtowner, and a robust pipeline. The company’s 2026 outlook targets 25%+ revenue growth and the milestone of first positive adjusted EBITDA in Q4, reflecting confidence in continued market penetration and the transformative potential of its technology for public sector transit and beyond.</p>\n<p><a href=\"https://seekingalpha.com/symbol/via/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558939-via-targets-25-percent-revenue-growth-and-first-profitable-quarter-in-q4-2026-amid-ai-driven",
            "pub_date": "2026-02-28 07:11:31",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558935",
            "title": "Hawaiian Electric signals $550M–$700M capex for 2026 as wildfire settlements near final approval",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Hawaiian Electric Industries (HE) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Scott W. Seu, President and CEO, opened the call by highlighting progress on priorities since the Maui wildfires in 2023, including advancing the Maui wildfire tort settlement, legislative measures for wildfire risk, and implementing safety improvements that \"have reduced the risk of ignition from utility equipment and laying the groundwork for a successful second multiyear rate period under our performance-based regulation, or PBR framework.\"</li>\n<li>Seu stated, \"In sum, we've continued to work through the administrative steps required to see the settlement through to completion and trigger our first payment.\" He noted that class settlement agreements have received court approvals, and a recent Hawaii Supreme Court decision ended insurer efforts to intervene, moving the company closer to final court approval and triggering the first payment.</li>\n<li>Seu confirmed finalization of settlements resolving both the shareholder class action and shareholder derivative lawsuits related to the Maui wildfires, with obligations \"fully funded by insurance proceeds.\"</li>\n<li>Seu highlighted that the Public Utilities Commission (PUC) approved the utility's 3-year wildfire safety strategy in December, and the company achieved many objectives ahead of schedule. \"We'll continue rapidly advancing the strategy as we progress through 2026.\"</li>\n<li>Key financial flexibility measures included a $500 million utility debt issuance, upsizing the revolver to $600 million, and maintaining stable customer bills despite investments in wildfire safety.</li>\n<li>Strategic priorities for 2026 involve resolving remaining conditions for the tort litigation settlement and pursuing an alternative process for rate rebasing, with a joint proposal submission planned by March 6.</li>\n<li>Seu confirmed an executive transition: \"Scott DeGhetto's term as HEI's CFO expires on April 1... Paul Ito, the current Treasurer and CFO of Hawaiian Electric will resume his prior role as HEI's CFO, effective April 2, 2026.\"</li>\n<li>Scott Deghetto, Executive VP &amp; CFO, stated, \"For the full year 2025, we generated net income of $123.1 million or $0.71 per share compared to a net loss of approximately $1.4 billion in 2024... consolidated core net income was $149.3 million or $0.86 per share.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management reiterated that \"we still expect 2026 CapEx of $550 million to $700 million\" and projected increases for 2027 and 2028, subject to PUC approvals and resource adequacy reviews.</li>\n<li>Seu stated, \"In 2026, we'll continue to execute on our key objectives of advancing the tort settlement and our rate rebasing process while implementing the wildfire risk reduction measures outlined in our wildfire safety strategy.\"</li>\n<li>The company is planning to submit a request for securitization to finance wildfire safety CapEx and infrastructure resilience costs, focusing on minimizing customer impact.</li>\n<li>Management emphasized that \"affordability remains a central focus as we look ahead toward the commencement of the second multiyear rate period under PBR.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Deghetto reported, \"The results include $16.5 million of pretax Maui wildfire-related expenses net of insurance recoveries and deferrals... Results for the year also include $12.4 million of losses related to the strategic review of Pacific Current.\"</li>\n<li>Utility core net income was $177.5 million, while holding company core net loss was $28.2 million, with improved loss figures driven by lower interest expense and increased interest income from cash held for the settlement payment.</li>\n<li>As of Q4, the holding company and utility had $16 million and $486 million of unrestricted cash on hand, respectively, and significant liquidity through credit facilities.</li>\n<li>The Board approved a $10 million quarterly dividend to HEI for Q4 2025.</li>\n<li>Deghetto confirmed no changes to settlement financing plans, with the first $479 million payment expected in the second half of 2026 after appeals are resolved.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Michael Lonegan, Barclays: Asked about the likelihood of the Hawaii Supreme Court hearing the insurers’ appeal and settlement payment timing. Seu replied, \"There's been no briefing scheduled yet on this appeal that was just filed in January... this is the last step... all decisions by the Circuit Court and the State Supreme Court have been very supportive of the settlements.\"</li>\n<li>Lonegan queried settlement financing preferences. Deghetto answered, \"It will be a relevering at HEI either through debt or convertible debt. Right now, based upon market conditions, I would say we're leaning more towards convertible debt... but that certainly can change.\"</li>\n<li>Lonegan followed up on use of the ATM program for capital needs. Deghetto: \"We may use it. We may not. It just again, depends on market conditions, but that's always an option for us.\"</li>\n<li>Lonegan also asked about the sale of the remaining stake in American Savings Bank. Deghetto: \"We still intend to divest that remaining 9.9% in calendar year 2026.\"</li>\n<li>Jamieson Ward, Jefferies: Asked about the upcoming March 6 joint proposal for PBR rebasing. Seu listed priorities as \"inflationary adjustment factor, having a true-up mechanism... Looking at the PIMS and making sure the PIMS are nice and tight in terms of our ability to actually influence outcomes.\"</li>\n<li>Ward inquired about risk triggers for a pivot to a traditional rate case. Joe Viola, SVP, responded, \"The only thing that would cause us to pivot to a 2027 test year rate case is if that rate basing falls over denied.\"</li>\n<li>Ward asked about PIM redesign for more meaningful incentives. Viola: \"We want to make sure that the targets are reasonably set and the means to achieve them are reasonably within our control.\"</li>\n<li>Ward questioned 2026 milestones for wildfire fund and liability cap. Seu explained details of the 18-24 month PUC rule-making process, with no major legislative action expected in 2026.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts maintained a neutral to slightly cautious tone, mainly focusing on appeals, financing strategies, and regulatory process milestones, with questions probing for clarity on timing and risk around settlements, capital raises, and regulatory outcomes.</li>\n<li>Management's prepared remarks were confident and optimistic, but in response to analyst questions, showed caution regarding legal processes and financing flexibility. Seu used measured language: \"I don't want to get ahead of our Hawaii Supreme Court\" and \"maybe I'll stop my comments there.\"</li>\n<li>Compared to the previous quarter, management's confidence level has increased regarding settlement progress, while analysts remain focused on execution risks and regulatory clarity.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter saw a significant update on settlement progress, with final court approvals and clear next steps, compared to the previous quarter’s focus on pending court hearings and administrative steps.</li>\n<li>CapEx guidance for 2026 ($550 million to $700 million) was reiterated, in line with last quarter, but with additional detail on longer-term increases and financing methods.</li>\n<li>Previous quarter discussions centered more on implementing wildfire safety strategy and early-stage legislative and regulatory milestones, while this quarter emphasized settlement finalization and PBR rebasing process details.</li>\n<li>Analysts' focus shifted from uncertainties in the settlement timeline and CapEx guidance to more granular questions about regulatory mechanisms, financing preferences, and execution risk management.</li>\n<li>Management’s tone remains optimistic but is more forward-looking, especially regarding the legal resolution and regulatory process, while analysts maintain a probing, risk-focused approach.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management highlighted the need for final resolution of outstanding appeals before the $479 million settlement payment can be made.</li>\n<li>Ongoing challenges include successful execution of the wildfire safety strategy, regulatory approval of rate rebasing, and securing low-cost financing for CapEx.</li>\n<li>The company faces risk from further legal proceedings, regulatory delays, and capital market conditions affecting financing plans.</li>\n<li>Analysts raised concerns about appeal outcomes, timing of capital raises, and the impact of regulatory processes on earnings visibility.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Hawaiian Electric Industries reported substantial progress toward finalizing the Maui wildfire tort settlements, advanced wildfire safety investments, and maintained stable customer bills despite significant capital outlays. The company reiterated its 2026 CapEx guidance of $550 million to $700 million and outlined further regulatory and financing milestones ahead, including a joint proposal on rate rebasing and a planned CFO transition. Management emphasized that successful litigation resolution and prudent capital management will remain top priorities as the company continues its strategic transformation in the face of evolving risks and regulatory demands.</p>\n<p><a href=\"https://seekingalpha.com/symbol/he/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558935-hawaiian-electric-signals-550m-700m-capex-for-2026-as-wildfire-settlements-near-final",
            "pub_date": "2026-02-28 07:00:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558934",
            "title": "Arlo projects $375M–$385M service revenue in 2026 as partnerships and SaaS model drive outlook",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Arlo Technologies (ARLO) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Matthew McRae reported \"an incredibly strong fourth quarter\" with total revenue at $141 million and service revenue at $89 million, the latter growing 39% year-over-year and constituting 63% of total revenue. McRae stated, \"Fourth quarter EBITDA hit $23 million, up an incredible 138% year-over-year and resulted in Arlo posting $0.22 of non-GAAP EPS, substantially above the high end of our guidance range.\"</li>\n<li>McRae highlighted the deployment of Arlo Secure 6, noting its \"advanced multi-recognition engine, AI-based scene descriptions, numerous new AI-based audio detections and the only personalized AI micro model capability in the world.\" He emphasized the impact of the largest device launch in company history, shipping \"more than 800,000 units in the first 60 days of production.\"</li>\n<li>McRae emphasized SaaS performance with churn dropping to 1% and subscriber retention at 99%. He added, \"Average monthly revenue per user grew to $15.30 during Q4,\" with these subscriptions generating a 94% gross margin.</li>\n<li>CFO Kurt Binder stated, \"We ended 2025 with actual consolidated revenue of about $530 million and subscriptions and services revenue at $316 million or 60% of total revenue.\" Binder added, \"We delivered an impressive non-GAAP EPS of $0.70, surpassing the high end of our guidance even withstanding the impact of tariffs.\"</li>\n<li>Binder highlighted a 24% increase in paid accounts to 5.7 million and a 23% increase in retail POS volume linked to the new product launch. \"Our services transformation has been remarkable as we ended 2025 with over $316 million in subscriptions and services revenue, up 30% year-over-year.\"</li>\n<li>McRae announced partnerships with Samsung and Comcast, stating that the Comcast partnership \"could grow larger than our Verisure partnership over time.\" The new Samsung service is \"our first partnership that is solely based on SaaS services without reliance on a hardware component.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Binder provided guidance for Q1 2026: consolidated revenue between $135 million and $145 million, GAAP net earnings per share of $0.01 to $0.07, and non-GAAP net income per diluted share of $0.17 to $0.23.</li>\n<li>For full year 2026, Binder forecasted consolidated revenue of $550 million to $580 million, with service revenue targeted at $375 million to $385 million, comprising more than 65% of total revenue. \"We expect our non-GAAP net income per diluted share to be between $0.75 and $0.85 per share.\"</li>\n<li>Management said, \"We will implement initiatives to improve customer retention and drive higher conversion, and we will adjust our innovative service offerings to enable us to deliver ARPU growth and expanded ARR.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Arlo posted Q4 non-GAAP net income of $23.9 million or $0.22 per diluted share. For 2025, non-GAAP net income was $77.3 million or $0.70 per share, up from $0.40 in 2024.</li>\n<li>Non-GAAP gross profit for Q4 was $67.6 million, with a non-GAAP gross margin of 47.8%. Product gross margins rebounded by almost 300 basis points from Q3 to negative 14.4% in Q4.</li>\n<li>Free cash flow for 2025 reached $66.9 million with a free cash flow margin of 12.6%. Year-end cash was $166 million, up $15 million year-over-year after investments and share repurchases.</li>\n<li>Inventory was $41.2 million, down from $44 million in Q3. Inventory turnover was 5.9x for Q4, down from 6.4x in Q3.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Jacob Stephan, Lake Street Capital Markets, LLC: Asked about the Comcast and ADT partnerships. McRae responded, \"ADT is going very well. The technical integration was basically done by the end of last year... the original target was sometime in the middle of this year.\" On Comcast, McRae said, \"The integration of a very large partnership like this takes usually between 9 and maybe 12 months... it could grow larger than our Verisure partnership.\"</li>\n<li>Stephan asked about new hardware products. McRae replied, \"You'll see some updates to some of those products and a couple of new form factors this year... The other thing we're starting to work on is making a more deliberate push into small business.\"</li>\n<li>Rian Bisson, Craig-Hallum: Inquired about shelf share and competition. McRae stated, \"We'll be launching additional product SKUs... expanding into some additional retailers over the next 6 to 9 months as well.\" He discussed potential regulatory actions against certain competitors, \"There's likely to be some action sometime this year that could block the import of 1 or 2 brands that could open up as much as maybe somewhere between 10% and maybe 20% of unit volume in the United States to be captured.\"</li>\n<li>Hamed Khorsand, BWS Financial Inc.: Asked about the cash balance and CapEx for partnerships. Binder noted investments in Origin Wireless and share repurchases, and stated, \"There will be a level of investment we'll need to make... that is factored into our 2026 guidance.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on the scale and timing of partnerships, sustainability of service revenue growth, competitive positioning, and cash deployment. The tone was positive but probing for detail on execution and risks.</li>\n<li>Management’s tone was confident and detailed, repeatedly referencing \"record-breaking\" results and expressing optimism about future growth, as in \"I have never been more excited about the vast opportunities that lay in front of us.\"</li>\n<li>Compared to the previous quarter, management’s sentiment remained highly positive, while analysts showed increased interest in the impact and timing of new partnerships and the durability of Arlo's SaaS model.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Q4 guidance for revenue and EPS was higher than Q3. Service revenue as a percentage of total revenue increased to 63% in Q4 from 57% in Q3.</li>\n<li>Management cited new strategic partnerships in Q4, with Samsung and Comcast added to previously announced collaborations.</li>\n<li>Gross margin improved significantly in Q4, with non-GAAP gross margin up to 47.8% from 41% in Q3, and product gross margins rebounded by almost 300 basis points quarter-over-quarter.</li>\n<li>Analysts’ focus shifted more toward the execution of large partnerships, cash allocation, and the sustainability of SaaS-driven growth.</li>\n<li>Management's confidence in strategic expansion and recurring revenue growth was more prominent in Q4.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management flagged continued uncertainty regarding tariffs, stating, \"Given the lack of clarity, our outlook assumes that we will remain subject to the 20% tariff structure.\"</li>\n<li>Analysts raised questions about the impact of privacy concerns, the risk of AI disintermediation, and supply chain challenges, particularly memory costs and availability. McRae explained, \"There's an inability to actually be disintermediated that doesn't exist in many markets, and that's driven from our dual relationship with the end user.\"</li>\n<li>Binder commented on supply chain, \"At this point in time in all of our discussions with our suppliers, we feel like the supply is available to us and any increase or incremental cost has already been factored into our medium- to long-term plan.\"</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Arlo’s Q4 2025 call showcased record service revenue growth, robust SaaS metrics, and the successful launch of strategic partnerships with Samsung and Comcast, positioning the company for further expansion in 2026. Management projects service revenue to surpass $375 million next year, with continued investment in innovation, channel expansion, and operational execution. The company remains focused on capturing additional market share and driving recurring revenue, supported by a strong balance sheet and a disciplined capital allocation strategy.</p>\n<p><a href=\"https://seekingalpha.com/symbol/arlo/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558934-arlo-projects-375m-385m-service-revenue-in-2026-as-partnerships-and-saas-model-drive-outlook",
            "pub_date": "2026-02-28 06:51:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558917",
            "title": "Gold, silver cap historic month with best-ever dollar gains; U.S.-Iran tensions in focus",
            "description": "<html><body><p data-eci=\"true\">Gold and silver futures rose Friday to wrap up their best-ever monthly dollar gains in February, with gold also enjoying its best monthly percentage increase since January 2012.</p>\n<p>Front-month Comex gold (<a href=\"https://seekingalpha.com/symbol/XAUUSD:CUR\" title=\"Gold Spot Price\">XAUUSD:CUR</a>) for March delivery rallied 10.9% this month to $5,230.50/oz, while front-month March Comex silver (<a href=\"https://seekingalpha.com/symbol/XAGUSD:CUR\" title=\"Silver Spot Price\">XAGUSD:CUR</a>) sizzled 18.4% in February to $92.682/oz, rising 3.3% and 12.5%, respectively, this week.</p>\n<p>Gold has gained for seven straight months, climbing nearly 60% in that time, and silver has increased for 10 consecutive months, skyrocketing 185% for the period.</p>\n<p>On Friday, gold added 1% and silver surged 6.5%, as markets headed into the weekend sensing a heightened risk of U.S. military action against Iran.</p>\n<p>Talks between the two countries ended Thursday without a deal, with the two sides still seen far from any agreement, and the U.S. Embassy in Israel said the State Department authorized non-emergency staff and their families to leave the country, citing safety risks.</p>\n<p><span>\"There's a lot of nervousness surrounding geopolitics, you have all the set-up for a high probability of a military operation over the weekend, so it's a risk-off in a flight to safety,\" Blue Line Futures chief market strategist Phillip Streible said.</span></p>\n<p>Prices also have been supported by uncertainty over U.S. global tariffs and the future of existing trade deals following the Supreme Court's recent ruling, <span>the so-called dollar debasement trade, and concerns about the Federal Reserve’s independence.</span></p>\n<p><span>On Friday,</span> the latest U.S. data showed monthly wholesale inflation unexpectedly sped up in January, helping send <span>U.S. 10‑year Treasury yields to a three-month low, making non-yielding gold more attractive.</span></p>\n<p>Gold has been helped in the near term by the return of China to markets after a pause to celebrate the Lunar New Year, and Suki Cooper of Standard Chartered sees more upside in the longer term, \"continuing to expect gold to retrace its lost gains at a more modest pace.\"</p>\n<p>ETFs: (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GLD\" title=\"SPDR Gold Shares ETF\">GLD</a></span>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GDX\" title=\"VanEck Gold Miners ETF\">GDX</a></span>), (<a href=\"https://seekingalpha.com/symbol/GDXJ\" title=\"VanEck Junior Gold Miners ETF\">GDXJ</a>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IAU\" title=\"iShares Gold Trust ETF\">IAU</a></span>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NUGT\" title=\"Direxion Daily Gold Miners Index Bull 2X Shares ETF\">NUGT</a></span>), (<a href=\"https://seekingalpha.com/symbol/PHYS\" title=\"Sprott Physical Gold Trust USD\">PHYS</a>), (<a href=\"https://seekingalpha.com/symbol/GLDM\" title=\"SPDR Gold MiniShares Trust ETF\">GLDM</a>), (<a href=\"https://seekingalpha.com/symbol/AAAU\" title=\"Goldman Sachs Physical Gold ETF\">AAAU</a>), (<a href=\"https://seekingalpha.com/symbol/SGOL\" title=\"abrdn Physical Gold Shares ETF\">SGOL</a>), (<a href=\"https://seekingalpha.com/symbol/RING\" title=\"iShares MSCI Global Gold Miners ETF\">RING</a>), (<a href=\"https://seekingalpha.com/symbol/BAR\" title=\"GraniteShares Gold Trust ETF\">BAR</a>), (<a href=\"https://seekingalpha.com/symbol/OUNZ\" title=\"VanEck Merk Gold ETF\">OUNZ</a>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SLV\" title=\"iShares Silver Trust ETF\">SLV</a></span>), (<a href=\"https://seekingalpha.com/symbol/PSLV\" title=\"Sprott Physical Silver Trust USD\">PSLV</a>), (<a href=\"https://seekingalpha.com/symbol/SIVR\" title=\"abrdn Physical Silver Shares ETF\">SIVR</a>), (<a href=\"https://seekingalpha.com/symbol/SIL\" title=\"Global X Silver Miners ETF\">SIL</a>), (<a href=\"https://seekingalpha.com/symbol/SILJ\" title=\"Amplify Junior Silver Miners ETF\">SILJ</a>)</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558917-gold-silver-cap-historic-month-with-best-ever-dollar-gains-us-iran-tensions-in-focus",
            "pub_date": "2026-02-28 06:51:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558930",
            "title": "THS Maple Holdings CFO to depart, hires advisory firm for finance role",
            "description": "<html><body><ul>\n<li>THS Maple Holdings (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/YAY:CA\" title=\"THS Maple Holdings Ltd.\">YAY:CA</a></span>) on Friday said that Chief Financial Officer Claude Lambert will leave his role effective February 26, 2026.</li>\n<li><p data-eci=\"true\" data-pm-slice=\"0 0 []\">The company said it has engaged Services Groupe Pur to provide CFO services effective March 1.</p></li>\n<li>THS said the firm will support financial reporting, regulatory compliance, governance, and strategic financial planning.</li>\n<li>YAY:CA closed <span>-0.0%</span> at $0.095.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20418202-ths-maple-holdings-announces-change-in-chief-financial-officer\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558930-ths-maple-holdings-cfo-to-depart-hires-advisory-firm-for-finance-role",
            "pub_date": "2026-02-28 06:40:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}