{
    "data": [
        {
            "id": "4558725",
            "title": "Alpha Bank Non-GAAP EPS of €0.36",
            "description": "<html><body><ul>\n<li>Alpha Bank <a href=\"https://www.alpha.gr/-/media/AlphaGr/Files/Group/Apotelesmata/2025-FY/20260227-presentation.pdf\" rel=\"nofollow\" target=\"_blank\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ALBKY\" title=\"Alpha Bank S.A.\">ALBKY</a></span>): Q4 Non-GAAP EPS of €0.36.</li>\n<li>Net Interest Income of €413M.</li>\n<li>FY25 Net Interest Income of €1.61B.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558725-alpha-bank-non-gaap-eps-of-0_36",
            "pub_date": "2026-02-27 22:21:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558694",
            "title": "PC, smartphone market to see a 'challenging' 2026 amid memory shortage, rising prices",
            "description": "<html><body><p data-eci=\"true\">The year 2026 is expected to be another challenging year for the personal computers and smartphone markets amid a global memory shortage crisis, according to research firm IDC.</p>\n<p>The firm noted that the current situation is now more negative than even its most pessimistic scenarios suggested just a few months ago.</p>\n<p>\"The confluence of a deepening memory supply crisis, aggressive pull- forward activity that has front-loaded volumes, rising ASPs [average selling prices] that will suppress unit growth, and a volatile trade policy landscape makes precision forecasting extraordinarily difficult,\" said IDC in a blog post.</p>\n<p>Original equipment manufacturers, or OEMs, had ramped up shipments of PCs and smartphones in the fourth quarter of 2025 as concerns about DRAM and NAND pricing escalated in late 2025. This trend has continued into the first quarter of 2026 for the PC market, as OEMs rushed to ship products before memory and storage price increases take full effect, according to the research firm.</p>\n<p>\"For smartphones, the situation is exasperated, with Q1 2026 forecast to decline 6.8%. As memory prices climb and some vendors, particularly smaller ones, struggle to secure and/or pay for adequate supply, we expect unit volumes to fall off dramatically beginning in the second quarter,\" said the report.</p>\n<p>The firm noted that ASPs will rise, but volume demand will weaken in response. The net effect will be negative year-over-year unit growth for the full year, even as the revenue picture looks deceptively stable due to inflated ASPs.</p>\n<p>For PCs, IDC is now forecasting the global market to decline by 11.3% in 2026, while revenues grow 1.6% due to increased ASPs. The current forecast shows the market flattening in 2027, with a rebound now pushed out to 2028. </p>\n<p>The firm noted that the smartphone market looks even more dire and now expects the global market to decline by 12.9% in 2026, with revenues declining slightly by 0.5%. It expects 2027 to see a modest 1.9% growth for smartphones, with a stronger 5.2% rebound in 2028.</p>\n<p>IDC expects the memory supply challenges to continue throughout 2026 and likely well into 2027. </p>\n<p>The firm does not expect the rate of memory price acceleration to slow in the second half of this year but thinks prices will continue to rise and remain elevated. IDC said their model does not point to a reversion to 2025 pricing levels within the forecast horizon.</p>\n<p>\"The structural dynamics driving the shortage, surging AI infrastructure demand competing with consumer device needs for the same DRAM and NAND capacity, remain firmly in place. There may be some relief as memory capacity buildouts increase and smaller memory suppliers in China come into play. However, we do not expect it to offset the shortage in a meaningful way and change the trajectory of the crisis,\" said the firm.</p>\n<p>IDC noted that the consequences of the crisis are becoming clearer and will reshape competitive dynamics in the PC and smartphone markets as well as in other device markets like tablets, XR headsets, wearables, and gaming consoles.</p>\n<p>The firm expects companies with greater purchasing power, stronger supplier relationships, and the ability to commit to large-volume contracts will be better positioned to secure memory allocations at high but more manageable prices. Meanwhile, smaller and regional vendors, who are already operating on thin margins, will find it difficult to compete for supply, according to the report.</p>\n<p>IDC expects meaningful market share shifts in favor of the largest global OEMs over the course of 2026.</p>\n<p>The firm expects vendors to start shipping some new devices with less memory than consumers have grown accustomed to. For example, a phone that may have shipped with 12 GB of RAM and 256 GB of storage a year ago may now launch with 8 GB of RAM and 128 GB of storage at the same price point, or worse.</p>\n<p>The same is expected to happen in PCs, where base configurations could see meaningful reductions in Random Access Memory, or RAM, and Solid State Drive, or SSD, capacity, the report added.</p>\n<p>For smartphones, IDC expects a significant reduction of total addressable market, or TAM, in the current forecast period and a consolidation of the competitive landscape.</p>\n<p>In addition, IDC said that the memory mix-down trend is particularly concerning for the AI PC category.</p>\n<p>The firm noted that despite heavy marketing investment and the integration of dedicated Neural Processing Units, or NPUs, AI PCs have so far failed to deliver on the transformative capabilities promised to consumers and enterprise buyers.</p>\n<p>\"Now, just as the industry needs to build a more compelling AI story around the PC, the memory crisis threatens to undermine the foundation required to do so,\" said IDC. </p>\n<p>IDC also said that the policy environment is adding to volatility. </p>\n<p>\"For the device industry, this creates deep uncertainty. A 15% tariff on finished goods and components layers additional cost pressure on top of already-inflated memory prices,\" said the firm.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558694-pc-smartphone-market-to-see-a-challenging-2026-amid-memory-shortage-rising-prices",
            "pub_date": "2026-02-27 22:21:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558700",
            "title": "OpenAI confirms $110B funding round, with $50B from Amazon, and $30B from Nvidia, SoftBank",
            "description": "<html><body><p data-eci=\"true\">OpenAI (<a href=\"https://seekingalpha.com/symbol/OPENAI\" title=\"OpenAI\">OPENAI</a>) confirmed on Friday that it has raised an astonishing $110B in its latest funding round, with $50B coming from Amazon (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a></span></span></span></span></span>) and $30B apiece from Nvidia (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a></span></span></span></span></span>) and SoftBank (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SFTBY\" title=\"SoftBank Group Corp.\">SFTBY</a></span></span></span></span></span>).</p>\n<p>“Today we’re announcing $110B in new investment at a $730B pre-money valuation. This includes $30B from SoftBank, $30B from NVIDIA, and $50B from Amazon,” OpenAI said in a <a href=\"https://openai.com/index/scaling-ai-for-everyone/\" rel=\"nofollow\" target=\"_blank\" title=\"statement\">statement</a>. “We’ve also signed a strategic partnership with Amazon and secured next generation inference compute with NVIDIA. Additional financial investors are expected to join as the round progresses.”</p>\n<h2>OpenAI details</h2>\n<p>OpenAI provided some details on its business and said it had more than 900M weekly active users, including more than 50M paying consumer subscribers and more than 9M paying business users.</p>\n<p>“Subscriber momentum accelerated meaningfully to start the year, with January and February on track to be the largest months for new subscribers in our history,” OpenAI added.</p>\n<p>OpenAI explained that the tech space has moved into a new phase where AI moves from research into daily use at scale and that the winners will be defined as to which companies “can scale infrastructure fast enough to meet demand, and turn that capacity into products people rely on.”</p>\n<p>As part of the new funding round, OpenAI said the value of the OpenAI Foundation’s stake in OpenAI Group is now over $180B. </p>\n<h2>Amazon </h2>\n<p>As part of the funding round, OpenAI and Amazon signed a deal to have Amazon Web Services be the “exclusive third-party cloud distribution provider for OpenAI Frontier, which enables organizations to build, deploy, and manage teams of AI agents,” OpenAI <a href=\"https://openai.com/index/amazon-partnership/\" rel=\"nofollow\" target=\"_blank\" title=\"said\">said in a separate statement.</a></p>\n<p>The two companies will expand their <a href=\"https://seekingalpha.com/news/4512964-amazon-openai-ink-massive-38b-deal-to-supply-hundreds-of-thousands-of-nvidia-gpus\" rel=\"noopener\" target=\"_blank\" title=\"previous\">previous</a> $38B deal by $100B over 8 years, OpenAI added. As part of that, AWS and OpenAI will co-create a Stateful Runtime Environment powered by OpenAI models, available on Amazon Bedrock for AWS customers. </p>\n<p>OpenAI will also consume 2 gigawatts of Trainium capacity through AWS infrastructure, and they will develop customized models to power Amazon's customer-facing apps, the companies said.</p>\n<p>The commitment also goes beyond existing Trainium chips and includes the upcoming Trainium4, expected to be delivered next year. </p>\n<p>“OpenAI and Amazon share a belief that AI should show up in ways that are practical and genuinely useful for people,” OpenAI CEO Sam Altman said in a <a href=\"https://openai.com/index/amazon-partnership/\" rel=\"nofollow\" target=\"_blank\" title=\"statement\">statement</a>. “Combining OpenAI’s intelligence with Amazon’s infrastructure and global reach helps us put powerful AI into the hands of businesses and users at real scale.”</p>\n<p>Amazon's $50B will come in two tranches: $15B initially and then $35B in the coming months when certain conditions are met. The companies did not specify what those conditions were, but previous reports <a href=\"https://seekingalpha.com/news/4558016-amazons-investment-into-openai-could-be-tied-to-ipo-agi-report\" target=\"_blank\" title=\"indicated\">indicated</a> the additional money could be tied to an OpenAI IPO or its achievement of artificial general intelligence.</p>\n<h2>Nvidia </h2>\n<p>OpenAI also said that it was expanding its long-standing deal with Nvidia. It will use 3 gigawatts of dedicated inference capacity and 2 gigawatts of training on Nvidia's upcoming Vera Rubin systems. </p>\n<p>“We’re pushing the frontier across infrastructure, research, and products to make AI more capable, reliable, and broadly useful,” Altman added. “SoftBank, NVIDIA, and Amazon are long-term partners who share our ambition to turn real scientific progress into systems that deliver meaningful benefits for people at global scale. Building AI that works for everyone will require deep collaboration across the stack, and we’re excited to do this together.”</p>\n<h2>SoftBank</h2>\n<p>Upon completion of the funding round, SoftBank now owns approximately $64.6B worth of OpenAI, or roughly 13% of the company. </p>\n<h2>Microsoft</h2>\n<p>Given the more in-depth relationship between Amazon and OpenAI, OpenAI also provided an update on its relationship with Microsoft (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a></span></span>).</p>\n<p>“As conversations around AI investments and partnerships grow and as OpenAI announces new funding and new partners as they did today, we want to ensure these announcements are understood within the existing construct of our partnership,” OpenAI and Microsoft <a href=\"https://openai.com/index/continuing-microsoft-partnership/\" rel=\"nofollow\" target=\"_blank\" title=\"said\">said</a> in a joint statement. “Nothing about today’s announcements in any way changes the terms of the Microsoft and OpenAI relationship that have been previously shared in our joint blog in October 2025⁠.”</p>\n<p>Core tenets of the relationship include that the two companies will continue to “work closely” across research, engineering, and product development; Microsoft still has its exclusive licenses and access to intellectual property across OpenAI models and products; the commercial and revenue share relationships are unchanged; and Azure is still the exclusive cloud provider of stateless OpenAI APIs.</p>\n<p>OpenAI added that its first-party products, including Frontier, will still be hosted on Azure, and the definition of artificial general intelligence and processes remains unchanged.</p>\n<p>“The partnership was designed to give Microsoft and OpenAI room to pursue new opportunities independently, while continuing to collaborate, which each company is doing, together and independently,” the two companies added. “We remain committed to our partnership and to the shared mission that brought us together. We continue to work side‑by‑side to deliver powerful AI tools, advance responsible development, and ensure that AI benefits people and organizations everywhere.”</p>\n<p><em>(This story has been updated to include additional information.)</em></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558700-openai-confirms-110b-funding-round-with-50b-from-amazon-and-30b-from-nvidia-softbank",
            "pub_date": "2026-02-27 22:16:06",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558697",
            "title": "Autodesk fires on all cylinders after finalizing go-to-market optimization strategy: analysts",
            "description": "<html><body><p data-eci=\"true\">Autodesk's (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ADSK\" title=\"Autodesk, Inc.\">ADSK</a></span>) fourth quarter fiscal 2026 <a href=\"https://seekingalpha.com/news/4558125-autodesk-ascends-after-q4-results-and-outlook-douse-ai-disruption-fears\" target=\"_blank\" title=\"results\">results</a> and fiscal 2027 outlook proved the company is embracing, and thriving, in the age of artificial intelligence.</p>\n<p>The computer-aided design software company also completed its go-to-market optimization strategy, which could cause temporary disruption to billings during the early part of fiscal 2027.</p>\n<p>\"However, the CFO emphasized that the underlying momentum of the business is expected to remain strong, similar to fiscal 2026,\" said J.P. Morgan analysts, led by Alexei Gogolev, in an investor note. \"Management provided fiscal 2027 guidance that incorporates prudence for potential near-term disruption from sales restructuring, with billings growth no longer benefiting from the new transaction model or annual billing transitions. The company continues to advance its AI strategy, leveraging its unique advantages in specialized data, industry context, and platform capabilities to build agentic AI for design and make workflows.\"</p>\n<p>J.P. Morgan reiterated its Overweight rating and increased its price target to $336 from $319.</p>\n<p>Meanwhile, BTIG reiterated its Buy rating but lowered its price target to $300 from $365.</p>\n<p>\"Revenue growth (CC &amp; adj. for new transaction model) of 14% was nicely ahead of our 11% estimate and Billings growth (CC &amp; adj. for new transaction model) of 32% was also well ahead of our 17% estimate,\" said BTIG analysts, led by Nick Altmann, in a Friday note. \"A large pool of EBA renewals and linearity helped drive greater billings upside in the quarter along with cRPO growth (23% vs. 16% consensus estimates).\"</p>\n<p>\"FY27 revenue guidance was also ahead of consensus at $8,100M-$8,170M (+12-13% growth) vs. $7,962M consensus (+11%) and ADSK expects revenue growth of 9-10% (adj. for new transaction model),\" Altmann added. \"Regarding the outlook, mgmt noted the framework incorporates GTM disruption given the aforementioned RIF was largely customer-facing roles, though mgmt. pointed out last year's framework incorporated both a new CFO &amp; new CRO. Net, we expect less upside to estimates in FY27 vs. FY26 given a lower magnitude of moving parts.\"</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558697-autodesk-fires-on-all-cylinders-after-finalizing-go-to-market-optimization-strategy-analysts",
            "pub_date": "2026-02-27 22:10:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558718",
            "title": "Globalstar GAAP EPS of -$0.11 misses by $0.07, revenue of $71.96M beats by $1.32M",
            "description": "<html><body><ul>\n<li>Globalstar <a href=\"https://seekingalpha.com/pr/20417442-globalstar-announces-fourth-quarter-and-full-year-2025-results\">press release</a>  (GSAT): Q4  GAAP EPS of -$0.11 <font color=\"red\"> misses by $0.07</font>.</li>\n<li>Revenue of $71.96M (+17.6% Y/Y) <font color=\"green\"> beats by $1.32M</font>.</li>\n</ul>\n<p data-eci=\"true\">FINANCIAL GUIDANCE</p>\n<p>Our financial guidance for 2026 is as follows:</p>\n<ul>\n<li>Total revenue between $280 million and $305 million</li>\n<li>Adjusted EBITDA margin of approximately 50%</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558718-globalstar-gaap-eps-of-0_11-misses-by-0_07-revenue-of-71_96m-beats-by-1_32m",
            "pub_date": "2026-02-27 22:00:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558708",
            "title": "Trump Media plans to spin off units including Truth Social into new publicly-traded company",
            "description": "<html><body><p data-eci=\"true\">Trump Media &amp; Technology Group (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DJT\" title=\"Trump Media &amp; Technology Group Corp.\">DJT</a></span></span>) <a href=\"https://seekingalpha.com/pr/20417470-trump-media-and-technology-group-tae-technologies-and-texas-ventures-acquisition-iii-announce\" target=\"_blank\" title=\"said\">said</a> it is engaged in talks over a potential spin-off of businesses, including Truth Social.</p>\n<p>The social media platform said discussions are ongoing for the potential spin-off into a new publicly-traded company, SpinCo, following the close of its <a href=\"https://seekingalpha.com/news/4536978-trump-media-tae-begin-site-selection-planning-process-for-fusion-power-plant\" target=\"_blank\" title=\"merger\">merger</a> with TAE Technologies.</p>\n<p>SpinCo shares are planned to be distributed to TMTG shareholders of record as of prior to the close of merger. SpinCo is set to merge with Texas Ventures III.</p>\n<p>DJT shares were <span>+1.55%</span> Friday pre-market to $11.13.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558708-trump-media-plans-to-spin-off-units-including-truth-social-into-new-publicly-traded-company",
            "pub_date": "2026-02-27 22:00:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558713",
            "title": "Koppers targets $300M free cash flow over three years as Catalyst initiatives accelerate",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Koppers Holdings Inc. (KOP) Q4 2025 </p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Leroy M. Ball stated the company achieved adjusted EBITDA of $256.7 million and a 13.7% adjusted EBITDA margin for 2025, describing it as the second highest year on record, and highlighted $4.07 in adjusted EPS, marking the sixth consecutive year above $4. Ball emphasized, “operating cash flow of $122.5 million for the seventh straight year of more than $100 million in that category.” He noted capital expenditures had returned to a normalized $55 million, enabling $38.2 million in share repurchases and $6.4 million in dividends. </li>\n<li>Ball reported, “In early 2025, we launched our transformation process named Catalyst, which delivered $46 million in benefits during the year.” He outlined the exit from the phthalic anhydride business and the sale of the railroad structures business as major strategic moves, as well as reducing adjusted SG&amp;A by 15% and employee count by 11%. </li>\n<li>Ball shared that the Board approved a long-term incentive program aligned with goals such as double-digit adjusted EPS growth over three years, $300 million of cumulative free cash flow, and a mid-teens margin run rate by 2028. </li>\n<li>Ball also announced the retirement of CFO Jimmi Sue Smith, commending her role in capital deployment and share repurchases. Bradley Pearce is serving as Interim CFO during the search for a successor.</li>\n<li>Interim CFO Bradley Pearce reported, “we reported consolidated fourth quarter sales of $433 million, down $44 million or 9% from the prior year.” He detailed segment decreases: RUPS down $7 million, PC down $20 million, CM&amp;C down $17 million. Pearce noted, “adjusted EBITDA for the fourth quarter was $53 million, which represents a 12.3% EBITDA margin on sales.” </li>\n<li>Pearce highlighted share buybacks totaling $38 million in 2025, and an increased quarterly dividend to $0.09 per share for 2026, a 13% rise. </li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Ball projected, “a top line increase of approximately 11% in 2026, driven entirely by market share expansion in both our residential and industrial product lines” for the Performance Chemicals (PC) segment. He cautioned, “we're expecting a mix of increases and decreases in our raw materials to mostly balance out and have little impact,” but noted copper prices are “25% higher than average prices for 2025.”</li>\n<li>For Utility and Industrial Products (UIP), Ball expects further top line performance in 2026, underpinned by regional expansion, the utility pole procurement acquisition, and modest organic growth. </li>\n<li>Regarding RUPS, Ball stated, “our piece of it is expected to grow to volumes that we haven't seen since 2017,” despite industry consolidation and volume pullbacks from Class 1 railroad customers. </li>\n<li>Consolidated sales guidance for 2026 is $1.9 billion to $2 billion, with adjusted EBITDA forecast between $250 million and $270 million. Adjusted EPS is guided to a range of $4.20 to $5 per share in 2026, compared to $4.07 in 2025. Ball added, “we are expecting to see a sizable jump in both operating cash flow and free cash flow this year.” </li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Fourth quarter consolidated sales were $433 million, with full year sales at $1.9 billion, compared to $2.1 billion in the prior year. </li>\n<li>PC segment delivered adjusted EBITDA of $28 million for Q4, RUPS $22 million, and CM&amp;C $4 million. </li>\n<li>Full year adjusted EBITDA was $257 million, with segment contributions of $108 million for RUPS, $103 million for PC, and $46 million for CM&amp;C. </li>\n<li>Share buybacks amounted to $38 million for 2025, with $67 million remaining on the repurchase authorization. </li>\n<li>Net debt at year-end was $881 million, with a net leverage ratio of 3.4x. </li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Gary Prestopino, Barrington Research, asked about PC market share recovery and price dynamics. Ball responded, “We did take a market share hit in 2025…there was some business that was available to potentially recapture in -- heading into 2026, and we were able to convert on a portion of that. But… the bulk of the business that we're adding in 2026 is unrelated to that market share loss.”</li>\n<li>Prestopino asked about Catalyst benefits for 2026. Ball replied, “we're targeting somewhere between $20 million and $40 million of Catalyst benefits in 2026.”</li>\n<li>Prestopino queried the rationale for retaining CM&amp;C. Ball said, “it is a significant component of our supply chain…there's a whole host of constraints…we continue to look at our business portfolio actively. Nothing is off the table.”</li>\n<li>David Marsh, Singular Research, questioned D&amp;A increases and their outlook. Pearce responded, “D&amp;A obviously is going to change as we close projects and begin to depreciate them.” Ball added, “we are expecting D&amp;A to drop by a couple of million, I think, in 2026.”</li>\n<li>Marsh asked about the split of Catalyst benefits. Ball replied, “It will be heavier on the COGS side…there's pieces to it…most of our Catalyst initiatives were centered around commercial, and it was about being able to win additional business, take some additional market share.”</li>\n<li>Michael Mathison, Sidoti &amp; Company, queried PC adjusted EBITDA margin sustainability. Ball explained, “We did have a benefit of an asset sale that I think helped their results for the quarter and probably added a little bit of that, that is something that is not repeatable. But overall, I'd say the margin profile…I think with what we're doing moving forward, we certainly expect that we're going to be able to generate margins that are in that range.”</li>\n<li>Mathison also asked about the Douglas Fir acquisition. Ball specified, “small business…out in Oregon. It really secures up a Doug Fir supply chain for us…helps improve our opportunities in some of our traditional markets.”</li>\n<li>Liam Burke, B. Riley Securities, inquired about PC commercial segment growth. Ball confirmed, “we're happy with the commercial wins that the team generated in the back half of '25 that will carry into this year.”</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analyst sentiment was cautiously optimistic, with persistent questions on margin durability, strategic direction for CM&amp;C, and the sustainability of cost reduction efforts. Analysts pressed for clarity on segment performance, the future of underperforming units, and structural benefits from new initiatives.</li>\n<li>Management maintained a confident tone about the trajectory of Catalyst, the ability to generate higher free cash flow, and structural improvements, but was measured and transparent about ongoing industry and market headwinds. Ball used language such as, “we're targeting…,” “we believe…,” and “we expect…,” reflecting a blend of confidence and caution. In Q&amp;A, management demonstrated openness to strategic change, especially regarding the CM&amp;C segment.</li>\n<li>Compared to the previous quarter, management’s prepared remarks were more forward-looking and detailed in guidance; the tone shifted from defensive to proactive, emphasizing execution and transformation. Analyst tone remained probing but acknowledged management’s achievements on margin and cost controls.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Management in Q4 provided more granular guidance for 2026, including explicit sales, EBITDA, and EPS ranges, compared to more cautious language in Q3. The Q4 call highlighted a step-up in free cash flow expectations and outlined $20 million to $40 million in Catalyst benefits for 2026, while Q3 deferred specifics on Catalyst impact for the next year.</li>\n<li>Strategic focus shifted further toward growing PC and RUPS, with CM&amp;C confirmed as a shrinking portfolio component. The Douglas Fir acquisition and sales team investments in UIP were new developments absent from Q3.</li>\n<li>Analysts continued to focus on margin sustainability, cost reduction, and the future of CM&amp;C, but asked more about execution and less about macro concerns relative to Q3.</li>\n<li>There was a clearer articulation of the business mix shift and more detail on the rationale for portfolio retention and divestiture in Q4.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited tariff uncertainty, especially with the Supreme Court ruling and ongoing investigations into refined copper imports, as an ongoing risk that could influence PC costs.</li>\n<li>Ball highlighted risks including “realizing the lower end of our Catalyst capture rate and seeing further end market softness,” as well as “higher costs driven by tariffs or other factors and extended operational disruptions.”</li>\n<li>For CM&amp;C, structural improvements are being offset by “higher net global coal tar costs, reduced throughput as a result of a key raw material supplier exiting the market and pricing pressure.”</li>\n<li>Sawmill closures and reduced hardwood availability were noted as near-term risks for RUPS.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Koppers Holdings outlined a strategy focused on accelerating cost transformation through its Catalyst program, aiming for double-digit EPS growth, $300 million in cumulative free cash flow, and a mid-teens margin run rate by 2028. Management underscored its commitment to expanding PC and RUPS as core earnings drivers while actively evaluating the future of CM&amp;C. With an improved sales outlook in key segments and reinforced cost discipline, Koppers expects to capitalize on operational efficiencies and strategic market expansion to drive shareholder value in the coming years.</p>\n<p><a href=\"https://seekingalpha.com/symbol/kop/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558713-koppers-targets-300m-free-cash-flow-over-three-years-as-catalyst-initiatives-accelerate",
            "pub_date": "2026-02-27 21:51:35",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558684",
            "title": "BASF says new year off to 'challenging' start, more cost cuts needed",
            "description": "<html><body><p data-eci=\"true\">BASF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BASFY\" title=\"BASF SE\">BASFY</a></span>) (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BFFAF\" title=\"BASF SE\">BFFAF</a></span>) -2.2% in European trading Friday after warning it will need <span>to <a href=\"https://www.reuters.com/business/basf-says-2026-adjusted-profit-could-slip-or-gain-2026-02-27/\" rel=\"nofollow\" target=\"_self\" title=\"step up cost-saving efforts\">step up cost-saving efforts</a>, as the company faces a continuing slump in Europe's chemicals industry.</span></p>\n<p><span>BASF (<a href=\"https://seekingalpha.com/symbol/BASFY\" title=\"BASF SE\">BASFY</a>) (<a href=\"https://seekingalpha.com/symbol/BFFAF\" title=\"BASF SE\">BFFAF</a>) said it is targeting FY 2026 adjusted EBITDA of €6.2B-€7B, compared with €6.6B in 2025, below the €7.02 analyst consensus estimate listed on the company's website, and that its current cost-cutting push is not enough to counter persistently weak momentum in most major markets.</span></p>\n<p><span>\"The start to the first quarter has been as challenging as expected,\" CEO Markus Kamieth said, citing weak sales volumes in January except in China, where results were inflated by the timing of New Year celebrations.</span></p>\n<p><span>Kamieth<span> warned that BASF's (<a href=\"https://seekingalpha.com/symbol/BASFY\" title=\"BASF SE\">BASFY</a>) (<a href=\"https://seekingalpha.com/symbol/BFFAF\" title=\"BASF SE\">BFFAF</a>) Q1 results may decline from a year earlier due to negative currency exchange effects and factory maintenance that requires downtime.</span></span></p>\n<p><span>The CEO also said BASF (<a href=\"https://seekingalpha.com/symbol/BASFY\" title=\"BASF SE\">BASFY</a>) (<a href=\"https://seekingalpha.com/symbol/BFFAF\" title=\"BASF SE\">BFFAF</a>) now seeks to cut annual costs by €2.3B by year-end, up from €2.1B targeted previously.</span></p>\n<p><span>The weak <span>guidance \"confirmed that low cycle conditions will persist for at least the first part of the year,\" Bernstein analyst </span>James Hooper<span> wrote.</span></span></p>\n<p><span><span>BASF (<a href=\"https://seekingalpha.com/symbol/BASFY\" title=\"BASF SE\">BASFY</a>) (<a href=\"https://seekingalpha.com/symbol/BFFAF\" title=\"BASF SE\">BFFAF</a>) also <a href=\"https://report.basf.com/2025/en/\" rel=\"nofollow\" target=\"_self\" title=\"confirmed\">confirmed</a> preliminary figures for 2025, including a 9.5% decline in full-year EBITDA to €6.55B and a 2.9% reduction in revenues to €59.66B.</span></span></p>\n<p><span><span>For Q4, the company swung to a net profit of €560M from a loss of €786M in the prior-year period, beating the €285M analyst consensus provided by the company, while revenues fell 5.6% Y/Y to €14.03B, in line with the €14.04B consensus.</span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558684-basf-says-new-year-off-to-challenging-start-more-cost-cuts-needed",
            "pub_date": "2026-02-27 21:46:13",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558692",
            "title": "4 stocks to watch: PSKY, META, AMZN, COST",
            "description": "<html><body><p data-eci=\"true\" data-id=\"1a14eedb-8b49-4acd-b3a7-5d637aae33a2\" data-pm-slice=\"0 0 []\"><span data-ai=\"\">Stock index futures were lower on Friday as the January wholesale inflation report came in hotter than expected.</span></p>\n<p data-id=\"90837b65-b382-41fc-9033-754d6a713f6f\"><span data-ai=\"\">Here are the four stocks to watch on the day:</span></p>\n<p data-id=\"22b829cf-59e4-4595-b81d-a015497d0065\"><span data-ai=\"\">Paramount Skydance (<a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a>) rose 4.96% in premarket trade after Netflix ((NFLX)) announced it will not raise its bid for Warner Bros. Discovery ((WBD)). Warner Bros. Discovery’s board deemed a sweetened, all-company takeover offer from Paramount Skydance as “superior.” The <a href=\"https://seekingalpha.com/news/4558365-paramount-wins-the-bidding-war-for-warner-bros-as-netflix-walks-away\" target=\"_blank\" title=\"revised\">revised</a> Paramount Skydance offer stands at $31.00 per share in cash, a one-dollar increase from its earlier bid, valuing the company at approximately $108 billion.</span></p>\n<p data-id=\"2f96ac74-a6d6-45f5-8070-606fa78b6859\"><span data-ai=\"\">Meta Platforms (<a href=\"https://seekingalpha.com/symbol/META\" title=\"Meta Platforms, Inc.\">META</a>) fell 1.37% before the opening bell on reports the company is facing difficulties with internally developed AI chips. According to The Information, Meta has <a href=\"https://seekingalpha.com/news/4558556-metas-internal-chip-design-efforts-face-hurdles\" target=\"_blank\" title=\"scrapped\">scrapped</a> its most advanced chip designed for training AI models after struggling with the chip’s design. The company has shifted its focus to a less complicated version within its AI infrastructure division.</span></p>\n<p data-id=\"4bee6ebd-3483-4dc1-b5f9-ef833abff314\"><span data-ai=\"\">Amazon (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>) declined 0.97% in premarket trade following a report that the company plans to use its proprietary Trainium and Inferentia <a href=\"https://seekingalpha.com/news/4558664-amazon-seeks-to-use-in-house-chips-to-develop-ai-models-exec-says\" target=\"_blank\" title=\"processors\">processors</a> to develop AI models. “If we can build our models on our chips, we can build them at a fraction of the cost of a pure-play AI model provider,” Amazon’s artificial intelligence head Peter DeSantis told The Wall Street Journal. The move is part of a broader effort by the e-commerce giant to achieve cost advantages in the competitive AI landscape.</span></p>\n<p data-id=\"851ee637-5208-498d-97b6-5dd6c20bf31e\"><span data-ai=\"\">Costco (<a href=\"https://seekingalpha.com/symbol/COST\" title=\"Costco Wholesale Corporation\">COST</a>) traded flat in premarket trade after Bank of America <a href=\"https://seekingalpha.com/news/4558639-costco-is-called-a-k-shaped-economy-winner-by-bofa\" target=\"_blank\" title=\"reinstated\">reinstated</a> coverage with a Buy rating. Analyst Christopher Nardone highlighted the retailer’s strong appeal to higher-income consumers and 9% to 10% growth in executive memberships. The shift toward $130-per-year executive tiers is viewed as a sign that consumers are rewarding Costco for its expanding list of perks.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558692-4-stocks-to-watch-psky-meta-amzn-cost",
            "pub_date": "2026-02-27 21:46:13",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558574",
            "title": "Stock index futures slide after hot wholesale inflation report",
            "description": "<html><body><p data-eci=\"true\" data-id=\"f551ab07-3134-4dfd-9674-a1d1dcc052b8\" data-pm-slice=\"0 0 []\"><span data-ai=\"\">Stock index futures were lower on Friday as the January wholesale inflation report came in hotter than expected. </span></p>\n<p data-id=\"eecb4f21-477c-4ffc-a2de-5d120794ddd2\"><span data-ai=\"\">S&amp;P 500 futures (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SPX\" title=\"S&amp;P 500 Futures\">SPX</a></span></span>) fell 0.9%, Nasdaq 100 futures (<a href=\"https://seekingalpha.com/symbol/US100:IND\" title=\"NASDAQ 100 Futures\">US100:IND</a>) -0.9%, and Dow Jones Industrial Average futures (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/INDU\" title=\"Dow Jones Futures\">INDU</a></span></span>) declined 1.1%.</span></p>\n<p data-eci=\"true\">The January U.S. <a href=\"https://seekingalpha.com/news/4558689-producer-price-index-rises-more-than-expected-in-january\" target=\"_blank\" title=\"Producer Price Index\">Producer Price Index</a> came in at +0.5% M/M vs. +0.3% consensus and +0.5% prior, and +2.9% Y/Y vs. +2.6% consensus and +3.0% prior.</p>\n<p>The Core PPI (excluding food and energy) came in at +0.8% M/M vs. +0.3% consensus and +0.7% prior, and +3.6% Y/Y vs. +3.0% consensus and +3.3% prior.</p>\n<p data-id=\"7ff8c3aa-380c-4de2-832f-e877f08c0dfc\"><span data-ai=\"\">Also on the calendar, the Chicago PMI is due during market hours and is forecasted to retreat to 52.5 from a remarkably strong 54.0 in January, following years of contraction.</span></p>\n<p data-id=\"5cca0ef7-9e11-4575-98c2-2abd1b8b4ad5\"><span data-ai=\"\">U.S. Treasury yields edged lower as traders awaited the inflation data. The 10-year Treasury yield (<a href=\"https://seekingalpha.com/symbol/US10Y\" title=\"United States 10-Year Bond Yield\">US10Y</a>) fell to 3.99%, while the 2-year Treasury yield (<a href=\"https://seekingalpha.com/symbol/US2Y\" title=\"United States 2-Year Bond Yield\">US2Y</a>) slipped to 3.41%. The 30-year Treasury yield (<a href=\"https://seekingalpha.com/symbol/US30Y\" title=\"United States 30-Year Bond Yield\">US30Y</a>) moved to 4.65%.</span></p>\n<p data-id=\"00170d6d-1f01-4c29-ba9b-9fc83dbc1689\"><span data-ai=\"\">Top gainers in premarket trading included Block (<a href=\"https://seekingalpha.com/symbol/XYZ\" title=\"Block, Inc.\">XYZ</a>) +19.68%, Dell (<a href=\"https://seekingalpha.com/symbol/DELL\" title=\"Dell Technologies Inc.\">DELL</a>) +12.02%, and Paramount Skydance (<a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a>) +9.30%. Decliners included W.W. Grainger (<a href=\"https://seekingalpha.com/symbol/GWW\" title=\"W.W. Grainger, Inc.\">GWW</a>) -6.64%, Intuit (<a href=\"https://seekingalpha.com/symbol/INTU\" title=\"Intuit Inc.\">INTU</a>) -3.97%, and Workday (<a href=\"https://seekingalpha.com/symbol/WDAY\" title=\"Workday, Inc.\">WDAY</a>) -3.03%.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558574-sp500-nasdaq-dow-jones-outlook-stock-market",
            "pub_date": "2026-02-27 21:40:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}