{
    "data": [
        {
            "id": "4558359",
            "title": "Vital Farms outlines $2B revenue goal by 2030 as volume-driven growth continues",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Vital Farms (VITL) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Russell Diez-Canseco, President, CEO &amp; Director, announced a major leadership transition, stating that \"After nearly 20 years of visionary leadership, our founder, Matt O'Hare, has decided to retire as Executive Chairperson and as a member of our Board of Directors,\" with Diez-Canseco assuming the unified role of Executive Chairperson and CEO. He emphasized, \"For the full year 2025, net revenue grew more than 25% to $759.4 million, which was the midpoint of the revised revenue outlook we shared at our Investor Day in December. Adjusted EBITDA exceeded $100 million for the first time in company history, growing 31.6% to $114 million.\" Diez-Canseco also reported adding approximately 175 farms in a single year, bringing the network to over 600 small farms. He highlighted a \"record revenue year\" and continued market share gains.</li>\n<li>Thilo Wrede, CFO, stated, \"Net revenue for the full year 2025 was $759.4 million, up 25.3% year-over-year, and $213.6 million in the fourth quarter. This growth was driven by a balanced contribution from volume and price mix.\" Wrede further noted, \"Adjusted EBITDA surpassed $100 million for the first time in our history, reaching $114 million for the full year and $29.2 million for the fourth quarter. Net income was $66.3 million or $1.44 per diluted share.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Wrede introduced 2026 net revenue guidance of $900 million to $920 million, representing more than 20% growth, stating, \"The revenue growth has us on track towards our 2030 target.\" He described the outlook as \"a more measured start than our December outlook,\" emphasizing a focus on \"stable retail inventory rather than chasing short-term targets.\" Adjusted EBITDA guidance was set within a range of $105 million to $115 million, with a midpoint margin of 12.0%. Wrede explained, \"This reflects a margin of 12.0% at the midpoint, which is within the range of our previous 2027 long-term targets and puts us strongly on the path to the new 2030 long-term targets.\"</li>\n<li>Management reaffirmed a long-term target of $2 billion in net revenue by 2030, with an adjusted EBITDA margin between 15% and 17%.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Net revenue for Q4 2025 was $213.6 million. Full year net revenue reached $759.4 million, and adjusted EBITDA was $114 million. Gross profit was reported at $285.7 million or 37.6% of net revenue. SG&amp;A expenses were $159.4 million or 21% of net revenue, with marketing investment increasing by $10.4 million. CapEx for the year totaled $82 million. Cash, cash equivalents, and marketable securities stood at $113.4 million as of December 28, 2025, with no debt outstanding.</li>\n<li>Wrede reported that the previously disclosed material weakness in internal controls has been remediated.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Scott Marks, Jefferies LLC, Research Division: Asked about the timing of the revised outlook amid volatility and winter storms. Diez-Canseco responded, \"We always want to make sure that we're setting ourselves up for success... this guide gives us the right amount of room and flexibility,\" and Wrede added, \"We are clearly gaining share in the category. So we are outperforming the category. But it is a bit of a noisy environment right now.\"</li>\n<li>Brian Holland, D.A. Davidson &amp; Co.: Inquired about macro environment concerns and the core consumer. Diez-Canseco clarified, \"We're not seeing evidence of a big change in the confidence or economic reality of our core consumers... but it might mean that we have to be a little more patient as we continue to add consumers.\"</li>\n<li>Matthew Smith, Stifel: Asked about EBITDA margin contraction and promotional activity. Wrede explained, \"We are reinvesting the price increase from last year back into promotions... this is not a step-up in promotions to drive volume. It's really a return to where we should have been promoting.\"</li>\n<li>Megan Christine Alexander, Morgan Stanley: Queried Q1 revenue expectations. Wrede said, \"At this point, 1Q, we're a bit more cautious on it than we were before... maybe the second half might be a bit stronger than the first half.\"</li>\n<li>Jon Andersen, William Blair: Asked about the $100 million share repurchase. Wrede confirmed, \"This is the first buyback program that the Board has authorized since the IPO... now is a good time for us to think about what we can do with that dry powder to create shareholder value.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts were generally neutral to slightly cautious, with several pressing for clarity on macro headwinds, promotional strategy, and the sustainability of growth. Questions probed the justification for revised guidance and the company's ability to maintain volume gains amid industry volatility.</li>\n<li>Management maintained a confident tone during prepared remarks, emphasizing operational strength and long-term strategy, but was more measured and explanatory in the Q&amp;A, acknowledging near-term volatility and a \"noisy environment.\"</li>\n<li>Compared to the previous quarter, both analysts and management displayed a more cautious and pragmatic tone, especially regarding early 2026 performance and macro challenges, whereas the prior quarter emphasized strong performance and expansion.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance shifted from a previously more ambitious stance to a \"more measured start\" for 2026, with management explicitly acknowledging macro volatility and order pacing disruptions from winter storms.</li>\n<li>Strategic priorities remain focused on long-term growth, capacity investments, and expanding brand awareness, but near-term targets were moderated to reflect inventory normalization and external disruptions.</li>\n<li>Analysts' focus shifted from operational expansion and supply chain improvements in Q3 to probing for details on margin compression, promotional strategy, and the sustainability of volume-led growth in Q4.</li>\n<li>Key metrics such as net revenue and adjusted EBITDA reached record levels, but guidance for 2026 reflects moderated near-term expectations.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited volatile order patterns due to macroeconomic factors and severe winter storms as ongoing risks.</li>\n<li>The transition from supply allocation to unconstrained capacity presents challenges in maintaining high-quality placements and avoiding aggressive discounting.</li>\n<li>Continued investments in promotions and operational capacity could impact margins in the short term.</li>\n<li>Analysts raised concerns about the impact of industry competition, promotional environment, and the ability to convert increased brand awareness into household penetration amid category noise.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Vital Farms leadership highlighted record 2025 financial results and ongoing market share gains, while implementing a unified management structure and launching its first share repurchase program. The company reaffirmed its long-term target of $2 billion in net revenue by 2030, with 2026 guidance reflecting a measured approach to growth amid volatile order patterns and macro challenges. Management is focused on leveraging operational investments, expanding capacity, and driving profitable household penetration, positioning the company for sustainable expansion in the evolving specialty egg market.</p>\n<p><a href=\"https://seekingalpha.com/symbol/vitl/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558359-vital-farms-outlines-2b-revenue-goal-by-2030-as-volume-driven-growth-continues",
            "pub_date": "2026-02-27 06:51:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558360",
            "title": "Sempra outlines $65B capital plan and 11% rate base CAGR through 2030, with Texas growth and no equity needs",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Sempra (SRE) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Jeffery Martin, Chairman, President &amp; CEO, highlighted Sempra's execution on five value creation initiatives in 2025, including \"to prioritize utility investments with improved returns,\" noting the deployment of $13 billion in CapEx and a record adjusted EPS of $4.69, at the high end of guidance. Martin announced a new record capital plan of $65 billion for 2026 to 2030, a 17% increase over the prior plan, with $9 billion of upside opportunities being tracked within the plan period.</li>\n<li>Martin detailed the September announcement of a sale of a 45% stake in SI Partners for $10 billion, with anticipated closure in Q2 or Q3 2026, and highlighted key LNG project milestones, such as FID on Port Arthur LNG Phase 2 and mechanical completion at ECA LNG Phase 1.</li>\n<li>Portfolio simplification continued with the agreement to sell Ecogas for approximately $500 million, with completion expected in Q2 or Q3 2026. \"We have more work to do in this area, and it will continue to be a focus in 2026,\" Martin stated regarding ongoing cost structure improvements.</li>\n<li>Karen Sedgwick, Executive VP &amp; CFO, reported \"fourth quarter 2025 GAAP earnings of $352 million or $0.54 per share\" and full year 2025 GAAP earnings of $1.796 billion or $2.75 per share. She noted full year adjusted earnings of $3.066 billion or $4.69 per share, with adjusted EPS at the high end of guidance range, and described the capital plan as \"primarily driven by strong growth at Sempra Texas, most notably from the acceleration of the Permian Basin Reliability Plan.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Sempra affirmed full year 2026 adjusted EPS guidance of $4.80 to $5.30, introduced 2027 EPS guidance of $5.10 to $5.70, and issued a 2030 EPS outlook of $6.70 to $7.50. Sedgwick stated, \"we believe we have one of the highest projected growth rates in the sector, and our 2030 outlook shows that our strong long-term growth expectations continue through the end of the decade.\"</li>\n<li>The company projects overall rate base to increase from $57 billion in 2025 to $97 billion in 2030, reflecting an 11% five-year CAGR, with Sempra Texas rate base expected to grow at an 18% CAGR over the plan period.</li>\n<li>The plan eliminates the need for new common equity issuances to fund base capital, with over $50 billion provided by operational cash flows and expected transaction proceeds.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>For Q4 2025, Sempra reported adjusted earnings of $841 million or $1.28 per share, compared to $960 million or $1.50 per share in Q4 2024. Full year 2025 adjusted earnings were $3.066 billion or $4.69 per share, compared to $2.969 billion or $4.65 per share in 2024.</li>\n<li>Sedgwick explained year-over-year variances: Sempra Texas saw $80 million higher equity earnings, Sempra California had $213 million lower income tax benefits, and Sempra Infrastructure reported $123 million from higher asset and supply optimization. Operating cash flows for the plan period increased by $5 billion from last year’s plan.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Shahriar Pourreza, Wells Fargo: Asked what could move Sempra into the top half of the 2030 EPS guidance range and if the $9 billion in upside opportunities would factor in. Martin replied, \"the larger items that can impact the long-term outlook are regulatory matters,\" and clarified that the $9 billion is outside the base plan but could move into the plan as execution progresses.</li>\n<li>Pourreza also inquired about the California segment's contribution. Martin noted, \"that really reflects the impact of the approved attrition from the last GRC as you move from 2026 into 2027,\" and highlighted ongoing efficiency efforts in California.</li>\n<li>Steven Fleishman, Wolfe Research: Sought clarity on growth shaping for 2028–2030 and timing of Oncor Texas upside capital. Martin described the plan as robust, with \"the upside opportunity... really layers in nicely around growth in '28, '29 and '30.\" Nye broke down incremental Oncor opportunities, emphasizing confidence in both base and incremental plans.</li>\n<li>Nicholas Campanella, Barclays: Asked about offsets to guidance and efficient financing for upside opportunities. Martin stressed improvements in operating cash flows and pointed to $2.2 billion of additional proceeds from the SI transaction, as well as the retained 25% SI stake as potential funding sources.</li>\n<li>Julien Dumoulin-Smith, Jefferies: Questioned drivers within the 2030 guidance range and California's strategic role. Martin discussed regulatory certainty in both Texas and California and stated, \"if some of those risk factors to execution come off the table, you should expect this management team to look for opportunities to provide more visibility.\"</li>\n<li>David Arcaro, Morgan Stanley: Asked about data center pipeline, supply chain, and credit metrics. Nye reported a queue of 273 gigawatts (255 gigawatts data-related), with 38 gigawatts meeting high-certainty criteria. Sedgwick noted that after the SI Partners transaction, \"regulated earnings to comprise approximately 95% of our business in 2027 and beyond.\"</li>\n<li>Carly Davenport, Goldman Sachs: Inquired about downside risk from ERCOT outcomes and Texas rate case timing. Nye explained that \"what comes out of Batch Zero or other ERCOT transmission plans are not presently included in what we have in the base plan.\"</li>\n<li>Aidan Kelly, JPMorgan: Asked about commitments in the Texas load pipeline. Nye described evolving processes, now with about $3.5 billion in collateral from customers.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts were constructive but pressed for specifics on upside drivers, growth shaping, regulatory outcomes, and capital allocation. They frequently sought clarification on how strategic initiatives translate to financial results.</li>\n<li>Management maintained a confident and optimistic tone in prepared remarks, with Martin saying, \"we believe Sempra offers investors an attractive combination of current yield, durable earnings growth and long-term capital appreciation,\" and remained detailed in responses. During Q&amp;A, the tone remained measured and focused, with occasional emphasis on execution risk and regulatory milestones.</li>\n<li>Compared to the previous quarter, both management and analysts appeared more confident, supported by improved financial results, increased capital plan, and regulatory progress.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter introduced a record $65 billion capital plan for 2026–2030, up 17% from the prior plan, and a new 2030 EPS outlook, compared to only affirming guidance in the prior call.</li>\n<li>Strategic focus continued to shift toward Texas, with more explicit details on transmission expansion and capital allocation, while California's growth is described as more moderate.</li>\n<li>Analysts’ focus moved from balance sheet and equity needs to details of upside capital opportunities and regulatory certainty.</li>\n<li>Management's confidence increased, highlighting higher cash flow projections and the elimination of base plan equity needs. Analysts showed heightened interest in execution, guidance ranges, and capital flexibility.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management identified regulatory risks, particularly in California and Texas, as key variables for long-term growth.</li>\n<li>Execution risk remains in closing the SI Partners transaction and finalizing Texas rate case settlements.</li>\n<li>Supply chain and permitting challenges for Texas transmission and data center projects were discussed, but management described robust mitigation efforts.</li>\n<li>Analysts highlighted potential downside from ERCOT transmission outcomes and the importance of maintaining credit metrics.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Sempra’s 2025 performance set a foundation for long-term growth, with a record $65 billion capital plan targeting 11% annual rate base growth and robust EPS guidance through 2030. The company emphasized the shift toward Texas, streamlined capital allocation, and a funding plan that does not require new equity, while maintaining a strong balance sheet and focusing on regulatory outcomes as key execution milestones ahead.</p>\n<p><a href=\"https://seekingalpha.com/symbol/sre/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558360-sempra-outlines-65b-capital-plan-and-11-percent-rate-base-cagr-through-2030-with-texas-growth",
            "pub_date": "2026-02-27 06:51:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558352",
            "title": "PubMatic jumps after Q4 revenue beat, stronger-than-expected profit",
            "description": "<html><body><p data-eci=\"true\">PubMatic (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/PUBM\" title=\"PubMatic, Inc.\">PUBM</a></span>) shares jumped 9.2% in extended trading Thursday after the ad-tech company reported quarterly results that exceeded Wall Street expectations on revenue and adjusted earnings.</p>\n<p>Revenue rose to $80.0 million in the quarter ended Dec. 31, beating the Wall Street consensus estimate of $75.2 million, though it declined from $85.5 million a year earlier.</p>\n<p>PubMatic (<a href=\"https://seekingalpha.com/symbol/PUBM\" title=\"PubMatic, Inc.\">PUBM</a>) also beat estimates for adjusted earnings at $0.29 a share, above the $0.15 consensus estimate.</p>\n<p>Net income fell to $6.7 million, or $0.14 a share, from $13.9 million, or $0.26 a share, a year earlier.</p>\n<h3><strong>Margins slide even as beat lands</strong></h3>\n<p>Even with the upside surprise, profitability softened from last year. PubMatic (<a href=\"https://seekingalpha.com/symbol/PUBM\" title=\"PubMatic, Inc.\">PUBM</a>) posted adjusted earnings before interest, taxes, depreciation and amortization of $27.8 million, down from $37.6 million, and the adjusted margin dropped to 35% from 44%.</p>\n<p>PubMatic (<a href=\"https://seekingalpha.com/symbol/PUBM\" title=\"PubMatic, Inc.\">PUBM</a>) generated $18.2 million of operating cash flow in the quarter, roughly flat with the prior year, and ended 2025 with $145.5 million in cash, cash equivalents and marketable securities and no debt.</p>\n<h3><strong>CEO points to agentic momentum</strong></h3>\n<p>“We delivered an exceptional fourth quarter, highlighted by strong growth across CTV, Activate, and our emerging revenue streams, and accelerating momentum of our AI solutions,” Rajeev Goel, co-founder and chief executive of PubMatic (<a href=\"https://seekingalpha.com/symbol/PUBM\" title=\"PubMatic, Inc.\">PUBM</a>), said in a statement.</p>\n<p>The company said adoption of its AgenticOS has been rapid, with more than 250 deals transacted in recent months.</p>\n<h3><strong>Outlook flags soft start to 2026</strong></h3>\n<p>PubMatic (<a href=\"https://seekingalpha.com/symbol/PUBM\" title=\"PubMatic, Inc.\">PUBM</a>) guided to first quarter revenue of $58 million to $60 million and adjusted ebitda of negative $0.5 million to $1.0 million, citing an impact from one of its top DSP buyers and a foreign exchange headwind.</p>\n<p>Investors appeared to focus on the near-term beat, cash generation and the company’s push into CTV and agentic tooling, outweighing the year over year declines in revenue and profitability.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558352-pubmatic-jumps-after-q4-revenue-beat-stronger-than-expected-profit",
            "pub_date": "2026-02-27 06:40:58",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558356",
            "title": "Structure Therapeutics reports Q4 results",
            "description": "<html><body><ul>\n<li>Structure Therapeutics <a href=\"https://seekingalpha.com/pr/20416518-structure-therapeutics-reports-fourth-quarter-and-full-year-2025-financial-results-and-recent\">press release</a>  (GPCR): Net income for the fourth quarter of 2025 totaled $33.0 million, with non-cash share-based compensation expense of $8.1 million, compared to a net loss of $36.5 million for the fourth quarter of 2024 with non-cash share-based compensation expense of $5.8 million. For the year ended December 31, 2025, net loss totaled $141.2 million, with non-cash share-based compensation expense of $29.0 million, compared to $122.5 million for the full year 2024 with non-cash share-based compensation expense of $18.8 million.</li>\n<li>Cash, cash equivalents and short-term investments totaled $1.4 billion as of December 31, 2025. The Company expects its current cash, cash equivalents and short-term investments to fund projected operations and key clinical milestones through the end of 2028.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558356-structure-therapeutics-reports-q4-results",
            "pub_date": "2026-02-27 06:40:58",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558348",
            "title": "Hudson Pacific outlines $0.96–$1.06 FFO guidance and targets $200M–$300M asset sales amid balance sheet transformation",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Hudson Pacific Properties (HPP) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Victor Coleman, Chairman &amp; CEO, shared that \"2025 was a breakthrough year for Hudson Pacific. We didn't just position the company for a return to earnings growth. We fundamentally transformed our capital structure and significantly enhanced our operating efficiency.\" He highlighted nearly $330 million in strategic asset sales and over $2 billion in capital transactions, which extended the maturity runway and doubled liquidity. The company delivered $26 million in G&amp;A and interest expense savings and locked in $25 million of annualized expense savings at Quixote. Coleman emphasized, \"We delivered our strongest leasing performance since 2019, signing more than 2.2 million square feet of office leases across our West Coast portfolio.\"</li>\n<li>Strategic priorities for 2026 include driving occupancy growth, eliminating Quixote's earnings drag by year-end, and maintaining capital discipline. Asset sales are set to continue with a target of $200 million to $300 million in 2026, focusing on FFO-accretive transactions and de-leveraging. \"We are sharpening our focus on what we do better than anyone else: owning and operating highly selective office and studio assets in only the best locations,\" said Coleman.</li>\n<li>Mark Lammas, President, reported, \"We signed 518,000 square feet of leases, driving our Office portfolio occupancy to 76.3%, up 40 basis points sequentially.\" The office leasing pipeline increased to 2.3 million square feet, up 15% year-over-year, and tours rose more than 50%.</li>\n<li>Harout Diramerian, Chief Financial Officer, noted, \"Total revenues were $256 million compared to $209.7 million in the prior year, driven by Element LA lease termination fee.\" G&amp;A declined by 33% to $13 million, and FFO excluding specified items was $13.6 million or $0.21 per diluted share. He stated, \"We reduced our share of net debt by 22% and debt to undepreciated book value improved 680 basis points to 31.9%. Cash more than doubled to $138 million and undrawn revolver capacity increased to $795 million, giving us total liquidity of $934 million.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Full-year FFO guidance for 2026 is set at $0.96 to $1.06 per diluted share. Diramerian projected, \"We anticipate slightly lower FFO in the first quarter relative to the fourth quarter 2025, followed by steady sequential growth throughout the year as our leasing pipeline converts to cash flow.\"</li>\n<li>Annual average in-service office occupancy guidance is between 80% and 82%, with expectations that year-end occupancy will exceed this range. Guidance assumes completion of a third lease with the City and County of San Francisco at 1455 Market by midyear, with further occupancy gains weighted to the fourth quarter.</li>\n<li>Same-store property cash NOI growth is forecasted at negative 1.75% to negative 0.75%, reflecting improvement versus 2025 as office occupancy ramps up and studio NOI growth offsets near-term pressure.</li>\n<li>Asset sales of $200 million to $300 million are targeted for 2026, prioritizing FFO-accretive transactions and further deleveraging.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Total revenues reached $256 million, up from $209.7 million in the prior year, primarily due to the Element LA lease termination fee.</li>\n<li>G&amp;A expenses were reduced to $13 million from $19.5 million, reflecting substantial cost improvements.</li>\n<li>FFO excluding specified items was $13.6 million or $0.21 per diluted share, compared to $15.5 million or $0.74 per diluted share in the prior year, impacted by noncash Quixote impairment and the Element LA lease termination fee net of transaction costs.</li>\n<li>Same-store cash NOI was $84.8 million compared to $94.3 million in the prior year, due to lower average office occupancy.</li>\n<li>Cash position more than doubled to $138 million, with total liquidity at $934 million.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Blaine Heck, Wells Fargo, asked about the Quixote write-down and potential sale. Coleman responded, \"Quixote, we're looking to manage that business down. So it will be a flat business by the end of the year...we'll evaluate what our alternatives are going to be with that asset.\"</li>\n<li>Heck also inquired about the Hollywood Media Portfolio CMBS maturity. Coleman stated, \"We're unable to just discuss specifics over our loan extension negotiations because currently today, there's ongoing dialogue, and we're focused on the best outcome for us and our shareholders.\"</li>\n<li>Alexander Goldfarb, Piper Sandler, asked about leasing costs and liquidity; Lammas responded, \"What you see is you peak out on the line balance at about $160 million...and that's without assuming any asset sales of any kind. So we never even get sort of -- we have more than ample liquidity to just get the portfolio into the low 90s.\"</li>\n<li>Richard Anderson, Cantor Fitzgerald, questioned the Quixote wind down and office expiration retention. Coleman said, \"We're evaluating which are the obligations that we want to get out of,\" and Suazo added, \"tenants are engaging much earlier and with more conviction and more confidence in what the requirement is.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on liquidity, asset sales, Quixote's future, leasing pipelines, and the timing of occupancy gains. The tone was probing but generally constructive, seeking clarity on execution and future risks.</li>\n<li>Management maintained a confident and direct tone, especially in prepared remarks, with statements such as \"we're not hoping for a recovery. We're already capturing it.\" Some defensiveness appeared in Q&amp;A around Quixote and asset sale specifics.</li>\n<li>Compared to the previous quarter, both management and analysts showed increased confidence, with management emphasizing execution and analysts probing for deeper details on strategic moves and risk mitigation.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter introduced reinstated full-year FFO guidance, a return not seen in recent quarters, reflecting increased management confidence in forecasting.</li>\n<li>A shift was observed in capital structure focus, with substantial disposals and capital transactions nearly doubling liquidity and materially reducing debt.</li>\n<li>Leasing activity and tours accelerated, with a 15% year-over-year increase in the pipeline and a 50% increase in tours, compared to steady but lower growth last quarter.</li>\n<li>Management's tone was more assertive on capturing market recovery, while analysts remained focused on execution, risk, and valuation, especially regarding Quixote and asset sales.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>The noncash impairment write-down of Quixote and its ongoing earnings drag remain key concerns, with management planning to \"eliminate Quixote's earnings drag by year-end.\"</li>\n<li>Potential asset sales and their impact on FFO and leverage are being closely watched, as are negotiations regarding the Hollywood Media Portfolio loan maturity in August 2026.</li>\n<li>Analysts raised questions about office leasing retention, the impact of AI on tenant demand, and the ongoing uncertainty in studio operations.</li>\n<li>Exposure to software tenants potentially affected by AI is estimated at 1.5 to 2.5% of ABR, with ongoing monitoring by management.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Hudson Pacific Properties emphasized the transformation of its capital structure, a substantial increase in liquidity, and enhanced operating efficiency in 2025. With reinstated full-year FFO guidance, targeted asset sales, and a focus on driving occupancy and NOI growth, the company signaled confidence in its ability to realize sequential earnings growth through 2026 and beyond. The strategic wind-down of Quixote and the prioritization of FFO-accretive transactions stand out as pivotal moves as management aims to solidify a best-in-class office and studio portfolio in premier West Coast locations.</p>\n<p><a href=\"https://seekingalpha.com/symbol/hpp/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558348-hudson-pacific-outlines-0_96-1_06-ffo-guidance-and-targets-200m-300m-asset-sales-amid-balance",
            "pub_date": "2026-02-27 06:31:29",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558349",
            "title": "Playtika outlines $2.7B–$2.8B 2026 revenue target as SuperPlay and D2C drive strategic mix shift",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Playtika Holding Corp. (PLTK) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Robert Antokol, Co-Founder and CEO, highlighted a strong Q4 finish and ongoing strategic shift: \"In Q4, we delivered $678.8 million of revenue and $201.4 million of adjusted EBITDA, driven by D2C growth, our pivot to casual and super player results. Here is the main point. We are building a balanced set of assets. Every year, more revenues comes from long-life casual games with broad reach. And D2C is now core to how we run the business.\" </li>\n<li>Antokol indicated SuperPlay's rapid growth, stating: \"SuperPlay delivered record revenues in Q4 with Disney Solitaire up 21.4% quarter-over-quarter and now our second largest game in the portfolio. We see improvements in Dice Dreams and continuous growth in Domino's Dreams. SuperPlay's growth this year is nothing short of amazing.\"</li>\n<li>He emphasized a disciplined capital allocation approach: \"We act from position of strength. We focus on returns, relocating spend and generating cash.\"</li>\n<li>Craig Abrahams, President &amp; CFO, remarked: \"Q4 reflects the strength of our model and a mix shift that is now clear in the results. We came in ahead of our revenue and adjusted EBITDA guidance, set another D2C record and saw outstanding momentum from SuperPlay. This is now the third straight year we have met or exceeded our adjusted EBITDA guidance, reflecting the strength and consistency of our operating model.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Abrahams detailed 2026 guidance: \"Our guidance for full year 2026 is as follows. Revenue of $2.7 billion to $2.8 billion, adjusted EBITDA of $730 million to $770 million, capital expenditures of $80 million and an effective tax rate of 30%. We also expect our marketing spend to be weighted toward the first half of the year, particularly the first quarter, which we expect to result in lower adjusted EBITDA in the first quarter and higher adjusted EBITDA in subsequent quarters.\"</li>\n<li>The company is suspending its quarterly dividend to preserve flexibility and direct capital to the highest return uses, while keeping share repurchases available within the capital allocation framework.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Q4 revenue was $678.8 million, up 0.6% sequentially and up 4.4% year-over-year.</li>\n<li>Net loss was $309.3 million compared to net income of $39.1 million in Q3 and a $16.7 million loss in Q4 2024, primarily due to the noncash impact of remeasuring contingent consideration related to the SuperPlay earn-out.</li>\n<li>Adjusted net income was $89 million, compared to $65.8 million in Q3 and $27 million in Q4 2024.</li>\n<li>Adjusted EBITDA was $201.4 million, down 7.4% sequentially and up 9.5% year-over-year.</li>\n<li>D2C revenue reached $250.1 million, growing 19.5% sequentially and 43.2% year-over-year, representing 36.8% of total revenues in Q4.</li>\n<li>SuperPlay generated about $573 million of revenue for the full year, a 67.5% increase from the $342 million baseline tied to the earnout.</li>\n<li>Cash, cash equivalents and short-term bank deposits stood at $820.2 million at year-end.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Aaron Lee, Macquarie Research: Asked about AI's role in the business and workforce reduction. Antokol responded, \"We see the AI opportunity as a new platform. We see something that can grow our business. We are very excited.\"</li>\n<li>Lee then inquired about M&amp;A appetite. Abrahams answered, \"M&amp;A has always been a core part of our growth strategy. SuperPlay has been a tremendous transaction for us. We plan to continue to invest aggressively in growing that within the constraints of the earn-out.\"</li>\n<li>Eric Handler, ROTH Capital: Queried about incentives for D2C transition. Antokol replied, \"The D2C become one of our biggest part of growth, cash flow growth in the last few years... we're giving a better experience to the users.\"</li>\n<li>Christopher Schoell, UBS: Asked about 2026 guidance assumptions for Slotomania and social casino, and D2C mix target. Abrahams explained, \"Our business is now 74% casual, and that continues to be the fastest growth part of the business driven by SuperPlay... Our previous long-term target was 40% of revenue. We'll continue to keep that just given all of the various policy changes in the background.\"</li>\n<li>Matthew Cost, Morgan Stanley: Asked about Disney Solitaire's trajectory and D2C's impact on gross margins. Abrahams noted, \"Disney Solitaire is off to a great start to 2026. There's a meaningful investment in marketing dollars in the first quarter... it's one of the best ROIs we have within the portfolio.\" Tae Lee added, \"You're seeing the benefit in lower platform fees in revenue from an increased DTC mix, but that is offset by increased amortization coming from past acquisition.\"</li>\n<li>Jason Bazinet, Citigroup: Asked about contingent consideration and SuperPlay earn-out triggers. Abrahams clarified, \"The EBITDA is in line with -- in order to pay the earn-out in year 1 was less than $10 million.\"</li>\n<li>William Lampen, BTIG: Asked about D2C penetration and marketing budget flexibility. Abrahams stated, \"We have broad penetration of DTC across the portfolio. There are constraints around super play in that they're under an earn-out... at some point, that will have to moderate to ensure that they're able to drive margins into that 5% or 10% or greater from an EBITDA perspective.\"</li>\n<li>Douglas Creutz, TD Cowen: Asked about Jackpot Tour's status. Antokol responded, \"We are still checking the KPIs. I can say that we are not sure 100%. We're going to open it strongly in the coming few weeks.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed management on forward growth drivers, D2C transition, and the impact of AI and capital allocation, with a neutral to slightly positive tone, focusing on specifics of execution and future growth levers.</li>\n<li>Management's sentiment was confident in prepared remarks and maintained composure during Q&amp;A, emphasizing discipline and strategic clarity. Phrases such as \"We are very excited\" and \"We plan to continue to invest aggressively\" signal confidence, while responses around Jackpot Tour and marketing flexibility were more measured, indicating some caution.</li>\n<li>Compared to the previous quarter, management's tone remained confident but was more assertive about the business mix shift and capital allocation discipline, while the analysts' tone stayed focused on execution and strategic priorities.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The company increased full-year revenue and adjusted EBITDA guidance for 2026, with more detail on mix shift toward casual games and D2C.</li>\n<li>Dividend suspension marks a strategic shift to prioritize flexibility for investments and obligations such as SuperPlay's earn-out.</li>\n<li>D2C revenue and penetration saw significant sequential and year-over-year gains, now approaching 40% of total revenue, a target reiterated from the prior quarter.</li>\n<li>SuperPlay's contribution to revenue growth and portfolio diversification was emphasized more strongly this quarter.</li>\n<li>Management maintained a confident tone, more explicitly focused on returns and portfolio optimization, while analysts maintained a focus on growth levers and risk management.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Contingent consideration related to the SuperPlay earn-out significantly impacted net loss due to noncash GAAP adjustments.</li>\n<li>The social casino segment, especially Slotomania, operates in a challenging, crowded market, with management focused on slowing decline and extracting value.</li>\n<li>Management noted, \"We fund where returns make sense, extend the life of older titles and step back where the bar is not met.\"</li>\n<li>Capital allocation remains a risk factor as priorities shift and dividend suspension is implemented to preserve flexibility.</li>\n<li>Jackpot Tour's unclear KPIs and pending performance underscore ongoing risks in new title launches.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Playtika's Q4 2025 results underscore a strategic transformation toward casual games and direct-to-consumer channels, with SuperPlay serving as a primary growth engine. Management is emphasizing portfolio balance, disciplined capital allocation, and operational resilience, while suspending the dividend to prioritize flexibility for growth investments and obligations. The company is targeting $2.7 billion to $2.8 billion in revenue for 2026, supported by record D2C contributions and a renewed focus on high-return opportunities, setting the stage for continued evolution and potential long-term value creation.</p>\n<p><a href=\"https://seekingalpha.com/symbol/pltk/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558349-playtika-outlines-2_7b-2_8b-2026-revenue-target-as-superplay-and-d2c-drive-strategic-mix",
            "pub_date": "2026-02-27 06:31:29",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558345",
            "title": "Cytek Biosciences GAAP EPS of -$0.34 misses by $0.30, revenue of $62.1M beats by $3.3M",
            "description": "<html><body><ul>\n<li>Cytek Biosciences <a href=\"https://seekingalpha.com/pr/20416626-cytek-biosciences-reports-fourth-quarter-and-full-year-2025-financial-results-and-provides\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CTKB\" title=\"Cytek Biosciences, Inc.\">CTKB</a></span>): Q4 GAAP EPS of -$0.34 <span> misses by $0.30</span>.</li>\n<li>Revenue of $62.1M <span> beats by $3.3M</span>.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558345-cytek-biosciences-gaap-eps-of-0_34-misses-by-0_30-revenue-of-62_1m-beats-by-3_3m",
            "pub_date": "2026-02-27 06:26:43",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558346",
            "title": "OneStream, Inc. Non-GAAP EPS of $0.12, revenue of $163.7M",
            "description": "<html><body><ul>\n<li>OneStream, Inc. <a href=\"https://seekingalpha.com/pr/20416652-onestream-announces-fourth-quarter-and-fiscal-year-2025-financial-results\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/OS\" title=\"OneStream, Inc.\">OS</a></span>): Q4 Non-GAAP EPS of $0.12.</li>\n<li>Revenue of $163.7M.</li>\n<li> </li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558346-onestream-inc-non-gaap-eps-of-0_12-revenue-of-163_7m",
            "pub_date": "2026-02-27 06:26:43",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558340",
            "title": "Sterling Infrastructure targets 25% revenue growth for 2026 as backlog and data center demand surge",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Sterling Infrastructure, Inc. (STRL) Q4 2025  </p>\n<h3>Management View</h3>\n<ul>\n<li>Joseph Cutillo, CEO, highlighted that Sterling achieved \"strong revenue growth of over 32% and adjusted diluted EPS growth of over 53%.\" He noted, \"Full year gross margins reached 23% and adjusted EBITDA margins exceeded 20% for the first time in our history.\" Cutillo emphasized that \"operating cash generation remained strong at $440 million\" and described 2025 as the fifth consecutive year of over 35% adjusted EPS growth.</li>\n<li>Cutillo reported fourth quarter revenue growth of 69%, driven by \"123% growth in E-Infrastructure Solutions and 24% growth in our Transportation Solutions.\" Organic growth for the quarter was 36%. He stated, \"We grew adjusted earnings per share by 78% to $3.08 and adjusted EBITDA by 70% to $142 million.\"</li>\n<li>The signed backlog at quarter-end reached $3 billion, a 78% increase from year-end 2024. Including unsigned awards and pipeline, visibility extends to \"a pool of work approaching $4.5 billion.\"</li>\n<li>In the E-Infrastructure segment, full year revenue grew 59% and adjusted operating income grew 67%. Cutillo said, \"Our Rocky Mountain site development operation... grew more than 150% from the prior year period.\" The CEC acquisition is \"performing very well,\" with fourth quarter CEC revenue up 21% over the prior year.</li>\n<li>Transportation Solutions reported full year revenue growth of 17% and adjusted operating profit growth of 66%. Backlog for this segment rose 81% year-over-year to $1.1 billion. Building Solutions faced challenges, with full year revenue down 6% and adjusted operating profit down 23%.</li>\n<li>CFO Nicholas Grindstaff stated, \"Our year-end backlog totaled $3 billion, a 78% increase from year-end 2024 or 49%, excluding CEC.\" He added, \"Cash flow from operating activities for 2025 was a strong $440 million.\" Grindstaff reported share repurchases of $74 million for the year and a remaining authorization of $374 million.</li>\n<li>Grindstaff provided 2026 guidance: \"Revenue of $3.05 billion to $3.2 billion; diluted EPS of $11.65 to $12.25. Adjusted diluted EPS of $13.45 to $14.05, EBITDA of $587 million to $620 million. Adjusted EBITDA of $626 million to $659 million.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>The company is initiating 2026 guidance with revenue projected between $3.05 billion and $3.2 billion, diluted EPS of $11.65 to $12.25, adjusted diluted EPS of $13.45 to $14.05, EBITDA of $587 million to $620 million, and adjusted EBITDA of $626 million to $659 million.</li>\n<li>Cutillo indicated, \"For 2026, we expect to deliver E-Infrastructure revenue growth of 40% or higher. This includes 20% growth or higher in the legacy business.\"</li>\n<li>Adjusted operating profit margins for E-Infrastructure are forecast in the 23% to 24% range. Transportation Solutions revenue is expected to grow in the \"low to mid-single digits\" with continued margin expansion, while Building Solutions revenue is anticipated to \"decline in the high single to low double digits.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Fourth quarter revenue grew 69%, with E-Infrastructure Solutions up 123% and Transportation Solutions up 24%. Adjusted EPS for the quarter was $3.08 and adjusted EBITDA reached $142 million.</li>\n<li>Full year operating cash flow was $440 million. Capital expenditures were $77 million, and $482 million was deployed for acquisitions.</li>\n<li>Share repurchases totaled $74 million at an average price of $168.72 per share. The company ended the quarter with $391 million in cash and $291 million in debt.</li>\n<li>Building Solutions saw a 9% revenue decline in the fourth quarter and operating margins of 10%.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Brian Brophy, Stifel: \"I just wanted to ask about transportation awards and backlog... Anything notable to call out there?\" CEO Cutillo: \"Nothing in particular. There wasn't one big giant project or anything... we will continue to see good bid activity through that September time frame as projects are continuing to be let.\"</li>\n<li>Brent Thielman, Davidson: \"How the pipeline has evolved at CEC since you've acquired it?\" Cutillo: \"The jobs are getting a lot bigger... These aren't data centers anymore, they're data campuses.\" He noted, \"We see margin improvements in a couple of areas... as we're combining the exterior electric with the site development.\"</li>\n<li>Manish Somaiya, Cantor: \"You talked about $1 billion of high probability future phase work. Can you give us a sense if that's tied to existing customers or programs?\" Cutillo: \"That $1 billion-plus is tied to projects we're actively working on today... The lion's share of that are with the big name hyperscalers.\"</li>\n<li>Adam Thalhimer, Thompson Davis: \"Talk more about the CEC modular expansion?\" Cutillo: \"The new facility is over 300,000 square feet... we're looking at does it or does it make sense to have multiple facilities throughout the U.S. that can make these components.\"</li>\n<li>Julio Romero, Sidoti: \"As these mission-critical projects get bigger, more complex, is the mix of above-ground work versus underground infrastructure changing at all?\" Cutillo: \"I wouldn't say we've seen any significant shift on above ground versus below ground... the size and scope of these projects... will get bigger, but the amount of stuff that we will touch will continue to grow.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on margin sustainability, growth in Texas and other geographies, backlog quality, and capital allocation. Their tone was generally positive, with curiosity about capital deployment, CEC integration, and the outlook for key markets. The mood remained constructive, seeking details on execution and market evolution.</li>\n<li>Management's prepared remarks conveyed strong confidence, using phrases such as \"We are pleased to discuss these results... but even more excited about the opportunities ahead of us,\" and \"Our strong backlog, future phase opportunities and conversations with our core customers... contribute to our confidence.\" During Q&amp;A, management reiterated optimism and provided clear responses, occasionally referencing being \"ahead of schedule\" and \"very bullish.\"</li>\n<li>Compared to the previous quarter, management's tone remained confident, though with increased emphasis on scale and execution in new geographies, and more discussion of integrating acquisitions and modular construction. Analyst sentiment was consistently positive across both quarters, with ongoing interest in margin expansion and growth drivers.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 is more ambitious, with a higher revenue range and targets for adjusted EPS and EBITDA reflecting expected 25%+ year-over-year growth in key metrics.</li>\n<li>Management's tone remains confident, with a greater emphasis on multiyear visibility, geographic expansion (notably Texas and the Pacific Northwest), and the size of upcoming projects.</li>\n<li>Analysts continued to focus on growth drivers, backlog conversion, and capital allocation, with new questions centered on modular construction and scalability.</li>\n<li>Key metrics such as backlog, E-Infrastructure and Transportation Solutions revenue, and margins all showed substantial increases compared to Q3, while Building Solutions remained challenged.</li>\n<li>Strategic priorities shifted towards integrating acquisitions, expanding modular capabilities, and leveraging the CEC platform for growth.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited ongoing softness in Building Solutions, with revenue anticipated to decline further in 2026.</li>\n<li>There are challenges ramping up new geographies, with management stating that margins in new markets may initially be lower but are expected to improve with scale and integration.</li>\n<li>Execution risk remains around integrating acquisitions and scaling modular construction.</li>\n<li>Some margin pressure may be present in early phases of large projects, as noted in management's remarks.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Management expressed confidence in Sterling's ability to capture multiyear growth opportunities driven by a record backlog, robust demand in E-Infrastructure and Transportation Solutions, and expanding capabilities through acquisitions and modular construction. The company targets significant revenue and margin growth in 2026, underpinned by visibility into a substantial pipeline of high-probability future work, geographic expansion, and strategic investments in both organic and inorganic growth.</p>\n<p><a href=\"https://seekingalpha.com/symbol/strl/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558340-sterling-infrastructure-targets-25-percent-revenue-growth-for-2026-as-backlog-and-data-center",
            "pub_date": "2026-02-27 06:20:55",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558140",
            "title": "Main Street Capital Q4 earnings beat as portfolio value climbs",
            "description": "<html><body><p data-eci=\"true\" dir=\"ltr\"><span>Main Street Capital (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MAIN\" title=\"Main Street Capital Corporation\">MAIN</a></span>) posted Q4 earnings that exceeded the Wall Street consensus as the firm that provides debt to lower middle-market companies benefited from the increased fair market value of its investment portfolio.</span></p>\n<p dir=\"ltr\"><span><a href=\"https://seekingalpha.com/pr/20416734-main-street-announces-2025-fourth-quarter-and-annual-results\" target=\"_blank\" title=\"Q4 net investment income per share\">Q4 net investment income per share</a> of $1.03, beating the average analyst estimate of $1.01, rose/fell from $0.97 in Q3 and $ in Q4 2024. In April, the company had estimated Q4 NII per share of $1.01-$1.05.</span></p>\n<p dir=\"ltr\"><span>Distributable net investment income of $1.09 per share, vs. the Visible Alpha consensus of $1.07, increased from $1.03 in the prior quarter and $ a year ago. Earlier, it had estimated Q4 distributable NII would be $1.07-$1.11 per share.</span></p>\n<p dir=\"ltr\"><span>Main Street (<a href=\"https://seekingalpha.com/symbol/MAIN\" title=\"Main Street Capital Corporation\">MAIN</a>) stock gained 1.0% in Thursday after-hours trading.</span></p>\n<p dir=\"ltr\"><span>Net asset value per share at Dec. 31, 2025, was $33.33, compared with its preliminary estimate of $33.29-$33.37. NAV was $32.78 at Sept. 30, 2025.</span></p>\n<p dir=\"ltr\"><span>The fair value of its total investments increased to $5.52B at Dec. 31, 2025, from $4.93B at Dec. 31, 2024.</span></p>\n<p dir=\"ltr\"><span>During the quarter, Main Street (<a href=\"https://seekingalpha.com/symbol/MAIN\" title=\"Main Street Capital Corporation\">MAIN</a>) completed $300.0M in total LMM portfolio investments, including investments of $241.0M in five new portfolio companies, which, after aggregate repayments, return of invested equity capital, and a decrease in cost basis due to realized losses, resulted in a net increase of $253.1M in the total cost basis of the  lower middle market (“LMM”) investment portfolio.</span></p>\n<p dir=\"ltr\"><span>It completed $231.4M in total private loan portfolio investments, which, after repayments, return of invested equity capital, and a decrease in cost basis due to a realized loss, resulted in a net increase of $108.8M in the total cost basis of the private loan investment portfolio.</span></p>\n<p dir=\"ltr\"><span>Main Street (<a href=\"https://seekingalpha.com/symbol/MAIN\" title=\"Main Street Capital Corporation\">MAIN</a>) posted a net decrease of $76.4M in the total cost basis of its middle market investment portfolio was $3.06B at Dec. 31, 2025</span></p>\n<p dir=\"ltr\"><span>Last month, the company said it originated new or increased commitments in its private loan portfolio of $387.1M and funded total investments across its private loan portfolio of $231.4M.</span></p>\n<p dir=\"ltr\"><span>\"After our positive performance in the first three quarters of 2025, our strong performance in the fourth quarter resulted in a return on equity of 17.7% for the fourth quarter and 17.1% for the full year, strong levels of net investment income per share and distributable net investment income per share, and a record net asset value per share, primarily driven by a significant net fair value increase of our investments, and including the benefits of material net realized gains in both our lower middle market and private loan investment portfolios,\" said CEO Dwayne L. Hyzak.</span></p>\n<p>Conference <a href=\"https://www.mainstcapital.com/investors\" rel=\"nofollow\">call</a> on Feb. 27 at 10:00 AM ET.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558140-main-street-capital-q4-earnings-beat-as-portfolio-value-climbs",
            "pub_date": "2026-02-27 06:20:55",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}