{
    "data": [
        {
            "id": "4557946",
            "title": "EPA to shift at least half of waived biofuel obligations to big refiners - Reuters",
            "description": "<html><body><p data-eci=\"true\"><span>The Trump administration has settled on a plan that would require big oil refineries to comprise at least half of the biofuel blending volumes obligations waived in recent years under the Small Refinery Exemption program, Reuters reported Thursday.</span></p>\n<p><span>The decision could be a negative for larger oil refiners that have said additional blending obligations would raise their costs, but it could help the biofuel industry by boosting demand for blending credits, the <a href=\"https://www.reuters.com/sustainability/climate-energy/trump-epa-shift-least-half-waived-biofuel-obligations-big-refiners-sources-say-2026-02-26/\" rel=\"nofollow\" target=\"_self\" title=\"report\">report</a> said.</span></p>\n<p><span>Under the Renewable Fuel Standard, oil refineries must blend billions of gallons of ethanol and other biofuels into their fuel or buy RIN credits from those that do, but small refineries can waive obligations if they demonstrate economic hardship, and the agriculture and fuel industries disagree on whether to reallocate the exempted blending obligations to larger refiners.</span></p>\n<p><span>Officials with the Environmental Protection Agency </span><span>have signaled recently that they settled on reallocating at least 50% of the waived volumes for 2023-25, and the level could go higher, according to the report.</span></p>\n<p><span>The EPA also sent its proposed 2026 and 2027 biofuel blending quotas to the White House on Wednesday, with a final rule expected before the end of March, an EPA administrator said this week at an ethanol conference in Florida.</span></p>\n<p><span>Potentially relevant stocks include Valero Energy (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/VLO\" title=\"Valero Energy Corporation\">VLO</a></span>), Marathon Petroleum (<a href=\"https://seekingalpha.com/symbol/MPC\" title=\"Marathon Petroleum Corporation\">MPC</a>), Phillips 66 (<a href=\"https://seekingalpha.com/symbol/PSX\" title=\"Phillips 66\">PSX</a>), HF Sinclair (<a href=\"https://seekingalpha.com/symbol/DINO\" title=\"HF Sinclair Corporation\">DINO</a>), PBF Energy (<a href=\"https://seekingalpha.com/symbol/PBF\" title=\"PBF Energy Inc.\">PBF</a>), Delek US (<a href=\"https://seekingalpha.com/symbol/DK\" title=\"Delek US Holdings, Inc.\">DK</a>), Archer Daniels Midland (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ADM\" title=\"Archer-Daniels-Midland Company\">ADM</a></span>), Bunge (<a href=\"https://seekingalpha.com/symbol/BG\" title=\"Bunge Global SA\">BG</a>), Green Plains (<a href=\"https://seekingalpha.com/symbol/GPRE\" title=\"Green Plains Inc.\">GPRE</a>), Gevo (<a href=\"https://seekingalpha.com/symbol/GEVO\" title=\"Gevo, Inc.\">GEVO</a>), Clean Energy Fuels (<a href=\"https://seekingalpha.com/symbol/CLNE\" title=\"Clean Energy Fuels Corp.\">CLNE</a>), REX American Resources (<a href=\"https://seekingalpha.com/symbol/REX\" title=\"REX American Resources Corporation\">REX</a>), Darling Ingredients (<a href=\"https://seekingalpha.com/symbol/DAR\" title=\"Darling Ingredients Inc.\">DAR</a>), FutureFuel (<a href=\"https://seekingalpha.com/symbol/FF\" title=\"FutureFuel Corp.\">FF</a>).</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557946-epa-to-shift-at-least-half-of-waived-biofuel-obligations-to-big-refiners-reuters",
            "pub_date": "2026-02-27 00:56:29",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557959",
            "title": "Quebecor declares $0.40 dividend",
            "description": "<html><body><ul>\n<li>Quebecor (QBR.A:CA) declares <a href=\"https://seekingalpha.com/pr/20414811-quebecor-inc-reports-consolidated-results-for-fourth-quarter-and-full-year-2025\" target=\"_blank\">$0.40/share quarterly dividend</a>.</li>\n<li>Payable April 7; for shareholders of record March 13; ex-div March 13.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557959-quebecor-declares-0_40-dividend",
            "pub_date": "2026-02-27 00:56:29",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557954",
            "title": "TopBuild outlines $6.075B revenue midpoint for 2026 as M&A and operational discipline drive outlook",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: TopBuild Corp. (BLD) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li><p>CEO Robert Buck reiterated TopBuild’s “clear, profitable growth strategy and a proven track record of delivering compounded growth and strong shareholder returns.” Buck noted “significant growth opportunities across our $95 billion total addressable market” and highlighted strong free cash flow and disciplined capital deployment, both organically and through M&amp;A. He stated, “In the fourth quarter, weakness in the residential and light commercial end markets persisted. Consumer confidence remains low, interest rates are still elevated, and affordability continues to be an issue, all drivers of muted demand in the current environment.” However, Buck emphasized, “the commercial and industrial end markets remain solid...bidding and backlogs are healthy, and we're well positioned to capitalize.”</p></li>\n<li><p>Buck detailed the completion of seven acquisitions in 2025, including SPI in Q4, which fueled a 13.2% sales rise to $1.49 billion for the quarter. He confirmed that “acquisitions continue to be our top priority for capital allocation,” citing $1.9 billion deployed across the business and the addition of approximately $1.2 billion in annual revenue. Buck also announced the recent acquisition of Johnson Roofing, expanding commercial roofing operations in Texas, Louisiana, and Oklahoma.</p></li>\n<li><p>COO John Achille described ongoing operational excellence initiatives, including inventory management and technology platform integration, stating, “Our field teams are doing a great job managing profitability. As soft demand has persisted, we are responding appropriately and making disciplined pricing and volume decisions at the local level.” He added, “We are making great progress on integrating SPI...and we've identified several cross-selling opportunities we expect to realize over time.” Achille confirmed the SPI IT integration is expected to be completed by the end of Q2 2026.</p></li>\n<li><p>CFO Robert Kuhns reflected on “extraordinary growth” over the past decade and provided detail on Q4 results. Kuhns stated, “Acquisitions contributed 23.0%, as both Progressive and SPI had solid quarters and exceeded our expectations...pricing added 0.7%...volume declined 10.5% driven by ongoing weakness in the residential and light commercial end markets.” He cited $265 million adjusted EBITDA for Q4 and $1.04 billion for the year, and commented on cost controls: “On a same branch basis, SG&amp;A was down $19 million or 20 basis points due to cost reduction actions taken during the year.”</p></li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li><p>Kuhns set 2026 guidance for sales of $5.925 billion to $6.225 billion and adjusted EBITDA of $1.005 billion to $1.155 billion. He stated, “The midpoint of our revenue guidance at $6.075 billion is based on the following key assumptions: Overall, we expect volume and price to each be down low-single digits in 2026. Residential sales...will be down mid-single digits, inclusive of both volume and price. Commercial and industrial...is expected to grow low single digits.” M&amp;A closed in the last 12 months is expected to contribute $800 million to $850 million in revenue.</p></li>\n<li><p>Kuhns added, “The midpoint of our adjusted EBITDA guidance at $1.08 billion assumes the following: an EBITDA decremental of approximately 27% on lower volumes; $55 million of price/cost headwinds; and EBITDA margin on M&amp;A in the mid-teens, inclusive of $15 million of Progressive and SPI synergies that will impact 2026.”</p></li>\n<li><p>Buck commented, “while we expect demand will improve, it's not yet clear what that timing will be and it is too early in the year to bank on a second half recovery. This uncertainty is baked into our guidance.”</p></li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li><p>Kuhns reported Q4 net sales of $1.49 billion, up 13.2% year-over-year. Installation Services sales were $798 million, with M&amp;A contributing 16.3%. Specialty Distribution sales totaled $755 million, up 25.5%, with acquisitions contributing 28.9%. Adjusted gross profit was $416 million, margin of 28%. Adjusted EBITDA margin was 17.9% for Q4. Fourth quarter adjusted earnings were $4.50 per diluted share. Cash was $185 million with total liquidity at $1.1 billion.</p></li>\n<li><p>Kuhns highlighted an increase in interest and other expense to $36 million due to expanded credit facilities and new bonds. Working capital was $959 million or 15.4% of sales. Free cash flow for 2025 was $697 million. The company returned $434 million to shareholders via buybacks.</p></li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li><p>Richard Reid, Wells Fargo: Asked about the guide path for single-family starts and differences between public and private builders. Buck responded that “the regional builders, the private regional builders are keeping very cost competitive...smaller custom builders...seem to definitely be holding their own relative to demand.”</p></li>\n<li><p>Reid also inquired about commercial and industrial backlogs. Buck explained, “typically, lighter commercial does follow residential. But we see some trending there in the right direction, we believe. But again, more optimism on the mechanical and the commercial roofing side.”</p></li>\n<li><p>Michael Rehaut, JPMorgan: Focused on pricing trends and the $55 million price/cost headwind. Kuhns replied, “it probably progressively gets a little worse as the year goes on. But we definitely saw some of that pressure in the fourth quarter.” Rehaut asked about specialty distribution leadership realignment. Achille responded, “just making sure we have the right leadership in place,” incorporating talent from SPI and DI.</p></li>\n<li><p>Susan Maklari, Goldman Sachs: Asked about cross-selling from the SPI integration. Achille indicated it is “connecting our sales teams and our managers,” with plans to add digital resources. Maklari also asked about cost structure flexibility. Kuhns said, “more than 70% of our costs are variable. So we can adjust quickly and make changes where we need to.”</p></li>\n<li><p>Margaret Grady, Jefferies: Inquired about pricing and margin guidance. Kuhns said, “the price cost bucket, it's obviously a mixed bag of products, some with price inflation, some with price pressure and price deflation.” He noted mechanical insulation pricing remains strong, while fiberglass and spray foam face pressure.</p></li>\n<li><p>Kenneth Zener, Seaport Research: Pressed on residential volume declines and regional differences. Kuhns stated, “December slowed significantly on the resi side...commercial business...about half...is light commercial work. That's been slow throughout the year.” Achille added, “Florida...it's a bit optimistic down there...Texas, probably still a little flat to slow.”</p></li>\n<li><p>Michael Dahl, RBC: Asked about pricing pressure in fiberglass. Kuhns responded, “pricing is a local decision in our business...we think we do a really good job of adjusting to local markets...but just given the macro environment, we saw it in the fourth quarter.”</p></li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li><p>Analysts maintained a neutral to slightly cautious tone, with multiple questions centered on pricing pressure, volume trends, and the sustainability of cost reductions. Specific focus was given to the risk of continued headwinds in residential and light commercial segments, as well as M&amp;A integration outcomes.</p></li>\n<li><p>Management’s tone in prepared remarks was confident, emphasizing operational discipline and growth opportunities. During the Q&amp;A, management acknowledged macro uncertainty and persistent headwinds but remained focused on controllable factors. Kuhns stated, “we're focused 100% on driving these synergies and getting the results that we can control.”</p></li>\n<li><p>Compared to the previous quarter, analyst sentiment shifted further toward risk mitigation, while management’s confidence remained steady, with more explicit discussion of cautious guidance and contingency planning.</p></li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li><p>Guidance language shifted from a focus on year-end M&amp;A integration and margin resiliency in Q3 to explicit caution about near-term market recovery in Q4, with 2026 guidance assuming no significant change in end market conditions.</p></li>\n<li><p>Strategic focus moved further towards M&amp;A-driven expansion, operational excellence, and capturing synergies, while reiterating discipline in cost management.</p></li>\n<li><p>Key metrics showed an increase in sales and M&amp;A contribution, but gross margin and EBITDA margin declined quarter-over-quarter, primarily due to mix and price/cost headwinds.</p></li>\n<li><p>Analyst questions in both quarters concentrated on pricing, M&amp;A integration, and residential demand outlook, but Q4 included more probing about regional and product-specific trends.</p></li>\n<li><p>Management’s confidence in operational flexibility and synergy capture remained unchanged, though the tone became more measured regarding residential recovery timing.</p></li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li><p>Management identified persistent softness in residential and light commercial demand, driven by low consumer confidence, elevated interest rates, and affordability issues.</p></li>\n<li><p>Kuhns highlighted ongoing price/cost headwinds of $55 million for 2026, with margin pressure linked to mix and competitive pricing, especially in fiberglass and spray foam.</p></li>\n<li><p>Achille noted supply chain dynamics, with “fiberglass pipe insulation remains on allocation.”</p></li>\n<li><p>Analyst concerns centered on the durability of cost savings, pace of price recovery, and the timing of a residential market rebound.</p></li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>TopBuild’s leadership emphasized its disciplined M&amp;A strategy, operational flexibility, and robust free cash flow as key strengths amid a challenging macro environment. The company’s 2026 guidance reflects cautious assumptions about residential demand, offset by anticipated growth in commercial and industrial segments and significant contributions from recent acquisitions. Management remains focused on synergy realization and cost optimization, confident in its ability to adapt to evolving market conditions and deliver long-term shareholder value.</p>\n<p><a href=\"https://seekingalpha.com/symbol/bld/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557954-topbuild-outlines-6_075b-revenue-midpoint-for-2026-as-m-and-a-and-operational-discipline",
            "pub_date": "2026-02-27 00:50:59",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557956",
            "title": "International Seaways declares combined dividend of $2.15",
            "description": "<html><body><ul>\n<li>International Seaways (INSW) declares combined dividend of <a href=\"https://seekingalpha.com/pr/20414885-international-seaways-reports-fourth-quarter-and-full-year-2025-results\" target=\"_blank\">$2.15/share quarterly dividend</a>.</li>\n<li>Payable March 30; for shareholders of record Mar. 20; ex-div Mar. 20.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557956-international-seaways-declares-combined-dividend-of-215",
            "pub_date": "2026-02-27 00:50:59",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557950",
            "title": "Stella Jones GAAP EPS of C$0.91, revenue of C$727M",
            "description": "<html><body><ul>\n<li>Stella Jones <a href=\"https://seekingalpha.com/pr/20414782-stella-jones-announces-fourth-quarter-and-full-year-2025-results\">press release</a>  (STLJF): Q4  GAAP EPS of C$0.91.</li>\n<li>Revenue of C$727M.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557950-stella-jones-gaap-eps-of-c091-revenue-of-c727m",
            "pub_date": "2026-02-27 00:46:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557951",
            "title": "Nordic American Tankers declares $0.17 dividend",
            "description": "<html><body><ul>\n<li>Nordic American Tankers (NAT) declares <a href=\"https://seekingalpha.com/pr/20414879-nordic-american-tankers-ltd-nyse-nat-report-as-per-december-31-2025-full-speed-ahead\" target=\"_blank\">$0.17/share quarterly dividend</a>.</li>\n<li>Payable March 24; for shareholders of record March 10; ex-div March 10.</li>\n<li><a href=\"https://seekingalpha.com/symbol/NAT/dividends?source=news_bullet\">See NAT Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557951-nordic-american-tankers-declares-0_17-dividend",
            "pub_date": "2026-02-27 00:46:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557908",
            "title": "uniQure falls after FDA commissioner’s comments on rare disease therapy",
            "description": "<html><body><p data-eci=\"true\">uniQure (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QURE\" title=\"uniQure N.V.\">QURE</a></span></span>) shares fell ~28% on Thursday after FDA Commissioner Marty Makary, in a potential reference to Danish biotech’s gene therapy AMT-130, suggested his agency will not approve drugs that are associated with patient morbidity.</p>\n<p>His comments come at a time when uniQure (<a href=\"https://seekingalpha.com/symbol/QURE\" title=\"uniQure N.V.\">QURE</a>) is seeking FDA accelerated approval for AMT-130, which is designed to treat a rare genetically driven neurodegenerative disorder <a href=\"https://seekingalpha.com/news/4538012-uniqure-gains-as-fda-sets-up-meeting-on-gene-therapy\" rel=\"noopener\" target=\"_blank\">called Huntington’s disease.</a></p>\n<p>During an interview with CNBC on rare-disease drug approvals on Thursday, Makary said, \"I think there has been a bit of an effort to find a boogeyman to account for certain products that were not approved.”</p>\n<p>“For example, there was a product where the researchers drilled a burr hole, literally a hole in people's skulls, to interact inject intrathecally into the ventricle\" as part of a randomized controlled trial.</p>\n<p>AMT-130 is administered directly into patients’ brain tissue through a neurosurgical procedure. “At the end of the randomization period, it's found no benefit, and yet, this is one of the drugs that we were pressured to approve,” Makary added.</p>\n<p>“I have a lot of sympathy for those patients. There's <a href=\"https://x.com/adamfeuerstein/status/2027027966945829196?s=20\" rel=\"noopener\" target=\"_blank\">nothing out</a> there to offer them, but we're not going to go ahead and approve something like that that has morbidity associated with it,” he said.</p>\n<p><span data-preserver-spaces=\"true\">However, Leerink Partners reaffirmed its Outperform rating on uniQure (<a href=\"https://seekingalpha.com/symbol/QURE\" title=\"uniQure N.V.\">QURE</a>), arguing that the drug Makary referred to could be </span><span data-preserver-spaces=\"true\">Regenxbio’s</span><span data-preserver-spaces=\"true\"> (<a href=\"https://seekingalpha.com/symbol/RGNX\" title=\"REGENXBIO Inc.\">RGNX</a>) RGX-121 and not AMT-130.</span></p>\n<p><span data-preserver-spaces=\"true\">A gene therapy targeting rare neurodegenerative diseases known as Mucopolysaccharidosis II (MPS II) and Mucopolysaccharidosis type I (MPS I), RGX-121, is delivered intrathecally into a ventricle using burr holes, analyst Joseph Schwartz argued. </span></p>\n<p><span data-preserver-spaces=\"true\">He added that it is not the </span><span data-preserver-spaces=\"true\">FDA's</span><span data-preserver-spaces=\"true\"> policy to comment on a drug under its review. Instead,</span><span data-preserver-spaces=\"true\"> “</span><span data-preserver-spaces=\"true\">this suggests this was about a drug that had been officially reviewed and rejected,</span><span data-preserver-spaces=\"true\">” </span><span data-preserver-spaces=\"true\">the analyst wrote, referring to RGX-121, for which the FDA issued a complete response </span><a href=\"https://seekingalpha.com/news/4549257-regenxbio-stock-drops-on-fda-setback-for-rgx-121-gene-therapy\" rel=\"noopener\" target=\"_blank\"><span data-preserver-spaces=\"true\">letter earlier this month</span></a><span data-preserver-spaces=\"true\">.</span></p>\n<p><em><span data-preserver-spaces=\"true\">Update 11.37 AM ET: Adds comments from Leerink Partners</span></em></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557908-uniqure-falls-fda-commissioners-comments",
            "pub_date": "2026-02-27 00:40:50",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557948",
            "title": "Cascades Non-GAAP EPS of $0.40, revenue of $4.77M",
            "description": "<html><body><ul>\n<li>Cascades <a href=\"https://seekingalpha.com/pr/20414789-cascades-reports-results-for-the-fourth-quarter-and-full-year-2025\">press release</a>  (CADNF): Q4  Non-GAAP EPS of C$0.40.</li>\n<li>Revenue of C$4.77M.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557948-cascades-non-gaap-eps-of-0_40-revenue-of-4_77m",
            "pub_date": "2026-02-27 00:40:50",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557945",
            "title": "Akebia outlines 2026 pipeline expansion and expects Vafseo data catalysts in $1B dialysis market",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Akebia Therapeutics (AKBA) Q4 2025  </p>\n<h3>Management View</h3>\n<ul>\n<li>CEO John Butler emphasized that \"2025 was an important year for Akebia, marked by the commercial launch of Vafseo\" and highlighted total net product revenue of $227 million for the year, with Vafseo and Auryxia as key contributors. Butler noted, \"the body of evidence is growing that supports the potential for Vafseo to become standard of care in what is a $1 billion U.S. market opportunity after the TDAPA period ends when we expect Vafseo will be priced roughly in parity with ESA pricing.\"</li>\n<li>Butler discussed the impact of new clinical data, stating, \"At the ASN meeting in November, we presented a post-hoc hierarchical composite endpoint analysis...patients treated with Vafseo experienced a lower risk of dying or being hospitalized than patients treated with the ESA comparator.\"</li>\n<li>The CEO announced a cost comparison analysis to be presented at the ADC, showing Vafseo \"demonstrated a 7.7% lower annual hospitalization rate, 16% reduction in hospitalization days and...approximately 15% lower Medicare hospitalization costs for patients treated with Vafseo versus darbepoetin.\"</li>\n<li>Butler introduced the company’s rare kidney disease pipeline, noting, \"Strategically, this initiative is a natural extension for us as it leverages our expertise in kidney disease drug development.\" Plans include an R&amp;D Day on April 2 to discuss mid-stage assets such as praliciguat and AKB-097, with a Phase II trial for praliciguat and a Phase II basket trial for AKB-097 expected to initiate in the second half of 2026.</li>\n<li>SVP &amp; Chief Commercial Officer Nicholas Grund reported, \"During the quarter, approximately 800 prescribers wrote a prescription for Vafseo...128 of those were new prescribers.\" Grund highlighted expanding access, improved adherence, and momentum in 2026, with \"first refill adherence with approximately 87% among the now larger subset of patients on an observed dosing regimen.\"</li>\n<li>CFO Erik Ostrowski stated, \"Total revenues were $57.6 million in Q4 '25 compared to $46.5 million in Q4 '24 and $236.2 million in calendar year '25 compared to $160.2 million in calendar year '24. These increases were driven by sales of Vafseo and an increase in Auryxia sales.\"</li>\n<li>Ostrowski also noted, \"Net loss in Q4 '25 decreased to $12.2 million as compared to a net loss of $22.8 million in Q4 '24. Net loss for the year also decreased to $5.3 million in calendar year '25 as compared to a net loss of $69.4 million in calendar year '24.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management did not provide explicit revenue guidance for 2026, but Butler indicated, \"we're not guiding for revenue...we absolutely expect and are seeing growth from that level. We don't know exactly how quickly that will increase.\"</li>\n<li>Butler described expectations for Vafseo growth as \"steady growth month-over-month, quarter-over-quarter as we start to penetrate deeper in terms of breadth and depth.\"</li>\n<li>The company plans to initiate a Phase II open-label basket trial for AKB-097 in the second half of 2026 and a Phase I study in healthy volunteers of AKB-9090 in the first half of 2026.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Total revenues for Q4 2025 were $57.6 million, with Vafseo net product revenues at $6.2 million and Auryxia net product revenues at $48.1 million. Net loss in Q4 2025 was $12.2 million. Cash and cash equivalents as of year-end stood at $184.8 million.</li>\n<li>Ostrowski indicated, \"We believe our existing cash resources and cash from operations will be sufficient to fund our current operating plans for at least the next 2 years.\"</li>\n<li>Cost of goods sold was $12.5 million in Q4 2025. R&amp;D expenses rose to $26.6 million, including a $12.8 million charge related to AKB-097 acquisition. SG&amp;A expenses were $26.1 million.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Julian Harrison, BTIG: Asked about expectations for Vafseo growth in 2026 and inventory-adjusted demand. Butler responded, \"we're not guiding for revenue...demand basically has been flat. We had $12 million in the third quarter, $11 million in the fourth quarter...we absolutely expect and are seeing growth from that level.\"</li>\n<li>Harrison also questioned the impact of upcoming VOICE study data. Butler stated, \"as these things are published available and our sales and medical affairs folks can use them, these are the things that influence utilization and physicians.\"</li>\n<li>Unknown Analyst (Jefferies): Inquired about refill rates and anemia manager education. Grund explained, \"We've seen this continuation of this high 80%, 90% adherence rate even through the second prescription.\"</li>\n<li>Unknown Analyst (Leerink Partners): Asked about the VOCAL study endpoints and protocol changes for AKB-097. Burke said, \"The primary endpoint is non-inferiority for hemoglobin control...the red blood cell study will be interesting and important.\"</li>\n<li>Unknown Analyst (Piper Sandler): Queried about the upcoming R&amp;D Day. Butler stated, \"we really want to focus on praliciguat and 097...hearing the excitement around that product from people other than Akebia employees, I think, is important.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts were focused on operational execution, adherence improvements, and clinical data catalysts, with a neutral-to-slightly-positive tone as they sought further clarity but acknowledged progress.</li>\n<li>Management maintained a confident and proactive tone, with Butler saying, \"I've never been more confident that the data that we're generating supports that managing anemia with a HIF-PHI...is going to be standard of care.\"</li>\n<li>Compared to the previous quarter, management’s tone shifted from addressing operational hurdles to emphasizing growth potential and confidence in clinical differentiation and pipeline expansion.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Management’s commentary moved from operational challenges and protocol implementation in Q3 2025 to broader prescriber access and improved adherence in Q4 2025.</li>\n<li>The rare kidney disease pipeline was introduced as a new strategic focus, with multiple mid-stage and early-stage assets detailed for the first time.</li>\n<li>Q4 highlighted a decrease in Vafseo revenue due to inventory drawdown, but stronger cash and decreased net loss were reported.</li>\n<li>Analysts in Q4 focused more on growth prospects, data catalysts, and pipeline differentiation compared to operational issues and initial launch metrics in Q3.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cautioned about generic competition for Auryxia, stating, \"expect Auryxia revenues to decrease in 2026 as compared to 2025 Auryxia revenues.\"</li>\n<li>Adherence and operational execution for Vafseo remain under close watch, with ongoing efforts to improve protocols and education.</li>\n<li>No explicit mention of regulatory risks or additional financial uncertainties beyond those discussed.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Akebia management remains confident in the commercial trajectory of Vafseo and the strategic expansion into rare kidney disease therapies, highlighting improved adherence, expanded prescriber access, and a robust pipeline. With upcoming data from VOCAL and VOICE studies, anticipated protocol-driven growth, and a strong balance sheet, the company is positioned to pursue standard-of-care status for Vafseo in the $1 billion U.S. dialysis market while advancing multiple clinical programs in 2026 and beyond.</p>\n<p><a href=\"https://seekingalpha.com/symbol/akba/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557945-akebia-outlines-2026-pipeline-expansion-and-expects-vafseo-data-catalysts-in-1b-dialysis",
            "pub_date": "2026-02-27 00:31:30",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557936",
            "title": "PayPal drops on report Stripe isn't in talks for a takeover",
            "description": "<html><body><p data-eci=\"true\">PayPal (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/PYPL\" title=\"PayPal Holdings, Inc.\">PYPL</a></span>) fell 2.6% after a report that the company isn't in talks to sell itself to Stripe (Stripe) or anyone else. </p>\n<p>PayPal (<a href=\"https://seekingalpha.com/symbol/PYPL\" title=\"PayPal Holdings, Inc.\">PYPL</a>) has been working for months to prepare for a possible activist campaign or unwanted takeover offer, according to a<a href=\"https://www.semafor.com/article/02/26/2026/paypal-stripe-not-currently-in-talks\" rel=\"nofollow\" target=\"_blank\" title=\" Semafor report \"> Semafor report </a>on Thursday, which cited people familiar with the matter. </p>\n<p>PayPal (<a href=\"https://seekingalpha.com/symbol/PYPL\" title=\"PayPal Holdings, Inc.\">PYPL</a>) declined to comment to Semafor. Stripe didn’t immediately return a request for comment. </p>\n<p>The Semafor item comes after a Bloomberg report on Tuesday that <span>Stripe was<a href=\"https://seekingalpha.com/news/4556161-paypal-jumps-on-report-stripe-is-considering-acquisition\" target=\"_blank\" title=\" considering an acquisition \"> considering an acquisition </a>of all or parts of PayPal (<a href=\"https://seekingalpha.com/symbol/PYPL\" title=\"PayPal Holdings, Inc.\">PYPL</a>). PayPal shares soared 6% on Monday after a Bloomberg report that PayPal<span> had piqued the interest of<a href=\"https://seekingalpha.com/news/4555316-paypal-stock-jumps-after-stock-slump-said-to-spark-suitors-interest#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" rel=\"noopener\" target=\"_blank\" title=\" some potential acquirers. \"> some potential acquirers.</a></span></span></p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557936-paypal-drops-on-report-stripe-isnt-in-talks-for-a-takeover",
            "pub_date": "2026-02-27 00:31:30",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}