{
    "data": [
        {
            "id": "4558769",
            "title": "Archer Aviation Q4 earnings on deck: What to expect",
            "description": "<html><body><p data-eci=\"true\" data-pm-slice=\"0 0 []\">Archer Aviation (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ACHR\" title=\"Archer Aviation Inc.\">ACHR</a></span></span>) <span>will report its results for the fourth quarter on Monday, after market close.</span></p>\n<p data-pm-slice=\"0 0 []\"><span><span>Wall Street </span><a href=\"https://seekingalpha.com/symbol/ACHR/earnings/estimates?period=quarterly\" target=\"_blank\" title=\"expects \">expects </a><span>the company to post a loss per share of $0.17, with no revenue anticipated.</span></span></p>\n<p data-pm-slice=\"0 0 []\">Archer reported progress in test flights, including an altitude milestone, and participated in a government program to demonstrate air taxi safety. The company won a competitive bid to acquire a patent portfolio from Lilium. It was selected by Korean Air to deploy its Midnight aircraft in Korea, and was named an air taxi partner for the Los Angeles Sports Commission, while its shares reacted to developments involving Tesla.</p>\n<p data-pm-slice=\"0 0 []\">It later announced a powertrain agreement, secured an air mobility deal in Saudi Arabia, and drew investment activity from Cathie Wood’s ARK Invest, alongside a dispute with Joby Aviation.</p>\n<p data-pm-slice=\"0 0 []\">The company subsequently announced a collaboration with Karem Aircraft, outlined plans for a metropolitan air taxi network in Miami, worked with Saudi Arabia’s General Authority of Civil Aviation to accelerate deployment, and faced broader sector pressure tied to potential tighter aviation safety rules and cautious industry views from Goldman Sachs favoring BETA Technologies.</p>\n<p data-pm-slice=\"0 0 []\"><span>According to </span><span>Alpha’s </span><a href=\"https://seekingalpha.com/symbol/ACHR/ratings/quant-ratings\" target=\"_blank\" title=\"Quant \">Quant </a><span></span><span>Rating system, ACHR is rated Hold with an overall score of 2.75 out of 5, reflecting grades of A- in terms of growth but a D- in terms of profitability.</span></p>\n<p data-pm-slice=\"0 0 []\">An <a href=\"https://seekingalpha.com/article/4873820-archer-aviation-stock-hawthorne-airport-deal-la28-olympics-catalyst\" target=\"_blank\" title=\"analyst said\">analyst said</a> the company has signed “definitive agreements to acquire control of Hawthorne Airport,” noting the site is intended to serve as “the operational hub for its planned LA air taxi network,” while adding that urban air mobility could mark “the most significant change in commercial aviation since the jet engine.”</p>\n<p data-pm-slice=\"0 0 []\">The note also cited Archer’s selection as the Official Air Taxi Provider for the LA28 Olympic Games as providing “the perfect opportunity to gain worldwide recognition” and highlighted a valuation comparison with Joby Aviation, stating the firms could form a “duopoly in the US,” while adding that key risks include certification delays and reliance on outsourced manufacturing.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558769-archer-aviation-q4-earnings-on-deck-what-to-expect",
            "pub_date": "2026-02-28 00:26:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558626",
            "title": "Tenth time's the charm: Paramount's pursuit of Warner Bros. and what lies ahead",
            "description": "<html><body><p data-eci=\"true\" data-pm-slice=\"1 1 []\">Paramount Skydance (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a></span>) kept trying until it succeeded, and it did. On late Thursday, Netflix (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a></span>) declined to raise its offer for Warner Bros. Discovery (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/WBD\" title=\"Warner Bros. Discovery, Inc.\">WBD</a></span>) after being engaged in a months-long bidding war against David Ellison's media company and let it have the coveted assets of the HBO parent. </p>\n<p>The streaming giant threw in the towel, saying the transaction was no longer financially attractive, and added that it was not fixated on having WBD's assets but didn't want to pass up the opportunity of owning such a reputed and prestigious media portfolio. </p>\n<h3>A quick recap</h3>\n<p>It was Ellison who started it all because Warner Bros. had other plans, to separate its streaming and studios segment from its declining linear TV business, just like Comcast (<a href=\"https://seekingalpha.com/symbol/CMCSA\" title=\"Comcast Corporation\">CMCSA</a>). </p>\n<p>But months after Skydance bought Paramount, which took over a year, Ellison set his eyes on Warner Bros. </p>\n<p>He kicked off with at least three private offers for the company last year in September, and that prompted Warner CEO David Zaslav to put the company up for sale in October.</p>\n<p>The move by Warner Bros. invited more players into the bidding process. Comcast, Netflix, and reportedly Starz (<a href=\"https://seekingalpha.com/symbol/STRZ\" title=\"Starz Entertainment Corp.\">STRZ</a>) participated in the early rounds. By December, Warner announced that Netflix will buy its streaming and studio businesses for $82.7B.</p>\n<p>Paramount then launched a hostile takeover process with a tender offer of $30 per WBD share. Warner kept recommending the Netflix transaction and asked shareholders to reject Paramount's tender offer.</p>\n<p>Ellison didn't back down. He kept adding sweeteners to the deal until Zaslav finally took notice and returned for negotiations. </p>\n<p>Netflix was clear from the start and wanted to maintain financial discipline. It was not going to overpay for the debt-laden CNN owner. Paramount finally emerged victorious after its tenth bid was deemed superior by Warner.</p>\n<h3>What is the price?</h3>\n<p>Paramount will pay $31 per share in cash to buy the whole of Warner Bros. and assume its debt in a deal valued at $111B. Without debt, Paramount is paying roughly $77B to $78B.</p>\n<p>Paramount's offer, among other things, includes</p>\n<ul>\n<li><p>An equity commitment of $45.7B from the Ellison Trust and personal guarantees from Oracle co-founder Larry Ellison.</p></li>\n<li><p>About $57.5B in debt commitments from Bank of America Merrill Lynch, Citi, and Apollo.</p></li>\n<li><p>A “ticking fee” of roughly $650M per quarter if the deal does not secure regulatory clearances by September 30, 2026.</p></li>\n<li><p>The $2.8B termination fee WBD owes Netflix for terminating the previous agreement.</p></li>\n<li><p>The elimination of about $1.5B in potential financing costs related to WBD's existing debt exchange.</p></li>\n</ul>\n<h3>What does Paramount get?</h3>\n<p>In streaming and studios, the company will become the new owner of Warner Bros. Entertainment, which includes Warner Bros. Pictures, New Line Cinema, Warner Bros. Television Group, access to all of HBO's portfolio and the Max streaming service, DC Entertainment, and Warner Bros. Games, among other things.</p>\n<p>In linear networks, the company will notably get CNN Worldwide, TNT Sports, Discovery Channel, Food Network, TLC, Animal Planet, TBS, Adult Swim, and Cartoon Network, among other things.</p>\n<h3>What happens next?</h3>\n<p>Warner Bros. has been the subject of numerous M&amp;A transactions and has had its fair share of ups and downs over the years. Wall Street will now closely watch how its new owners will unlock maximum shareholder value. </p>\n<p>Accurate execution at the combined entity will be of paramount importance. How it deleverages the balance sheet, which is expected to carry up to $100B in debt, will be closely monitored. Stagnating revenue, unsuccessful projects, or poor box office performance could hurt the stock.</p>\n<p>Warner and Paramount combined have a pro forma revenue of about $67B annually, still lagging behind Comcast and Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>) but ahead of Netflix. Warner was already the third-largest media company by revenue and will continue to retain that spot after the merger. </p>\n<p>Paramount said it forecasts up to $6B in cost synergies by getting rid of \"duplicative operations\" across the two companies, which means the possibility of job cuts cannot be ruled out.</p>\n<p>Soon after Ellison bought Paramount, he initiated a one-time mass layoff of 2,600 employees. Paramount at that time had a global workforce of over 18,000. Warner currently has about 35,000 employees worldwide.</p>\n<p>While there were concerns about a streaming industry monopoly had Warner gone with Netflix, the deal with Paramount will lead to consolidation of two of the \"Big Five\" Hollywood studios, and investors will closely watch what regulators make of that.</p>\n<p>On the movie side of things, Ellison had already committed to making films for the big screen when he bought Paramount, and he is expected to follow through on his promise with the Warner deal. Details on new annual film targets are expected in the days ahead. </p>\n<p>He is also likely to hold a press conference with journalists like he did for the Paramount transaction back in 2025 once the deal closes.</p>\n<p>Warner Bros. has its own history of having gone through <a href=\"https://seekingalpha.com/news/4456480-timeline-the-corporate-legacy-of-warner-bros-through-the-years\" target=\"_blank\" title=\"numerous corporate identity makeovers\">numerous corporate identity makeovers</a>, and the new name for the combined entity is expected in the coming days.</p>\n<p>Could it be \"Paramount Warner, a Skydance Corporation,\" or \"Warner Bros. Paramount\"? </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558626-tenth-times-the-charm-paramounts-pursuit-of-warner-bros-and-what-lies-ahead",
            "pub_date": "2026-02-28 00:26:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558786",
            "title": "Arcosa outlines $2.95B–$3.1B 2026 revenue target as company pivots to growth-focused portfolio",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Arcosa, Inc. (ACA) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Antonio Carrillo, President and CEO, highlighted \"2025 was an outstanding year for Arcosa, demonstrated by our exceptional financial performance and significant advancement of our strategic transformation.\" He emphasized record revenues of $2.9 billion, record adjusted EBITDA of $583 million, and a 20.2% adjusted EBITDA margin. Carrillo pointed out momentum in Construction Materials and Engineered Structures, with cyclical expansion in both barge and wind towers. He announced the sale of the barge business for $450 million in cash, stating, \"we believe this is the right time to transition the barge business to an owner aligned with its long-term growth plans.\" Carrillo underscored the divestiture's impact, noting, \"The barge transaction further reduces portfolio complexity and cyclicality, raises our overall margin profile and enhances the long-term resiliency of the company.\"</li>\n<li>Gail Peck, Chief Financial Officer, reported, \"During the quarter, we generated $120 million of operating cash flow...CapEx for the fourth quarter was $64 million, resulting in full year CapEx of $166 million, which was above the high end of our guidance range.\" Peck confirmed that free cash flow for the quarter was roughly $60 million and was $202 million for the full year. She commented, \"We ended the year with net debt to adjusted EBITDA of 2.3x comfortably within our target leverage range. This is down from 2.9x at the start of the year.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Carrillo set 2026 revenue guidance at $2.95 billion to $3.1 billion and adjusted EBITDA between $590 million and $640 million, both excluding the barge divestiture impact. He stated, \"Our 2026 guidance incorporates another record year for our growth businesses, Construction Materials and Engineered Structures.\"</li>\n<li>Barge business guidance for 2026 is full year revenues of $410 million to $430 million and adjusted EBITDA of $70 million to $75 million. The company will update full year guidance once the barge sale closes.</li>\n<li>Carrillo indicated, \"With combined double-digit adjusted EBITDA growth and margin uplift\" expected for growth businesses, and a \"short-term step-down in wind towers before recovering in 2027.\"</li>\n<li>Peck projected CapEx for 2026 of $220 million to $250 million, including $70 million to $80 million for growth and $150 million to $170 million for maintenance. Net interest expense is expected between $88 million and $90 million. Effective tax rate for 2026 is estimated at 17.5% to 19.5%.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Peck stated, \"Fourth quarter adjusted EBITDA increased 13% and margin expanded 90 basis points, with all segments contributing.\"</li>\n<li>Construction Products segment revenues decreased 2% in Q4, but excluding freight, revenues increased 4% and adjusted segment EBITDA grew 3% with 140 basis points of margin expansion.</li>\n<li>Aggregates business reported freight-adjusted revenues up roughly 8%, driven by 5% pricing growth and 2% volume improvement. Adjusted cash gross profit increased 6% and per ton increased 3%.</li>\n<li>Engineered Structures saw segment revenues rise 15%, led by a 20% increase for utility and related structures. Wind tower revenue increased 3%.</li>\n<li>Transportation Products revenues rose 19% and adjusted segment EBITDA increased 24%, mainly from higher tank barge volumes and favorable mix.</li>\n<li>Free cash flow for the quarter was roughly $60 million, and for the year $202 million. Liquidity stood at $915 million.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Ian Zaffino, Oppenheimer: Asked about redeployment of barge sale proceeds and future moves to reduce cyclicality. Carrillo responded, \"we have a very active pipeline of opportunities...mainly bolt-on acquisitions,\" and emphasized, \"now that we're a simpler company, we will focus our full attention into deploying the capital to generate additional value for our shareholders.\"</li>\n<li>Ethan Roberts, Stephens: Inquired about utility structures as a growth driver and offset to wind. Peck replied, \"we do see a path to that strong utility compensating for the step down in wind,\" and expects \"flat to maybe slight growth within the segment for next year.\"</li>\n<li>Garik Shmois, Loop Capital: Questioned Q1 impact from Northeast weather and gross profit per ton expectations. Peck answered, \"with the weather and the snow here recently, we'll see that percentage share drop just a little bit\" and anticipates \"solid unit profitability gains on -- for 2026.\"</li>\n<li>Julio Romero, Sidoti: Explored accelerating utility structures demand and customer reservations. Carrillo explained, \"we see the need to accelerate our capacity expansion because our customers need it...we had a market study by a third-party, analyze utility investment over the next 5 to 10 years.\"</li>\n<li>Brent Thielman, D.A. Davidson: Asked about Engineered Structures margin sustainability and M&amp;A pipeline. Peck responded, \"wind is going to have an impact for sure...a path to flat margins for the segment looks achievable.\" Carrillo reiterated disciplined capital allocation for M&amp;A.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts probed the sustainability of growth, impact of weather, and capital allocation, with a generally positive but inquisitive tone, seeking clarity on future growth drivers and margin implications.</li>\n<li>Management maintained a confident and optimistic stance throughout, with Carrillo stating, \"we are a simpler company, we will focus our full attention into deploying the capital to generate additional value for our shareholders.\" Peck’s tone was measured and precise regarding financial discipline and outlook.</li>\n<li>Compared to the previous quarter, both analysts and management were more focused on post-divestiture strategy and capital deployment, with management’s confidence levels remaining high.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 was introduced, with a revenue range of $2.95 billion to $3.1 billion and higher projected CapEx versus the previous quarter’s $145 million to $155 million range.</li>\n<li>The company announced a key strategic shift with the barge business sale, whereas the previous quarter emphasized strong performance across segments and steady deleveraging.</li>\n<li>Analyst questions shifted from clarifying past performance to future capital deployment and growth direction post-divestiture.</li>\n<li>Management’s tone remained confident, with greater focus on executing a streamlined, growth-focused strategy.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management referenced weather-related headwinds in the Northeast affecting Q1 results for Stavola and acknowledged ongoing policy uncertainty in the wind tower business.</li>\n<li>Carrillo cited, \"policy uncertainty makes it -- we need to get through the noise\" regarding wind towers, while also emphasizing risk mitigation through business rightsizing and facility transitions.</li>\n<li>Peck noted seasonality and weather as factors impacting quarterly financial cadence, particularly in Q1 2026.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Arcosa management underscored a pivotal year, marked by record performance, a strategic divestiture to simplify the business and strengthen its margin profile, and a sharpened focus on growth in Construction Materials and Engineered Structures. With clear 2026 financial targets, a robust M&amp;A pipeline, and continued investment in capacity expansion, management signaled confidence in leveraging infrastructure and power market tailwinds to create additional value for shareholders while navigating near-term headwinds in wind towers and weather-impacted regions.</p>\n<p><a href=\"https://seekingalpha.com/symbol/aca/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558786-arcosa-outlines-2_95b-3_1b-2026-revenue-target-as-company-pivots-to-growth-focused-portfolio",
            "pub_date": "2026-02-28 00:11:18",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558776",
            "title": "Venezuela halted planned sale of Halliburton assets at U.S. request - Bloomberg",
            "description": "<html><body><p data-eci=\"true\"><span>Venezuela <a href=\"https://www.bloomberg.com/news/articles/2026-02-27/venezuela-nixed-sale-of-halliburton-s-assets-at-us-request\" rel=\"nofollow\" target=\"_self\" title=\"canceled\">canceled</a> an auction of assets seized from </span><span>Halliburton (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/HAL\" title=\"Halliburton Company\">HAL</a></span>)</span><span> after the Trump administration intervened to stop the sale, a move that is expected to clear the path for the U.S. company's return to Venezuela, Bloomberg reported Friday.</span></p>\n<p><span><span>Halliburton (<a href=\"https://seekingalpha.com/symbol/HAL\" title=\"Halliburton Company\">HAL</a>) </span>shut down<span> its primary operations in Venezuela in 2020 after the U.S. tightened sanctions on the Maduro regime; in December, a Venezuelan court ordered the sale of the company's equipment, which was followed days later by a company lawsuit against the country filed at<span> the World Bank's international arbitration court.</span></span></span></p>\n<p><span><span><span><span>U.S. Energy Secretary Chris Wright traveled to Venezuela earlier this month and met acting President </span>Delcy Rodriguez; in the same week, a Halliburton (<a href=\"https://seekingalpha.com/symbol/HAL\" title=\"Halliburton Company\">HAL</a>) team visited facilities in the country where it holds assets still under their control, according to the report.</span></span></span></p>\n<p><span><span><span><span>Halliburton (<a href=\"https://seekingalpha.com/symbol/HAL\" title=\"Halliburton Company\">HAL</a>) CEO </span>Jeff Miller<span> <a href=\"https://seekingalpha.com/news/4541172-halliburton-says-prepared-to-quickly-restart-venezuela-operations\" target=\"_self\" title=\"said last month\">said last month</a> that the company was ready to quickly restart work in Venezuela once it obtained U.S. government approval and some sort of payment protections.</span></span></span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558776-venezuela-halted-planned-sale-of-halliburton-assets-at-u-s-request-bloomberg",
            "pub_date": "2026-02-28 00:06:07",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558777",
            "title": "OpenAI's massive funding round should benefit Microsoft, Oracle: BNP",
            "description": "<html><body><p data-eci=\"true\">OpenAI's (<a href=\"https://seekingalpha.com/symbol/OPENAI\" title=\"OpenAI\">OPENAI</a>) <a href=\"https://seekingalpha.com/news/4558700-openai-confirms-110b-funding-round-with-50b-from-amazon-and-30b-from-nvidia-softbank\" target=\"_blank\" title=\"announcement\">announcement</a> that it has raised $110B in new funding should alleviate the concerns about paying its bills and ultimately benefit Microsoft (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a></span>) and Oracle (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ORCL\" title=\"Oracle Corporation\">ORCL</a></span>), BNP Paribas said.</p>\n<p>“Broadly, the formal announcement of OpenAI’s $110B fundraise at a reported $730B pre-money valuation ($840B post-money) should be incrementally positive for Microsoft and Oracle, even if it’s been well telegraphed from media reports in recent months,” BNP analyst Stefan Slowinski wrote in a note to clients. “With fresh capital now secured, OpenAI appears well positioned to fund both its $250B compute contract with Microsoft and $300B compute contract with Oracle.”</p>\n<p>Slowinski added that OpenAI's updated cash burn forecasts imply roughly $180B in funding needs through 2030, which includes the $110B raised from Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>), Amazon (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>), and SoftBank (<a href=\"https://seekingalpha.com/symbol/SFTBY\" title=\"SoftBank Group Corp.\">SFTBY</a>). “As a result, with additional non-strategic investors layering in alongside the initial $110B raise, OpenAI could ultimately be most of the way towards addressing its cumulative cash needs,” Slowinski explained.</p>\n<p>He has a Buy rating on Microsoft and Oracle and respective price targets of $659 and $290.</p>\n<p>Beyond the ability to pay its bills, OpenAI's funding round has other implications for Microsoft and Oracle, Slowinski said. </p>\n<p>For Microsoft, the analyst believes the Satya Nadella-led company will report a “significant gain” in the fiscal third-quarter as its stake in OpenAI is likely to be valued higher. Assuming Microsoft is diluted with this funding round, he believes Microsoft owns roughly $200B worth of OpenAI, or about 7% of Microsoft's market cap. “Removing this from Microsoft’s valuation makes the current multiple that much more attractive,” he explained.</p>\n<p>For Oracle, Slowinski said the debate now moves on to whether Oracle can actually execute its contracts. “While we would have initially assumed that closing the raise would be viewed positively for Oracle, we worry the debate will simply shift to the ROI of AI and whether Oracle’s capital investments will ultimately deliver an attractive return, especially as OpenAI appears to be increasingly diversifying its cloud compute stack,” the analyst explained.</p>\n<p>Other questions may include whether OpenAI needs Oracle Cloud Infrastructure after Oracle delivers on its initial contract, given the increased commitment between OpenAI and Amazon Web Services, Slowinski said.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558777-openais-massive-funding-round-should-benefit-microsoft-oracle-bnp",
            "pub_date": "2026-02-28 00:00:54",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558743",
            "title": "Target's outlook remains “cloudy” and turnaround is stifled by competition, stagnant housing market -- BofA Securities",
            "description": "<html><body><p data-eci=\"true\"><span>Target</span> (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a></span></span>) is set to report quarterly results next Tuesday, March 3, with scrutiny centered on holiday-quarter execution, margin performance, and whether the new CEO can turn the company around.</p>\n<p>BofA Securities’ Christopher Nardone thinks Wall Street’s expectations for positive comparable sales growth beyond the fiscal first quarter may prove “aggressive” despite higher tax refunds, and an EPS recovery will take time.</p>\n<p>“We expect initial 2026 guidance will include a wide range of EPS outcomes; the lower end will likely contemplate continued weakness in comp trends, while the upper end will likely include comp progression driven by management’s actions to turn the business,” Nardone says.</p>\n<p>Meanwhile, Nardone believes Target’s (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) sales outlook remains “cloudy” due to limited green shoots in most discretionary categories, lagging sales in apparel and home (which makes up 50% of Target’s sales), “fierce” competition, and the impact the stagnant housing market is having on Target's (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) home segment, which will take time to recover. <span>  </span></p>\n<p>All of which leads Nardone to reinstate coverage of Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) with an Underperform rating and a $103 price target that assumes ~9% downside from current levels.</p>\n<p><span> </span>“We believe Target’s lack of scale versus larger competitors in digital advertising and third party online marketplaces may inhibit its ability to offset margin pressure and fund key strategic investments (including automation and AI),” Nardone says in his note to clients.</p>\n<p>In the fourth quarter, Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) is expected to have earned a profit of $2.15 per share on $30.5B in revenue, down 11% and 1.4% from the same quarter last year.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558743-targets-outlook-remains-cloudy-and-turnaround-is-stifled-by-competition-stagnant-housing-market",
            "pub_date": "2026-02-27 23:56:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558672",
            "title": "CoreWeave slumps after mixed Q4, analysts mull investor concerns over margins",
            "description": "<html><body><p data-eci=\"true\">Shares of CoreWeave (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CRWV\" title=\"CoreWeave, Inc.\">CRWV</a></span>) slumped about 16% on Friday after mixed fourth quarter results while analysts discussed investor concerns over margins.</p>\n<p>Morgan Stanley kept its Equal-weight rating and $99 price target on the stock.</p>\n<p>\"Q4 <a href=\"https://seekingalpha.com/news/4558130-coreweave-falls-after-reporting-mixed-q4-financial-results\" target=\"_blank\" title=\"revenues\">revenues</a> up 110% YoY to $1.6B represent unprecedented scaling within our coverage, targets of $30B in ARR exiting FY27 and 8GWs of active power exiting FY30 show mgmt's confidence in the TAM. However, a reset of FY26 margin expectations strikes at the heart of the CRWV debate, keeping us EW,\" said analysts led by Keith Weiss.</p>\n<p>The analysts noted that targeting adjusted operating income at $900 to $1.1B, suggesting operating margins of 8% at the mid-point, fell well below consensus expectations of 21% operating margins in 2026.</p>\n<p>The analysts added that the compounded fourth quarter margins coming in light of expectations strike at the heart of the investor debate on CoreWeave: \"What are the durable margins of this business?\"</p>\n<p>The analysts said that  CoreWeave's management's explanation of timing differences between the delivery of powered shells, provisioning of graphics processing units, or GPUs, and the monetization of those GPUs appeared at odds with the team's assertion that it gets GPUs up and running faster than any other provider in the market and left them with more questions than answers.</p>\n<p>\"Bottom line, if investors can gain confidence in the durable margin profile of CoreWeave being in line with management's mid-20s target, the stock currently well under prices the potential FCF [free cash flow] associated with a ramp to &gt;$80 billion in ARR [Annual Recurring Revenue] over the next 5 years. However, we remain on the sidelines at EW, awaiting more clarity on the unit economics of this rapidly scaling GPUaaS [GPU as a Service]  business and the potential for software (including the recent partnership with Nvidia) to tilt the margin equation more positively,\" said Weiss and his team.</p>\n<p>Evercore maintained its Outperform rating but lowered the price target on the stock to $150 from$160.</p>\n<p>Analysts led by Amit Daryanani said that CoreWeave reported a top-line beat in the fourth quarter as demand remained robust. However, the analysts noted that fourth quarter operating income ($88M versus Street at $133M) and EBITDA ($898M versus consensus at $929M) came in below consensus as ramp-up/installation costs related to an uptick in capacity coming online weighed on profitability.</p>\n<p>\"While the ramp dynamics will create noise around margins near term as CRWV adds more capacity, we note that the overall demand backdrop remains robust and believe CRWV remains well-positioned to capture an outsized share of the AI cloud opportunity. Furthermore, we see potential for upside from 1) monetization of software stack, 2) continued ramp up/installation period management, and 3) upsell of other cloud solutions (CPU, storage),\" said Daryanani and his team.</p>\n<p>Related stocks: Nebius (<a href=\"https://seekingalpha.com/symbol/NBIS\" title=\"Nebius Group N.V.\">NBIS</a>) fell about 7%, while Super Micro Computer (<a href=\"https://seekingalpha.com/symbol/SMCI\" title=\"Super Micro Computer, Inc.\">SMCI</a>) rose around 2% on Friday.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558672-coreweave-slumps-after-mixed-q4-analysts-mull-investor-concerns-over-margins",
            "pub_date": "2026-02-27 23:56:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558775",
            "title": "Block clears 50- and 100-day moving averages as RSI now runs toward overbought territory",
            "description": "<html><body><p data-eci=\"true\">Shares of Block (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/XYZ\" title=\"Block, Inc.\">XYZ</a></span>) surged sharply on Friday following the company’s latest earnings release, with investors responding positively to a sweeping restructuring plan centered on automation and efficiency.</p>\n<p>The fintech firm announced it will reduce its workforce by more than 40%, citing advances in intelligent automation and internal productivity initiatives that management believes will enable a leaner, more scalable operating model. </p>\n<p>The market reaction was swift. Block climbed as much as 20% and now trades around $64.70 per share. The rally propelled the stock above both its 50-day and 100-day moving averages — key technical thresholds it had not closed above since January 27 and January 7, respectively. </p>\n<p>Momentum indicators reflect the speed of the move as well. The relative strength index has risen to 63.51, approaching overbought territory but not yet exceeding it. Notably, the stock’s RSI stood at 34.91 earlier this week, near levels typically associated with oversold conditions, underscoring the rapid shift in sentiment. </p>\n<p>Despite Friday’s advance, Block remains down 2.6% year to date and off 20.8% over the past six months, highlighting the significance of the latest rebound within a broader period of volatility.</p>\n<p>Furthermore, see which <a href=\"https://seekingalpha.com/news/4558732-etf-impact-blocks-40-workforce-cut-fuels-20-rally-and-these-funds-are-taking-notice\" target=\"_blank\" title=\"ETFs have the most exposure\">ETFs have the most exposure</a> to XYZ’s recent rally.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558775-block-clears-50--and-100-day-moving-averages-as-rsi-now-runs-toward-overbought-territory",
            "pub_date": "2026-02-27 23:46:38",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558771",
            "title": "Private credit default risk in software could top 15%, warns Marathon’s Bruce Richards: BBG interview",
            "description": "<html><body><p data-eci=\"true\" data-id=\"a0345443-d46e-48ba-9d97-58eafd98bf5f\"><span data-ai=\"\">Marathon Asset Management founder and CEO Bruce Richards has raised alarm bells about the private credit sector’s heavy exposure to the software industry, warning that default rates in software-exposed private credit markets could surge past 15%. </span></p>\n<p data-id=\"a0345443-d46e-48ba-9d97-58eafd98bf5f\"><span data-ai=\"\">R</span><span data-ai=\"\">ichards shared his concerns in a recent interview with Bloomberg Television.</span></p>\n<p data-id=\"b2347969-3e3d-4964-b241-8b9869d134e1\"><span data-ai=\"\">The veteran asset manager pointed to concentration risk as a key vulnerability in the private credit space. According to Richards, the sector has become overly reliant on software companies, creating systemic risks that investors may be underestimating.</span></p>\n<p data-id=\"2ecf8ae9-483d-4974-ba49-b8c092124ec0\"><span data-ai=\"\">Private credit has experienced explosive growth lately as institutional investors searched for yield in a challenging market environment. However, Richards’ warning suggests that the sector’s rapid expansion may have come at the cost of adequate diversification and risk management.</span></p>\n<p data-id=\"5dd078dc-b55a-4ea4-9250-9772694259c2\"><span data-ai=\"\">The potential for double-digit default rates in software-exposed portfolios could have significant implications for pension funds, endowments, and other institutional investors that have allocated heavily to private credit strategies. Many of these investors were attracted by the asset class’s perceived stability and attractive returns.</span></p>\n<p data-id=\"6416f78e-a0b9-48e2-bf46-0a6034fbfd8b\"><span data-ai=\"\">Richards’ cautionary outlook adds to growing concerns among market observers about valuations and credit quality in the private lending space. As interest rates and economic conditions continue to evolve, the concentration risks he identified could become increasingly relevant for portfolio managers evaluating their private credit allocations.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558771-private-credit-default-risk-in-software-could-top-15-warns-marathons-bruce-richards-bbg-interview",
            "pub_date": "2026-02-27 23:41:45",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558755",
            "title": "Emergent BioSolutions plummets on weak 2026 revenue guidance, Q4 results",
            "description": "<html><body><ul>\n<li>Emergent BioSolutions (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EBS\" title=\"Emergent BioSolutions Inc.\">EBS</a></span>) is down ~23% in Friday morning trading after announcing 2026 revenue guidance after Thursday's closing bell that came in well below the consensus.</li>\n<li>The company is projecting revenue this year of $720M-$760M. Consensus is $1.16B.</li>\n<li>Emergent's Q4 financial results were also a disappointment, as both the bottom and top lines <a href=\"https://seekingalpha.com/news/4558246-emergent-biosolutions-non-gaap-eps-of-0_43-misses-by-0_54-revenue-of-148_7m-misses-by-68_8m\" target=\"_self\" title=\"missed expectations\">missed expectations</a> by wide margins. </li>\n<li>Year-over-year revenue dropped ~24% to <span>$148.7M. Q4 Non-GAAP EPS of ($0.43) compares to $0.05 in the year-ago period.</span>\n</li>\n<li><span>Emergent ended 2025 with cash, cash equivalents, and restricted cash of $209.1M compared to $105.6M on Dec. 31, 2024. </span></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558755-emergent-biosolutions-plummets-weak-2026-revenue-guidance-q4-results",
            "pub_date": "2026-02-27 23:36:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}