{
    "data": [
        {
            "id": "4559022",
            "title": "OPEC+ speeds up output hike as Iran conflict lifts oil prices",
            "description": "<html><body><p data-eci=\"true\" data-end=\"219\" data-start=\"77\">OPEC+ agreed to accelerate oil production increases modestly, even as fighting triggered by U.S.-Israeli strikes on Iran fuels a rally in crude.</p>\n<p data-end=\"515\" data-start=\"221\">After a virtual meeting Sunday, key producers led by Saudi Arabia and Russia said they will raise output by 206,000 barrels a day in April. That step is larger than the 137,000-barrel monthly boosts announced late last year, but still small relative to potential disruptions in the Middle East.</p>\n<p data-end=\"863\" data-start=\"517\">Oil climbed to about $73 a barrel (<a href=\"https://seekingalpha.com/symbol/CO1:COM\" title=\"Brent Futures\">CO1:COM</a>) in London last week, a seven-month high, as traders weighed military tensions and supply outages. While the group is signaling willingness to add barrels, analysts caution the move may have limited effect if exports through the Strait of Hormuz, a corridor for roughly one-fifth of global oil, are constrained.</p>\n<p data-end=\"1075\" data-start=\"865\">Most of OPEC+’s spare capacity sits in Saudi Arabia and the United Arab Emirates, estimated at roughly 2.5 million barrels a day, or less than 3% of global supply. Other members are producing near their limits.</p>\n<p data-end=\"1366\" data-start=\"1077\">The alliance has been gradually restoring more than 3.8 million barrels a day of previously curtailed output. With the April increase, it will have reinstated about three-quarters of that total on paper. Further adjustments remain possible, with ministers set to meet again in early April.</p>\n<p data-end=\"1551\" data-is-last-node=\"\" data-is-only-node=\"\" data-start=\"1368\">The decision comes as forecasters who once expected a 2026 supply glut reassess the outlook amid geopolitical risk, sanctions and unplanned disruptions that have tightened the market.</p>\n<p data-end=\"1551\" data-is-last-node=\"\" data-is-only-node=\"\" data-start=\"1368\"> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4559022-opec-speeds-up-output-hike-as-iran-conflict-lifts-oil-prices",
            "pub_date": "2026-03-01 22:21:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558905",
            "title": "Notable healthcare headlines for the week: Viatris, Novo Nordisk, and Gilead Sciences in focus",
            "description": "<html><body><p data-eci=\"true\">Wall Street’s major market averages finished lower on Friday after the January wholesale inflation report came in hotter than expected.</p>\n<p>The blue-chip Dow was last lower by 1%, while the benchmark S&amp;P 500 was -0.4%. At the same time, the tech-focused Nasdaq Composite was -0.9%. </p>\n<p>The S&amp;P 500 Health Care Index Sector (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/XLV\" title=\"State Street Health Care Select Sector SPDR ETF\">XLV</a></span>) slipped about 0.71% during the week.</p>\n<p>The top S&amp;P 500 healthcare gainers and losers for the last week are as follows:</p>\n<p><strong>Top 5 Gainers:</strong></p>\n<p>Edwards Lifesciences (<a href=\"https://seekingalpha.com/symbol/EW\" title=\"Edwards Lifesciences Corporation\">EW</a>) +8.41%</p>\n<p>IQVIA Holdings (<a href=\"https://seekingalpha.com/symbol/IQV\" title=\"IQVIA Holdings Inc.\">IQV</a>) +8.08%</p>\n<p>Moderna (<a href=\"https://seekingalpha.com/symbol/MRNA\" title=\"Moderna, Inc.\">MRNA</a>) +7.46%</p>\n<p>Charles River Laboratories International (<a href=\"https://seekingalpha.com/symbol/CRL\" title=\"Charles River Laboratories International, Inc.\">CRL</a>) +5.67%</p>\n<p>West Pharmaceutical Services (<a href=\"https://seekingalpha.com/symbol/WST\" title=\"West Pharmaceutical Services, Inc.\">WST</a>) +5.51%</p>\n<p><strong>Top 5 Losers:</strong></p>\n<p>Universal Health Services (<a href=\"https://seekingalpha.com/symbol/UHS\" title=\"Universal Health Services, Inc.\">UHS</a>) -10.58%</p>\n<p>Elevance Health (<a href=\"https://seekingalpha.com/symbol/ELV\" title=\"Elevance Health, Inc.\">ELV</a>) -6.69%</p>\n<p>Viatris (<a href=\"https://seekingalpha.com/symbol/VTRS\" title=\"Viatris Inc.\">VTRS</a>) -6.34%</p>\n<p>Baxter International (<a href=\"https://seekingalpha.com/symbol/BAX\" title=\"Baxter International Inc.\">BAX</a>) -5.61%</p>\n<p>Becton, Dickinson and Company (<a href=\"https://seekingalpha.com/symbol/BDX\" title=\"Becton, Dickinson and Company\">BDX</a>) -4.81%</p>\n<p>Here are some of the important healthcare stories from this week:</p>\n<p><strong>Novo Nordisk stock tumbles as next-gen obesity shot underperforms Lilly’s tirzepatide</strong></p>\n<p>Novo Nordisk (<a href=\"https://seekingalpha.com/symbol/NVO\" title=\"Novo Nordisk A/S\">NVO</a>) shares <a href=\"https://seekingalpha.com/news/4555038-novo-nordisk-stock-tumbles-as-next-gen-obesity-shot-underperforms-lillys-tirzepatide\">fell over 16%</a> on Monday after the company’s next-generation obesity drug CagriSema delivered less weight loss than Eli Lilly’s (<a href=\"https://seekingalpha.com/symbol/LLY\" title=\"Eli Lilly and Company\">LLY</a>) competing treatment in a phase 3 trial, raising new concerns about its sales potential.</p>\n<p>The REDEFINE 4 trial included 809 randomized people with obesity and one or more comorbidities and with a mean baseline body weight of 114.2 kg. It investigated CagriSema (a fixed-dose combination of cagrilintide 2.4 mg and semaglutide 2.4 mg) compared to tirzepatide 15 mg, both administered once weekly and subcutaneously.</p>\n<p>Patients taking a standard dose of CagriSema lost 20.2% of their body weight after 84 weeks, compared with 23.6% for Lilly’s tirzepatide. “The trial did not achieve its primary endpoint of demonstrating non-inferiority on weight loss for CagriSema compared to tirzepatide after 84 weeks,” Novo <a href=\"https://www.novonordisk.com/news-and-media/news-and-ir-materials/news-details.html?id=916501\" rel=\"noopener\" target=\"_blank\" title=\"said\">said</a>.</p>\n<p>Lilly (<a href=\"https://seekingalpha.com/symbol/LLY\" title=\"Eli Lilly and Company\">LLY</a>) shares rose nearly 4% in U.S. trading following the results.</p>\n<p><strong>Viatris beats on Q4; eyes 10% staff reduction</strong></p>\n<p>Beating Street forecasts with its Q4 2025 financials on Thursday, Viatris (<a href=\"https://seekingalpha.com/symbol/VTRS\" title=\"Viatris Inc.\">VTRS</a>) <a href=\"https://seekingalpha.com/news/4557723-viatris-beats-q4-eyes-10-staff-reduction\">announced</a> plans to reduce roughly 10% of its staff as part of a three-year restructuring initiative that the company expects to <a href=\"https://seekingalpha.com/news/4557675-viatris-non-gaap-eps-of-0_57-beats-by-0_04-revenue-of-3_7b-beats-by-170m#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" rel=\"noopener\" target=\"_blank\">start globally this year.</a></p>\n<p>Announcing results of an enterprise-wide strategic review it undertook last year, the Pennsylvania-based drugmaker said that it intends to record $700M - $850M in pre-tax charges in relation to the reorganization.</p>\n<p>The program is expected to generate $600M - $700M in savings once it is fully implemented, primarily over the next three years, by optimizing its major business functions, including commercial operations, R&amp;D, manufacturing, and sourcing.</p>\n<p>As for Q4 2025, Viatris (<a href=\"https://seekingalpha.com/symbol/VTRS\" title=\"Viatris Inc.\">VTRS</a>) exceeded Street forecasts as its adjusted EPS grew ~6% YoY to $0.57, topping the consensus by $0.04, while revenue jumped ~5% YoY to $3.7B with a $170M topline beat.</p>\n<p><strong>Gilead Sciences to buy Arcellx in deal worth up to $7.8B</strong></p>\n<p>Gilead Sciences (<a href=\"https://seekingalpha.com/symbol/GILD\" title=\"Gilead Sciences, Inc.\">GILD</a>) <a href=\"https://seekingalpha.com/news/4555062-gilead-sciences-to-buy-arcellx-in-deal-worth-up-to-78b\">agreed</a> to acquire biotechnology company Arcellx (<a href=\"https://seekingalpha.com/symbol/ACLX\" title=\"Arcellx, Inc.\">ACLX</a>) for $115 per share in cash at closing and one contingent value right (<a href=\"https://seekingalpha.com/symbol/CVR\" title=\"Chicago Rivet &amp; Machine Co.\">CVR</a>) of $5 per share, which represents an implied equity value of $7.8B payable at closing.</p>\n<p>The transaction was approved by both the Gilead and Arcellx boards of directors and is anticipated to close during the second quarter of 2026.</p>\n<p>Under the merger agreement, a wholly owned Gilead subsidiary will launch a tender offer to buy all Arcellx shares it does not already own for $115 per share in cash, a 68% premium to Arcellx’s 30-day average price as of February 20, 2026. Gilead currently owns around 11.5% of Arcellx’s outstanding common stock.</p>\n<p>Shareholders will also receive one non-transferable CVR per share, which could pay an additional $5 if anito-cel achieves at least $6B in cumulative global net sales from launch through the end of 2029. If the tender offer is completed, Gilead will acquire any remaining Arcellx shares through a second-step merger on the same terms.</p>\n<p>Upon FDA approval of anito-cel, the proposed transaction is expected to be accretive to earnings per share in 2028 and thereafter.</p>\n<p><strong>Hims &amp; Hers Health discloses SEC investigation over copycat GLP-1s</strong></p>\n<p>Hims &amp; Hers Health (<a href=\"https://seekingalpha.com/symbol/HIMS\" title=\"Hims &amp; Hers Health, Inc.\">HIMS</a>) <a href=\"https://seekingalpha.com/news/4555581-hims-hers-health-discloses-sec-investigation-over-copycat-glp-1s-stock-falls\">said</a> in a 10-K <a href=\"https://seekingalpha.com/filing/167737132#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" rel=\"noopener\" target=\"_blank\" title=\" filing \">filing </a>that it received a letter from the staff of the Securities and Exchange Commission’s Division of Enforcement in February notifying the company of an investigation and directing it to preserve documents and information related to its public statements and disclosures about compounded semaglutide and related business relationships.</p>\n<p>The company said it is cooperating with the SEC investigation \"but is unable to predict when or how this matter will be concluded. Therefore, the financial impact of the SEC investigation cannot be predicted at this time.\"</p>\n<p>In the company's post-earnings analyst call, Hims &amp; Hers (<a href=\"https://seekingalpha.com/symbol/HIMS\" title=\"Hims &amp; Hers Health, Inc.\">HIMS</a>) CEO Andrew Dudum addressed the increased scrutiny on compounded GLP-1s and its impact on the business’s bottom line, emphasizing Hims’ other medications, including those for weight loss. “We believe there’s a really durable weight business,” said Dudum, “even if you think you’re kind of in a draconian scenario of compounding GLP-1s not being there.”</p>\n<p><strong>Merck to split human health unit into two divisions</strong></p>\n<p>Merck (<a href=\"https://seekingalpha.com/symbol/MRK\" title=\"Merck &amp; Co., Inc.\">MRK</a>) <a href=\"https://seekingalpha.com/news/4555071-merck-to-split-human-health-unit-into-two-divisions\">announced</a> plans to separate its core pharmaceutical division into two units as it prepares for the upcoming patent expiration of its top-selling drug.</p>\n<p>The drugmaker said it is organizing its Human Health business into an Oncology Business Unit and a Specialty, Pharma &amp; Infectious Diseases Business Unit – a structure that will enable the firm to “sustain long-term leadership in oncology while maintaining a sharp focus in support of a growing number of launches across an increasingly broad and diverse portfolio.”</p>\n<p>Merck's blockbuster immunotherapy Keytruda, which generates nearly half of its total revenue, is scheduled to lose U.S. patent protection in 2028, opening the door to lower-cost generic competition. Merck is relying on its non-cancer division to drive growth and help offset the anticipated decline in Keytruda sales.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558905-notable-healthcare-headlines-for-the-week-viatris-novo-nordisk-and-gilead-sciences-in-focus",
            "pub_date": "2026-03-01 22:06:58",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4559020",
            "title": "Gulf markets slide as U.S.-Iran conflict ripples across region",
            "description": "<html><body><p data-eci=\"true\" data-end=\"252\" data-start=\"76\">Stocks in Saudi Arabia and Egypt declined Sunday, offering an early indication that escalating hostilities between the US and Iran are spilling into regional financial markets.</p>\n<p data-end=\"615\" data-start=\"254\">Saudi Arabia’s Tadawul All Share Index dropped 2.2%, its steepest one-day fall since April, wiping out its gains for the year. Losses were tempered by a 3.4% rise in state oil giant Saudi Aramco, which accounts for roughly 16% of the benchmark. Investors pushed the shares higher on expectations that crude prices will climb when global trading resumes in Asia.</p>\n<p data-end=\"794\" data-start=\"617\">Egypt’s main stock gauge fell 2.5%, deepening a slide that began in mid-February as fears of a broader conflict intensified. The index is now down more than 8% over that period.</p>\n<p data-end=\"1013\" data-start=\"796\">Elsewhere in the Gulf, equities in Oman and Bahrain also retreated, while Kuwait suspended trading as a precaution. Israel’s market was closed Sunday following its recent shift to a Monday-through-Friday trading week.</p>\n<p data-end=\"1225\" data-start=\"1015\">Egypt has been particularly exposed to the latest tensions. The Egyptian pound ranked among the world’s weakest currencies last week and slid to about 48.8 per dollar on Sunday, its lowest level since mid-2025.</p>\n<p data-end=\"1599\" data-start=\"1227\">The country’s economy has already been strained by disruptions tied to the Israel-Hamas war, which have diverted shipping away from the Suez Canal, a key source of hard-currency revenue. Fresh pressure emerged after Israel halted natural gas exports to Egypt following joint US-Israeli strikes on Iran. Tehran responded with attacks across the Gulf and on Israeli targets.</p>\n<p data-end=\"1770\" data-start=\"1601\">Egypt, which had been importing roughly 1 billion cubic feet of Israeli gas per day, is now seeking additional liquefied natural gas cargoes ahead of peak summer demand.</p>\n<p data-end=\"2051\" data-is-last-node=\"\" data-is-only-node=\"\" data-start=\"1772\">The renewed turmoil threatens what had been a tentative recovery in Suez Canal traffic after an October ceasefire in Gaza. French shipping giant CMA CGM said Sunday it had paused transits through the waterway, underscoring the broader economic risks for a region already on edge.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4559020-gulf-markets-slide-as-u-s-iran-conflict-ripples-across-region",
            "pub_date": "2026-03-01 22:06:58",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4559019",
            "title": "Suspicious Iran strike bets raise insider questions on Polymarket",
            "description": "<html><body><p data-eci=\"true\">As U.S. and Israeli airstrikes hit Iran over the weekend, traders on prediction platform Polymarket were collecting payouts. And drawing scrutiny.</p>\n<p>Roughly $529 million changed hands in markets tied to the timing of a potential U.S. strike, Bloomberg News reported late Saturday. Analytics firm Bubblemaps said six newly created accounts made about $1 million combined by betting the U.S. would attack Iran by Feb. 28. The accounts, opened in February, focused solely on strike-related wagers, with some shares reportedly purchased for as little as 10 cents just hours before explosions were reported in Tehran.</p>\n<p>Blockchain analysts say such patterns of new wallets, concentrated bets and well-timed trades can resemble insider activity. But they caution that the evidence is circumstantial. U.S. officials had signaled possible military action for weeks, fueling heavy speculation. A Feb. 28 strike contract alone drew about $90 million in trading volume, far more than other dates.</p>\n<p>Not every bettor profited. One of the flagged accounts had previously lost money wagering on an earlier strike before placing a larger bet that ultimately paid off.</p>\n<p>The episode underscores the murky oversight surrounding prediction markets, where traders can participate with little more than a crypto wallet. Polymarket, which operates offshore and bars U.S. users, didn’t respond to requests for comment by Bloomberg News. The company has said its markets aggregate public information and help gauge risk during fast-moving events.</p>\n<p>Other Iran-related contracts have also sparked debate, including one tied to whether Supreme Leader Ali Khamenei would be out of power by the end of March. Critics note that the market’s terms do not exclude death as a qualifying outcome, raising ethical concerns.</p>\n<p>Regulated rival Kalshi, overseen by the Commodity Futures Trading Commission, said it doesn’t offer contracts that settle on death and has taken enforcement actions against users suspected of trading on nonpublic information.</p>\n<p>Whether the latest Iran bets reflect privileged knowledge or simply aggressive speculation remains unclear, a question blockchain data alone cannot resolve.</p>\n<p><strong><span>Dear Readers:</span></strong><span> We recognize that politics often intersects with the financial news of the day, so we invite you to click </span><a href=\"https://seekingalpha.com/article/4867597-politics-and-the-markets-030126#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" rel=\"noopener\" target=\"_blank\" title=\"here\"><span>here</span></a><span> to join the separate political discussion.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4559019-suspicious-iran-strike-bets-raise-insider-questions-on-polymarket",
            "pub_date": "2026-03-01 22:01:39",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4559018",
            "title": "Gulf air travel grinds to a halt as Iranian retaliation disrupts major hubs",
            "description": "<html><body><p data-eci=\"true\">Air travel across the Persian Gulf remained largely frozen for a second straight day as Iran’s retaliatory strikes rippled through the region, forcing leading carriers to prolong flight suspensions and stranding tens of thousands of passengers, according to several media reports.</p>\n<p>Emirates, the world’s biggest long-haul international airline, said its operations were suspended until further notice. Etihad Airways pushed its cancellations through 2 a.m. Monday, and Qatar Airways confirmed that its flights remained grounded, with an update expected later Monday morning.</p>\n<p>The United Arab Emirates’ civil aviation authority said it had assisted more than 20,000 travelers caught in the disruption. The Gulf’s aviation system, which typically connects distant cities with a single stopover, has effectively stalled, leaving large numbers of passengers unable to continue their journeys.</p>\n<p>Airports across the region reported damage after Iran launched missiles and drones following weekend strikes by Israeli and U.S. forces. In Abu Dhabi, authorities said one person was killed and several others injured after air defenses intercepted a drone overnight. Dubai International Airport, the busiest hub for international travel, reported damage to part of a concourse that left four employees hurt.</p>\n<p>Bahrain’s main airport sustained damage from a drone strike, while Kuwait’s airport was also hit, with several workers treated for minor injuries.</p>\n<p>While Middle Eastern airspace has faced intermittent restrictions in recent years, aviation analysts say a sweeping, multi-hour shutdown of this magnitude is without precedent. The halt underscores the broader risks stemming from escalating tensions between Iran, Israel and the United States, and the vulnerability of critical infrastructure in the energy-rich Gulf.</p>\n<p>The suspension has scrambled aircraft rotations and crew assignments worldwide. With planes and flight crews out of position, industry experts expect it could take days to restore schedules even after airspace reopens.</p>\n<p>The impact has extended well beyond the Gulf. India’s aviation regulator said domestic airlines canceled more than 400 flights on Saturday, with a similar number expected to be scrapped Sunday. Carriers in Europe, Canada and Asia, including Singapore, have also paused service to parts of the Middle East.</p>\n<p>Over the past two decades, Emirates, Qatar Airways and Etihad have transformed the Gulf into a central crossroads for global aviation, using expansive fleets and strategically located hubs to channel traffic between continents. That model, which turned the region into one of the world’s most important transit corridors, now faces one of its most severe operational tests.</p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4559018-gulf-air-travel-grinds-to-a-halt-as-iranian-retaliation-disrupts-major-hubs",
            "pub_date": "2026-03-01 21:47:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4559017",
            "title": "Prediction markets indicate oil pop Monday, 20% rise this month",
            "description": "<html><body><p data-eci=\"true\">Betting on prediction markets indicates a strong rally in oil prices this month following attacks on Iran by the U.S. and Israel.</p>\n<p>Polymarket has a 93% chance of WTI crude (<a href=\"https://seekingalpha.com/symbol/CL1:COM\" title=\"Crude Oil Futures\">CL1:COM</a>) (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/USO\" title=\"United States Oil Fund LP ETF\">USO</a></span>) moving higher on Monday, unsurprisingly, and a 77% chance oil will be above $80/barrel at the end of March. That's up 27 percentage points from before the weekend and would be a gain of more than 19% from where it sits now at $67.02.</p>\n<p>There's also a 50% chance that crude is above $90/barrel on the final trading day of the month.</p>\n<p>Iran is OPEC's third-largest crude oil producer, at around 3.35M barrels per day, right behind Iraq.</p>\n<p>Oil ETFs: (<a href=\"https://seekingalpha.com/symbol/BNO\" title=\"United States Brent Oil Fund LP ETF\">BNO</a>), (<a href=\"https://seekingalpha.com/symbol/UCO\" title=\"ProShares Ultra Bloomberg Crude Oil ETF\">UCO</a>), (<a href=\"https://seekingalpha.com/symbol/DBO\" title=\"Invesco DB Oil Fund ETF\">DBO</a>), (<a href=\"https://seekingalpha.com/symbol/OILK\" title=\"ProShares K-1 Free Crude Oil ETF\">OILK</a>), (<a href=\"https://seekingalpha.com/symbol/USL\" title=\"United States 12 Month Oil Fund LP ETF\">USL</a>)</p>\n<p><strong><span>Dear readers:</span></strong><span> We recognize that politics often intersects with the financial news of the day, so we invite you to click </span><a href=\"https://seekingalpha.com/article/4867597-politics-and-the-markets-030126#hasComeFromMpArticle=false\" rel=\"noopener\" target=\"_blank\" title=\"here\"><span>here</span></a><span> to join the separate political discussion.</span><span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4559017-prediction-markets-indicate-oil-pop-monday-20-percent-rise-this-month",
            "pub_date": "2026-03-01 21:36:02",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558669",
            "title": "Earnings week ahead: AVGO, CRWD, PLUG, COST, TGT, MRVL, JD, KR, and more",
            "description": "<html><body><p data-eci=\"true\">The first full week of March delivers another heavy slate of earnings, spanning AI infrastructure, cybersecurity, retail, energy, travel, and speculative growth themes.</p>\n<p>From semiconductor leaders to consumer discretionary names and commodity-sensitive producers, the lineup should offer investors a broad read on enterprise tech spending, household demand, capital discipline, and risk appetite as Q1 unfolds.</p>\n<p>AI and semiconductor momentum will be front and center with updates from Broadcom (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/AVGO\" title=\"Broadcom Inc.\">AVGO</a></span></span>), Marvell Technology (<a href=\"https://seekingalpha.com/symbol/MRVL\" title=\"Marvell Technology, Inc.\">MRVL</a>), Credo Technology Group (<a href=\"https://seekingalpha.com/symbol/CRDO\" title=\"Credo Technology Group Holding Ltd\">CRDO</a>), MongoDB (<a href=\"https://seekingalpha.com/symbol/MDB\" title=\"MongoDB, Inc.\">MDB</a>), Veeva Systems (<a href=\"https://seekingalpha.com/symbol/VEEV\" title=\"Veeva Systems Inc.\">VEEV</a>), Okta (<a href=\"https://seekingalpha.com/symbol/OKTA\" title=\"Okta, Inc.\">OKTA</a>), and CrowdStrike (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CRWD\" title=\"CrowdStrike Holdings, Inc.\">CRWD</a></span></span>), alongside quantum-focused names such as Rigetti Computing (<a href=\"https://seekingalpha.com/symbol/RGTI\" title=\"Rigetti Computing, Inc.\">RGTI</a>) and Quantum Computing (<a href=\"https://seekingalpha.com/symbol/QUBT\" title=\"Quantum Computing Inc.\">QUBT</a>).</p>\n<p>Retail and consumer trends will be tested through results from Costco Wholesale (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/COST\" title=\"Costco Wholesale Corporation\">COST</a></span></span>), Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>), Best Buy (<a href=\"https://seekingalpha.com/symbol/BBY\" title=\"Best Buy Co., Inc.\">BBY</a>), Kroger (<a href=\"https://seekingalpha.com/symbol/KR\" title=\"The Kroger Co.\">KR</a>), Abercrombie &amp; Fitch (<a href=\"https://seekingalpha.com/symbol/ANF\" title=\"Abercrombie &amp; Fitch Co.\">ANF</a>), JD.com (<a href=\"https://seekingalpha.com/symbol/JD\" title=\"JD.com, Inc.\">JD</a>), Sea Limited (<a href=\"https://seekingalpha.com/symbol/SE\" title=\"Sea Limited\">SE</a>), StoneCo (<a href=\"https://seekingalpha.com/symbol/STNE\" title=\"StoneCo Ltd.\">STNE</a>), GoPro (<a href=\"https://seekingalpha.com/symbol/GPRO\" title=\"GoPro, Inc.\">GPRO</a>), and cruise operator Norwegian Cruise Line Holdings (<a href=\"https://seekingalpha.com/symbol/NCLH\" title=\"Norwegian Cruise Line Holdings Ltd.\">NCLH</a>).</p>\n<p>Energy, materials, and industrial updates from Petrobras (<a href=\"https://seekingalpha.com/symbol/PBR\" title=\"Petróleo Brasileiro S.A. - Petrobras\">PBR</a>), Canadian Natural Resources (<a href=\"https://seekingalpha.com/symbol/CNQ\" title=\"Canadian Natural Resources Limited\">CNQ</a>), Sociedad Química y Minera de Chile (<a href=\"https://seekingalpha.com/symbol/SQM\" title=\"Sociedad Química y Minera de Chile S.A.\">SQM</a>), Plug Power (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/PLUG\" title=\"Plug Power Inc.\">PLUG</a></span></span>), ChargePoint Holdings (<a href=\"https://seekingalpha.com/symbol/CHPT\" title=\"ChargePoint Holdings, Inc.\">CHPT</a>), Gevo (<a href=\"https://seekingalpha.com/symbol/GEVO\" title=\"Gevo, Inc.\">GEVO</a>), Global Ship Lease (<a href=\"https://seekingalpha.com/symbol/GSL\" title=\"Global Ship Lease, Inc.\">GSL</a>), and Stratasys (<a href=\"https://seekingalpha.com/symbol/SSYS\" title=\"Stratasys Ltd.\">SSYS</a>) will provide signals on commodity pricing, clean energy investment, and capital spending trends.</p>\n<p>High-growth and speculative technology names, including Archer Aviation (<a href=\"https://seekingalpha.com/symbol/ACHR\" title=\"Archer Aviation Inc.\">ACHR</a>), AST SpaceMobile (<a href=\"https://seekingalpha.com/symbol/ASTS\" title=\"AST SpaceMobile, Inc.\">ASTS</a>), Riot Platforms (<a href=\"https://seekingalpha.com/symbol/RIOT\" title=\"Riot Platforms, Inc.\">RIOT</a>), Ouster (<a href=\"https://seekingalpha.com/symbol/OUST\" title=\"Ouster, Inc.\">OUST</a>), and Ocugen (<a href=\"https://seekingalpha.com/symbol/OCGN\" title=\"Ocugen, Inc.\">OCGN</a>), round out a week that should offer a wide-angle view on AI infrastructure demand, consumer resilience, commodity exposure, and broader market risk sentiment heading deeper into March.</p>\n<p>Below is a rundown of major quarterly updates anticipated in the week of March 2 to March 6:</p>\n<h2>Monday, March 2</h2>\n<h3>Plug Power (<a href=\"https://seekingalpha.com/symbol/PLUG\" title=\"Plug Power Inc.\">PLUG</a>)</h3>\n<p>Plug Power (<a href=\"https://seekingalpha.com/symbol/PLUG\" title=\"Plug Power Inc.\">PLUG</a>) is set to report Q4 earnings on Monday after market close, with analysts projecting roughly a 93% Y/Y improvement in profits on about 14% revenue growth.</p>\n<p>The company recently <a href=\"https://seekingalpha.com/news/4558184-plug-power-to-sell-project-gateway-site-in-new-york-in-132m-deal\">entered</a> an agreement with Stream Data Centers as part of a broader initiative aimed at generating more than $275M in liquidity improvements. Under the deal, Plug expects to receive at least $132.5M from the sale of its interest in the Project Gateway site in New York, including land, infrastructure, and related assets, allowing it to unlock value while sharpening its focus on hydrogen production and fuel cell deployment. Two additional initiatives are anticipated in 2026 to complete the targeted liquidity boost.</p>\n<p>Shares are up approximately 14% over the past year, though sentiment remains cautious, with Seeking Alpha’s Quant Rating at <a href=\"https://seekingalpha.com/symbol/PLUG/ratings/quant-ratings#source=firstLevelUrl%3Asymbol%7CbiSectionAsset%3ARatingSummary%7CbiName%3AQuant_rating\">Hold</a>, broadly in line with sell-side views.</p>\n<p>SA contributor The Alpha Analyst <a href=\"https://seekingalpha.com/article/4853784-plug-power-has-bought-time-not-conviction\">notes</a> the company is shifting from “financing survival” toward improving margins and cash flow, highlighting a more than 50% sequential drop in operating cash burn in Q3 2025 to around $90M. Liquidity has improved following an equity raise and expected monetization of electricity rights, potentially extending the runway up to two years. While the electrolyzer segment is showing 30%–40% incremental contribution margins, the current scale remains insufficient to offset overall losses, keeping profitability and execution firmly in focus.</p>\n<ul type=\"disc\">\n<li>Consensus EPS Estimates: -$0.10</li>\n<li>Consensus Revenue Estimates: $217.38M</li>\n<li>Earnings Insight: Plug Power has missed EPS estimates in 8 consecutive reports, exceeding revenue forecasts in just 3 of those quarters.</li>\n</ul>\n<p><strong>Also reporting</strong>: Plug Power (<a href=\"https://seekingalpha.com/symbol/PLUG\" title=\"Plug Power Inc.\">PLUG</a>), Riot Platforms (<a href=\"https://seekingalpha.com/symbol/RIOT\" title=\"Riot Platforms, Inc.\">RIOT</a>), Norwegian Cruise Line Holdings (<a href=\"https://seekingalpha.com/symbol/NCLH\" title=\"Norwegian Cruise Line Holdings Ltd.\">NCLH</a>), MongoDB (<a href=\"https://seekingalpha.com/symbol/MDB\" title=\"MongoDB, Inc.\">MDB</a>), Uniti Group (<a href=\"https://seekingalpha.com/symbol/UNIT\" title=\"Uniti Group Inc.\">UNIT</a>), StoneCo (<a href=\"https://seekingalpha.com/symbol/STNE\" title=\"StoneCo Ltd.\">STNE</a>), Senseonics Holdings (<a href=\"https://seekingalpha.com/symbol/SENS\" title=\"Senseonics Holdings, Inc.\">SENS</a>), Asana (<a href=\"https://seekingalpha.com/symbol/ASAN\" title=\"Asana, Inc.\">ASAN</a>), Sturm Ruger &amp; Company (<a href=\"https://seekingalpha.com/symbol/RGR\" title=\"Sturm, Ruger &amp; Company, Inc.\">RGR</a>), AST SpaceMobile (<a href=\"https://seekingalpha.com/symbol/ASTS\" title=\"AST SpaceMobile, Inc.\">ASTS</a>), and more.</p>\n<h2>Tuesday, March 3</h2>\n<h3>CrowdStrike (<a href=\"https://seekingalpha.com/symbol/CRWD\" title=\"CrowdStrike Holdings, Inc.\">CRWD</a>)</h3>\n<p>Austin-based cybersecurity company CrowdStrike (<a href=\"https://seekingalpha.com/symbol/CRWD\" title=\"CrowdStrike Holdings, Inc.\">CRWD</a>) is due to post its Q4 financial update after the bell on Tuesday, with investor focus squarely on growth durability and valuation. </p>\n<p>The company recently expanded its partnership with Microsoft ((MSFT)), enabling organizations to purchase CrowdStrike’s Falcon platform through the Microsoft Marketplace using existing Azure consumption commitments - a move that broadens distribution and deepens enterprise integration.</p>\n<p>Channel checks from Oppenheimer <a href=\"https://seekingalpha.com/news/4552513-crowdstrike-reigns-among-security-vendors-as-palo-alto-sentinelone-improve-oppenheimer\">suggest</a> CrowdStrike continues to stand out, with strong partner sentiment and positive revisions to 2026 expectations. Analysts noted ongoing share gains in core endpoint security, displacement of legacy vendors, resilience against next-gen competitors, and successful cross-selling of new modules.</p>\n<p>While sell-side firms maintain a Buy rating, Seeking Alpha’s Quant system remains at <a href=\"https://seekingalpha.com/symbol/CRWD/ratings/quant-ratings#source=firstLevelUrl%3Asymbol%7CbiSectionAsset%3ARatingSummary%7CbiName%3AQuant_rating\">Hold</a> due to valuation concerns.</p>\n<p>Among contributors, JR Research recently <a href=\"https://seekingalpha.com/article/4873854-crowdstrike-gets-mistakenly-thrown-into-the-ai-flames-time-to-buy-upgrade\">upgraded</a> the stock to Buy, arguing the recent selloff was overdone given Falcon’s strong adoption, expanding ARR, and strategic cloud partnerships.</p>\n<p>In contrast, Stone Fox Capital maintains a <a href=\"https://seekingalpha.com/article/4869931-crowdstrike-dead-money-drag\">Strong Sell</a>, contending the stock remains overvalued at roughly 17.5x forward sales as growth slows, with AI-native competition posing longer-term risks and the potential for prolonged multiple compression.</p>\n<ul type=\"disc\">\n<li>Consensus EPS Estimates: $1.10</li>\n<li>Consensus Revenue Estimates: $1.30B</li>\n<li>Earnings Insight: The company has exceeded EPS expectations in 8 consecutive quarters, missing revenue estimates in just one quarter.</li>\n</ul>\n<p><strong>Also reporting</strong>: Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>), Sea Limited (<a href=\"https://seekingalpha.com/symbol/SE\" title=\"Sea Limited\">SE</a>), Best Buy Co. (<a href=\"https://seekingalpha.com/symbol/BBY\" title=\"Best Buy Co., Inc.\">BBY</a>), Paysafe Group Holdings Limited (<a href=\"https://seekingalpha.com/symbol/PSFE\" title=\"Paysafe Limited\">PSFE</a>), Ross Stores (<a href=\"https://seekingalpha.com/symbol/ROST\" title=\"Ross Stores, Inc.\">ROST</a>), B&amp;G Foods (<a href=\"https://seekingalpha.com/symbol/BGS\" title=\"B&amp;G Foods, Inc.\">BGS</a>), Box (<a href=\"https://seekingalpha.com/symbol/BOX\" title=\"Box, Inc.\">BOX</a>), AutoZone (<a href=\"https://seekingalpha.com/symbol/AZO\" title=\"AutoZone, Inc.\">AZO</a>), EVgo (<a href=\"https://seekingalpha.com/symbol/EVGO\" title=\"EVgo, Inc.\">EVGO</a>), THOR Industries (<a href=\"https://seekingalpha.com/symbol/THO\" title=\"THOR Industries, Inc.\">THO</a>), Kontoor Brands (<a href=\"https://seekingalpha.com/symbol/KTB\" title=\"Kontoor Brands, Inc.\">KTB</a>), Horizon Technology Finance (<a href=\"https://seekingalpha.com/symbol/HRZN\" title=\"Horizon Technology Finance\">HRZN</a>), and more.</p>\n<h2>Wednesday, March 4</h2>\n<h3>Broadcom (<a href=\"https://seekingalpha.com/symbol/AVGO\" title=\"Broadcom Inc.\">AVGO</a>)</h3>\n<p>Broadcom (<a href=\"https://seekingalpha.com/symbol/AVGO\" title=\"Broadcom Inc.\">AVGO</a>) is set to report FQ1 results after Wednesday’s close, with analysts expecting revenue and earnings to rise more than 25% Y/Y.</p>\n<p>The company has also <a href=\"https://seekingalpha.com/news/4557847-broadcom-aims-to-sell-1m-3d-stacked-chips-by-2027\">signaled longer-term AI momentum</a>, indicating it expects to sell at least 1 million chips by 2027, leveraging its stacked design technology.</p>\n<p>Shares have climbed more than 50% over the past year. Wall Street maintains a Strong Buy consensus, while Seeking Alpha’s Quant Rating stands at <a href=\"https://seekingalpha.com/symbol/AVGO/ratings/quant-ratings#source=firstLevelUrl%3Asymbol%7CbiSectionAsset%3ARatingSummary%7CbiName%3AQuant_rating\">Hold</a>.</p>\n<p>SA contributor Deep Value Investing recently <a href=\"https://seekingalpha.com/article/4874969-broadcom-q1-preview-tech-rotation-could-trigger-another-irrational-selloff\">downgraded</a> the stock ahead of the print, citing fragile tech sentiment and potential margin risk. He flagged concern around management’s guided 67% adjusted EBITDA margin for Q1, particularly given rising memory prices, and questioned whether the full-cost impact was reflected in guidance. While non-AI semiconductor revenue appears flat and near-term margin pressure is a watchpoint, he believes the AI growth thesis remains intact over a 12–18 month horizon, supported by strong backlog trends and multiple XPU customers.</p>\n<p>On the other hand, SA Investing Group Leader Envision Research <a href=\"https://seekingalpha.com/article/4874089-broadcom-covered-put-option-is-the-play-for-fq1-2026-earnings\">sees an attractive setup for put sellers</a>, noting declining put-call ratios and elevated implied volatility ahead of earnings. In this view, concerns about AI’s impact on Broadcom’s software business are overstated, with both hardware and software positioned for resilience. Elevated volatility could allow investors to establish positions at roughly 30x earnings with a PEG ratio near 1x.</p>\n<ul type=\"disc\">\n<li>Consensus EPS Estimates: $2.02</li>\n<li>Consensus Revenue Estimates: $19.11B</li>\n<li>Earnings Insight: Broadcom has beaten EPS estimates in 8 consecutive quarters, missing revenue expectations just once in that period.</li>\n</ul>\n<p><strong>Also reporting</strong>: Broadcom (<a href=\"https://seekingalpha.com/symbol/AVGO\" title=\"Broadcom Inc.\">AVGO</a>), ChargePoint Holdings (<a href=\"https://seekingalpha.com/symbol/CHPT\" title=\"ChargePoint Holdings, Inc.\">CHPT</a>), Okta (<a href=\"https://seekingalpha.com/symbol/OKTA\" title=\"Okta, Inc.\">OKTA</a>), Veeva Systems (<a href=\"https://seekingalpha.com/symbol/VEEV\" title=\"Veeva Systems Inc.\">VEEV</a>), Ocugen (<a href=\"https://seekingalpha.com/symbol/OCGN\" title=\"Ocugen, Inc.\">OCGN</a>), Stem (<a href=\"https://seekingalpha.com/symbol/STEM\" title=\"Stem, Inc.\">STEM</a>), Vermilion Energy (<a href=\"https://seekingalpha.com/symbol/VET\" title=\"Vermilion Energy Inc.\">VET</a>), Wix.com (<a href=\"https://seekingalpha.com/symbol/WIX\" title=\"Wix.com Ltd.\">WIX</a>), Bath &amp; Body Works (<a href=\"https://seekingalpha.com/symbol/BBWI\" title=\"Bath &amp; Body Works, Inc.\">BBWI</a>), TriplePoint Venture Growth BDC (<a href=\"https://seekingalpha.com/symbol/TPVG\" title=\"TriplePoint Venture Growth BDC Corp.\">TPVG</a>), American Eagle Outfitters (<a href=\"https://seekingalpha.com/symbol/AEO\" title=\"American Eagle Outfitters, Inc.\">AEO</a>), Verastem (<a href=\"https://seekingalpha.com/symbol/VSTM\" title=\"Verastem, Inc.\">VSTM</a>), Abercrombie &amp; Fitch (<a href=\"https://seekingalpha.com/symbol/ANF\" title=\"Abercrombie &amp; Fitch Co.\">ANF</a>), and more.</p>\n<h2>Thursday, March 5</h2>\n<h3>Costco Wholesale (<a href=\"https://seekingalpha.com/symbol/COST\" title=\"Costco Wholesale Corporation\">COST</a>)</h3>\n<p>Costco Wholesale Corporation (<a href=\"https://seekingalpha.com/symbol/COST\" title=\"Costco Wholesale Corporation\">COST</a>) reports FQ2 results Thursday after the close, with analysts expecting steady Y/Y revenue and profit growth driven by resilient traffic and strong membership trends.</p>\n<p>For the month of January, <a href=\"https://seekingalpha.com/news/4547408-costco-outpaces-broad-retail-sales-in-january-as-its-digital-business-shines\">comps rose 7.1%</a> (U.S. +5.8%, Canada +11.4%, International +9.5%), while e-commerce surged 34.4% and total sales climbed 9.3% to $19.5B.</p>\n<p>Bank of America <a href=\"https://seekingalpha.com/news/4558639-costco-is-called-a-k-shaped-economy-winner-by-bofa\">reinstated coverage</a> with a Buy rating, highlighting Costco’s appeal to higher-income consumers in a K-shaped economy and 9–10% growth in Executive memberships, which now account for more than half of operating income. BofA believes reinvestment in price and wages supports durable market share gains and justifies its premium multiple.</p>\n<p>Wall Street broadly rates the stock a Buy, though Seeking Alpha’s Quant system remains at <a href=\"https://seekingalpha.com/symbol/COST/ratings/quant-ratings#source=firstLevelUrl%3Asymbol%7CbiSectionAsset%3ARatingSummary%7CbiName%3AQuant_rating\">Hold</a> on valuation.</p>\n<p>SA contributor Amrita Roy <a href=\"https://seekingalpha.com/article/4875047-costcos-2x-pe-over-amazon-is-not-irrational-rating-upgrade\">upgraded to Buy</a>, citing defensive rotation, international expansion, digital acceleration, and stable cash flows that warrant the ~48x FY26 P/E.</p>\n<p>Conversely, Juxtaposed Ideas <a href=\"https://seekingalpha.com/article/4874371-costco-macrotariff-risks-persist-further-consolidation-likely\">maintains a Hold</a>, pointing to stretched valuations, tariff risks, potential margin pressure into FQ3, and a limited margin of safety unless shares revisit prior trading floors.</p>\n<ul type=\"disc\">\n<li>Consensus EPS Estimates: $4.53</li>\n<li>Consensus Revenue Estimates: $69.29B</li>\n<li>Earnings Insight: Costco has exceeded EPS expectations in 7 of the past 8 quarters, missing revenue estimates twice in that span.</li>\n</ul>\n<p><strong>Also reporting</strong>: JD.com (<a href=\"https://seekingalpha.com/symbol/JD\" title=\"JD.com, Inc.\">JD</a>), Marvell Technology (<a href=\"https://seekingalpha.com/symbol/MRVL\" title=\"Marvell Technology, Inc.\">MRVL</a>), Kroger (<a href=\"https://seekingalpha.com/symbol/KR\" title=\"The Kroger Co.\">KR</a>), Petroleo Brasileiro SA Petrobras (<a href=\"https://seekingalpha.com/symbol/PBR\" title=\"Petróleo Brasileiro S.A. - Petrobras\">PBR</a>), Stratasys (<a href=\"https://seekingalpha.com/symbol/SSYS\" title=\"Stratasys Ltd.\">SSYS</a>), GoPro (<a href=\"https://seekingalpha.com/symbol/GPRO\" title=\"GoPro, Inc.\">GPRO</a>), Gevo (<a href=\"https://seekingalpha.com/symbol/GEVO\" title=\"Gevo, Inc.\">GEVO</a>), Bilibili (<a href=\"https://seekingalpha.com/symbol/BILI\" title=\"Bilibili Inc.\">BILI</a>), Victoria's Secret (<a href=\"https://seekingalpha.com/symbol/VSCO\" title=\"Victoria's Secret &amp; Co.\">VSCO</a>), Ciena (<a href=\"https://seekingalpha.com/symbol/CIEN\" title=\"Ciena Corporation\">CIEN</a>), Global Ship Lease (<a href=\"https://seekingalpha.com/symbol/GSL\" title=\"Global Ship Lease, Inc.\">GSL</a>), Altimmune (<a href=\"https://seekingalpha.com/symbol/ALT\" title=\"Altimmune, Inc.\">ALT</a>), and more.</p>\n<h2>Friday, March 6</h2>\n<p>The week wraps up on a lighter note, with only a handful of earnings scheduled for Friday's pre-market session. Notable names include Algonquin Power &amp; Utilities (<a href=\"https://seekingalpha.com/symbol/AQN\" title=\"Algonquin Power &amp; Utilities Corp.\">AQN</a>), Drilling Tools International (<a href=\"https://seekingalpha.com/symbol/DTI\" title=\"Drilling Tools International Corporation\">DTI</a>), EMBRAER AIR-ADR (<a href=\"https://seekingalpha.com/symbol/EMBJ\" title=\"Embraer S.A.\">EMBJ</a>), Genesco (<a href=\"https://seekingalpha.com/symbol/GCO\" title=\"Genesco Inc.\">GCO</a>), Kingstone Companies (<a href=\"https://seekingalpha.com/symbol/KINS\" title=\"Kingstone Companies, Inc.\">KINS</a>), Newlake Capital Partners (<a href=\"https://seekingalpha.com/symbol/NLCP\" title=\"NewLake Capital Partners, Inc.\">NLCP</a>), TEN (<a href=\"https://seekingalpha.com/symbol/TEN\" title=\"Tsakos Energy Navigation Limited\">TEN</a>), Mammoth Energy Services (<a href=\"https://seekingalpha.com/symbol/TUSK\" title=\"Mammoth Energy Services, Inc.\">TUSK</a>), and more.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558669-earnings-week-ahead-avgo-crwd-plug-cost-tgt-mrvl-jd-kr-and-more",
            "pub_date": "2026-03-01 21:15:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4559016",
            "title": "Iran vows revenge, Trump warns it 'better not'",
            "description": "<html><body><p data-eci=\"true\">In the wake of attacks, Iran's Revolutionary Guard said Sunday \"the most-intense offensive operation\" ever is coming to target Israel and  U.S. Mideast bases.</p>\n<p>President Donald Trump responded in a post: </p>\n<p>\"Iran just stated that they are going to hit very hard today, harder than they have ever hit before. THEY BETTER NOT DO THAT, HOWEVER, BECAUSE IF THEY DO, WE WILL HIT THEM WITH A FORCE THAT HAS NEVER BEEN SEEN BEFORE!\"</p>\n<p>Earlier in the day a massive explosion struck Iran's capital, Tehran, as the Israeli military said it is targeting the \"heart\" of the city.</p>\n<p><strong><span>Dear readers: </span></strong><span>We recognize that politics often intersects with the financial news of the day, so we invite you to </span><a href=\"https://seekingalpha.com/article/4867597-politics-and-the-markets-030126\" rel=\"noopener\" target=\"_blank\" title=\"click here\"><span>click here</span></a><span> to join the separate political discussion.</span><span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4559016-iran-vows-revenge-trump-warns-it-better-not",
            "pub_date": "2026-03-01 19:41:36",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558978",
            "title": "Iran confirms supreme leader Khamenei is dead after US, Israeli attacks",
            "description": "<html><body><p data-eci=\"true\">Iran's supreme leader has been killed in Israeli and US strikes, Iranian state media said. Iranian state media reported that Khamenei \"was carrying out his assigned duties and was present at his workplace (his office). \"This cowardly attack occurred in the early hours of Saturday morning,\" state media said. Iran has announced 40 days of mourning following Khamenei’s death.</p>\n<p>Earlier, President Trump posted that \"Khamenei, one of the most evil people in History, is dead. Trump, further added in a post on TRUTH SOCIAL that bombing would continue “uninterrupted throughout the week or, as long as necessary to achieve our objective of PEACE THROUGHOUT THE MIDDLE EAST AND, INDEED, THE WORLD!”</p>\n<p>The United States and Israel launched a massive attack on Iran overnight Saturday, killing what Iranian media said was more than 200 people. </p>\n<p><strong><span>Dear readers: </span></strong><span>We recognize that politics often intersects with the financial news of the day, so we invite you to </span><span></span><a href=\"https://seekingalpha.com/article/4867596-politics-and-the-markets-022826#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" rel=\"noopener\" target=\"_blank\" title=\"click here\">click here</a><span> to join the separate political discussion.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558978-iran-confirms-supreme-leader-khamenei-is-dead-after-us-israeli-attacks",
            "pub_date": "2026-03-01 10:55:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558943",
            "title": "Data center construction declines for first time since 2020 on permitting, power delays",
            "description": "<html><body><p data-eci=\"true\"><span>Demand for artificial intelligence computing capacity continues to climb, but data center capacity under construction in primary U.S. markets was down at the end of last year for the first time since 2020, according to a <a href=\"https://www.credaily.com/briefs/data-center-construction-declines-in-major-us-markets/\" rel=\"nofollow\" target=\"_self\" title=\"new report\">new report</a> this week by CBRE Group (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CBRE\" title=\"CBRE Group, Inc.\">CBRE</a></span>).</span></p>\n<p><span>Capacity under construction fell to 5.99 GW at the end of 2025 from 6.35 GW at the end of 2024, the report said, as developers face mounting delays in permitting, zoning, and power procurement, as well as rising costs for construction, land, labor, and equipment.</span></p>\n<p><span>The delays and <span>faster long-distance networks are driving development to move outside traditional data center sites such as northern Virginia, CBRE </span>said in the report, which added that the overall vacancy rate in primary markets fell to a record low 1.4% at year-end 2025.</span></p>\n<p><span>Construction underway fell 29% Y/Y in northern Virginia, followed by a 15% decline in Hillsboro, Oregon, and a 14% slide in California's Silicon Valley; on the flip side, projects soared 169% in Chicago and 15% in Dallas-Fort Worth.</span></p>\n<p><span>Meanwhile, <span>AI demand is forecast to require more than </span>$3T<span> in data center investment, including related power supplies, according to estimates from Morgan Stanley and Moody's.</span></span></p>\n<p><span>Local pushback against massive AI data center projects has intensified in recent months, and President </span><span>Trump sought in his State of the Union address this week to calm a growing public backlash against AI data centers by proposing to require that companies build their own power plants.</span></p>\n<p><span>ETFs: (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/XLU\" title=\"State Street Utilities Select Sector SPDR ETF\">XLU</a></span>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DTCR\" title=\"Global X Data Center &amp; Digital Infrastructure ETF\">DTCR</a></span>), (<a href=\"https://seekingalpha.com/symbol/IDGT\" title=\"iShares US Digital Infra &amp; Real Estate ETF\">IDGT</a>), (<a href=\"https://seekingalpha.com/symbol/TRFK\" title=\"Pacer Data and Digital Revolution ETF\">TRFK</a>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/VOLT\" title=\"Tema Electrification ETF\">VOLT</a></span>)</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558943-data-center-construction-declines-for-first-time-since-2020-on-permitting-power-delays",
            "pub_date": "2026-03-01 09:36:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}