{
    "data": [
        {
            "id": "4558026",
            "title": "Merck wins FDA approval of Numelvi for itching in dogs",
            "description": "<html><body><ul>\n<li>The US FDA has approved Merck (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MRK\" title=\"Merck &amp; Co., Inc.\">MRK</a></span></span>) Animal Health's JAK inhibitor Numelvi (<span>atinvicitinib) </span>for controlling <span>pruritus (itching) related to allergic dermatitis in dogs.</span>\n</li>\n<li><span>The company <a href=\"https://seekingalpha.com/pr/20414342-fda-approves-numelvi-atinvicitinib-tablets-for-dogs-from-merck-animal-health-the-first-and\" target=\"_self\" title=\"said\">said</a> Numelvi is the first <span>second-generation JAK inhibitor approved for the indication.</span></span></li>\n<li><span><span>Numelvi will be available starting in the spring. </span></span></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558026-merck-wins-fda-approval-numelvi-itching-in-dogs",
            "pub_date": "2026-02-27 03:05:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558076",
            "title": "Nuveen Churchill Direct Lending slashes dividend by 20% to $0.36, $0.04 supplemental dividend, $50M buybacks",
            "description": "<html><body><ul>\n<li>Nuveen Churchill Direct Lending (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NCDL\" title=\"Nuveen Churchill Direct Lending Corp.\">NCDL</a></span>) declares <a href=\"https://seekingalpha.com/pr/20415059-nuveen-churchill-direct-lending-corp-announces-fourth-quarter-2025-results\" target=\"_blank\">$0.36/share quarterly dividend</a>, <span>-20% decrease</span> from prior dividend of $0.45.</li>\n<li class=\"remove-link-for-mobile\">\n<a href=\"https://seekingalpha.com/symbol/NCDL/dividends/yield?source=news_bullet\" target=\"_blank\">Forward yield</a> 10.55%</li>\n<li>Payable March 31; for shareholders of record March 17; ex-div March 17.</li>\n<li><span>“We have reset our regular quarterly distribution to a level that considers the current interest rate and spread environment. In conjunction with the reset of our dividend, we are announcing a new $50 million share repurchase program, which demonstrates our confidence in the overall strength of our portfolio,” said Shai Vichness, Chief Financial Officer and Treasurer of NCDL.</span></li>\n<li><span>Additionally, the board approved a share repurchase program authorizing the Company to purchase up to $50 million in the aggregate of its outstanding common stock in the open market at prices below NAV per share.</span></li>\n<li><a href=\"https://seekingalpha.com/symbol/NCDL/dividends?source=news_bullet\" target=\"_blank\">See NCDL Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558076-nuveen-churchill-direct-lending-slashes-dividend-by-20-to-036-004-supplemental-dividend-50m-buybacks",
            "pub_date": "2026-02-27 03:05:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558073",
            "title": "EPR Properties outlines $400M–$500M investment plan for 2026 as portfolio diversification accelerates",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: EPR Properties (EPR) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Gregory Silvers stated that \"the fourth quarter capped a year of solid execution and clear progress toward accelerated growth,\" highlighting a 5.1% increase in FFO as adjusted per share and a 6.2% increase in AFFO per share for the year. Silvers announced significant portfolio expansion in championship golf courses and a major water park acquisition, emphasizing further diversification within the attraction sector. He noted, \"As we move into 2026, we expect to build on our strong industry relationships while substantially increasing our investment spending.\"</li>\n<li>Silvers underscored the company's capital recycling strategy: \"By executing targeted dispositions, we strengthened portfolio qualities, reduce concentration and unlock capital to deploy into higher returning experiential investments.\"</li>\n<li>The CEO also confirmed the successful closing of a $550 million public debt offering and establishment of a $400 million at-the-market equity program, which he described as \"2 significant capital market initiatives that bolster our financial flexibility and fund our growing investment pipeline.\"</li>\n<li>Silvers announced a \"5.1% increase to our monthly dividend to common shareholders.\"</li>\n<li>CFO Mark Peterson reported, \"FFO as adjusted for the quarter was $1.30 per share versus $1.23 in the prior year, an increase of 5.7%. And AFFO for the quarter was also $1.30 per share compared to $1.22 in the prior year, an increase of 6.6%.\" Peterson highlighted total revenue for the quarter at $183 million, up from $177.2 million in the prior year, and noted percentage rents and participating interest for the quarter were $7.8 million versus $4.9 million previously.</li>\n<li>Peterson stated, \"Our net debt to annualized adjusted EBITDAre was 4.9x at year-end, which is below the lower end of our targeted range.\"</li>\n<li>Silvers announced the retirement of CIO Gregory Zimmerman and the appointment of Ben Fox as the new Chief Investment Officer.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Peterson introduced 2026 FFO as adjusted per share guidance of $5.28 to $5.48, representing an increase of 5.1% at the midpoint over the prior year. He added, \"We expect a similar percentage increase in AFFO per share.\"</li>\n<li>Investment spending guidance for 2026 was set at $400 million to $500 million, with disposition guidance for the same period at $25 million to $75 million.</li>\n<li>Peterson clarified, \"We expect percentage rent and participating interest of $18.5 million to $22.5 million.\"</li>\n<li>Management noted the first quarter of 2026 is expected to be lower than the full year divided by four by about $0.11 per share due to seasonality.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Total revenue for Q4 was $183 million compared to $177.2 million in the prior year, with rental revenue increasing $7.9 million year-over-year.</li>\n<li>FFO as adjusted for the full year was $5.12 per share, up from $4.87 in the prior year, and AFFO was $5.14 per share compared to $4.84.</li>\n<li>Disposition proceeds totaled $34.5 million for the quarter and $168.3 million for the year, with gains on sales recognized both quarterly and annually.</li>\n<li>The company closed on $550 million of new 5-year senior unsecured notes at a coupon of 4.75% and had $90.6 million of cash on hand at year-end.</li>\n<li>AFFO payout ratio for the quarter and year was 68%.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Michael Goldsmith, UBS: Asked about the confidence in achieving $400 million to $500 million in acquisitions. Silvers responded, \"We wouldn't put it out there if we didn't have great confidence in it... we feel really good about where we're positioning for the beginning of the year.\"</li>\n<li>Goldsmith also questioned the Topgolf transaction's impact. Silvers replied, \"They're very much aligned with what we have said that the growth pattern needs to slow down to 3 to 5 units a year where they can hit kind of the demographic and location requirements that we kind of agree with them.\"</li>\n<li>John Kilichowski, Wells Fargo: Inquired about cost of capital and conditions for tapping the ATM. Silvers indicated, \"We are clearly entering the zone where it makes sense... maybe we could even further delever.\"</li>\n<li>Bennett Rose, Citi: Sought updates on Sullivan County and theme park management changes. Silvers stated, \"We've not had really any meaningful conversations with them... it's not built into our plan.\" On theme parks, he said, \"We think that business is actually very, very... stable cash cow kind of business.\"</li>\n<li>Anthony Paolone, JPMorgan: Asked about development versus acquisitions and cap rates. Silvers explained, \"At least early part of this year, going to be more on the acquisition side... probably 70-30 acquisitions,\" with most investments carrying \"an initial 8 handle on it.\"</li>\n<li>Michael Carroll, RBC: Probed the timing of investments and Regal percentage rents. Silvers answered, \"It's actually... weighted more towards the first half of the year,\" and expects percentage rents \"up 2% over where they were last year.\"</li>\n<li>Upal Rana, KeyBanc: Asked about the transaction market and upcoming labor negotiations. Silvers commented, \"We're seeing our ability to participate in larger deals more,\" and on labor, \"everybody is saying the right thing about wanting to avoid\" strikes.</li>\n<li>Jana Galan, BofA: Queried the education portfolio. Silvers noted, \"The strength of that will allow us to capture good value if we want to do that and could be another lever that we pull to accelerate growth.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on the sustainability of acquisition targets, cost of capital, tenant performance, and transaction pipeline, maintaining a neutral to slightly positive tone, with questions centering on execution confidence and sector trends.</li>\n<li>Management consistently expressed confidence in guidance and strategic direction, with Silvers stating, \"We feel really good about where we're positioning for the beginning of the year,\" but occasionally hedged with phrases like \"we think\" and \"we hope,\" indicating a disciplined but optimistic outlook.</li>\n<li>Compared to the previous quarter, both analysts and management maintained a similar tone, though management’s confidence in accelerated investment and portfolio diversification was more pronounced.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for FFO as adjusted per share increased from the prior quarter’s range of $5.05 to $5.13 to a 2026 range of $5.28 to $5.48, with the midpoint growth rate rising from 4.5% to 5.1%.</li>\n<li>Investment spending guidance shifted from $225 million to $275 million for 2025 to $400 million to $500 million for 2026, reflecting a substantial planned increase.</li>\n<li>Disposition guidance narrowed from $150 million to $160 million to $25 million to $75 million, indicating a reduction in anticipated asset sales.</li>\n<li>Portfolio diversification advanced, with new acquisitions in golf and water parks, and increased emphasis on fitness and wellness sectors, compared to a Q3 focus on hot springs and fitness.</li>\n<li>Management’s tone was more confident regarding access to larger transactions and capital flexibility, while analysts maintained a cautious but inquisitive approach.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management highlighted macro pressures on consumers and expense increases, as well as potential labor negotiations in the broader entertainment sector.</li>\n<li>The company is ceasing its practice of providing annual box office estimates, suggesting perceived stabilization but also reducing forward-looking granularity.</li>\n<li>Silvers addressed asset-specific uncertainty, such as the lack of progress on the Sullivan County ground lease sale, and acknowledged the possibility of using the education portfolio as a lever for future growth.</li>\n<li>Analysts probed cost of capital sensitivity, tenant performance, and the impact of major tenant transactions, indicating ongoing concern about market dynamics and execution risk.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>EPR Properties concluded the year with strong growth in per share earnings, expanded its experiential portfolio through key acquisitions, and bolstered its balance sheet with successful capital market initiatives. The company enters 2026 with a robust investment pipeline, clear guidance for increased investment spending, and leadership transitions designed to support continued growth and diversification in the experiential real estate sector.</p>\n<p><a href=\"https://seekingalpha.com/symbol/epr/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558073-epr-properties-outlines-400m-500m-investment-plan-for-2026-as-portfolio-diversification",
            "pub_date": "2026-02-27 03:01:08",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558074",
            "title": "Payoneer signals 12% core revenue growth and $90M adjusted EBITDA target for 2026 amid upmarket shift and stablecoin expansion",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Payoneer Global Inc. (PAYO) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li><p>John Caplan, CEO, emphasized Payoneer's global reach and differentiation in the cross-border payments market, stating, \"We processed over $87 billion in volume across 190 countries and territories in 2025.\" He highlighted the company's \"AI-first strategy,\" designed to reshape customer experience, operations, and cost structure, with tangible impacts across engineering, go-to-market, and compliance functions. Caplan outlined the upmarket strategy, noting that \"customers with $600,000 or more of annual average volume in their Payoneer account now represent 42% of our revenue, and they were our fastest-growing segment in 2025, driving 60% of our overall growth.\" He also announced the launch of stablecoin capabilities in partnership with Bridge, a Stripe company, and the application to establish an uninsured national trust bank in the U.S.</p></li>\n<li><p>Caplan projected significant core profitability expansion, stating, \"We expect to more than double core adjusted EBITDA to $90 million at the midpoint\" for 2026, with revenue ex-interest of $900 million to $940 million and a plan to exit the year with mid-teens growth and mid-teens core margins.</p></li>\n<li><p>CFO Bea Ordonez stated, \"Payoneer's full year results, mid-teens growth, 26% adjusted EBITDA margin and significant cash flow generation demonstrate the strength of our business.\" Ordonez detailed record quarterly revenue of $275 million, with ARPU up 15% in Q4 and B2B volume growth of 21%. She reiterated confidence in further B2B growth and outlined the continued execution of pricing strategies and targeted investments, including the recent Boundless acquisition.</p></li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li><p>Management projected 2026 revenue between $1,090 million and $1,130 million, with $190 million of interest income and revenue excluding interest income between $900 million and $940 million, representing 12% growth at the midpoint. Ordonez explained, \"Our core revenue guidance includes an approximately 300 basis point headwind to our growth rate, reflecting anticipated churn related to our transition to Stripe's Checkout solution as well as from changes to our acquisition focus and onboarding flows.\"</p></li>\n<li><p>The company expects to deliver adjusted EBITDA of between $275 million and $285 million, with adjusted EBITDA excluding interest income of $85 million to $95 million, \"more than twice the 2025 level and achieving a double-digit margin for the first time as a public company.\"</p></li>\n<li><p>High single-digit core revenue growth is expected in the first half of 2026, increasing sequentially and exiting the year at a mid-teens growth rate, supported by B2B and enterprise momentum, portfolio optimization, and AI-driven efficiencies.</p></li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li><p>Payoneer reported Q4 revenue of $275 million, with revenue excluding interest income up 9%. B2B volume grew 21% in the quarter, and ARPU excluding interest income increased 21%, marking the sixth consecutive quarter of over 20% ARPU growth.</p></li>\n<li><p>Customer funds reached $7.9 billion, up 13% year-over-year, and Q4 interest income was $56 million. Payoneer has hedged a substantial portion of interest income for 2026-2028, with $130 million secured for 2026.</p></li>\n<li><p>Total operating expenses were $246 million, and adjusted EBITDA was $69 million, representing a 25% margin. Adjusted EBITDA excluding interest income was $13 million. Net income was $19 million, with basic and diluted EPS of $0.05, and free cash flow for the year totaled $146 million.</p></li>\n<li><p>In Q4, the company repurchased $80 million of shares, with $192 million remaining on its authorization.</p></li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li><p>Cristopher Kennedy, William Blair: Asked for key KPIs to track upmarket strategy progress. Caplan responded that 42% of revenue comes from customers doing over $50,000 in Q4, with strong ARPU and product adoption; the company will continue to share ARPU growth and volume per customer.</p></li>\n<li><p>Kennedy also questioned margin expansion. Ordonez replied, \"Our guidance at the midpoint calls for $90 million of core adjusted EBITDA before interest income, and that's more than 2x what we delivered in the prior year.\"</p></li>\n<li><p>Christopher Svensson, Deutsche Bank: Inquired about marketplace business trends and volume guidance. Ordonez explained, \"We actually saw a strong holiday season, right, back end of November and into December, mid-single-digit marketplace volume growth in December... modest acceleration coming into January and February.\"</p></li>\n<li><p>Svensson followed up on confidence in accelerating core revenue growth. Ordonez cited \"significant acceleration in our B2B business,\" ongoing enterprise ramp-up, and pricing strategies as drivers.</p></li>\n<li><p>Sanjay Sakhrani, KBW: Asked about the new bank opportunity and timeline. Ordonez described the bank charter as enabling compliant stablecoin issuance, custody, and integration with fiat rails, stating, \"It brings these digital currencies into a regulated and trusted ecosystem.\"</p></li>\n<li><p>Sakhrani also asked if the 300 basis point headwind was the final impact from portfolio transition and about tariff effects. Ordonez confirmed the headwind is \"really 2 elements\"—the Stripe solution transition and portfolio optimization—and expects to leave these behind as the company exits 2026. Caplan noted that \"the shifting tariff landscape actually presents a real opportunity for Payoneer.\"</p></li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li><p>Analysts focused on the sustainability of upmarket growth, durability of volume and ARPU, confidence in guidance, and the impact of portfolio transitions and tariffs, often pressing for more detail on the underlying drivers and visibility.</p></li>\n<li><p>Management maintained a confident and positive tone throughout both prepared remarks and Q&amp;A, repeatedly emphasizing \"significant leverage unlock,\" \"meaningful impact,\" and \"confidence\" in future performance and strategy. Caplan and Ordonez directly addressed concerns, offering specifics on growth drivers and mitigation strategies.</p></li>\n<li><p>Compared to the previous quarter, management’s tone shifted from cautiously optimistic to more assertive and forward-looking, while analysts remained probing but acknowledged the company’s progress.</p></li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li><p>Guidance for 2026 is now explicit, with a target to more than double core adjusted EBITDA and drive 12% core revenue growth, compared to the previous quarter’s lack of quantitative 2026 guidance.</p></li>\n<li><p>The upmarket strategy was further emphasized, with a higher revenue share from large customers (42% in Q4 versus nearly 30% in Q3) and continued ARPU growth.</p></li>\n<li><p>B2B’s contribution to growth accelerated, with 21% Q4 volume growth compared to prior quarter’s 11%, and overall B2B now 30% of revenue excluding interest income.</p></li>\n<li><p>Management’s confidence and specificity increased, particularly regarding AI-driven efficiencies and the stablecoin strategy, while analysts maintained focus on execution and the sustainability of key metrics.</p></li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li><p>The transition to Stripe’s Checkout solution and portfolio optimization is expected to create a 300 basis point headwind to 2026 revenue growth, though management anticipates higher-margin and healthier customer cohorts as a result.</p></li>\n<li><p>Potential impacts from tariffs and macroeconomic uncertainty remain, but management sees normalization as a long-term tailwind.</p></li>\n<li><p>Interest rate declines are being mitigated through hedging strategies, securing over $130 million in 2026 interest income.</p></li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Payoneer management conveyed that 2025 marked a record year of profitable growth, ARPU expansion, and operational leverage, with B2B and large customer segments driving momentum. The company enters 2026 with a clear strategy to move further upmarket, accelerate AI adoption, launch stablecoin solutions, and double core adjusted EBITDA, while proactively managing risks related to portfolio transitions, tariffs, and interest rates. Management reiterated their conviction in the company’s long-term value creation and ongoing share repurchase plan, emphasizing that Payoneer is positioned for sustained growth and margin expansion in the evolving global commerce landscape.</p>\n<p><a href=\"https://seekingalpha.com/symbol/payo/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558074-payoneer-signals-12-percent-core-revenue-growth-and-90m-adjusted-ebitda-target-for-2026-amid",
            "pub_date": "2026-02-27 03:01:08",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558048",
            "title": "Korean market crash looks imminent after 'blow off top' - Kolanovic",
            "description": "<html><body><p data-eci=\"true\">The high-flying South Korean stock market could crash as soon as its next trading session, former J.P. Morgan strategist Marko Kolanovic posted Thursday.</p>\n<p>The KOSPI (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/KOSPI\" title=\"KOSPI Index\">KOSPI</a></span>) (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EWY\" title=\"iShares MSCI South Korea ETF\">EWY</a></span>) is up 175% since its April low and has seen unprecedented rapid point gains on the backs of two stocks: Samsung (<a href=\"https://seekingalpha.com/symbol/SSNLF\" title=\"Samsung Electronics Co., Ltd.\">SSNLF</a>) and <span>SK Hynix (<a href=\"https://seekingalpha.com/symbol/HXSC.F\" title=\"SK hynix Inc.\">HXSC.F</a>)</span><span>.</span></p>\n<p>Kolanovic said there's a good chance that last night's 4% rally in the KOSPI (that reversed on the U.S. open) \"was a blow off top in Korea,\" rising 4% on Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>) earnings \"on which NVDA itself was down.\"</p>\n<p>\"Retail mania (ants) while foreign institutions selling. Chance is KOSPI crashes tonight.\"</p>\n<p>Samsung and SK Hynix both closed up more than 7% in Korea's session today, but chip stocks on Wall Street (<a href=\"https://seekingalpha.com/symbol/SMH\" title=\"VanEck Semiconductor ETF\">SMH</a>) (<a href=\"https://seekingalpha.com/symbol/SOXX\" title=\"iShares Semiconductor ETF\">SOXX</a>) are down more than 3.5%.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558048-korean-market-crash-looks-imminent-after-blow-off-top---kolanovic",
            "pub_date": "2026-02-27 02:51:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558069",
            "title": "Popular declares $0.75 dividend",
            "description": "<html><body><ul>\n<li>Popular (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BPOP\" title=\"Popular, Inc.\">BPOP</a></span></span>) declares <a href=\"https://seekingalpha.com/pr/20416193-popular-inc-declares-a-cash-dividend-of-0_75-per-common-share\" target=\"_blank\">$0.75/share quarterly dividend</a>, in line with previous.</li>\n<li class=\"remove-link-for-mobile\">\n<a href=\"https://seekingalpha.com/symbol/BPOP/dividends/yield?source=news_bullet\" target=\"_blank\">Forward yield</a> 2.13%</li>\n<li>Payable April 1; for shareholders of record March 18; ex-div March 18.</li>\n<li><a href=\"https://seekingalpha.com/symbol/BPOP/dividends?source=news_bullet\" target=\"_blank\">See BPOP Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558069-popular-declares-0_75-dividend",
            "pub_date": "2026-02-27 02:51:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558061",
            "title": "Star Bulk signals $2.7 per share free cash flow potential with new 100% payout policy while expanding fleet upgrades",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Star Bulk Carriers Corp. (SBLK) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Simos Spyrou, Co-Chief Financial Officer, reported \"solid profitability, disciplined capital allocation and continued balance sheet strength.\" Net income for the quarter was $65.2 million, with adjusted net income at $74.5 million and $0.16 adjusted EPS. Adjusted EBITDA reached $126.4 million. </li>\n<li>The company repurchased 1.2 million shares for $22.7 million during the quarter and approximately 1.9 million shares totaling $37.9 million in the first quarter of 2026. The Board declared a $0.37 per share dividend for Q4, payable on March 19, 2026. Total cash and cash equivalents were approximately $459 million, with outstanding debt at $1 billion and $110 million undrawn revolver capacity. Star Bulk now has 27 debt-free vessels valued at about $630 million.</li>\n<li>Spyrou announced, \"Going forward, we intend to distribute 100% of our free cash flow, subject to maintaining a minimum cash balance of $2.1 million per vessel, while preserving a minimum quarterly dividend of $0.05 per share.\" A new $100 million share repurchase program has also been authorized.</li>\n<li>Time charter equivalent rate for the quarter was $19,012 per day per vessel. Daily operating expenses and net cash G&amp;A were $6,444 per vessel per day, resulting in a cash margin of roughly $12,570 per day per vessel before debt service and CapEx.</li>\n<li>Nicos Rescos, COO, stated daily operating expenses for Q4 were $5,045 per vessel and net cash G&amp;A at $1,399 per vessel. The company is on track with eight Kamsarmax newbuildings delivering in 2026 and $206.6 million CapEx remaining, with $130 million in debt secured and $74 million expected.</li>\n<li>Three vessels were sold during Q4, and two more are committed for sale in Q1 2026, as part of the ongoing fleet optimization strategy.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management projects that, based on the FFA curve of $18,500 per day, the company would generate approximately $2.7 per share of free cash flow, equivalent to an 11% implied cash flow yield. Every $1,500 per day increase in TCE would translate to $73 million in EBITDA and $0.65 per share incremental dividend.</li>\n<li>The company reiterated its intention to distribute 100% of free cash flow, maintaining a minimum $2.1 million cash balance per vessel and at least a $0.05 per share quarterly dividend.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Star Bulk reported a sequential increase in cash, ending Q4 with $502 million after generating $101 million in operating cash flow. </li>\n<li>The company highlighted that since 2021, it has executed $3 billion in value-enhancing actions, including dividends, share repurchases, and debt repayment, returning $13.49 per share in dividends and reducing net debt by 47%.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Christopher Robertson, Deutsche Bank: Questioned ton-mile expansion beyond iron ore and bauxite. Petros Pappas, CEO, responded: \"Besides bauxite and iron ore, we see a very strong trade on grains, which are going to be increasing by about 7.5% to 8%.\" Pappas also noted potential congestion from West African projects and the impact of Indonesian export cuts on coal ton-miles.</li>\n<li>Robertson followed up on West African infrastructure. An unknown executive stated, \"We expect that we will have in the short term an increase in congestion and over the next few years as the infrastructure is upgraded, this will gradually go down, but this is not something that would take place in 1, 2 years.\"</li>\n<li>Omar Nokta, Clarksons Platou: Asked about the capital return policy shift to 100% payout. Hamish Norton, President, answered, \"The better the share does the stronger the incentive to pay a dividend as opposed to a share repurchase -- and so there's nothing really more to it than that.\"</li>\n<li>Nokta inquired about using earnings as a proxy for free cash flow. Norton replied, \"It's not terrible, but you have to look at the difference between depreciation and debt repayment and change in working content.\" Christos Begleris, Co-CFO, added, \"Debt principal repayment is slightly higher than depreciation and therefore, the free cash flow is lower than net income.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts concentrated on drivers of ton-mile demand, infrastructure bottlenecks, and the rationale behind the capital return policy, with a neutral to slightly positive tone as questions sought clarity rather than expressing skepticism.</li>\n<li>Management delivered confident and direct responses, with forward-looking statements such as \"we intend to distribute 100% of our free cash flow\" (Spyrou) and \"we are committed\" (Rescos), maintaining an upbeat stance throughout both prepared remarks and Q&amp;A.</li>\n<li>Compared to the previous quarter, the tone from both analysts and management was incrementally more optimistic, with a greater focus on proactive capital returns and fleet optimization.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance shifted from a combination of dividends and buybacks in Q3 to a stated policy of 100% free cash flow distribution in Q4, with a new $100 million share repurchase program layered on top.</li>\n<li>Management's tone was more assertive regarding capital allocation and free cash flow generation. Key metrics such as adjusted EBITDA ($126.4 million in Q4 vs. $87 million in Q3) and daily TCE ($19,012 vs. $16,634) improved quarter-over-quarter.</li>\n<li>Cash position and the number of debt-free vessels increased, and dividend per share for Q4 ($0.37) outpaced Q3 ($0.11).</li>\n<li>Analysts shifted focus from newbuild financing and amortization questions in Q3 to demand drivers and capital allocation in Q4.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited elevated Chinese stockpiles, slower industrial production, and softer fixed asset investment as potential downside risks, though offset by new mine capacity.</li>\n<li>The company highlighted ongoing geopolitical risk in the Red Sea, West African congestion, and the impact of stricter environmental regulations.</li>\n<li>Regulatory uncertainty persists due to the postponement of the IMO net zero framework.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Star Bulk Carriers concluded the quarter with strengthened liquidity, robust cash generation, and a clear shift to a 100% free cash flow payout policy, supported by a new share repurchase program and a resilient, optimized fleet. Management expressed confidence in the company's ability to navigate market volatility, driven by operational efficiency, disciplined capital allocation, and a favorable supply-demand outlook for dry bulk, while also acknowledging evolving risks in the global trade environment.</p>\n<p><a href=\"https://seekingalpha.com/symbol/sblk/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558061-star-bulk-signals-2_7-per-share-free-cash-flow-potential-with-new-100-percent-payout-policy",
            "pub_date": "2026-02-27 02:41:08",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558062",
            "title": "California Water Service Group outlines nearly 12% compounded annual rate base growth through 2027 while expanding into Nevada and Oregon",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: California Water Service Group (CWT) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Martin Kropelnicki announced two major acquisitions: \"Yesterday, we executed an agreement to purchase the Nevada and Oregon operations from Nexus Water,\" and highlighted the agreement to purchase the outstanding minority interest in the Texas joint venture, BVRT Holdings, making CWT the sole owner of seven Texas water and wastewater utilities. He emphasized, \"This continues to allow us to expand our geographical footprint and further solidify our position as a leader in the water industry in the Western U.S.\"</li>\n<li>Kropelnicki confirmed, \"We invested a record $517 million into our infrastructure systems, and that includes an additional $52.3 million invested in the fourth quarter alone.\"</li>\n<li>He noted the company's annual dividend increase of 10.7% in 2025, with an additional 8% increase in early 2026, marking the 59th consecutive annual dividend increase.</li>\n<li>CFO James Lynch reported, \"In Q4 2025, revenue was $220 million, and that compares to $222 million in the fourth quarter of 2024. Net income for the quarter was $11.5 million or $0.19 per diluted share compared to the prior year period of $19.7 million or $0.33 per diluted share.\"</li>\n<li>Lynch stated, \"Operating revenue for 2025 was $1 billion. This compared to $1.370 billion in 2024. When compared to non-GAAP 2024 revenue of $949.3 million, our revenue for the year actually increased by $50.8 million or approximately 5.4%.\"</li>\n<li>He further added, \"Capital investments for the quarter and year-to-date were $152.3 million and $517 million, respectively. This record level of annual investment represents a 19.8% over construction levels in 2024.\"</li>\n<li>Chief Business Development Officer Shilen Patel shared, \"Upon closing [the BVRT transaction], we'll become the sole owner of 7 regulated water and wastewater utilities located in the high-growth corridor between Austin and San Antonio.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management expects the California general rate case (GRC) decision soon, highlighting, \"We proposed to invest $1.6 billion in water infrastructure... coupled with planned capital investments in our utilities in other states would result in a compounded annual rate base growth of almost 12% through 2027.\"</li>\n<li>The company plans to continue pursuing growth opportunities in high-growth areas and maintain a 10% cadence on the CapEx line, excluding PFAS-related investments.</li>\n<li>Planned capital investments for 2026 and 2027 do not include $235 million in anticipated PFAS project expenditures or investments in the new Nevada and Oregon acquisitions.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>CWT reported Q4 2025 revenue of $220 million and net income of $11.5 million, with Q4 results negatively impacted by \"the strong statewide weather pattern over much of California that created exceptionally wet and cold weather during the month of December\" (Lynch).</li>\n<li>For the year, operating revenue was $1 billion, up $50.8 million over non-GAAP 2024 revenue, and net income was $128.2 million compared to $126.8 million in non-GAAP 2024.</li>\n<li>Diluted earnings per share was $2.15 in 2025 compared to $2.16 in non-GAAP 2024.</li>\n<li>The company ended the year with $51.8 million in unrestricted cash, $45.6 million in restricted cash, and about $470 million available on bank lines of credit.</li>\n<li>In January 2026, CWT declared its 324th consecutive quarterly dividend of $0.33 per share and announced a 2026 annual dividend of $1.34 per share, representing an 8.1% increase over 2025.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Davis Sunderland, Robert W. Baird &amp; Co.: Asked about the California GRC delay and whether such delays are a new norm. Greg Milleman responded, \"The California Water Association over the past 3 or 4 years has been really focused on educating the commissioners about the impacts of the delays on customers... One of the lead advocates for that is the commissioner that's assigned to our case, Commissioner Matt Baker, and he is very focused on getting decisions down on time.\"</li>\n<li>Sunderland inquired about regulatory environments in Nevada and Oregon. Milleman: \"Nevada has got a very reasonable commission... they have the DSIC, they also have decoupling in Nevada... In Oregon, they allow construction work and progress in rate case.\"</li>\n<li>Sunderland sought updates on PFAS compliance funding. Kropelnicki said, \"We're moving ahead as planned. In 2025, Jim, I believe we spent about $20 million on our PFAS programs... I expect in 2026... we'll spend between $50 million, $70 million on PFAS.\"</li>\n<li>Sunderland: Asked about funds recovered, Lynch responded, \"The net amount is just slightly below $40 million after the attorneys have taken out their share of the proceeds.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts' tone was neutral to slightly positive, focusing on regulatory progress, acquisition integration, and PFAS compliance. Questions were direct and sought clarification rather than expressing skepticism or concern.</li>\n<li>Management maintained a confident tone during prepared remarks and Q&amp;A, emphasizing strategic expansion, regulatory engagement, and robust capital investment. Kropelnicki repeatedly noted, \"We expect the smooth transition\" and described acquisitions and regulatory progress as positive for growth.</li>\n<li>Compared to the previous quarter, both management and analysts' tone remained steady, with a slight uptick in optimism around acquisition-related growth and regulatory engagement.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter saw two major acquisitions announced and a reinforced strategy around geographic and regulatory diversification, compared to the previous quarter's focus on organic growth and infrastructure investment.</li>\n<li>Capital expenditures increased from $364.7 million year-to-date in Q3 to a record $517 million for the full year, with a 19.8% annual increase in construction levels cited by management.</li>\n<li>Dividend increases continued, with an 8.1% hike announced for 2026, following a 10.7% increase in 2025.</li>\n<li>Management's confidence in achieving regulatory outcomes and integrating new assets was more pronounced, while analysts maintained their focus on rate case timing and growth projections.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited weather-related risks, particularly the impact of December storms on Q4 water consumption and earnings.</li>\n<li>Ongoing regulatory delays in California were addressed, with management emphasizing education and engagement with the commission to mitigate timing risks.</li>\n<li>PFAS regulatory compliance and the associated capital requirements remain a key focus, with CWT actively pursuing grants and legal settlements to offset costs.</li>\n<li>Management acknowledged the need to balance rate affordability with continued investment in infrastructure and compliance.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>California Water Service Group marked its centennial year by announcing strategic acquisitions in Nevada and Oregon and the full ownership of its Texas joint venture, positioning the company for continued geographic and regulatory diversification. Despite weather-related challenges that softened Q4 results, CWT delivered record infrastructure investment and maintained its strong dividend growth, while setting expectations for nearly 12% compounded annual rate base growth through 2027 and significant ongoing PFAS-related capital deployment. Management remains focused on regulatory progress, disciplined capital strategy, and leveraging new assets for long-term shareholder value.</p>\n<p><a href=\"https://seekingalpha.com/symbol/cwt/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558062-california-water-service-group-outlines-nearly-12-percent-compounded-annual-rate-base-growth",
            "pub_date": "2026-02-27 02:41:08",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558051",
            "title": "Freeport-McMoRan shares snap six-session winning streak",
            "description": "<html><body><div>\n<div><div>\n<p data-eci=\"true\">Freeport-McMoRan (FCX) shares snapped six straight sessions of gains on Thursday, as the stock was 2.6% lower at $67.03.</p>\n<div> </div>\n</div></div>\n<div>\n<p>Most recently, Freeport-McMoRan entered into a memorandum of understanding with the Indonesia government to <a href=\"https://seekingalpha.com/news/4553865-freeport-signs-agreement-with-indonesia-to-extend-grasberg-mining-rights-through-2041\">extend its Grasberg permit</a> for the life of the resource, ensuring long-term access to one of the world's largest copper and gold mines.</p>\n<p>Looking at Seeking Alpha's Quant Rating, FDX has a <a href=\"https://seekingalpha.com/symbol/FCX/ratings/quant-ratings\">Strong Buy</a> with a score of 4.9 out of 5. The company received A in the prospect of profitability, while it received D in the valuation factor.</p>\n<p>Seeking Alpha analysts are <a href=\"https://seekingalpha.com/symbol/FCX/ratings/author-ratings\">cautious</a> and see the stock as a Hold.</p>\n<p>Turning to the <a href=\"https://seekingalpha.com/symbol/FCX/ratings/sell-side-ratings\">Wall Street</a>, 18 analysts have given the stock a Buy or above rating. Two gave the stock hold recommendation, while one gave Sell rating to FCX.</p>\n<div> </div>\n<div> </div>\n<div> </div>\n<div> </div>\n<div> </div>\n<div> </div>\n<p>“FCX's leach initiative targets 800 million pounds of annual production by 2030, structurally expanding margins and reducing capital intensity versus traditional mining,” <a href=\"https://seekingalpha.com/article/4870599-freeport-mcmoran-stock-zero-capital-leach-growth-hidden-shadow-mine-advantage\">pointed out</a> a recent Seeking Alpha analysis.</p>\n</div>\n</div>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558051-freeport-mcmoran-shares-snap-six-session-winning-streak",
            "pub_date": "2026-02-27 02:35:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558047",
            "title": "FDA reportedly eyeing staff bonuses to accelerate drug reviews",
            "description": "<html><body><p data-eci=\"true\">The U.S. Food and Drug Administration ((FDA)) is launching a bonus scheme for its scientific staff who complete drug reviews ahead of schedule, Bloomberg reported on Thursday, citing an agency official familiar with the matter.</p>\n<p>The program applies to the FDA’s Center for Drug Evaluation and Research ((CDER)) and the Center for Biologics Evaluation and Research ((CBER)), and it is scheduled to take effect as a pilot program on Apr. 1.</p>\n<p>As part of the scheme, the incentives will be offered to FDA scientists and their teams who complete various sections of drug reviews ahead of schedule, according to a copy of a presentation about the program.</p>\n<p>The regulator will also consider the quality and <a href=\"https://www.bloomberg.com/news/articles/2026-02-26/fda-to-give-staff-bonuses-for-speeding-up-drug-reviews?utm_source=website&amp;utm_medium=share&amp;utm_campaign=copy\" rel=\"nofollow\" target=\"_blank\" title=\"complexity of\">complexity of</a> their reviews in determining the size of the bonuses, which the FDA official said could be around a few thousand dollars per quarter. The final bonuses are yet to be finalized.</p>\n<p>The regulator is expected to announce the plan at an internal meeting on Thursday. The FDA didn’t immediately respond to Bloomberg’s request for comment.</p>\n<p>The official added that a recruitment drive is underway at the FDA to add more than 1,000 new scientists to accelerate drug reviews. The moves follow several high-profile departures at the FDA in 2025.</p>\n<p>Late last year, Richard Pazdur, a well-respected oncologist and 26-year veteran at the agency, filed papers to retire at the end of December, less than a month after being named <a href=\"https://seekingalpha.com/news/4527734-fda-top-drugs-official-pazdur-retiring-shortly-after-starting\" rel=\"noopener\" target=\"_blank\">the director of the CDER.</a></p>\n<p>In April, Peter Marks, who spearheaded Operation Warp Speed during President Donald Trump’s first term, resigned as the head of the CBER, blaming Health and Human Services Secretary Robert F. Kennedy, <a href=\"https://seekingalpha.com/news/4426996-how-peter-marks-fda-departure-impacting-pharma-biotech-stocks\" rel=\"noopener\" target=\"_blank\">Jr., for his departure</a>.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558047-fda-plans-staff-bonuses-accelerate-drug-reviews",
            "pub_date": "2026-02-27 02:35:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}