{
    "data": [
        {
            "id": "4558128",
            "title": "Adtran outlines $275M-$295M Q1 2026 revenue target as fiber and optical momentum continues",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: ADTRAN Holdings, Inc. (ADTN) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Thomas Stanton, President, CEO &amp; Chairman, stated that \"ADTRAN delivered a strong fourth quarter and finished 2025 with solid momentum. Our quarterly results reflected higher demand and strong execution with revenue above the high end of our original outlook, overcoming typical year-end seasonality.\" He highlighted that all three business categories achieved sequential and year-over-year growth, with U.S. revenue up 31% year-over-year and 14% sequentially. Non-U.S. revenue grew 12% year-over-year and declined 3% sequentially, aligning with customer order patterns in Europe.</li>\n<li>Stanton emphasized the performance of Optical Networking Solutions, which grew 33% year-over-year, driven by cloud provider and enterprise customer demand, now accounting for 25% of Q4 revenue. He noted ongoing expansion in the optical customer base as \"cloud providers [are] expanding data center capacity and large enterprises upgrading their optical networks.\"</li>\n<li>The CEO also reported continued progress in software, with nearly 500 service providers on the Mosaic One platform and over 100 on Intellifi Wi-Fi solutions. Mosaic One Clarity's AI-driven automation is in trials before its planned launch later in the year.</li>\n<li>Stanton indicated a positive market environment, with \"sustained fiber investment across our core markets\" and growing demand for automation and software in high-capacity networks. He added, \"We delivered a strong Q4 with solid financial results and execution and healthy core -- and healthy cash flows.\"</li>\n<li>Stanton stated that the company strengthened its balance sheet by issuing approximately $200 million of convertible notes and repurchased $46.6 million in ADTRAN Networks shares during 2025, reducing minority interest below 30%.</li>\n<li>Timothy Santo, Senior VP of Finance, Principal Accounting Officer, Treasurer &amp; CFO, said, \"We delivered strong results for the fourth quarter and full year 2025, driven by solid execution and healthy revenue growth. As scale improved, we delivered higher margins, and operating efficiency increased across the business.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>The company expects Q1 2026 revenue between $275 million and $295 million and a non-GAAP operating margin of 4% to 8%, reflecting traditional seasonality and current supply chain dynamics.</li>\n<li>Stanton noted, \"At this time, we are not seeing conditions that change our demand outlook or execution priorities. In summary, we entered 2026 with a positive outlook. Customer trends are favorable in the U.S. and Europe, customer acceptance of products has been strong, and our product offerings and competitive position has never been better.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Revenue for Q4 2025 was $291.6 million, up 20% year-over-year and 4% sequentially, exceeding the high end of original guidance.</li>\n<li>Optical Networking contributed the largest and fastest growth, with revenue increasing by $26.9 million or 33% from the prior year.</li>\n<li>Non-U.S. revenue represented 53% of total revenue, U.S. revenue 47%.</li>\n<li>Non-GAAP gross margin increased to 42.5% (up 44 basis points sequentially and 122 basis points year-over-year).</li>\n<li>Non-GAAP operating profit rose to $18.8 million or 6.4% of revenue.</li>\n<li>Non-GAAP EPS was $0.16 compared to $0.05 in Q3 2025 and a loss of $0.02 a year ago, with a $0.03 benefit from minority share acquisition.</li>\n<li>Operating cash flow was $42.2 million for the quarter and $129.8 million for the year. Free cash flow for the year was $60.5 million.</li>\n<li>Cash and cash equivalents at quarter end were $95.7 million after share repurchases.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Michael Genovese, Rosenblatt Securities: Asked about U.S. and Europe demand and drivers of revenue growth. Stanton responded that momentum is continuing, especially in fiber-to-the-prem and optical segments, with customer capital being unleashed for bandwidth upgrades and AI-driven initiatives.</li>\n<li>Genovese also questioned the operating margin outlook range. Stanton replied that the range is \"not overly impacting the guidance range\" and is consistent with historical practice, with memory and optics supply tightness being managed.</li>\n<li>Ryan Koontz, Needham &amp; Company: Inquired about optical growth drivers, distinguishing between hyperscale/AI cloud and traditional network demand. Stanton said both contributed, with ICP (cloud) performance stronger than historically seen.</li>\n<li>Koontz asked about MOFN (hyperscaler-contracted builds with traditional SPs). Stanton confirmed such deals are categorized as carrier business and are adding momentum.</li>\n<li>Koontz requested an update on U.S. fiber-to-the-home greenfield builds. Stanton described Q4 as \"solid,\" with BEAD funding beginning to flow, which provides budget certainty for carriers.</li>\n<li>Christian Schwab, Craig-Hallum: Asked about asset sales and leaseback. Stanton said leaseback of the East Tower was on hold due to current cash position, but North/South Tower sale is progressing. Noncore asset sales are being evaluated for value enhancement in the second half of the year.</li>\n<li>Schwab also questioned key 2026 drivers. Stanton singled out enterprise business strength and EU legislative focus on Huawei replacement, calling it a near $1 billion annual opportunity.</li>\n<li>George Notter, Wolfe Research: Probed the pace of Huawei replacement. Stanton clarified that while EU directives are recommendations, country-level mandates are stronger and are leading to reduced new Huawei deployments. He estimated the targeted TAM for ADTRAN’s sweet spot products at approximately $850 million in EMEA for 2024.</li>\n<li>Dave Kang, B. Riley: Queried the seasonality of European Tier 1 telco spending. Stanton recalled it was about 60:40 first half to second half last year, mainly in Access &amp; Aggregation. Efforts are underway to smooth this pattern. Kang also asked about the broadband deployment cycle in Europe, with Stanton stating most regions remain in the early stages.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts were upbeat but pressed for specifics on regional demand drivers, margin guidance, and the pace of European market transitions. Their tone was generally positive, with questions focused on sustainability of momentum and clarity on growth catalysts.</li>\n<li>Management’s tone was confident and assertive, frequently emphasizing strong execution, positive customer trends, and robust product acceptance. Stanton repeatedly described the environment as positive and highlighted both financial discipline and market positioning.</li>\n<li>Compared to the previous quarter, both analysts and management demonstrated increased optimism, with less concern over volatility and more focus on growth opportunities, particularly in optical and enterprise segments.</li>\n<li>Direct quote from Stanton: \"We have several multiyear tailwinds in our key market segments.\"</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance increased at the high end for Q1 2026 revenue and operating margin compared to Q4 2025, with a focus on continued leverage and cash generation.</li>\n<li>The strategic focus shifted more toward software and AI-driven platforms, with greater emphasis on enterprise and cloud customer expansion.</li>\n<li>Analysts in Q4 placed more emphasis on monetizing noncore assets and the impact of European regulatory changes on Huawei replacement, as compared to previous quarters' focus on operational execution and capital structure.</li>\n<li>Key metrics such as revenue, gross margin, and EPS improved quarter-over-quarter, while cash flow and working capital efficiency also showed positive trends.</li>\n<li>Management’s tone displayed greater confidence, underpinned by evidence of sustained momentum, while analysts appeared more encouraged by funding developments and regulatory catalysts in the U.S. and Europe.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management acknowledged ongoing supply chain variability, especially in components such as memory and optics, but noted these are being managed through procurement and pricing mechanisms.</li>\n<li>There is uncertainty regarding the timing and scale of European telco spending, with efforts underway to smooth spending cycles.</li>\n<li>Asset monetization activities, including potential building sales and noncore asset divestitures, are subject to market conditions and may not close within the anticipated timeframe.</li>\n<li>Analysts raised concerns about the pace of Huawei replacement in Europe and the potential impact of legislative delays or shifts in carrier procurement patterns.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>ADTRAN enters 2026 with strong momentum, as reflected by robust Q4 results, improved profitability, and an optimistic revenue and margin outlook. Management highlighted favorable customer trends, ongoing product acceptance, and significant opportunities in both U.S. and European markets, particularly in optical networking and enterprise segments. The company continues to prioritize operating leverage, cash generation, and strategic asset management to support long-term growth.</p>\n<p><a href=\"https://seekingalpha.com/symbol/adtn/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558128-adtran-outlines-275m-295m-q1-2026-revenue-target-as-fiber-and-optical-momentum-continues",
            "pub_date": "2026-02-27 04:20:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558127",
            "title": "GoodRx expects Pharma Direct revenue growth of at least 30% in 2026 amid shift to pharma manufacturer solutions",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: GoodRx Holdings, Inc. (GDRX) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li><p>Wendy Barnes, President and CEO, emphasized that \"the fourth quarter marked a strong finish to the year and reflected disciplined execution across our strategic priorities.\" She highlighted expansion in direct-to-consumer affordability programs, scaled subscription offerings, and deepened retail pharmacy relationships. Barnes announced, \"we moved quickly to translate market change into clear execution across our platform,\" specifically with the launch of condition-specific subscriptions and the integration of pricing into TrumpRx. She detailed the company's focus on Pharma Manufacturer Solutions, now branded as GoodRx Pharma Direct, and its role as a critical growth engine, stating, \"full year revenue up more than 40% in 2025 year-over-year.\"</p></li>\n<li><p>Barnes noted a strategic shift: \"we are increasingly orienting the business around pharma manufacturer solutions as a key growth driver,\" while retaining the core marketplace as foundational. She also cited the platform's scale, with \"the #1 prescription app and nearly 300 million site visits annually.\"</p></li>\n<li><p>Barnes highlighted a collaboration with Novo Nordisk for the Wegovy pill, stating, \"we believe GoodRx accounted for nearly 20% of all Wegovy Pill self-pay fills during a single week in January.\" She also mentioned partnerships with Pfizer and integration with TrumpRx.</p></li>\n<li><p>On subscriptions, Barnes pointed to \"strong early adoption related to our condition-specific subscriptions, particularly around weight loss,\" and introduced Employer Direct, a new offering targeting employer-sponsored affordability.</p></li>\n<li><p>Christopher McGinnis, CFO, stated, \"For the fourth quarter, revenue came in at $194.8 million and adjusted EBITDA was $65 million. This resulted in full year 2025 revenue of $796.9 million, which was up 1% year-over-year.\" He added, \"Revenue from Pharma Direct...increased to $151.4 million, up 41% year-over-year.\"</p></li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li><p>The company expects full year 2026 revenue between $750 million and $780 million and adjusted EBITDA of at least $230 million. McGinnis explained, \"Our outlook reflects the decisions we are making to ensure the long-term durability of our business.\"</p></li>\n<li><p>GoodRx projects Pharma Direct revenue to grow at least 30% year-over-year in 2026.</p></li>\n<li><p>Management anticipates continued acceleration in condition-specific subscriptions launched in late 2025, with weight loss subscriptions expected to contribute more meaningfully in 2026.</p></li>\n<li><p>McGinnis stated, \"we expect pressure on prescription transactions revenue in 2026, which is reflected in our guidance.\"</p></li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li><p>Fourth quarter revenue was $194.8 million and adjusted EBITDA was $65 million. Full year revenue reached $796.9 million, with adjusted EBITDA at $270.5 million.</p></li>\n<li><p>Prescription transactions revenue declined 6% year-over-year to $544 million, attributed to the Rite Aid bankruptcy and lower integrated savings program volume, which impacted results by approximately $35 million to $40 million.</p></li>\n<li><p>Subscription revenue for the year was $83.8 million, down 3%. Pharma Direct revenue was $151.4 million, marking 41% growth year-over-year.</p></li>\n<li><p>GoodRx ended the year with $261.8 million in cash and repurchased approximately 48.9 million shares for $217.4 million.</p></li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li><p>Michael Cherny, Leerink Partners: Asked about revenue guidance, unit economics, and re-contracting efforts. McGinnis explained that the decline is driven by \"significant revenue coming from Rite Aid and some of our other partner programs during 2025 that will not recur in 2026,\" a shift of high-cost branded medications to Pharma Direct, and \"a decline from unit economics\" due to renegotiated lower fees across partners.</p></li>\n<li><p>Payton Engdahl, Truist Securities: Inquired about pharma budget spending. Barnes and Laura Jensen, Chief Commercial Officer, indicated \"more of the spending has kind of been pulled forward in our sales cycle,\" with pharma budgets on the direct-to-consumer side continuing to invest.</p></li>\n<li><p>Lisa Gill, JPMorgan: Asked about the future of the core business versus Pharma Direct. Barnes stated, \"the core and what we largely refer to as Rx Marketplace...will always be foundational to our business,\" but acknowledged a shift toward more durable margins and greater investment in Pharma Direct and Employer Direct.</p></li>\n<li><p>John Ransom, Raymond James: Questioned the impact of take rate and volume on PTR. McGinnis responded, \"we're trying to stabilize the underlying volume of scripts,\" with a focus on renegotiating for long-term durability.</p></li>\n<li><p>Steven Valiquette, Mizuho Securities: Asked about margin pressure and its impact on gross margin and expenses. McGinnis noted, \"the cost of revenue is a little higher on...condition-specific subscriptions,\" and said, \"Pharma Direct is a high grower, healthy margin profile, but that's diluted to higher core business margins over time.\"</p></li>\n<li><p>Additional analysts explored sales and marketing strategy, stability in generic prescription monetization, and volume trends in integrated savings programs.</p></li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li><p>Analysts raised concerns about revenue guidance, margin durability, and the business model transition, with a neutral to slightly negative tone reflecting skepticism around PTR headwinds and subscription momentum, but acknowledged management's transparency.</p></li>\n<li><p>Management maintained a confident and pragmatic tone in prepared remarks, emphasizing execution, market adaptation, and long-term growth. In Q&amp;A, management was candid about near-term headwinds and used phrases like \"we believe\" and \"we are confident,\" but also acknowledged, \"this is a negotiation of lower fees across multiple partners in our ecosystem.\"</p></li>\n<li><p>Compared to the previous quarter, both analysts and management displayed heightened focus on the implications of the business model shift and more explicit discussion of trade-offs impacting near-term revenue.</p></li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li><p>The current quarter marks a sharper pivot toward pharma manufacturer solutions, now branded as Pharma Direct, with explicit guidance for at least 30% growth in that segment versus prior quarters where manufacturer solutions growth was highlighted but less central.</p></li>\n<li><p>Management’s tone this quarter is more focused on long-term strategic repositioning, openly discussing near-term revenue pressures in the legacy marketplace and subscription segments.</p></li>\n<li><p>Analysts shifted from questions about macro headwinds and policy tailwinds in Q3 to deeper scrutiny of margin trade-offs, the durability of new business lines, and the specifics of pharma partnerships in Q4.</p></li>\n<li><p>Key metrics such as Pharma Direct revenue and prescription transaction declines were more pronounced focal points this quarter, with explicit discussion of non-recurring impacts from Rite Aid and integrated savings programs.</p></li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li><p>Management cited the continued impact of the Rite Aid bankruptcy and lower volumes in integrated savings programs as significant headwinds.</p></li>\n<li><p>There are explicit concerns about near-term pressure on prescription transaction revenue due to renegotiated fee structures and the business model transition.</p></li>\n<li><p>Management outlined mitigation strategies, including investment in Pharma Direct, condition-specific subscriptions, and Employer Direct, to drive long-term growth and stabilize volumes.</p></li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>GoodRx leadership underscores that the company is navigating a deliberate transition toward pharma manufacturer solutions and subscription offerings, positioning these as durable long-term growth drivers amid changing pharmacy economics and consumer preferences. While near-term revenue and margin pressures are expected, management expresses confidence in the evolving strategy and the company's ability to leverage its scale, partnerships, and brand to deliver value across the healthcare ecosystem in 2026 and beyond.</p>\n<p><a href=\"https://seekingalpha.com/symbol/gdrx/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558127-goodrx-expects-pharma-direct-revenue-growth-of-at-least-30-percent-in-2026-amid-shift-to",
            "pub_date": "2026-02-27 04:20:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558109",
            "title": "Drax Group plc reports FY results",
            "description": "<html><body><ul>\n<li>Drax Group plc (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DRXGF\" title=\"Drax Group plc\">DRXGF</a></span>): FY Revenue of <span>Drax Group <span>£ </span></span>3.19B.</li>\n<li>Adj EBITDA of <span>£ 836M</span>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558109-drax-group-plc-reports-fy-results",
            "pub_date": "2026-02-27 04:15:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558124",
            "title": "Hellenic Telecommunications reports Q4 results",
            "description": "<html><body><ul><li>Hellenic Telecommunications (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/HLTOY\" title=\"Hellenic Telecommunications Organization S.A.\">HLTOY</a></span>): Q4 Revenue of <span>€</span>916.3M <span> </span>\n</li></ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558124-hellenic-telecommunications-reports-q4-results",
            "pub_date": "2026-02-27 04:15:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558108",
            "title": "HENSOLDT AG ADR reports FY results",
            "description": "<html><body><ul>\n<li>HENSOLDT AG ADR (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/HAGHY\" title=\"HENSOLDT AG ADR\">HAGHY</a></span>): FY Revenue of EUR 2.45M.</li>\n<li>\n<strong>Adjusted EBITDA<span> </span></strong>rises to EUR 452 million (previous year: EUR 405 million)</li>\n<li>\n<strong>Adjusted EBITDA margin<span> </span></strong>at 18.4% exceeds expectations (previous year: 18.1%)</li>\n<li>\n<strong>Adjusted free cash flow<span> </span></strong>grows significantly to EUR 347 million (previous year: EUR 249 million)</li>\n<li>\n<strong>Dividend<span> </span></strong>of EUR 0.55 per share proposed (previous year: EUR 0.50)</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558108-hensoldt-ag-adr-reports-fy-results",
            "pub_date": "2026-02-27 04:06:42",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558106",
            "title": "Tecnoglass outlines $1.06B–$1.13B 2026 revenue target while expanding vinyl and geographic footprint",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Tecnoglass Inc. (TGLS) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Jose Daes, CEO, reported record revenues of $984 million for 2025, crediting strength across business segments and market share gains. He stated, \"Our single family residential business delivered yet another record year with revenues growing to an all-time high of $403 million... Our multifamily and commercial businesses was similarly strong with revenues growing to $580 million on robust demand for our high-performance products.\" The CEO highlighted operational discipline, stating, \"Our team's ability to maintain our industry-leading margin profile through a unique challenging year... more than offset the impact of tariffs and increased raw material costs supporting a stable gross margin for the year.\" He announced the expansion of the share repurchase authorization by $100 million and projected another year of record revenue and value creation in 2026.</li>\n<li>Christian Daes, COO, emphasized double-digit revenue growth in multifamily and commercial business. He referred to the Continental Glass System acquisition, saying, \"Continental continues to integrate smoothly into our operation, enhancing our capabilities in high-end architectural glass and glazing...\" The COO noted the backlog reached a record $1.3 billion, with a book-to-bill ratio of 1.1x for 20 consecutive quarters, and highlighted the shift toward large high-end projects.</li>\n<li>Santiago Giraldo, CFO, commented, \"Total revenues for the fourth quarter increased 2.4% year-over-year to $245.3 million... Full year adjusted EBITDA reached $291.3 million, representing a margin of 29.6%.\" He explained, \"Our balance sheet remains solid with liquidity of approximately $465 million at year-end, including a cash position of approximately $100.9 million.\" Giraldo also announced that the Board approved the redomiciliation of the company from the Cayman Islands into the U.S., subject to shareholder approval, to achieve tax efficiencies and facilitate dividends.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management introduced a full year 2026 revenue outlook in the range of $1.06 billion to $1.13 billion, representing growth of approximately 11% at the midpoint. Adjusted EBITDA outlook is set at $265 million to $305 million. The high-end scenario assumes lower interest rates, improved affordability, market share gains, and a 10% reduction in aluminum input costs. The low scenario assumes no Fed rate cuts and flattish single-family revenues.</li>\n<li>CFO Giraldo stated, \"Both assumptions also bake in an incremental amount of installation revenue, in line with our previous discussions around the shift in backlog composition geared to larger projects.\"</li>\n<li>Capital expenditures for 2026 are projected to be $60 million to $75 million, with a potential $20 million to $25 million land purchase for a new U.S. facility not included in the current guidance.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Fourth quarter revenues were $245.3 million, reflecting 2.4% year-over-year growth. Full year revenue reached $983.6 million, up 10.5%. Adjusted EBITDA for the quarter was $62.2 million, with a margin of 25.4%.</li>\n<li>Gross margin for the full year was 42.8%, stable compared to the prior year. Fourth quarter gross margin was 40%, with CFO Giraldo citing \"unfavorable revenue mix,\" \"near all-time high U.S. aluminum costs,\" and \"a significant revaluation of the Colombian peso\" as key headwinds.</li>\n<li>Operating cash flow for the year was $135.8 million. Share repurchases totaled $118 million for the year, including $87.6 million in the fourth quarter.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Sam Darkatsh, Raymond James: Asked about Q1 expectations for sales, gross margin, and EBITDA. Giraldo replied, \"More or less in line with Q4. That's what we would expect.\"</li>\n<li>Darkatsh asked about 2026 margin expectations and tariffs. Giraldo answered, \"On the gross margin from the low to the high end, you have a 200 basis points of difference, from high 30s to low 40s... SG&amp;A, we expect it to go down in terms of percentage of our sales based on the fact that we will not incur aluminum tariffs as we did in 2025.\"</li>\n<li>Rohit Seth, B. Riley: Inquired about timing and extent of pricing actions. CEO Daes responded, \"We have to wait and see the reaction of the total market in order to raise our prices... in residential, our competition is struggling. So they have not raised their prices...\"</li>\n<li>Seth asked about vinyl product line sales. Giraldo said, \"We ended up with vinyl roughly around $10 million for the year. We expect that to increase at least 2.5, 3x for 2026...\"</li>\n<li>Timothy Wojs, Baird: Asked about commercial revenue acceleration in 2026. CEO Daes replied, \"Commercial is going to grow in '26 and '27... we are expanding our reach into other markets... to keep growing at a very big pace, double digits or more.\"</li>\n<li>Julio Romero, Sidoti: Queried showroom contributions. Giraldo stated, \"On the resi side for the showroom revenues, we ended up at about $10 million, and we're expecting to do $30 million to $35 million this year.\"</li>\n<li>Jean Paul Ramirez, D.A. Davidson: Asked about revenue cadence. Giraldo explained, \"Each sequential quarter is going to be incremental revenues as we move through the year... the first quarter is expected to be kind of more or less in line with Q4.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts appeared focused on macro headwinds, input cost pressures, and the ramp-up of new product lines, with a generally neutral to slightly positive tone and persistent requests for quantification and clarification.</li>\n<li>Management maintained a confident and optimistic tone, emphasizing resilience, market share gains, and expansion plans. CEO Daes expressed, \"We have done very well. The company is going to keep striving. We have a lot of plans of growth for '26, '27 and '28.\"</li>\n<li>Compared to the previous quarter, management's tone remained confident, though more detailed about headwinds and mitigation strategies. Analysts continued to probe for specifics, reflecting ongoing caution regarding costs and execution.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The 2026 revenue outlook was set higher than previous preliminary estimates, now explicitly guided at $1.06 billion to $1.13 billion. Adjusted EBITDA guidance narrowed slightly from the previous range.</li>\n<li>Share repurchase authorization expanded from $150 million to $250 million, with repurchases ramping up in Q4 2025.</li>\n<li>Management provided more granular detail on vinyl and showroom growth expectations, while reiterating the strategic shift toward large high-end projects and national geographic expansion.</li>\n<li>Analysts’ questions in both quarters focused on margin sustainability, input costs, and product line ramp-up. Management’s confidence in backlog conversion and growth has increased, with greater transparency on mitigation efforts for aluminum and FX headwinds.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management identified persistent cost pressures from aluminum and foreign exchange. Giraldo explained, \"Global aluminum spot rates spiked higher... U.S. Midwest aluminum premiums more than doubled during the year, creating industry-wide margin pressure.\"</li>\n<li>Tariffs and a stronger Colombian peso continued to impact margins, but management cited pricing actions and hedging strategies as mitigation.</li>\n<li>Analysts frequently probed about timing and magnitude of input cost relief, pricing power, and the execution risks tied to new product lines and geographic growth.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Tecnoglass management emphasized the company's ability to deliver record revenue and maintain strong margins despite significant macroeconomic headwinds in 2025. The outlook for 2026 includes ambitious revenue and EBITDA targets, supported by a record backlog, expanded product lines, and a larger national footprint. Capital allocation remains balanced between growth initiatives and shareholder returns, with a significant increase in buyback authorization and U.S. redomiciliation plans to enhance tax and dividend efficiencies. The company remains focused on mitigating input cost volatility and leveraging operational advantages to drive continued outperformance and shareholder value.</p>\n<p><a href=\"https://seekingalpha.com/symbol/tgls/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558106-tecnoglass-outlines-1_06b-1_13b-2026-revenue-target-while-expanding-vinyl-and-geographic",
            "pub_date": "2026-02-27 04:00:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558107",
            "title": "Ingevity outlines $4.08–$5.20 adjusted EPS guidance for 2026 while strengthening cash flow and share buybacks",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Ingevity Corporation (NGVT) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>David Li, President, CEO &amp; Director, highlighted the completion of the North Charleston CTO refinery and Industrial Specialties product line sale, stating this has “reduced our portfolio volatility, strengthened our profitability and cash flow profile and enhanced our strategic flexibility.”</li>\n<li>Li reported total company adjusted EBITDA growth of nearly 10% over 2024, with industry-leading margins above 30% and $274 million of free cash flow, “slightly exceeding our commitments.” The company used this cash to pay down debt and repurchase over 1 million shares, reducing leverage to 2.6x.</li>\n<li>Performance Materials maintained EBITDA margins above 50% and held revenue flat despite global auto production headwinds, with Li noting, “momentum from continued adoption of hybrids and fuel-efficient ICE vehicles is encouraging.”</li>\n<li>The CEO confirmed that Advanced Polymer Technologies (APT) and Road Markings are undergoing sale processes, with updates to be provided as they advance.</li>\n<li>Phillip Platt, Senior VP of Finance &amp; Chief Accounting Officer, stated: “Total company full year 2025 sales of $1.3 billion declined 8% compared to last year. Performance Materials sales remained flat versus 2024 despite lower auto production driven by industry volatility from tariffs and supply chain disruptions.”</li>\n<li>Platt added, “Adjusted gross profit of $556 million increased 6.8% year-over-year, with gross margin expanding by 610 basis points. Total adjusted EBITDA increased 10% year-over-year to $398 million, with margins expanding 500 basis points to 30.8%.”</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Ingevity expects 2026 adjusted EPS in the range of $4.08 to $5.20 and sales between $1.1 billion and $1.2 billion, with adjusted EBITDA between $380 million and $400 million. Li stated, “We expect 2026 adjusted EPS to be in the range of $4.08 and to $5.20 in a year where we do not expect meaningful recovery in the global economy.”</li>\n<li>Performance Materials sales are expected to grow low single digits with margins consistent with 2025. Sales in Performance Chemicals, including Road Markings, are expected to grow mid-single digits with EBITDA margins in the mid-teens. APT is projected for flat to low single-digit growth, with margins around 20%.</li>\n<li>CapEx guidance is $40 million to $60 million, and free cash flow is expected between $225 million and $250 million, excluding a $95 million litigation-related payment to BASF in the second quarter.</li>\n<li>The company targets $300 million in share repurchases through 2027 and plans to maintain net leverage within 2 to 2.5x.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Total company sales for 2025 were $1.3 billion, a decline of 8%. Adjusted gross profit was $556 million, and total adjusted EBITDA reached $398 million, with an adjusted EBITDA margin of 30.8%.</li>\n<li>Free cash flow of $274 million was the highest in five years, exceeding updated guidance and enabling $56 million in share repurchases. Net leverage improved to 2.6x.</li>\n<li>Performance Materials delivered $607 million in sales, with an EBITDA margin of 53.8%. Performance Chemicals’ combined segment EBITDA margin expanded to 13.5%, up from 4% last year, with a $45 million improvement in total segment EBITDA.</li>\n<li>APT sales declined 15% and EBITDA was 18% lower year-over-year; however, the segment maintained a 20% EBITDA margin due to operational discipline and favorable foreign exchange.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>John McNulty, BMO Capital Markets: Asked about asset sales progress and the impact on share buybacks. Li responded, “we’re encouraged by the interest shown in both assets…we’ll announce something before the end of the year.” Platt confirmed, “the outlook does not include any of the proceeds associated with the APT or the Road Markings potential sales. So we would expect to continue to execute those buybacks of $300 million over the next 2 years.”</li>\n<li>McNulty also queried stranded cost elimination. Platt answered, “we definitely have a clear line of sight to eliminate that $15 million by the end of the year…more so in the back end of the year than the front end.”</li>\n<li>Lee Jagoda, CJS Securities: Asked about auto production assumptions and seasonality for Performance Materials. Li indicated, “we see it as a very resilient market…for 2026, what we’ve kind of baked in is a pretty stable environment.”</li>\n<li>Jagoda also inquired about filtration market expansion. Li explained, “The filtration aspect is built into our guidance, but it’s a pretty small base right now.”</li>\n<li>Daniel Rizzo, Jefferies: Sought margin outlook for the segments. Li reiterated Performance Materials margins “north of 50%,” and Performance Chemicals margins “higher teens or 18%.” Platt confirmed that about 90% of annual EBITDA for Pavement and Road Markings will be recognized in Q2 and Q3.</li>\n<li>Michael Sison, Wells Fargo: Asked about technical edge in filtration. Li described hardwood-based activated carbon’s unique separation properties and planned focus on “water, pharma and food and beverage.”</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed for clarity around asset sales, margin sustainability, and the impact of supply chain challenges, reflecting a neutral to slightly positive tone with interest in strategic execution and capital return.</li>\n<li>Management maintained a confident and optimistic stance in both prepared remarks and Q&amp;A, using phrases such as “we are encouraged,” “have a clear line of sight,” and “expect to maintain that.”</li>\n<li>Compared to the previous quarter, management’s tone has shifted to greater confidence and clarity, especially following portfolio optimization and strong cash flow generation, while analysts remained focused on operational execution and capital allocation.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter emphasized successful completion of the Industrial Specialties divestiture, stronger free cash flow, and reduced leverage, compared to the previous quarter’s focus on pending divestitures and ongoing portfolio review.</li>\n<li>Guidance is more specific and optimistic for 2026, supported by robust capital returns and a strong balance sheet.</li>\n<li>Analysts’ questions this quarter concentrated on asset sale progress, the trajectory of stranded cost elimination, and segment margin durability, shifting from the prior quarter’s attention to uncertainty around supply chains and divestiture impacts.</li>\n<li>Management’s confidence in maintaining and potentially growing margins in core businesses is more pronounced, while analysts continued to probe for risks around execution.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Ongoing tariff uncertainty, weak end market demand in APT, and competitive pressures in China were cited as key challenges.</li>\n<li>Management is mitigating volatility through portfolio simplification, cost reduction, and commercial discipline in at-risk segments.</li>\n<li>Seasonality in Pavement Technologies and Road Markings will become more pronounced after the divestiture of Industrial Specialties, with 90% of segment EBITDA expected in Q2 and Q3.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Ingevity’s leadership affirmed a streamlined portfolio and a focus on cash generation, capital returns, and operational discipline. With the sale of Industrial Specialties complete and asset sales for APT and Road Markings progressing, the company enters 2026 with confidence in its guidance, targets for continued margin strength, and a commitment to returning value to shareholders through disciplined buybacks and debt reduction.</p>\n<p><a href=\"https://seekingalpha.com/symbol/ngvt/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558107-ingevity-outlines-4_08-5_20-adjusted-eps-guidance-for-2026-while-strengthening-cash-flow-and",
            "pub_date": "2026-02-27 04:00:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558099",
            "title": "eDreams ODIGEO S.A. reports 9M results",
            "description": "<html><body><ul>\n<li>eDreams ODIGEO S.A. <a href=\"https://seekingalpha.com/pr/20414681-edreams-odigeo-grows-net-income-tenfold-to-40_3-million-as-prime-reaches-7_8-million-members\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EDDRF\" title=\"eDreams ODIGEO S.A.\">EDDRF</a></span>): 9M Revenue of <span>€</span>502.8M.</li>\n<li><span>eDO is on track to meet or exceed its FY26 targets of 7.9 million members, €172.9 million in Adjusted EBITDA, and €155 million in Cash EBITDA. Looking ahead, eDO projects accelerating growth, targeting a 15-20% annual increase in Prime membership between FY27 and FY30</span></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558099-edreams-odigeo-sa-reports-9m-results",
            "pub_date": "2026-02-27 03:56:07",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558100",
            "title": "Piraeus Bank S.A. reports FY results",
            "description": "<html><body><ul>\n<li>Piraeus Bank S.A. <a href=\"https://seekingalpha.com/pr/20414758-piraeus-bank-s-a-full-year-2025-financial-results\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BPIRY\" title=\"Piraeus Bank S.A.\">BPIRY</a></span>): FY  €0.7bn revenues from services | Best-in-class in<span> </span><span>Greece</span>; 0.82% fees over assets, 26% revenues from services out of total revenues</li>\n<li>€2.7bn net revenues | Revenues from services up 7%; NII up qoq, marking prior quarter as the trough</li>\n<li>52bps organic CoR | NPE ratio at 2.0%, NPE coverage at 73% vs 65% a year ago</li>\n<li>+27% AuM yoy | €14.5bn AuM; €1.5bn net inflows in 2025; deposits at €66bn, up €3.2bn, +5% yoy, funding 90% of credit expansion</li>\n<li>18.7% total capital ratio | Buffer of c.275bps above P2G, CET1 ratio at 12.7%; MREL at 29.0% with c.165bps buffer above requirement</li>\n<li>€0.82 EPS after AT1 coupon | Exceeding guidance of €0.80 for the year, fully absorbing the fast decumulation of base rates</li>\n<li>€40c per share cash dividend | On top of €100mn share buyback executed in Q4; €592mn total distribution out of 2025, 7% total yield</li>\n<li>€3.9bn net credit expansion |<span> </span><span>Europe</span>-leading +11% loan growth yoy, with pricing discipline maintained; €0.3bn net credit expansion in retail</li>\n<li>33% cost-to-core income ratio | Best-in-class efficiency ratio confirming cost discipline, despite inflation and ongoing investments</li>\n<li> </li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558100-piraeus-bank-s-a-reports-fy-results",
            "pub_date": "2026-02-27 03:56:07",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558089",
            "title": "Bookstore chains Barnes & Noble and Waterstones are one step closer to an IPO",
            "description": "<html><body><p data-eci=\"true\">Bookstore chains Barnes &amp; Noble and Waterstones are closer to being part of an IPO, according to Bloomberg. Owner Elliott Management has invited investment banks to pitch for roles on an initial public offering in London of the book retailers. Sources indicate that a U.S. listing is still a possibility as well.</p>\n<p>Barnes &amp; Noble's retail comeback is one of the most surprising turnarounds in the retail sector, as the chain defied predictions that physical bookstores were destined for extinction. Just 25 years ago, the company seemed headed for the same fate as Borders, Book World, BookPeople, WaldenBooks, and B. Dalton after closing locations due to the rise of Amazon (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>) and e-commerce book buying. While Barnes &amp; Noble survived, for years the company cycled through CEOs and struggled to find its identity.</p>\n<p>The turning point came in 2019 when Elliott Advisors acquired Barnes &amp; Noble and brought in James Daunt. The chain reverted to its bookstore roots, and Daunt gave individual store managers unprecedented autonomy to curate their inventory based on local tastes. Barnes &amp; Noble also became a more inviting space to relax or hold a small meeting during the same period that certain Starbucks (<a href=\"https://seekingalpha.com/symbol/SBUX\" title=\"Starbucks Corporation\">SBUX</a>) and Panera (<a href=\"https://seekingalpha.com/symbol/PANERA\" title=\"Panera Bread Company\">PANERA</a>) started to resemble a mosh pit of pick-up orders. Barnes &amp; Noble has also benefited from the BookTok phenomenon on TikTok (<a href=\"https://seekingalpha.com/symbol/TIKTOK\" title=\"TikTok\">TIKTOK</a>), as the social media movement made book buying feel participatory and social rather than solitary.</p>\n<p>After bottoming out around 600 stores, Barnes &amp; Noble opened approximately 30 new stores in 2023, 61 in 2024, and 67 in 2025. Notably, Waterstones is adding bookstores as well, with some of the same factors in play.</p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558089-bookstore-chains-barnes-and-noble-and-waterstones-are-one-step-closer-to-an-ipo",
            "pub_date": "2026-02-27 03:40:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}