{
    "data": [
        {
            "id": "4558004",
            "title": "Nexstar outlines $1.95B–$2.05B adjusted EBITDA target for 2026 with digital revenue set to surpass national TV advertising",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Nexstar Media Group (NXST) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Perry Sook, Founder, Chairman &amp; CEO, highlighted the company's execution on strategic priorities, stating, \"We delivered on all key operational priorities in 2025, including successfully reviewing and renewing distribution agreements representing over 60% of our subscriber base, further elevating The CW and NewsNation to top-tier networks, extending our affiliation agreements with both ABC and MyNetworkTV and pursuing regulatory reform through our landmark agreement to acquire TEGNA.\" Sook emphasized the progress on the TEGNA acquisition, indicating all regulatory filings were submitted and responses provided, with expectations for closing by the end of Q2 2026. He also pointed to the strength of Nexstar’s sports-focused strategy, noting, \"The CW finished the year as the tenth most watched ad-supported network and the second fastest-growing network overall, delivering a 19% year-over-year increase in viewership. In 2025, we improved the network's cash flow by an impressive 32%.\" Sook indicated profitability for The CW is expected by Q4 2026.</li>\n<li>Sook underscored digital growth, stating digital revenue grew high single digits in 2025 and is expected to surpass national advertising revenue in 2026. Top priorities for 2026 are \"digital optimization and expense rationalization.\"</li>\n<li>Executive VP &amp; CFO Lee Gliha provided guidance: \"We believe Nexstar's stand-alone 2026 adjusted EBITDA will be in the range of $1.95 billion to $2.05 billion.\" Gliha outlined expectations for continued distribution revenue growth, a low double-digit market share of broadcast political advertising, and further cost reductions. She also stated, \"We expect The CW will continue to reduce its losses by another 30% in 2026 from 2025 levels and achieve profitability in the fourth quarter.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Nexstar projects 2026 adjusted EBITDA in the $1.95 billion to $2.05 billion range.</li>\n<li>Distribution revenue growth is expected to be in the low single digits on a gross basis and mid-single digits on a net basis for 2026, with about 30% of subscribers up for renewal this year. Gliha stated, \"our expectation for gross and net distribution revenue growth to be up low and mid-single digits, respectively.\"</li>\n<li>Political advertising is projected to account for a low double-digit share of the $5.28 billion in total broadcast political advertising spend for the 2025–2026 election cycle.</li>\n<li>Digital revenue is forecast to surpass national advertising revenue, marking a strategic milestone.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Fourth quarter net revenue was $1.29 billion, with a 13.4% decline compared to the prior year, primarily due to a reduction in political advertising, according to President &amp; COO Michael Biard.</li>\n<li>Distribution revenue for Q4 was $720 million, up $6 million or 0.8% year-over-year.</li>\n<li>Advertising revenue for the quarter was $549 million, including $21 million in political advertising; nonpolitical advertising increased 4.5% year-over-year.</li>\n<li>Combined Q4 direct operating and SG&amp;A expenses decreased by $7 million or 0.9% year-over-year.</li>\n<li>Adjusted EBITDA for Q4 was $433 million, representing a 33.6% margin; adjusted free cash flow was $214 million.</li>\n<li>Year-end cash balance was $280 million, and outstanding debt was $6.3 billion with a first lien covenant ratio of 1.71x.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Daniel Kurnos, The Benchmark Company, LLC, Research Division, asked about regulatory timing and AI-driven expense reduction. Sook responded, \"the FCC shot clock would technically expire on June 1 of this year. So we remain consistent in our belief that the transaction will close before the end of second quarter.\" Gliha added, \"this will be a good year for us because we do expect our digital revenue to eclipse our national television advertising revenue.\"</li>\n<li>Benjamin Soff, Deutsche Bank, inquired about regulatory surprises and DOJ views. Sook noted, \"we continue to engage vigorously with the DOJ…if there are any divestitures, they would be de minimis to the overall value of the deal.\"</li>\n<li>Aaron Watts, Deutsche Bank, asked about leverage post-TEGNA. Gliha: \"Not really, no.\" Watts also questioned programmatic ad sales, to which Sook explained the integration of TEGNA's Premion platform and ongoing development of a seamless programmatic linear solution.</li>\n<li>Patrick Sholl, Barrington Research, sought details on ad categories. Gliha highlighted auto as the largest declining category, offset by digital growth, and noted improvement in auto trends into Q1. No significant impact from tariffs was observed.</li>\n<li>Craig Huber, Huber Research Partners, LLC, asked about AI. Biard described AI tools in newsrooms for workflow efficiencies and ongoing deployment in sales prospecting.</li>\n<li>Steven Cahall, Wells Fargo, questioned DOJ sentiment and digital synergies. Sook: \"we have provided reams of information to DOJ…we, at this point, have not had any definitive feedback.\"</li>\n<li>Jason Bazinet, Citi, asked about digital revenue definitions. Gliha clarified the distinction between CW network national advertising and other national advertising at local stations.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts exhibited a neutral to slightly positive tone, focusing on regulatory clarity, expense controls, and digital monetization. Questions centered on deal timing, leverage, and ad trends.</li>\n<li>Management maintained a confident and optimistic tone in both prepared remarks and Q&amp;A, consistently emphasizing progress on strategic goals and regulatory processes. Sook and Gliha repeatedly referenced confidence in closing the TEGNA deal and driving revenue growth, with Sook stating, \"we are energized by the significant prospects before us.\"</li>\n<li>Compared to the prior quarter, analyst tone remained focused on regulatory and advertising trends, with management showing increased confidence in digital and expense initiatives.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter introduced explicit 2026 adjusted EBITDA guidance and a milestone expectation for digital revenue to surpass national advertising, which were not specifically outlined in the previous quarter.</li>\n<li>Management's tone shifted to greater emphasis on digital optimization and cost rationalization.</li>\n<li>Analysts' questions continued to focus on regulatory developments and advertising, but with increased scrutiny on AI, digital, and integration synergies.</li>\n<li>The CW's performance was highlighted with higher cash flow growth and a path to profitability, an evolution from the prior quarter's focus on reducing losses.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Regulatory approval of the TEGNA acquisition and potential for required divestitures, though management expects any divestitures to be minimal.</li>\n<li>Continued subscriber attrition in pay TV, though trends are stabilizing.</li>\n<li>Political advertising displacement effect on nonpolitical advertising revenue in the back half of 2026.</li>\n<li>AI search headwinds impacting digital revenue, though offset by strong local digital performance.</li>\n<li>Dependence on macroeconomic conditions affecting advertising categories, particularly auto.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Nexstar’s leadership emphasized strong execution on operational priorities, a robust outlook for digital and political advertising, and disciplined expense management. The company remains on track to close the TEGNA acquisition by the end of Q2 2026 and projects 2026 adjusted EBITDA of $1.95 billion to $2.05 billion. Management expects digital revenue to surpass national TV advertising for the first time, while The CW is forecast to achieve profitability by year-end. The focus remains on digital optimization, expense rationalization, and leveraging the scale and synergies from the pending TEGNA acquisition to deliver shareholder value.</p>\n<p><a href=\"https://seekingalpha.com/symbol/nxst/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558004-nexstar-outlines-1_95b-2_05b-adjusted-ebitda-target-for-2026-with-digital-revenue-set-to",
            "pub_date": "2026-02-27 01:30:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557973",
            "title": "Sigma Lithium extends decline amid Blue Orca short call",
            "description": "<html><body><ul>\n<li>Sigma Lithium (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SGML\" title=\"Sigma Lithium Corporation\">SGML</a></span>) dropped 13% amid a short report from Blue Orca. </li>\n<li>Blue Orca disclosed that it's short shares of Sigma Lithium (<a href=\"https://seekingalpha.com/symbol/SGML\" title=\"Sigma Lithium Corporation\">SGML</a>).</li>\n<li>Sigma Lithium didn't immediately respond to Seeking Alpha's email request for comment.</li>\n<li>Sigma Lithium (<a href=\"https://seekingalpha.com/symbol/SGML\" title=\"Sigma Lithium Corporation\">SGML</a>) has <a href=\"https://seekingalpha.com/symbol/SGML\" target=\"_blank\" title=\"short interest of 8.4%.\">short interest of 8.4%.</a>\n</li>\n</ul>\n<p data-eci=\"true\"> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557973-sigma-lithium-extends-decline-amid-blue-orca-short-call",
            "pub_date": "2026-02-27 01:30:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557993",
            "title": "Clariant AG reports Q4 results",
            "description": "<html><body><ul>\n<li>Clariant AG (CLZNF): Q4 sales increased by 1% in local currencies to CHF 1.028 billion.</li>\n<li>EBITDA margin before exceptional items increased by 240 basis points to 17.1%.</li>\n<li>Outlook 2026: local currency sales to be around flat; EBITDA margin before exceptional items at around 18%; medium-term targets confirmed.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557993-clariant-ag-reports-q4-results",
            "pub_date": "2026-02-27 01:25:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557995",
            "title": "Viridien Société anonyme reports FY results",
            "description": "<html><body><ul>\n<li>Viridien Société anonyme <a href=\"https://s203.q4cdn.com/882900163/files/doc_financials/2025/q4/Vusion_FY_2025_Results_Slides.pdf\" rel=\"nofollow\" target=\"_blank\">press release</a>  (VIRDY): FY</li>\n<li>Revenue of €1.53B (+51.5% Y/Y).</li>\n<li>EBITDA and net loss came in at €277.4 million and €14.5 million, respectively.</li>\n</ul>\n<p data-eci=\"true\"><strong>Outlook 2026</strong></p>\n<ul>\n<li>+15 to +20% Group Adjusted Revenue growth expected in FY 2026 at constant Forex and Tariffs</li>\n<li>VAS Revenue to grow 2x faster than total Group Revenue</li>\n<li>Profitability improvement with adjusted EBITDA margin1 growing by more than 100 bps</li>\n<li>Continued positive operating free cash-flow generation</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557995-viridien-societe-anonyme-reports-fy-results",
            "pub_date": "2026-02-27 01:25:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557979",
            "title": "CLP Holdings Limited reports FY results",
            "description": "<html><body><ul>\n<li>CLP Holdings Limited <a href=\"https://www.clpgroup.com/content/dam/clp-group/channels/investor/document/3-4-announcements-circulars/2026/e_Results%20Announcement_20260226_final_1137.pdf.coredownload.pdf\" rel=\"nofollow\" target=\"_blank\">press release</a>  (CLPHY): FY total earnings decreased to HK$10,468 million.</li>\n<li>Consolidated revenue decreased 3.2% to HK$88,018 million.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557979-clp-holdings-limited-reports-fy-results",
            "pub_date": "2026-02-27 01:16:47",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557960",
            "title": "Walmart settles with FTC over Spark driver pay practices",
            "description": "<html><body><p data-eci=\"true\">Walmart (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/WMT\" title=\"Walmart Inc.\">WMT</a></span></span>) has agreed to pay $100M to settle charges with the U.S. Federal Trade Commission over deceptive practices tied to its Spark Driver delivery service.</p>\n<p>The FTC and 11 states accused the retail giant of misleading Spark delivery drivers as to the amount of money they would receive for deliveries, including tips, misrepresenting incentive pay drivers would receive for completing certain tasks, and deceiving customers that 100% of tips go directly to the driver. </p>\n<p>The FTC claimed that these practices violated the FTC Act and the Gramm-Leach-Bliley Act—by obtaining drivers’ bank and other financial information while deceiving them about the amount of base pay and tips they will earn from Spark Driver deliveries—as well as laws of the agency’s state partners.</p>\n<p><a href=\"https://www.ftc.gov/news-events/news/press-releases/2026/02/walmart-agrees-100-million-judgment-settle-ftc-states-charges-over-deceptive-earnings-claims-related\" rel=\"nofollow\" target=\"_blank\" title=\"In addition to a $100M settlemen\">In addition to a $100M settlemen</a>t, Walmart (<a href=\"https://seekingalpha.com/symbol/WMT\" title=\"Walmart Inc.\">WMT</a>) is required to ensure drivers are paid the promised earnings and tips; prohibited from modifying an order for base pay, incentive pay, or tips after the initial order is placed unless undelivered or canceled by a customer; and banned from misrepresenting the earnings information included in the delivery order.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557960-walmart-settles-with-ftc-over-spark-driver-pay-practices",
            "pub_date": "2026-02-27 01:16:47",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557976",
            "title": "Cactus signals $295M–$305M Q1 pressure control revenue outlook while expanding international footprint",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Cactus, Inc. (WHD) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Scott Bender, CEO &amp; Chairman, reported “strong performance in both segments,” noting Pressure Control revenues and margins exceeded expectations and Spoolable Technologies “declined seasonally as expected, but maintained strong profitability.” He highlighted total Q4 revenue of $261 million, adjusted EBITDA of $85 million, adjusted EBITDA margin of 32.7%, a quarterly dividend of $0.14 per share, and a cash balance of $495 million. Bender also announced the closing of the Baker Hughes Surface Pressure Control acquisition, now branded as Cactus International, on January 1.</li>\n<li>Jay Nutt, CFO, stated, “total Q4 revenues were $261 million, which were lower 1% sequentially. Total adjusted EBITDA of $85 million was down 1.7% sequentially.” He attributed Pressure Control segment revenue growth to “higher levels of products sold per rig” and improved rental revenues. “We believe our U.S. Pressure Control business is performing at its highest level, since the inception of the company.” Nutt also explained, “corporate and Other expenses were $9.7 million in Q4, up $700,000 sequentially due to increased transaction and integration costs.”</li>\n<li>Bender confirmed that Steve Tadlock has been appointed CEO of Cactus International, citing his successful leadership of FlexSteel and integration expertise.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Bender outlined that “during the first quarter, we expect total Pressure Control revenue to be approximately $295 million to $305 million.” He described North American drilling and completion activity as “stable,” with international sales contributing approximately $130 million to $140 million. Adjusted EBITDA margins for Pressure Control are expected at “23% to 25% for the first quarter.”</li>\n<li>For Spoolable Technologies, “we expect first quarter revenue to be down mid-single digits relative to the fourth quarter,” with adjusted EBITDA margins anticipated at “33% to 35% in Q1.” He noted the introduction of “several new SKUs” and pilots with a large Mid-East customer in 2026.</li>\n<li>Bender acknowledged the “near-term outlook for domestic and international markets remains soft,” but emphasized continued focus on margins and returns.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Nutt reported Pressure Control segment revenues at $178 million, “up 5.8% sequentially,” and Spoolable Technologies revenues at $84 million, “declined 11.6% sequentially.” Operating income for Pressure Control increased $4.1 million, with margins expanding 90 basis points. Spoolable Technologies operating income decreased $4.9 million, margins compressing 220 basis points.</li>\n<li>GAAP net income was $48 million, compared to $50 million in Q3. Adjusted net income and EPS were $52 million and $0.65 per share, respectively, versus $54 million and $0.67 in the prior quarter. The company ended the quarter with a cash balance of $495 million, including $371 million in escrow for the Baker SPC acquisition. Net CapEx for Q4 was approximately $4 million.</li>\n<li>Nutt guided full year 2026 net CapEx expectations in the range of $40 million to $50 million, “including our investments at Cactus International.”</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Stephen Gengaro, Stifel: Asked about margin progression for Cactus International. Bender responded, “we're going to see very, very meaningful supply chain savings as we begin to use our own supply chain… we won't begin to see that margin enhancement until 2027, at which time I think it will be fairly substantial.” He added optimism about exceeding synergy projections for 2026.</li>\n<li>Gengaro: Inquired about U.S. rig count progression. Bender stated, “most analysts are around $510 million exiting 2026, from $530 million… My personal opinion is we're going to be in the range of probably $490 million because we have yet to see the full impact of consolidation.” He expressed caution regarding oil price volatility driven by geopolitical factors.</li>\n<li>Scott Gruber, Citigroup: Questioned international growth prospects. Bender described greater growth opportunities in the Middle East, “particularly in Saudi with some de-stocking,” and predicted improved order activity in 2027. He highlighted opportunities for market share gain in Saudi Arabia and new revenue from Sub-Saharan Africa and the Far East.</li>\n<li>Derek Podhaizer, Piper Sandler: Asked about aftermarket services. Bender replied, “Legacy Vetco Gray has a huge installed base… we're undergoing an extensive exercise into identifying where Vetco Gray had the largest installed base… it's the highest margin part of the business, but we see very substantial opportunities.”</li>\n<li>Donald Crist, Johnson Rice: Sought updates on Vietnam operations. Bender said, “Vietnam is going to be… about 25% percentage points lower than the tariffs out of China,” and confirmed API certification is in process. Joel Bender, President, added, “another 30 to 60 days before we actually have the monogram.”</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed for clarity on margin progression, international growth, and tariff mitigation, signaling a slightly positive but cautious sentiment, particularly regarding near-term market softness and timing of synergy realization.</li>\n<li>Management maintained a confident tone during prepared remarks and Q&amp;A, with Bender expressing optimism about synergy attainment and share gains, though also noting “the near-term outlook… remains soft.” Phrases like “we're going to see very, very meaningful supply chain savings” and “I'm very optimistic that we'll exceed our projected synergies” reflect forward-looking confidence.</li>\n<li>Compared to the previous quarter, management’s confidence has increased regarding the integration of Cactus International and future margin opportunities, while analysts’ tone remains consistent, seeking specific details on execution and market trends.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance language shifted to include the newly acquired Cactus International business, with explicit revenue and margin targets for Q1 2026. Previously, management emphasized tariff mitigation and cost controls; now, the focus includes capturing synergies and international market share.</li>\n<li>The addition of Cactus International and the appointment of Steve Tadlock as CEO mark a strategic shift toward global expansion and supply chain integration.</li>\n<li>Financial results for Q4 show a small sequential decline in revenue and EBITDA, but with continued strong margins. The company reported a higher cash balance and reiterated disciplined CapEx.</li>\n<li>Analyst focus expanded from domestic market softness and tariffs in Q3 to integration progress, international growth, and supply chain-driven margin expansion in Q4. Management’s tone showed increased optimism about the long-term benefits of the acquisition and supply chain initiatives.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Bender highlighted continued uncertainty in oil prices due to geopolitical factors, stating, “that lack of perhaps clarity on that subject makes me nervous.”</li>\n<li>The near-term outlook for both domestic and international markets is described as “soft,” with expected seasonal declines in North American activity and ongoing order slowdowns in the Middle East.</li>\n<li>Analysts raised concerns about the timing of margin improvements at Cactus International and the pace of market share gains, as well as the impact of tariffs and API certification delays in Vietnam.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Management emphasized a strong finish to 2025, underpinned by resilient Pressure Control performance, disciplined cost management, and the completion of the Cactus International acquisition. While short-term market conditions remain challenging, the company is focused on extracting synergies, expanding international market share, and leveraging supply chain efficiencies to drive future margin improvement. The integration of Cactus International and the ramp-up of new SKUs and geographic expansion are expected to position the company for growth as market activity recovers.</p>\n<p><a href=\"https://seekingalpha.com/symbol/whd/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557976-cactus-signals-295m-305m-q1-pressure-control-revenue-outlook-while-expanding-international",
            "pub_date": "2026-02-27 01:10:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557977",
            "title": "J. M. Smucker signals mid-20s coffee margin and Hostess stabilization amid portfolio realignment",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: The J. M. Smucker Company (SJM) Q3 2026</p>\n<h3>Management View</h3>\n<ul>\n<li>Mark Smucker, CEO, reported constructive engagement with Elliott, stating, \"The engagement with Elliott is recent and has actually been very constructive. We've had a number of meetings with the folks there. And largely, what they see is what many of you already know, we're a great company with strong brands.\" He highlighted alignment on operating improvements, profit restoration, organic growth, disciplined capital allocation, and further Board evolution, referencing the recent additions of Bruce Chung and David Singer.</li>\n<li>Smucker outlined a focus on stabilizing the Hostess and Sweet Baked Snacks brands, including SKU rationalization and emphasis on core products such as cupcakes, Twinkies, and Donettes. He added, \"We did take an updated assumption of 2% growth trajectory going forward, but we are continuing at this time just to stabilize the business.\"</li>\n<li>On portfolio management, Smucker reiterated, \"We've been very consistent over the years in making sure that all of our shareholders understand that we always are reviewing our portfolio. We really like our portfolio because of the diversity, obviously, pet and coffee and then food and snacking.\"</li>\n<li>CFO Tucker Marshall stated, \"Historically, we've used proceeds from divestiture activity to either pay down debt or to repurchase shares. As we continue on our path to 3x leverage or below by the end of next fiscal year, that enables the opportunity to consider share repurchases again.\"</li>\n<li>Marshall added on coffee, \"Deflation benefits both the absolute profit dollar and the profit margin percentage. And additionally, we will be lapping the impact of tariffs. And so we would anticipate profit and margin improvement as we move forward. And in the fourth quarter of this fiscal year, we would expect a mid-20s segment profit margin.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>The company maintained a prudent approach to EPS guidance, with Marshall explaining, \"We feel very confident in achieving the $9 midpoint. And any upside would largely come through your coffee portfolio. But candidly, the coffee portfolio is covering softness that we're experiencing in our Sweet Baked Snacks portfolio.\"</li>\n<li>Guidance for Sweet Baked Snacks assumes a 2% long-term growth trajectory, with a focus on stabilization and operational improvement.</li>\n<li>Marshall described fourth-quarter expectations for the Sweet Baked Snacks segment as \"softer... just as it relates to some of the category trends that it's navigating, but also as it overcomes a temporary disruption associated with a plant or manufacturing fire.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>No explicit revenue or EPS figures were disclosed during the call.</li>\n<li>The CFO discussed cost efficiencies, noting, \"We just had some savings and timing in our third quarter. Again, that supported the overdelivery in EPS.\"</li>\n<li>Amortization for the full year is now set at $210 million, including a step-up for the Hostess trademark beginning in the fourth quarter.</li>\n<li>The company has completed the closure of the Indianapolis facility, which is expected to improve profitability in Sweet Baked Snacks going forward.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Andrew Lazar, Barclays: Asked about engagement with Elliott and portfolio optimization. Smucker responded by emphasizing alignment on operating improvements and governance, as well as confidence in the board and management team.</li>\n<li>Peter Galbo, BofA Securities: Inquired about the impact of recent board additions and M&amp;A expertise. Smucker noted ongoing portfolio review and the diversity advantage. Galbo also asked about coffee margin improvement amid cost deflation. Marshall explained the benefit of deflation and anticipated mid-20s margin in Q4.</li>\n<li>Peter Grom, UBS: Queried about the Sweet Baked Snacks top line trajectory and coffee retail inventory. Marshall explained stabilization efforts and noted that the company has not seen abnormalities in coffee inventories.</li>\n<li>Robert Moskow, TD Cowen: Asked about ground coffee versus pods pricing strategy and talent needs for Hostess. Marshall and Smucker discussed margin implications and confidence in the Hostess team despite recent departures.</li>\n<li>Thomas Palmer, JPMorgan: Probed on incremental weakness in Sweet Baked Snacks and coffee tariff headwinds. Marshall cited higher bakery network costs and top line softness, and clarified the $75 million unmitigated tariff impact.</li>\n<li>Christopher Carey, Wells Fargo: Asked about Sweet Baked Snacks sales versus consumption and Pet segment performance. Marshall pointed to timing and operational factors, while Smucker highlighted Milk-Bone and Meow Mix growth.</li>\n<li>Max Gumport, BNP Paribas: Inquired about Sweet Baked Snacks margin normalization and Uncrustables growth. Marshall deferred specifics until the next quarter, and Smucker emphasized Uncrustables' continued expansion.</li>\n<li>Megan Alexander, Morgan Stanley: Sought clarity on EPS guidance width and SG&amp;A efficiency. Marshall cited prudence and confidence in the $9 midpoint, with SG&amp;A efficiencies driving savings.</li>\n<li>Alexia Howard, Bernstein: Asked about marketing spend trends and innovation pace. Marshall noted timing-driven savings, while Smucker confirmed innovation is \"in line, for sure.\"</li>\n<li>Scott Marks, Jefferies: Asked about dog snack category rebound and Uncrustables distribution runway. Smucker discussed premiumization trends and broad retail coverage for Uncrustables.</li>\n<li>Stephen Powers, Deutsche Bank: Sought explanation for amortizing the Hostess trademark. Marshall attributed the change to reduced long-term growth expectations for the brand.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts expressed concern over Sweet Baked Snacks softness, EPS guidance width, and operational disruptions, often probing for specifics on improvement timelines and margin outlook. The tone was slightly negative with persistent questions on risk mitigation and clarity.</li>\n<li>Management maintained a measured, confident stance, frequently using language such as \"very confident\" and \"we believe,\" but also showed prudence and emphasized stabilization and operational improvements, especially regarding Hostess and Sweet Baked Snacks.</li>\n<li>Compared to the previous quarter, management's tone shifted from optimism about sequential improvements to a more cautious, stabilization-focused approach, while analysts became more persistent on risk areas, particularly Sweet Baked Snacks and profit restoration.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter saw a more defensive tone from management, particularly on Sweet Baked Snacks, shifting from anticipated sequential improvement to a focus on stabilization and cost management. The previous quarter featured bolder expectations for growth and margin recovery.</li>\n<li>Guidance language was more cautious, with emphasis on prudence and midpoints, while analysts increased focus on risk areas and operational disruptions, reflecting heightened skepticism.</li>\n<li>Portfolio optimization and the impact of Elliott's engagement became prominent themes this quarter, as did the Board's evolution and capital allocation discipline.</li>\n<li>Key metric discussions moved from projections of acceleration to explanations of softness, especially around Sweet Baked Snacks and operational headwinds.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management acknowledged risks tied to Sweet Baked Snacks performance, citing \"category trends,\" \"operational challenges,\" and the \"plant or manufacturing fire.\"</li>\n<li>The $75 million unmitigated tariff impact was highlighted as a factor being lapped in the upcoming year.</li>\n<li>The company is addressing cost pressures, operational disruptions, and strategic talent needs within key brands.</li>\n<li>Analysts continued to express concern around guidance width, operational execution, and the pace of recovery in challenged segments.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>J. M. Smucker's third quarter emphasized stabilization across Sweet Baked Snacks, ongoing engagement with Elliott, and further Board evolution, all while maintaining a disciplined approach to capital allocation. The company anticipates margin improvement in coffee, a cautious approach to EPS guidance, and continued investment in core brands like Uncrustables and Milk-Bone. Operational challenges and cost pressures remain focal points, but management expressed confidence in the strategy and leadership team to drive long-term shareholder value.</p>\n<p><a href=\"https://seekingalpha.com/symbol/sjm/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557977-j-m-smucker-signals-midminus-20s-coffee-margin-and-hostess-stabilization-amid-portfolio",
            "pub_date": "2026-02-27 01:10:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557970",
            "title": "Boeing lifts Africa aircraft demand forecast by 40% on strong economic growth",
            "description": "<html><body><p data-eci=\"true\">Boeing Africa (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BA\" title=\"The Boeing Company\">BA</a></span>) significantly raised its long-term aircraft demand outlook for the continent, citing accelerating economic growth and rising air travel across the region.</p>\n<p>The company now projects that African carriers will require about 1,700 new aircraft over the next 20 years, up from a forecast of 1,200 planes issued last year and 1,000 projected three years ago. The updated estimate was shared Thursday in Nairobi by Managing Director Henok Teferra Shawl.</p>\n<p>Narrowbody jets are expected to make up roughly two-thirds of future deliveries as airlines expand short- and medium-haul routes.</p>\n<p>Economic momentum in Sub-Saharan Africa is expected to outpace the global average this year. The International Monetary Fund forecasts the region’s output will rise 4.6% compared with 3.3% worldwide.</p>\n<p>Boeing (<a href=\"https://seekingalpha.com/symbol/BA\" title=\"The Boeing Company\">BA</a>) said passenger volumes in Africa are projected to increase about 6% annually over the coming years, supported by demographic trends such as a youthful population, an expanding middle class, ongoing urbanization and continued investment in airport infrastructure.</p>\n<p>Boeing (<a href=\"https://seekingalpha.com/symbol/BA\" title=\"The Boeing Company\">BA</a>) currently holds an estimated 70% share of the African aircraft market.</p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557970-boeing-lifts-africa-aircraft-demand-forecast-by-40-percent-on-strong-economic-growth",
            "pub_date": "2026-02-27 01:05:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557955",
            "title": "CNBC to cut nearly a dozen jobs as it unifies TV and digital ops - Reuters",
            "description": "<html><body><ul>\n<li data-testid=\"paragraph-0\">CNBC, the popular financial news organization that was recently spun out of Comcast (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CMCSA\" title=\"Comcast Corporation\">CMCSA</a></span>) into a new networks-focused company, Versant (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/VSNT\" title=\"Versant Media Group, Inc.\">VSNT</a></span>), is restructuring its newsroom, <em>Reuters </em>reported Thursday, citing at least four sources.</li>\n<li data-testid=\"paragraph-0\">The news organization plans to merge its TV and digital operations, which would result in nearly a dozen layoffs, including the departure of the website's managing editor, Jeff McCracken, the report said.</li>\n<li data-testid=\"paragraph-1\">The cuts are part of an overhaul under Editor-in-Chief David Cho, as CNBC prepares to introduce a paywall on its website, sources told <em>Reuters</em>.</li>\n<li data-testid=\"paragraph-1\">\n<div data-testid=\"paragraph-2\">The layoffs are not aimed at cutting costs, and the news organization plans to add some 40 roles in the coming year, the report said.</div>\n<div data-testid=\"paragraph-7\"> </div>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557955-cnbc-to-cut-nearly-a-dozen-jobs-as-it-unifies-tv-and-digital-ops---reuters",
            "pub_date": "2026-02-27 01:05:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}