{
    "data": [
        {
            "id": "4403641",
            "title": "Stingray Group declares CAD 0.075 dividend",
            "description": "<html><body><ul>\n<li>Stingray Group (RAY.A:CA) declares <a href=\"https://seekingalpha.com/pr/19991749-stingray-reports-third-quarter-results-for-fiscal-2025\" target=\"_blank\">CAD 0.075/share quarterly dividend</a>, in line with previous.</li>\n<li>Payable March 14; for shareholders of record Feb. 28; ex-div Feb. 28.</li>\n<li><a href=\"https://seekingalpha.com/symbol/RAY.A:CA/dividends?source=news_bullet\">See RAY.A:CA Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n</body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403641-stingray-group-declares-cad-0_075-dividend",
            "pub_date": "2025-02-05 19:37:11",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403643",
            "title": "CapitaLand Integrated Commercial Trust signals mid-single-digit rent reversions amid strong operational metrics",
            "description": "<html><body><p>Earnings Call Insights: CapitaLand Integrated Commercial Trust (<a href=\"https://seekingalpha.com/symbol/CPAMF\" title=\"CapitaLand Integrated Commercial Trust\">OTCPK:CPAMF</a>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Tony Tan highlighted that CapitaLand Integrated Commercial Trust (CICT) ended the year in a strong position, supported by a 1.7% increase in revenue year-over-year and a net property income growth of<span class=\"paywall-full-content invisible\"> 3.4%. The portfolio occupancy rate improved to 96.7%, rising by 0.3 percentage points sequentially. He also emphasized the impact of several asset enhancement initiatives (AEIs), including work at IMM, Gallileo, and 101 Miller, which are expected to contribute significantly in 2025 and beyond.</span> </li> <li class=\"paywall-full-content invisible\">The CEO noted that the acquisition of ION Orchard had exceeded expectations, contributing positively to the portfolio's performance. Newly completed AEI work at various locations, including Clarke Quay and 101 Miller, was highlighted as critical to maintaining competitive asset quality.</li> <li class=\"paywall-full-content invisible\">CFO Mei Lian Wong reported that leverage was reduced to 38.5%, providing financial flexibility for future investments. She noted that 81% of debt is now hedged at fixed rates, with the cost of debt maintained at 3.6%. She added, \"With our strong financial position, we are well-protected against market volatility.\"</li> <li class=\"paywall-full-content invisible\">Head of Portfolio Management Lee Yi Zhuan stated that leasing activity remained robust, with over 1.8 million square feet leased during the year. He noted strong tenant retention and positive rental reversions across both office and retail segments.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management anticipates mid-single-digit rental reversions for the retail portfolio in 2024, supported by strong demand from F&amp;B, beauty, health, and fashion tenants. The office portfolio is also expected to achieve mid-single-digit rent reversions, driven by demand from sectors such as financial services, legal, and wealth management.</li> <li>CEO Tony Tan outlined plans for significant contributions from AEIs starting in 2025, particularly from Gallileo and IMM. He stated, \"We anticipate more substantial revenue recognition in 2026 as these projects ramp up.\"</li> <li>The company remains committed to maintaining a strong Singapore anchor, while also exploring opportunities in overseas markets, albeit cautiously due to valuation challenges.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Revenue increased by 1.7% year-over-year, while net property income grew by 3.4%. Portfolio valuation rose by 6.2%, reaching $26 billion, with growth driven by operational improvements and the acquisition of ION Orchard. </li> <li>Distributable income per unit (DPU) for the second half of 2024 grew sequentially to $0.0545, supported by strong operational performance and higher contributions from new acquisitions. </li> <li>The average cost of debt remained stable at 3.6%, and leverage was reduced to 38.5%, providing headroom for future investments and AEI projects.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Vijay Natarajan, RHB Research, asked about capital recycling plans and whether divestments were imminent. Jacqueline Lee, Head of Investments, responded that portfolio reconstitution is a continuous process and that any divestment would depend on timing and market conditions.</li> <li>Mervin Song, J.P. Morgan, inquired about the outlook for ION Orchard's performance. CEO Tony Tan noted that occupancy at ION had improved to nearly 98%, with base rents rising. However, he acknowledged a softening in luxury retail sales globally.</li> <li>An analyst inquired about Gallileo's AEI costs and potential returns. Tony Tan explained that the AEI is necessary to modernize the building and attract high-quality tenants, with significant rental uplifts expected upon completion.</li> <li>Another analyst asked about the potential impact of higher interest rates on valuations. CFO Mei Lian Wong stated that the company has hedged 81% of its debt and expects the average cost of debt to remain below 4% in 2025.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts exhibited a mix of cautious optimism and skepticism. Concerns were raised about the potential impact of economic headwinds on tenant sales and occupancy costs. Questions also focused on AEI execution risks and the ability to sustain positive rental reversions.</li> <li>Management maintained a confident tone during the prepared remarks, emphasizing operational resilience and growth prospects. However, during the Q&amp;A, responses were measured, particularly when addressing valuation declines in overseas markets and higher interest rate impacts.</li> <li>Compared to prior quarters, management demonstrated increased confidence in the Singapore portfolio's performance, particularly in retail and office segments, while acknowledging challenges in overseas markets.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>No comparative data from the previous quarter was available for evaluation. However, management emphasized consistent improvement in operational metrics, such as occupancy rates and rental reversions, as well as the portfolio's resilience in a challenging macroeconomic environment.</li> <li>Analysts' focus shifted more toward AEI contributions and overseas market challenges, reflecting evolving concerns about valuation and growth opportunities.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Key risks highlighted include economic uncertainty, rising interest rates, and challenges in overseas markets, particularly in Germany and Australia. The company also faces potential headwinds from global retail trends and softening luxury sales.</li> <li>Management is addressing these risks through portfolio diversification, active cash management, and AEI investments aimed at enhancing asset quality and tenant retention.</li> <li>Analysts expressed concerns about the sustainability of rental reversions and the impact of AEI-related downtime on near-term cash flows.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">CapitaLand Integrated Commercial Trust delivered a solid Q4 2024 performance, marked by improved operational metrics and strong contributions from recent acquisitions and AEIs. The company's focus on Singapore as a core market and its initiatives to enhance asset quality position it well for future growth. However, challenges persist in overseas markets and macroeconomic headwinds, requiring careful execution of strategic projects to sustain performance and investor confidence.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/CPAMF/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403643-capitaland-integrated-commercial-trust-signals-mid-single-digit-rent-reversions-amid-strong",
            "pub_date": "2025-02-05 19:37:44",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403436",
            "title": "Disney beats on core metrics and guides upbeat profit growth for 2025; shares seesaw (update)",
            "description": "<html><body><p data-pm-slice=\"1 1 []\">Disney (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a></span>) beat on top and bottom line numbers for the first quarter, helped by <em>\"Moana 2\"</em> outperformance and the media conglomerate provided a forecast for the full year that was within Wall Street expectations.</p> <p>Shares of the company have<span class=\"paywall-full-content invisible\"> been dilly-dallying between green and red after reporting results; DIS stock is down 1% ahead of midday trading on the NYSE.</span></p> <p class=\"paywall-full-content invisible\">For the full year, the company expects adjusted earnings per share growth in the high single-digit range and cash flow from operations of about $15B. The Bloomberg consensus estimate for adj. EPS growth is 8.1%, and cash flow is $15.09B.</p> <p class=\"paywall-full-content invisible\">The company also expects to incur $200M related to Disney Cruise Line pre-opening expenses and record a $300M equity loss due to the purchase accounting of the Star India deconsolidation in 2025.</p> <p class=\"paywall-full-content invisible\">In Q2, the company expects a modest decline in Disney+ subscribers sequentially, and expects an impact of $100M on sports operating income from college sports and an additional NFL game, and about $50M from exiting the Venu Sports joint venture.</p> <p class=\"paywall-full-content invisible\">During Q1, total Disney+ subscribers came in at 124.6M, which included 56.8M domestic users and 67.8M internationally. Total Hulu subscribers were 53.6M.</p> <p class=\"paywall-full-content invisible\" data-pm-slice=\"1 1 []\">Domestic Disney+ average monthly revenue per paid subscriber increased to $7.99 from $7.70; International Disney+ average monthly revenue per paid subscriber increased to $7.19 from $6.78.</p> <p class=\"paywall-full-content invisible\" data-pm-slice=\"1 1 []\">Most notably, revenue from content sales/licensing saw a 34% jump in Q1, helped by higher theatrical distribution, reflecting the strong performance of <em>Moana 2</em>, the company said.</p> <p class=\"paywall-full-content invisible\">Results at domestic parks and experiences were \"unfavorably impacted\" by Hurricane Milton and Hurricane Helene, the company said. <span class=\"location\">Walt Disney World Resort</span> was closed for a day and the cruise itinerary was canceled as a result of Hurricane Milton.</p> <p class=\"paywall-full-content invisible\">In his initial reaction to the report, Seeking Alpha analyst and leader of the Investing Group \"Cash Flow Club,\" <a class=\"c-link\" data-sk=\"tooltip_parent\" data-stringify-link=\"https://seekingalpha.com/author/jonathan-weber#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" href=\"https://seekingalpha.com/author/jonathan-weber#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\" rel=\"noopener noreferrer\" target=\"_blank\">Jonathan Weber</a>, said, <em>\"</em>Disney delivered a double beat, growing slightly faster than expected. The Disney+ subscriber number declined sequentially, and the same is expected for the current quarter. That being said, other business units performed reasonably well, and management foresees a nice HSD EPS increase for the current year.\"</p> <p class=\"paywall-full-content invisible\">Net income for the three months ended December 31 was $2.64B, compared to $2.15B for the same period last year.</p> <p class=\"paywall-full-content invisible\">On a per-share basis, the company earned $1.40, beating the average analyst estimate by 9 cents.</p> <p class=\"paywall-full-content invisible\">Revenue rose 5% to $24.7B and was ahead of expectations by $150M.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2186902541/image_2186902541.jpg",
            "link": "https://seekingalpha.com/news/4403436-disney-beats-on-core-metrics-and-guides-an-upbeat-profit-growth-for-2025",
            "pub_date": "2025-02-05 19:34:45",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403590",
            "title": "Elon Musk’s DOGE agents said to have gained access to Medicare systems",
            "description": "<html><body><p>Representatives of the Elon Musk-run Department of Government Efficiency have gained access to key payment and contracting systems of the U.S. Centers for Medicare and Medicaid Services in a bid to identify areas of potential fraud or waste, <em>The Wall<span class=\"paywall-full-content invisible\"> Street Journal </span></em><span class=\"paywall-full-content invisible\">reported Wednesday.</span></p> <p class=\"paywall-full-content invisible\">Citing people familiar with the matter, the publication said that DOGE agents have entered the CMS offices this week to study the agency's system technology and associated spending flows so as to highlight areas of possible fraud or waste.</p> <p class=\"paywall-full-content invisible\">DOGE is also said to be looking at the agency's organizational structure and its staffing methods.</p> <p class=\"paywall-full-content invisible\">CMS said it has two senior agency officials leading the coordination with DOGE. And they are “taking a thoughtful approach to see where <a href=\"https://www.wsj.com/health/healthcare/elon-musk-doge-medicare-medicaid-fraud-e697b162?st=ZRo1B6&amp;reflink=desktopwebshare_permalink\" rel=\"noopener\" target=\"_blank\">there may</a> be opportunities for more effective and efficient spending in line with meeting the goals of President Trump,” a CMS official said.</p> <p class=\"paywall-full-content invisible\">DOGE, created by President Donald Trumpunder the leadership of Elon Musk, billionaire CEO of Tesla (<a href=\"https://seekingalpha.com/symbol/TSLA\" title=\"Tesla, Inc.\">TSLA</a>) via an executive order on his first day in office has previously accessed the Treasury Department’s payments system, <em>The New York <a href=\"https://seekingalpha.com/news/4401711-elon-musks-doge-gains-access-to-treasury-departments-payments-system-nyt\" rel=\"noopener\" target=\"_blank\">Times </a></em><a href=\"https://seekingalpha.com/news/4401711-elon-musks-doge-gains-access-to-treasury-departments-payments-system-nyt\" rel=\"noopener\" target=\"_blank\">reported Saturday.</a></p> <p class=\"paywall-full-content invisible\">Major health insurers working with the CMS include UnitedHealth (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/UNH\" title=\"UnitedHealth Group Incorporated\">UNH</a></span>), Humana (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/HUM\" title=\"Humana Inc.\">HUM</a></span></span>), CVS Health (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CVS\" title=\"CVS Health Corporation\">CVS</a></span>),<span style=\"mso-spacerun: yes;\"> </span>Cigna (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CI\" title=\"The Cigna Group\">CI</a></span>), Clover Health (<a href=\"https://seekingalpha.com/symbol/CLOV\" title=\"Clover Health Investments, Corp.\">CLOV</a>) and Alignment Healthcare (<a href=\"https://seekingalpha.com/symbol/ALHC\" title=\"Alignment Healthcare, Inc.\">ALHC</a>), Centene (<a href=\"https://seekingalpha.com/symbol/CNC\" title=\"Centene Corporation\">CNC</a>), Molina Healthcare (<a href=\"https://seekingalpha.com/symbol/MOH\" title=\"Molina Healthcare, Inc.\">MOH</a>), Elevance Health (<a href=\"https://seekingalpha.com/symbol/ELV\" title=\"Elevance Health, Inc.\">ELV</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317447094/image_1317447094.jpg",
            "link": "https://seekingalpha.com/news/4403590-elon-musks-doge-agents-access-medicare-systems",
            "pub_date": "2025-02-05 19:35:24",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403592",
            "title": "TotalEnergies CEO expects U.S. financing for Mozambique LNG project in coming weeks",
            "description": "<html><body><p>TotalEnergies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a></span>) CEO Patrick Pouyanne said Wednesday that he expects financing from the U.S. for its $20B Mozambique LNG project will be <a href=\"https://www.reuters.com/business/energy/totalenergies-ceo-says-us-financing-mozambique-lng-project-expected-coming-weeks-2025-02-05/\" rel=\"nofollow\" target=\"_self\" title=\"approved in coming weeks\">approved in the coming weeks</a>, with other credit agencies to follow shortly thereafter, Reuters reported.</p> <p>The company is<span class=\"paywall-full-content invisible\"> waiting for loan re-approvals from the U.S., U.K. and Dutch export credit agencies before lifting a force majeure on the project that has been in place since 2021; the U.K. government reportedly is taking legal advice to </span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/news/4403121-u-k-taking-legal-advice-to-pull-out-of-totalenergies-20b-mozambique-lng-project-ft\" target=\"_self\" title=\"determine whether it can withdraw\">determine whether it can withdraw</a><span class=\"paywall-full-content invisible\"> from the controversial project.</span></p> <p class=\"paywall-full-content invisible\">The U.S. Export-Import Bank previously agreed a $4.7B loan for the project but it needs to be re-approved, after construction on the project was frozen in 2021 due to violent unrest near the project site.</p> <p class=\"paywall-full-content invisible\">Pouyanne said the Mozambique LNG project completion date would need to be pushed back to 2029-30 from its previously planned 2027.</p> <p class=\"paywall-full-content invisible\">The CEO also said he expects TotalEnergies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a></span>) will be able to continue investing in renewable energy in the U.S.; the French company is the largest LNG exporter to the U.S., with more than 10M tons under contract.</p> <p class=\"paywall-full-content invisible\">TotalEnergies (<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a>) <span style=\"color: #008000;\">+2%</span> on Wednesday after reporting better than expected <a href=\"https://seekingalpha.com/news/4403294-totalenergies-beats-top-line-and-bottom-line-estimates-initiates-fy25-outlook\" target=\"_self\" title=\"Q4 adjusted earnings\">Q4 adjusted earnings</a>, as higher trading profits in the gas market helped it offset some of the impact of low oil prices and weak fuel demand.</p> <p class=\"paywall-full-content invisible\">The company announced a 7% increase in the 2024 dividend to €3.22/share, and confirmed stock buybacks of $2B per quarter for 2025.</p> <p class=\"paywall-full-content invisible\">RBC Capital analyst Biraj Borkhataria said TotalEnergies' (<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a>) announced dividend growth was <a href=\"https://www.reuters.com/business/energy/totalenergies-posts-drop-fourth-quarter-profit-weak-oil-demand-2025-02-05/\" rel=\"nofollow\" target=\"_self\" title=\"higher than anticipated\">higher than anticipated</a>, and the company's reported 8% gearing \"should allay any concerns around debt levels.\"</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331308062/image_1331308062.jpg",
            "link": "https://seekingalpha.com/news/4403592-totalenergies-ceo-expects-u_s_-financing-for-mozambique-lng-project-in-coming-weeks",
            "pub_date": "2025-02-05 19:27:33",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403622",
            "title": "Illinois Tool Works targets 3% organic growth in 2025 with higher margins",
            "description": "<html><body><p>Earnings Call Insights: Illinois Tool Works (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ITW\" title=\"Illinois Tool Works Inc.\">ITW</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li><p>CEO Chris O'Herlihy highlighted a solid Q4 performance, with GAAP EPS rising 7% to $2.54 and operating income increasing 4% to $1.03 billion despite a 1.3% total revenue decline. Organic revenue growth turned positive at 0.4% when<span class=\"paywall-full-content invisible\"> excluding product line simplification (PLS). Record operating margins reached 26.2%, driven by a 140 basis point improvement, including contributions from enterprise initiatives.</span></p></li> <li class=\"paywall-full-content invisible\"><p>O'Herlihy emphasized the company’s focus on driving above-market organic growth and achieving a 3% customer-backed innovation (CBI) yield by 2030, with patent filings increasing 18% in 2024. He stated that ITW is \"well-positioned to capitalize on an improving demand environment if it should materialize.\"</p></li> <li class=\"paywall-full-content invisible\"><p>CFO Michael Larsen noted that six out of seven segments expanded operating margins in Q4, with enterprise initiatives contributing 120 basis points. He also mentioned free cash flow reaching a record $1 billion, with a conversion rate of 133%.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li><p>ITW provided full-year 2025 guidance, projecting organic growth of 1% to 3%, excluding a 1% decline from PLS. GAAP EPS is forecasted between $10.15 and $10.55, with a midpoint of $10.35 reflecting non-operational headwinds, including a $0.30 foreign currency impact.</p></li> <li><p>Operating margins are expected to improve by 100 basis points to a range of 26.5% to 27.5%. Enterprise initiatives will contribute approximately 100 basis points to margin improvement across segments.</p></li> <li><p>Management stated that Q1 2025 EPS would represent about 22% of the year's total due to seasonal revenue declines and increased restructuring expenses.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li><p>GAAP EPS for Q4 2024 came in at $2.54, exceeding analysts' estimates of $2.50. Revenue was $3.98 billion, compared to an analysts' estimate of $3.98 billion.</p></li> <li><p>Automotive OEM revenue declined 2% in Q4, but margins improved by 230 basis points, reaching 19.6% for the full year. The segment is on track to achieve its low-to-mid 20% operating margin target in the next few years.</p></li> <li><p>Food Equipment grew 3.5% organically in Q4, driven by equipment and service growth. Asia-Pacific sales were particularly strong, growing 11%, with operating margins improving by 170 basis points to 27%.</p></li> <li><p>Specialty Products saw a 4% organic revenue decline due to strategic PLS but achieved a record 28.4% margin. Management expects this segment to grow in 2025 despite ongoing PLS.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Stephen Volkmann, Jefferies, inquired about enterprise initiative benefits by segment. CFO Michael Larsen explained that Automotive OEM saw the largest improvement with 190 basis points, while Welding experienced 60 basis points.</p></li> <li><p>Scott Davis, Melius Research, asked about margin sustainability in a down volume environment. CEO Chris O'Herlihy highlighted the role of enterprise initiatives and CBI in driving continuous improvement, noting, \"These initiatives are independent of volume and deliver meaningful contributions.\"</p></li> <li><p>Andrew Kaplowitz, Citi Group, sought clarity on sales momentum. Larsen emphasized that while some end markets, including semiconductors, showed positive signs, ITW’s guidance is based on current demand levels.</p></li> <li><p>Jamie Cook, Truist Securities, asked about potential growth challenges in certain segments. O'Herlihy reaffirmed confidence in all segments achieving 4%-plus growth, citing the success of CBI initiatives across the portfolio.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Analysts expressed cautious optimism, focusing on margin sustainability and growth potential in challenging markets. Questions were balanced, with some pressing for details on specific contributions from enterprise initiatives and recovery timelines in key segments.</p></li> <li><p>Management maintained a confident tone, particularly when discussing operational improvements and strategic progress. Phrases like \"well-positioned\" and \"strong execution\" dominated their remarks, reflecting optimism despite market headwinds.</p></li> <li><p>Compared to Q3, management displayed slightly more confidence in near-term growth opportunities, particularly in segments like Food Equipment and Automotive OEM.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Q4 organic revenue at -0.5% was an improvement over Q3’s -1.4%, signaling stabilization in demand. Operating margin rose to 26.2% from 26.5% in Q3, reflecting continued operational efficiency.</p></li> <li><p>Automotive OEM maintained its trajectory toward margin improvement despite lower volumes. Food Equipment rebounded with 3.5% organic growth, compared to flat growth in Q3.</p></li> <li><p>Management’s tone shifted from cautious in Q3 to slightly more optimistic in Q4, supported by improved performance metrics and progress on strategic priorities like CBI.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management noted ongoing non-operational headwinds, including foreign currency translation and restructuring expenses. They also highlighted uncertainty in demand recovery timing, particularly in Construction Products and Automotive OEM.</p></li> <li><p>Analysts raised concerns about potential tariff impacts on automotive and other segments, though management downplayed the risks, citing their \"produce where we sell\" strategy.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Illinois Tool Works delivered a strong finish to 2024, with record free cash flow and operating margins. The company’s focus on customer-backed innovation and enterprise initiatives positions it for growth in 2025, supported by a robust margin outlook. While challenges persist in automotive and construction markets, ITW remains confident in its ability to outperform end markets and sustain profitability.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/ITW/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403622-illinois-tool-works-targets-3-percent-organic-growth-in-2025-with-higher-margins",
            "pub_date": "2025-02-05 19:29:23",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403612",
            "title": "Capri forecasts $4.4B FY 2025 revenue with recovery expected in FY 2026",
            "description": "<html><body><p>Earnings Call Insights: Capri Holdings Limited (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/CPRI\" title=\"Capri Holdings Limited\">CPRI</a></span>) Q3 2025</p> <h3>Management View</h3> <ul> <li>CEO John D. Idol acknowledged that the business faced significant challenges during the quarter, with a 12% decline in revenue driven by softening demand for luxury fashion goods globally, particularly in China, and strategic<span class=\"paywall-full-content invisible\"> missteps at Versace and Michael Kors. He highlighted plans to share detailed strategies for growth at the upcoming Investor Day.</span> </li> <li class=\"paywall-full-content invisible\">Versace revenue decreased 15% due to global luxury demand declines and adjustments in product positioning. The brand's AUR in the full-price channel increased mid-single digits. Idol noted adjustments to Versace's pricing and product architecture, aiming to balance luxury with aspirational elements.</li> <li class=\"paywall-full-content invisible\">Jimmy Choo revenue declined 4%, with strength reported in women's accessories and casual footwear sales within the retail channel. The brand plans to expand its accessories mix while leveraging high-profile collaborations and campaigns.</li> <li class=\"paywall-full-content invisible\">Michael Kors revenue dropped 12% due to demand softness and strategic adjustments. Plans include refocusing on the brand's heritage, realigning pricing, and rebuilding core product assortments to drive higher full-price sell-throughs.</li> <li class=\"paywall-full-content invisible\">CFO Thomas J. Edwards Jr. reported total company revenue of $1.3 billion, a 12% year-over-year decrease, citing declines across all brands and geographies. Operating margin was 6%, down from 12.1% last year. He emphasized the company's financial strength and plans to improve margins through cost-saving measures and strategic initiatives.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Fourth quarter revenue is expected to decline 20% to $975 million, with wholesale revenue forecasted to drop by 30%. Versace revenue is projected at $200 million, Jimmy Choo at $125 million, and Michael Kors at $650 million.</li> <li>FY 2025 revenue is forecasted at $4.4 billion with operating income of approximately $100 million. For FY 2026, revenue is expected to stabilize at $4.1 billion, including $160 million in negative impacts from foreign currency and store closures. Operating income is anticipated to reach $150 million, supported by $150 million in cost reductions.</li> <li>Management expects Versace revenue to reach $800 million, Jimmy Choo $550 million, and Michael Kors $2.75 billion in FY 2026. Gross margin improvement and operating margin expansion are anticipated through cost reductions and pricing adjustments.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Total company revenue declined 12%, with retail sales down low double digits and e-commerce down high single digits. Geography-wise, revenue fell 11% in the Americas, 9% in EMEA, and 20% in Asia.</li> <li>Gross margin declined to 64.4%, impacted by lower full-price sell-throughs. Operating expenses decreased by $20 million but deleveraged as a percentage of revenue.</li> <li>Versace posted an operating margin of negative 10.9%, Jimmy Choo negative 3.8%, and Michael Kors 16.2%. Net income for the quarter was $54 million, or $0.45 per diluted share, including $23 million in foreign currency losses.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Simeon Siegel, BMO Capital Markets: Asked about the promotional environment and gross margin guidance. John Idol explained that competitive dynamics remain unchanged, with consumers becoming more price-sensitive, particularly at Michael Kors. CFO Edwards highlighted expectations for modest gross margin improvement in FY 2026.</li> <li>Robert Drbul, Guggenheim Securities: Inquired about pricing strategies and marketing spend. Idol noted that pricing adjustments at Michael Kors, including introducing a good, better, best strategy, have shown early positive results. He added that marketing efforts will focus on reconnecting with the brand's heritage.</li> <li>Brooke Roach, Goldman Sachs: Asked about retail performance assumptions. Idol emphasized product innovation, pricing adjustments, and marketing strategies as key drivers for improving retail trends.</li> <li>Paul Lejuez, Citigroup Inc.: Questioned the impact of the terminated merger and leadership changes. Idol acknowledged the merger's distractions but affirmed that the team is now fully focused on executing its growth strategies.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed skepticism about the company's ability to execute its turnaround plan, particularly regarding wholesale declines and pricing adjustments. Questions were pressing yet focused on understanding strategic shifts.</li> <li>Management maintained a cautiously optimistic tone, emphasizing confidence in the revised strategies and the potential for recovery. Idol frequently referenced data-driven insights and early positive indicators to support the outlook.</li> <li>Compared to prior remarks, management's tone in addressing challenges appeared more resolute, with a clear focus on long-term strategic execution.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance language shifted toward a long-term recovery focus, with FY 2027 positioned as the year of returning to growth.</li> <li>Analysts’ questions this quarter emphasized concerns about pricing and wholesale trends, diverging from previous focus areas.</li> <li>Management demonstrated greater clarity in articulating brand-specific strategies and financial targets.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Challenges include declining demand for luxury goods, particularly in China, and potential execution risks related to pricing and repositioning strategies.</li> <li>Wholesale channel softness remains a significant headwind. Management plans to stabilize this through strategic pricing adjustments and product realignment.</li> <li>Analysts raised concerns about the impact of further store closures and the potential for continued pressure on margins.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Capri Holdings reported a challenging quarter, with revenue declines across all brands and regions. Management outlined comprehensive strategies to address missteps, including pricing adjustments and product repositioning at Versace and Michael Kors, while expanding Jimmy Choo's accessories and casual footwear offerings. Despite near-term challenges, the company projects stabilization in FY 2026 and a return to growth in FY 2027. Investors will closely watch the execution of these initiatives and the upcoming Investor Day for further clarity.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/CPRI/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403612-capri-forecasts-4_4b-fy-2025-revenue-with-recovery-expected-in-fy-2026",
            "pub_date": "2025-02-05 19:18:12",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403614",
            "title": "T. Rowe Price targets positive flows in 2025 with improved sales momentum and ETF growth",
            "description": "<html><body><p>Earnings Call Insights: T. Rowe Price Group, Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/TROW\" title=\"T. Rowe Price Group, Inc.\">TROW</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Rob Sharps highlighted a reduction in net outflows for 2024, which decreased nearly 50% year-over-year to $43.2 billion. He expressed optimism about achieving positive flows in 2025, supported by improved investment<span class=\"paywall-full-content invisible\"> performance and increased gross sales across channels.</span> </li> <li class=\"paywall-full-content invisible\">The company expanded its ETF portfolio to 17 funds, closing the year with $8 billion in ETF AUM. Target date funds led with $16.3 billion in net inflows for the year, its strongest since 2019. New launches included personalized retirement manager and managed lifetime income products.</li> <li class=\"paywall-full-content invisible\">A strategic partnership with Aspida was announced, expected to enhance T. Rowe’s insurance asset management offerings, particularly in public and private assets.</li> <li class=\"paywall-full-content invisible\">CFO Jen Dardis emphasized that Q4 adjusted diluted EPS was $2.12, bringing the full-year EPS to $9.33, up 23% from 2023. Adjusted net revenue for Q4 reached $1.8 billion, contributing to a full-year revenue of nearly $7.2 billion, a 10.1% increase over the prior year.</li> <li class=\"paywall-full-content invisible\">Head of Global Investments Eric Veiel noted that 54% of funds exceeded peer group medians for the year, with strong performances in U.S. equity research and several sector-specific strategies. However, he acknowledged challenges in mid-cap growth and emerging markets equity performance.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management expects 2025 to show further improvements in net flows, though achieving full-year positive flows remains uncertain. CEO Rob Sharps stated, “Our base-case is that in 2025, we further reduce net outflows and set the stage to return to organic growth.”</li> <li>Operating expenses for 2025 are forecasted to rise 4-6% over 2024 levels, driven by strategic investments and real-estate costs related to the new Baltimore headquarters.</li> <li>The company plans further expansion in ETFs, targeting launches in 2025 and 2026, including strategies like the capital appreciation premium income ETF.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 adjusted net revenue was $1.8 billion, up 16% year-over-year. Investment advisory revenue reached $1.7 billion, supported by higher average AUM and positive flows in fixed income and alternatives.</li> <li>Net outflows for Q4 totaled $19.3 billion, primarily impacted by a large subadvised variable annuity redemption. However, December saw several sizable mandate wins, including $1.4 billion in ETF net flows.</li> <li>Annualized effective fee rate declined to 40.5 basis points due to a shift towards lower-fee products and vehicles.</li> <li>Full-year capital returns to stockholders amounted to over $1.4 billion, including $355 million in share buybacks.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li> <strong>Bill Katz, TD Cowen:</strong> Asked about the Aspida partnership and insurance opportunities. CEO Rob Sharps explained that Aspida allows T. Rowe to refine its insurance asset management offerings, particularly in fixed income and private assets, and is expected to yield direct benefits in 2025.</li> <li> <strong>Benjamin Budish, Barclays Capital:</strong> Inquired about fee rate dynamics and trends into 2025. CFO Jen Dardis noted that elevated redemptions in higher-fee mutual funds and growth in lower-fee vehicles like ETFs and institutional accounts have compressed fee rates by 2% in 2024.</li> <li> <strong>Dan Fannon, Jefferies:</strong> Sought clarification on gross sales trends. CEO Sharps emphasized broad-based improvements across channels, making 2024 the best year for gross sales since 2021, with particular strength in retirement date funds and institutional fixed income.</li> <li> <strong>Ken Worthington, JPMorgan:</strong> Questioned the ETF franchise’s impact on customer reach. CEO Sharps explained ETFs are reaching new buyers, particularly ETF-focused advisors, while acknowledging some cannibalization from mutual funds.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed cautious optimism about the company’s ability to reduce outflows and achieve positive flows, particularly in light of improving gross sales. However, concerns over fee compression and equity performance lingered.</li> <li>Management demonstrated confidence in strategic initiatives, frequently referencing momentum in ETFs, retirement date funds, and alternatives. CEO Rob Sharps’ tone reflected optimism about achieving organic growth, but he acknowledged challenges such as market conditions and fee pressures.</li> <li>Compared to the prior quarter, management’s tone was more positive, buoyed by strong December flows and strategic partnerships. Analysts maintained a slightly skeptical tone, probing for clarity on fee trends and competitive positioning.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Net outflows increased from $12.2 billion in Q3 to $19.3 billion in Q4, largely due to a previously disclosed subadvised variable annuity redemption.</li> <li>Gross sales improved notably in Q4, driven by strong December wins across asset classes and channels.</li> <li>Operating expenses guidance for 2025 indicates slower growth compared to the 6-8% range for 2024.</li> <li>Management tone during the Q4 call was more optimistic compared to Q3, reflecting confidence in improved flows and strategic progress.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Fee compression driven by a shift towards lower-fee vehicles and pricing pressures remains a challenge.</li> <li>Equity performance, while improving in some areas, continues to lag in key strategies like mid-cap growth and emerging markets equity.</li> <li>Regulatory and liquidity hurdles could delay broader adoption of private market allocations in target date funds and retirement products.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">T. Rowe Price is making progress in reducing outflows and building momentum in key growth areas like ETFs, target date funds, and insurance asset management. While challenges such as fee compression and uneven equity performance persist, management’s strategic initiatives and optimistic outlook for 2025 signal potential for improved financial and operational performance.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/TROW/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403614-t-rowe-price-targets-positive-flows-in-2025-with-improved-sales-momentum-and-etf-growth",
            "pub_date": "2025-02-05 19:18:44",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403582",
            "title": "Kenvue confirms activist Starboard nominations for board",
            "description": "<html><body><p>Kenvue Inc. (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/KVUE\" title=\"Kenvue Inc.\">KVUE</a></span>) confirmed that it received activist Starboard Value's submission of four nominees for the consumer health company's board for the 2025 annual meeting.</p> <p>Kenvue's (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/KVUE\" title=\"Kenvue Inc.\">KVUE</a></span>) board has been reviewing Starboard's nominees and will present its formal recommendations<span class=\"paywall-full-content invisible\"> at some point, the company said in a </span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/pr/19992791-kenvue-highlights-commitment-to-shareholder-value\" rel=\"noopener\" target=\"_blank\" title=\"statement\">statement</a><span class=\"paywall-full-content invisible\"> on Wednesday. Members of Kenvue's board and management team have had several discussions with Starboard.</span></p> <p class=\"paywall-full-content invisible\">The Starboard nominees include – Michelle Millstone-Shroff, Cara Robinson, Bindu Shah and Starboard founder and head Jeffrey C. Smith, according to a<a href=\"https://seekingalpha.com/filing/9514241\" rel=\"noopener\" target=\"_blank\" title=\" filing \"> filing </a>on Wednesday. Kenue highlighted in its statement that it appointed two new independent directors with the resignation of two Johnson &amp; Johnson (<a href=\"https://seekingalpha.com/symbol/JNJ\" title=\"Johnson &amp; Johnson\">JNJ</a>) executives from the board.</p> <p class=\"paywall-full-content invisible\">Starboard disclosed in October that the fund <a href=\"https://seekingalpha.com/news/4181820-activist-investor-starboard-takes-stake-in-kenvue-wsj#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">accumulated a stake </a>and was pushing for changes to help the company's stock price. Kenvue<a href=\"https://seekingalpha.com/news/4190403-kenvue-needs-to-fix-its-skin-health-beauty-segments-starboards-jeff-smith-says#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\"> needs to focus on fixing its skin, health and beauty</a> segments, Smith said at the time after he presented at an activist conference.</p> <p class=\"paywall-full-content invisible\">\"We believe that meaningful change is required on the Board in order to provide renewed accountability to stockholders and unlock the Company’s trapped potential,\" Smith said in the filing. \"We firmly believe that with the right Board in place, Kenvue can become a best-in-class company in its industry.\"</p> <p class=\"paywall-full-content invisible\">Shares of Kenvue (<a href=\"https://seekingalpha.com/symbol/KVUE\" title=\"Kenvue Inc.\">KVUE</a>)<span style=\"color: #ff0000;\"> ticked lower by 0.6% </span>on Wednesday.</p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/458549551/image_458549551.jpg",
            "link": "https://seekingalpha.com/news/4403582-kenvue-confirms-activist-starboard-nominations-for-board",
            "pub_date": "2025-02-05 19:11:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403606",
            "title": "The top 10 Growth stocks by BofA: ALL, CRWD, DOW, and more",
            "description": "<html><body><p class=\"MsoNormal\">Bank of America updated their “Growth 10” stocks, which are the 10 highest ranking growth stocks according to their methodology.</p> <p class=\"MsoNormal\">Analysts replaced Uber Technologies (<a href=\"https://seekingalpha.com/symbol/UBER\" title=\"Uber Technologies, Inc.\">UBER</a>) by Merck &amp; Co. (<a href=\"https://seekingalpha.com/symbol/MRK\" title=\"Merck &amp; Co., Inc.\">MRK</a>) as the BofA vs. Consensus EPS Surprise rating<span class=\"paywall-full-content invisible\"> fell below 5 for Uber (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/UBER\" title=\"Uber Technologies, Inc.\">UBER</a><span class=\"paywall-full-content invisible\">).</span></p> <p class=\"MsoNormal paywall-full-content invisible\">Criteria for the “Growth 10” stocks includes a BofA vs. Consensus EPS Surprise rating of 1; a “buy” opinion; the stock must be rated top 1 or 2 by BofA vs. Consensus EPS Surprise model for less than 10 months; and be part of the select 10 stocks with the highest five-year projected EPS growth rate.</p> <p class=\"MsoNormal paywall-full-content invisible\">This group is up 7.3% year-to-date, compared to 2.7% for the S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>). Also, their annual total return for 2024 is 29%.</p> <p class=\"MsoNormal paywall-full-content invisible\">Here is the full list:</p> <ul class=\"paywall-full-content invisible\"> <li class=\"MsoNormal\">Allstate Corp. (<a href=\"https://seekingalpha.com/symbol/ALL\" title=\"The Allstate Corporation\">ALL</a>) – Next five-year EPS growth: 172.7</li> <li class=\"MsoNormal\">CrowdStrike (<a href=\"https://seekingalpha.com/symbol/CRWD\" title=\"CrowdStrike Holdings, Inc.\">CRWD</a>) – Next five-year EPS growth: 55.0</li> <li class=\"MsoNormal\">Dow Inc. (<a href=\"https://seekingalpha.com/symbol/DOW\" title=\"Dow Inc.\">DOW</a>) – Next five-year EPS growth: 32.5</li> <li class=\"MsoNormal\">KKR &amp; Co. Inc. (<a href=\"https://seekingalpha.com/symbol/KKR\" title=\"KKR &amp; Co. Inc.\">KKR</a>) – Next five-year EPS growth: 28.6</li> <li class=\"MsoNormal\">Eli Lilly &amp; Co. (<a href=\"https://seekingalpha.com/symbol/LLY\" title=\"Eli Lilly and Company\">LLY</a>) – Next five-year EPS growth: 44.8</li> <li class=\"MsoNormal\">Meta Platforms (<a href=\"https://seekingalpha.com/symbol/META\" title=\"Meta Platforms, Inc.\">META</a>) – Next five-year EPS growth: 13.8</li> <li class=\"MsoNormal\">Merck &amp; Co. (<a href=\"https://seekingalpha.com/symbol/MRK\" title=\"Merck &amp; Co., Inc.\">MRK</a>) – Next five-year EPS growth: 54.9</li> <li class=\"MsoNormal\">Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>) – Next five-year EPS growth: 22.9</li> <li class=\"MsoNormal\"> <span lang=\"FR\" style=\"mso-ansi-language: FR;\">Progressive Corp. </span>(<a href=\"https://seekingalpha.com/symbol/PGR\" title=\"The Progressive Corporation\">PGR</a>) – Next five-year EPS growth: 15.9</li> <li class=\"MsoNormal\">Warner Bros. (<a href=\"https://seekingalpha.com/symbol/WBD\" title=\"Warner Bros. Discovery, Inc.\">WBD</a>) – Next five-year EPS growth: 13.2</li> </ul> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/168522145/image_168522145.jpg",
            "link": "https://seekingalpha.com/news/4403606-the-top-10-growth-stocks-by-bofa-all-crwd-dow-and-more",
            "pub_date": "2025-02-05 19:14:35",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}