{
    "data": [
        {
            "id": "4403297",
            "title": "France service activity falls in January",
            "description": "<html><body><p>The seasonally adjusted HCOB France Services PMI Business Activity Index — which measures changes in the volume of business activity compared with one month previously — dropped from December's 49.3 to 48.2 in January.</p> <p>Key findings include: activity levels fall at slightly<span class=\"paywall-full-content invisible\"> faster rate as demand weakness persists; prices charged lowered for first time since April 2021; employment falls as business confidence sinks to 56-month low.</span></p> <p class=\"paywall-full-content invisible\">\"France's service sector downturn continued in January. The HCOB PMI for services suggested that 2025 will be achallenging year. Political uncertainty dampened activity, according to some panel members, while others attributed theslowdown to weaker customer demand and reduced confidence in the economic outlook. Given the political situation, it isunderstandable that companies are feeling uncertain. France's Prime Minister François Bayrou is fighting for his politicalsurvival while striving to pass a 2025 budget that meets the fiscal sustainability expectations of the EU Commission andfinancial markets.\" <a href=\"https://www.pmi.spglobal.com/Public/Home/PressRelease/409e3fed8d8e4ed9aa710b792e090f37\" rel=\"nofollow\" target=\"_blank\">said</a> Dr Tariq Kamal Chaudhry, Economist at Hamburg at Hamburg Commercial Bank.</p> <p class=\"paywall-full-content invisible\">ETFs: (NYSEARCA:<a href=\"https://seekingalpha.com/symbol/EWQ\">EWQ</a>)</p> <p class=\"paywall-full-content invisible\">Currency: (<a href=\"https://seekingalpha.com/symbol/EUR:USD\" title=\"Euro / US Dollar\">EUR:USD</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/172301500/image_172301500.jpg",
            "link": "https://seekingalpha.com/news/4403297-france-service-activity-falls-in-january",
            "pub_date": "2025-02-05 11:53:10",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403298",
            "title": "Germany's service activity growth hits six-month high",
            "description": "<html><body><p> </p> <p>The headline HCOB Germany Services PMI Business Activity Index saw a reading of 52.5, up from 51.2 in December, a six-month-high.</p> <p>HCOB Germany Composite PMI Output Index at 50.5 (Dec: 48.0), an 8-month high.</p> <p>Inflationary pressures increase amid steep<span class=\"paywall-full-content invisible\"> and accelerated rise in costs.</span></p> <p class=\"paywall-full-content invisible\">“This is an encouraging start to the year. Growth seems to have a chance again, as the composite PMI has climbed abovethe 50-point mark for the first time in seven months. This is thanks to the service sector, which expanded its business activityat a modest but faster pace than the previous month. The manufacturing sector isn't dragging the overall economy down asmuch anymore. Overall, the situation looks relatively good given the many uncertainties.\" <a href=\"https://www.pmi.spglobal.com/Public/Home/PressRelease/67c18efdc15b46388e4a12994440f328\" rel=\"noopener\" target=\"_blank\" title=\"said\">said</a>, Dr. Cyrus de la Rubia, Chief Economist at Hamburg Commercial Bank.</p> <p class=\"paywall-full-content invisible\">ETFs: (<a href=\"https://seekingalpha.com/symbol/EWG\" title=\"iShares MSCI Germany ETF\">EWG</a>), (<a href=\"https://seekingalpha.com/symbol/GF\" title=\"New Germany Fund\">GF</a>), (<a href=\"https://seekingalpha.com/symbol/FGM\" title=\"First Trust Germany AlphaDex ETF\">FGM</a>), (<a href=\"https://seekingalpha.com/symbol/DAX\" title=\"Global X Funds - Global X DAX Germany ETF\">DAX</a>), (<a href=\"https://seekingalpha.com/symbol/FLGR\" title=\"Franklin FTSE Germany ETF\">FLGR</a>) (<a href=\"https://seekingalpha.com/symbol/DAX:IND\" title=\"DAX Germany Index\">DAX:IND</a>)</p> <p class=\"paywall-full-content invisible\">Currency: (<a href=\"https://seekingalpha.com/symbol/EUR:USD\" title=\"Euro / US Dollar\">EUR:USD</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/619762776/image_619762776.jpg",
            "link": "https://seekingalpha.com/news/4403298-germanys-service-activity-growth-hits-six-month-high",
            "pub_date": "2025-02-05 11:58:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403309",
            "title": "Vestas Wind reports Q4 results; initiates FY25 outlook and share buyback of €100M",
            "description": "<html><body><ul> <li>Vestas Wind <a href=\"https://www.vestas.com/content/dam/vestas-com/global/en/investor/reports-and-presentations/financial/2024/fy-2024/250205_02_Company_Announcement.pdf.coredownload.inline.pdf\" rel=\"nofollow\" target=\"_blank\">press release</a> (<a href=\"https://seekingalpha.com/symbol/VWDRY\" title=\"Vestas Wind Systems A/S\">OTCPK:VWDRY</a>): Q4 Revenue of €6.14B (+28.7% Y/Y).</li> <li>EBIT before special items amounted to €759m, resulting in an EBIT margin before special items of 12.4 percent, compared to 4.0 percent in the fourth quarter of 2023.</li> <li>Adjusted free cash<span class=\"paywall-full-content invisible\"> flow amounted to €1,792m compared to €1,656m in the fourth quarter of 2023.</span> </li> <li class=\"paywall-full-content invisible\">The quarterly intake of firm and unconditional wind turbine orders amounted to 6,516 MW, a decrease from the record-high fourth quarter 2023.</li> <li class=\"paywall-full-content invisible\">The value of the wind turbine order backlog was €31.6bn as at 31 December 2024.</li> <li class=\"paywall-full-content invisible\">In addition to the wind turbine order backlog, at the end of the quarter, Vestas had service agreements with expected contractual future revenue of €36.8B. Thus, the value of the combined backlog of wind turbine orders and service agreements stood at €68.4B – an increase of €8.3B compared to the year-earlier period.</li> <li class=\"paywall-full-content invisible\">A dividend of DKK 0.55 per share is proposed, and a share buyback of €100M will be initiated.</li> <li class=\"paywall-full-content invisible\">\"<strong>Our financial outlook for 2025</strong> is as follows: Revenue is expected to range between €18-20B, with an EBIT margin before special items of 4-7 percent. Total investments are expected to amount to approx. €1.2bn in 2025. The Service segment is expected to generate EBIT before special items in 2025 around €700M.\"</li> </ul> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403309-vestas-wind-reports-q4-results-initiates-fy25-outlook-and-share-buyback-of-100m",
            "pub_date": "2025-02-05 11:47:50",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403307",
            "title": "Allegiant projects 15% capacity growth in 2025 with $9 EPS guidance midpoint",
            "description": "<html><body><p>Earnings Call Insights: Allegiant Travel Company (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/ALGT\" title=\"Allegiant Travel Company\">ALGT</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>The CEO highlighted a strong Q4 2024 performance with an adjusted airline-only operating margin exceeding 13%, a 6.5-point year-over-year increase. December capacity rose 16%, with aircraft utilization reaching 9.6 hours per day, and<span class=\"paywall-full-content invisible\"> a controllable completion rate of 99.7% during the holiday period.</span> </li> <li class=\"paywall-full-content invisible\">Management emphasized three key initiatives: restoring peak utilization, upgrading commercial technology, and integrating new MAX aircraft. Four MAX aircraft are now in service, addressing prior delivery delays, and contributing to operational efficiency with up to 30% better economics compared to fleet averages.</li> <li class=\"paywall-full-content invisible\">The company aims to transition Sunseeker Resorts off its balance sheet, launching a competitive process for a potential sale or stake sale by summer 2025. Promising interest from high-quality investors has been noted.</li> <li class=\"paywall-full-content invisible\">CFO Robert Neal reported consolidated net income of $38.9M for Q4 2024, with airline-only adjusted net income of $55.6M. The airline segment achieved a 22.8% EBITDA margin, marking a nearly seven-point improvement year-over-year.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Allegiant projects over 15% capacity growth in 2025, leveraging existing infrastructure. Q1 2025 capacity growth is expected at 14% year-over-year.</li> <li>Full-year airline EPS guidance for 2025 is set at $9, representing a 50% improvement over 2024. Q1 airline-only earnings are projected at $2.25 per share, with consolidated EPS at $2.</li> <li>Management foresees continued revenue enhancement from the Navitaire system and further benefits from Allegiant Extra, with 70% of the fleet expected to feature this premium seating product by year-end 2025.</li> <li>Sunseeker Resorts is expected to achieve EBITDA-positive results in Q1 2025, supported by robust group bookings.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 2024 airline revenue reached nearly $610M, aided by a strong holiday period and better-than-expected recovery in hurricane-impacted destinations.</li> <li>Ancillary revenue per passenger increased by nearly $3 year-over-year, reaching $76 in 2024, with Allegiant Extra contributing to this growth.</li> <li>Adjusted non-fuel unit costs improved by 2.5% year-over-year, driven by cost discipline despite some headwinds such as stock compensation and maintenance expenses.</li> <li>Total liquidity stood at $1.1B at year-end 2024, with $833M in cash and investments. Net leverage improved to 3.2x, reflecting ongoing deleveraging efforts.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Savi Syth, Raymond James: Asked about capacity growth progression across quarters. Drew Wells explained that Q1 capacity is expected to grow 14%, with similar growth in Q2 and Q3, tapering in Q4 due to more challenging comparisons.</li> <li>Duane Pfennigwerth, Evercore ISI: Inquired about Sunseeker debt repayment and strategic alternatives. CFO Neal highlighted proceeds from fleet equipment sales and improved earnings as funding sources, and CEO Anderson noted promising interest from potential investors, aiming for a transaction by early summer.</li> <li>Ravi Shanker, Morgan Stanley: Questioned the strategy behind capacity growth versus pricing. Management emphasized leveraging existing infrastructure with marginal cost advantages and highlighted plans to restore historical margins.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed cautious optimism, with concerns about hurricane impacts and capacity growth strategy. Questions reflected a focus on cost discipline and monetization of Sunseeker.</li> <li>Management displayed confidence in 2025 targets, particularly regarding capacity growth and operational efficiency. Statements such as \"we are well-positioned to capitalize on this trend\" and \"we expect a significant improvement in earnings\" reflected a positive tone.</li> <li>Compared to the previous quarter, management demonstrated increased confidence in achieving strategic goals, citing stronger financial performance and operational metrics.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance improved significantly, with 2025 airline EPS guidance raised to $9 from $1 in Q4 2024. Capacity growth expectations also increased to over 15% for 2025.</li> <li>Management tone shifted positively, emphasizing operational improvements and strategic progress in transitioning Sunseeker off the balance sheet.</li> <li>Analysts maintained a consistent focus on cost efficiency and Sunseeker’s financial performance, though concerns about the broader capacity growth strategy were more prominent this quarter.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Hurricane impacts on key markets such as Asheville and Punta Gorda remain a challenge, with recovery timelines still uncertain.</li> <li>Fuel price volatility and potential delivery delays from Boeing pose risks to cost and capacity management.</li> <li>Labor negotiations with pilots, including strike authorization votes, add uncertainty to operational stability.</li> <li>Sunseeker’s financial performance and the outcome of its strategic review are critical for ongoing balance sheet improvement.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Allegiant Travel Company delivered strong Q4 2024 results, driven by operational efficiency and strategic initiatives. Management’s focus on restoring peak utilization, leveraging MAX aircraft, and transitioning Sunseeker off the balance sheet positions the company for significant growth in 2025. With 15% capacity growth projected and EPS guidance set at $9, Allegiant aims to capitalize on its enhanced infrastructure and favorable market dynamics. However, risks such as hurricane recovery, fuel price fluctuations, and labor negotiations require close monitoring.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/ALGT/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403307-allegiant-projects-15-percent-capacity-growth-in-2025-with-9-eps-guidance-midpoint",
            "pub_date": "2025-02-05 11:30:03",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403303",
            "title": "Trump's Gaza proposal would see U.S. takeover of the Strip",
            "description": "<html><body><p>During a joint press conference with Israeli Prime Minister Bibi Netanyahu on Tuesday, President Trump discussed his vision for the future of the Gaza Strip, which included a \"long-term ownership position\" by the United States and the development of the territory.</p> <p class=\"paywall-full-content invisible\">\"The only reason the Palestinians want to go back to Gaza is they have no alternative. It's right now a demolition site. This is just a demolition site. Virtually every building is down. They instead can occupy all of a beautiful area with homes and safety and they can live out their lives in peace and harmony instead of having to go back and do it again.\"</p> <p class=\"paywall-full-content invisible\">\"I envision a world - people living there, the world's people. I think you'll make that into an international, unbelievable place. I think the potential in the Gaza Strip is unbelievable. And I think the entire world, representatives from all over the world. And they'll live there. Palestinians also. Palestinians will live there, many people will live there. But they've tried the other and they've tried it for decades and decades and decades. It's not going to work it work. It didn't work. It will never work. And you have to learn from history. History has - you know, you just can't let it keep repeating itself.\"</p> <p class=\"paywall-full-content invisible\">\"We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site, level the site and get rid of the destroyed buildings, level it out. Create an economic development that will supply unlimited numbers of jobs and housing for the people of the area. Do a real job, do something different. We're going to take over that peace and we're going to develop it, create thousands and thousands of jobs. And it will be something that the entire Middle East can be very proud of,\" Trump told reporters.</p> <p class=\"paywall-full-content invisible\">\"Everybody feels that continuing the same process that's gone on forever over and over again, and then it starts, and then the killing starts, and all of the other problems start, and you end up in the same place and we don't want to see that happen. So, by the United States, with its stability and strength, owning it, especially the strength that we're developing and developed over the last fairly short period of time, I would say really since the election, I think we'll be a great keeper of something that is very, very strong, very powerful and very, very good for the area, not just for Israel, for the entire Middle East. It's very important and we'll again have thousands of jobs. And there will be jobs for everyone, not for a specific group of people, but for everybody.\"</p> <p class=\"paywall-full-content invisible\">\"We have an opportunity to do something that could be phenomenal. And I don't want to be cute. I don't want to be a wise guy. But the 'Riviera of the Middle East,' this could be something that could be so magnificent. But more importantly than that is the people that have been absolutely destroyed that live there now can live in peace in a much better situation because they are living in hell. And those people will now be able to live in peace. We'll make sure that it's done world-class.\"</p> <p class=\"paywall-full-content invisible\"><em><strong>Dear readers:</strong></em><strong> </strong>We recognize that politics often intersects with the financial news of the day, so we invite you to <a href=\"https://seekingalpha.com/article/4752437-politics-and-the-markets-020525\" title=\"click here\">click here</a> to join the separate political discussion.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2197671827/image_2197671827.jpg",
            "link": "https://seekingalpha.com/news/4403303-trumps-gaza-proposal-would-see-u_s_-takeover-of-the-strip",
            "pub_date": "2025-02-05 11:27:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403296",
            "title": "Spain's service PMI drops in January",
            "description": "<html><body><p>The HCOB Spain Services PMI Business Activity Index dropped from 57.3 in December to 54.9 in January, signaling a slower rate of expansion.</p> <p>It still remained above the crucial 50.0 mark during January to signal a seventeenth successive monthly increase in<span class=\"paywall-full-content invisible\"> service sector output.</span></p> <p class=\"paywall-full-content invisible\">Key findings include: jobs added in response to rising workloads and capacity pressures;new business growth fastest since April 2023; and input cost inflation sharpest in nearly a year.</p> <p class=\"paywall-full-content invisible\">“Last year's fourth quarter GDP figures once again surprised to the upside, driven by a robust labor market that bolsteredprivate consumption. Investments also picked up pace, likely spurred by the effects of the ECB's monetary policy easing.However, the latest HCOB composite Output PMI for Spain’s private sector economy suggests that growth has softenedsomewhat at the beginning of the year, as the upturn in both manufacturing and services moderated.\" <a href=\"https://www.pmi.spglobal.com/Public/Home/PressRelease/d1700fd1b55d43fb89676a5c37cfa2a3\" rel=\"noopener\" target=\"_blank\" title=\"said\">said</a> Jonas Feldhusen, Junior Economist at Hamburg Commercial Bank.</p> <p class=\"paywall-full-content invisible\">ETFs: (<a href=\"https://seekingalpha.com/symbol/EWP\" title=\"iShares MSCI Spain Capped ETF\">EWP</a>), (<a href=\"https://seekingalpha.com/symbol/EUFN\" title=\"iShares MSCI Europe Financials Sector Index ETF\">EUFN</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/184138090/image_184138090.jpg",
            "link": "https://seekingalpha.com/news/4403296-spains-service-pmi-drops-in-january",
            "pub_date": "2025-02-05 11:22:26",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403306",
            "title": "TotalEnergies raises interim dividend by 7.6% to €0.85",
            "description": "<html><body><ul> <li>TotalEnergies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a></span>) declares <a href=\"https://seekingalpha.com/pr/19991875-totalenergies-proposes-a-dividend-of-3_22-share-for-fiscal-year-2024-a-7-percent-increase\" target=\"_blank\">€0.85/share interim dividend</a>, <span class=\"green\">7.6% increase</span> from prior dividend of €0.79.</li> <li>Payable July 1; for shareholders of record June 19; ex-div June 19.</li> <li>Payable July 11 to ADS holders; record date June 18; ex-div June 18.</li> <li>The company<span class=\"paywall-full-content invisible\"> said that the distribution of a dividend of €3.22/share for fiscal year 2024, a 7% increase compared to the dividend for fiscal year 2023 of €3.01/share. This increase is comparable to the 7.1% increase for fiscal year 2023 versus 2022.</span> </li> <li class=\"paywall-full-content invisible\">Furthermore, the board is considering a first interim dividend for 2025 (paid in the 4<sup>th</sup> quarter of 2025) at the level of the final dividend for fiscal year 2024.</li> <li class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/TTE/dividends?source=news_bullet\">See TTE Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li> </ul> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403306-totalenergies-raises-interim-dividend-by-76-to-085",
            "pub_date": "2025-02-05 11:24:19",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403304",
            "title": "Toyota Motor reports nine-month results",
            "description": "<html><body><ul> <li>Toyota Motor press release (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TM\" title=\"Toyota Motor Corporation\">TM</a></span>): GAAP PES of ¥307.95</li> <li>Revenue of ¥35.67T (+4.8% Y/Y).</li> <li>Operating income ¥3,679.4B (a decrease of ¥560.7B or 13.2% compared with FY2024 first nine months)</li> <li>Income before income taxes ¥5,430B (an increase of ¥73B or 1.4% compared with FY2024 first nine months) Net<span class=\"paywall-full-content invisible\"> income attributable to Toyota Motor Corporation ¥4,100.3B.</span> </li> <li class=\"paywall-full-content invisible\">For FY 2025, the company expects: Sales revenues of ¥47T, Operating income of ¥4.7T, Income before income taxes of ¥6.18T and Net income of ¥4.52T.</li> </ul> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403304-toyota-motor-reports-nine-month-results",
            "pub_date": "2025-02-05 11:13:31",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403305",
            "title": "Alfa Laval acquires UK-based NRG Marine",
            "description": "<html><body><ul> <li>Alfa Laval (<a href=\"https://seekingalpha.com/symbol/ALFVY\" title=\"Alfa Laval AB (publ)\">OTCPK:ALFVY</a>) has signed an agreement to <a href=\"https://seekingalpha.com/pr/19991871-alfa-laval-to-acquire-nrg-marine-to-advance-innovative-anti-fouling-technology\">acquire</a> NRG Marine, a UK-based supplier of ultrasonic antifouling solutions for industrial, marine and oil and gas applications, for an undisclosed sum.</li> <li>The development to expand Alfa Laval's portfolio and meet increasing demand across<span class=\"paywall-full-content invisible\"> industries by the increased use of innovative ultrasonic anti-fouling technology.</span> </li> <li class=\"paywall-full-content invisible\">This acquisition aligns with future legislation and is considered more environmentally friendly, a growing concern for Alfa Laval's customer segments.</li> <li class=\"paywall-full-content invisible\">The acquisition is expected to close in the second quarter of this year.</li> </ul> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523256032/image_523256032.jpg",
            "link": "https://seekingalpha.com/news/4403305-alfa-laval-acquires-uk-based-nrg-marine",
            "pub_date": "2025-02-05 11:15:48",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403294",
            "title": "TotalEnergies beats top-line and bottom-line estimates; initiates FY25 outlook",
            "description": "<html><body><ul> <li>TotalEnergies <a href=\"https://seekingalpha.com/pr/19991875-totalenergies-proposes-a-dividend-of-3_22-share-for-fiscal-year-2024-a-7-percent-increase\">press release</a> (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a></span>): Q4 Non-GAAP EPS of $1.90 <span class=\"green\"> beats by $0.09</span>.</li> <li>Revenue of $47.12B (-14.0% Y/Y) <span class=\"green\"> beats by $4.35B</span>.</li> <li>Sales of petroleum products in the fourth quarter 2024 were down 5% quarter-to-quarter, mainly due to seasonality of European fuel demand.</li> <li class=\"paywall-full-content invisible\">2024 dividend increase of 7% - $8 billion buybacks in 20248.3% gearing at year-end 2024.</li> <li class=\"paywall-full-content invisible\">In the Oil &amp; Gas business, fourth quarter production was 2.43 Mboe/d.</li> <li class=\"paywall-full-content invisible\">Hydrocarbon production was 2,434 thousand barrels of oil equivalent per day in 2024, up 2% year-on-year (excluding the Canada disposal representing 3.5%). Hydrocarbon production for LNG in the fourth quarter was up 6% quarter-to-quarter.</li> <li class=\"paywall-full-content invisible\">Net power production was 11.4 TWh in the fourth quarter 2024, up 2% on the quarter due to the seasonal increase in power production from flexible capacities in Europe.</li> <li class=\"paywall-full-content invisible\">\"Furthermore, the Board of Directors confirmed a shareholder return policy for 2025 targeting &gt;40% CFFO payout, which will combine interim dividends increasing by 7.6% to €0.85/share and $2 billion of share buybacks per quarter, a level which will be pursued under reasonable market conditions.\"</li> <li class=\"paywall-full-content invisible\"> <strong>Outlook:</strong> In 2025, TotalEnergies anticipates its hydrocarbon production will grow more than 3%, benefiting from the ramp-up of 2024 start-ups and production start-ups, notably Ballymore in the Gulf of Mexico and Mero-4 in Brazil.</li> <li class=\"paywall-full-content invisible\">First quarter 2025 hydrocarbon production is expected to be between 2.5 and 2.55 Mboe/d.</li> <li class=\"paywall-full-content invisible\">The Integrated Power segment is expected to expand in 2025 supported by electricity production growth greater than 20% to reach an annual net electricity generation of more than 50 TWh.</li> <li class=\"paywall-full-content invisible\">Cash flow before working capital is expected to be between $2.5 and $3 billion in 2025.</li> <li class=\"paywall-full-content invisible\">By combining hydrocarbon and electricity production growth, the Company expects to increase energy production by 5% in 2025. Integrated Power production will represent 10% of hydrocarbon production.</li> <li class=\"paywall-full-content invisible\">For 2025, TotalEnergies expects net investments of $17 to $17.5 billion, of which $4.5 billion is dedicated to low carbon energies, mostly Integrated Power.</li> <li class=\"paywall-full-content invisible\"><p>Organic investments should amount to approximately $17 billion, focused on core growth projects to achieve 2030 production targets, down from the $18 billion guidance presented during the Strategy &amp; Outlook in October 2024.</p></li> </ul> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403294-totalenergies-beats-top-line-and-bottom-line-estimates-initiates-fy25-outlook",
            "pub_date": "2025-02-05 10:38:02",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}