{
    "data": [
        {
            "id": "4403343",
            "title": "Keppel sets $100B interim FUM target by 2026, outlines new cost savings of $50M",
            "description": "<html><body><p>Earnings Call Insights: Keppel Ltd. (<a href=\"https://seekingalpha.com/symbol/KPELF\" title=\"Keppel Ltd.\">OTCPK:KPELF</a>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Loh Chin Hua highlighted Keppel’s transformation into a global asset manager and operator, focusing on energy transition, digitalization, and alternative real assets. He noted that the company achieved $1.06 billion in net profit from<span class=\"paywall-full-content invisible\"> continuing operations for FY 2024, a 5% increase compared to FY 2023.</span> </li> <li class=\"paywall-full-content invisible\">The infrastructure segment delivered strong results, with earnings surging 4.9x from $137 million in FY 2021 to $673 million in FY 2024. Connectivity earnings grew by 45% year-over-year.</li> <li class=\"paywall-full-content invisible\">Asset management fees increased by 54% to $436 million in FY 2024, with funds under management rising from $55 billion to $88 billion. Keppel is targeting $100 billion in FUM by 2026 and $200 billion by 2030.</li> <li class=\"paywall-full-content invisible\">Free cash inflow for the year was $901 million, compared to a $384 million outflow in the prior year. The company also achieved $70 million in recurring annual cost savings ahead of schedule and set a new target of an additional $50 million in savings by 2026.</li> <li class=\"paywall-full-content invisible\">CFO Kevin Chng elaborated that recurring income accounted for 72% of net profit from continuing operations in FY 2024, reflecting improved earnings quality.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Loh Chin Hua stated that Keppel is focused on achieving its $10 billion to $12 billion asset monetization target by 2026, with $7 billion already announced. Monetization efforts include legacy offshore and marine assets valued at $3.6 billion.</li> <li>The company plans to double the gross power capacity of its data center portfolio to 1.2 gigawatts in the coming years, supported by $10 billion in expected new FUM from Keppel Data Center Fund III and other co-investments.</li> <li>Keppel’s Infrastructure segment aims to leverage a $40 billion deal flow pipeline and $26 billion in dry powder to expand clean energy and decarbonization initiatives, including long-term contracts worth over $100 million in annual EBITDA starting 2025.</li> <li>The company is also advancing two new subsea cable systems, focusing on connecting Southeast Asia to broader regions, and expects internal rate of returns in the mid-teens for these projects.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Net profit from continuing operations grew to $1.064 billion in FY 2024, up 5% from $1.015 billion in FY 2023. ROE improved to 10.1%.</li> <li>The Connectivity segment reported a 45% increase in net profit to $184 million, driven by higher acquisition fees and improved data center performance.</li> <li>The Real Estate segment recorded a net profit of $306 million, down 3% year-over-year, attributed to lower profits from trading projects in China and Singapore.</li> <li>Free cash flow improved significantly, with net cash from operating activities rising to $200 million and net cash from investing activities reaching $701 million.</li> <li>Dividend payout for FY 2024 totaled $0.34 per share, including a proposed final dividend of $0.19 per share.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Zhiwei Foo, Macquarie Research, inquired about M1’s EBITDA growth and subsea cable project details. CEO Loh Chin Hua attributed M1’s growth to digitalization reducing costs, while emphasizing the focus on executing the Bifrost project by the second half of 2025. He highlighted expected IRRs above 30% for Bifrost and mid-teens for future systems.</li> <li>Lim Siew Khee, CGS International, asked about valuation gains in Real Estate and progress on Asset Co monetization. CFO Kevin Chng noted valuation gains were driven by assets in Singapore and Vietnam, while Asset Co monetization efforts include bareboat charters and potential fund formation.</li> <li>Brandon Lee, Citigroup Inc., questioned asset monetization targets and AI chip export restrictions. Management reiterated the $10 billion to $12 billion target and emphasized opportunities arising from AI democratization and cost reductions.</li> <li>Felicia Tan, The Edge Singapore, asked about investor preferences and interest rate impacts. CEO Loh Chin Hua explained that Keppel’s strategy balances real asset ownership with fund management, while higher rates are already factored into underwriting models.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts raised questions about monetization targets, subsea cable expansion, and broader strategic initiatives, reflecting cautious optimism. Concerns about dividend consistency and legacy asset monetization were evident. Tone was slightly positive.</li> <li>Management conveyed confidence in Keppel’s transformation, highlighting recurring income growth, infrastructure expansion, and progress on cost savings. Tone was confident, supported by specific forward-looking metrics.</li> <li>Compared to earlier quarters, management appeared increasingly optimistic about achieving strategic milestones, while analysts maintained a neutral-to-slightly-positive stance, balancing opportunities and risks.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"><li>No prior quarter data was provided for comparison.</li></ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management acknowledged challenges in monetizing legacy offshore and marine assets, stating efforts are underway to derisk the $3.6 billion portfolio.</li> <li>Analysts expressed concerns about the competitive landscape for digital connectivity and potential valuation impacts from higher interest rates.</li> <li>Real Estate development profits declined due to weaker market conditions in China and Singapore, though management aims to mitigate risks through asset-light strategies.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Keppel Ltd. reported strong financial results for Q4 2024, driven by growth in connectivity and infrastructure segments, alongside a significant increase in funds under management. The company remains focused on achieving its $10 billion to $12 billion asset monetization target by 2026 and expanding recurring income streams through investments in clean energy, digital infrastructure, and asset management. With a commitment to cost optimization and leveraging AI advancements, Keppel appears well-positioned to deliver value for its shareholders and limited partners.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/KPELF/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403343-keppel-sets-100b-interim-fum-target-by-2026-outlines-new-cost-savings-of-50m",
            "pub_date": "2025-02-05 12:51:32",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403308",
            "title": "Biggest stock movers Wednesday: GOOG, AMD, and more",
            "description": "<html><body><p>Stock futures edged lower Wednesday morning as trade tensions between the U.S. and China weighed on investor sentiment.</p> <p>Here are some of Wednesday's biggest stock movers:</p> <h2>Biggest stock gainers</h2> <ul> <li>Shares of Snap (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/SNAP\" title=\"Snap Inc.\">SNAP</a></span>) rose <span style=\"color: #008000;\">more than 5%</span> after<span class=\"paywall-full-content invisible\"> delivering strong Q4 results, with revenue rising ~15% Y/Y and daily active users up 9%. For Q1, the company guided revenue between $1.33B and $1.36B, surpassing estimates of $1.33B, but its adjusted EBITDA forecast of $40M–$75M fell short of the $79.9M consensus. The company expects daily active users to reach 459M in the current quarter.</span> </li> <li class=\"paywall-full-content invisible\">Lumen Technologies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/LUMN\" title=\"Lumen Technologies, Inc.\">LUMN</a></span>) shares <span style=\"color: #008000;\">surged nearly 10%</span> following upbeat Q4 results, driven by an 18.9% Y/Y rise in fiber broadband revenue within its Mass Markets segment and 42,000 Quantum Fiber customer additions, bringing total fiber-enabled homes to 4.16M by year-end. For FY2025, the company projects EBITDA between $3.2B and $3.4B and free cash flow of $700M to $900M. Lumen aims to achieve over $250M in run-rate cost savings by year-end, supporting its long-term goal of $1B in expense reductions by 2027. The company expects FY2025 capital expenditures in the range of $4.1B to $4.3B, with a focus on PCF contracts.</li> <li class=\"paywall-full-content invisible\">Enphase Energy (<a href=\"https://seekingalpha.com/symbol/ENPH\" title=\"Enphase Energy, Inc.\">ENPH</a>) shares <span style=\"color: #008000;\">climbed 8%</span> after reporting better-than-expected Q4 results, with revenue rising 26.5% Y/Y. The company posted a GAAP gross margin of 51.8% and a non-GAAP gross margin of 53.2%, including a net IRA benefit of 13.5%. Free cash flow came in at $159.2M, with total liquidity of $1.72B. For Q1 2025, Enphase guided revenue between $340M and $380M, above the $340.91M consensus, including $50M in safe harbor revenue and shipments of 150–170 MWh of IQ Batteries. Non-GAAP gross margin is expected in the 48%–51% range, or 38%–41% excluding IRA benefits, with net IRA benefits projected at $36M–$39M based on 1.2M U.S.-manufactured microinverter shipments.</li> </ul> <h2 class=\"paywall-full-content invisible\">Biggest stock losers</h2> <ul class=\"paywall-full-content invisible\"> <li>Alphabet (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a></span>) (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a></span>) shares <span style=\"color: #ff0000;\">tumbled nearly 7% </span>after reporting mixed Q4 results, missing revenue expectations, and announcing a higher-than-expected $75B CapEx plan for FY2025, well above the $57.9B consensus. The company projects $16B–$18B in Q1 spending, with most investments directed toward AI-driven technical infrastructure, including servers and data centers. The company also warned of Q1 revenue headwinds from forex impacts and one fewer day of sales compared to the prior year, while also highlighting AI-driven growth in Search and Cloud, though Cloud revenue could see variability depending on new capacity rollouts.</li> <li>Advanced Micro Devices (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/AMD\" title=\"Advanced Micro Devices, Inc.\">AMD</a></span>) shares <span style=\"color: #ff0000;\">plunged over 9% </span>despite posting record Q4 2024 revenue growth of 24% Y/Y as investors reacted to slowing Data Center segment growth. While segment revenue surged 69% Y/Y, it marked the slowest increase in a year, down from 122% in Q3 and 114.5% in Q2. Weighing on sentiment, AMD’s Q1 revenue forecast of $6.8B–$7.4B, with a $7.1B midpoint slightly above the $7.04B consensus, failed to ease concerns over decelerating growth in its key business segment.</li> </ul> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1358927461/image_1358927461.jpg",
            "link": "https://seekingalpha.com/news/4403308-biggest-stock-movers-wednesday-goog-amd-and-more",
            "pub_date": "2025-02-05 13:00:39",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403342",
            "title": "GSK reports Q4 results, raises long-term outlook",
            "description": "<html><body><ul> <li>GSK <a href=\"https://www.gsk.com/en-gb/media/press-releases/gsk-delivers-strong-2024-performance-with-further-improvement-to-long-term-growth-outlook/\" rel=\"nofollow\" target=\"_blank\">press release</a> (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/GSK\" title=\"GSK plc\">GSK</a></span>): Q4 Core EPS of 23.20 p.</li> <li>Revenue of £8.11B (+0.7% Y/Y).</li> <li>For FY : Total 2024 sales £31.4 billion +3% AER; +7% CER; Specialty Medicines sales +19%. HIV sales +13%. Oncology +98%. Respiratory/Immunology and Other +13%; Vaccines sales -4%. <em class=\"paywall-full-content invisible\">Shingrix</em><span class=\"paywall-full-content invisible\"> +1% and</span><em class=\"paywall-full-content invisible\"> Arexvy</em><span class=\"paywall-full-content invisible\"> -51%; General Medicines sales +6%. </span><em class=\"paywall-full-content invisible\">Trelegy</em><span class=\"paywall-full-content invisible\"> +27%.</span> </li> <li class=\"paywall-full-content invisible\">FY Core EPS of 159.3p.</li> <li class=\"paywall-full-content invisible\">Expect 2025 turnover growth of between 3% to 5%; Core operating profit growth of between 6% to 8%; Core EPS growth of between 6% to 8%, including the expected benefit from the share buyback programme</li> <li class=\"paywall-full-content invisible\">2031 sales outlook increased to more than £40 billion (previously &gt;£38 billion), reflecting late-stage pipeline progress</li> </ul> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2177313278/image_2177313278.jpg",
            "link": "https://seekingalpha.com/news/4403342-gsk-reports-q4-results-raises-long-term-outlook",
            "pub_date": "2025-02-05 12:51:21",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403301",
            "title": "UK's service activity drops in January",
            "description": "<html><body><p> </p> <p>The headline S&amp;P Global UK Services PMI Business Activity Index registered 50.8in January, down fractionally from 51.1 in December and thejoint-lowest for 15 months.</p> <p>Key findings include: Renewed downturn in order books; marginal output growth in January;fastest reduction in employment for four<span class=\"paywall-full-content invisible\"> years.</span></p> <p class=\"paywall-full-content invisible\">January data highlighted a challenging businessenvironment for UK service providers as stagflationconditions appeared to take a firmer hold at the start of theyear. Output levels increased only marginally, while inputcost inflation accelerated for the fifth month in a row to itshighest since April 2024. Businesses widely noted sharplyrising salary payments and many also felt the impact ofsuppliers passing on forthcoming increases in employers'national insurance contributions.\" <a href=\"https://www.pmi.spglobal.com/Public/Home/PressRelease/9b1d7da04ed34801a47d43b37667529b\" rel=\"noopener\" target=\"_blank\" title=\"said\">said</a> Tim Moore, Economics Director at S&amp;P Global MarketIntelligence.</p> <p class=\"paywall-full-content invisible\">ETFs: (<a href=\"https://seekingalpha.com/symbol/FXB\" title=\"Invesco CurrencyShares British Pound Sterling Trust ETF\">FXB</a>), (<a href=\"https://seekingalpha.com/symbol/EWU\" title=\"iShares MSCI United Kingdom ETF\">EWU</a>), (<a href=\"https://seekingalpha.com/symbol/FKU\" title=\"First Trust United Kingdom AlphaDex ETF\">FKU</a>), (<a href=\"https://seekingalpha.com/symbol/EWUS\" title=\"iShares Trust - iShares MSCI United Kingdom Small-Cap ETF\">EWUS</a>), (<a href=\"https://seekingalpha.com/symbol/FLGB\" title=\"Franklin Templeton ETF Trust - Franklin FTSE United Kingdom ETF\">FLGB</a>)</p> <p class=\"paywall-full-content invisible\">Currency: (<a href=\"https://seekingalpha.com/symbol/GBP:USD\" title=\"British Pound / US Dollar\">GBP:USD</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/569332611/image_569332611.jpg",
            "link": "https://seekingalpha.com/news/4403301-uks-service-activity-drops-in-january",
            "pub_date": "2025-02-05 12:33:59",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403292",
            "title": "Shopping on Shein, Temu could get costlier as U.S. ends trade loophole",
            "description": "<html><body><p>Americans may have to pay more when shopping on low-cost e-commerce platforms like Shein, Temu, AliExpress and Amazon (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a></span>) Haul, as President Donald Trump ended a trade loophole for duty-free shipping of certain packages.</p> <p>The trade exemption, called \"de minimis,\" waived standard customs<span class=\"paywall-full-content invisible\"> duties for shipping packages worth less than $800 to the U.S. De minimis shipments have swelled from about 139M in 2015 to over 1.36B in 2024. </span></p> <p class=\"paywall-full-content invisible\">The provision helped Chinese e-commerce platforms grow their market share in the U.S. through lower prices. Discount marketplace Temu, owned by PDD (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/PDD\" title=\"PDD Holdings Inc.\">PDD</a></span>), and fast fashion retailer Shein together likely accounted for more than 30% of all packages shipped to the U.S. daily under de minimis, the U.S. congressional committee on China noted in 2023.</p> <p class=\"paywall-full-content invisible\">The committee said nearly all products on Temu and Shein are valued under $800 and \"can enter the U.S. uninspected and free from duties that most American clothing brands pay.\"</p> <p class=\"paywall-full-content invisible\">Amazon (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a></span>) Haul, which launched in November, lists goods from China-based sellers <a href=\"https://seekingalpha.com/news/4288416-amazon-haul-store-rival-temu-shein\" rel=\"noopener\" target=\"_blank\" title=\"priced $20 or less\">priced $20 or less</a>, although shipping times are longer. Ending de minimis is not expected to have a major impact on Amazon, as Haul is a relatively new and small business for the e-commerce giant.</p> <p class=\"paywall-full-content invisible\">Meanwhile, Shein and Temu have taken steps to offset the impact, such as sourcing more products from outside China and opening warehouses in the U.S. </p> <p class=\"paywall-full-content invisible\">\"So the lifting of de minimis will not impact 100% of the products they sell in the U.S.,\" Juozas Kaziukenas, CEO of e-commerce data firm Marketplace Pulse, <a href=\"https://www.reuters.com/business/retail-consumer/shein-temu-amazon-haul-set-price-hikes-us-shuts-trade-loophole-2025-02-04/\" rel=\"noopener\" target=\"_blank\" title=\"told\">told</a> <em>Reuters</em>. \"It will have an impact, but it's not going to be the end of the reign of Shein and Temu.\"</p> <p class=\"paywall-full-content invisible\">But small and medium-sized online retailers that source products from China are expected to be the most affected, as they have fewer resources to diversify their supply chain. </p> <p class=\"paywall-full-content invisible\">According to industry <a href=\"https://nam.org/wp-content/uploads/2024/03/DM-Letter-re-321-3.5-PDF.pdf\" rel=\"noopener\" target=\"_blank\" title=\"associations\">associations</a>, de minimis packages could double in price if the loophole ended. \"This added cost would feed inflation in the form of a massive, regressive tax hike on American consumers.\"</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2184459791/image_2184459791.jpg",
            "link": "https://seekingalpha.com/news/4403292-shein-temu-amazon-haul-aliexpress-prices-de-minimis",
            "pub_date": "2025-02-05 12:15:59",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403300",
            "title": "European markets dip amid escalating trade tensions, and earnings flurry",
            "description": "<html><body><p>London (<a href=\"https://seekingalpha.com/symbol/UKX\" title=\"FTSE 100 Index\">UKX</a>)<span style=\"color: #ff0000;\"> -0.08%</span></p> <p>Germany (<a href=\"https://seekingalpha.com/symbol/DAX:IND\" title=\"DAX Germany Index\">DAX:IND</a>) <span style=\"color: red;\">-0.42% </span><a href=\"https://seekingalpha.com/news/4403298-germanys-service-activity-growth-hits-six-month-high\" rel=\"noopener\" target=\"_blank\" title=\"Germany's service activity growth hits six-month high\">Germany's service activity growth hits six-month high.</a></p> <p>France (<a href=\"https://seekingalpha.com/symbol/CAC:IND\" title=\"CAC 40 France Index\">CAC:IND</a>) <span style=\"color: red;\">-0.27% </span><a class=\"text-share-text visited:text-share-text hover:text-share-text focus:text-share-text\" data-test-id=\"post-list-item-title\" href=\"https://seekingalpha.com/news/4403297-france-service-activity-falls-in-january#source=section%3Asummary%7Csection_asset%3Aall_news%7Cfirst_level_url%3Asymbol%7Cbutton%3ATitle%7Clock_status%3ANo%7Cline%3A1\">France service activity falls in January. </a>Industrial production fell 0.4% M/M in December.</p> <p>Iceland’s Central Bank cut its key interest rate by 50 bps to 8.0%, aligning with market expectations.</p> <p class=\"paywall-full-content invisible\">The Services PMI in Sweden fell to 50.1 in January</p> <p class=\"m-0 grow text-share-text no-underline visited:text-share-text hover:text-share-text focus:text-share-text text-x-large-r lg:text-large-r mb-4 paywall-full-content invisible\"><a class=\"text-share-text visited:text-share-text hover:text-share-text focus:text-share-text\" data-test-id=\"post-list-item-title\" href=\"https://seekingalpha.com/news/4403296-spains-service-pmi-drops-in-january#source=first_level_url%3Amarket-news%7Csection_asset%3Amain%7Csection%3Amarket-pulse%7Cline%3A1\">Spain's service PMI drops in January</a>.</p> <p class=\"paywall-full-content invisible\">Retail sales in the Czech Republic advanced by 6.2% Y/Y in December.</p> <p class=\"paywall-full-content invisible\">The pan-European <a href=\"https://seekingalpha.com/symbol/STOXX\">Stoxx 600</a> (<a href=\"https://seekingalpha.com/symbol/STOXX\" title=\"STOXX Europe 600 Index\">STOXX</a>) <span style=\"color: #008000;\">climbed 0.06% </span>as investors<a href=\"https://seekingalpha.com/news/4403283-trump-in-no-hurry-to-speak-to-chinas-xi-jinping-over-escalating-trade-tensions\" rel=\"noopener\" target=\"_blank\" title=\" watched escalated trade tensions between U.S. and China\"> watched escalated trade tensions between U.S. and China</a>.</p> <p class=\"paywall-full-content invisible\">In corporate news, Novo Nordisk <a href=\"https://seekingalpha.com/news/4403285-novo-nordisk-gaap-eps-of-dkk-634-revenue-of-dkk-8568b-initiates-fy25-outlook\" rel=\"noopener\" target=\"_blank\" title=\"posted stronger-than-expected profits\">posted stronger-than-expected profits</a> for Q4 driven by a 107% surge in sales of its Wegovy weight loss drug. Among other companies posting earnings include: Banco Santander (<a href=\"https://seekingalpha.com/symbol/SAN\" title=\"Banco Santander, S.A.\">SAN</a>), Credit Agricole, GSK (<a href=\"https://seekingalpha.com/symbol/GSK\" title=\"GSK plc\">GSK</a>), Handelsbanken, and TotalEnergies. TotalEnergies (<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a>) <a href=\"https://seekingalpha.com/news/4403294-totalenergies-beats-top-line-and-bottom-line-estimates-initiates-fy25-outlook\" rel=\"noopener\" target=\"_blank\" title=\"beats top-line\">beat top-line</a> and bottom-line estimates; initiates FY25 outlook.</p> <p class=\"paywall-full-content invisible\"><strong>Coming up in the next session: </strong>UK Services PMI expected shortly.</p> <p class=\"paywall-full-content invisible\">In the bond market, the U.S. 10-year Treasury yield down 8 basis points to 4.54%.</p> <p class=\"paywall-full-content invisible\">Germany's 10-year yield unchanged at 2.51%.</p> <p class=\"paywall-full-content invisible\">UK's 10-year yield was down 4 basis points to 4.59%.</p> <p class=\"paywall-full-content invisible\">Currencies: (<a href=\"https://seekingalpha.com/symbol/EUR:USD\" title=\"Euro / US Dollar\">EUR:USD</a>) (<a href=\"https://seekingalpha.com/symbol/GBP:USD\" title=\"British Pound / US Dollar\">GBP:USD</a>) (<a href=\"https://seekingalpha.com/symbol/CHF:USD\" title=\"Swiss Franc / US Dollar\">CHF:USD</a>)</p> <p class=\"paywall-full-content invisible\">ETFs: (<a href=\"https://seekingalpha.com/symbol/EWG\" title=\"iShares MSCI Germany ETF\">EWG</a>), (<a href=\"https://seekingalpha.com/symbol/GF\" title=\"New Germany Fund\">GF</a>), (<a href=\"https://seekingalpha.com/symbol/EWI\" title=\"iShares MSCI Italy Capped ETF\">EWI</a>), (<a href=\"https://seekingalpha.com/symbol/EWQ\" title=\"iShares MSCI France ETF\">EWQ</a>), (<a href=\"https://seekingalpha.com/symbol/FGM\" title=\"First Trust Germany AlphaDex ETF\">FGM</a>), (<a href=\"https://seekingalpha.com/symbol/DAX\" title=\"Global X Funds - Global X DAX Germany ETF\">DAX</a>), (<a href=\"https://seekingalpha.com/symbol/FLGR\" title=\"Franklin FTSE Germany ETF\">FLGR</a>), (<a href=\"https://seekingalpha.com/symbol/FXB\" title=\"Invesco CurrencyShares British Pound Sterling Trust ETF\">FXB</a>), (<a href=\"https://seekingalpha.com/symbol/EWU\" title=\"iShares MSCI United Kingdom ETF\">EWU</a>), (<a href=\"https://seekingalpha.com/symbol/FKU\" title=\"First Trust United Kingdom AlphaDex ETF\">FKU</a>), (<a href=\"https://seekingalpha.com/symbol/EWUS\" title=\"iShares Trust - iShares MSCI United Kingdom Small-Cap ETF\">EWUS</a>), (<a href=\"https://seekingalpha.com/symbol/FLGB\" title=\"Franklin Templeton ETF Trust - Franklin FTSE United Kingdom ETF\">FLGB</a>), (<a href=\"https://seekingalpha.com/symbol/GREK\" title=\"Global X MSCI Greece ETF\">GREK</a>).</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1386414631/image_1386414631.jpg",
            "link": "https://seekingalpha.com/news/4403300-european-markets-dip-amid-escalating-trade-tensions-and-earnings-flurry",
            "pub_date": "2025-02-05 12:12:13",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403299",
            "title": "Euro Area's service sector almost flat in January, Composite PMI rises slightly",
            "description": "<html><body><p> </p> <p>HCOB Services PMI Business Activity Index posted at 51.3 in January (Dec: 51.6), 2-month low.</p> <p>HCOB Eurozone Composite PMI Output Index at 50.2 (Dec: 49.6), 5-month high.</p> <p>Economy returns to growth, but sustained fall in new business suggests fragile recovery.</p> <p class=\"paywall-full-content invisible\">“The slow pace of growth in the services sector, which was evident almost all of last year, continued at the start of 2025.Putting it more positively, growth at service companies played a crucial role in keeping the eurozone economy in expansionover the past year. Sluggish, but slightly accelerating growth in new orders and employment gives hope that this sector willgain a bit more momentum in the first quarter of this year\" <a href=\"https://www.pmi.spglobal.com/Public/Home/PressRelease/10c99644901c4679969e9f1d5c32fc47\" rel=\"noopener\" target=\"_blank\" title=\"said\">said</a> Dr. Cyrus de la Rubia, Chief Economist at Hamburg Commercial Bank.</p> <p class=\"paywall-full-content invisible\">ETFs: (<a href=\"https://seekingalpha.com/symbol/EWG\" title=\"iShares MSCI Germany ETF\">EWG</a>), (<a href=\"https://seekingalpha.com/symbol/GF\" title=\"New Germany Fund\">GF</a>), (<a href=\"https://seekingalpha.com/symbol/EWI\" title=\"iShares MSCI Italy Capped ETF\">EWI</a>), (<a href=\"https://seekingalpha.com/symbol/EWQ\" title=\"iShares MSCI France ETF\">EWQ</a>), (<a href=\"https://seekingalpha.com/symbol/FGM\" title=\"First Trust Germany AlphaDex ETF\">FGM</a>), (<a href=\"https://seekingalpha.com/symbol/DAX\" title=\"Global X Funds - Global X DAX Germany ETF\">DAX</a>)</p> <p class=\"paywall-full-content invisible\">Currency: (<a href=\"https://seekingalpha.com/symbol/EUR:USD\" title=\"Euro / US Dollar\">EUR:USD</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1412682529/image_1412682529.jpg",
            "link": "https://seekingalpha.com/news/4403299-euro-areas-service-sector-almost-flat-in-january-composite-pmi-rises-slightly",
            "pub_date": "2025-02-05 12:08:15",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403297",
            "title": "France service activity falls in January",
            "description": "<html><body><p>The seasonally adjusted HCOB France Services PMI Business Activity Index — which measures changes in the volume of business activity compared with one month previously — dropped from December's 49.3 to 48.2 in January.</p> <p>Key findings include: activity levels fall at slightly<span class=\"paywall-full-content invisible\"> faster rate as demand weakness persists; prices charged lowered for first time since April 2021; employment falls as business confidence sinks to 56-month low.</span></p> <p class=\"paywall-full-content invisible\">\"France's service sector downturn continued in January. The HCOB PMI for services suggested that 2025 will be achallenging year. Political uncertainty dampened activity, according to some panel members, while others attributed theslowdown to weaker customer demand and reduced confidence in the economic outlook. Given the political situation, it isunderstandable that companies are feeling uncertain. France's Prime Minister François Bayrou is fighting for his politicalsurvival while striving to pass a 2025 budget that meets the fiscal sustainability expectations of the EU Commission andfinancial markets.\" <a href=\"https://www.pmi.spglobal.com/Public/Home/PressRelease/409e3fed8d8e4ed9aa710b792e090f37\" rel=\"nofollow\" target=\"_blank\">said</a> Dr Tariq Kamal Chaudhry, Economist at Hamburg at Hamburg Commercial Bank.</p> <p class=\"paywall-full-content invisible\">ETFs: (NYSEARCA:<a href=\"https://seekingalpha.com/symbol/EWQ\">EWQ</a>)</p> <p class=\"paywall-full-content invisible\">Currency: (<a href=\"https://seekingalpha.com/symbol/EUR:USD\" title=\"Euro / US Dollar\">EUR:USD</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/172301500/image_172301500.jpg",
            "link": "https://seekingalpha.com/news/4403297-france-service-activity-falls-in-january",
            "pub_date": "2025-02-05 11:53:10",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403298",
            "title": "Germany's service activity growth hits six-month high",
            "description": "<html><body><p> </p> <p>The headline HCOB Germany Services PMI Business Activity Index saw a reading of 52.5, up from 51.2 in December, a six-month-high.</p> <p>HCOB Germany Composite PMI Output Index at 50.5 (Dec: 48.0), an 8-month high.</p> <p>Inflationary pressures increase amid steep<span class=\"paywall-full-content invisible\"> and accelerated rise in costs.</span></p> <p class=\"paywall-full-content invisible\">“This is an encouraging start to the year. Growth seems to have a chance again, as the composite PMI has climbed abovethe 50-point mark for the first time in seven months. This is thanks to the service sector, which expanded its business activityat a modest but faster pace than the previous month. The manufacturing sector isn't dragging the overall economy down asmuch anymore. Overall, the situation looks relatively good given the many uncertainties.\" <a href=\"https://www.pmi.spglobal.com/Public/Home/PressRelease/67c18efdc15b46388e4a12994440f328\" rel=\"noopener\" target=\"_blank\" title=\"said\">said</a>, Dr. Cyrus de la Rubia, Chief Economist at Hamburg Commercial Bank.</p> <p class=\"paywall-full-content invisible\">ETFs: (<a href=\"https://seekingalpha.com/symbol/EWG\" title=\"iShares MSCI Germany ETF\">EWG</a>), (<a href=\"https://seekingalpha.com/symbol/GF\" title=\"New Germany Fund\">GF</a>), (<a href=\"https://seekingalpha.com/symbol/FGM\" title=\"First Trust Germany AlphaDex ETF\">FGM</a>), (<a href=\"https://seekingalpha.com/symbol/DAX\" title=\"Global X Funds - Global X DAX Germany ETF\">DAX</a>), (<a href=\"https://seekingalpha.com/symbol/FLGR\" title=\"Franklin FTSE Germany ETF\">FLGR</a>) (<a href=\"https://seekingalpha.com/symbol/DAX:IND\" title=\"DAX Germany Index\">DAX:IND</a>)</p> <p class=\"paywall-full-content invisible\">Currency: (<a href=\"https://seekingalpha.com/symbol/EUR:USD\" title=\"Euro / US Dollar\">EUR:USD</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/619762776/image_619762776.jpg",
            "link": "https://seekingalpha.com/news/4403298-germanys-service-activity-growth-hits-six-month-high",
            "pub_date": "2025-02-05 11:58:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403309",
            "title": "Vestas Wind reports Q4 results; initiates FY25 outlook and share buyback of €100M",
            "description": "<html><body><ul> <li>Vestas Wind <a href=\"https://www.vestas.com/content/dam/vestas-com/global/en/investor/reports-and-presentations/financial/2024/fy-2024/250205_02_Company_Announcement.pdf.coredownload.inline.pdf\" rel=\"nofollow\" target=\"_blank\">press release</a> (<a href=\"https://seekingalpha.com/symbol/VWDRY\" title=\"Vestas Wind Systems A/S\">OTCPK:VWDRY</a>): Q4 Revenue of €6.14B (+28.7% Y/Y).</li> <li>EBIT before special items amounted to €759m, resulting in an EBIT margin before special items of 12.4 percent, compared to 4.0 percent in the fourth quarter of 2023.</li> <li>Adjusted free cash<span class=\"paywall-full-content invisible\"> flow amounted to €1,792m compared to €1,656m in the fourth quarter of 2023.</span> </li> <li class=\"paywall-full-content invisible\">The quarterly intake of firm and unconditional wind turbine orders amounted to 6,516 MW, a decrease from the record-high fourth quarter 2023.</li> <li class=\"paywall-full-content invisible\">The value of the wind turbine order backlog was €31.6bn as at 31 December 2024.</li> <li class=\"paywall-full-content invisible\">In addition to the wind turbine order backlog, at the end of the quarter, Vestas had service agreements with expected contractual future revenue of €36.8B. Thus, the value of the combined backlog of wind turbine orders and service agreements stood at €68.4B – an increase of €8.3B compared to the year-earlier period.</li> <li class=\"paywall-full-content invisible\">A dividend of DKK 0.55 per share is proposed, and a share buyback of €100M will be initiated.</li> <li class=\"paywall-full-content invisible\">\"<strong>Our financial outlook for 2025</strong> is as follows: Revenue is expected to range between €18-20B, with an EBIT margin before special items of 4-7 percent. Total investments are expected to amount to approx. €1.2bn in 2025. The Service segment is expected to generate EBIT before special items in 2025 around €700M.\"</li> </ul> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403309-vestas-wind-reports-q4-results-initiates-fy25-outlook-and-share-buyback-of-100m",
            "pub_date": "2025-02-05 11:47:50",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}