{
    "data": [
        {
            "id": "4558821",
            "title": "Eos Energy cut at Guggenheim on 'struggle' with financial forecasting, communication",
            "description": "<html><body><p data-eci=\"true\">Eos Energy Enterprises (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EOSE\" title=\"Eos Energy Enterprises, Inc.\">EOSE</a></span>) -10.1% in Friday's trading, its second straight sharp decline that totals more than 40%, after reporting much lower than expected <a href=\"https://seekingalpha.com/news/4557649-eos-energy-enterprises-misses-top-line-and-bottom-line-estimates-introduces-fy26-outlook\" target=\"_self\" title=\"Q4 adjusted earnings\">Q4 adjusted earnings</a> and revenues while initiating below-consensus FY 2026 revenue guidance of $300M-$400M.</p>\n<p>Guggenheim analyst Joseph Osha downgraded shares to Neutral from Buy, saying Eos Energy (<a href=\"https://seekingalpha.com/symbol/EOSE\" title=\"Eos Energy Enterprises, Inc.\">EOSE</a>) is making operational progress, but management is \"not paying sufficient attention to financial forecasting and public targets,\" resulting in \"disjointed and inconsistent financial information.\"</p>\n<p>The problem for Eos Energy (<a href=\"https://seekingalpha.com/symbol/EOSE\" title=\"Eos Energy Enterprises, Inc.\">EOSE</a>) investors is \"the company's continued inability to provide reasonable forecasts for its business,\" saying management was \"confidently reiterating a higher number well into the quarter, when manufacturing operations would have already been experiencing problems,\" Osha wrote.</p>\n<p>Weighing the stock's valuation, Osha said he still sees a \"sufficient chance of success\" to support an unchanged 28x multiple based on our much lower 2029 EBITDA estimate, still discounted back to the present at 8% per annum,\" which supports a Neutral rating.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558821-eos-energy-cut-at-guggenheim-on-struggle-with-financial-forecasting-communication",
            "pub_date": "2026-02-28 02:16:23",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558832",
            "title": "TPG's exposure to failed UK-based MFS is about £44M - report",
            "description": "<html><body><p data-eci=\"true\">TPG (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TPG\" title=\"TPG Inc.\">TPG</a></span>) joins the list of Wall Street lenders exposed to the failed UK mortgage finance firm, Market Financial Solutions, <a href=\"https://www.bloomberg.com/news/videos/2026-02-27/tpg-has-59-million-exposure-to-collapsed-lender-mfs-video\" rel=\"nofollow\" target=\"_blank\" title=\"Bloomberg\">Bloomberg</a> reported on Friday.</p>\n<p>The global alternative asset management firm has £44M worth of exposure to MFS, a company spokesperson told the news outlet in an emailed statement.</p>\n<p>The exposure is below 2% of MFS's loan exposures based on publicly reported figures, the spokesperson reportedly said.</p>\n<p>The Fort Worth, Texas-based company is the latest name to be added to the <a href=\"https://seekingalpha.com/news/4558063-barclays-santander-wells-fargo-in-street-lenders-exposed-to-failed-uk-based-mfs---report\" target=\"_blank\" title=\"list of Wall Street lenders\">list of Street lenders</a> exposed to MFS insolvency.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558832-tpgs-exposure-to-failed-uk-based-mfs-is-about-44m---report",
            "pub_date": "2026-02-28 02:16:23",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558841",
            "title": "Braemar Hotels outlines continued portfolio strength and strategic asset sales amid challenging hospitality environment",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Braemar Hotels &amp; Resorts (BHR) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li><p>Richard Stockton, President and CEO, highlighted the ongoing sale process for Braemar, noting that \"the company has engaged Robert W. Baird &amp; Co as its financial adviser and the sale process has been initiated.\" Stockton indicated there is no set deadline for completion and added, \"we have also appointed real estate broker co-advisers to evaluate the potential for individual asset sales in conjunction with the company's sale process.\" He emphasized \"our comparable fourth quarter RevPAR was flat, our portfolio delivered 1.8% growth in comparable total revenue this quarter. Our resorts continued to deliver strong growth with comparable fourth quarter RevPAR increasing 4.1% and comparable hotel EBITDA increasing 6%.\" Stockton also stated that, excluding hotels under renovation, \"our RevPAR growth was 2.6% and comparable hotel EBITDA increased 6.4%.\"</p></li>\n<li><p>Stockton reported the sale of the 410-room Clancy in San Francisco for $115 million, noting it represents \"a 5.2% capitalization rate on net operating income for the trailing 12 months ended September 30, 2025. In conjunction with that sale, the company paid down approximately $65 million of debt and retained approximately $44 million of net proceeds.\" He added, \"to date, we have redeemed approximately $149 million of our non-traded preferred stock, which represents approximately 32% of the original capital raise.\"</p></li>\n<li><p>Deric Eubanks, CFO, stated, \"for the quarter, we reported net loss attributable to common stockholders of $46 million or $0.67 per diluted share and AFFO per diluted share of negative $0.02.\" Eubanks added, \"Adjusted EBITDAre for the quarter was $28.8 million. Adjusted EBITDAre for the full year was $147 million.\"</p></li>\n<li><p>Eubanks announced, \"as of the end of the fourth quarter, we had approximately 46.7% net debt to gross assets. We ended the quarter with cash and cash equivalents of $124.4 million plus restricted cash of $42.5 million.\" He also explained the updated preferred equity securities dividend declaration process, stating, \"we are moving from declaring Series B and Series D dividends at the start of the quarter to reserving them on a monthly basis alongside our other Series E and Series M monthly dividend declarations.\"</p></li>\n<li><p>Christopher Nixon, Senior VP &amp; Head of Asset Management, reported, \"comparable hotel RevPAR was flat for the quarter, but we did achieve a 5.4% improvement in ADR compared to the prior year period.\"</p></li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li><p>Management did not issue new specific forward-looking guidance but expressed optimism. Nixon stated, \"we remain confident in our ability to sustain operating momentum and deliver strong results in the periods ahead\" and \"we are pleased with our solid performance and continue to see the benefits of initiatives focused on productivity and cost efficiency.\"</p></li>\n<li><p>Stockton affirmed, \"we are pleased with the performance of our portfolio and believe the renovations have recently -- that we have recently completed will drive strong performance going forward.\"</p></li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li><p>The company reported a net loss attributable to common stockholders of $46 million or $0.67 per diluted share and AFFO per diluted share of negative $0.02 for the quarter.</p></li>\n<li><p>For the full year, net loss attributable to common stockholders was $72.7 million or $1.07 per diluted share and AFFO per diluted share of $0.28. Adjusted EBITDAre for the quarter stood at $28.8 million, with the full year at $147 million.</p></li>\n<li><p>Portfolio delivered comparable fourth quarter RevPAR of $340, in line with the prior year quarter. Resort portfolio reported comparable RevPAR of $536, a 4.1% increase, and comparable hotel EBITDA of $32.5 million, a 6% increase over the prior year period.</p></li>\n<li><p>The Ritz-Carlton Sarasota posted comparable RevPAR growth of approximately 26%, while Four Seasons Resort Scottsdale and Bardessono Hotel &amp; Spa each delivered comparable RevPAR growth of approximately 12%. Ritz-Carlton Reserve, Dorado Beach, achieved comparable RevPAR of $1,806, up 10% over the prior year quarter.</p></li>\n<li><p>During the fourth quarter, the company invested approximately $78 million in capital expenditures and anticipates spending between $25 million and $35 million in 2026.</p></li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul><li>There were no analyst questions during the Q&amp;A segment, and the call concluded without further discussion.</li></ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li><p>Analysts did not raise any concerns or questions as there were no participants in the Q&amp;A segment, resulting in a neutral sentiment.</p></li>\n<li><p>Management maintained a confident and slightly positive tone throughout the prepared remarks, with repeated references to \"pleased with our solid performance\" and optimism regarding the impact of renovations and portfolio strength.</p></li>\n<li><p>Compared to the previous quarter, management’s tone remained steady and positive, while the lack of analyst participation meant no change in analyst sentiment.</p></li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li><p>The current quarter emphasized the impact of renovations and asset sales, notably the completion and proceeds from the Clancy sale. In the previous quarter, the focus was also on asset sales and refinancing activities, but this quarter saw the actual completion of the Clancy sale.</p></li>\n<li><p>Management highlighted continued growth in resort performance, with comparable RevPAR growth for resorts at 4.1% in Q4 compared to 5.5% in Q3. Portfolio RevPAR performance was flat in Q4, down from 1.4% growth in the prior quarter, but EBITDA growth in resorts remained robust.</p></li>\n<li><p>Management tone was consistently optimistic about cost efficiency and resilience, while the absence of analyst Q&amp;A this quarter removed a source of scrutiny seen previously.</p></li>\n<li><p>Strategic focus remains on deleveraging, asset repositioning, and maximizing portfolio value amid the ongoing sale process.</p></li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li><p>Stockton reiterated that the sale process has no deadline or definitive timetable and noted there is \"no assurance that this process will result in the sale of the company or its assets.\"</p></li>\n<li><p>Renovation disruptions impacted results at key properties, though management expects completed renovations to drive future performance.</p></li>\n<li><p>Eubanks noted the company has not declared a common equity dividend policy for 2026 due to the ongoing sale process, stating, \"the Board has not declared a policy for 2026 in light of the fact that there is an ongoing company sale process.\"</p></li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Management underscored Braemar’s resilience amid a challenging hospitality environment, highlighting strong resort performance, successful asset sales, ongoing deleveraging, and substantial capital investments. The company remains optimistic that recent renovations and continued focus on cost efficiency will support future growth, while the ongoing sale process and absence of a common dividend policy introduce elements of uncertainty for shareholders.</p>\n<p><a href=\"https://seekingalpha.com/symbol/bhr/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558841-braemar-hotels-outlines-continued-portfolio-strength-and-strategic-asset-sales-amid",
            "pub_date": "2026-02-28 02:10:59",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558830",
            "title": "ANI Pharmaceuticals targets over $1B in 2026 revenue with rare disease focus and expanded sales force",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: ANI Pharmaceuticals (ANIP) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Nikhil Lalwani, President, CEO &amp; Director, highlighted record revenue, adjusted non-GAAP EBITDA, and adjusted non-GAAP diluted EPS for 2025, noting \"full year revenues up 44% year-over-year and adjusted non-GAAP EBITDA by 47% year-over-year.\" He emphasized that Cortrophin Gel revenues rose 76% year-over-year and that the generics business grew 28%. The company set three priorities for 2026: transformation into a leading rare disease company, continued generics execution, and disciplined capital allocation. Lalwani announced a new 90-person organization dedicated to acute gouty arthritis flares, with plans to \"capture sizable and unique additional opportunity in gout through expanding awareness and adoption of Cortrophin\" and to \"deliver over $1 billion in revenue, representing 23% growth over 2025 at the midpoint of our guidance range.\"</li>\n<li>Christopher Mutz, Senior VP &amp; Head of Rare Disease, reported that Cortrophin Gel prescribing in acute gouty arthritis represented about \"15% of total utilization\" and that ophthalmology volumes more than doubled year-over-year. He stated, \"Cortrophin Gel is the only approved ACTH therapy for acute gouty arthritis flares,\" and outlined the rollout of a 90-person team to target this opportunity, building on successful pilot programs.</li>\n<li>Stephen Carey, Senior VP of Finance &amp; CFO, said, \"ANI recorded revenues of $247.1 million in the fourth quarter, up 30% over the prior year period,\" and \"Cortrophin Gel delivered $347.8 million of net revenue, up 76% year-over-year.\" He added, \"Adjusted non-GAAP diluted earnings per share was $2.33 for the fourth quarter compared to $1.63 per share in the prior year period.\" Carey reiterated 2026 guidance and noted cash and leverage positions.</li>\n</ul>\n<h3>Outlook</h3>\n<ul><li>The company reaffirmed 2026 guidance with net revenue of \"$1.055 billion to $1.115 billion, representing year-over-year growth of approximately 19% to 26%.\" Cortrophin Gel net revenue is expected at \"$540 million to $575 million, representing year-over-year growth of 55% to 65%.\" Adjusted non-GAAP EBITDA guidance is \"$275 million to $290 million.\" Adjusted non-GAAP EPS is expected between \"$8.83 and $9.34.\" ILUVIEN net revenue is forecasted at \"$78 million to $83 million.\" Carey indicated that Q1 Cortrophin revenue will be seasonally lower, followed by sequential growth through the year.</li></ul>\n<h3>Financial Results</h3>\n<ul><li>ANI reported Q4 2025 revenues of \"$247.1 million,\" with full year revenues of \"$883.4 million.\" Cortrophin Gel Q4 revenues reached \"$111.4 million.\" ILUVIEN brought in \"$19.8 million\" in Q4 and \"$74.9 million\" for the year. Generics Q4 revenue was \"$100.8 million.\" Non-GAAP gross margin for Q4 was \"59.6%,\" with full year gross margin at \"61.6%.\" Non-GAAP SG&amp;A for the year was \"$264.6 million.\" Adjusted non-GAAP EBITDA was \"$65.4 million\" for Q4 and \"$229.8 million\" for the year. Year-end unrestricted cash was \"$285.6 million,\" and principal debt stood at \"$629.1 million.\"</li></ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Glen Santangelo, Barclays: Asked about Cortrophin's multiyear opportunity and potential peak sales. Lalwani: The addressable populations are \"significantly underpenetrated... we see a significant multiyear growth runway for the category and also for Cortrophin.\" On royalties, \"In 2025 itself, we were in the highest royalty tier... blended royalty rate to be in the high 20s in 2026.\"</li>\n<li>David Amsellem, Piper Sandler: Inquired about operating leverage with sales force expansion and duration of treatment across indications. Lalwani: \"We're still in high-growth mode... We're keeping the EBITDA margin percentage the same in '26 versus '25 despite a year of very significant investment.\" He explained that treatment duration varies by indication.</li>\n<li>Vamil Divan, Guggenheim: Asked about leveraging the gout sales team and business development plans. Lalwani: The new team \"can be leveraged both for other indications... and also by adding another product in the basket.\" Carey: The company prefers a \"reasonably conservative approach\" to leverage for M&amp;A.</li>\n<li>Yuchen Ding, Jefferies: Asked about first-half weighting and confidence in gout expansion, and about royalty buy-downs. Lalwani: Cited \"large underpenetrated market opportunity\" and pilot program success, with field force impact expected in Q3 and Q4.</li>\n<li>Ekaterina Knyazkova, JPMorgan: Asked about changes in patient access. Lalwani: \"We have not seen material changes from an access perspective.\"</li>\n<li>Thomas Smith, Leerink: Asked about gout utilization and pilot program learnings. Lalwani: The 15% gout share is expected to \"increase significantly\" with the new team; pilot programs informed targeting of key HCPs.</li>\n<li>Leszek Sulewski, Truist: Asked about gout trends, ILUVIEN access, and generics cadence. Lalwani: Gout volume share will expand; ILUVIEN guidance assumes no major funding return; generics to maintain 10–15 launches per year.</li>\n<li>Brandon Folkes, H.C. Wainwright: Asked about ACTH market dynamics. Lalwani: Growth is \"not about share capture at all. This is about market expansion.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analyst sentiment was positive, with repeated focus on the sustainability and magnitude of Cortrophin growth, sales force ROI, and market expansion. Multiple analysts pressed for details on opportunity sizing and confidence in guidance.</li>\n<li>Management maintained a confident and optimistic tone in prepared remarks, frequently expressing belief in \"significant multiyear growth opportunity\" and referencing high ROI on expansion initiatives. In Q&amp;A, management was thorough and assertive, emphasizing the underpenetrated market and past success of commercial investments.</li>\n<li>Compared to the previous quarter, both management and analysts sustained a positive tone, though current questions reflected deeper interest in execution risks linked to the large sales force expansion and new targets.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 is more specific than in Q3, projecting over $1B in revenue and rare disease comprising 60% of revenues. Prior guidance called for \"39% to 42%\" revenue growth in 2025; current guidance targets \"19% to 26%\" growth for 2026, signaling a continued but moderating trajectory.</li>\n<li>The strategic focus sharpened on Cortrophin Gel's gout opportunity, with the launch of a dedicated 90-person team in 2026, versus the portfolio team expansion in early 2025.</li>\n<li>Analysts in Q4 focused on risk and execution of the new sales model, while Q3 centered on underlying demand and market penetration.</li>\n<li>Key metrics such as gross margin showed a slight decline quarter-over-quarter, attributed to product mix and royalty impact.</li>\n<li>Management's confidence in capturing the multiyear Cortrophin opportunity was consistent, but more emphasis was placed on operational execution and capital deployment in the current quarter.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management noted lower Q1 revenues due to \"seasonality related to the impact of insurance reverifications\" and weather disruptions, but expressed confidence in recovery.</li>\n<li>Gross margin is expected to decline in 2026, due to \"significantly higher forecast sales of royalty-bearing products\" and the \"non-recurrence of revenues from our first half 2025 180-day exclusive launch of Prucalopride.\"</li>\n<li>Analysts raised concerns about the execution risk of the new sales force and the timing of returns from these investments.</li>\n<li>The potential for royalty expense increases was discussed, with management indicating the royalty rate is now at its cap.</li>\n<li>No material changes in payer access or reimbursement were reported.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>ANI Pharmaceuticals concluded 2025 with record financial performance, led by rapid growth in its rare disease and generics businesses. For 2026, the company is targeting more than $1 billion in revenue and expects rare disease products to account for about 60% of total revenue. The strategic expansion of a dedicated sales force for acute gouty arthritis flares and continued investment in Cortrophin Gel and ILUVIEN position the company for further growth. Management emphasized disciplined capital allocation and reiterated confidence in achieving guidance, while acknowledging operational and market access risks remain actively managed.</p>\n<p><a href=\"https://seekingalpha.com/symbol/anip/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558830-ani-pharmaceuticals-targets-over-1b-in-2026-revenue-with-rare-disease-focus-and-expanded",
            "pub_date": "2026-02-28 02:01:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558831",
            "title": "Main Street Capital anticipates continued strong lower middle market activity with $1.04 DNII per share outlook for Q1 2026",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Main Street Capital Corporation (MAIN) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Dwayne Hyzak stated that Main Street Capital is \"extremely pleased with our continued strong performance in the fourth quarter, which closed another great year for Main Street.\" He cited a return on equity of 17.7% for the quarter and 17.1% for the full year, alongside record NAV per share for the 14th consecutive quarter and record annual gross lower middle market investments. Hyzak noted, \"We remain confident that our unique investment income and value creation drivers together with our cost-efficient operations and conservative capital structure will allow us to continue to deliver superior results for our shareholders in the future.\"</li>\n<li>Hyzak highlighted significant realizations, including the exit of Mystic Logistics in Q4 and KBC Industries in Q1 2026, both resulting in material realized gains and strong dividend flows over the life of the investments. He emphasized ongoing interest from potential buyers in other lower middle market portfolio companies and \"expect[s] the strong contributions to continue.\"</li>\n<li>Main Street added five new lower middle market portfolio companies in Q4, with a net increase in investments of $253 million, marking the highest quarterly activity since Q4 2021. The private loan portfolio saw a net increase of $109 million.</li>\n<li>Hyzak announced a supplemental dividend of $0.30 per share payable in March 2026 and regular monthly dividends for Q2 2026 of $0.26 per share, a 4% increase from Q2 2025. He noted, \"We currently expect to recommend that our Board continue to declare future supplemental dividends.\"</li>\n<li>President and Chief Investment Officer David Magdol reflected on nearly two decades of performance, stating, \"Since our IPO in 2007, we have increased our monthly dividends per share by 136%, and we have declared cumulative total dividends to our shareholders of more than $49 per share.\" Magdol pointed to $700 million deployed in lower middle market strategy in 2025, the largest year of originations in the company's history.</li>\n<li>CFO Ryan Nelson reported, \"Our total investment income for the fourth quarter was $145.5 million, increasing by $5.1 million or 3.6% over the fourth quarter of 2024 and increasing by $5.7 million or 4.1% from the third quarter of 2025.\" Nelson added, \"NAV per share increased by $0.55 over the third quarter and by $1.68 per share or 5.3% when compared to a year ago, to a record NAV per share of $33.33 at year-end.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Hyzak described the lower middle market investment pipeline as \"above average,\" with expectations for \"strong lower middle market investment activity in the first quarter.\" He stated that Main Street anticipates proposing another significant supplemental dividend payable in June 2026, contingent on continued strong performance and favorable DNII.</li>\n<li>Nelson projected, \"We expect first quarter of 2026 DNII before taxes of at least $1.04 per share with the potential for upside driven by portfolio investment activities during the quarter.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Nelson reported total investment income for Q4 2025 of $145.5 million, up 3.6% year-over-year and 4.1% sequentially. Dividend income increased by $11.4 million compared to a year ago, and fee income rose by $900,000.</li>\n<li>The ratio of total operating expenses, excluding interest expense, as a percentage of average total assets was 1.4% for the quarter on an annualized basis and 1.3% for the year.</li>\n<li>Net fair value appreciation, including net realized gains and net unrealized depreciation, totaled $42.5 million for the quarter. Net realized gains recognized in the quarter were $50.8 million.</li>\n<li>Investments on nonaccrual status represented approximately 1% of the total investment portfolio at fair value and 3.3% at cost at year-end.</li>\n<li>Main Street ended the quarter with cash and unused capacity under credit facilities totaling over $1.2 billion, and a near-term debt maturity of $500 million in July 2026.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Robert Dodd, Raymond James: Asked about the sustainability of high investment activity and whether it signals a step change. Hyzak responded, \"We've been intentional for the last couple of years about trying to grow our activities in the lower middle market, that includes growing our team.\" Magdol added, \"Q4 was a particularly strong originations quarter. In the future, we hope to be able to continue momentum at above average rates, but I wouldn't say that Q4 is necessarily an indicative view towards our expectations going forward.\"</li>\n<li>Dodd followed up on software exposure. Hyzak replied, \"We do not have significant software exposure at all. We're value-based investors. We love basic industries... So we don't chase stuff that has high valuations.\"</li>\n<li>Brian Mckenna, Citizens JMP Securities: Asked about ROE resilience and drivers. Hyzak explained, \"I think when you look at the current environment, 2 things will impact our ROE going forward on the private credit, private loan side, both floating index rates and spreads... On lower middle market side, just the overall economy will be a big driver of where our ROE shakes out.\"</li>\n<li>Arren Cyganovich, Truist Securities, asked about the talent pipeline. Hyzak responded, \"We feel really good about the group of directors and VPs that we have beneath that... In the case of all those people, they are not people we hired from outside, these are people that have been at Main Street for a long period of time, executing to our strategies.\"</li>\n<li>Douglas Harter, UBS: Asked about portfolio performance and areas of focus. Hyzak noted, \"I wouldn't say we're seeing any area of any sector industry or specific area that's seeing more pressure, more underperformance.\"</li>\n<li>Mckenna inquired about asset management business growth. Hyzak indicated, \"We do expect to have growth in the future. Obviously, we have to have execution and the market had to be cooperative, but I do think we expect to have an increase in the base management fees there primarily as MC Income Fund executes just growth opportunity and its strategy.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts expressed curiosity about the sustainability of investment activity, the impact of team expansion, sector exposures, and the outlook for ROE and asset management growth. The tone was neutral to slightly positive, with an emphasis on understanding potential changes in activity levels and operational resilience.</li>\n<li>Management maintained a confident and constructive tone in prepared remarks, frequently referencing strong historical performance and the effectiveness of their differentiated investment strategy. During Q&amp;A, management provided detailed, direct responses, acknowledging economic uncertainties but reiterating confidence in portfolio quality and strategy. Hyzak stated, \"We remain confident that our unique investment income and value creation drivers... will allow us to continue to deliver superior results.\"</li>\n<li>Compared to the previous quarter, management’s tone was similarly positive, but more emphasis was placed on the record pace of lower middle market investments and continued dividend growth. Analysts’ tone remained stable, with questions focused on the implications of heightened activity and future returns.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Q4 saw a pronounced increase in lower middle market investment activity ($253 million net increase vs. $61 million in Q3) and the addition of five new portfolio companies compared to three in Q3.</li>\n<li>Guidance for DNII per share in Q1 2026 was explicitly stated at \"at least $1.04 per share,\" following Q4 DNII before taxes per share of $1.11 (Q3 was $1.07).</li>\n<li>NAV per share set a new record for the 14th consecutive quarter, with a sequential increase of $0.55 vs. $0.48 in Q3.</li>\n<li>Both quarters featured supplemental dividends of $0.30 per share and regular dividend increases, but Q4’s regular monthly dividend guidance reflected a 4% increase from the previous year.</li>\n<li>Investment pipeline was described as \"above average\" in both quarters, but Q4 commentary emphasized robust follow-on investments and the potential for continued strong activity into Q1 2026.</li>\n<li>Management’s confidence remained high, with a consistent focus on conservative capital structure, robust liquidity, and internally cultivated talent.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Hyzak acknowledged challenges from floating index rates and spreads impacting private credit returns, and broader economic uncertainties influencing lower middle market results.</li>\n<li>Limited software and low-end consumer exposure were identified as areas receiving increased attention, though current exposure is minimal.</li>\n<li>Investments on nonaccrual status remained low at approximately 1% of fair value.</li>\n<li>Management reiterated the importance of underwriting to cycles and maintaining a conservative leverage profile as key risk mitigants.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Main Street Capital highlighted elevated lower middle market investment activity, record NAV per share, and growing recurring and supplemental dividends, driven by robust portfolio performance and disciplined execution. The company projects continued strength into Q1 2026, underpinned by a strong investment pipeline, conservative capital structure, and a focus on internally developed talent. Management signaled expectations for further growth in asset management income and ongoing resilience in core returns, positioning the company for continued value creation for shareholders in the coming quarters.</p>\n<p><a href=\"https://seekingalpha.com/symbol/main/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558831-main-street-capital-anticipates-continued-strong-lower-middle-market-activity-with-1_04-dnii",
            "pub_date": "2026-02-28 02:01:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558826",
            "title": "Arbor Realty outlines $1.1B nonperforming asset resolution plan while targeting $8.5B origination volume for 2026",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Arbor Realty Trust (ABR) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Ivan Kaufman, Chairman, President &amp; CEO, stated that the company is focused on resolving nonperforming and sub-performing loans to improve its rate of income, describing this as a \"top priority\" due to the \"tremendous drag on our earnings.\" Kaufman indicated a clear path to resolving the majority of these loans over the next few quarters, potentially adding back as much as $100 million of income to the annual run rate, or about $0.48 a share. </li>\n<li>Kaufman reported approximately $570 million in delinquencies and $500 million of REO assets at year-end, totaling roughly $1.1 billion in nonperforming assets—down by over $130 million from the previous quarter. The company has \"a line of sight in roughly $100 million to $150 million of delinquencies that we expect to resolve by the end of March and another $100 million to $150 million we believe will resolve in the next 90 days.\"</li>\n<li>Kaufman highlighted the company’s buyback activity, stating, \"We purchased roughly $20 million of stock in the last few months under this program at an average price of $7.40 or 64% of book value.\"</li>\n<li>The Agency platform saw $1.6 billion in origination volume in Q4, totaling $5 billion for 2025, a 13.5% increase from 2024. The servicing portfolio grew 8% to over $36 billion, generating a \"very predictable and growing annuity of over $128 million a year of income.\"</li>\n<li>The single-family rental (SFR) business originated $580 million in Q4 and $1.6 billion in 2025, with expectations of $1.5 billion to $2 billion in volume for 2026.</li>\n<li>Paul Elenio, Executive VP &amp; CFO, stated, \"In the fourth quarter, we produced distributable earnings of $46.3 million or $0.22 per share, excluding onetime realized losses of $12.4 million from the resolution of certain delinquent and REO assets that were previously reserved for and $7.3 million of income we generated through reduced tax expense in the fourth quarter from the sale of the Homewood asset.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Kaufman conveyed confidence in reducing REO assets to $250 million to $300 million by the end of 2026, even after potentially adding $100 million to $200 million of new REO assets. He said, \"We are very optimistic we can reduce our REO assets to around $250 million to $300 million by the end of 2026.\"</li>\n<li>The company expects consistent origination volumes of $8.5 billion for 2026, with potential for growth depending on market conditions.</li>\n<li>Guidance indicates that the run rate of income is expected to improve as nonperforming assets are resolved, with distributable earnings potentially increasing by $0.10 to $0.12 per quarter as drag is eliminated.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Distributable earnings for Q4 were $46.3 million, or $0.22 per share. The company incurred onetime realized losses of $12.4 million from asset resolutions and recognized $7.3 million of income from a reduced tax expense on the Homewood asset sale.</li>\n<li>As of December 31, 2025, delinquencies were reported at about $600 million and REO assets at $500 million. The company estimates these assets are creating a temporary drag of $80 million to $100 million annually.</li>\n<li>The Agency business generated $21 million in gain-on-sale income in Q4 with a margin of 1.36%. Mortgage servicing rights income was $20 million for the quarter.</li>\n<li>The balance sheet lending portfolio grew to $12.1 billion. The all-in yield was 7.08% as of December 31, with a spot net interest spread of 0.63% compared to 0.55% at September 30.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Christopher Muller, Citizens JMP Securities, LLC: Asked about 2026 GSE originations relative to the $5 billion in 2025. Kaufman responded, \"Our pipeline is fairly strong. And I think targeting similar levels that we had last year, if these levels remain in this space, would be something that we feel comfortable with.\"</li>\n<li>Muller queried about servicing fee compression. Elenio explained, \"It's just a matter of we've got some higher servicing fee loans back from the pre-COVID days running off and then the new products coming on shorter part of the curve, and it's also coming on at the more normalized servicing fees. We've run a model. We think this starts to bottom out towards the end of the year and then kind of levels off.\"</li>\n<li>Gabriel Poggi, Raymond James: Asked about credit issues in SFR build-to-rent borrowers. Kaufman replied, \"Our SFR book is really outstanding. It's probably the best performing book we have.\" Elenio added, \"Not a single delinquent loan or a loan on our watch is one of this type of product.\"</li>\n<li>Poggi followed up on geographic pockets of weakness for delinquencies. Kaufman cited softness in Houston, San Antonio, Dallas, Atlanta, and certain pockets of Florida.</li>\n<li>Jade Rahmani, KBW: Asked about additional headwinds and trends for 2026. Kaufman said, \"We think we're at the bottom. We're seeing a firming up of economic occupancy.\"</li>\n<li>Rahmani questioned dividend sustainability. Elenio responded, \"We look at the dividend and the Board looks at the dividend from a more long-term perspective... Our goal is to facilitate the resolution of the drag on earnings.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts primarily expressed concerns regarding the pace and success of asset resolution, fee compression, and sustainability of the dividend, with a neutral to slightly cautious tone. Questions focused on credit quality, earnings drag, and market-specific weaknesses.</li>\n<li>Management maintained a confident and proactive tone, emphasizing progress in asset resolution and growth in originations, while acknowledging ongoing challenges. Statements such as \"We are aggressive, and we'll look to facilitate that\" reflect their assertive approach.</li>\n<li>Compared to the previous quarter, management’s tone remains confident but the focus has shifted more toward execution and the timing of asset resolution, as opposed to the prior quarter's emphasis on strategic positioning and defensive actions.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The company reduced nonperforming assets by over $130 million quarter-over-quarter, with delinquencies and REO assets both declining.</li>\n<li>Distributable earnings in Q4 were lower than Q3, reflecting realized losses and a continued earnings drag from noninterest-earning assets. Q3 earnings included large gains from legacy asset sales.</li>\n<li>The Agency business saw a sequentially lower but still robust origination volume, while fee compression in servicing continued but is expected to level off.</li>\n<li>Analysts in both quarters focused on credit risk, asset resolution, and dividend sustainability, but current quarter questions were more tactical regarding execution and timing.</li>\n<li>Management’s confidence in resolving legacy issues and growing origination volumes remains, with increased clarity on timelines for asset resolution and income recovery.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management identified the drag from noninterest-earning assets and ongoing delinquencies as significant challenges, with strategies in place for accelerated resolution.</li>\n<li>Geographic weakness in Texas, Atlanta, and Florida was highlighted as a concern for future delinquencies.</li>\n<li>Analysts noted potential for continued fee compression and questioned the sustainability of the dividend if the pace of asset resolution slows.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Arbor Realty Trust’s leadership underscored significant progress in reducing nonperforming assets and outlined a clear strategy to resolve the remaining portfolio over the next few quarters. The company is confident this will restore its run rate of income, supported by robust origination activity and a growing servicing portfolio. Management maintains a long-term focus on dividend stability and book value preservation, while remaining vigilant to regional weaknesses and macroeconomic uncertainties as it executes its resolution and growth plans for 2026.</p>\n<p><a href=\"https://seekingalpha.com/symbol/abr/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558826-arbor-realty-outlines-1_1b-nonperforming-asset-resolution-plan-while-targeting-8_5b",
            "pub_date": "2026-02-28 01:40:55",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558827",
            "title": "Concentra outlines $2.25B–$2.35B 2026 revenue target while expanding de novo and M&A strategy",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Concentra Group Holdings Parent, Inc. (CON) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO William Newton stated there were \"no material changes to report to any of our previously released financial or operational metrics,\" affirming a strong finish to the year as Concentra exceeded the high end of its full year 2025 guidance for revenue and adjusted EBITDA, and came in better than guidance on leverage.</li>\n<li>Newton highlighted \"positive feedback\" on their detailed investor book and discussed additional validation studies showing \"the average total workers' compensation claims cost for those treated by Concentra is 25% lower than non-Concentra providers and that the average claim duration is 65 fewer days.\"</li>\n<li>Newton reported Q4 revenue of $539.1 million, a year-over-year increase of 15.9%, and full-year revenue of $2.2 billion, up 13.9% from 2024. Excluding acquisitions, the full-year revenue was $2 billion, a 6.4% increase.</li>\n<li>There was \"solid growth in both visits and rate within the occupational health centers operating segment, prudent cost management across G&amp;A and cost of services and continued double-digit organic growth in the Onsite business operating segment.\"</li>\n<li>Adjusted EBITDA for Q4 was $95.3 million and for the full year was $431.9 million. Adjusted net income attributable to the company was $36.1 million in Q4, with adjusted EPS of $0.28. For the full year, adjusted net income was $176 million and adjusted EPS was $1.37. Newton also detailed strong pipeline activity, including \"7 total de novos in 2025\" and a robust expansion plan for 2026.</li>\n<li>President &amp; CFO Matthew DiCanio added, \"Total revenue of $490.6 million in Q4 2025 was 12.2% higher than the same quarter prior year,\" and noted \"Onsite health clinic operating segment reported revenue of $36.2 million in Q4 2025, a 112% increase from the same quarter prior year.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>DiCanio confirmed the company's 2026 targets: \"We have set our revenue target at a range of $2.25 billion to $2.35 billion, our adjusted EBITDA target at a range of $450 million to $470 million, our CapEx target at a range of $70 million to $80 million. Our free cash flow target at a range of $200 million to $225 million, and our leverage target remains approximately 3x by the end of 2026.\"</li>\n<li>Management noted \"approximately 3% rate growth within the occupational health centers operating segment\" and \"low single-digit visit growth, excluding Nova\" for 2026.</li>\n<li>The company plans \"7 to 9 de novos in 2026, which would be a record for us and potentially double-digit new sites in 2027.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Q4 revenue was $539.1 million, with adjusted EBITDA of $95.3 million and an adjusted EBITDA margin of 17.7%.</li>\n<li>Full-year revenue reached $2.2 billion, with adjusted EBITDA of $431.9 million and a margin of 20%.</li>\n<li>Q4 cash flow from operations was $118.7 million, and free cash flow was $98.6 million. Full-year free cash flow was $197.8 million.</li>\n<li>The company repurchased 1.1 million shares totaling $22.4 million and paid $8 million in dividends in Q4, with a total of $32.1 million in dividend payments for the year.</li>\n<li>Net leverage ratio at year-end was 3.4x, with a total debt balance of $1.57 billion and a cash balance of $79.9 million.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Benjamin Rossi, JPMorgan: Asked about weather/respiratory headwinds for 2026. Newton responded, \"We have weather every year. It has not really impacted us this year...not anticipating much of an impact from that perspective. As far as the respiratory, that would typically impact our urgent care visits...not going to be material either way.\"</li>\n<li>Rossi followed up on ROIC for de novos/M&amp;A. DiCanio answered, \"We obviously follow that very closely, ROIC metric...typically, all of those types of transactions are accretive and have strong ROICs.\"</li>\n<li>Ann Hynes, Mizuho: Sought detail on New York workers' comp rulemaking. Newton explained the focus has been on \"evaluation of management codes\" and that \"there's a lot of other codes that impact the total reimbursement...we're looking at is more of a full comprehensive look at the fee schedule.\"</li>\n<li>Justin Bowers, Deutsche Bank: Asked about seasonality and cadence for 2026. DiCanio replied, \"In terms of seasonality, pretty similar to prior years. The only real exception is that we have a pickup in Q1 from Nova and Pivot when we didn't have both of those assets in the prior year.\"</li>\n<li>Benjamin Hendrix, RBC: Asked about the Select Medical agreement roll-off and margin impact. Newton said, \"We expect the TSA costs to ramp down close to 0 by, call it, midyear '26. And so the net of both of those will be some incremental costs, early part of the -- or the first half of 2026. But that's all part of our guidance.\"</li>\n<li>Mitchell Ostrovsky, Wells Fargo: Asked about labor trends. Newton responded, \"As far as our labor, pretty much normal...trending in a favorable direction. Our turnover is coming down fewer open positions.\"</li>\n<li>Joanna Gajuk, BofA: Inquired about market share and organic growth. Newton noted, \"We developed additional technologies or deployed additional technologies within our sales group...we think that's really starting to gain some traction for us.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed on growth sustainability, market share, labor trends, and regulatory changes, showing a neutral to slightly positive tone, with interest in operational execution and new market opportunities.</li>\n<li>Management maintained a confident and constructive tone in both prepared remarks and Q&amp;A, repeatedly stating confidence in execution, pipeline, and guidance. Newton said, \"We have good momentum heading into 2026 and are confident in our ability to deliver on our outlook.\"</li>\n<li>Compared to last quarter, the tone from both analysts and management remains constructive, with continued focus on execution and clarity around strategic initiatives.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 is now clearly articulated with specific targets for revenue, EBITDA, CapEx, and free cash flow, whereas last quarter management deferred guidance until year-end.</li>\n<li>There is an increased emphasis on de novo growth and smaller bolt-on acquisitions, with a record number of new sites targeted for 2026.</li>\n<li>Last quarter, management highlighted ongoing integration of Nova and Pivot; this quarter, integration is described as largely complete, with most synergies realized.</li>\n<li>Analysts continue to focus on market share, organic growth, labor conditions, and margin performance, reflecting ongoing concerns but with increased clarity on outlook.</li>\n<li>Management’s tone remains confident, with more explicit discussions of growth drivers and cost controls.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management addressed the impact of the government shutdown, stating limited exposure due to minimal federal contracts.</li>\n<li>Costs related to the separation from Select Medical continue, with the majority of remaining activities expected to complete by summer 2026.</li>\n<li>Regulatory uncertainty remains in New York, with the company closely monitoring and participating in the fee schedule revision process.</li>\n<li>Wage inflation is cited as consistent with general inflation rates, with no unusual trends in labor costs or retention.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Management emphasized a strong finish to 2025 and outlined clear financial and operational targets for 2026, including revenue, EBITDA, and free cash flow goals, supported by robust organic growth, targeted de novo expansion, and disciplined M&amp;A activity. The company highlighted successful integration of recent acquisitions, continued cost discipline, and a healthy labor environment, while remaining vigilant about regulatory developments and strategic opportunities in new markets such as New York.</p>\n<p><a href=\"https://seekingalpha.com/symbol/con/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558827-concentra-outlines-2_25b-2_35b-2026-revenue-target-while-expanding-de-novo-and-m-and-a",
            "pub_date": "2026-02-28 01:40:55",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558812",
            "title": "Sacyr, S.A. reports FY results",
            "description": "<html><body><ul><li>Sacyr, S.A. <a href=\"https://sacyr.com/documents/d/sacyr-corp/results-presentation-2025\" rel=\"nofollow\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SYRVF\" title=\"Sacyr, S.A.\">SYRVF</a></span>): FY Revenue of EUR 4.65B.</li></ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558812-sacyr-s-a-reports-fy-results",
            "pub_date": "2026-02-28 01:31:44",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558816",
            "title": "Royal Unibrew A/S GAAP EPS of DKK 31.30, revenue of DKK15.72M",
            "description": "<html><body><ul>\n<li>Royal Unibrew A/S <a href=\"https://cms.unibrew.com/media/z3mdvo0x/royal-unibrew-annual-report-2025.pdf\" rel=\"nofollow\">press release</a> (<a href=\"https://seekingalpha.com/symbol/ROYUF\" title=\"Royal Unibrew A/S\">ROYUF</a>): FY GAAP EPS of DKK 31.30.</li>\n<li>Revenue of DKK15.72M.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558816-royal-unibrew-as-gaap-eps-of-dkk-3130-revenue-of-dkk1572m",
            "pub_date": "2026-02-28 01:31:44",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558802",
            "title": "YPF slides after Q4 net loss more than doubles from a year ago",
            "description": "<html><body><p data-eci=\"true\">YPF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/YPF\" title=\"YPF Sociedad Anónima\">YPF</a></span>) -5.5% in Friday's trading after <span>posting a <a href=\"https://seekingalpha.com/filing/174574585\" target=\"_self\" title=\"Q4 net loss\">Q4 net loss</a> of $649M, more than double the $284M loss in the year-earlier quarter, and revenues fell 4% Y/Y to $4.56B, citing shifting prices in oil and petroleum derivatives and a slowdown in gas sales.</span></p>\n<p><span>However, Q4 adjusted EBITDA jumped 53% to $1.28B, slightly more than the $1.22B estimate of analysts polled by LSEG.</span></p>\n<p><span>The Argentine state-run oil company said Q4 shale production surged 42% Y/Y to 196K bbl/day, and full-year shale output increased 35% to 165K bbl/day.</span></p>\n<p><span>For FY 2026, </span><span>YPF (<a href=\"https://seekingalpha.com/symbol/YPF\" title=\"YPF Sociedad Anónima\">YPF</a>) forecasts EBITDA of $5.8B-$6.2B, up from $5B reported in 2025, while the company plans to increase full-year production to 215K shale oil bbl/day, more than double output from three years ago, CEO Horacio Marin <a href=\"https://www.reuters.com/business/energy/ypf-projects-ebitda-between-58-billion-62-billion-2026-says-ceo-2026-02-27/\" rel=\"nofollow\" target=\"_self\" title=\"said\">said</a> Friday.</span></p>\n<p><span>Separately, the <span>U.S. Department of Justice </span>is <a href=\"https://www.bloomberg.com/news/articles/2026-02-27/us-backs-argentina-in-discovery-fight-in-18-billion-ypf-case\" rel=\"nofollow\" target=\"_self\" title=\"siding with Argentina\">siding with Argentina</a><span> in a key legal case, <span>urging a federal judge not to find Argentina in contempt for allegedly failing to turn over officials' texts and emails to former </span>YPF (<a href=\"https://seekingalpha.com/symbol/YPF\" title=\"YPF Sociedad Anónima\">YPF</a>)<span> shareholders seeking to collect an $18B judgment against the country.</span></span></span></p>\n<p><span><span><span>The former shareholders won a 2023 ruling that Argentina violated their rights in a 2012 nationalization of YPF (<a href=\"https://seekingalpha.com/symbol/YPF\" title=\"YPF Sociedad Anónima\">YPF</a>), but the plaintiffs have struggled to collect the award and are seeking texts and emails they say may show the country's state-owned banks and airline are \"alter egos\" for the government subject to attachment.</span></span></span></p>\n<p><span><span><span>In a Thursday court filing, the DoJ called the discovery request improper, saying many of the assets held by those entities are immune from collection, according to Bloomberg.</span></span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558802-ypf-slides-after-q4-net-loss-more-than-doubles-from-year-ago",
            "pub_date": "2026-02-28 01:26:15",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}