{
    "data": [
        {
            "id": "4557917",
            "title": "OpenAI plans London as largest research hub outside U.S.",
            "description": "<html><body><p data-eci=\"true\">OpenAI (<a href=\"https://seekingalpha.com/symbol/OPENAI\" title=\"OpenAI\">OPENAI</a>) will launch its biggest research hub in London outside the United States, the company reportedly said on Thursday.</p>\n<p>The company believes Britain’s technology ecosystem offers an ideal setting for investment and the development of new artificial intelligence systems, as per a Reuters report.</p>\n<p>The country's blend of talent, leading universities, and globally respected scientific institutions gives it a competitive edge in a sector viewed as strategically important by governments worldwide, said Mark Chen, OpenAI's research chief.</p>\n<p>Staff based at the new hub will “own key components” of its frontier AI model research, focusing on real-world applications and advancing the development of safe AI systems, the ChatGPT maker added.</p>\n<p>However, specific details of the plan, like the size of any investment or the number of jobs it would involve, have not been made public.</p>\n<p>OpenAI had opened its first international office in London in mid-2023. It currently has over 30 employees in its London team, according to Reuters.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557917-openai-plans-london-as-largest-research-hub-outside-us",
            "pub_date": "2026-02-26 23:45:59",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557921",
            "title": "Nasdaq drops nearly 2% as the tech selloff deepens post Nvidia's earnings",
            "description": "<html><body><p data-eci=\"true\">Wall Street retreated on Thursday as weakness in the technology sector weighed heavily on major averages, pushing the Nasdaq Composite (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/COMP:IND\" title=\"NASDAQ Composite Index\">COMP:IND</a></span></span>) down nearly 2%.</p>\n<p>The decline followed earnings from Nvidia (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a></span></span>), with shares of the mega-cap chipmaker falling roughly 5% a day after reporting quarterly results. </p>\n<p>Semiconductor and semiconductor equipment stocks led the downturn, sliding about 5% on the session and dragging the broader information technology sector lower by approximately 2.5%. The pullback in chip-related names offset relative strength in other pockets of tech, including IT services, which climbed 4%. </p>\n<p>The uneven performance highlights the market’s heightened sensitivity to earnings from large-cap technology companies, particularly those tied to artificial intelligence and data center demand.</p>\n<p>Outlined below are the Nasdaq-100’s (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NDX\" title=\"NASDAQ 100-Index\">NDX</a></span></span>) worst-performing stocks in Thursday’s trading session. </p>\n<ol>\n<li>Applied Materials (<a href=\"https://seekingalpha.com/symbol/AMAT\" title=\"Applied Materials, Inc.\">AMAT</a>), -6.8%</li>\n<li>Lam Research (<a href=\"https://seekingalpha.com/symbol/LRCX\" title=\"Lam Research Corporation\">LRCX</a>), -6.7%</li>\n<li>Broadcom (<a href=\"https://seekingalpha.com/symbol/AVGO\" title=\"Broadcom Inc.\">AVGO</a>), -6.6%</li>\n<li>Western Digital (<a href=\"https://seekingalpha.com/symbol/WDC\" title=\"Western Digital Corporation\">WDC</a>), -6.4%</li>\n<li>ASML Holding (<a href=\"https://seekingalpha.com/symbol/ASML\" title=\"ASML Holding N.V.\">ASML</a>), -6.2%</li>\n<li>Seagate Technology (<a href=\"https://seekingalpha.com/symbol/STX\" title=\"Seagate Technology Holdings plc\">STX</a>), -6.1%</li>\n<li>Micron Technology (<a href=\"https://seekingalpha.com/symbol/MU\" title=\"Micron Technology, Inc.\">MU</a>), -5.9%</li>\n<li>Monolithic Power Systems (<a href=\"https://seekingalpha.com/symbol/MPWR\" title=\"Monolithic Power Systems, Inc.\">MPWR</a>), -5.7%</li>\n<li>NVIDIA (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>), -4.9%</li>\n<li>Synopsys (<a href=\"https://seekingalpha.com/symbol/SNPS\" title=\"Synopsys, Inc.\">SNPS</a>), -4.7%</li>\n</ol>\n<p>Nasdaq ETFs: (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QQQ\" title=\"Invesco QQQ Trust, Series 1 ETF\">QQQ</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QQQM\" title=\"Invesco NASDAQ 100 ETF\">QQQM</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SQQQ\" title=\"ProShares UltraPro Short QQQ ETF\">SQQQ</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TQQQ\" title=\"ProShares UltraPro QQQ ETF\">TQQQ</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QLD\" title=\"ProShares Ultra QQQ ETF\">QLD</a></span></span>), and (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QID\" title=\"ProShares UltraShort QQQ ETF\">QID</a></span></span>).</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557921-nasdaq-drops-nearly-2-percent-as-the-tech-selloff-deepens-post-nvidias-earnings",
            "pub_date": "2026-02-26 23:45:59",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557914",
            "title": "Warner Bros. Discovery targets over 140M streaming subscribers in Q1 2026 as global expansion accelerates",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Warner Bros. Discovery (WBD) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>David Zaslav, President, CEO &amp; Director, stated that \"Warner Bros. Motion Picture Group delivered a historic run of success with 9 films debuting #1 at the box office in 2025, 7 consecutive films opening with more than $40 million in box office sales, a first for any studio, and our films spent 16 total weeks atop the global box office.\" Zaslav highlighted the company's film slate success and the strong performance of original content and revived IPs, noting a significant awards season presence with 9 Golden Globe Awards and 30 Academy Award nominations.</li>\n<li>Zaslav emphasized the growing strength of HBO and HBO Max, pointing to the debut of IT: Welcome to Derry as the \"fourth strongest debut season in HBO history, averaging 27 million viewers per episode.\" He indicated momentum in streaming growth, surpassing the 130 million subscriber target, with a path to \"more than 140 million total Streaming subscribers by the end of the first quarter\" and a goal to \"exceed 150 million subscribers by the end of the year.\"</li>\n<li>Zaslav reported, \"our portfolio of networks attracted 30% of all prime time cable viewing in the U.S., and we advanced critical initiatives like the launch of CNN All Access.\" He also cited a \"sequential improvement in advertising trends during the fourth quarter, which has continued into Q1.\"</li>\n<li>Zaslav described a strategic review and corporate reorganization, mentioning a \"63% increase in value versus the first offer received in September\" from the ongoing sales process, with the Board focused on maximizing value for shareholders.</li>\n<li>Gunnar Wiedenfels, Senior EVP &amp; CFO, stated, \"Discovery Global would come out of the gate with roughly, call it, a 3.3x net leverage number. That is absolutely sustainable and supportable...we are very well able and willing to leverage the opportunities in our long-dated low interest capital structure.\"</li>\n<li>Jean-Briac Perrette, President and CEO of Global Streaming &amp; Games, outlined five levers for streaming growth: strengthened content, international volume and penetration growth (with password sharing enforcement ramping up in 2026), product enhancements, retention initiatives, and monetization through both pricing and ad sales expansion.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Zaslav projected, \"we are on track to reach more than 140 million total Streaming subscribers by the end of the first quarter. And we're well on our way to exceed 150 million subscribers by the end of the year.\"</li>\n<li>Management described the 2027 film slate as \"set to deliver a truly monumental year for Warner Bros.\" with major franchise releases, signaling ongoing investment in theatrical content.</li>\n<li>Perrette stated, \"we feel great about the next couple of years. And the really kind of sweet spot of the flywheel we're finally getting into to seeing content, marketing, product enhancements all flow together to drive that growth.\"</li>\n<li>Wiedenfels said, \"we're expecting to be flat to slightly up in international ad sales this year\" and noted the capital structure post-spin as \"absolutely sustainable and supportable.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Zaslav highlighted box office momentum with \"Wuthering Heights, our ninth consecutive theatrical release to open #1, has generated over $160 million at the global box office in 2 weeks, including an $83 million opening weekend.\"</li>\n<li>Wiedenfels referenced the Discovery Global spin-off, stating, \"Discovery Global would come out of the gate with roughly, call it, a 3.3x net leverage number.\"</li>\n<li>Perrette described streaming growth as \"now exceeding the 130 million subscriber target we set out in August 2022.\"</li>\n<li>Management noted \"a sequential improvement in advertising trends during the fourth quarter, which has continued into Q1,\" and cited \"more than 50% growth in linear hours viewed compared to the 2022 winter games\" for the Milano Cortina Olympic Winter Games.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Richard Greenfield, LightShed Partners, LLC: Asked about leverage at Discovery Global and why Versant is not a good comp. Wiedenfels responded that the capital structure is \"absolutely sustainable and supportable\" and does not see an issue with the leverage profile, emphasizing the company's scale and global opportunities.</li>\n<li>Robert Fishman, MoffettNathanson LLC: Asked what is now being appreciated about the company's content and the growth drivers for streaming profits. Zaslav explained the focus on investing in original content, bringing back franchises, and a creative renaissance. Perrette detailed five levers for HBO Max growth, including content, international market expansion, product improvements, retention, and monetization.</li>\n<li>Peter Supino, Wolfe Research, LLC: Inquired about international DTC expansion and ARPU. Perrette stated most markets have turned profitable within 1 to 2 years of launch, and the company's global IP reduces the need for extensive local content spending.</li>\n<li>Bryan Kraft, Deutsche Bank: Asked about the games pipeline and network advertising. Perrette said 2025 was a reset year for games, with major launches coming in 2027-28. Wiedenfels described strong performance in advertising, noting \"sequential improvement... after digesting 400 basis points of NBA headwinds\" and strengths across key networks and international markets.</li>\n<li>John Hodulik, UBS: Sought detail on ad and OpEx savings and sports business strategy. Wiedenfels pointed to \"a big benefit from NBA cost savings\" and ongoing efficiency focus, including the use of AI, with continued discipline in acquiring sports rights.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts were focused on leverage, international profitability, growth levers in streaming, and content investment, displaying a neutral to slightly positive tone, with some probing on risks and sustainability but not overt skepticism.</li>\n<li>Management expressed confidence, describing the capital structure as \"absolutely sustainable,\" and emphasized a \"creative renaissance\" and robust pipeline. The tone was confident and forward-looking, especially during remarks on streaming targets and content strategy.</li>\n<li>Compared to the previous quarter, management's tone remains confident and optimistic, with analysts continuing to probe on leverage and growth sustainability but showing less concern about execution risk given recent performance.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter emphasized the completion of a historic box office run and a record number of #1 debuts, whereas the previous quarter highlighted leadership in box office revenue and an ongoing transformation.</li>\n<li>Guidance language shifted from building toward 150 million streaming subscribers by end of next year to being \"on track\" for 140 million by Q1 and exceeding 150 million by year-end.</li>\n<li>Management continues to focus on global streaming expansion and franchise investment, with an increased emphasis on the Discovery Global spin-off and capital structure sustainability this quarter.</li>\n<li>Analysts in both quarters concentrated on leverage, profitability, and international growth, with the current quarter Q&amp;A reflecting more confidence in streaming profitability and the sustainability of the capital structure.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Wiedenfels acknowledged investor focus on leverage for Discovery Global but described the capital structure as \"absolutely sustainable and supportable.\"</li>\n<li>The company noted ongoing \"secular headwinds\" for linear networks but cited improving advertising trends and audience delivery.</li>\n<li>Management referenced the ongoing sales process and a rigorous, competitive environment, with a focus on maximizing shareholder value and mitigating downside risks.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Warner Bros. Discovery management highlighted a breakout year for original content and box office leadership, the surpassing of key streaming subscriber targets, and momentum in global expansion. The company projects ongoing growth in streaming and profitability, supported by an ambitious content slate, international market penetration, and disciplined capital management, while remaining focused on maximizing shareholder value and managing structural transitions, including the Discovery Global spin-off.</p>\n<p><a href=\"https://seekingalpha.com/symbol/wbd/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557914-warner-bros-discovery-targets-over-140m-streaming-subscribers-in-q1-2026-as-global-expansion",
            "pub_date": "2026-02-26 23:40:58",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557889",
            "title": "U.S. natural gas inventory net change of -52 Bcf for week ended February 20 – EIA",
            "description": "<html><body><ul>\n<li>Stocks for the week ended February 20 were 2,018 Bcf vs. 2,070 Bcf for the week ended February 13.</li>\n<li>Net change:<span> -52 </span>Bcf vs.<span> -144</span><span> </span>Bcf for the week ended February 13.</li>\n<li>Consensus: -<span>36.00B.</span>\n</li>\n<li>ETFs: (<span><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/UNG\" title=\"United States Natural Gas Fund LP ETF\">UNG</a></span></span></span>), (<span><a href=\"https://seekingalpha.com/symbol/BOIL\" title=\"ProShares Ultra Bloomberg Natural Gas ETF\">BOIL</a></span><span>), (</span><span><a href=\"https://seekingalpha.com/symbol/KOLD\" title=\"ProShares UltraShort Bloomberg Natural Gas ETF\">KOLD</a></span><span>), (</span><span><a href=\"https://seekingalpha.com/symbol/FCG\" title=\"First Trust Natural Gas ETF\">FCG</a></span><span>), (</span><span><a href=\"https://seekingalpha.com/symbol/UNL\" title=\"United States 12 Month Natural Gas Fund LP ETF\">UNL</a></span><span>), (</span><span><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/HNU:CA\" title=\"BetaPro Natural Gas Leveraged Daily Bull ETF\">HNU:CA</a></span></span></span><span>)</span>\n</li>\n<li>Click<span> </span><a href=\"https://ir.eia.gov/ngs/ngs.html\" rel=\"nofollow noopener\" target=\"_blank\">here<span> </span></a>to read<span> the full EIA Weekly Natural Gas Storage Report.</span>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557889-us-natural-gas-inventory-net-change-of--52-bcf-for-week-ended-february-20-eia",
            "pub_date": "2026-02-26 23:35:43",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557912",
            "title": "Howden Joinery Group Plc GAAP EPS of 49.20p, revenue of £2.42B",
            "description": "<html><body><ul>\n<li>Howden Joinery Group Plc <a href=\"https://www.howdenjoinerygroupplc.com/docs/librariesprovider25/archives/2025ar/01-ar25-strategic-report.pdf\" rel=\"nofollow\" target=\"_blank\">press release</a>  (HWDJF): FY  GAAP EPS of 49.20p.</li>\n<li>Revenue of £2.42B (+4.3% Y/Y).</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557912-howden-joinery-group-plc-gaap-eps-of-4920p-revenue-of-242b",
            "pub_date": "2026-02-26 23:35:43",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557910",
            "title": "Fiera Capital Non-GAAP EPS of C$0.24, revenue of C$180.1M",
            "description": "<html><body><ul>\n<li>Fiera Capital <a href=\"https://seekingalpha.com/pr/20415112-fiera-capital-reports-fourth-quarter-2025-results\">press release</a>  (FRRPF): Q4  Non-GAAP EPS of C$0.24.</li>\n<li>Revenue of C$180.1M (-2.1% Y/Y).</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557910-fiera-capital-non-gaap-eps-of-c024-revenue-of-c1801m",
            "pub_date": "2026-02-26 23:26:36",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557883",
            "title": "Wall Street trades lower as investors digest Nvidia results",
            "description": "<html><body><p data-eci=\"true\">Wall Street’s major market averages were lower on Thursday as investors were left underwhelmed by Nvidia’s (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>) fourth-quarter results and guidance.</p>\n<p>For the session, the S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>) was -1.1%, the Dow (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DJI\" title=\"Dow Jones Industrial Average Index\">DJI</a></span></span></span>) was -0.4%, and the Nasdaq Composite (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/COMP:IND\" title=\"NASDAQ Composite Index\">COMP:IND</a></span></span></span>) was -1.9%. </p>\n<p>From a sector vantage point, four of the S&amp;P 500’s 11 segments were in positive trading territory, with financials at the top. At the other end of the spectrum, info tech has been the weakest. </p>\n<p>Shares of Nvidia were down 3.5% after the semiconductor giant reported fiscal fourth-quarter results and guidance that topped Wall Street’s forecasts by a wide margin. </p>\n<p>“Nvidia's earnings come at an opportune time, as investors were extremely hungry for confirmation that AI is still a positive storyline for stocks, and Nvidia's blowout earnings did just that. We believe that the positive force that AI is sparking in Nvidia's earnings will overpower the negative force that AI is causing in the software space,” James Demmert, chief investment officer, of Main Street Research stated. </p>\n<p>Treasury yields were lower. The shorter-end U.S. 2-year Treasury yield (<a href=\"https://seekingalpha.com/symbol/US2Y\" title=\"United States 2-Year Bond Yield\">US2Y</a>) fell to 3.45%. The benchmark U.S. 10-year Treasury yield (<a href=\"https://seekingalpha.com/symbol/US10Y\" title=\"United States 10-Year Bond Yield\">US10Y</a>) dipped to 4.02%, while the U.S. 30-year Treasury yield (<a href=\"https://seekingalpha.com/symbol/US30Y\" title=\"United States 30-Year Bond Yield\">US30Y</a>) declined to 4.67%.</p>\n<p>On the economic calendar, <a href=\"https://seekingalpha.com/news/4557773-initial-jobless-claims-rise-less-than-expected-in-past-week#hasComeFromMpArticle\" target=\"_blank\" title=\"initial jobless claims\">initial jobless claims</a> rose by 4K to 212K in the week ended February 21, versus 215K consensus and 208K prior figure, according to data released by the U.S. Department of Labor. </p>\n<p>As for stocks that were on the move, shares of  Atlassian Corporation (<a href=\"https://seekingalpha.com/symbol/TEAM\" title=\"Atlassian Corporation\">TEAM</a>) climbed 8.9%, and shares of The Trade Desk (<a href=\"https://seekingalpha.com/symbol/TTD\" title=\"The Trade Desk, Inc.\">TTD</a>) came down by 6.3%.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557883-wall-street-trades-mixed-as-investors-digest-nvidia-results",
            "pub_date": "2026-02-26 23:26:36",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557908",
            "title": "uniQure falls after FDA commissioner’s comments on rare disease therapy",
            "description": "<html><body><p data-eci=\"true\">uniQure (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QURE\" title=\"uniQure N.V.\">QURE</a></span>) shares fell ~28% on Thursday after FDA Commissioner Marty Makary, in a potential reference to Danish biotech’s gene therapy AMT-130, suggested his agency will not approve drugs that are associated with patient morbidity.</p>\n<p>His comments come at a time when uniQure (<a href=\"https://seekingalpha.com/symbol/QURE\" title=\"uniQure N.V.\">QURE</a>) is seeking FDA accelerated approval for AMT-130, which is designed to treat a rare genetically driven neurodegenerative disorder <a href=\"https://seekingalpha.com/news/4538012-uniqure-gains-as-fda-sets-up-meeting-on-gene-therapy\" rel=\"noopener\" target=\"_blank\">called Huntington’s disease.</a></p>\n<p>During an interview with CNBC on rare-disease drug approvals on Thursday, Makary said, \"I think there has been a bit of an effort to find a boogeyman to account for certain products that were not approved.”</p>\n<p>“For example, there was a product where the researchers drilled a burr hole, literally a hole in people's skulls, to interact inject intrathecally into the ventricle\" as part of a randomized controlled trial.</p>\n<p>AMT-130 is administered directly into patients’ brain tissue through a neurosurgical procedure. “At the end of the randomization period, it's found no benefit, and yet, this is one of the drugs that we were pressured to approve,” Makary added.</p>\n<p>“I have a lot of sympathy for those patients. There's <a href=\"https://x.com/adamfeuerstein/status/2027027966945829196?s=20\" rel=\"noopener\" target=\"_blank\">nothing out</a> there to offer them, but we're not going to go ahead and approve something like that that has morbidity associated with it,” he said.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557908-uniqure-falls-fda-commissioners-comments",
            "pub_date": "2026-02-26 23:21:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557886",
            "title": "Riding the AI wave: Top 10 Nvidia-fueled ETFs by YTD performance",
            "description": "<html><body><p data-eci=\"true\" data-id=\"48d85d9a-52b9-4913-900d-864140ba59b4\" data-pm-slice=\"1 3 []\"><span data-ai=\"\"><span>Nvidia shares rose as the chipmaker blew past Wall Street’s expectations with a 73% revenue surge to $68.1B, powered by a massive $62.1B from its data center business and booming AI demand. </span></span></p>\n<p data-id=\"48d85d9a-52b9-4913-900d-864140ba59b4\" data-pm-slice=\"1 3 []\"><span data-ai=\"\"><span>CEO Jensen Huang declared that “the agentic AI inflection point has arrived,” as the company guided far above consensus with a $78B revenue outlook for next quarter, igniting a broader rally across semiconductor names from AMD (<a href=\"https://seekingalpha.com/symbol/AMD\" title=\"Advanced Micro Devices, Inc.\">AMD</a>) and ARM (<a href=\"https://seekingalpha.com/symbol/ARM\" title=\"Arm Holdings plc\">ARM</a>) to TSMC and Super Micro Computer (<a href=\"https://seekingalpha.com/symbol/SMCI\" title=\"Super Micro Computer, Inc.\">SMCI</a>).</span></span></p>\n<p data-id=\"48d85d9a-52b9-4913-900d-864140ba59b4\" data-pm-slice=\"1 3 []\"><span data-ai=\"\"><span>Given the company’s dominant position in global equity markets, the report has a significant influence on fund performance across a broad swath of the ETF universe.</span>Below is a list of the top 10 ETFs with exposure to Nvidia (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a></span>), arranged by their YTD performance. These funds primarily focus on the semiconductor and technology sectors, offering investors various ways to gain exposure to Nvidia following the company’s strong fiscal fourth-quarter results.</span></p>\n<p data-id=\"f20a52f9-991a-4559-b101-66c7367355cc\"><span data-ai=\"\">The list is led by the VanEck Semiconductor ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SMH\" title=\"VanEck Semiconductor ETF\">SMH</a></span>) and the Strive US Semiconductor ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SHOC\" title=\"Strive US Semiconductor ETF\">SHOC</a></span>), both of which have benefited from strong semiconductor sector performance. Several top funds on the list, including the ProShares Ultra Semiconductors ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/USD\" title=\"ProShares Ultra Semiconductors ETF\">USD</a></span>) with a “Strong Buy” quant rating and the GraniteShares 2x Long NVDA Daily ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NVDL\" title=\"GraniteShares 2x Long NVDA Daily ETF\">NVDL</a></span>) with a “Buy” rating, offer leveraged exposure to the sector.</span></p>\n<p data-id=\"8d7f1fc8-a93c-4a78-b4b1-1247e95715b0\"><span data-ai=\"\">Other notable performers include the VanEck Fabless Semiconductor ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SMHX\" title=\"VanEck Fabless Semiconductor ETF\">SMHX</a></span>) and the iShares Global Tech ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IXN\" title=\"iShares Global Tech ETF\">IXN</a></span>), both of which carry “Buy” quant ratings.</span></p>\n<p data-id=\"6ce3fe55-b070-4e91-b204-b4c739d242bb\"><span data-ai=\"\">Here is the list:</span></p>\n<ol data-id=\"88a347d1-9fa0-4fbe-aef8-cd6af4b566e8\">\n<li data-id=\"87a7a276-dc22-4e9d-9c6f-f6cd0a10f6d4\"><p data-id=\"a3e19755-a5ed-4bb2-af04-675effc12e3c\"><span data-ai=\"\">VanEck Semiconductor ETF (<a href=\"https://seekingalpha.com/symbol/SMH\" title=\"VanEck Semiconductor ETF\">SMH</a>), YTD perf: </span>18.34%</p></li>\n<li data-id=\"05e94746-d16a-4b42-9623-bac453a242ac\"><p data-id=\"8c9c6a41-ebdf-4af3-99ff-9cb07c1d82cd\"><span data-ai=\"\">Strive US Semiconductor ETF (<a href=\"https://seekingalpha.com/symbol/SHOC\" title=\"Strive US Semiconductor ETF\">SHOC</a>), YTD perf: </span>16.50%</p></li>\n<li data-id=\"71215a89-4d5d-469a-b7f4-a9d10a6bc959\"><p data-id=\"32d8bd66-80b7-442c-9f15-8c77566e3bdb\"><span data-ai=\"\">ProShares Ultra Semiconductors ETF (<a href=\"https://seekingalpha.com/symbol/USD\" title=\"ProShares Ultra Semiconductors ETF\">USD</a>), YTD perf: </span>15.83%</p></li>\n<li data-id=\"e307cc62-2d3d-421e-b86c-f0007a69b29c\"><p data-id=\"adcf925f-01b5-4a84-a0ab-7f600bb23de2\"><span data-ai=\"\">GraniteShares 2x Long NVDA Daily ETF (<a href=\"https://seekingalpha.com/symbol/NVDL\" title=\"GraniteShares 2x Long NVDA Daily ETF\">NVDL</a>), YTD perf: </span>6.87%</p></li>\n<li data-id=\"1754d4a7-52a8-4e03-a1db-9dfc84398fdd\"><p data-id=\"dc0ad330-d2cb-469b-a40d-3ff68f842d5f\"><span data-ai=\"\">VanEck Fabless Semiconductor ETF (<a href=\"https://seekingalpha.com/symbol/SMHX\" title=\"VanEck Fabless Semiconductor ETF\">SMHX</a>), YTD perf: </span>6.49%</p></li>\n<li data-id=\"cf1d5f76-c7f4-4a4c-b453-3cef5154f965\"><p data-id=\"ccf0fca9-718c-42f4-84ba-f2ce34de93b3\"><span data-ai=\"\">iShares Global Tech ETF (<a href=\"https://seekingalpha.com/symbol/IXN\" title=\"iShares Global Tech ETF\">IXN</a>), YTD perf: </span>5.05%</p></li>\n<li data-id=\"03fda23f-f41a-4acc-b4de-641d2c87a006\"><p data-id=\"84d95677-a1f1-4346-ba54-110e29177793\"><span data-ai=\"\">iShares ESG Advanced MSCI USA ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/USXF\" title=\"iShares ESG Advanced MSCI USA ETF\">USXF</a></span>), YTD perf: </span>3.20%</p></li>\n<li data-id=\"ed57852d-0322-4378-89d3-92afda54fdfa\"><p data-id=\"5d7dfb67-8d94-4334-850f-b7d20410660e\"><span data-ai=\"\">AXS Esoterica NextG Economy ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/WUGI\" title=\"AXS Esoterica NextG Economy ETF\">WUGI</a></span>), YTD perf: </span>-0.13%</p></li>\n<li data-id=\"d367ba96-2fce-4570-a1b3-096fdea561db\"><p data-id=\"dfe7b286-f207-48c2-8686-720d98b322d7\"><span data-ai=\"\">Fidelity MSCI Information Technology Index ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/FTEC\" title=\"Fidelity MSCI Information Technology Index ETF\">FTEC</a></span>), YTD perf: </span>-0.25%</p></li>\n<li data-id=\"93e1bdbf-cb9e-4e79-bd0f-b208c59c6ed2\"><p data-id=\"f4c71ebe-f669-40a3-9c19-d87b2178561c\"><span data-ai=\"\">Global X PureCap MSCI Information Technology ETF (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GXPT\" title=\"Global X PureCap MSCI Information Technology ETF\">GXPT</a></span>), YTD perf: </span>-2.07%</p></li>\n</ol>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557886-riding-the-ai-wave-top-10-nvidia-fueled-etfs-by-ytd-performance",
            "pub_date": "2026-02-26 23:21:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557874",
            "title": "Fed's Bowman supports easing regulations to allow banks to compete with non-bank financial institutions",
            "description": "<html><body><p data-eci=\"true\">The banking system is sound, but tailoring and easing some regulations will allow banks to compete with non-bank financial institutions, Federal Reserve Vice Chair for Supervision Michelle Bowman said on Thursday in a Senate hearing.</p>\n<p>\"The banking system remains sound and resilient,\" she said in the update from prudential regulators to the <span>U.S. Senate Committee on Banking, Housing, and Urban Affairs. \"Banks continue to report strong capital ratios and significant liquidity buffers, which position them well to support economic growth,\" she said in text for her opening statement.</span></p>\n<p><span>However, she stressed the need for banks to innovate to compete with non-bank financial institutions, which aren't subject to the strict regulations that banks are. \"<span>We have rescinded several policies that were intended to hinder innovation,\" Bowman said. \"</span><span>We are also working with the other banking regulators to develop regulations that include capital and liquidity for stablecoin issuers as required by the GENIUS Act.\"</span></span></p>\n<p><span><span>She vowed to provide clarity on the treatment of digital assets to make sure that the banking system \"is well placed to support digital asset activities.\"</span></span></p>\n<p><span><span>Bowman also said she supports efforts by Congress to lower the regulatory burden on community banks, noting that they shouldn't be subject to the same policies as bigger banks.  \"<span>I support increasing static and outdated statutory thresholds, including asset thresholds, that have not been updated for many years,\" she said. \"Asset growth due, in part, to inflation and economic growth over time has resulted in small banks becoming subject to laws and regulations that were intended for much larger banks.\"</span></span></span></p>\n<p><span><span><span>The regulator also <a href=\"https://www.federalreserve.gov/newsevents/testimony/bowman20260226a.htm\" rel=\"nofollow\" target=\"_blank\" title=\"said\">said</a> she supports improvements to the Bank Secrecy Act and anti-money laundering framework while minimizing unnecessary regulatory burden that disproportionately falls on community banks.</span></span></span></p>\n<p><span><span><span>Developing… Check back for updates.</span></span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557874-feds-bowman-supports-easing-regulations-to-allow-banks-to-compete-with-non-bank-financial-institutions",
            "pub_date": "2026-02-26 23:15:54",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}