{
    "data": [
        {
            "id": "4558012",
            "title": "Essential Utilities reaffirms 5%-7% EPS growth target through 2027 as merger with American Water advances",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Essential Utilities (WTRG) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Chairman and CEO Christopher Franklin highlighted the overwhelming shareholder support for the company's merger with American Water, stating, \"nearly 95% of the shares voted were in favor of the transaction.\" Franklin emphasized the \"record speed\" of shareholder approval and noted that all seven required state filings were completed by year-end 2025. He added, \"we continue to believe that we will close the transaction in the first quarter of 2027.\"</li>\n<li>Franklin reported 2025 earnings per share of $2.20, which he described as \"above our guidance range of $2.07 to $2.11.\" He also underscored the company's record $1.4 billion capital investment in regulated infrastructure for the year and three municipal acquisitions completed in 2025.</li>\n<li>Dividend growth was also addressed, with a 5.25% increase in the quarterly dividend in July, marking the 35th increase in 34 years and 80 consecutive years of paying dividends.</li>\n<li>The CEO noted operational achievements, including the continued execution of the $450 million PFAS capital plan and the installation of over 50 advanced treatment systems, as well as reaching the 100,000 Intelis meter milestone in the natural gas segment.</li>\n<li>Franklin emphasized that merger activities did not detract from operational goals, stating, \"our work on the merger did not distract us from our core operational goals and obligations to our customers and that will most certainly continue through 2026.\"</li>\n<li>Executive VP &amp; CFO Daniel Schuller reported, \"revenues increased $388.5 million or 18.6% from about $2.1 billion a year ago to nearly $2.5 billion this year.\" Schuller also pointed out, \"The $2.20 for 2025 represents significant growth over the $1.97 of non-GAAP income per share in 2024.\"</li>\n<li>Schuller discussed nonrecurring items, including favorable regulatory asset adjustments, insurance proceeds, and merger-related expenses. He stated, \"even excluding these onetime items, both good and bad, we still had strong financial performance that would have exceeded our range.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>The company reaffirmed its \"5% to 7% multiyear earnings per share guidance through 2027 from the adjusted non-GAAP 2024 and earnings per share of $1.97,\" per Franklin. This guidance includes acquisitions expected to close in 2026 but excludes the DELCORA transaction.</li>\n<li>Franklin stated, \"regulated infrastructure investments are expected to be $1.7 billion\" in 2026.</li>\n<li>Schuller recommended applying the 5% to 7% CAGR to the 2024 non-GAAP income per share of $1.97 for a better sense of 2026 performance, given the impact of nonrecurring items in 2025.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Essential Utilities reported full-year 2025 GAAP EPS of $2.20, with Schuller noting it was \"above our guidance range of $2.07 to $2.11 due to nonrecurring benefits.\"</li>\n<li>Revenues grew to nearly $2.5 billion, driven by $177.6 million in regulatory recoveries, $126.8 million in increased purchased gas costs, and $57.2 million from air gas volumes. Customer growth contributed $5.6 million, while lower water volumes reduced revenue by $8.6 million.</li>\n<li>O&amp;M expenses rose by $52.3 million, due to higher employee-related costs, increased Universal Services Rider expenses, and water production cost increases. Merger-related expenses were also noted.</li>\n<li>Regulatory recoveries completed in 2025 totaled $101.5 million of incremental annualized revenue, with $92.6 million from water and wastewater and the remainder from gas.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Paul Zimbardo, Jefferies: Asked if non-GAAP 2025 EPS was quantified with all adjustments. Daniel Schuller: \"No, we didn't specifically, we just gave you kind of the nonrecurring items there, both sort of positive items and then we noted the transaction costs as well.\"</li>\n<li>Zimbardo: Inquired about timing for the next round of Pennsylvania rate cases. Schuller: Indicated a likely continuation of a \"2-year cadence\" for filings.</li>\n<li>Zimbardo: Questioned the tweak in language regarding credit metrics. Schuller: \"We should be above that 12% threshold for Moody's and for S&amp;P. So we feel good about those credit metrics.\"</li>\n<li>Travis Miller, Morningstar: Asked if regulatory activity could be combined with merger approval proceedings. Franklin: \"They are separate dockets and will be adjudicated separately in each case.\" Schuller: \"We don't see those being combined Travis.\"</li>\n<li>Miller: Sought clarification on the company's role in the Chester bankruptcy process. Franklin explained the context of the Supreme Court's ruling, the DELCORA transaction, and potential negotiations for city assets.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analyst tone was neutral, focusing on clarification of non-GAAP adjustments, regulatory cadence, credit metrics, and merger process logistics.</li>\n<li>Management maintained a confident and slightly positive tone in prepared remarks, emphasizing strong results, dividend growth, and successful infrastructure investments. In Q&amp;A, answers were straightforward, with Schuller showing confidence in credit metrics and Franklin providing detailed explanations about regulatory and bankruptcy developments.</li>\n<li>Compared to the previous quarter, management's tone remained confident, while analyst engagement increased due to the return of live Q&amp;A, shifting from the prior quarter's scripted remarks.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter saw the completion of all seven state filings for the American Water merger and a record-setting shareholder approval process.</li>\n<li>Full-year financial results were reported, whereas the previous quarter focused on year-to-date performance and projections.</li>\n<li>Dividend growth and capital investment figures were reaffirmed, with 2026 infrastructure investment expectations increased to $1.7 billion (from $1.4 billion in 2025).</li>\n<li>Management sustained a confident outlook, while analyst focus shifted toward regulatory timing, credit metrics, and merger logistics, reflecting an increased interest in the merger's progression.</li>\n<li>The return of live Q&amp;A in this quarter allowed for more direct analyst challenges and clarifications compared to the previous quarter's prepared remarks only.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Regulatory approval timing for the American Water merger remains a key challenge, with Franklin acknowledging, \"I may not be able to promise this regulatory approval phase will proceed in the same record speed as our shareholder approval.\"</li>\n<li>The ongoing bankruptcy process in the city of Chester and its potential impact on the DELCORA transaction was highlighted, with Franklin stating the company is \"closely monitoring the receiver's next move.\"</li>\n<li>Ongoing national and state discussions around affordability and their potential impact on customer bills were acknowledged, with management reiterating a balanced approach to investments and operating costs.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Management emphasized that Essential Utilities delivered a strong 2025 performance, exceeding its EPS guidance with robust revenue growth and record infrastructure investments while advancing the merger with American Water. The company reaffirmed its 5% to 7% EPS growth target through 2027, highlighted its ability to balance operational execution with major strategic initiatives, and reiterated its commitment to regulatory compliance, customer affordability, and maintaining strong credit metrics as it enters a pivotal phase leading up to the anticipated merger.</p>\n<p><a href=\"https://seekingalpha.com/symbol/wtrg/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558012-essential-utilities-reaffirms-5-percentminus-7-percent-eps-growth-target-through-2027-as",
            "pub_date": "2026-02-27 01:50:42",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558014",
            "title": "PROCEPT BioRobotics outlines $390M–$410M revenue target for 2026 as pricing discipline and commercial realignment reshape outlook",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: PROCEPT BioRobotics (PRCT) Q4 2025  </p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Larry Wood provided an overview of organizational changes since his arrival, stating, \"The next stage of PROCEPT's development requires shifting the operational focus towards increasing procedure volume, expanding margins and achieving profitability and gaining market share.\" Wood detailed a realignment of the commercial team into an integrated regional structure and the creation of a dedicated launch team, explaining, \"The new structure creates a single point of accountability at the regional level to ensure clinical and commercial activities are coordinated around customer success and procedure growth.\" The CEO also emphasized the elimination of discounts on bulk handpiece purchases, describing this as foundational for the company's long-term success and noting, \"We eliminated the historical practice of providing discounts on bulk purchases, particularly at the end of the quarter.\"</li>\n<li>CFO Kevin Waters reported, \"Total revenue for the fourth quarter of 2025 was $76.4 million, representing 12% year-over-year growth.\" He highlighted U.S. procedure growth of approximately 69% year-over-year, a 5% sequential increase in average handpiece selling price to $3,340, and U.S. system revenue of $27.6 million. Waters further stated, \"At the end of 2025, we had an installed base of 718 systems, representing a 42% increase compared to year-end 2024.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Full year 2026 total revenue is now expected between $390 million and $410 million, with anticipated growth of 27% to 33%. Management expects international revenue for 2026 in the range of $50 million to $51 million. The company projects 2026 U.S. procedures between 60,000 and 64,000, or growth of 39% to 48%. \"Our updated guidance incorporates both factors above in addition to the short-term disruption of our sales organization, as discussed by Larry,\" said the CFO. The company expects the average U.S. handpiece selling price to be $3,500 in 2026 and full-year gross margin to be approximately 65%, which includes $5 million to $6 million of tariff expense.</li>\n<li>For the first quarter of 2026, revenue guidance is $79 million to $82 million with U.S. system revenue of approximately $20 million and $10 million of international revenue.</li>\n<li>The company expects full-year 2026 operating expenses to reach $350 million, a 17% increase, and adjusted EBITDA loss to be between $30 million and $17 million, with positive EBITDA expected in Q4 2026.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Total revenue for the fourth quarter was $76.4 million, with U.S. revenue at $66.6 million and international revenue at $9.8 million. U.S. procedures reached approximately 12,200, reflecting 69% growth. Handpieces sold totaled 9,400 units at an average selling price of $3,340. Other consumable revenue was $2.3 million, and total U.S. handpiece and other consumable revenue was $34 million. The company sold 65 new HYDRO systems in Q4. Gross margin for the quarter was 60.6%, down from 64% in Q4 2024, with the decrease attributed to lower-than-expected U.S. consumable revenue and a onetime voluntary field action.</li>\n<li>Operating expenses were $77.4 million, compared to $63.4 million in the prior year. The net loss for Q4 was $29.8 million. Adjusted EBITDA loss was $19 million. Cash, cash equivalents, and restricted cash totaled $285 million as of year-end.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Matthew O'Brien, Piper Sandler: Asked about the handpiece sales softness and inventory changes. CEO Wood explained, \"We had signaled on the Q3 call that we expect there to be some destocking ... but ... as the quarter progressed ... our business practices of allowing bulk purchases at a discount was influencing customer purchase behavior.\"</li>\n<li>O'Brien followed up on the confidence behind back-end loaded 2026 guidance. Wood stated, \"We do think these are going to pay dividends to us ... But those are going to show up more in the back half of the year rather than the front half of the year.\"</li>\n<li>Christopher Pasquale, Nephron Research: Asked about the 1:1 ratio of handpiece sales to procedures. Wood responded, \"We now expect handpiece unit sales and procedure volumes to be in close alignment on a go-forward basis ... Based on all of our analysis and assessments, I think there's probably more upside to that number than downside.\"</li>\n<li>Several analysts pressed on the stability of the sales force and risks of customer dissatisfaction. Wood reported, \"We haven't seen any higher attrition. ... In creating those launch teams, though, we took some of our best people out of the utilization team ... but they have to rebuild relationships with those customers.\"</li>\n<li>Other topics included system pricing, underlying procedure demand, impact of field action on gross margin, and competition from alternative BPH procedures.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts expressed skepticism about the inventory transition, sustainability of procedure growth, and the potential for further guidance reductions, with questions on the durability of recent changes and customer reactions. Their tone was slightly negative, focused on risk and clarity of execution.</li>\n<li>Management maintained a confident but defensive stance, frequently emphasizing structural improvements and transparency: \"We just had to stop some of these things that I think we're hurting our margins, and I think we're encouraging the wrong customer behavior.\"</li>\n<li>Compared to the previous quarter, analyst tone was more pressing, and management's tone shifted from optimism to a mix of confidence and caution, often underscoring the need for foundational changes.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The company transitioned from projecting $410 million–$430 million in 2026 revenue (Q3) to the current $390 million–$410 million range, reflecting the impact of pricing discipline and sales force restructuring.</li>\n<li>Strategic focus shifted from broad expansion and marketing investments to operational discipline, margin expansion, and alignment of handpiece sales with procedure growth.</li>\n<li>Analysts in both quarters questioned sustainability and execution but showed increased concern this quarter over inventory and revenue recognition changes.</li>\n<li>Management's confidence remains, though language is more measured and focused on long-term structural improvements as opposed to only growth.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>The company cited short-term disruption from commercial realignment and the transition to new operating processes.</li>\n<li>Analysts raised concerns about customer adaptation to new pricing, possible procedure volume impacts, and the risk of further guidance changes.</li>\n<li>A onetime voluntary field action impacted Q4 margins. Management stated this was nonrecurring and fully addressed.</li>\n<li>Tariff expenses are expected to increase in 2026, pressuring gross margins.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Management emphasized that pricing discipline, organizational realignment, and greater transparency are foundational steps for sustaining high growth and achieving profitability. While these changes resulted in short-term revenue and gross margin impacts, the company believes they position PROCEPT BioRobotics for more predictable procedure-driven revenue and stronger margins, with a clear path to profitability as the organization adapts to its new commercial model.</p>\n<p><a href=\"https://seekingalpha.com/symbol/prct/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558014-procept-biorobotics-outlines-390m-410m-revenue-target-for-2026-as-pricing-discipline-and",
            "pub_date": "2026-02-27 01:50:42",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558007",
            "title": "Ashford Hospitality Trust outlines $90M-$110M 2026 capex plan as portfolio leans on strategic dispositions and event-driven demand",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Ashford Hospitality Trust (AHT) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Stephen Zsigray opened by highlighting the formation of a special committee in December to evaluate strategic alternatives \"to maximize shareholder value, including a potential transaction.\" Zsigray acknowledged frustration regarding \"the discrepancy between the value of our underlying portfolio and the market value of our common stock\" and reinforced a focus on \"driving outsized performance while pursuing opportunistic dispositions to deleverage, improve cash flow and maximize shareholder value.\"</li>\n<li>The company reported the sale of 6 hotels, generating approximately $145 million in sales proceeds and eliminating nearly $50 million in anticipated capital expenditures. Additional asset sales were announced, with agreements to sell three more hotels for a combined $194.5 million, expected to save $45 million in projected capital expenditures. </li>\n<li>Zsigray disclosed a maturity default on the $325 million JPM8 mortgage loan, stating that \"disposition of these assets for the balance of the debt would represent a 6.2% trailing cap rate and would yield many of the same benefits for the portfolio as our ongoing sales efforts.\" </li>\n<li>CFO Deric Eubanks stated, \"For the fourth quarter, we reported a net loss attributable to common stockholders of $78.3 million or $12.33 per diluted share. For the full year, we reported a net loss attributable to common stockholders of $215 million or $35.99 per diluted share.\" Eubanks also reported adjusted EBITDAre for the quarter of $40.4 million and $221.3 million for the full year, with cash and cash equivalents of $66.8 million at quarter end.</li>\n<li>Senior VP Christopher Nixon explained that \"comparable hotel RevPAR decreased 1.8% compared to the prior year period,\" citing the federal government shutdown and demand disruptions as key factors, but emphasized \"full year total revenue increased 0.8%\" and \"hotel EBITDA increased 2.4%.\" Nixon noted upcoming brand conversions at two properties to Hyatt Regency Hotels with over $70 million planned investment.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management expects opportunistic dispositions to remain a core component of the 2026 strategy and is currently marketing or negotiating transactions on 18 additional hotels. Zsigray said, \"we expect that our continued focus on performance, combined with strategic low cap rate dispositions will result in a leaner, stronger portfolio and will position the company to pursue accretive growth opportunities in the future.\"</li>\n<li>For 2026, capital expenditures are anticipated to be between $90 million and $110 million. Nixon commented, \"we anticipate spending between $90 million and $110 million on capital expenditures.\"</li>\n<li>Group demand is projected to strengthen, with Nixon stating, \"group room revenue pacing ahead 1% in the first quarter of 2026 and 3.3% in the second quarter of 2026 compared to the prior year period,\" and highlighting \"continued acceleration\" in group rooms revenue pace for the full year.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>The company reported AFFO per diluted share of negative $2.45 for the quarter and negative $5.66 for the full year. At the end of Q4, there was $2.6 billion of loans outstanding at a blended average interest rate of 7.7%, with 95% of debt being floating rate.</li>\n<li>Portfolio consisted of 68 hotels with 16,500 net rooms as of December 31, 2025. Net working capital stood at approximately $103.2 million.</li>\n<li>Nixon detailed that resort assets performed well, with Renaissance Palm Springs delivering a 16.9% increase in group room revenue compared to the prior year period. Le Meridien Fort Worth Downtown saw group room revenue growth of 201.2% and food and beverage revenue growth of 59.4% in the fourth quarter.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul><li>NOT_APPLICABLE – The transcript does not contain a Q&amp;A session or analyst questions.</li></ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>No analyst questions or commentary are present in the transcript, so analyst sentiment cannot be assessed.</li>\n<li>Management maintained a cautiously optimistic but pragmatic tone, with Zsigray acknowledging industry headwinds but emphasizing progress: \"Despite numerous headwinds in 2025, we are pleased that for the full year, our portfolio delivered positive growth in comparable total revenues while achieving 2.4% growth in comparable hotel EBITDA.\"</li>\n<li>Compared to the previous quarter, management continued to reinforce a focus on performance and capital structure improvement, but the formation of a special committee to explore strategic alternatives signals an elevated sense of urgency.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Strategic focus shifted more prominently toward exploring value-maximizing transactions, as highlighted by the special committee announcement in Q4, while the previous quarter focused primarily on operational performance and refinancing.</li>\n<li>The number of assets marketed/negotiated for sale expanded to 18 in Q4 from 8 in Q3, indicating a more aggressive disposition strategy.</li>\n<li>Guidance for 2026 capital expenditures increased to a range of $90 million–$110 million for the year, compared to a 2025 anticipated range of $70 million–$80 million in the prior quarter.</li>\n<li>The company reported a higher net loss attributable to common stockholders in Q4 versus Q3, and working capital declined from $144.3 million to $103.2 million.</li>\n<li>Management confidence remained measured, but the tone became more proactive in addressing valuation gaps and liquidity constraints.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Zsigray cited \"industry-wide negative RevPAR growth and margin compression, substantial reductions in government spend, elevated interest rates and increased CapEx demands\" as ongoing pressures for hotel owners.</li>\n<li>The federal government shutdown and a major convention center closure in Austin were identified as significant demand disruptors.</li>\n<li>Maturity default on the $325 million JPM8 mortgage loan was disclosed, with ongoing negotiations for a favorable resolution.</li>\n<li>Management acknowledged that \"liquidity will remain constrained as we execute our plan.\"</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Ashford Hospitality Trust's fourth quarter was marked by the launch of a special committee to evaluate strategic alternatives, a series of hotel sales to reduce leverage and boost cash flow, and continued operational gains despite industry headwinds. Management is guiding for increased capital investments in 2026 and expects event-driven demand to support portfolio performance, particularly in markets hosting major events like the FIFA World Cup. The company remains focused on optimizing its asset base while managing liquidity and cost pressures as it pursues opportunities to close the gap between portfolio value and stock price.</p>\n<p><a href=\"https://seekingalpha.com/symbol/aht/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558007-ashford-hospitality-trust-outlines-90m-110m-2026-capex-plan-as-portfolio-leans-on-strategic",
            "pub_date": "2026-02-27 01:41:30",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558008",
            "title": "VICI targets up to $2.625B 2026 AFFO with $2.1B in new 2025 commitments while advancing portfolio diversification",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: VICI Properties (VICI) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Edward Pitoniak highlighted the company's focus on the operational performance of tenants, referencing the transformation at The Venetian as recognized by Harvard Business School: \"the EBITDAR of the property had increased from $487 million pre-pandemic to $777 million in 2024.\" Pitoniak emphasized, \"given our triple net leases, we don't operate anything that goes on within our real estate, but we pay attention to operations and greatly appreciate all that our operators do every day to make our real estate relevant to their end customers.\"</li>\n<li>President John Payne discussed several new partnerships in 2025, including a long-term relationship with Cain and Eldridge Industries, a $510 million delayed draw term loan with Red Rock Resorts, the addition of Clairvest as the 14th tenant, and a $1.16 billion sale leaseback with Golden Entertainment. Payne stated, \"these announcements combined represents $2.1 billion of committed capital in 2025 at a weighted average initial yield of 8.9%.\" He also noted the company's entry into the Las Vegas locals market and described the market as \"demographically attractive.\"</li>\n<li>CFO David Kieske reported, \"AFFO increased 6.8% year-over-year to $642.5 million and on a per share basis, increased 5.6% year-over-year to $0.60\" for Q4, and \"for the full year 2025, AFFO increased 6.6% year-over-year to $2.5 billion and on a per share basis increased 5.1% year-over-year to $2.38.\" Kieske noted, \"our net income margin for the year was approximately 69%, one of the highest net income margins in the S&amp;P 500.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Kieske stated, \"AFFO for the year ended December 31, 2026, is expected to be between $2.59 billion and $2.625 billion or between $2.42 and $2.45 per diluted common share.\"</li>\n<li>Management reiterated that \"guidance does not include any transactions that have not closed, interest income from any loans that do not yet have final draw structures, possible future acquisitions or dispositions and related capital markets activity or other nonrecurring transactions or items.\"</li>\n<li>The company acknowledged the Las Vegas Strip had a \"relatively softer 2025,\" but described it as \"more of a normalization than a pullback.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Kieske emphasized that the growth in AFFO was \"delivered primarily through the reinvestment of our free cash flow\" and noted, \"we only increased our share count by 1% in 2025.\"</li>\n<li>G&amp;A expense was reported as $19.3 million for Q4 and $65.1 million for the year, representing 1.9% and 1.6% of total revenues, respectively.</li>\n<li>Total debt stood at $17.1 billion, with net debt to annualized fourth quarter adjusted EBITDA at approximately 5x.</li>\n<li>Liquidity at year-end included $3.2 billion in total, with $608 million in cash, $243 million from outstanding forwards, and $2.4 billion of revolver availability.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Caitlin Burrows, Goldman Sachs, asked for updates regarding discussions with Caesars on the master lease. Pitoniak responded, \"as we address lease issues with Caesars, we're going to do so within the context of our overall approach to portfolio and risk management...any solutions that we develop and agree to with Caesars help further our larger portfolio goals of optimizing our exposure to any single tenant to any single category to any single geography.\"</li>\n<li>Burrows also inquired about a senior loan placed on nonaccrual. Pitoniak described the issue as \"a working capital issue\" for the borrower and that the impact was \"de minimis\" and not included in 2026 guidance. Wasserman confirmed, \"there's no income related to that loan included in 2026 guidance.\"</li>\n<li>Barry Jonas, Truist, asked about the deal environment and accounting leadership changes. Payne explained compensation is tied to \"a rolling 2-year AFFO per share growth\" and \"absolute relative total return.\" Gallagher and Payne expressed enthusiasm for Wasserman's expanded business development role, and noted Jeremy Waxman's promotion to Chief Accounting Officer.</li>\n<li>Greg McGinniss, Scotiabank, questioned the rationale for the Greektown Margaritaville lease adjustment. Payne replied, \"we really saw the opportunity to combine 2 leases, simplify the escalation structure, remove the volatility by eliminating the percentage of rent.\"</li>\n<li>Haendel St. Juste, Mizuho, asked about the AFFO guidance range and debt maturities. Kieske identified flexibility in draw schedules, G&amp;A, and interest income, and noted $1.75 billion in maturities later in the year. On Golden transaction cap rates, Payne said, \"every deal we have is just so different...we think the price was appropriate for getting a whole portfolio of assets.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts raised recurring questions about Caesars, loan book risks, deal pipeline, and the durability of new sectors such as sports and entertainment. The tone was neutral to slightly positive, with a focus on clarity and forward visibility.</li>\n<li>Management's prepared remarks conveyed confidence and highlighted disciplined growth. During Q&amp;A, management maintained a neutral and measured tone, particularly when discussing portfolio risk, tenant concentration, debt maturities, and coverage ratios. Phrases such as \"we are going to do so within the context of our overall approach to portfolio and risk management\" and \"we continue to prioritize real estate ownership while also using our loan book\" reflected a cautious but optimistic stance.</li>\n<li>Compared to the previous quarter, both analyst and management tone remained steady, though management's language demonstrated more explicit risk management and portfolio optimization themes.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 AFFO is higher than the prior year, with the new range set between $2.59 billion and $2.625 billion vs. previous guidance of $2.51 billion to $2.52 billion for 2025.</li>\n<li>New partnerships and a $1.16 billion sale leaseback with Golden Entertainment represent an increase in transaction volume compared to Q3, which focused on the addition of Clairvest.</li>\n<li>Management continues to emphasize portfolio diversification and long-term partnership strategy, compared to a prior focus on Las Vegas convention business resiliency and the opportunity in university sports infrastructure.</li>\n<li>Analysts continue to probe on Caesars lease renegotiations, loan risks, and exposure to new experiential sectors, with recurring questions about deal structure and risk.</li>\n<li>Management's tone remains deliberate and focused on stability, with increased discussion of portfolio optimization and measured growth.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Tenant concentration, particularly with Caesars, remains a key risk area. Management reiterated its focus on \"optimizing our exposure to any single tenant to any single category to any single geography.\"</li>\n<li>A senior loan was placed on nonaccrual status due to a borrower's working capital issue, though management characterized the impact as \"de minimis.\"</li>\n<li>Debt maturities totaling $1.75 billion later in 2026 were cited, with management planning to address these through bond market access and continued debt laddering.</li>\n<li>Analysts expressed concern about the volatility of rent escalations and loan portfolio performance, but management emphasized active asset management and conservative guidance inclusions.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>VICI Properties reported strong AFFO growth in Q4 and for the full year 2025, underpinned by disciplined capital allocation, limited share dilution, and new partnerships representing $2.1 billion in committed capital. AFFO guidance for 2026 signals continued growth, with management focusing on portfolio diversification, tenant risk management, and measured expansion into new experiential sectors. The company maintains a robust liquidity position and demonstrates ongoing commitment to optimizing exposure while actively managing its pipeline and tenant relationships.</p>\n<p><a href=\"https://seekingalpha.com/symbol/vici/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558008-vici-targets-up-to-2_625b-2026-affo-with-2_1b-in-new-2025-commitments-while-advancing",
            "pub_date": "2026-02-27 01:41:30",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557736",
            "title": "J.M. Smucker's sales perk up on higher coffee prices; Elliott Mgmt gets 2 board seats - update",
            "description": "<html><body><p data-eci=\"true\">Updated 12:15pm ET on board appointments following negotiations with Elliott Management.</p>\n<p>J.M. Smucker (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SJM\" title=\"The J. M. Smucker Company\">SJM</a></span></span></span>) exceeded Wall Street expectations for the <a href=\"https://seekingalpha.com/news/4557679-j-m-smucker-beats-top-line-and-bottom-line-estimates-updates-fy26-outlook\" target=\"_blank\" title=\"fiscal third quarter\">fiscal third quarter</a>, driven by higher coffee prices and the divestiture of underperforming brands, even as profits continued to face pressure from tariffs and elevated commodity costs.</p>\n<p>The outsized gains have also been attributed to negotiations with Elliott Management in which J.M. Smucker agreed to appoint two new independent directors and entered into an information-sharing agreement with the activist investor to \"facilitate collaboration toward the shared goal of driving sustainable value for all shareholders.\"</p>\n<p>Despite the vagueness of the agreement, investors are hopeful that Elliott's involvement in the business—coupled with the appointment of Woo-Sung (Bruce) Chung and David Singer to the board—will translate into enhanced profitability and disciplined capital allocation. </p>\n<p><span>\"As one of The J.M. Smucker Company's largest investors, we believe the new additions to the Board and decisive shift toward disciplined capital allocation, operational improvement, and purposeful leadership updates represent critical steps toward ensuring The J.M. Smucker Company reaches its full potential,\" said Elliott Management partner Marc Steinberg.</span></p>\n<p><span>The company's shares are down 40% year-over-year and are underperforming the S&amp;P 500 by 56 percentage points. </span></p>\n<p>For its most recent quarter, reflecting the 30%+ surge in coffee prices in FQ3, divestiture of its Voortman business, and certain entities within the company’s Sweet Baked Snacks segment, J.M. Smucker generated $2.34B in net sales during FQ3, beating estimates by $10M. </p>\n<p>Comparable net sales also reflect a 2 percentage point decrease from volume/mix, primarily driven by decreases for sweet baked goods and fruit spreads and lapping contract manufacturing sales related to the divested pet food brands in the prior year, partially offset by an increase for Uncrustables<sup> </sup>sandwiches.</p>\n<p>Although the impact from higher input costs, tariffs, and unfavorable volume/mix was partially offset by higher prices, the company’s profits were down 9% to $2.38 per share but came in $0.12 better than anticipated.</p>\n<p>By segment, coffee outperformed with a 23% increase in revenue. However, decreases in its Dunkin and Folgers brands and a 1 percentage point drop in volume/mix drove down the profit margin for its coffee business by 630 basis points to 21.9%.</p>\n<p>In its frozen food, handheld and spreads business, the profit margin improved 50 basis points on a 2% increase in sales.</p>\n<p>Sales in the pet food business were down 1% and dropped 19% in sweet baked snacks, squeezing both segments’ profit margins by 160 basis points and 1,430 basis points, respectively.</p>\n<p>Looking ahead for fiscal FY26, J.M. Smucker (<a href=\"https://seekingalpha.com/symbol/SJM\" title=\"The J. M. Smucker Company\">SJM</a>) narrowed its sales growth outlook to a range of up 3.5% to up 4% from 3.5%-4.5% previously, translating to a range of $9.031B and $9.07B, less than the $9.08B consensus estimate.</p>\n<p>Earning guidance remained unchanged and is still expected to be within a range of $8.75 and $9.25 per share, straddling the $8.98 estimate.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557736-jm-smuckers-fq3-sales-perk-up-on-higher-coffee-prices",
            "pub_date": "2026-02-27 01:36:04",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557949",
            "title": "CIBC stock gains after Q1 earnings reflect sturdy growth across business lines",
            "description": "<html><body><p data-eci=\"true\" dir=\"ltr\"><span>Canadian Imperial Bank of Commerce (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CM\" title=\"Canadian Imperial Bank of Commerce\">CM</a></span></span>) stock rose 3.6% in midday Thursday trading after its fiscal Q1 earnings indicated growth across all its business lines, with a particularly strong rebound in capital markets revenue.</span></p>\n<p dir=\"ltr\"><span><a href=\"https://seekingalpha.com/pr/20414759-cibc-announces-first-quarter-2026-results\" target=\"_blank\" title=\"Q1 adjusted EPS of C$2.76\">Q1 adjusted EPS of C$2.76</a> (US$2.02), beating the average analyst estimate of C$2.40, climbed from C$2.21 in Q4 2025 and C$2.20 in last year’s Q1.</span></p>\n<p dir=\"ltr\"><span>CIBC's (<a href=\"https://seekingalpha.com/symbol/CM\" title=\"Canadian Imperial Bank of Commerce\">CM</a>) revenue for the quarter ended Jan. 31, 2026, increased to C$8.40B (US$6.14B) from C$7.58B in the previous quarter and C$7.28B a year ago. The current quarter topped the consensus of C$7.77B.</span></p>\n<p dir=\"ltr\"><span>\"We delivered strong financial performance in the first quarter of 2026, including record revenue across all of our business units and higher return on equity, as we accelerated the execution of our client-focused strategy to build on our momentum and deliver more for our stakeholders,\" said President and CEO Harry Culham.</span></p>\n<p dir=\"ltr\"><span>Adjusted preprovision pretax earnings of C$4.08B climbed from C$3.41B in Q4 and C$3.42B in Q1 2025.</span></p>\n<p dir=\"ltr\"><span>Net interest income of C$4.31B, exceeding the Visible Alpha consensus of C$4.24B, increased from C$4.13B in the prior quarter and C$3.80B a year ago.</span></p>\n<p dir=\"ltr\"><span>Provision for credit losses of C$568M, vs. the Visible Alpha estimate of C$563M, fell from C$605M in Q4 and C$573M in last year’s Q1.</span></p>\n<p dir=\"ltr\"><span>Adjusted return on equity of 17.4% vs. 14.1% in the prior quarter and 15.3% a year ago.</span></p>\n<p dir=\"ltr\"><span>CIBC (<a href=\"https://seekingalpha.com/symbol/CM\" title=\"Canadian Imperial Bank of Commerce\">CM</a>) adjusted net income by segment:</span></p>\n<ul>\n<li aria-level=\"1\" dir=\"ltr\"><p dir=\"ltr\" role=\"presentation\"><span>Canadian Personal and Business Banking: C$964M rose 20% Q/Q and 25% Y/Y.</span></p></li>\n<li aria-level=\"1\" dir=\"ltr\"><p dir=\"ltr\" role=\"presentation\"><span>Canadian Commercial Banking and Wealth Management: C$647M increased 7% Q/Q and 9% Y/Y.</span></p></li>\n<li aria-level=\"1\" dir=\"ltr\"><p dir=\"ltr\" role=\"presentation\"><span>U.S. Commercial Banking and Wealth Management: $214M grew 6% Q/Q and 19% Y/Y.</span></p></li>\n<li aria-level=\"1\" dir=\"ltr\"><p dir=\"ltr\" role=\"presentation\"><span>Capital Markets: C$877M surged 60% Q/Q and 42% Y/Y, driven by  increased client activity and constructive markets, the company said. Global markets revenue jumped 22% Y/Y.</span></p></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557949-cibc-stock-gains-after-q1-earnings-reflect-sturdy-growth-across-business-lines",
            "pub_date": "2026-02-27 01:36:04",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558004",
            "title": "Nexstar outlines $1.95B–$2.05B adjusted EBITDA target for 2026 with digital revenue set to surpass national TV advertising",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Nexstar Media Group (NXST) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Perry Sook, Founder, Chairman &amp; CEO, highlighted the company's execution on strategic priorities, stating, \"We delivered on all key operational priorities in 2025, including successfully reviewing and renewing distribution agreements representing over 60% of our subscriber base, further elevating The CW and NewsNation to top-tier networks, extending our affiliation agreements with both ABC and MyNetworkTV and pursuing regulatory reform through our landmark agreement to acquire TEGNA.\" Sook emphasized the progress on the TEGNA acquisition, indicating all regulatory filings were submitted and responses provided, with expectations for closing by the end of Q2 2026. He also pointed to the strength of Nexstar’s sports-focused strategy, noting, \"The CW finished the year as the tenth most watched ad-supported network and the second fastest-growing network overall, delivering a 19% year-over-year increase in viewership. In 2025, we improved the network's cash flow by an impressive 32%.\" Sook indicated profitability for The CW is expected by Q4 2026.</li>\n<li>Sook underscored digital growth, stating digital revenue grew high single digits in 2025 and is expected to surpass national advertising revenue in 2026. Top priorities for 2026 are \"digital optimization and expense rationalization.\"</li>\n<li>Executive VP &amp; CFO Lee Gliha provided guidance: \"We believe Nexstar's stand-alone 2026 adjusted EBITDA will be in the range of $1.95 billion to $2.05 billion.\" Gliha outlined expectations for continued distribution revenue growth, a low double-digit market share of broadcast political advertising, and further cost reductions. She also stated, \"We expect The CW will continue to reduce its losses by another 30% in 2026 from 2025 levels and achieve profitability in the fourth quarter.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Nexstar projects 2026 adjusted EBITDA in the $1.95 billion to $2.05 billion range.</li>\n<li>Distribution revenue growth is expected to be in the low single digits on a gross basis and mid-single digits on a net basis for 2026, with about 30% of subscribers up for renewal this year. Gliha stated, \"our expectation for gross and net distribution revenue growth to be up low and mid-single digits, respectively.\"</li>\n<li>Political advertising is projected to account for a low double-digit share of the $5.28 billion in total broadcast political advertising spend for the 2025–2026 election cycle.</li>\n<li>Digital revenue is forecast to surpass national advertising revenue, marking a strategic milestone.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Fourth quarter net revenue was $1.29 billion, with a 13.4% decline compared to the prior year, primarily due to a reduction in political advertising, according to President &amp; COO Michael Biard.</li>\n<li>Distribution revenue for Q4 was $720 million, up $6 million or 0.8% year-over-year.</li>\n<li>Advertising revenue for the quarter was $549 million, including $21 million in political advertising; nonpolitical advertising increased 4.5% year-over-year.</li>\n<li>Combined Q4 direct operating and SG&amp;A expenses decreased by $7 million or 0.9% year-over-year.</li>\n<li>Adjusted EBITDA for Q4 was $433 million, representing a 33.6% margin; adjusted free cash flow was $214 million.</li>\n<li>Year-end cash balance was $280 million, and outstanding debt was $6.3 billion with a first lien covenant ratio of 1.71x.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Daniel Kurnos, The Benchmark Company, LLC, Research Division, asked about regulatory timing and AI-driven expense reduction. Sook responded, \"the FCC shot clock would technically expire on June 1 of this year. So we remain consistent in our belief that the transaction will close before the end of second quarter.\" Gliha added, \"this will be a good year for us because we do expect our digital revenue to eclipse our national television advertising revenue.\"</li>\n<li>Benjamin Soff, Deutsche Bank, inquired about regulatory surprises and DOJ views. Sook noted, \"we continue to engage vigorously with the DOJ…if there are any divestitures, they would be de minimis to the overall value of the deal.\"</li>\n<li>Aaron Watts, Deutsche Bank, asked about leverage post-TEGNA. Gliha: \"Not really, no.\" Watts also questioned programmatic ad sales, to which Sook explained the integration of TEGNA's Premion platform and ongoing development of a seamless programmatic linear solution.</li>\n<li>Patrick Sholl, Barrington Research, sought details on ad categories. Gliha highlighted auto as the largest declining category, offset by digital growth, and noted improvement in auto trends into Q1. No significant impact from tariffs was observed.</li>\n<li>Craig Huber, Huber Research Partners, LLC, asked about AI. Biard described AI tools in newsrooms for workflow efficiencies and ongoing deployment in sales prospecting.</li>\n<li>Steven Cahall, Wells Fargo, questioned DOJ sentiment and digital synergies. Sook: \"we have provided reams of information to DOJ…we, at this point, have not had any definitive feedback.\"</li>\n<li>Jason Bazinet, Citi, asked about digital revenue definitions. Gliha clarified the distinction between CW network national advertising and other national advertising at local stations.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts exhibited a neutral to slightly positive tone, focusing on regulatory clarity, expense controls, and digital monetization. Questions centered on deal timing, leverage, and ad trends.</li>\n<li>Management maintained a confident and optimistic tone in both prepared remarks and Q&amp;A, consistently emphasizing progress on strategic goals and regulatory processes. Sook and Gliha repeatedly referenced confidence in closing the TEGNA deal and driving revenue growth, with Sook stating, \"we are energized by the significant prospects before us.\"</li>\n<li>Compared to the prior quarter, analyst tone remained focused on regulatory and advertising trends, with management showing increased confidence in digital and expense initiatives.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter introduced explicit 2026 adjusted EBITDA guidance and a milestone expectation for digital revenue to surpass national advertising, which were not specifically outlined in the previous quarter.</li>\n<li>Management's tone shifted to greater emphasis on digital optimization and cost rationalization.</li>\n<li>Analysts' questions continued to focus on regulatory developments and advertising, but with increased scrutiny on AI, digital, and integration synergies.</li>\n<li>The CW's performance was highlighted with higher cash flow growth and a path to profitability, an evolution from the prior quarter's focus on reducing losses.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Regulatory approval of the TEGNA acquisition and potential for required divestitures, though management expects any divestitures to be minimal.</li>\n<li>Continued subscriber attrition in pay TV, though trends are stabilizing.</li>\n<li>Political advertising displacement effect on nonpolitical advertising revenue in the back half of 2026.</li>\n<li>AI search headwinds impacting digital revenue, though offset by strong local digital performance.</li>\n<li>Dependence on macroeconomic conditions affecting advertising categories, particularly auto.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Nexstar’s leadership emphasized strong execution on operational priorities, a robust outlook for digital and political advertising, and disciplined expense management. The company remains on track to close the TEGNA acquisition by the end of Q2 2026 and projects 2026 adjusted EBITDA of $1.95 billion to $2.05 billion. Management expects digital revenue to surpass national TV advertising for the first time, while The CW is forecast to achieve profitability by year-end. The focus remains on digital optimization, expense rationalization, and leveraging the scale and synergies from the pending TEGNA acquisition to deliver shareholder value.</p>\n<p><a href=\"https://seekingalpha.com/symbol/nxst/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558004-nexstar-outlines-1_95b-2_05b-adjusted-ebitda-target-for-2026-with-digital-revenue-set-to",
            "pub_date": "2026-02-27 01:30:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557973",
            "title": "Sigma Lithium extends decline amid Blue Orca short call",
            "description": "<html><body><ul>\n<li>Sigma Lithium (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SGML\" title=\"Sigma Lithium Corporation\">SGML</a></span>) dropped 13% amid a short report from Blue Orca. </li>\n<li>Blue Orca disclosed that it's short shares of Sigma Lithium (<a href=\"https://seekingalpha.com/symbol/SGML\" title=\"Sigma Lithium Corporation\">SGML</a>).</li>\n<li>Sigma Lithium didn't immediately respond to Seeking Alpha's email request for comment.</li>\n<li>Sigma Lithium (<a href=\"https://seekingalpha.com/symbol/SGML\" title=\"Sigma Lithium Corporation\">SGML</a>) has <a href=\"https://seekingalpha.com/symbol/SGML\" target=\"_blank\" title=\"short interest of 8.4%.\">short interest of 8.4%.</a>\n</li>\n</ul>\n<p data-eci=\"true\"> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557973-sigma-lithium-extends-decline-amid-blue-orca-short-call",
            "pub_date": "2026-02-27 01:30:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557993",
            "title": "Clariant AG reports Q4 results",
            "description": "<html><body><ul>\n<li>Clariant AG (CLZNF): Q4 sales increased by 1% in local currencies to CHF 1.028 billion.</li>\n<li>EBITDA margin before exceptional items increased by 240 basis points to 17.1%.</li>\n<li>Outlook 2026: local currency sales to be around flat; EBITDA margin before exceptional items at around 18%; medium-term targets confirmed.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557993-clariant-ag-reports-q4-results",
            "pub_date": "2026-02-27 01:25:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557995",
            "title": "Viridien Société anonyme reports FY results",
            "description": "<html><body><ul>\n<li>Viridien Société anonyme <a href=\"https://s203.q4cdn.com/882900163/files/doc_financials/2025/q4/Vusion_FY_2025_Results_Slides.pdf\" rel=\"nofollow\" target=\"_blank\">press release</a>  (VIRDY): FY</li>\n<li>Revenue of €1.53B (+51.5% Y/Y).</li>\n<li>EBITDA and net loss came in at €277.4 million and €14.5 million, respectively.</li>\n</ul>\n<p data-eci=\"true\"><strong>Outlook 2026</strong></p>\n<ul>\n<li>+15 to +20% Group Adjusted Revenue growth expected in FY 2026 at constant Forex and Tariffs</li>\n<li>VAS Revenue to grow 2x faster than total Group Revenue</li>\n<li>Profitability improvement with adjusted EBITDA margin1 growing by more than 100 bps</li>\n<li>Continued positive operating free cash-flow generation</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557995-viridien-societe-anonyme-reports-fy-results",
            "pub_date": "2026-02-27 01:25:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}