{
    "data": [
        {
            "id": "4558803",
            "title": "Mastec targets $17B revenue and $8.40 EPS in 2026 as backlog and data center opportunities surge",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: MasTec, Inc. (MTZ) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Jose Mas reported that revenue for the quarter was just shy of $4 billion, representing a 16% year-over-year increase, bringing full-year revenue to $14.3 billion, a record for MasTec. Adjusted EBITDA for Q4 was $338 million, up 25% year-over-year, and full-year EBITDA reached $1.15 billion. Adjusted earnings per share was $2.07, marking a 44% increase over the prior year quarter. Mas stated, \"We exceeded guidance again in revenue, EBITDA and EPS, highlighting another strong execution quarter and year for MasTec.\"</li>\n<li>Mas highlighted significant backlog growth, stating, \"On a full year basis, backlog was up over $4.5 billion, a 33% annual increase. Sequentially, backlog was up over $2 billion, representing a 1.6x book-to-bill.\" He drew attention to the mix, with nearly $1 billion of data center-related work now included in backlog. He noted the company’s first construction management agreement for a turnkey data center site, with future opportunities for MasTec to self-perform a greater scope of work.</li>\n<li>The company acquired NV2A, a construction management services firm, and McKee Utility Contractors, a water infrastructure service provider, to enhance growth in construction management and water infrastructure. Mas said, \"We are excited to welcome our new partners to the MasTec family and expect them to hit the ground running and contribute to MasTec's near-term success.\"</li>\n<li>Paul Dimarco, Executive VP &amp; CFO, stated, \"Our Communications segment continued its trajectory of strong revenue growth in the fourth quarter, exceeding guidance by $139 million, with 23% year-over-year growth for Q4 and 32% for the full year.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>MasTec guided for 2026 full-year revenue of $17 billion, reflecting about 19% growth, and adjusted EBITDA of $1.45 billion with an 8.5% margin. Adjusted EPS is forecasted at $8.40, compared to $6.55 in 2025. The company expects organic growth in the mid-teens and segment growth led by Clean Energy &amp; Infrastructure (CE&amp;I) at around 35%, Pipeline Infrastructure at 17%, Power Delivery at 11%, and Communications just under double digits.</li>\n<li>The company projects cash flow from operations to exceed $1 billion for 2026 and net capital expenditures of about $200 million.</li>\n<li>Guidance assumes acquisitions will contribute approximately $500 million of revenue at high single-digit EBITDA margins for 2026.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Fourth quarter revenue was just shy of $4 billion. Adjusted EBITDA for the quarter was $338 million. Full-year revenue reached $14.3 billion, with full-year EBITDA at $1.15 billion. Adjusted earnings per share for Q4 was $2.07.</li>\n<li>Backlog at year-end increased by over $4.5 billion compared to the prior year, and sequentially by over $2 billion. Power Delivery backlog ended the year at $5.6 billion, a record for the segment.</li>\n<li>Cash flow from operations was $373 million in Q4 and $546 million for the full year. Free cash flow for Q4 was $306 million, totaling $342 million for the year. Liquidity at year-end was approximately $2.1 billion.</li>\n<li>Net leverage was 1.7x, well within the company's financial policy.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Brian Russo, Jefferies, asked about Power Delivery margins and the initiatives to approach double digits. Dimarco responded, \"There's been a lot of focus on execution of the base business... we'll get operating leverage as some of the larger projects begin to materialize in a more meaningful way.\"</li>\n<li>Andrew Kaplowitz, Citi, inquired about delays in Pipeline projects and margin guidance. Mas clarified, \"I think we've always guided mid-teens in our Pipeline business... our objective is to beat that. Historically, we've outperformed that.\"</li>\n<li>Jamie Cook, Truist Securities, questioned visibility beyond the 18-month backlog and the timeline to achieve peak Pipeline revenue. Mas stated, \"We've talked about hitting historical highs in Pipeline revenue as early as 2027.\"</li>\n<li>Steven Fisher, UBS, asked about margin expectations in Communications. Mas replied, \"Margins improved 60 basis points year-over-year... we've done a really good job of managing the growth and improving margins along the way.\"</li>\n<li>Questions repeatedly addressed backlog quality, margin improvement, segment visibility, and the integration/impact of acquisitions.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts maintained a positive but probing tone, focusing on backlog visibility, margin expansion, and the integration of acquisitions. Queries on segment-specific growth drivers and execution risks were persistent, with analysts seeking clarity on sustainability and timing of improvements.</li>\n<li>Management’s tone remained confident and forward-looking in both prepared remarks and responses, emphasizing execution, margin optimization, and robust demand. Mas stated, \"We are super focused on the margin improvements across the company.\"</li>\n<li>Compared to the previous quarter, management’s confidence in multi-year growth and margin improvement was more pronounced. Analyst tone was consistent, with a continued focus on execution risks and backlog conversion.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 was raised to $17 billion in revenue and $8.40 in adjusted EPS, compared to previous Q3 guidance of $14.075 billion revenue and $6.40 EPS for 2025.</li>\n<li>Backlog growth accelerated, and the mix highlighted new data center and water infrastructure opportunities, a shift from the previous quarter’s emphasis on telecom and traditional infrastructure.</li>\n<li>Margin expansion is now called out across most segments, with increased focus on construction management contracts and self-perform opportunities in data centers.</li>\n<li>Analysts’ questions shifted toward sustainability of growth, backlog quality, and the impact of recent acquisitions, as opposed to last quarter’s focus on segmental growth rates and risk management.</li>\n<li>Management’s confidence in long-term visibility and willingness to invest in growth, both organically and via M&amp;A, was more explicit than in the prior quarter.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management noted ongoing start-up costs and margin pressures in new programs, particularly in Communications and Power Delivery.</li>\n<li>Margin headwinds in Power Delivery were attributed to permitting delays and lack of storm-related revenue, but the restart of the Greenlink project was cited as a positive development.</li>\n<li>Analysts asked about structural barriers to margin expansion, project execution risks, and integration of acquisitions.</li>\n<li>Mas highlighted the challenges of rapid organic growth and the need for continued investment in workforce and equipment, which can temporarily pressure margins.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>MasTec delivered record results in Q4 and full-year 2025, with strong backlog growth and diversified end-market exposure. The company projects continued robust growth in 2026, targeting $17 billion in revenue and $8.40 in adjusted EPS, supported by accelerating opportunities in data center construction, water infrastructure, and pipeline expansion. Management emphasized a clear path to margin improvement, strong cash flow generation, and a disciplined approach to capital allocation, positioning MasTec for consistent long-term earnings growth.</p>\n<p><a href=\"https://seekingalpha.com/symbol/mtz/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558803-mastec-targets-17b-revenue-and-8_40-eps-in-2026-as-backlog-and-data-center-opportunities",
            "pub_date": "2026-02-28 01:01:45",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558782",
            "title": "US agencies raise concerns over use of xAI's Grok: report",
            "description": "<html><body><p data-eci=\"true\">In recent months, officials at several U.S. federal agencies have raised concerns about the safety and reliability of Elon Musk’s xAI's (<a href=\"https://seekingalpha.com/symbol/X.AI\" title=\"xAI\">X.AI</a>) AI tools, showing continuing disagreements within the U.S. government about which AI models to deploy, The Wall Street Journal reported, citing people with knowledge of the matter.</p>\n<p>The warnings came before the Pentagon’s decision this week to allow xAI's AI chatbot Grok to be used in classified settings, the report <a href=\"https://www.wsj.com/politics/national-security/elon-musk-xai-grok-security-safety-government-73ab4f6e\" rel=\"nofollow\" target=\"_blank\" title=\"added\">added</a>.</p>\n<p>xAI did not immediately respond to a request for comment from Seeking Alpha.</p>\n<p>Anthropic (<a href=\"https://seekingalpha.com/symbol/ANTHRO\" title=\"Anthropic\">ANTHRO</a>) was the only developer approved for classified use before the deal between xAI and the military. However, the Pentagon and Dario Amodei-led Anthropic have been at odds over the use of AI. On Thursday, Amodei <a href=\"https://seekingalpha.com/news/4558446-anthropic-ceo-rejects-pentagon-demand-for-unrestricted-model-access-says-threats-wont-sway-it#hasComeFromMpArticle\" target=\"_blank\" title=\"rejected\">rejected</a> the Department of War's demand for unrestricted access to its AI models. Pentagon leaders, including U.S. Secretary of Defense Pete Hegseth, wanted Anthropic to loosen restrictions on the use of AI. </p>\n<p>In recent months, Ed Forst, the top official at the General Services Administration, or GSA, a procurement arm of the U.S. government, raised concerns with White House officials about potential safety issues with Grok, the report noted.</p>\n<p>Other GSA officials under him had also shown safety concerns about Grok, which they viewed as sycophantic and too susceptible to manipulation or corruption by faulty or biased data — creating a potential system risk, according to the report.</p>\n<p>At the time, in late December and early January, Grok was under <a href=\"https://seekingalpha.com/news/4542337-eu-lawmaker-says-regulator-opens-probe-into-x-over-grok-images\" target=\"_blank\" title=\"scrutiny\">scrutiny</a> for allowing sexualized editing of photos, including of children. Government officials saw the issue as representative of how Grok may be exploited by bad actors, the report added.</p>\n<p>The matter reached White House Chief of Staff Susie Wiles, who called a senior xAI executive about the concerns. The executive told her that xAI was working on addressing the safety issues that made Grok over-compliant, the report noted.</p>\n<p>Josh Gruenbaum, a senior GSA acquisitions official recruited via the Department of Government Efficiency, assured government officials that the government platform of Grok was separate from the public one. Wiles was satisfied, as per the report.</p>\n<p>Last month, xAI said it <a href=\"https://seekingalpha.com/news/4539300-elon-musk-xai-grok-image-editing-restrictions#hasComeFromMpArticle\" target=\"_blank\" title=\"implemented\">implemented</a> technological measures to prevent Grok from editing images of real people in revealing clothing, and the restriction will apply to all users, including paid subscribers.</p>\n<p>In recent weeks, GSA officials were told to put xAI’s logo on a tool called USAi, which is a sandbox for federal employees to experiment with different AI models. Grok has not been made accessible through USAi largely because of safety concerns, and it remains off the platform, the report noted.</p>\n<p>The website shows xAI’s logo but only offers models from Anthropic, Google (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>) (<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>), and Meta (<a href=\"https://seekingalpha.com/symbol/META\" title=\"Meta Platforms, Inc.\">META</a>), as per the report.</p>\n<p>A team at the GSA studying AI has circulated a report to top agency officials that indicated Grok’s safety problems. Grok has been suspended for use by GSA staffers for months. Demand from other agencies to use Grok has been weak except in a few cases where people wanted to use it to mimic a bad actor for defensive testing, the report noted.</p>\n<p>In a statement, Gruenbaum said the agency takes AI safety seriously. \"We rigorously evaluate frontier AI models, including xAI, through a comprehensive internal review process. In this instance, we followed established procedures and maintain our determination to keep it on schedule,\" said Gruenbaum.</p>\n<p>Two weeks ago, Matthew Johnson, the Pentagon’s chief of responsible AI, stepped down in part over his concerns that safety and governance had become an afterthought amid the Defense Department’s push to expand AI capabilities, the report noted.</p>\n<p>Previously, Johnson’s team had circulated memos that highlighted Grok’s safety issues and questioned if it was aligned with government ethics and standards. Those notes had been sent up their chain of command at the Pentagon, the report added.</p>\n<p>\"The department will continue to ensure the safety and security of all models utilized regardless of classification level,\" said a Pentagon official, the report noted.</p>\n<p>Earlier this month, Elon Musk's space company SpaceX (<a href=\"https://seekingalpha.com/symbol/SPACE\" title=\"SpaceX\">SPACE</a>) announced it was <a href=\"https://seekingalpha.com/news/4545617-elon-musk-seems-to-corroborate-spacex-xai-merger\" target=\"_blank\" title=\"acquiring\">acquiring</a> xAI (<a href=\"https://seekingalpha.com/symbol/X.AI\" title=\"xAI\">X.AI</a>).</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558782-us-agencies-raise-concerns-over-use-of-xais-grok",
            "pub_date": "2026-02-28 01:01:45",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558800",
            "title": "NCR Atleos Non-GAAP EPS of $1.49 beats by $0.13, revenue of $1.15B in-line",
            "description": "<html><body><ul>\n<li>NCR Atleos <a href=\"https://investor.ncratleos.com/news-events/press-releases/detail/173/ncr-atleos-corporation-reports-strong-results-in-2025\" rel=\"nofollow\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NATL\" title=\"NCR Atleos Corporation\">NATL</a></span>): Q4 Non-GAAP EPS of $1.49 <span> beats by $0.13</span>.</li>\n<li>Revenue of $1.15B (+4.5% Y/Y) in-line.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558800-ncr-atleos-non-gaap-eps-of-1_49-beats-by-0_13-revenue-of-1_15b-in-line",
            "pub_date": "2026-02-28 00:56:46",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558788",
            "title": "Large-cap industrials margin leaders as PPI comes in hot",
            "description": "<html><body><p data-eci=\"true\">Producer prices came in hotter than expected in the first month of the year, renewing <a href=\"https://seekingalpha.com/news/4551970-the-widening-gap-between-cpi-and-ppi-is-what-truly-matters-for-the-stock-market-strategist\" target=\"_blank\" title=\"concerns about corporate margins\">concerns about corporate margins</a> and bringing large-cap gross profit margin leaders into focus.</p>\n<p>The <span><a href=\"https://seekingalpha.com/news/4558689-producer-price-index-rises-more-than-expected-in-january\" target=\"_blank\" title=\"U.S. Producer Price Index\">U.S. Producer Price Index</a> increased </span>0.5%<span> M/M in January, hotter than the +0.3% consensus and +0.4% in December (revised from +0.5%), according to data released by the Bureau of Labor Statistics on Friday. Core PPI (excluding food and energy) advanced +0.8% M/M vs. +0.3% consensus and +0.6% prior (revised from +0.7%).</span></p>\n<p>A screen of U.S. large-cap industrial stocks (excluding human resources and employment services, research and consulting services, and data processing and outsourced services industries) shows companies with the highest gross profit margins on a trailing-twelve-month basis. Each stock in the top-10 group holds an overall Seeking Alpha Quant system rating of Hold.</p>\n<p>Here is the list:</p>\n<ol>\n<li>Fortive Corp (<a href=\"https://seekingalpha.com/symbol/FTV\" title=\"Fortive Corporation\">FTV</a>); industry: Industrial Machinery &amp; Supplies &amp; Components; profit margin: 63.5%; Quant rating: 3.30.</li>\n<li>Veralto (<a href=\"https://seekingalpha.com/symbol/VLTO\" title=\"Veralto Corporation\">VLTO</a>): Environmental and Facilities Services; 60.0%; 2.91</li>\n<li>Axon Enterprises (<a href=\"https://seekingalpha.com/symbol/AXON\" title=\"Axon Enterprise, Inc.\">AXON</a>): Aerospace and Defense; 59.8%; 2.99</li>\n<li>TransDigm Group (<a href=\"https://seekingalpha.com/symbol/TDG\" title=\"TransDigm Group Incorporated\">TDG</a>): Aerospace and Defense; 59.7%; 3.09</li>\n<li>Union Pacific (<a href=\"https://seekingalpha.com/symbol/UNP\" title=\"Union Pacific Corporation\">UNP</a>): <span>Rail Transportation; 56.4%; 3.05</span>\n</li>\n<li><span>Nordson (<a href=\"https://seekingalpha.com/symbol/NDSN\" title=\"Nordson Corporation\">NDSN</a>): Industrial Machinery &amp; Supplies &amp; Components; 55.3%; 3.31</span></li>\n<li><span>Emerson Electric (<a href=\"https://seekingalpha.com/symbol/EMR\" title=\"Emerson Electric Co.\">EMR</a>): Electricial Components and Equipment; 52.3%; 3.31</span></li>\n<li><span>Rollins (<a href=\"https://seekingalpha.com/symbol/ROL\" title=\"Rollins, Inc.\">ROL</a>): Environmental and Facilities Services; 52.3%; 2.75</span></li>\n<li><span>Graco (<a href=\"https://seekingalpha.com/symbol/GGG\" title=\"Graco Inc.\">GGG</a>): Industrial Machinery &amp; Supplies &amp; Components; 52.3%; 2.83</span></li>\n<li>\n<span>Snap-on (<a href=\"https://seekingalpha.com/symbol/SNA\" title=\"Snap-on Incorporated\">SNA</a>): Industrial Machinery &amp; Supplies &amp; Components; 51.7%; 2.76</span><span></span>\n</li>\n</ol>\n<p><span><strong id=\"docs-internal-guid-4355e247-7fff-12e1-cc69-276410e8a49d\">Industrials ETFs: </strong>(<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/XLI\" title=\"State Street Industrial Select Sector SPDR ETF\">XLI</a></span>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/VIS\" title=\"Vanguard Industrials Index Fund ETF\">VIS</a></span>), (<a href=\"https://seekingalpha.com/symbol/FXR\" title=\"First Trust Industrials/Producer Drbls AlphaDEX Fd ETF\">FXR</a>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IYJ\" title=\"iShares US Industrials ETF\">IYJ</a></span>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/FIDU\" title=\"Fidelity MSCI Industrials Index ETF\">FIDU</a></span>), and (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/RSPN\" title=\"Invesco S&amp;P 500 Eql Wght Industrials ETF\">RSPN</a></span>).</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558788-large-cap-industrials-margin-leaders-as-ppi-comes-in-hot",
            "pub_date": "2026-02-28 00:56:46",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558773",
            "title": "Berkshire Hathaway to report Q4, last quarter of Buffett's reign",
            "description": "<html><body><p data-eci=\"true\" dir=\"ltr\"><span>Berkshire Hathaway’s (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BRK.B\" title=\"Berkshire Hathaway Inc.\">BRK.B</a></span>) (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BRK.A\" title=\"Berkshire Hathaway Inc.\">BRK.A</a></span>) changing of the guard will be front and center on Saturday, when CEO Greg Abel delivers his first letter to shareholders, marking the end of Warren Buffett’s legendary six-decade-long leadership of the investing behemoth.</span></p>\n<p dir=\"ltr\"><span>While Abel shared the dais with Buffett at the company’s 2025 annual meeting, investors will still be adjusting to the new management tone and style. Don’t expect any tectonic shifts in leadership, though. Abel has vowed to maintain Berkshire Hathaway’s unique culture. Both the Q4 earnings and the letter to shareholders will come out at 8:00 AM ET on Saturday.</span></p>\n<p dir=\"ltr\"><span>One thing that Buffett, who remains chairman, has promised is that Berkshire Hathaway will always have a large pile of cash. At Sept. 30, 2025, the stash stood at $381.7B. Any reduction in that amount signals that the company found compelling investment opportunities. Abel is likely to discuss where he sees investing opportunities in the current environment.</span></p>\n<p dir=\"ltr\"><span>\"The first year won't be easy, as all of his steps will be watched closely by the public and compared against the legend, Buffett,\" said SA Analyst<a href=\"https://seekingalpha.com/article/4864771-berkshire-keeps-falling-and-we-keep-buying\" target=\"_blank\" title=\" Millennial Dividends\"> Millennial Dividends</a>. The first burning question, perhaps, is, what will he do with the $380B cash pile?</span></p>\n<p dir=\"ltr\"><span>The SA analyst also muses about the potential for Berkshire to issue a dividend, something Buffett allowed only once in his tenure.</span></p>\n<p dir=\"ltr\"><span>SA Analyst </span><a href=\"https://seekingalpha.com/author/bohdan-kucheriavyi\"><span>Bohdan Kucheriavyi</span></a><span> considers Berkshire’s shares to be undervalued. If Buffett and Abel agree, the company may have bought back some of its shares in Q4 after pausing buybacks for five quarters.</span></p>\n<p dir=\"ltr\"><span>Another point of speculation is whether Abel will eventually divest Berkshire Hathaway's 27.5% stake in Kraft Heinz (<a href=\"https://seekingalpha.com/symbol/KHC\" title=\"The Kraft Heinz Company\">KHC</a>), which Buffett describes as one of his biggest blunders. Earlier this month, <a href=\"https://seekingalpha.com/news/4550181-kraft-heinz-pauses-separation-to-invest-in-growth-profitability\" target=\"_blank\" title=\" Kraft Heinz halted its plan \"> Kraft Heinz halted its plan </a>to split Kraft from Heinz to return the business to profitable growth.</span></p>\n<p dir=\"ltr\"><span>The biggest part of Berkshire’s wholly owned operating business is insurance, which includes Geico and several others. The Visible Alpha consensus estimate for Q4 premium revenue is $22.6B, down 0.6% from a year ago. By contrast, premium revenue in Q3 2025 was $22.4B, up 0.2% Y/Y.</span></p>\n<p dir=\"ltr\"><span>Also keep an eye on the company’s energy business, specifically PacifiCorp, which is under pressure due to lawsuits related to Pacific Northwest wildfires in 2020 that are blamed on its power lines. Earlier this week, a jury </span><a href=\"https://seekingalpha.com/news/4557819-berkshire-s-pacificorp-owes-another-305m-in-latest-oregon-wildfire-verdict\"><span>awarded $305M to wildfire </span></a><a href=\"https://survivors.in\" rel=\"nofollow\"><span>survivors</span></a><span> in a case against the company. Last week, Berkshire’s PacifiCorp unit </span><a href=\"https://seekingalpha.com/news/4554900-berkshires-pacificorp-to-pay-575m-settlement-of-u-s-governments-wildfire-claims\"><span>agreed to pay $575M </span></a><span>to settle federal government claims related to the fires but denied liability.</span></p>\n<p dir=\"ltr\"><span>Q4 revenue from its utilities and energy division is expected to increase 1.7% Y/Y to $6.35B, according to the Visible Alpha consensus; that compares with Q3 revenue of $6.05B, which edged up 0.1% Y/Y.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558773-berkshire-hathaway-to-report-q4-last-quarter-of-buffetts-reign",
            "pub_date": "2026-02-28 00:51:15",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558799",
            "title": "The Baldwin Insurance Group Non-GAAP EPS of $0.31 beats by $0.02, revenue of $347.3M misses by $4.89M",
            "description": "<html><body><ul>\n<li>The Baldwin Insurance Group <a href=\"https://ir.baldwin.com/news-releases/news-release-details/baldwin-group-announces-fourth-quarter-and-full-year-2025\" rel=\"nofollow\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BWIN\" title=\"The Baldwin Insurance Group, Inc.\">BWIN</a></span>): Q4 Non-GAAP EPS of $0.31 <span> beats by $0.02</span>.</li>\n<li>Revenue of $347.3M (+5.3% Y/Y) <span> misses by $4.89M</span>.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558799-the-baldwin-insurance-group-non-gaap-eps-of-0_31-beats-by-0_02-revenue-of-347_3m-misses-by",
            "pub_date": "2026-02-28 00:51:15",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558794",
            "title": "Bitcoin vs. S&P 500: The 5-year gap that shows doubled returns",
            "description": "<html><body><p data-eci=\"true\">Despite its reputation for dramatic price swings and headline-grabbing rallies, bitcoin (<a href=\"https://seekingalpha.com/symbol/BTC-USD\" title=\"Bitcoin USD\">BTC-USD</a>) has trailed the broader U.S. equity market over the past five years.</p>\n<p>The digital token, which currently trades near $66,000, has gained approximately 42% over the half-decade period. While that advance underscores bitcoin’s resilience following multiple boom-and-bust cycles, it falls short of the performance delivered by large-cap U.S. stocks. </p>\n<p>Over the same timeframe, the benchmark S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>) — now hovering around 6,875—has climbed roughly 80%. The index’s return is nearly double that of bitcoin, reflecting sustained corporate earnings growth, strong participation from mega-cap technology firms, and continued investor appetite for equities despite intermittent volatility.</p>\n<p>The comparison may come as a surprise to some market participants, particularly given bitcoin’s outsized rallies during certain stretches. However, sharp drawdowns in 2022, 2026, and periods of consolidation have tempered its cumulative five-year performance.</p>\n<p>While bitcoin remains a highly watched asset within the digital currency ecosystem and a popular vehicle for speculative capital, recent data suggest that traditional equities have offered superior risk-adjusted returns over the medium term.</p>\n<p>The divergence also highlights how portfolio outcomes can vary significantly depending on asset allocation and entry timing. </p>\n<p><strong>S&amp;P 500 Funds: </strong>(<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SPY\" title=\"State Street SPDR S&amp;P 500 ETF Trust\">SPY</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/VOO\" title=\"Vanguard 500 Index Fund ETF\">VOO</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IVV\" title=\"iShares Core S&amp;P 500 ETF\">IVV</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/RSP\" title=\"Invesco S&amp;P 500 Eql Wght ETF\">RSP</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SSO\" title=\"ProShares Ultra S&amp;P500 ETF\">SSO</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/UPRO\" title=\"ProShares UltraPro S&amp;P500 ETF\">UPRO</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SH\" title=\"ProShares Short S&amp;P500 ETF\">SH</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SDS\" title=\"ProShares UltraShort S&amp;P500 ETF\">SDS</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SPXU\" title=\"ProShares UltraPro Short S&amp;P500 ETF\">SPXU</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/FXAIX\" title=\"Fidelity 500 Index Fund\">FXAIX</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/VFIAX\" title=\"Vanguard 500 Index Fund Admiral\">VFIAX</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/VFFSX\" title=\"Vanguard 500 Index Fund Institutional Select\">VFFSX</a></span></span>), and (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SWPPX\" title=\"Schwab S&amp;P 500 Index Fund\">SWPPX</a></span></span>). </p>\n<p><strong>Bitcoin Funds: </strong>(<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IBIT\" title=\"iShares Bitcoin Trust ETF\">IBIT</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ARKB\" title=\"ARK 21Shares Bitcoin ETF\">ARKB</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GBTC\" title=\"Grayscale Bitcoin Trust ETF\">GBTC</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BRRR\" title=\"CoinShares Bitcoin ETF\">BRRR</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BTCO\" title=\"Invesco Galaxy Bitcoin ETF\">BTCO</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/HODL\" title=\"VanEck Bitcoin ETF\">HODL</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BTCW\" title=\"WisdomTree Bitcoin Fund ETF\">BTCW</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/FBTC\" title=\"Fidelity Wise Origin Bitcoin Fund ETF\">FBTC</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BITB\" title=\"Bitwise Bitcoin ETF\">BITB</a></span></span>), and (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EZBC\" title=\"Franklin Bitcoin ETF\">EZBC</a></span></span>).</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558794-bitcoin-vs-s-and-p-500-the-5-year-gap-that-shows-doubled-returns",
            "pub_date": "2026-02-28 00:46:08",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558784",
            "title": "Merck's Keytruda shows overall survival benefit in ovarian cancer",
            "description": "<html><body><p data-eci=\"true\">Merck (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MRK\" title=\"Merck &amp; Co., Inc.\">MRK</a></span></span>) said that an analysis of a phase 3 trial found that treatment with Keytruda (pembrolizumab) led to a <span>significant improvement in overall survival regardless of an ovarian cancer patient's PD-L1 status.</span></p>\n<p><span>The pharma also noted that the results were seen with or without Avastin (bevacizumab).</span></p>\n<p><span><span>With a median follow-up of 32.7 months. Keytruda plus paclitaxel with or without Avastin <a href=\"https://seekingalpha.com/pr/20417701-keytruda-pembrolizumab-plus-paclitaxel-with-or-without-bevacizumab-significantly-improved-key\" target=\"_self\" title=\"reduced\">reduced</a> the risk of death by 18% compared to paclitaxel with or without Avastin alone. For those on Keytruda, median OS was 17.7 months compared to 14 months for those taking the placebo regimen.</span></span></p>\n<p><span><span>Merck had previously released data showing that the Keytruda regimen met its primary endpoint, progression-free survival. Overall survival was the secondary endpoint in the KEYNOTE-B96 trial. </span></span></p>\n<p><span><span>The European Medicines Agency’s Committee for Medicinal Products also adopted a positive opinion for approving the Keytruda regimen for platinum-resistant epithelial ovarian, fallopian tube, or primary peritoneal carcinoma in adults whose tumors express PD-L1 and who have received at least one or two prior treatments.</span></span></p>\n<p><span><span>The US FDA <a href=\"https://seekingalpha.com/news/4549898-merck-keytruda-gains-additional-indications-ovarian-fallopian-tube-carcinoma\" target=\"_self\" title=\"granted\">granted</a> that indication for Keytruda earlier in February.</span></span></p>\n<p><span><span>Merck also released data on Keytruda plus Pfizer (<a href=\"https://seekingalpha.com/symbol/PFE\" title=\"Pfizer Inc.\">PFE</a>) and Astellas' (<a href=\"https://seekingalpha.com/symbol/ALPMF\" title=\"Astellas Pharma Inc.\">ALPMF</a>)(<a href=\"https://seekingalpha.com/symbol/ALPMY\" title=\"Astellas Pharma Inc.\">ALPMY</a>) antibody-drug conjugate Padcev<span> (enfortumab vedotin) for muscle-invasive bladder cancer. Results <a href=\"https://seekingalpha.com/pr/20417665-keytruda-pembrolizumab-plus-padcev-enfortumab-vedotin-ejfv-reduced-risk-of-event-free\" target=\"_self\" title=\"showed\">showed</a> the combination reduced the risk of event-free survival events by 47% and cut the risk of death by 35% when given before and after surgery versus neoadjuvant chemotherapy and surgery.</span></span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558784-merck-keytruda-shows-overall-survival-benefit-ovarian-cancer",
            "pub_date": "2026-02-28 00:40:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558796",
            "title": "Caris Life Sciences targets 23–26% revenue growth and $1B milestone in 2026 while expanding early detection investments",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Caris Life Sciences (CAI) Q4 2025  </p>\n<h3>Management View</h3>\n<ul>\n<li>Brian Brille, Executive Vice Chairman &amp; Executive VP, highlighted Caris' record-breaking quarter, with total revenues increasing 125% year-over-year to $293 million, driven by strong clinical profiling, and noted \"Molecular profiling services revenues increased to $282 million in the fourth quarter representing an increase of 199% year-over-year.\" Brille emphasized the achievement of positive GAAP net income of $82 million, adjusted EBITDA of $106 million, and free cash flow of $39.7 million, stating \"This is our third straight quarter of positive adjusted EBITDA and positive free cash flow. This strong profitability profile is unique in our industry and provides valuable strategic flexibility for ongoing investment.\"</li>\n<li>The company achieved a significant milestone with its molecular data set now exceeding 1 million profiled cases, enhancing its position as a key clinical genomic resource. Brille announced the launch plans for Caris Detect, a new cancer early detection test, in 2026: \"Caris Detect has the potential to bend the cancer mortality curve and ultimately make cancer a curable disease.\"</li>\n<li>A new Chief Commercial Officer, Bobby Hill, was appointed in the fourth quarter to drive commercial expansion and sales force growth. Hill stated, \"Our Q4 growth was 20%, which was sequential improvement from 18% in Q3 '25, with Caris Assure delivering 59% year-over-year growth in Q4 '25 and continuing to gain traction.\"</li>\n<li>President David Spetzler presented interim results for the ACHIEVE-1 study, supporting the upcoming launch of Caris Detect, reporting \"Stage I and II combined, ACHIEVE-1 reported 63.1% sensitivity… specificity in the screening population…99.1%.\"</li>\n<li>CFO Luke Power explained the strategic approach to investments: \"For the full year of 2026, we expect total revenue for existing solutions to be in the range of $1.0 billion to $1.02 billion, which represents growth of approximately 23% to 26% compared to 2025.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Caris projects 2026 total revenue in the range of $1.0 billion to $1.02 billion, anticipating molecular profiling growth of approximately 21% to 22%, and therapy selection volume growth of around 20% year-over-year.</li>\n<li>Power stated, \"Within the total revenue range, we expect molecular profiling to grow approximately 21% to 22% in 2026. But excluding prior year additional revenue from exceeding previous accruals, this implies a Molecular Profiling growth rate of approximately 26% to 28%.\"</li>\n<li>Tissue ASP is expected to reach approximately $4,000 per case in Q1 2026 and $4,200 for the full year, while blood ASP is guided to $2,400–$2,500.</li>\n<li>Pharma and research revenue is expected to be $75 million to $85 million for 2026.</li>\n<li>Operating expenses are expected between $590 million and $595 million, with CapEx rising to $60 million, primarily for early detection capacity.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Q4 2025 total revenues reached $293 million, up 125% year-over-year, with molecular profiling revenue at $282 million and pharma R&amp;D services at $10.8 million.</li>\n<li>Annual molecular profiling revenues were $766.7 million, up 120%, with clinical case volumes rising 22% to approximately 199,300 profiles and an average sales price increase of 79%.</li>\n<li>Gross margins improved to 75% in Q4 2025, up from 54% in Q4 2024, and sequentially up from 68% in Q3 2025.</li>\n<li>Caris reported positive adjusted EBITDA of $138 million and free cash flow of $67 million for the full year.</li>\n<li>Cash on hand ended above $800 million, up $43 million in Q4.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Daniel Brennan, TD Cowen, asked about volume growth breakdowns and revenue pacing. Luke Power answered, \"The 20% is broken up very similar to Q4. So lower teens for tissue and then high 50s, lower 60s for blood from a growth standpoint.\"</li>\n<li>Subhalaxmi Nambi, Guggenheim, inquired about specificity data for MCED and the pharma R&amp;D environment. David Spetzler clarified the clinical context of specificity; Power explained, \"the $75 million to $85 million, it's based on looking at what we've been able to do historically from a base run rate, knowing that we signed the additional Genentech deal.\"</li>\n<li>Michael Ryskin, BofA, questioned ASP guidance. Power responded, \"the $4,200 is kind of where I want to guide to right now. And then we'll progress throughout the year. We'll get additional contracts.\"</li>\n<li>Vijay Kumar, Evercore, probed ASP assumptions and OpEx spending rationale. Power confirmed, \"on tissue, we put out the metrics that obviously, over 75% of our tissue volume is going to be under the PLA code.\"</li>\n<li>Colleen Babington, Wolfe Research, asked about CapEx allocation. Power explained, \"One of the key items from the CapEx standpoint is, obviously, our new Assure assay is going to be switched over to the Nova X.\"</li>\n<li>Patrick Donnelly, Citi, and others focused on MCED sales force buildout and MRD product timelines, with management indicating a phased hiring approach and data-driven launch timing.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed for specificity on volume growth, ASP sustainability, and investment returns, with a neutral to slightly positive tone regarding the outlook and company strategy.</li>\n<li>Management maintained a confident, measured tone during prepared remarks, frequently referencing the company's strong financial position and strategic flexibility. During Q&amp;A, responses reflected caution and discipline, especially regarding guidance and spending, as seen in Power's statement, \"But from a guidance standpoint, like the $4,200 feels really, really good right now, and that's what I want to stick with from the guidance standpoint.\"</li>\n<li>Compared to the previous quarter, management's confidence level rose, reflecting stronger margins and financial results. Analysts maintained a similar level of cautious optimism, shifting focus slightly more toward execution of growth investments.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Revenue growth accelerated to 125% in Q4 2025 from 113% in Q3, with gross margins increasing to 75% from 68%.</li>\n<li>Management shifted guidance language from cautious to more assertive, outlining a clear path to $1 billion revenue and expanded investments in early detection and commercial infrastructure.</li>\n<li>Analysts' focus moved from platform expansion and margin sustainability to execution of commercial scale and pipeline launches.</li>\n<li>Operating expenses are planned to rise more significantly in 2026, reflecting a transition toward investment-heavy growth.</li>\n<li>The tone from management is more assertive, highlighting strategic flexibility and a readiness to invest from a position of financial strength, while analysts continue to probe for clarity on the pace and impact of these investments.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management acknowledged the need for measured investment in sales and R&amp;D, noting, \"we're taking a measured approach with our volume.\"</li>\n<li>The ramp-up in operating expenses and CapEx for early detection initiatives could pressure near-term profitability if returns on investment are delayed.</li>\n<li>Specificity and sensitivity data for Caris Detect, while promising, remain interim, with additional validation pending. Spetzler cautioned, \"These are interim results, which we are extremely excited about...that blinded validation is currently in process.\"</li>\n<li>Competitive landscape and reimbursement environment remain dynamic, requiring ongoing execution in payer contracting and commercial expansion.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Caris Life Sciences management highlighted a record-breaking fourth quarter with strong revenue growth, robust margins, and sustained profitability, positioning the company for a 23–26% revenue increase in 2026. The company is investing aggressively in its early detection platform and expanding its commercial organization, while maintaining financial discipline and a positive cash flow profile. Interim results from the Caris Detect study indicate promising clinical performance, with further validation expected. Management is confident in leveraging its strengthened balance sheet and proprietary data set to capitalize on market opportunities in precision medicine and early cancer detection throughout 2026.</p>\n<p><a href=\"https://seekingalpha.com/symbol/cai/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558796-caris-life-sciences-targets-23-26-percent-revenue-growth-and-1b-milestone-in-2026-while",
            "pub_date": "2026-02-28 00:40:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558790",
            "title": "Goldman Sachs BDC outlines 97% first lien focus and $1.2B new commitments amid AI risk mitigation",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Goldman Sachs BDC (GSBD) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Vivek Bantwal, Global Head of Financing Group, emphasized GSBD's ongoing integration into the broader direct lending platform, reporting \"the proportion of our portfolio benefiting from the 2022 reorganization has grown to 57%, while 43% still reflects deals made prior to the integration, which we call the legacy portfolio.\"</li>\n<li>Bantwal stated, \"Our exposure to first lien investments increased to 97% of the portfolio from 89% during that same period,\" highlighting the platform's preference for senior secured debt.</li>\n<li>He noted an 84% increase in median EBITDA of the portfolio since year-end 2021, reaching $71.8 million at year-end 2025, and a significant reduction in PIK as a percentage of total investment income to 9% in Q4 2025 from 15.3% in Q4 2024.</li>\n<li>Bantwal addressed software sector risks, explaining that AI's impact is \"highly company-specific and nuanced,\" and described the firm's proactive AI risk framework incorporated since early 2025.</li>\n<li>David Miller, Co-CEO, reported net investment income per share of $0.37 and net asset value per share of $12.64, with a supplemental dividend of $0.03 per share and a base dividend for Q1 2026 of $0.32 per share. He stated, \"GSBD committed approximately $1.2 billion in new commitments throughout the year in 35 new deals.\"</li>\n<li>Tucker Greene, President &amp; COO, detailed the portfolio's weighted average yield of 9.9%, net debt-to-EBITDA of 5.9x, and interest coverage of 2x, and highlighted the proactive sale of a software loan at $0.99 due to anticipated AI risk.</li>\n<li>Stanley Matuszewski, CFO, stated, \"We ended the fourth quarter of 2025 with total portfolio investments at fair value of $3.3 billion, outstanding debt of $1.9 billion and net assets of $1.4 billion.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management expects continued momentum in M&amp;A to drive credit demand, with Bantwal stating, \"A more favorable M&amp;A environment should stimulate greater demand for credit financing.\"</li>\n<li>The company anticipates spreads to \"moderately widen during the market dynamics we've seen over the past month.\"</li>\n<li>Miller expressed comfort with the current dividend level: \"We feel very comfortable with the dividend as it sits today.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Reported net investment income per share was $0.37 for Q4 2025, and net asset value per share was $12.64 at quarter end, down approximately 1% from Q3, largely due to net realized and unrealized losses.</li>\n<li>Total investment income for Q4 was $86.1 million, with GAAP and adjusted after-tax net investment income reported at $42.2 million and $41.8 million, respectively.</li>\n<li>The net debt-to-equity ratio increased to 1.27x from 1.17x in the prior quarter.</li>\n<li>Nonaccrual investments increased slightly to 2.8% and 1.9% of the portfolio at amortized cost and fair value, respectively, from 2.5% and 1.5% in Q3.</li>\n<li>Share repurchases totaled $15 million for the quarter, with $52.2 million repurchased since June 2025.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Finian O'Shea, Wells Fargo, asked about the distinct underwriting approach on the Clearwater deal. Bantwal responded that providing a \"100% solution\" for take-private transactions offers sponsors confidentiality and streamlined execution, and that in such cases, \"we get paid incremental economics for that.\"</li>\n<li>O'Shea inquired about semi-liquid structures and their risk, to which Bantwal explained, \"We don't have different standards for different vehicles or different types of investors. We have a single process that goes to a single investment committee.\"</li>\n<li>O'Shea questioned the dividend's sustainability; Miller replied, \"We feel very comfortable with the dividend as it sits today,\" noting optimism for spread widening.</li>\n<li>Heli Sheth, Raymond James, asked about spillover income strategy and deployment, with Matuszewski stating there are \"no current plans\" for a special distribution, but it remains an option.</li>\n<li>Sheth also asked about deal pipeline composition; Bantwal said, \"I wouldn't say the composition of the deal flow is changing.\"</li>\n<li>Ethan Kaye, Lucid Capital Markets, addressed AI risk framework application and legacy exposures. Miller admitted some legacy assets \"would be more point solutions,\" and noted proactive exits, stating, \"We sold it at $0.99 to other lenders that didn't have the same viewpoint.\"</li>\n<li>Kaye asked about share repurchases; Matuszewski indicated a measured approach, with $23 million of room remaining and decisions contingent on market opportunities and leverage.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts' tone was generally neutral, focused on clarity around underwriting, dividend sustainability, and risk management, with questions reflecting a search for transparency rather than skepticism.</li>\n<li>Management maintained a confident and measured tone in both prepared remarks and Q&amp;A, frequently emphasizing discipline, proactive risk management, and comfort with dividend and portfolio quality.</li>\n<li>Compared to the previous quarter, both analysts and management remained steady in sentiment, with slightly more emphasis on AI risk management and dividend sustainability this quarter.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance language shifted to emphasize AI risk and proactive portfolio management, with an increased focus on software sector diligence and legacy asset rotation.</li>\n<li>Net investment income per share decreased from $0.40 to $0.37, and net asset value per share declined from $12.75 to $12.64.</li>\n<li>The net debt-to-equity ratio rose from 1.17x to 1.27x.</li>\n<li>Share repurchases continued but at a reduced pace compared to the prior quarter.</li>\n<li>Management's confidence in underwriting and AI risk was more pronounced, while analysts continued to focus on dividend stability and risk exposures.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited the potential impact of AI on software business models as a key risk, noting continued vigilance and use of a formal AI disruption risk framework.</li>\n<li>Nonaccrual investments increased slightly, though management highlighted proactive exits and ongoing monitoring.</li>\n<li>Analysts raised concerns about dividend coverage, legacy asset risk, and the pace of originations versus repayments.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Goldman Sachs BDC management highlighted progress in portfolio rotation, a strong focus on first lien senior secured investments, and proactive risk mitigation, particularly around AI exposure in the software sector. The company reported disciplined origination, sustained share repurchases, and confidence in dividend coverage despite a modest decline in net investment income and an uptick in nonaccrual loans. Management remains focused on leveraging the Goldman Sachs platform to source quality opportunities and manage evolving market dynamics, with a clear process in place for handling legacy asset risks and AI-related disruptions.</p>\n<p><a href=\"https://seekingalpha.com/symbol/gsbd/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558790-goldman-sachs-bdc-outlines-97-percent-first-lien-focus-and-1_2b-new-commitments-amid-ai-risk",
            "pub_date": "2026-02-28 00:31:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}