{
    "data": [
        {
            "id": "4403743",
            "title": "Prudential projects 5%-8% EPS growth through 2027 with $1B share repurchase plan for 2025",
            "description": "<html><body><p>Earnings Call Insights: Prudential Financial (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/PRU\" title=\"Prudential Financial, Inc.\">PRU</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Charlie Lowrey announced significant leadership changes, including Andy Sullivan as the next CEO and Caroline Feeney taking on an expanded role overseeing Global Retirement and Insurance businesses. Jacques Chappuis will join<span class=\"paywall-full-content invisible\"> as CEO of PGIM.</span> </li> <li class=\"paywall-full-content invisible\">Lowrey highlighted strategic progress, including a 60% reduction in guaranteed universal life exposure through two reinsurance transactions and a $7 billion Japanese whole life policy reinsurance deal via Prismic.</li> <li class=\"paywall-full-content invisible\">CFO Yanela Frias emphasized the company’s robust liquidity position, with $4.6 billion in highly liquid assets, and discussed the Board's authorization for up to $1 billion in share repurchases for 2025.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management introduced financial targets through 2027, projecting annual core EPS growth of 5%-8% and an adjusted ROE of 13%-15%.</li> <li>CFO Frias shared plans for an operating expense ratio of 8.5%-10.5% for Global Retirement and Insurance businesses, expected to trend downward over the three-year period.</li> <li>Prudential expects 30%-40% of capital deployment towards organic growth, while maintaining a free cash flow ratio of approximately 65% of net income, with 35%-45% allocated to dividends.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 pre-tax adjusted operating income was $1.4 billion, translating to $2.96 per share, with full-year 2024 adjusted operating income at $5.9 billion or $12.62 per share, a 6% increase from 2023.</li> <li>PGIM reported $1.4 trillion in assets under management, supported by $8.6 billion in quarterly net flows and strong investment performance. </li> <li>Retirement Strategies achieved its highest institutional pension risk transfer sales since 2012, with $36 billion in annual sales, up 27% year-over-year. Individual Retirement sales exceeded $14 billion, marking an 84% increase.</li> <li>International businesses saw a 14% increase in Japan’s retirement and savings product sales and 12% growth in Brazil.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Suneet Kamath, Jefferies: Questioned sustainability of high annuity sales given industry trends. Head of U.S. Businesses Caroline Feeney highlighted a diversified product portfolio and strong tailwinds from aging demographics and money in motion, including $70 billion in fixed annuities maturing and $7 trillion in money market funds.</li> <li>Ryan Krueger, KBW: Asked about capital usage freed by reinsurance deals. CFO Frias reiterated disciplined capital deployment and flexibility for organic growth, dividends, and share repurchases.</li> <li>Elyse Greenspan, Wells Fargo: Clarified growth expectations for 2025 relative to the 5%-8% target. CFO Frias noted near-term headwinds but emphasized confidence in upward trajectory over the three-year period.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts appeared focused on capital deployment strategies, potential headwinds in Japan, and sustainability of high annuity sales. Their tone was neutral to slightly positive.</li> <li>Management maintained confidence during prepared remarks but adopted a more cautious tone in addressing headwinds, particularly in Japan’s surrender activity and near-term growth moderation.</li> <li>Compared to the previous quarter, management’s sentiment was slightly more defensive, especially when discussing new regulatory impacts in Japan.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 operating income of $1.4 billion declined from Q3’s $1.6 billion due to adverse underwriting results and elevated large individual life claims.</li> <li>Q4 International business sales grew 6% year-over-year, compared to a 25% growth rate in Q3. Japan’s surrender activity continued to weigh on earnings, though Q4 saw the lowest surrender levels of 2024.</li> <li>Management tone was slightly more cautious this quarter, reflecting headwinds in Japan and regulatory uncertainties.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Elevated surrender rates in Japan driven by yen weakness impacted earnings. Management is addressing this through product diversification and reinsurance transactions.</li> <li>Regulatory changes in Japan’s ESR regime are expected to introduce challenges for long-duration and foreign-currency-denominated products, prompting proactive reinsurance solutions.</li> <li>Analysts raised concerns about sustaining high annuity sales amid potential industry-wide slowdowns and the impact of excess mortality.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Prudential Financial highlighted significant leadership transitions and strategic initiatives to drive growth, including the introduction of new financial targets through 2027 and a $1 billion share repurchase plan for 2025. While headwinds such as elevated Japan surrenders and regulatory changes remain, the company is leveraging product diversification, disciplined capital deployment, and robust liquidity to position itself for long-term growth.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/PRU/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403743-prudential-projects-5-percentminus-8-percent-eps-growth-through-2027-with-1b-share-repurchase",
            "pub_date": "2025-02-05 20:17:45",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403671",
            "title": "BlackRock said to launch bitcoin ETP in Europe after IBIT success",
            "description": "<html><body><p>Building on the success of its U.S.-listed iShares Bitcoin Trust (<a href=\"https://seekingalpha.com/symbol/IBIT\" title=\"iShares Bitcoin Trust ETF\">IBIT</a>), BlackRock (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BLK\" title=\"BlackRock, Inc.\">BLK</a></span>) is gearing up to list a bitcoin (<a href=\"https://seekingalpha.com/symbol/BTC-USD\" title=\"Bitcoin USD\">BTC-USD</a>) exchange-traded product in Europe, according to a media report dated Wednesday.</p> <p>That would be the asset manager's first crypto-tied<span class=\"paywall-full-content invisible\"> ETP not traded on U.S. exchanges.</span></p> <p class=\"paywall-full-content invisible\">The new fund tied directly to bitcoin (<a href=\"https://seekingalpha.com/symbol/BTC-USD\" title=\"Bitcoin USD\">BTC-USD</a>) is expected to be domiciled in Switzerland, <a href=\"https://www.bloomberg.com/news/articles/2025-02-05/blackrock-said-to-list-bitcoin-exchange-traded-product-in-europe\" rel=\"noopener\" target=\"_blank\" title=\"Bloomberg\">Bloomberg</a> reported, citing people familiar with the plans. Marketing for the fund could start as soon as this month, one person noted.</p> <p class=\"paywall-full-content invisible\">The move comes a year after the debut of BlackRock's (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BLK\" title=\"BlackRock, Inc.\">BLK</a></span>) iShares Bitcoin Trust (<a href=\"https://seekingalpha.com/symbol/IBIT\" title=\"iShares Bitcoin Trust ETF\">IBIT</a>), along with several other spot bitcoin ETFs. Demand for the products surged in the wake of a crypto-market bull run, with $58B IBIT leading the group in assets under management.</p> <p class=\"paywall-full-content invisible\">Last month, BlackRock's (<a href=\"https://seekingalpha.com/symbol/BLK\" title=\"BlackRock, Inc.\">BLK</a>) ETF chief, Samara Cohen, told CNBC in an interview that there will \"absolutely\" be <a href=\"https://seekingalpha.com/news/4396002-blackrock-etf-chief-bitcoin-crypto-regulation-outlook\" rel=\"noopener\" target=\"_blank\" title=\"better clarity\">better clarity</a> on crypto regulation this year.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2165923389/image_2165923389.jpg",
            "link": "https://seekingalpha.com/news/4403671-blackrock-said-to-launch-bitcoin-etp-in-europe-after-ibit-success",
            "pub_date": "2025-02-05 20:19:10",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403723",
            "title": "Commencement Bancorp announces share buyback",
            "description": "<html><body><ul>\n<li>Commencement Bancorp (<a href=\"https://seekingalpha.com/symbol/CBWA\" title=\"Commencement Bancorp Inc.\">OTCQX:CBWA</a>) has announced share repurchase program commencing from February 5, 2025, and expiring February 4, 2026. </li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/19992944-commencement-bancorp-inc-cbwa-announces-stock-repurchase-plan\">Press Release</a>\n</li>\n</ul>\n</body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403723-commencement-bancorp-announces-share-buyback",
            "pub_date": "2025-02-05 20:13:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403686",
            "title": "UnitedHealth contacts SEC after Bill Ackman since-deleted post - report",
            "description": "<html><body><p>UnitedHealth (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/UNH\" title=\"UnitedHealth Group Incorporated\">UNH</a></span>) has contacted the US Securities and Exchange Commission about its issues with hedge fund investor Bill Ackman's since-deleted post on X. Shares of UnitedHealth <span style=\"color: #ff0000;\">fell 2.3%</span> in the wake of the Ackman posting. </p> <p>“Health insurance has long been<span class=\"paywall-full-content invisible\"> subject to significant regulatory oversight and earnings caps,” UnitedHealth said in a statement to Bloomberg. The company added that claims that insurers “can somehow over-earn are grossly uninformed.”</span></p> <p class=\"paywall-full-content invisible\">A representative for Ackman had no immediate comment for Bloomberg. </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2159946636/image_2159946636.jpg",
            "link": "https://seekingalpha.com/news/4403686-unitedhealth-contacts-sec-after-bill-ackman-since-deleted-post-report",
            "pub_date": "2025-02-05 20:06:18",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403724",
            "title": "Nuvectis Pharma announces pricing of $13.5M public offering",
            "description": "<html><body><ul> <li>Nuvectis Pharma (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/NVCT\" title=\"Nuvectis Pharma, Inc.\">NVCT</a></span>) on Wednesday announced the pricing of its underwritten public offering of 2.7 million shares of its common stock at a price of $5.00 per share, with expected gross proceeds to Nuvectis of $13.5 million.</li> <li>Nuvectis has also<span class=\"paywall-full-content invisible\"> granted the underwriter a 30-day option to purchase up to 405,000 additional shares of its common stock at the public offering price.</span> </li> <li class=\"paywall-full-content invisible\">The offering is expected to close on February 6, 2025.</li> <li class=\"paywall-full-content invisible\">Nuvectis intends to use the net proceeds from the offering to continue to advance the development programs of NXP800 and NXP900 or any future product candidate, hiring of additional personnel, capital expenditures, costs of operating as a public company and other general corporate purposes.</li> <li class=\"paywall-full-content invisible\">NVCT is <span class=\"green\">+6.14%</span> to $7.43.</li> <li class=\"paywall-full-content invisible\">Source: <a href=\"https://seekingalpha.com/pr/19992596-nuvectis-pharma-announces-pricing-of-13_5-million-public-offering-of-common-stock\">Press Release</a> </li> </ul> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403724-nuvectis-pharma-announces-pricing-of-135m-public-offering",
            "pub_date": "2025-02-05 20:09:18",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403705",
            "title": "Datasea sees Q2 revenue rising 81% to $20.5 million",
            "description": "<html><body><ul>\n<li>Datasea (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/DTSS\" title=\"Datasea Inc.\">DTSS</a></span>) said on Wednesday that its revenue for Q2 FY25 is expected to be about $20.5 million, representing an 81% increase compared to $11.3 million for the year-ago period.</li>\n<li>Gross profit for the second quarter is estimated to be $0.41 million, a 310% increase from $0.1 million for the year-ago period.</li>\n<li>The expected rise in metrics was driven by the continued high growth of the company's 5G AI multimodal digital business and its increased market penetration across China, the company said.</li> <li>DTSS is <font color=\"red\">-2.81%</font>  to $2.0701</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/19992663-datasea-pre-announces-second-quarter-revenue-of-20_5-million-up-81-percent-year-over-year\">Press Release</a>\n</li>\n</ul>\n</body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403705-datasea-sees-q2-revenue-rising-81-to-205-million",
            "pub_date": "2025-02-05 20:02:33",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403711",
            "title": "Fiserv targets 10%-12% organic revenue growth in 2025 with $5.5B free cash flow projection",
            "description": "<html><body><p>Earnings Call Insights: Fiserv (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/FI\" title=\"Fiserv, Inc.\">FI</a></span>) Q4 2024 </p> <h3>Management View</h3> <ul> <li>Fiserv reported adjusted EPS of $2.51 for Q4 2024, a 15% increase, with adjusted operating margins reaching 42.9%. Organic revenue growth was 13%, driven by double-digit growth in the Merchant segment.</li> <li class=\"paywall-full-content invisible\">CEO Frank Bisignano highlighted the company’s achievements in exceeding commitments set during the 2023 Investor Conference. Free cash flow for the year was $5.2 billion, with $5.5 billion returned to shareholders through share repurchases.</li> <li class=\"paywall-full-content invisible\">The company launched CashFlow Central, which aims to address challenges in SMB cash flow management. Demand from financial institutions remains high, and the product is set to integrate with the broader SMB suite later this year.</li> <li class=\"paywall-full-content invisible\">Fiserv expanded its global reach with launches in three new countries for Clover: Brazil, Mexico, and Australia. The company also signed a strategic partnership with ADP to integrate payroll and business management solutions into Clover.</li> <li class=\"paywall-full-content invisible\">Mike Lyons, the newly appointed President and next CEO, emphasized his excitement for Fiserv’s growth opportunities and reaffirmed the company’s focus on executing its strategic plan.</li> <li class=\"paywall-full-content invisible\">CFO Bob Hau reported, \"Total company adjusted revenue grew 7% for the quarter, with adjusted operating income growth of 11%.\"</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Fiserv provided 2025 guidance of 10%-12% organic revenue growth, over 125 basis points of adjusted operating margin expansion, and 15%-17% adjusted EPS growth. Free cash flow is projected at approximately $5.5 billion.</li> <li>Merchant Solutions is expected to grow organically by 12%-15%, supported by Clover’s $3.5 billion revenue target for 2025 and further VAS penetration.</li> <li>Financial Solutions is forecasted to grow organically by 6%-8%, driven by new product rollouts, including CashFlow Central, and key client wins such as Target and Verizon.</li> <li>Management noted that growth in 2025 would be weighted towards the second half due to product rollouts and new client implementations.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Adjusted EPS of $2.51 for Q4 2024 exceeded the analysts' estimate of $2.48. Adjusted revenue of $4.96 billion slightly surpassed the $4.95 billion estimate.</li> <li>Full-year adjusted EPS reached $8.80, up 17%, and total company organic revenue growth was 16%.</li> <li>Merchant Solutions saw 23% organic revenue growth in Q4, with Clover revenue growing 29% to $2.7 billion for the year. The segment's adjusted operating margin expanded 290 basis points to 37% in 2024.</li> <li>Financial Solutions grew organically by 4% in Q4 and 6% for the year, with strong contributions from digital payments products and issuing.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Tien-Tsin Huang, JPMorgan: Asked about surprises for Mike Lyons upon joining Fiserv. Mike Lyons noted the vast potential in cross-selling opportunities, international expansion, and the innovation-driven team.</li> <li>Darrin Peller, Wolfe Research: Inquired about sustaining Clover’s growth. CEO Bisignano highlighted international expansion, new hardware launches, and deep integration with partners like ADP as key drivers.</li> <li>Timothy Chiodo, UBS: Asked about the Payfare acquisition and its role in embedded finance. CFO Hau stated that Payfare enhances program management capabilities and supports Fiserv’s embedded finance pipeline.</li> <li>Ramsey El-Assal, Barclays: Questioned the timeline for CashFlow Central's material impact. CEO Bisignano indicated revenue contributions would begin in late 2025, with significant growth expected in 2026.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed optimism regarding Clover's growth potential and the company’s ability to execute on its strategic priorities. Questions focused on sustaining momentum and leveraging new opportunities.</li> <li>Management maintained a confident tone, particularly around 2025 guidance and the SMB suite. CEO Bisignano emphasized the durability of Fiserv’s growth drivers with statements like \"all gas and no break.\"</li> <li>Compared to the previous quarter, there was a stronger focus from analysts on the sustainability of margins and revenue growth in challenging markets.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Q4 organic revenue growth of 13% slightly decelerated from 15% in Q3 due to easing Argentina-related tailwinds. Adjusted EPS growth remained consistent at 15%.</li> <li>Merchant Solutions growth slowed marginally from 24% in Q3 to 23% in Q4, though Clover’s revenue growth held steady at 29%.</li> <li>Financial Solutions showed stable organic growth of 4% in Q4, in line with Q3 performance.</li> <li>Management’s tone during prepared remarks remained consistent, with confidence in product rollouts and partnerships. Analysts continued to press for details on margin sustainability and growth pacing into 2025.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management highlighted the ongoing stabilization of Argentina’s economy, which could diminish transitory benefits in 2025.</li> <li>Analysts raised concerns about consumer spending trends impacting volume growth in Clover and enterprise segments.</li> <li>Competition in embedded finance and international markets could pressure growth targets. Management is mitigating risks with new partnerships and product differentiation.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Fiserv showcased strong financial performance in Q4 2024, demonstrating growth in its Merchant and Financial Solutions segments. The company is focused on executing its strategic priorities, including international expansion and the rollout of CashFlow Central, with 2025 guidance signaling confidence in sustained growth. The leadership transition to Mike Lyons appears seamless, with management emphasizing innovation and operational excellence to drive shareholder value.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/FI/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403711-fiserv-targets-10-percentminus-12-percent-organic-revenue-growth-in-2025-with-5_5b-free-cash",
            "pub_date": "2025-02-05 20:04:11",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403652",
            "title": "Philip Morris’ smoke-free products in focus during Q4 earnings",
            "description": "<html><body><p class=\"MsoNormal\">Philip Morris (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/PM\" title=\"Philip Morris International Inc.\">PM</a></span>) is set to report fourth quarter earnings on Thursday, and investors’ focus will be on the global tobacco giant’s smoke-free products (SFPs) business as health-conscious consumers switch to alternatives.</p> <p class=\"MsoNormal\">Wall Street <a href=\"https://seekingalpha.com/symbol/PM/earnings/estimates?period=quarterly\" rel=\"noopener\" target=\"_blank\" title=\"expect\">expects</a> the company to report EPS<span class=\"paywall-full-content invisible\"> of $1.50, implying an increase of 10.3%, while revenue is expected to rise 4.3% to $9.44 billion during the quarter.</span></p> <p class=\"MsoNormal paywall-full-content invisible\">Philip Morris has witnessed high growth for its SFPs as Zyn nicotine pouch accounts for 72% share of oral or nicotine pouch category in the U.S. The Food and Drug Administration (FDA), in January, also <a href=\"https://seekingalpha.com/news/4395818-philip-morris-zyn-nicotine-pouches-land-fda-marketing-approval\">authorized</a> the marketing of 20 Zyn products through the premarket tobacco product application pathway.</p> <p class=\"MsoNormal paywall-full-content invisible\">Morgan Stanley analyst Eric Serotta said SFPs accounted for about 38% of PMI's net revenue in 2024e, and forecast SFPs to reach 55-65% by 2030e.</p> <p class=\"MsoNormal paywall-full-content invisible\">Serotta added we estimate that Zyn revenues in the U.S. could increase two-three times by 2030 driven by robust growth for the modern oral category and increased capacity following this year's supply constraints.</p> <p class=\"MsoNormal paywall-full-content invisible\">However, the company could face some foreign exchange (FX) headwinds due to the recent strengthening of the U.S. dollar, said analysts.</p> <p class=\"MsoNormal paywall-full-content invisible\">Meanwhile, overall combustible volumes have been essentially flat in 2024 following a 1.2% decline in 2023.</p> <p class=\"MsoNormal paywall-full-content invisible\">Analysts estimate a more normal rate of combustible decline in 2025, down over 1.5%. However, Philip Morris’ strong pricing of cigarettes could <a href=\"https://seekingalpha.com/article/4728357-philip-morris-international-inc-pm-q3-2024-earnings-call-transcript\">offset</a> the impact of volume decline.</p> <p class=\"MsoNormal paywall-full-content invisible\">The tobacco company also plans to continue to roll out several new IQOS, a line of heated tobacco and electronic cigarette products.</p> <p class=\"MsoNormal paywall-full-content invisible\">Seeking Alpha analyst Skeptical12 <a href=\"https://seekingalpha.com/article/4754572-philip-morris-international-market-is-underestimating-the-companys-true-growth-prospects\">said</a> the company is also planning to be able to sell IQOS ILUMA in the US in the back half of this year as well, after recently introducing IQOS technology on a limited basis in the US in 2024, with an aim to capture 10% market share of the US tobacco and reduced risk market by 2030.</p> <p class=\"MsoNormal paywall-full-content invisible\">Wall Street, Seeking Alpha analysts and Seeking Alpha's Quant Ratings are bullish and rated the stock a <a href=\"https://seekingalpha.com/symbol/PM/ratings/quant-ratings\">Buy</a>.</p> <p class=\"MsoNormal paywall-full-content invisible\">Over the last two years, PM <a href=\"https://seekingalpha.com/symbol/PM/earnings/eps-surprise-summary\" rel=\"noopener\" target=\"_blank\">has beaten EPS estimates</a> 88% of the time and has beaten revenue estimates 75% of the time.</p> <p class=\"MsoNormal paywall-full-content invisible\">Over the last three months, EPS estimates have seen one <a href=\"https://seekingalpha.com/symbol/PM/earnings/revisions\" rel=\"noopener\" target=\"_blank\">upward revision</a> versus six downward moves, while revenue estimates have seen no upward revisions compared to five downward moves.</p> <p class=\"MsoNormal paywall-full-content invisible\">Philip Morris’ shares <a href=\"https://seekingalpha.com/symbol/PM/charting\" rel=\"noopener\" target=\"_blank\" title=\"jumped\">jumped</a> over 43% in the last one year, outperforming the broader S&amp;P market, which gained nearly 22%.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1604374/image_1604374.jpg",
            "link": "https://seekingalpha.com/news/4403652-philip-morris-smoke-free-products-in-focus-during-q4-earnings",
            "pub_date": "2025-02-05 19:59:07",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403658",
            "title": "Mali mining law needs loosening to win back investors, gold mine CEOs say",
            "description": "<html><body><p>Mali's new new mining law that raises taxes and seeks to hand over large stakes in assets to the state <a href=\"https://www.reuters.com/markets/commodities/malis-new-mines-law-needs-review-win-back-investors-gold-mine-ceos-say-2025-02-05/\" rel=\"nofollow\" target=\"_self\" title=\"must be reviewed\">must be reviewed</a> before gold companies would invest in new projects there, company CEOs told Reuters on Wednesday.</p> <p>The new<span class=\"paywall-full-content invisible\"> rules require companies operating in Mali to divest a 35% share of new projects to local investors, up from 20% previously, and raise royalty taxes to 10.5% from ~6% - rules that the CEOs with operations in West Africa said make it uneconomic to spend on new mines or buy operations in the country.</span></p> <p class=\"paywall-full-content invisible\">Mali’s government has proved aggressive in implementing the new rules, souring relations with top investors including Barrick Gold (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/GOLD\" title=\"Barrick Gold Corporation\">GOLD</a></span>), which shuttered its Loulo-Gounkoto operation <a href=\"https://seekingalpha.com/news/4394750-barrick-to-suspend-mali-operations-after-245m-in-gold-seized-reuters\" target=\"_self\" title=\"last month\">last month</a> after authorities seized its gold reserves and arrested several employees in a dispute related to the new mining law.</p> <p class=\"paywall-full-content invisible\">Fortuna Mining (<a href=\"https://seekingalpha.com/symbol/FSM\" title=\"Fortuna Mining Corp.\">FSM</a>) CEO Jorge Ganoza said he would not consider Mali as a potential destination for investment, believing producers' focus to shift to rich deposits in Guinea, Ivory Coast, Senegal and Burkina Faso.</p> <p class=\"paywall-full-content invisible\">The lack of investment in new mines and exploration activities could shorten the lifespan of existing mines in Mali, Ganoza said. “Do you think Resolute or Barrick today is looking to expand investments in the country? No,\" the CEO said, referring to Resolute Mining (<a href=\"https://seekingalpha.com/symbol/RMGGF\" title=\"Resolute Mining Limited\">OTCPK:RMGGF</a>), whose CEO was <a href=\"https://seekingalpha.com/news/4300305-resolute-mining-will-pay-160m-to-mali-over-tax-dispute\" target=\"_self\" title=\"arrested\">arrested</a> by Mali authorities last year due to disagreements over the mining rules.</p> <p class=\"paywall-full-content invisible\">The CEOs who spoke to Reuters als cited another Canadian miner, Robex (<a href=\"https://seekingalpha.com/symbol/RSRBF\" title=\"Robex Resources Inc.\">OTCPK:RSRBF</a>), as an example of a company looking to pull out of Mali.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/813603996/image_813603996.jpg",
            "link": "https://seekingalpha.com/news/4403658-mali-mining-law-needs-loosening-to-win-back-investors-gold-mine-ceos-say",
            "pub_date": "2025-02-05 19:59:34",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403674",
            "title": "GSK outlines 2025 growth driven by specialty medicines and new product launches",
            "description": "<html><body><p>Earnings Call Insights: GSK (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/GSK\" title=\"GSK plc\">GSK</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Dame Emma Walmsley highlighted that GSK achieved 8% sales growth in 2024, reaching over £31 billion, with specialty medicines driving performance. Core operating profit grew 13%, supporting a 61p dividend per share, with a 64p dividend expected<span class=\"paywall-full-content invisible\"> in 2025. The company also announced a £2 billion share buyback program over 18 months.</span> </li> <li class=\"paywall-full-content invisible\">Specialty medicines, which grew 19% in 2024, remain a key focus, with oncology sales nearly doubling to over £1.4 billion. Blenrep and depemokimab are expected to launch in 2025, with Blenrep's FDA PDUFA date set for July.</li> <li class=\"paywall-full-content invisible\">Chief Financial Officer Julie Brown noted, \"Core operating margin improved to 29.2%, up 130 basis points year-on-year,\" driven by specialty medicines and supply chain efficiencies.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>GSK expects 2025 sales growth between 3% and 5%, with core operating profit and EPS growth projected at 6% to 8%. Specialty medicines are anticipated to lead growth, with low double-digit percentage increases.</li> <li>Management maintained its 2031 outlook of over £40 billion in sales, supported by specialty medicines contributing over 50% of revenue by then. Vaccines are expected to remain a significant growth area despite near-term challenges.</li> <li>The company plans five new product approvals in 2025, including Blenrep for multiple myeloma and depemokimab for severe asthma.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Specialty medicines accounted for more than 80% of GSK's growth in 2024, led by oncology and respiratory immunology. Benlysta grew 14%, while Jemperli sales tripled, benefiting from expanded FDA approvals.</li> <li>HIV sales increased 13%, driven by strong demand for Cabenuva and Apretude, which reached £1.3 billion in 2024. Management flagged a £150 million to £200 million impact from the Inflation Reduction Act in 2025.</li> <li>Vaccines sales declined 3% in 2024, reflecting pressures on Arexvy and Shingrix in the U.S. However, Arexvy remains the market leader, and international uptake is gaining momentum.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Emily Field, Barclays: Asked about Shingrix's performance in China and the impact of macroeconomic challenges. Chief Commercial Officer Luke Miels explained that while near-term challenges persist, the partnership with Zhifei positions GSK for long-term success.</li> <li>Richard Parkes, BNPP Exane: Inquired about peak sales potential for Arexvy and Shingrix. Dame Emma Walmsley emphasized confidence in medium- to long-term growth, driven by international expansion and revaccination opportunities.</li> <li>Peter Welford, Jefferies: Questioned Blenrep's relaunch strategy. Luke Miels highlighted that improved understanding of dosing and managing side effects positions Blenrep for a successful relaunch, with significant opportunities in second-line treatment.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed concern over vaccine challenges, particularly Arexvy's short-term trajectory, but acknowledged management's confidence in long-term growth potential.</li> <li>Management maintained an optimistic tone, emphasizing specialty medicines and pipeline progress. Phrases like \"we are confident\" and \"we expect profitable growth\" underscored their commitment to delivering on guidance.</li> <li>Compared to the previous quarter, management's confidence has strengthened, supported by pipeline advancements and strong specialty medicines performance.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance for 2025 is more detailed, with specific growth ranges provided for sales, EPS, and operating profit. Specialty medicines continue to dominate growth, while vaccines face near-term headwinds.</li> <li>The tone of management remains positive, with a stronger focus on pipeline milestones, including the anticipated launches of Blenrep and depemokimab.</li> <li>Analysts maintained a cautious stance on vaccines, similar to previous quarters, while showing more interest in specialty medicines and HIV pipeline updates.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management acknowledged short-term pressures on vaccines, particularly in the U.S. and China, due to guideline changes and macroeconomic challenges.</li> <li>The impact of the Inflation Reduction Act on pricing and revenue remains a concern, with a potential £400 million to £500 million headwind in 2025.</li> <li>Analysts raised questions about Arexvy's revaccination potential and the timeline for broader adoption.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">GSK's Q4 2024 earnings call highlighted strong performance in specialty medicines, with oncology and respiratory immunology driving growth. The company is optimistic about 2025, projecting profitable growth led by specialty medicines and supported by five new product launches. Despite near-term challenges in vaccines, management reaffirmed its confidence in medium- to long-term growth, backed by pipeline advancements and strategic investments. The £2 billion share buyback program further underscores GSK's focus on shareholder returns.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/GSK/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403674-gsk-outlines-2025-growth-driven-by-specialty-medicines-and-new-product-launches",
            "pub_date": "2025-02-05 19:52:35",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}