{
    "data": [
        {
            "id": "4558006",
            "title": "Victory Capital offer sparks competition for Janus Henderson",
            "description": "<html><body><p data-eci=\"true\">Janus Henderson Group (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/JHG\" title=\"Janus Henderson Group plc\">JHG</a></span>) stock climbed 5.7% to $53.02 in Thursday afternoon trading after Victory Capital Holdings (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/VCTR\" title=\"Victory Capital Holdings, Inc.\">VCTR</a></span>) submitted a proposal to buy Janus Henderson Group (<a href=\"https://seekingalpha.com/symbol/JHG\" title=\"Janus Henderson Group plc\">JHG</a>) for $57.04 per share in stock and cash.</p>\n<p>Janus Henderson (<a href=\"https://seekingalpha.com/symbol/JHG\" title=\"Janus Henderson Group plc\">JHG</a>), though, had already <a href=\"https://seekingalpha.com/news/4534060-janus-henderson-agrees-to-be-taken-private-for-74b\" target=\"_blank\" title=\"agreed to sell itself\">agreed to sell itself</a> to Nelson Peltz's Trian Fund Management and General Catalyst Group for $49 per share in cash.</p>\n<p>The Victory (<a href=\"https://seekingalpha.com/symbol/VCTR\" title=\"Victory Capital Holdings, Inc.\">VCTR</a>) offer consists of $30 in cash and 0.350 share of VCTR for each share of JHG.  Victory describes its offer as \"clearly superior,\" but it will be up to the Janus Henderson board to determine that.</p>\n<p>The Trian/General Catalyst deal requires that two-thirds of shares be voted in favor of the deal, a threshold that will be difficult to reach, CNBC's David Faber said. Note that Trian owns 20.6% of Janus Henderson's (<a href=\"https://seekingalpha.com/symbol/JHG\" title=\"Janus Henderson Group plc\">JHG</a>) shares.</p>\n<p>\"You've got a lot of risk arbs (risk arbitrageurs). They've read the proxy, and they're like… \"Hmm, I wonder if someone else may come,'\" Faber said. \"And there was some encouragement for Victory to potentially show up. And they have.\"</p>\n<p>Faber added that he wasn't able to find out how Trian and General Catalyst will respond to the offer. \"But they clearly know they're probably going to have to do something if they want to own the company,\" the CNBC anchor <a href=\"https://www.cnbc.com/video/2026/02/26/faber-report-victory-capital-launches-counterbid-for-janus-henderson-taking-on-trian-deal.html?&amp;qsearchterm=janus%20henderson\" rel=\"nofollow\" target=\"_blank\" title=\"said.\">said.</a> \"Or potentially sell to this higher bid.\"</p>\n<p>Victory Capital (<a href=\"https://seekingalpha.com/symbol/VCTR\" title=\"Victory Capital Holdings, Inc.\">VCTR</a>) estimates the deal would produce cost synergies of ~$500M. The potential acquirer said its gross leverage will be 3.5x 2025 EBITDA, excluding synergies, and 2.6x 2025 EBITDA, including the synergies.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558006-victory-capital-offer-sparks-competition-for-janus-henderson",
            "pub_date": "2026-02-27 02:10:46",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558025",
            "title": "Bentley Systems targets 11%–13% revenue growth in 2026 while expanding AI monetization",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Bentley Systems (BSY) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Gregory Bentley, President &amp; Executive Chairman of the Board, emphasized the durability and visibility of Bentley’s business model, noting, “Our key metric, annual constant currency ARR growth has been reliably sustained in the low-double digits since 2022.” He highlighted that free cash flow margin reached 35% in 2025 and truly free cash flow margin, less stock-based compensation, reached 30%. Bentley reported retiring the maturing 2026 convertible debt, reducing the fully diluted share count by about 3%. He stated, “Having reached a satisfactory target range of about 2x, we have completed delevering since the platform acquisitions and can now allocate more of our cash flow generation towards scaled up programmatic acquisitions.” On AI, Bentley said, “AI is not a risk to be countered but an unprecedented opportunity,” underscoring the company’s positioning as a digital quarterback for infrastructure engineering.</li>\n<li>CEO Nicholas Cumins outlined the company’s twofold AI strategy: embedding AI into products and instrumenting platforms for user- and partner-built AI workflows. He noted, “Q4 ARR increased 11.5% year-over-year… Net revenue retention was stable at 109%.” Cumins also highlighted the resilience of the Seequent business and continued strong growth in Public Works Utilities, driven by “sustained global infrastructure investment and the standout performance of Bentley Asset Analytics.”</li>\n<li>CFO Werner Andre reported, “For the full year 2025, total revenues were $1.502 billion, growing 11% on a reported basis and 10% in constant currency… For the fourth quarter, total revenues were $392 million, an increase of 12% reported and 10% in constant currency.” He added, “Our free cash flow generation for the year was very strong, totaling $520 million, up 24% year-over-year.”</li>\n</ul>\n<h3>Outlook</h3>\n<ul><li>Bentley Systems projects total revenues constant currency growth in the range of 11% to 13% for 2026, translating to $1.685 billion to $1.750 billion at current exchange rates. Subscription revenues, which comprise 92% of the business, are expected to grow 11% to 13% in constant currency. The company expects constant currency ARR growth between 10.5% and 12.5%. Adjusted operating income less operating stock-based compensation is forecast to be between $495 million and $510 million. Free cash flow for 2026 is projected in the range of $500 million to $570 million. Management stated that “our mainstay subscription revenues… are expected to grow between 11% and 13% in constant currency.”</li></ul>\n<h3>Financial Results</h3>\n<ul><li>For the full year 2025, total revenues reached $1.502 billion, with subscription revenues representing 92% of total revenues. E365 now comprises 45% of subscription revenues. Adjusted operating income less stock-based compensation for the year was $430 million, with a margin of 28.6%. Free cash flow totaled $520 million for the year. The company reported ending Q4 with ARR of $1.462 billion at quarter-end spot rates, and ARR growth rate was 11.5% year-over-year on a constant currency basis.</li></ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Matthew Hedberg, RBC Capital Markets: Asked about elements that could push ARR growth to the higher end of the range and whether AI is a driver. Gregory Bentley responded that “AI is contributing now in the form of asset analytics and faster growth in asset analytics than elsewhere,” but noted the revenue is not yet fully annual recurring due to inspection cycles.</li>\n<li>Jason Celino, KeyBanc Capital Markets: Asked about leverage and M&amp;A. Gregory Bentley explained, “Now with leverage down… we are expanding our -- where we're open in M&amp;A to beyond asset analytics potentially.”</li>\n<li>Joseph Vruwink, Robert W. Baird: Asked if growing attention to digital twins is opening the pipeline. Nicholas Cumins stated, “Our products themselves are leveraging the digital twin technology… it's basically happening without the accounts necessarily being aware of it.”</li>\n<li>Sitikantha Panigrahi, Mizuho: Inquired about macro assumptions. Nicholas Cumins said, “We are assuming for 2026 is remarkably consistent with what we've seen in 2025… the only area where we've seen a slowdown… was really the sector of facilities and commercial facilities.”</li>\n<li>Kristen Owen, Oppenheimer: Asked about drivers of services revenue recovery. Nicholas Cumins highlighted improvement in IBM Maximo-related services, while Gregory Bentley noted minimal contribution from Asset Analytics acquisitions in services revenue.</li>\n<li>Jay Vleeschhouwer, Griffin Securities: Inquired about product packaging changes. Nicholas Cumins said, “The new packaging was actually released in Q4… Connect itself is getting very quickly adopted.”</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts expressed optimism about AI and growth outlook but pressed for clarity on ARR growth drivers and the pace of AI monetization. The tone was generally positive, with some probing on adoption timelines and M&amp;A strategy.</li>\n<li>Management maintained a confident tone, particularly in discussing AI opportunities and financial robustness. Phrases such as “we are well positioned with a great foundation and strategy” and “we are expanding our -- where we're open in M&amp;A” indicated confidence. During Q&amp;A, responses showed a mix of confidence and careful qualification regarding the pace of AI revenue impact.</li>\n<li>Compared to the previous quarter, both management and analysts’ tones remained positive, with an increased focus on AI execution and near-term monetization.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul><li>ARR growth strengthened to 11.5% year-over-year in Q4 from 10.5% in Q3. Guidance for 2026 remains consistent with prior outlooks, targeting low-double-digit revenue and ARR growth. Management’s tone on AI shifted from conceptual discussion in Q3 to highlighting tangible asset analytics contributions and monetization strategies in Q4. Analysts maintained a focus on recurring revenue, AI monetization, and M&amp;A capacity. Service revenues are now expected to reaccelerate, driven by Maximo and Asset Analytics, versus flat expectations in Q3.</li></ul>\n<h3>Risks and Concerns</h3>\n<ul><li>Management acknowledged that asset analytics revenue is not fully annual recurring yet, introducing some variability. Macro risks persist in China and commercial facilities. There is also a deliberate focus on prudent adoption and monetization of AI, reflecting the sector’s regulatory and operational caution. Analysts raised questions about the pace of AI-driven revenue and the impact of macro factors on budgets and sales cycles.</li></ul>\n<h3>Final Takeaway</h3>\n<p>Bentley Systems enters 2026 with robust financial fundamentals, consistent revenue growth, and a disciplined approach to expanding both its core subscription business and AI-enabled initiatives. Management projects low-double-digit growth across key metrics and is broadening M&amp;A focus as leverage declines. The company is prioritizing AI integration and asset analytics monetization, with immediate opportunities in operational use cases and longer-term prospects in design optimization. While asset analytics revenue is not yet fully recurring, the company is confident in its strategy to drive durable growth as AI adoption matures.</p>\n<p><a href=\"https://seekingalpha.com/symbol/bsy/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558025-bentley-systems-targets-11-percent-13-percent-revenue-growth-in-2026-while-expanding-ai",
            "pub_date": "2026-02-27 02:10:46",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558023",
            "title": "Perrigo outlines 2026 CORE EPS range of $2.25 to $2.55 as company navigates soft OTC market",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Perrigo Company plc (PRGO) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Patrick Lockwood-Taylor, President, CEO &amp; Director, began by emphasizing Perrigo's \"meaningful progress\" in 2025, stating, \"We are winning with consumers and customers, and that momentum is reflected in the strong market share gains and incremental business we secured with key retailers.\" He highlighted that the company delivered EPS in line with revised guidance, improved operating income and EPS year-over-year, and made strong progress on the Three-S Plan to simplify, streamline, and strengthen the business.</li>\n<li>Lockwood-Taylor noted, \"Our share gains accelerated throughout the year, reversing years of decline,\" and pointed out over $100 million in new distribution and competitive takeaways. He reported stabilization in the store brand business and supply in infant formula, and referenced the announced sale of the Dermacosmetics business, expected to close in the second quarter of 2026.</li>\n<li>The CEO announced the introduction of new reporting segments—Self-care, Specialty Care, and Infant Formula—beginning Q1 2026 to provide \"greater clarity into underlying performance.\"</li>\n<li>Eduardo Bezerra, Executive VP &amp; CFO, disclosed, \"Our 2025 GAAP results include noncash accounting impacts, including a goodwill impairment charge of $1.3 billion,\" adding that this impairment \"does not impact our strategy, cash flows or ability to execute.\"</li>\n<li>Bezerra also stated, \"We expect proceeds from Dermacosmetics to contribute to debt reduction in the second quarter,\" and announced a new 2-year operational enhancement program targeting a global workforce reduction of approximately 7% and operational cost reductions, with expected annualized pretax savings of $80 million to $100 million.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Lockwood-Taylor described 2026 as a \"transition year,\" projecting CORE Perrigo organic net sales growth to range from negative 3.5% to positive 0.5% compared to 2025, and CORE EPS in the range of $2.25 to $2.55.</li>\n<li>He cautioned that \"OTC market consumption to remain negative in the first half of 2026 as consumption so far in 2026 has further weakened,\" but added, \"We expect the environment to improve in the second half.\"</li>\n<li>Bezerra explained, \"CORE EPS phasing is approximately 30% to 35% in the first half and 65% to 70% in the second half, which is modestly above our typical pattern.\"</li>\n<li>The company expects All-In net sales growth of minus 5.5% to minus 1.5%, and All-In EPS in the range of $2 to $2.30, assuming divestiture of Dermacosmetics in Q2.</li>\n<li>Bezerra indicated, \"We expect operating cash flow conversion to remain in the mid-60 percentage range and net leverage to end the year roughly in line with or slightly better than 2025.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Lockwood-Taylor reported, \"All-In business grew operating income by 2% and EPS by 7%, finishing at $2.75, right in line with our revised guidance. CORE Perrigo operating income was up 7%, with core EPS up 14%.\"</li>\n<li>In Q4, \"CORE Organic net sales declined 2% in the quarter despite strong share gains. And CORE operating income declined by $4 million or 2%, resulting in CORE EPS of $0.76, a decline of $0.02.\"</li>\n<li>Bezerra detailed, \"Exiting 2025, we had $532 million of cash on the balance sheet and fourth quarter operating cash flow was $175 million, bringing our total for the year to $239 million. We ended 2025 with a net leverage ratio of 4x.\"</li>\n<li>He added, \"Fourth quarter core operating income increased 10.3% due to favorable foreign currency.\"</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Keith Devas, Jefferies: Sought detail on \"what's driving that second half improvement\" in 2026 and longer-term OTC category stability. Lockwood-Taylor responded that \"the great majority of that as being transitory in nature,\" citing temporary trade-down and lack of price increases, and expects normalization to begin in late Q2 and accelerate in the second half. He added, \"about 60% of the value of our innovation is in the second half of this year.\"</li>\n<li>Devas followed up on liquidity and leverage, asking if the company has \"enough flex to reinvest in the business.\" Bezerra replied, \"Our capital allocation priorities remain unchanged,\" and expects proceeds from Dermacosmetics to be used for debt reduction, describing 2026 as \"a transitory year\" for free cash flow but expecting improvement into 2027.</li>\n<li>Ethan Brown, JPMorgan: Asked about recovery of OTC margins and timing. Bezerra described under-absorption impacts as \"transitory in nature,\" expecting improvement as the market normalizes in the second half and into 2027.</li>\n<li>Susan Anderson, Canaccord Genuity: Asked which CORE categories are driving negative growth. Lockwood-Taylor noted \"preventative categories are typically doing better,\" while \"cough/cold, and particular subsegments of pain, mainly pill dosing\" are underperforming. Anderson also queried dividend priorities and leverage goals, with Bezerra stating, \"for '26, as we highlighted, we expect that to be in line or slightly better than 2025.\"</li>\n<li>Daniel Biolsi, Hedgeye: Sought details on working capital in Infant Formula. Bezerra cited \"significant\" inventory levels and noted a plan for \"low to mid-single-digit net sales plan should help deplete that inventory this year.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed management on the depth and duration of soft market conditions, liquidity, margin recovery, and strategic reviews, signaling a neutral to slightly negative tone especially regarding short-term headwinds and inventory issues.</li>\n<li>Management's tone during prepared remarks was pragmatic and confident, but during Q&amp;A, both Lockwood-Taylor and Bezerra acknowledged challenges, using phrases like \"transitory in nature\" and \"we expect that to be recovered into 2027,\" reflecting a measured but realistic outlook.</li>\n<li>Compared to the previous quarter, management maintained a steady tone, but with a sharper focus on cost controls and operational enhancements amid persistent market softness. Analyst sentiment remained cautious, continuing to probe on near-term risks and recovery timing.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Management's 2026 guidance language is more tempered, specifically calling 2026 a \"transition year\" and explicitly outlining temporary headwinds such as under-absorption and market softness, whereas Q3 emphasized stabilization and the beginnings of recovery.</li>\n<li>Strategic focus shifted more clearly to cost reduction, operational streamlining, and portfolio optimization, including explicit workforce reduction and the impact of divestitures.</li>\n<li>Analysts in both quarters concentrated on OTC consumption trends, Infant Formula, and capital allocation, but the current quarter featured more pointed questions about cash flow, leverage, and category-specific drivers.</li>\n<li>The tone of both management and analysts remained cautious, but current remarks reveal greater visibility and willingness to address structural and operational adjustments.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited continued softness in OTC market consumption, a slow cough and cold season, retailer inventory adjustments, and competitive pressures in Infant Formula as ongoing risks.</li>\n<li>Bezerra described the $1.3 billion goodwill impairment and potential for further noncash impairment charges up to $350 million as non-operational risks.</li>\n<li>The company expects \"temporary but significant impact from plant under absorption stemming from lower sales volumes,\" which will weigh on 2026 EPS.</li>\n<li>Analysts consistently questioned the pace of margin and cash flow recovery, the sustainability of share gains, and the effectiveness of cost-saving measures.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Perrigo management emphasized that 2026 will be a transitional year marked by temporary market and operational headwinds, yet highlighted continued market share gains, a robust innovation pipeline, and disciplined cost actions. The company projects CORE EPS in the $2.25 to $2.55 range, expects margin and cash flow improvement as conditions normalize, and remains committed to deleveraging and prioritizing investments in growth and returns to shareholders. The leadership team sees 2027 as a meaningful growth year, underpinned by strategic portfolio moves and operational enhancements completed in 2026.</p>\n<p><a href=\"https://seekingalpha.com/symbol/prgo/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558023-perrigo-outlines-2026-core-eps-range-of-2_25-to-2_55-as-company-navigates-soft-otc-market",
            "pub_date": "2026-02-27 02:01:34",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558022",
            "title": "Montrose targets 10% EBITDA growth and launches $40M share repurchase while expanding AI-driven opportunities in 2026",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Montrose Environmental Group, Inc. (MEG) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Vijay Manthripragada reported \"2025 was a record year across every key dimension: revenue, EBITDA, and cash flow.\" He emphasized that \"we delivered full year revenue of $830.5 million and consolidated adjusted EBITDA of $116.2 million, both record highs and both well above the initial guidance we provided at the start of 2025.\" </li>\n<li>Manthripragada highlighted organic growth outpacing targets, stating \"revenue grew 19.3% versus 2024, driven by organic growth of 12.7%, which meaningfully exceeded our long-term organic growth target of 7% to 9%.\" All three segments posted solid organic revenue growth despite regulatory uncertainty.</li>\n<li>Addressing regulatory concerns, Manthripragada stated \"the macro and regulatory backdrop for environmental services and solutions remains as constructive as we have seen, and the performance we delivered in 2025 is the clearest possible evidence of that.\"</li>\n<li>Demand from sectors such as mining, pharmaceuticals, semiconductors, and technology companies building data centers was called out as a recent growth driver. Manthripragada noted \"the air monitoring or water treatment needs for our clients in these sectors has picked up materially and were not part of our outlook 18 months ago.\"</li>\n<li>On methane and PFAS regulatory changes, the CEO explained the business is insulated by private sector demand and state-level regulations. He also pointed to the PFAS business as \"already a high-margin growth driver across our segments.\"</li>\n<li>Manthripragada unveiled a \"$40 million share repurchase authorization\" and confirmed the company is \"in a strong position to begin returning capital directly to shareholders.\" He also announced a return to acquisitions in 2026, after a previously announced pause.</li>\n<li>CFO Allan Dicks stated \"full year 2025 revenues increased by 19.3% versus 2024, totaling $830.5 million, well above our initial guidance.\" Dicks noted \"consolidated adjusted EBITDA increased 21.3% to $116.2 million, or 14% of revenue, resulting in our third consecutive year of margin expansion.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Manthripragada introduced 2026 guidance of \"$840 million to $900 million in revenue and $125 million to $130 million in consolidated adjusted EBITDA.\" At the midpoint, this represents \"approximately 10% EBITDA growth compared to 2025.\" </li>\n<li>The company is targeting \"approximately 15% consolidated adjusted EBITDA margins in 2026.\" </li>\n<li>\"Organic revenue growth of 7% to 9% remains our long-term expectation. And for 2026, we expect to be at the high end of that range.\"</li>\n<li>Revenue in the second half of 2026 is expected to be higher than the first half, with \"the second half contributing approximately 60% of full year consolidated adjusted EBITDA.\"</li>\n<li>Operating cash conversion is expected to be \"60%\" in 2026, after achieving \"93%\" in 2025.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Dicks reported \"fourth quarter revenue increased to $193.3 million compared to $189.1 million in the prior year period.\"</li>\n<li>For the full year, \"net loss improved to $0.8 million, or $0.14 loss per diluted share compared to a net loss of $62.3 million, or $2.22 net loss per diluted share in 2024.\"</li>\n<li>Adjusted net income and diluted EPS for 2025 were $60.7 million and $1.36, respectively.</li>\n<li>Segment results highlighted the Assessment, Permitting and Response segment with \"full year revenue increased 43%, or $92.6 million, to $307.4 million,\" and Measurement and Analysis segment with \"full year revenue grew 9.6% to $245.9 million.\"</li>\n<li>Operating cash flow reached $107 million in 2025, a \"93% conversion of consolidated adjusted EBITDA.\"</li>\n<li>The company exited the year with a leverage ratio of 2.5x and available liquidity of $225 million.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Timothy Mulrooney, William Blair: Asked about cadence of revenue and EBITDA in 2026. Allan Dicks replied \"we expect revenues to be split roughly 50-50 front half/back half\" and EBITDA \"40% first half, 60% second half.\" He noted \"Q1 is just a very seasonally slow quarter\" and emergency response revenue timing can shift quarterly splits.</li>\n<li>Mulrooney inquired about AI impacts. Manthripragada responded \"our work is much more bespoke,\" and noted \"we are already in the process\" of using AI for efficiency and new revenue streams, especially in sensor networks and air monitoring. He added \"the technology companies that are driving a lot of this activity are Montrose's clients,\" and AI-driven demand is a \"tailwind.\"</li>\n<li>Mulrooney asked about new thematics (mining, pharma, semi, data centers). Manthripragada said \"GLP-1 manufacturers...are working with us\" for PFAS solutions, data center work is already contributing to revenue, and \"our water technology business...we expect to grow double digits in '26 compared to '25.\"</li>\n<li>James Ricchiuti, Needham: Sought clarity on organic growth drivers. Manthripragada pointed to \"our water technology business, which we expect to grow really nicely into the foreseeable future\" and ongoing demand in testing and consulting. He described cross-selling as \"largely just execution\" and cited new commercial talent as a driver.</li>\n<li>Ricchiuti asked about PFAS revenue. Manthripragada said \"it remains about 10% to 15% of our business\" with \"double-digit growth expected into 2026.\"</li>\n<li>Tami Zakaria, JPMorgan: Queried M&amp;A timing and focus. Manthripragada said \"nothing imminent\" but \"expect to close some\" small, bolt-on deals in the back half of the year, with focus on testing and consulting.</li>\n<li>Zakaria asked about a lighter Q1. Dicks confirmed \"it is primarily lower emergency response\" and some \"project timing and tougher comparisons year-over-year in Q1 that lighten as we progress through the year.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on cadence, AI, sector tailwinds, organic growth, PFAS, and M&amp;A; tone remained positive, with constructive and detailed responses from management cited as helpful.</li>\n<li>Management maintained a confident and optimistic tone, frequently referencing record performance and robust demand. Manthripragada used phrases such as \"extremely pleased,\" \"deeply optimistic,\" and \"the confidence we have in our performance.\"</li>\n<li>Compared to the previous quarter, analysts continued to probe about segment drivers and strategic execution, but the tone was slightly more positive in Q4, reflecting strong year-end results and clear guidance. Management sustained a consistent level of confidence, now bolstered by actual record outcomes and the initiation of share repurchases.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>2026 guidance was introduced with a clear revenue and EBITDA target, compared to Q3's more general outlook for at least $125 million in EBITDA.</li>\n<li>The company advanced its share repurchase program in Q4, a new development versus Q3 where capital allocation focused primarily on organic investments.</li>\n<li>Management's tone remained optimistic in both quarters, but Q4 was marked by even greater confidence as all 2025 record targets were exceeded.</li>\n<li>Analysts shifted from questions about wind-down impacts in renewables (Q3) to more forward-looking inquiries on AI, sector opportunities, and M&amp;A timing (Q4).</li>\n<li>Key metrics such as organic growth, margin expansion, and cash flow strengthened further in Q4, with leverage and liquidity improving sequentially.</li>\n<li>Strategic focus shifted from balance sheet simplification to resuming acquisitions and share repurchases in Q4.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management addressed ongoing regulatory uncertainty, emphasizing that \"regulatory volatility and uncertainty creates meaningful headwinds for Montrose\" is not supported by results, as \"the macro and regulatory backdrop...remains as constructive as we have seen.\"</li>\n<li>Potential headwinds discussed included timing and unpredictability of emergency response revenue, continued wind-down of renewables, and project timing impacts in early 2026.</li>\n<li>Analysts questioned the impact of AI on business defensibility, but management indicated the company is \"much more insulated from those dynamics\" than traditional engineering and design firms.</li>\n<li>Exposure to U.S. federal government remains low, with less than 3% of revenue, minimizing direct policy risk.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Montrose Environmental delivered record revenue, EBITDA, and cash flow in 2025, achieving growth well beyond initial guidance and expanding margins for the third straight year. The company sees robust organic growth continuing into 2026, supported by strong demand from private sector clients in sectors like mining, pharma, and technology. Strategic priorities for 2026 include high-end organic revenue growth, margin expansion, strong cash conversion, and renewed focus on M&amp;A and share repurchases, with $40 million authorized for buybacks. Management remains deeply optimistic, citing a constructive regulatory backdrop, resilient private sector demand, and a robust pipeline of opportunities across geographies and end markets.</p>\n<p><a href=\"https://seekingalpha.com/symbol/meg/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558022-montrose-targets-10-percent-ebitda-growth-and-launches-40m-share-repurchase-while-expanding",
            "pub_date": "2026-02-27 02:01:34",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558015",
            "title": "Teladoc upgraded at BofA on BetterHelp prospects",
            "description": "<html><body><p data-eci=\"true\">Teladoc Health (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TDOC\" title=\"Teladoc Health, Inc.\">TDOC</a></span>) added ~14% on Thursday after its consensus-beating Q4 2025 results, while Bank of America upgraded the telehealth provider, citing the prospects of its mental health business, BetterHelp.</p>\n<p>On Wednesday after the close, the New York-based health tech reported $642.3M in revenue, exceeding the consensus by $6.9M, as its Integrated Care segment generated $409.1M with ~5% YoY growth even as BetterHelp revenue <a href=\"https://seekingalpha.com/news/4557111-teladoc-health-gaap-eps-of-0_14-beats-by-0_04-revenue-of-642_27m-beats-by-6_94m\" rel=\"noopener\" target=\"_blank\">fell ~7% YoY to $233.2M.</a></p>\n<p>However, according to BofA analyst Allen Lutz, BetterHelp’s marketing intensity would decline, and its margins would improve as it transitions from a direct-to-consumer model to insurance coverage, a strategy followed by its rival Talkspace (<a href=\"https://seekingalpha.com/symbol/TALK\" title=\"Talkspace, Inc.\">TALK</a>).</p>\n<p>Lutz pointed out that Talkspace’s (<a href=\"https://seekingalpha.com/symbol/TALK\" title=\"Talkspace, Inc.\">TALK</a>) EBITDA margins have improved to 11.5% at the midpoint of the 2026 outlook from (9%) in 2023 as it pivoted to insurance coverage from being a DTC platform.</p>\n<p>“Assuming that BetterHelp can transition 50-60% of its revenue to insurance coverage by 2028 would support an enterprise value of $1.2B (at 2.5x revenue), more than TDOC’s entire valuation today before including Integrated Care and Livongo,” Lutz wrote.</p>\n<p>He upgraded Teladoc (<a href=\"https://seekingalpha.com/symbol/TDOC\" title=\"Teladoc Health, Inc.\">TDOC</a>) to Buy from Neutral and reaffirmed his $7 price target on the stock.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558015-teladoc-upgraded-at-bofa-betterhelp-prospects",
            "pub_date": "2026-02-27 01:55:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557991",
            "title": "Software job postings pick up Y/Y even as AI haunts the market",
            "description": "<html><body><p data-eci=\"true\">Hiring says one thing, stocks another.</p>\n<p>Software stocks (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IGV\" title=\"iShares Expanded Tech-Software Sector ETF\">IGV</a></span>) have been selling off in the past year as market participants fret over industry-wide AI disruption, yet job postings for software roles are running higher, according to Indeed data. </p>\n<p>Indeed's gauge for software development job postings bounced to 71.4 at of Feb. 20 from 64.0 a year earlier, signaling investor anxiety about AI may be running ahead of what high-frequency hiring data show. Still, the improvement comes off depressed levels, staying well below their 2022 peak of over 230 and under the pre-pandemic baseline of about 100.</p>\n<p>Y/Y, software stocks (<a href=\"https://seekingalpha.com/symbol/IGV\" title=\"iShares Expanded Tech-Software Sector ETF\">IGV</a>) dropped 16%, although some analysts have called the move overdone and <a href=\"https://seekingalpha.com/news/4556577-tom-lee-spies-a-bottom-in-software-stocks\" target=\"_blank\" title=\"pointed to signs\">pointed to signs</a> of a bottom. <span>IGV's top-five holdings are Microsoft (</span>MSFT<span>), Palantir (</span>PLTR<span>), Oracle (</span>ORCL<span>), Salesforce (</span>CRM<span>) and Intuit (</span>INTU<span>).</span></p>\n<p><span>Other software ETFs: (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IGPT\" title=\"Invesco AI and Next Gen Software ETF\">IGPT</a></span>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/XSW\" title=\"State Street SPDR S&amp;P Software &amp; Services ETF\">XSW</a></span>), and (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/AOTS\" title=\"AOT Software Platform ETF\">AOTS</a></span>).</span></p>\n<figure class=\"regular-img-figure\" contenteditable=\"false\"><span><img alt=\"Software development job postings on Indeed\" data-caption=\"Software development job postings on Indeed\" data-original-src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/fd6ac3f77e24bce222a8d99e8c00d328.png\" data-rel=\"lightbox\" data-source=\"Seeking Alpha\" fetchpriority=\"high\" height=\"348\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\" src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/fd6ac3f77e24bce222a8d99e8c00d328.png?io=w640\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/fd6ac3f77e24bce222a8d99e8c00d328.png?io=w750 750w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/fd6ac3f77e24bce222a8d99e8c00d328.png?io=w640 640w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/fd6ac3f77e24bce222a8d99e8c00d328.png?io=w480 480w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/fd6ac3f77e24bce222a8d99e8c00d328.png?io=w320 320w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/fd6ac3f77e24bce222a8d99e8c00d328.png?io=w240 240w\" width=\"900\"/></span><figcaption class=\"overlay-title\"><p class=\"item-caption\">Software development job postings on Indeed<span class=\"item-source\"> (Seeking Alpha) </span></p></figcaption></figure><p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/fd6ac3f77e24bce222a8d99e8c00d328.png?io=w640",
            "link": "https://seekingalpha.com/news/4557991-software-job-postings-pick-up-yy-even-as-ai-haunts-market",
            "pub_date": "2026-02-27 01:55:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558012",
            "title": "Essential Utilities reaffirms 5%-7% EPS growth target through 2027 as merger with American Water advances",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Essential Utilities (WTRG) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Chairman and CEO Christopher Franklin highlighted the overwhelming shareholder support for the company's merger with American Water, stating, \"nearly 95% of the shares voted were in favor of the transaction.\" Franklin emphasized the \"record speed\" of shareholder approval and noted that all seven required state filings were completed by year-end 2025. He added, \"we continue to believe that we will close the transaction in the first quarter of 2027.\"</li>\n<li>Franklin reported 2025 earnings per share of $2.20, which he described as \"above our guidance range of $2.07 to $2.11.\" He also underscored the company's record $1.4 billion capital investment in regulated infrastructure for the year and three municipal acquisitions completed in 2025.</li>\n<li>Dividend growth was also addressed, with a 5.25% increase in the quarterly dividend in July, marking the 35th increase in 34 years and 80 consecutive years of paying dividends.</li>\n<li>The CEO noted operational achievements, including the continued execution of the $450 million PFAS capital plan and the installation of over 50 advanced treatment systems, as well as reaching the 100,000 Intelis meter milestone in the natural gas segment.</li>\n<li>Franklin emphasized that merger activities did not detract from operational goals, stating, \"our work on the merger did not distract us from our core operational goals and obligations to our customers and that will most certainly continue through 2026.\"</li>\n<li>Executive VP &amp; CFO Daniel Schuller reported, \"revenues increased $388.5 million or 18.6% from about $2.1 billion a year ago to nearly $2.5 billion this year.\" Schuller also pointed out, \"The $2.20 for 2025 represents significant growth over the $1.97 of non-GAAP income per share in 2024.\"</li>\n<li>Schuller discussed nonrecurring items, including favorable regulatory asset adjustments, insurance proceeds, and merger-related expenses. He stated, \"even excluding these onetime items, both good and bad, we still had strong financial performance that would have exceeded our range.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>The company reaffirmed its \"5% to 7% multiyear earnings per share guidance through 2027 from the adjusted non-GAAP 2024 and earnings per share of $1.97,\" per Franklin. This guidance includes acquisitions expected to close in 2026 but excludes the DELCORA transaction.</li>\n<li>Franklin stated, \"regulated infrastructure investments are expected to be $1.7 billion\" in 2026.</li>\n<li>Schuller recommended applying the 5% to 7% CAGR to the 2024 non-GAAP income per share of $1.97 for a better sense of 2026 performance, given the impact of nonrecurring items in 2025.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Essential Utilities reported full-year 2025 GAAP EPS of $2.20, with Schuller noting it was \"above our guidance range of $2.07 to $2.11 due to nonrecurring benefits.\"</li>\n<li>Revenues grew to nearly $2.5 billion, driven by $177.6 million in regulatory recoveries, $126.8 million in increased purchased gas costs, and $57.2 million from air gas volumes. Customer growth contributed $5.6 million, while lower water volumes reduced revenue by $8.6 million.</li>\n<li>O&amp;M expenses rose by $52.3 million, due to higher employee-related costs, increased Universal Services Rider expenses, and water production cost increases. Merger-related expenses were also noted.</li>\n<li>Regulatory recoveries completed in 2025 totaled $101.5 million of incremental annualized revenue, with $92.6 million from water and wastewater and the remainder from gas.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Paul Zimbardo, Jefferies: Asked if non-GAAP 2025 EPS was quantified with all adjustments. Daniel Schuller: \"No, we didn't specifically, we just gave you kind of the nonrecurring items there, both sort of positive items and then we noted the transaction costs as well.\"</li>\n<li>Zimbardo: Inquired about timing for the next round of Pennsylvania rate cases. Schuller: Indicated a likely continuation of a \"2-year cadence\" for filings.</li>\n<li>Zimbardo: Questioned the tweak in language regarding credit metrics. Schuller: \"We should be above that 12% threshold for Moody's and for S&amp;P. So we feel good about those credit metrics.\"</li>\n<li>Travis Miller, Morningstar: Asked if regulatory activity could be combined with merger approval proceedings. Franklin: \"They are separate dockets and will be adjudicated separately in each case.\" Schuller: \"We don't see those being combined Travis.\"</li>\n<li>Miller: Sought clarification on the company's role in the Chester bankruptcy process. Franklin explained the context of the Supreme Court's ruling, the DELCORA transaction, and potential negotiations for city assets.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analyst tone was neutral, focusing on clarification of non-GAAP adjustments, regulatory cadence, credit metrics, and merger process logistics.</li>\n<li>Management maintained a confident and slightly positive tone in prepared remarks, emphasizing strong results, dividend growth, and successful infrastructure investments. In Q&amp;A, answers were straightforward, with Schuller showing confidence in credit metrics and Franklin providing detailed explanations about regulatory and bankruptcy developments.</li>\n<li>Compared to the previous quarter, management's tone remained confident, while analyst engagement increased due to the return of live Q&amp;A, shifting from the prior quarter's scripted remarks.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter saw the completion of all seven state filings for the American Water merger and a record-setting shareholder approval process.</li>\n<li>Full-year financial results were reported, whereas the previous quarter focused on year-to-date performance and projections.</li>\n<li>Dividend growth and capital investment figures were reaffirmed, with 2026 infrastructure investment expectations increased to $1.7 billion (from $1.4 billion in 2025).</li>\n<li>Management sustained a confident outlook, while analyst focus shifted toward regulatory timing, credit metrics, and merger logistics, reflecting an increased interest in the merger's progression.</li>\n<li>The return of live Q&amp;A in this quarter allowed for more direct analyst challenges and clarifications compared to the previous quarter's prepared remarks only.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Regulatory approval timing for the American Water merger remains a key challenge, with Franklin acknowledging, \"I may not be able to promise this regulatory approval phase will proceed in the same record speed as our shareholder approval.\"</li>\n<li>The ongoing bankruptcy process in the city of Chester and its potential impact on the DELCORA transaction was highlighted, with Franklin stating the company is \"closely monitoring the receiver's next move.\"</li>\n<li>Ongoing national and state discussions around affordability and their potential impact on customer bills were acknowledged, with management reiterating a balanced approach to investments and operating costs.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Management emphasized that Essential Utilities delivered a strong 2025 performance, exceeding its EPS guidance with robust revenue growth and record infrastructure investments while advancing the merger with American Water. The company reaffirmed its 5% to 7% EPS growth target through 2027, highlighted its ability to balance operational execution with major strategic initiatives, and reiterated its commitment to regulatory compliance, customer affordability, and maintaining strong credit metrics as it enters a pivotal phase leading up to the anticipated merger.</p>\n<p><a href=\"https://seekingalpha.com/symbol/wtrg/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558012-essential-utilities-reaffirms-5-percentminus-7-percent-eps-growth-target-through-2027-as",
            "pub_date": "2026-02-27 01:50:42",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558014",
            "title": "PROCEPT BioRobotics outlines $390M–$410M revenue target for 2026 as pricing discipline and commercial realignment reshape outlook",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: PROCEPT BioRobotics (PRCT) Q4 2025  </p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Larry Wood provided an overview of organizational changes since his arrival, stating, \"The next stage of PROCEPT's development requires shifting the operational focus towards increasing procedure volume, expanding margins and achieving profitability and gaining market share.\" Wood detailed a realignment of the commercial team into an integrated regional structure and the creation of a dedicated launch team, explaining, \"The new structure creates a single point of accountability at the regional level to ensure clinical and commercial activities are coordinated around customer success and procedure growth.\" The CEO also emphasized the elimination of discounts on bulk handpiece purchases, describing this as foundational for the company's long-term success and noting, \"We eliminated the historical practice of providing discounts on bulk purchases, particularly at the end of the quarter.\"</li>\n<li>CFO Kevin Waters reported, \"Total revenue for the fourth quarter of 2025 was $76.4 million, representing 12% year-over-year growth.\" He highlighted U.S. procedure growth of approximately 69% year-over-year, a 5% sequential increase in average handpiece selling price to $3,340, and U.S. system revenue of $27.6 million. Waters further stated, \"At the end of 2025, we had an installed base of 718 systems, representing a 42% increase compared to year-end 2024.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Full year 2026 total revenue is now expected between $390 million and $410 million, with anticipated growth of 27% to 33%. Management expects international revenue for 2026 in the range of $50 million to $51 million. The company projects 2026 U.S. procedures between 60,000 and 64,000, or growth of 39% to 48%. \"Our updated guidance incorporates both factors above in addition to the short-term disruption of our sales organization, as discussed by Larry,\" said the CFO. The company expects the average U.S. handpiece selling price to be $3,500 in 2026 and full-year gross margin to be approximately 65%, which includes $5 million to $6 million of tariff expense.</li>\n<li>For the first quarter of 2026, revenue guidance is $79 million to $82 million with U.S. system revenue of approximately $20 million and $10 million of international revenue.</li>\n<li>The company expects full-year 2026 operating expenses to reach $350 million, a 17% increase, and adjusted EBITDA loss to be between $30 million and $17 million, with positive EBITDA expected in Q4 2026.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Total revenue for the fourth quarter was $76.4 million, with U.S. revenue at $66.6 million and international revenue at $9.8 million. U.S. procedures reached approximately 12,200, reflecting 69% growth. Handpieces sold totaled 9,400 units at an average selling price of $3,340. Other consumable revenue was $2.3 million, and total U.S. handpiece and other consumable revenue was $34 million. The company sold 65 new HYDRO systems in Q4. Gross margin for the quarter was 60.6%, down from 64% in Q4 2024, with the decrease attributed to lower-than-expected U.S. consumable revenue and a onetime voluntary field action.</li>\n<li>Operating expenses were $77.4 million, compared to $63.4 million in the prior year. The net loss for Q4 was $29.8 million. Adjusted EBITDA loss was $19 million. Cash, cash equivalents, and restricted cash totaled $285 million as of year-end.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Matthew O'Brien, Piper Sandler: Asked about the handpiece sales softness and inventory changes. CEO Wood explained, \"We had signaled on the Q3 call that we expect there to be some destocking ... but ... as the quarter progressed ... our business practices of allowing bulk purchases at a discount was influencing customer purchase behavior.\"</li>\n<li>O'Brien followed up on the confidence behind back-end loaded 2026 guidance. Wood stated, \"We do think these are going to pay dividends to us ... But those are going to show up more in the back half of the year rather than the front half of the year.\"</li>\n<li>Christopher Pasquale, Nephron Research: Asked about the 1:1 ratio of handpiece sales to procedures. Wood responded, \"We now expect handpiece unit sales and procedure volumes to be in close alignment on a go-forward basis ... Based on all of our analysis and assessments, I think there's probably more upside to that number than downside.\"</li>\n<li>Several analysts pressed on the stability of the sales force and risks of customer dissatisfaction. Wood reported, \"We haven't seen any higher attrition. ... In creating those launch teams, though, we took some of our best people out of the utilization team ... but they have to rebuild relationships with those customers.\"</li>\n<li>Other topics included system pricing, underlying procedure demand, impact of field action on gross margin, and competition from alternative BPH procedures.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts expressed skepticism about the inventory transition, sustainability of procedure growth, and the potential for further guidance reductions, with questions on the durability of recent changes and customer reactions. Their tone was slightly negative, focused on risk and clarity of execution.</li>\n<li>Management maintained a confident but defensive stance, frequently emphasizing structural improvements and transparency: \"We just had to stop some of these things that I think we're hurting our margins, and I think we're encouraging the wrong customer behavior.\"</li>\n<li>Compared to the previous quarter, analyst tone was more pressing, and management's tone shifted from optimism to a mix of confidence and caution, often underscoring the need for foundational changes.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The company transitioned from projecting $410 million–$430 million in 2026 revenue (Q3) to the current $390 million–$410 million range, reflecting the impact of pricing discipline and sales force restructuring.</li>\n<li>Strategic focus shifted from broad expansion and marketing investments to operational discipline, margin expansion, and alignment of handpiece sales with procedure growth.</li>\n<li>Analysts in both quarters questioned sustainability and execution but showed increased concern this quarter over inventory and revenue recognition changes.</li>\n<li>Management's confidence remains, though language is more measured and focused on long-term structural improvements as opposed to only growth.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>The company cited short-term disruption from commercial realignment and the transition to new operating processes.</li>\n<li>Analysts raised concerns about customer adaptation to new pricing, possible procedure volume impacts, and the risk of further guidance changes.</li>\n<li>A onetime voluntary field action impacted Q4 margins. Management stated this was nonrecurring and fully addressed.</li>\n<li>Tariff expenses are expected to increase in 2026, pressuring gross margins.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Management emphasized that pricing discipline, organizational realignment, and greater transparency are foundational steps for sustaining high growth and achieving profitability. While these changes resulted in short-term revenue and gross margin impacts, the company believes they position PROCEPT BioRobotics for more predictable procedure-driven revenue and stronger margins, with a clear path to profitability as the organization adapts to its new commercial model.</p>\n<p><a href=\"https://seekingalpha.com/symbol/prct/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558014-procept-biorobotics-outlines-390m-410m-revenue-target-for-2026-as-pricing-discipline-and",
            "pub_date": "2026-02-27 01:50:42",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558007",
            "title": "Ashford Hospitality Trust outlines $90M-$110M 2026 capex plan as portfolio leans on strategic dispositions and event-driven demand",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Ashford Hospitality Trust (AHT) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Stephen Zsigray opened by highlighting the formation of a special committee in December to evaluate strategic alternatives \"to maximize shareholder value, including a potential transaction.\" Zsigray acknowledged frustration regarding \"the discrepancy between the value of our underlying portfolio and the market value of our common stock\" and reinforced a focus on \"driving outsized performance while pursuing opportunistic dispositions to deleverage, improve cash flow and maximize shareholder value.\"</li>\n<li>The company reported the sale of 6 hotels, generating approximately $145 million in sales proceeds and eliminating nearly $50 million in anticipated capital expenditures. Additional asset sales were announced, with agreements to sell three more hotels for a combined $194.5 million, expected to save $45 million in projected capital expenditures. </li>\n<li>Zsigray disclosed a maturity default on the $325 million JPM8 mortgage loan, stating that \"disposition of these assets for the balance of the debt would represent a 6.2% trailing cap rate and would yield many of the same benefits for the portfolio as our ongoing sales efforts.\" </li>\n<li>CFO Deric Eubanks stated, \"For the fourth quarter, we reported a net loss attributable to common stockholders of $78.3 million or $12.33 per diluted share. For the full year, we reported a net loss attributable to common stockholders of $215 million or $35.99 per diluted share.\" Eubanks also reported adjusted EBITDAre for the quarter of $40.4 million and $221.3 million for the full year, with cash and cash equivalents of $66.8 million at quarter end.</li>\n<li>Senior VP Christopher Nixon explained that \"comparable hotel RevPAR decreased 1.8% compared to the prior year period,\" citing the federal government shutdown and demand disruptions as key factors, but emphasized \"full year total revenue increased 0.8%\" and \"hotel EBITDA increased 2.4%.\" Nixon noted upcoming brand conversions at two properties to Hyatt Regency Hotels with over $70 million planned investment.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management expects opportunistic dispositions to remain a core component of the 2026 strategy and is currently marketing or negotiating transactions on 18 additional hotels. Zsigray said, \"we expect that our continued focus on performance, combined with strategic low cap rate dispositions will result in a leaner, stronger portfolio and will position the company to pursue accretive growth opportunities in the future.\"</li>\n<li>For 2026, capital expenditures are anticipated to be between $90 million and $110 million. Nixon commented, \"we anticipate spending between $90 million and $110 million on capital expenditures.\"</li>\n<li>Group demand is projected to strengthen, with Nixon stating, \"group room revenue pacing ahead 1% in the first quarter of 2026 and 3.3% in the second quarter of 2026 compared to the prior year period,\" and highlighting \"continued acceleration\" in group rooms revenue pace for the full year.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>The company reported AFFO per diluted share of negative $2.45 for the quarter and negative $5.66 for the full year. At the end of Q4, there was $2.6 billion of loans outstanding at a blended average interest rate of 7.7%, with 95% of debt being floating rate.</li>\n<li>Portfolio consisted of 68 hotels with 16,500 net rooms as of December 31, 2025. Net working capital stood at approximately $103.2 million.</li>\n<li>Nixon detailed that resort assets performed well, with Renaissance Palm Springs delivering a 16.9% increase in group room revenue compared to the prior year period. Le Meridien Fort Worth Downtown saw group room revenue growth of 201.2% and food and beverage revenue growth of 59.4% in the fourth quarter.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul><li>NOT_APPLICABLE – The transcript does not contain a Q&amp;A session or analyst questions.</li></ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>No analyst questions or commentary are present in the transcript, so analyst sentiment cannot be assessed.</li>\n<li>Management maintained a cautiously optimistic but pragmatic tone, with Zsigray acknowledging industry headwinds but emphasizing progress: \"Despite numerous headwinds in 2025, we are pleased that for the full year, our portfolio delivered positive growth in comparable total revenues while achieving 2.4% growth in comparable hotel EBITDA.\"</li>\n<li>Compared to the previous quarter, management continued to reinforce a focus on performance and capital structure improvement, but the formation of a special committee to explore strategic alternatives signals an elevated sense of urgency.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Strategic focus shifted more prominently toward exploring value-maximizing transactions, as highlighted by the special committee announcement in Q4, while the previous quarter focused primarily on operational performance and refinancing.</li>\n<li>The number of assets marketed/negotiated for sale expanded to 18 in Q4 from 8 in Q3, indicating a more aggressive disposition strategy.</li>\n<li>Guidance for 2026 capital expenditures increased to a range of $90 million–$110 million for the year, compared to a 2025 anticipated range of $70 million–$80 million in the prior quarter.</li>\n<li>The company reported a higher net loss attributable to common stockholders in Q4 versus Q3, and working capital declined from $144.3 million to $103.2 million.</li>\n<li>Management confidence remained measured, but the tone became more proactive in addressing valuation gaps and liquidity constraints.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Zsigray cited \"industry-wide negative RevPAR growth and margin compression, substantial reductions in government spend, elevated interest rates and increased CapEx demands\" as ongoing pressures for hotel owners.</li>\n<li>The federal government shutdown and a major convention center closure in Austin were identified as significant demand disruptors.</li>\n<li>Maturity default on the $325 million JPM8 mortgage loan was disclosed, with ongoing negotiations for a favorable resolution.</li>\n<li>Management acknowledged that \"liquidity will remain constrained as we execute our plan.\"</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Ashford Hospitality Trust's fourth quarter was marked by the launch of a special committee to evaluate strategic alternatives, a series of hotel sales to reduce leverage and boost cash flow, and continued operational gains despite industry headwinds. Management is guiding for increased capital investments in 2026 and expects event-driven demand to support portfolio performance, particularly in markets hosting major events like the FIFA World Cup. The company remains focused on optimizing its asset base while managing liquidity and cost pressures as it pursues opportunities to close the gap between portfolio value and stock price.</p>\n<p><a href=\"https://seekingalpha.com/symbol/aht/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558007-ashford-hospitality-trust-outlines-90m-110m-2026-capex-plan-as-portfolio-leans-on-strategic",
            "pub_date": "2026-02-27 01:41:30",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558008",
            "title": "VICI targets up to $2.625B 2026 AFFO with $2.1B in new 2025 commitments while advancing portfolio diversification",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: VICI Properties (VICI) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Edward Pitoniak highlighted the company's focus on the operational performance of tenants, referencing the transformation at The Venetian as recognized by Harvard Business School: \"the EBITDAR of the property had increased from $487 million pre-pandemic to $777 million in 2024.\" Pitoniak emphasized, \"given our triple net leases, we don't operate anything that goes on within our real estate, but we pay attention to operations and greatly appreciate all that our operators do every day to make our real estate relevant to their end customers.\"</li>\n<li>President John Payne discussed several new partnerships in 2025, including a long-term relationship with Cain and Eldridge Industries, a $510 million delayed draw term loan with Red Rock Resorts, the addition of Clairvest as the 14th tenant, and a $1.16 billion sale leaseback with Golden Entertainment. Payne stated, \"these announcements combined represents $2.1 billion of committed capital in 2025 at a weighted average initial yield of 8.9%.\" He also noted the company's entry into the Las Vegas locals market and described the market as \"demographically attractive.\"</li>\n<li>CFO David Kieske reported, \"AFFO increased 6.8% year-over-year to $642.5 million and on a per share basis, increased 5.6% year-over-year to $0.60\" for Q4, and \"for the full year 2025, AFFO increased 6.6% year-over-year to $2.5 billion and on a per share basis increased 5.1% year-over-year to $2.38.\" Kieske noted, \"our net income margin for the year was approximately 69%, one of the highest net income margins in the S&amp;P 500.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Kieske stated, \"AFFO for the year ended December 31, 2026, is expected to be between $2.59 billion and $2.625 billion or between $2.42 and $2.45 per diluted common share.\"</li>\n<li>Management reiterated that \"guidance does not include any transactions that have not closed, interest income from any loans that do not yet have final draw structures, possible future acquisitions or dispositions and related capital markets activity or other nonrecurring transactions or items.\"</li>\n<li>The company acknowledged the Las Vegas Strip had a \"relatively softer 2025,\" but described it as \"more of a normalization than a pullback.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Kieske emphasized that the growth in AFFO was \"delivered primarily through the reinvestment of our free cash flow\" and noted, \"we only increased our share count by 1% in 2025.\"</li>\n<li>G&amp;A expense was reported as $19.3 million for Q4 and $65.1 million for the year, representing 1.9% and 1.6% of total revenues, respectively.</li>\n<li>Total debt stood at $17.1 billion, with net debt to annualized fourth quarter adjusted EBITDA at approximately 5x.</li>\n<li>Liquidity at year-end included $3.2 billion in total, with $608 million in cash, $243 million from outstanding forwards, and $2.4 billion of revolver availability.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Caitlin Burrows, Goldman Sachs, asked for updates regarding discussions with Caesars on the master lease. Pitoniak responded, \"as we address lease issues with Caesars, we're going to do so within the context of our overall approach to portfolio and risk management...any solutions that we develop and agree to with Caesars help further our larger portfolio goals of optimizing our exposure to any single tenant to any single category to any single geography.\"</li>\n<li>Burrows also inquired about a senior loan placed on nonaccrual. Pitoniak described the issue as \"a working capital issue\" for the borrower and that the impact was \"de minimis\" and not included in 2026 guidance. Wasserman confirmed, \"there's no income related to that loan included in 2026 guidance.\"</li>\n<li>Barry Jonas, Truist, asked about the deal environment and accounting leadership changes. Payne explained compensation is tied to \"a rolling 2-year AFFO per share growth\" and \"absolute relative total return.\" Gallagher and Payne expressed enthusiasm for Wasserman's expanded business development role, and noted Jeremy Waxman's promotion to Chief Accounting Officer.</li>\n<li>Greg McGinniss, Scotiabank, questioned the rationale for the Greektown Margaritaville lease adjustment. Payne replied, \"we really saw the opportunity to combine 2 leases, simplify the escalation structure, remove the volatility by eliminating the percentage of rent.\"</li>\n<li>Haendel St. Juste, Mizuho, asked about the AFFO guidance range and debt maturities. Kieske identified flexibility in draw schedules, G&amp;A, and interest income, and noted $1.75 billion in maturities later in the year. On Golden transaction cap rates, Payne said, \"every deal we have is just so different...we think the price was appropriate for getting a whole portfolio of assets.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts raised recurring questions about Caesars, loan book risks, deal pipeline, and the durability of new sectors such as sports and entertainment. The tone was neutral to slightly positive, with a focus on clarity and forward visibility.</li>\n<li>Management's prepared remarks conveyed confidence and highlighted disciplined growth. During Q&amp;A, management maintained a neutral and measured tone, particularly when discussing portfolio risk, tenant concentration, debt maturities, and coverage ratios. Phrases such as \"we are going to do so within the context of our overall approach to portfolio and risk management\" and \"we continue to prioritize real estate ownership while also using our loan book\" reflected a cautious but optimistic stance.</li>\n<li>Compared to the previous quarter, both analyst and management tone remained steady, though management's language demonstrated more explicit risk management and portfolio optimization themes.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 AFFO is higher than the prior year, with the new range set between $2.59 billion and $2.625 billion vs. previous guidance of $2.51 billion to $2.52 billion for 2025.</li>\n<li>New partnerships and a $1.16 billion sale leaseback with Golden Entertainment represent an increase in transaction volume compared to Q3, which focused on the addition of Clairvest.</li>\n<li>Management continues to emphasize portfolio diversification and long-term partnership strategy, compared to a prior focus on Las Vegas convention business resiliency and the opportunity in university sports infrastructure.</li>\n<li>Analysts continue to probe on Caesars lease renegotiations, loan risks, and exposure to new experiential sectors, with recurring questions about deal structure and risk.</li>\n<li>Management's tone remains deliberate and focused on stability, with increased discussion of portfolio optimization and measured growth.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Tenant concentration, particularly with Caesars, remains a key risk area. Management reiterated its focus on \"optimizing our exposure to any single tenant to any single category to any single geography.\"</li>\n<li>A senior loan was placed on nonaccrual status due to a borrower's working capital issue, though management characterized the impact as \"de minimis.\"</li>\n<li>Debt maturities totaling $1.75 billion later in 2026 were cited, with management planning to address these through bond market access and continued debt laddering.</li>\n<li>Analysts expressed concern about the volatility of rent escalations and loan portfolio performance, but management emphasized active asset management and conservative guidance inclusions.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>VICI Properties reported strong AFFO growth in Q4 and for the full year 2025, underpinned by disciplined capital allocation, limited share dilution, and new partnerships representing $2.1 billion in committed capital. AFFO guidance for 2026 signals continued growth, with management focusing on portfolio diversification, tenant risk management, and measured expansion into new experiential sectors. The company maintains a robust liquidity position and demonstrates ongoing commitment to optimizing exposure while actively managing its pipeline and tenant relationships.</p>\n<p><a href=\"https://seekingalpha.com/symbol/vici/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558008-vici-targets-up-to-2_625b-2026-affo-with-2_1b-in-new-2025-commitments-while-advancing",
            "pub_date": "2026-02-27 01:41:30",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}