{
    "data": [
        {
            "id": "4558379",
            "title": "Figure Technology Solutions outlines capital-light growth strategy with 3.5%-4% net take rate outlook while expanding blockchain ecosystem",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Figure Technology Solutions, Inc. (FIGR) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Michael Tannenbaum stated that the company is focused on three key areas for 2026: \"continuing to scale our marketplace, particularly through Figure Connect and driving more volume into our capital-light exchange,\" broadening product offerings in mortgage-adjacent categories, and \"expanding the broader blockchain ecosystem around that marketplace, where tokenization, decentralized finance and atomic settlement are setting the standard of how a modern capital marketplace should function.\"</li>\n<li>Tannenbaum highlighted that over half of consumer loan marketplace volume transacted through Figure Connect for the first time, calling this a structural milestone since its June 2024 launch, reducing reliance on balance sheet intermediation and creating a more capital-light model.</li>\n<li>The CEO emphasized AI integration, noting, \"AI is primarily about fueling growth opportunities for us and our partner ecosystem rather than simply optimizing costs,\" and described recent launches of AI-powered customer service and title review workflows.</li>\n<li>Tannenbaum announced a major partnership with Agora Data to bring auto finance assets into Democratized Prime, expected to add tens of millions of dollars in volume in the coming months, and announced a forthcoming strategic partnership with Newtek to deliver Figure’s HELOC for small business and develop embedded lending/banking solutions anchored by Figure’s stablecoin, YLDS.</li>\n<li>He called first lien mortgage a central growth driver, stating, \"as of Q4, first lien represents roughly 19% of our originations, up from 12% just a year ago,\" and projected that \"2026 will be the year of the first lien for Figure.\"</li>\n<li>Tannenbaum described recent blockchain ecosystem expansion, including cross-chain integration with Solana, growth of YLDS in circulation nearing $0.5 billion (over 20x since Q3), and the launch of OPEN, an on-chain native equity marketplace.</li>\n<li>He addressed a recent security incident affecting loan inquiry records of approximately 12,400 individuals, clarifying, \"this was not a blockchain or protocol-related event\" and stating the incident is not expected to have a material financial impact.</li>\n<li>CFO Minchung Kgil reported, \"we reported exceptional consumer loan marketplace volume this quarter, reaching $2.7 billion, an increase of 131% year-over-year,\" with sequential growth despite seasonal headwinds.</li>\n<li>Kgil stated, \"adjusted net revenue of $158 million, an increase of 106% year-over-year,\" and highlighted a net take rate of 3.8%, up 40 basis points year-over-year.</li>\n<li>She added, \"GAAP net income for the quarter was $15 million, representing a margin of 9.4% compared to 7% in Q4 of last year,\" and reported adjusted EBITDA of $81.3 million, up 426% year-over-year, with margin expanding to 51.6%.</li>\n<li>Kgil announced a $200 million share repurchase program, described as reflecting \"the strength of our balance sheet, the durability of our operating profile and our confidence in the long-term opportunity in front of us.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Kgil provided forward guidance that the near- to medium-term net take rate is expected to be \"between 3.5% to 4%, which takes into account factors such as product mix, marketplace participation and capital market conditions.\"</li>\n<li>She reiterated that the focus remains on \"scaling long-term marketplace margin durability and capital efficiency, not short-term pricing optimization at the expense of marketplace slowdown.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Consumer loan marketplace volume rose to $2.7 billion, a 131% year-over-year increase.</li>\n<li>Adjusted net revenue was $158 million, up 106% year-over-year.</li>\n<li>Net take rate was 3.8% for the quarter, increasing by 40 basis points year-over-year, but lower quarter-over-quarter due to product mix and broader market execution.</li>\n<li>GAAP net income reached $15 million, with a margin of 9.4%.</li>\n<li>Adjusted EBITDA was $81.3 million, up 426% year-over-year, and adjusted EBITDA margin reached 51.6%.</li>\n<li>Figure ended the quarter with approximately $1.2 billion in cash and cash equivalents.</li>\n<li>Loans held for sale totaled $404 million, up $15 million this quarter.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Dan Dolev, Mizuho: Asked about the Agora partnership's upside. Tannenbaum responded, \"It's an entrance into the massive auto finance sector... a huge opportunity for us from a democratized Prime perspective... and a connect upsell opportunity.\"</li>\n<li>Patrick Moley, Piper Sandler: Inquired about partner adds and their impact. Tannenbaum described, \"three primary motions that are all working really well\" and confirmed accelerated partner growth as an indicator of continued volume growth into 2026.</li>\n<li>Ryan Tomasello, KBW: Probed on monetization of third-party assets. Tannenbaum said, \"this is pure margin... leveraging our capital market infrastructure,\" and Kgil noted, \"we do anticipate this impacting the overall volume coming into Figure Connect,\" with auto loans likely commanding lower take rates.</li>\n<li>Robert Wildhack, Autonomous Research: Asked about take rate outlook. Kgil explained the shift, citing increased mix of auto and first lien loans, causing lower take rates, but maintained, \"contribution margin has been around the 80%.\"</li>\n<li>James Yaro, Goldman Sachs: Asked about partner ramp-up time. Tannenbaum indicated, \"in general, that's roughly what we see\" at about three months, with partner diversity impacting ramp time. Kgil added existing partners also contribute significantly to growth.</li>\n<li>Unknown Analyst: Requested an update on securitization for HELOC and new products. Kgil stated that AAA ratings earned in Q3 and Q4 have helped gain on sale premium and that new products require seasoning before securitization. Tannenbaum clarified auto loans via Agora would not be held on Figure's balance sheet.</li>\n<li>Kyle Peterson, Needham: Inquired about private credit jitters and crypto-backed loan performance. Kgil reported no change in demand for Figure loans, stating jitters are \"really on the commercial loans rather than these residential mortgage type of loans.\" Tannenbaum said, \"zero losses in crypto-backed loans to date.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts generally expressed positive sentiment, with phrases like \"very impressive as always\" and \"I echo the congrats on the strong execution.\"</li>\n<li>Management maintained a confident and forward-looking tone in prepared remarks, emphasizing structural milestones and growth, but addressed headwinds and product mix changes directly and in detail.</li>\n<li>The tone in Q&amp;A was more probing on structural metrics and growth sustainability, with management providing detailed and occasionally clarifying responses. Management confidence remained steady compared to the previous quarter, with emphasis on operational progress and future opportunity.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance on net take rate shifted from \"stable around 4%\" in Q3 to a range of 3.5%-4% in Q4, with management citing product mix changes, especially increased auto and first lien loans.</li>\n<li>Strategic focus broadened, with new partnerships highlighted (Agora Data, Newtek), and a stronger emphasis on scaling third-party asset volume.</li>\n<li>Analysts' questions in Q4 focused more heavily on monetization, product mix, and margin durability, compared to Q3’s focus on partner growth and product road map.</li>\n<li>Management maintained a confident tone in both quarters, but expanded on operational details and risk mitigation in Q4, especially regarding security incidents and product expansion.</li>\n<li>Key metrics such as loan volume, net revenue, and adjusted EBITDA continued strong growth, but with a noticeable emphasis on capital-light scalability and margin sustainability in Q4.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management disclosed a security incident affecting 12,400 customer records, clarified as a phishing attack not related to blockchain infrastructure, and stated, \"the incident is not expected to have a material impact on our financial results.\"</li>\n<li>Product mix changes could lead to lower take rates, with Kgil noting, \"auto... these are shorter-term loans, and they're going to have a different type of profile and different types of buyers that come into Connect Marketplace.\"</li>\n<li>Seasonal declines in home-based lending were noted but offset by growth in new products and partners.</li>\n<li>Analyst concerns centered on take rate stability, volume growth sustainability, and risks from private credit volatility, all addressed by management as manageable within Figure’s operating model.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Management emphasized that Figure’s transition to a capital-light marketplace is accelerating, supported by robust marketplace volume, expanding asset classes, and the integration of blockchain-based solutions across its ecosystem. Strategic partnerships and product launches are expected to drive further growth, while the company remains focused on margin durability, operational efficiency, and long-term profitability, with a strong balance sheet and disciplined capital allocation supporting continued innovation and expansion.</p>\n<p><a href=\"https://seekingalpha.com/symbol/figr/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558379-figure-technology-solutions-outlines-capital-light-growth-strategy-with-3_5-percentminus-4",
            "pub_date": "2026-02-27 08:01:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558373",
            "title": "MP Materials swings to Q4 profit but sales slow after halting rare earth sales to China",
            "description": "<html><body><p data-eci=\"true\">MP Materials (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MP\" title=\"MP Materials Corp.\">MP</a></span>) -3% post-market Thursday after posting better-than-expected <a href=\"https://seekingalpha.com/news/4558176-mp-materials-non-gaap-eps-of-0_09-beats-by-0_07-revenue-of-52_69m-misses-by-6_14m\" target=\"_self\" title=\"Q4 adjusted earnings\">Q4 adjusted earnings</a> but a 13.6% Y/Y decline in revenues to <span>$52.7M, following its decision to stop shipping rare earths to China for processing as part of its agreement with the U.S. government.</span></p>\n<p><span>Last year, the Pentagon took a 15% stake in MP (<a href=\"https://seekingalpha.com/symbol/MP\" title=\"MP Materials Corp.\">MP</a>) as part of a deal in which the company agreed to build a new factory to make rare earth magnets; in return, MP ended all sales to China, which resulted in no revenue recognized from rare earth concentrate during the quarter, causing the overall decline in revenue, the company said.</span></p>\n<p><span>MP (<a href=\"https://seekingalpha.com/symbol/MP\" title=\"MP Materials Corp.\">MP</a>) nevertheless </span><span>swung to a Q4 profit of $9.4M, or $0.05/share, from a loss of $22.3M, or $0.14/share, in the year-earlier quarter, while adjusted EPS came in at $0.09.</span></p>\n<p><span>The company <a href=\"https://www.bloomberg.com/news/articles/2026-02-26/mp-materials-inks-rare-earths-supply-deal-with-mystery-automaker\" rel=\"nofollow\" target=\"_self\" title='signed an \"enormous\" contract'>signed an \"enormous\" contract</a> with \"one of America's leading industrial and technology companies\" to supply NdPr oxide, a key material used to build motors, <span>CEO </span>James Litinsky said in its earnings conference call, according to Bloomberg, without providing additional details about the size of the contract.</span></p>\n<p><span>MP (<a href=\"https://seekingalpha.com/symbol/MP\" title=\"MP Materials Corp.\">MP</a>) controls the only rare earths mine in North America and processes those critical minerals in California; it has also built a magnet facility in Texas, and the company </span><span><a href=\"https://seekingalpha.com/news/4557867-mp-materials-selects-texas-site-for-new-rare-earth-magnet-manufacturing-campus\" target=\"_self\" title=\"said earlier Thursday\">said earlier Thursday</a> it plans to spend more than $1.25B to build a second large-scale rare earth magnet manufacturing campus in Texas, which is expected to come online in 2028.</span></p>\n<p><span>\"<span>The engagement in the supply chain is very high right now. We're having a lot of conversations,\" Litinsky said on the call. \"It would be natural to conclude that there will be a number\" of supply deals from the new \"10X\" manufacturing plant in Texas.</span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558373-mp-materials-swings-to-q4-profit-but-sales-slow-after-halting-rare-earth-sales-to-china",
            "pub_date": "2026-02-27 08:01:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558377",
            "title": "Permian Resources signals 5% production growth and $1.85B CapEx for 2026 while raising dividend",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Permian Resources Corporation (PR) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>\"We set records across every key operational metric in Q4, including our highest oil production, lowest D&amp;C cost per foot and lowest controllable cash cost in PR's history,\" stated Co-CEO William Hickey. He highlighted free cash flow per share rose 18% year-over-year to $1.94, with meaningful debt reduction and a plan for continued free cash flow per share growth in 2026.</li>\n<li>Hickey emphasized Q4 oil production of 188,600 barrels per day and total production of 401,500 barrels of oil equivalent per day, citing a reduced D&amp;C cost per foot to $700, and $481 million in cash CapEx for the quarter. Adjusted operating cash flow reached $884 million, and adjusted free cash flow was $403 million in Q4.</li>\n<li>The company is increasing its 2026 quarterly base dividend to $0.16 per share, a 7% rise. Hickey stated, \"Since inception in '22, Permian Resources has grown its quarterly base dividend at a 40% CAGR, reflecting the company's commitment to delivering a sustainable and growing base dividend.\"</li>\n<li>On acquisitions, Co-CEO James Walter noted, \"During Q4, we closed on approximately 140 transactions totaling $240 million... We completed approximately $1.1 billion of acquisitions during the year, adding about 250 locations and 13,000 BOE a day within our existing operating areas.\"</li>\n<li>CFO Guy Oliphint reported, \"Our guidance is kind of consistent with what we've discussed before. We thought '26 will be low. We thought '27 will be low based on strip, and that's all played out. So based on where we are today, we don't see ourselves being a full cash taxpayer until '28 or beyond.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>For full year 2026, management expects total production to average 415,000 BOE per day and oil production to average 189,000 barrels per day, with CapEx of $1.85 billion, including approximately $400 million in non-D&amp;C spend. Walter stated, \"Overall, this plan delivers production in 2026 that is approximately 5% higher than 2025 for CapEx that is $120 million lower.\"</li>\n<li>The company anticipates continued cost improvements, with anticipated 2026 D&amp;C costs of $675 per foot, approximately 20% cheaper than in 2024.</li>\n<li>Walter indicated, \"Our sole focus today is on increasing free cash flow per share and creating long-term value for investors.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>In Q4, oil production reached 188,600 barrels per day, total production was 401,500 BOE per day, and D&amp;C cost per foot was $700. Cash CapEx was $481 million for the quarter and $1.97 billion for the year.</li>\n<li>Q4 LOE was $5.26 per BOE, cash G&amp;A was $0.80 per BOE, and GP&amp;T was $1.18 per BOE.</li>\n<li>Adjusted operating cash flow was $884 million and adjusted free cash flow was $403 million in Q4.</li>\n<li>Free cash flow per share increased 18% year-over-year to $1.94 in 2025, and debt was reduced by over $600 million during the year.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Kevin MacCurdy, Pickering Energy Partners Insights: Asked about PR's approach to free cash flow per share growth. Walter responded that their strategy has focused on both organic and inorganic growth, citing inventory quality and basin maturity as differentiators.</li>\n<li>MacCurdy followed up on capital allocation in 2026. Walter explained, \"Our plan is to use every tool we've got in the toolkit... capital allocation really is all of the above, and we don't see any need to kind of limit or restrict ourselves going forward.\"</li>\n<li>Neal Dingmann, William Blair: Asked about the ground game and PR's confidence in ongoing M&amp;A. Walter said, \"Our ground game, the small blocking and tackling stuff has been remarkably consistent for a decade... we're definitely still seeing opportunities that make a lot of sense.\"</li>\n<li>John Freeman, Raymond James: Questioned reinvestment rate and macro environment influence. Walter indicated a cautious approach to growth in 2026 due to macro uncertainty, but noted PR has the inventory base to accelerate growth when conditions warrant.</li>\n<li>Scott Hanold, RBC: Inquired about D&amp;C cost reduction levers. Hickey pointed to ongoing efforts to cut drilling days, referencing potential savings by matching Midland Basin operators' drilling speeds.</li>\n<li>Zachary Parham, JPMorgan: Asked about well productivity expectations. Hickey stated, \"We have a very consistent development plan... PR's consistent free cash flow per share growth proves strong execution can overcome commodity price volatility.\"</li>\n<li>Other topics included gas marketing strategies, lateral lengths, ancillary business potential, and capital structure.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed for clarity on growth strategy, capital allocation, and cost reductions, with mostly constructive but probing questions. Several sought to understand PR's confidence in M&amp;A and ability to source deals amid a competitive market.</li>\n<li>Management's tone was confident and consistent, frequently emphasizing repeatable performance, disciplined capital allocation, and cost leadership. Multiple statements reflected certainty, such as Hickey's: \"I can say with real confidence that for the next 4 to 5 years, I think this is what you should expect to see.\"</li>\n<li>Compared to the previous quarter, management maintained a steady tone, but with increased emphasis on cost advantages and long-term free cash flow growth. Analyst tone remained neutral to slightly positive, focusing on sustainability and scalability of PR’s strategy.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance detail increased in Q4, with explicit 2026 production and CapEx outlook, compared to a more cautious, macro-dependent tone in Q3.</li>\n<li>The focus on cost structure, capital efficiency, and M&amp;A remained central, but Q4 brought greater specificity on dividend growth and acquisition activity.</li>\n<li>Key metrics such as oil production, total production, and free cash flow per share were higher in Q4, and management described more aggressive debt reduction and cost improvement.</li>\n<li>Management's confidence in sustaining low costs, production growth, and free cash flow was more pronounced in Q4 than in Q3.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management noted macro uncertainty around oil prices and service costs as a factor in holding back production growth for 2026.</li>\n<li>Walter acknowledged potential challenges in the gas market, but cited recent gas marketing agreements as mitigating factors.</li>\n<li>Analysts raised questions about the competitiveness of federal lease sales, inflation in non-D&amp;C CapEx, and the potential for cash taxes in future years, with management stating, \"We don't see ourselves being a full cash taxpayer until '28 or beyond.\"</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Permian Resources’ management underscored a record-setting fourth quarter and outlined a 2026 plan featuring 5% production growth, $1.85 billion in CapEx, and a rising base dividend. With sustained operational execution, a robust acquisition pipeline, and disciplined cost control, the company expects to maximize free cash flow per share and maintain its leadership in the Delaware Basin. Management remains confident in delivering long-term value to shareholders through a flexible and opportunistic capital allocation strategy while navigating macroeconomic uncertainties.</p>\n<p><a href=\"https://seekingalpha.com/symbol/pr/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558377-permian-resources-signals-5-percent-production-growth-and-1_85b-capex-for-2026-while-raising",
            "pub_date": "2026-02-27 07:50:48",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558378",
            "title": "Marcus Corporation outlines $50M–$55M capital spending plan for 2026 with focus on free cash flow and strategic investments",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Marcus Corporation (MCS) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li><p>Chad Paris, CFO &amp; Treasurer, reported, \"we generated consolidated revenues of $193.5 million, a 2.8% increase compared to the fourth quarter last year, with revenue growth in both divisions.\" He highlighted a $5.2 million noncash impairment charge in theaters and noted, \"excluding the charges, our fourth quarter operating income was $6.9 million, growing 5.2% compared to operating income of $6.6 million in the fourth quarter of fiscal 2024.\" Paris also referenced a $7.6 million income tax benefit from historic tax credits related to the Hilton Milwaukee renovation.</p></li>\n<li><p>Paris stated, \"for fiscal 2026, we expect total capital expenditures of $50 million to $55 million based on our current portfolio of assets, with approximately $25 million to $30 million in hotels and $20 million to $25 million in theaters.\" He indicated a significant decrease in capital spending compared to prior years, aiming for increased free cash flow to be allocated to growth investments and capital returns.</p></li>\n<li><p>Gregory S. Marcus, President, CEO &amp; Chairman, emphasized, \"we exit the year with good momentum. And as we look ahead to 2026, we're encouraged by the growth opportunities that we see ahead.\" Marcus detailed strategic actions in theaters including price optimization, digital ticketing improvements, concession enhancements, and the expansion of the Marcus Movie Club loyalty program. He highlighted strong market share in family-oriented films and pointed to a robust upcoming movie slate for 2026 and 2027.</p></li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li><p>Paris expects a meaningful step down in capital expenditures for 2026 after a heavy reinvestment cycle, with anticipated total capital expenditures of $50 million to $55 million. He stated, \"we expect this decrease in capital expenditures to result in a significant increase in free cash flow in 2026, which will be allocated to opportunistic growth investments and returning capital to shareholders.\"</p></li>\n<li><p>Marcus projected optimism for the theater division in 2026, noting, \"the current slate has a stronger mix of tent-pole films and the grossing potential of 2026 franchises is greater based on their historical predecessor box office performances.\" For hotels, Paris communicated expectations for \"low single-digit RevPAR growth, led by modest growth in group business and steady leisure and business travel.\"</p></li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li><p>Paris reported fourth quarter consolidated adjusted EBITDA of $26.8 million, up 3.6% year over year. Full-year adjusted EBITDA was $99.3 million, a 3.1% decrease. He noted, \"cash flow from operations was $48.8 million in the fourth quarter of fiscal 2025 compared to $52.6 million in the prior year quarter,\" citing unfavorable working capital changes.</p></li>\n<li><p>The Theater division delivered total revenue of $123.8 million for the quarter, up 2.2% from the prior year, while the Hotels and Resorts division achieved revenues before cost reimbursements of $60.4 million, a 5% increase. The company repurchased approximately 118,000 shares in Q4, totaling over 1.1 million shares for the full year and returning nearly $28 million in capital to shareholders since Q3 2024.</p></li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li><p>Eric Wold, Texas Capital Securities, asked about theater pricing strategies for 2026. Paris responded, \"I don't see big changes to our programs prospectively. Again, we're trying to be very thoughtful about customer sensitivity to price changes, and we do want to continue to drive attendance.\"</p></li>\n<li><p>Wold inquired about hotel segment leisure and group booking trends. Paris explained, \"Group overall remains healthy. And as we've said a few times over the last few months or a few quarters, our renovated properties are winning really well with groups.\"</p></li>\n<li><p>Michael Hickey asked about growth prospects and free cash flow leverage. Marcus replied, \"We're very focused on, as you know, our pricing strategies and making sure that our prices are market appropriate and that we're offering the right product to the right customer.\" Paris added, \"our free cash flow conversion on that is going to be very strong.\"</p></li>\n<li><p>Hickey pressed on M&amp;A appetite. Marcus noted, \"we continue to actively search for opportunities to deploy capital to grow our businesses, and we are disciplined in our approach.\"</p></li>\n<li><p>Andrew Crum questioned occupancy rate softness. Paris clarified, \"occupancy in the fourth quarter last year did get a benefit from a bunch of group business related to the election...It is very much a mix story that is market-specific and at times even property specific.\"</p></li>\n<li><p>Patrick Sholl inquired about capital allocation and M&amp;A underwriting differences. Paris remarked, \"the challenge consistently has been the leases at some of these locations...it really requires a more of a ground game in looking and doing onesie, twosie type deals.\"</p></li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li><p>Analysts maintained a constructive but probing tone, focusing on pricing strategy, capital allocation, and growth prospects, with lines of questioning reflecting cautious optimism but a desire for clarity on M&amp;A and capital deployment.</p></li>\n<li><p>Management’s tone in prepared remarks was confident and forward-looking. During Q&amp;A, they remained measured, emphasizing discipline and adaptability, with Paris stating, \"we're trying to be very thoughtful about customer sensitivity to price changes.\"</p></li>\n<li><p>Compared to the previous quarter, analyst sentiment remained steady, while management’s tone shifted from acknowledging mixed divisional performance to highlighting renewed momentum and optimism for 2026.</p></li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li><p>The fourth quarter featured a return to revenue and earnings growth in both divisions, reversing the softer theater performance and mixed results noted in the previous quarter.</p></li>\n<li><p>Guidance language shifted from caution about film slates and leisure demand to greater optimism about upcoming content and renovated hotel properties.</p></li>\n<li><p>Analysts continued to focus on capital allocation, M&amp;A, and pricing, while management’s confidence increased, citing \"good momentum\" and \"growth opportunities.\"</p></li>\n<li><p>Key metrics improved in both divisions, with market share gains in theaters and outperformance in hotel RevPAR compared to competitive sets.</p></li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li><p>Paris highlighted that noncash impairment charges in theaters impacted operating income.</p></li>\n<li><p>Management acknowledged the ongoing challenge of product supply and variable film performance, with Marcus indicating, \"the difference between a decent year and what would have been considered a great success was essentially 1 or 2 films that didn't hit as expected.\"</p></li>\n<li><p>Analyst questions raised concerns about occupancy softness, M&amp;A execution barriers related to leases, and market-specific hotel demand.</p></li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Marcus Corporation closed 2025 with revenue growth and industry outperformance in both theaters and hotels, supported by strategic pricing, digital enhancements, and successful property renovations. Looking to 2026, management expects a notable reduction in capital expenditures to $50 million–$55 million, positioning the company for increased free cash flow, continued shareholder returns, and disciplined pursuit of growth investments amid a robust upcoming film slate and steady hotel demand.</p>\n<p><a href=\"https://seekingalpha.com/symbol/mcs/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558378-marcus-corporation-outlines-50m-55m-capital-spending-plan-for-2026-with-focus-on-free-cash",
            "pub_date": "2026-02-27 07:50:48",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558365",
            "title": "Paramount wins the bidding war for Warner Bros. as Netflix walks away",
            "description": "<html><body><p data-eci=\"true\"><span>Netflix (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a></span>) announced that it will not raise its bid for </span><span>Warner Bros. Discovery</span><span> (<a href=\"https://seekingalpha.com/symbol/WBD\" title=\"Warner Bros. Discovery, Inc.\">WBD</a>) after the media giant's board deemed a sweetened, all‑company takeover offer from </span><span>Paramount Skydance</span><span> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a></span>) as \"superior.\" </span></p>\n<p><span>The streaming company said a higher price for Warner Bros. (<a href=\"https://seekingalpha.com/symbol/WBD\" title=\"Warner Bros. Discovery, Inc.\">WBD</a>) was no longer financially attractive. The revised Paramount (<a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a>) offer was at a purchase price of $31.00 per share in cash, a one-dollar increase from its earlier bid, which valued the company at around $108B.</span></p>\n<p><span>\"This year, we'll invest approximately $20 billion in quality films and series and will expand our entertaining offering. Consistent with our capital allocation policy, we'll also resume our share repurchase program,\" read a statement from Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>).</span></p>\n<p><span>Shares of Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>) soared 10.2% in postmarket trading as investors looked at the development as a positive. Warner Bros. Discovery (<a href=\"https://seekingalpha.com/symbol/WBD\" title=\"Warner Bros. Discovery, Inc.\">WBD</a>) fell 2.2% in the late session, while Paramount Skydance (<a href=\"https://seekingalpha.com/symbol/PSKY\" title=\"Paramount Skydance Corporation\">PSKY</a>) was 3.8% higher.</span></p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558365-paramount-wins-the-bidding-war-for-warner-bros-as-netflix-walks-away",
            "pub_date": "2026-02-27 07:41:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558376",
            "title": "Service Properties Trust outlines $500M-$520M adjusted EBITDAre guidance for 2026 amid continued asset sales and debt reduction",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Service Properties Trust (SVC) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Christopher Bilotto, President and CEO, highlighted the completion of hotel sales and active steps to reduce leverage, stating, \"During the quarter, we sold 66 hotels totaling nearly 8,300 keys for $534 million.\" He emphasized that the company used proceeds and cash on hand to redeem all $800 million of 2026 debt maturities and $300 million of February 2027 notes, adding, \"We remain focused on selling additional hotels and executing further strategies to improve SVC's cash flows, debt maturity profile and overall cost of capital.\"</li>\n<li>Bilotto announced the sale of Simply Suites for $7.1 million and the marketing of 9 focused service hotels and 7 full-service Sonesta managed hotels, aiming for total proceeds of $175 million to $200 million, with the sales expected to increase annual EBITDA by about $13 million and improve leverage metrics.</li>\n<li>The CEO detailed a new $745 million, 5-year mortgage financing, secured by the net lease master trust, with an expected annual cash savings of $14 million or $0.08 per share due to a lower interest rate.</li>\n<li>Bilotto noted, \"SVC's portfolio continued to deliver steady top line growth as RevPAR increased 70 basis points year-over-year, outpacing the broader industry by 180 basis points and representing the fifth consecutive quarter of outperformance.\"</li>\n<li>The appointment of Keith Pierce and Jeff Leer as Co-CEOs of Sonesta, effective April 1, was announced, with Bilotto stating, \"We believe their leadership and experience will be instrumental in further optimizing Sonesta RevPAR market share performance while driving operational discipline.\"</li>\n<li>Jesse Abair, Vice President, reported that 2025 acquisitions totaled $101 million, with a net lease portfolio of 760 properties and annual base rents of $390 million, noting an average rent coverage of 2.7x and a 97% lease rate. He stated, \"Annualized base rent increased 2.4%, largely a function of our recent acquisition activity.\"</li>\n<li>Brian Donley, CFO, said, \"Normalized FFO was $27.5 million or $0.17 per share, flat compared to the prior year quarter. Adjusted EBITDAre decreased $5 million year-over-year to $125.6 million.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>SVC introduced full year 2026 guidance, projecting RevPAR of $108 to $113 and hotel EBITDA of $124 million to $144 million for 94 hotels owned at year-end. Net lease NOI is expected between $380 million and $386 million.</li>\n<li>Consolidated adjusted EBITDAre is forecasted at $500 million to $520 million, with normalized FFO per share of $0.65 to $0.77. CapEx is projected at $120 million to $140 million, with free cash flow generation after CapEx anticipated for 2026.</li>\n<li>Management noted, \"This guidance does not reflect the impact of completing 17 Sonesta hotel dispositions, and it assumes $25 million of capital recycling in our net lease portfolio.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>For Q4 2025, normalized FFO was $27.5 million or $0.17 per share, and adjusted EBITDAre was $125.6 million.</li>\n<li>Comparable hotel RevPAR rose by 70 basis points, while the gross operating profit margin declined by 370 basis points to 20.5%.</li>\n<li>The hotel portfolio generated adjusted hotel EBITDA of $21.3 million, a 35% decrease year-over-year, attributed to elevated labor and overhead costs, and the absence of prior year business interruption insurance.</li>\n<li>At quarter-end, debt stood at $5.2 billion with a weighted average interest rate of 5.95%.</li>\n<li>CapEx for Q4 was $106 million, with a full year total of $238 million, including major projects at the Nautilus in Miami and other Sonesta properties.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Jackson Armstrong, Wells Fargo: Asked about RevPAR trends and the width of guidance. Brian Donley responded, \"We're tracking in line, if not exceeding our projections for the full year guidance,\" citing portfolio volatility and citywide events as reasons for the broader guidance range.</li>\n<li>Armstrong: Inquired about the strategic shift in net lease acquisitions. Christopher Bilotto explained, \"The $25 million guidance will be supported by sales of net lease properties, so kind of net 0 in that standpoint.\"</li>\n<li>Armstrong: Sought expense growth detail. Donley said, \"Overall, to the midpoint, just top line is a little over 4% expectation on growth. The bottom line, we're seeing around 6% and a big part of that is labor.\"</li>\n<li>Armstrong: Questioned the impact of new Sonesta management. Bilotto stated, \"Certainly, with this management team coming in... we view it as a positive... I think they'll do just that.\"</li>\n<li>Tyler Batory, Oppenheimer: Asked about RevPAR and portfolio quality. Donley indicated, \"The guidance and the growth trajectory, the midpoint RevPAR is around $110, which is a 3% RevPAR growth.\"</li>\n<li>Batory: Probed margin and CapEx outlook. Donley detailed, \"$120 million to $140 million is a big step for us. The pace of large significant renovations are winding down. The Nautilus is definitely the biggest piece of this year.\"</li>\n<li>Batory: Asked about debt headroom and maturities. Donley responded, \"Not a lot of headroom for a large transaction, but... the 0 coupons are already secured by assets.\"</li>\n<li>John Massocca, B. Riley: Focused on hotel dispositions and EBITDA impact. Bilotto confirmed, \"The 9 focused service that are part of the 16 we're in the market with are the carryover from 2025.\"</li>\n<li>Massocca: Asked about EBITDA mix and unencumbered assets. Donley replied, \"It's not too far off from high-60s to low-30s from an EBITDA mix.\"</li>\n<li>Massocca: Sought clarification on net lease coverage. Bilotto said, \"The coverage drop is largely a function of TA coverage dropping 7 basis points quarter-over-quarter... But in the meantime... those leases are backed by BP credit.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts maintained a neutral tone, with questions focused on guidance ranges, the impact of leadership changes, and capital deployment. There was a persistent emphasis on expense pressures, asset sales, and debt management, but without overt skepticism or negative language.</li>\n<li>Management's tone in prepared remarks was cautiously optimistic, highlighting \"continued progress\" and \"momentum\" while acknowledging challenges such as \"elevated labor costs\" and \"operational disruption.\" During the Q&amp;A, responses remained measured, with confidence in strategy but no overstatement of positive outcomes. Phrases like \"we feel confident\" and \"we believe\" indicated a balanced outlook.</li>\n<li>Compared to the previous quarter, both management and analysts maintained a similar pragmatic stance, with management slightly more upbeat about the impact of recent asset sales and refinancing, while analysts continued to press on execution and margin risks.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 is more detailed, with explicit projections for RevPAR, hotel EBITDA, net lease NOI, and adjusted EBITDAre, whereas Q3 focused more on near-term asset sales and debt reduction.</li>\n<li>The pace of hotel dispositions continued, but there is a clear shift toward winding down large-scale CapEx and focusing on free cash flow generation, versus Q3's emphasis on major renovations and capital deployment.</li>\n<li>Analyst questions in both quarters centered on asset sales, debt strategy, margin outlook, and CapEx discipline, but Q4 saw increased focus on execution timing for asset sales and the impact of Sonesta's new management.</li>\n<li>Management's confidence increased regarding the transition to a stronger debt profile and the benefits of recent refinancing, while reiterating caution on labor and operational costs.</li>\n<li>The shift in strategic priorities is evident in the more conservative net lease acquisition target and a deliberate reduction in hotel CapEx.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited \"elevated labor costs and broader operating expense pressures\" and \"temporary operational disruption\" from hotel dispositions as headwinds.</li>\n<li>The CEO cautioned about \"the impact of the prolonged government shutdown\" and \"value-conscious customers remain sensitive to broader macroeconomic conditions.\"</li>\n<li>The net lease portfolio's coverage ratio saw a small drop, attributed to the TA assets, though these are backed by BP's credit.</li>\n<li>Analysts raised concerns about the breadth of RevPAR guidance, margin pressures from labor and benefits, and the execution risk of planned asset sales.</li>\n<li>Management's mitigation strategies included targeting hotel sales to improve EBITDA, focusing on high-performing renovated assets, and using proceeds to reduce debt and interest costs.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Service Properties Trust's fourth quarter call outlined continued portfolio optimization, major debt reduction initiatives, and a cautious approach to capital deployment. Management signaled confidence in achieving $500 million to $520 million in adjusted EBITDAre for 2026 and expects free cash flow generation following a period of elevated capital investment. The company plans to further reduce leverage through targeted asset sales, focus on operational discipline, and maintain a stable net lease platform, while remaining attentive to cost pressures and market volatility.</p>\n<p><a href=\"https://seekingalpha.com/symbol/svc/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558376-service-properties-trust-outlines-500m-520m-adjusted-ebitdare-guidance-for-2026-amid",
            "pub_date": "2026-02-27 07:41:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558371",
            "title": "Indivior outlines 30% adjusted EBITDA growth target for 2026 with new $400M share repurchase program",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Indivior Pharmaceuticals, Inc. (INDV) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li><p>CEO Joseph Ciaffoni stated that 2025 was a transition year, highlighting the successful completion of Phase I Generate Momentum and the delivery of record net revenue for SUBLOCADE of $856 million, a 13% increase versus 2024, and total net revenue of $1.24 billion, up 4% from the prior year. He emphasized, \"We improved our commercial execution and generated momentum for SUBLOCADE, delivering record net revenue in 2025 of $856 million, a 13% increase versus 2024 and total net revenue of $1.24 billion, representing a 4% increase compared to the prior year.\" Ciaffoni announced the completion of the $295 million DOJ obligation payment and introduced a new $400 million share repurchase program. He described the shift to Phase II of the Indivior Action agenda, Accelerate, projecting accelerated SUBLOCADE dispense unit growth and net revenue in 2026, with immediate growth in adjusted EBITDA and cash flow.</p></li>\n<li><p>Chief Commercial Officer Patrick Barry reported, \"In the fourth quarter, we delivered strong dispense unit growth of 12% versus the prior year and 6% versus the third quarter. New patient starts in the fourth quarter were up 25% year-over-year.\" Barry noted record levels in active SUBLOCADE prescribers and outlined improvements in field force messaging, commercial channel productivity, patient activation, and policy engagement.</p></li>\n<li><p>CFO Ryan Preblick stated, \"We delivered on our financial commitments in 2025. We grew total SUBLOCADE net revenue by 13% and adjusted EBITDA by 20% year-over-year, and we simplified the organization while strengthening our financial profile.\" Preblick also highlighted the authorization of the new $400 million share repurchase program and reaffirmed 2026 financial guidance.</p></li>\n</ul>\n<h3>Outlook</h3>\n<ul><li>The company reaffirmed 2026 guidance with total net revenue expected in the range of $1.125 billion to $1.195 billion, reflecting a modest decline at the midpoint due to anticipated SUBOXONE Film pressure and lower international revenue. SUBLOCADE net revenue is projected between $905 million and $945 million, representing 8% growth at the midpoint. Adjusted EBITDA is expected between $535 million and $575 million, a 30% increase at the midpoint, with margin expansion to 48%. Operating expenses are guided between $430 million and $450 million. Ciaffoni said, \"We expect to deliver SUBLOCADE dispense unit growth in the mid-teens, an acceleration compared to the 7% dispense unit growth we achieved in 2025.\"</li></ul>\n<h3>Financial Results</h3>\n<ul><li>Fourth quarter total net revenue reached $358 million, up 20% year-over-year, led by SUBLOCADE net revenue of $252 million for the quarter, a 30% increase. Full year SUBLOCADE dispense volume grew 7%. Adjusted EBITDA for Q4 increased 91% to $142 million, and for the full year rose 20% to $428 million with a 500 basis point margin improvement. Fourth quarter operating expenses were $164 million; full year operating expenses totaled $622 million, both down versus the prior year. The company ended the year with $222 million in gross cash and investments after settling the DOJ obligation.</li></ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li><p>David Amsellem, Piper Sandler: Asked about LAI buprenorphine penetration, market share, and capital deployment priorities. Ciaffoni responded that LAI penetration is at 9%, with analogs in schizophrenia suggesting potential for 20% to 30%. He emphasized a focus on new patient share and stated, \"From a share perspective, we have seen over many quarters, our market share stabilizing in the mid-70%.\" On capital deployment, Ciaffoni emphasized targeting commercial-stage assets with over $200 million peak sales potential and a long runway; \"We're looking for assets that have peak sales potential of greater than $200 million.\"</p></li>\n<li><p>Chase Knickerbocker, Craig-Hallum: Inquired about assumptions behind 2026 guidance and capital allocation between buybacks and M&amp;A. Ciaffoni said, \"We're assuming mid-teens SUBLOCADE growth,\" and Preblick explained, \"We authorized the $400 million program to be ready to be prepared to buy back shares and be opportunistic.\"</p></li>\n<li><p>Yuchen Ding, Jefferies: Asked about Medicaid funding risks and SG&amp;A trends. Ciaffoni avoided specifics on DTC spend and Medicaid outlook for 2027 but noted current penetration leaves ample room for growth regardless of Medicaid fluctuations. Preblick clarified the Q4 SG&amp;A step-up was due to the DTC campaign, with relatively flat expense phasing in 2026.</p></li>\n<li><p>Christian Glennie, Stifel: Clarified reconciliation of SUBLOCADE guidance and impacts from gross-to-net. Ciaffoni said, \"In 2025, gross to net served as a tailwind. In 2026, gross to net will serve as a headwind to the business.\"</p></li>\n<li><p>Brandon Folkes, H.C. Wainwright: Asked about the criminal justice system's role in guidance. Barry responded the segment is \"a rebased business\" contributing to overall expected growth.</p></li>\n<li><p>Thibault Boutherin, Morgan Stanley: Asked about ex-U.S. SUBLOCADE and R&amp;D impacts. Preblick indicated rest-of-world SUBLOCADE revenue will be \"relatively flat year-over-year,\" with growth in Australia and Canada offset by the Nordics. Heidbreder detailed timelines for two Phase II trial readouts and outlined criteria for potential Phase III advancement.</p></li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li><p>Analysts pressed on growth drivers, market share, capital deployment, Medicaid risk, SG&amp;A, and the reconciliation of guidance metrics, reflecting a neutral to slightly positive tone with several requests for clarification on strategic priorities and market opportunity.</p></li>\n<li><p>Management maintained a confident and disciplined tone, particularly around SUBLOCADE’s growth prospects, capital deployment, and cost controls. Phrases such as \"we are confident\" and \"we expect\" were prevalent in prepared remarks, while responses in Q&amp;A avoided specifics but underscored strategic focus and financial discipline.</p></li>\n<li><p>Compared to the previous quarter, analyst sentiment remains consistent, with continued focus on growth levers, commercial execution, and cost management. Management’s confidence appears to have increased, with stronger emphasis on financial strength and capital allocation optionality.</p></li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li><p>Guidance language has shifted from projecting growth to reaffirming specific 2026 financial targets, including an 8% SUBLOCADE net revenue growth midpoint and 30% adjusted EBITDA growth. Strategic focus has moved from completing organizational simplification to emphasizing commercial acceleration and capital deployment.</p></li>\n<li><p>Analysts maintain focus on SUBLOCADE growth drivers and market share, while also probing capital allocation and operating cost discipline. Key metrics such as SUBLOCADE net revenue and adjusted EBITDA show acceleration from previous guidance.</p></li>\n<li><p>Management’s tone is more assertive and confident, referencing the completion of Phase I and a pivot to Phase II Accelerate, with greater clarity on share repurchase and M&amp;A strategy. Analysts’ tone remains questioning but constructive, seeking greater detail on execution and risk factors.</p></li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li><p>Management highlighted gross-to-net headwinds in 2026, the expected decline in SUBOXONE Film revenue, and potential volatility in Medicaid funding as areas of concern. Ciaffoni stated, \"At 8%, 9% long-acting injectable penetration, there is so much opportunity for growth with SUBLOCADE across the board, inclusive of Medicaid, it will not be impacted whether Medicaid population is plus or minus a certain percentage.\"</p></li>\n<li><p>Analysts asked about the impact of Medicaid funding, the reconciliation of guidance metrics, and the role of the criminal justice system. Management’s responses stressed the underutilization of long-acting injectables and a broad opportunity for SUBLOCADE growth.</p></li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Indivior’s leadership outlined a clear transition from organizational restructuring to commercial acceleration in 2026, underpinned by a new share repurchase program and guided by targeted investment in SUBLOCADE and potential business development. The company projects mid-teens SUBLOCADE unit growth, 8% net revenue growth for the product, and a 30% increase in adjusted EBITDA, supported by ongoing cost controls and a disciplined capital allocation strategy. Management’s confidence in SUBLOCADE’s durability and the company’s financial strength sets the stage for executing on Phase II of its action agenda.</p>\n<p><a href=\"https://seekingalpha.com/symbol/indv/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558371-indivior-outlines-30-percent-adjusted-ebitda-growth-target-for-2026-with-new-400m-share",
            "pub_date": "2026-02-27 07:30:47",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558372",
            "title": "Ellington Financial targets further portfolio growth and liability optimization through expanded securitization and strategic acquisitions",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Ellington Financial Inc. (EFC) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Laurence Penn, CEO, opened the call stating, \"Ellington Financial closed out 2025 on a high note, capping a year of consistently strong performance, portfolio growth and liability optimization.\" He highlighted that adjusted distributable earnings (ADE) of $0.47 per share \"continued to substantially exceed our dividends,\" and attributed results to \"exceptional performance and execution in our loan origination and securitization platforms with outsized contributions once again from our Longbridge segment.\" </li>\n<li>Penn announced a $400 million unsecured notes offering, describing it as \"our largest to date, marking a significant step forward in the evolution of our capital structure.\" He explained that proceeds were partly used to reduce short-term repo financing and further expand the investment portfolio by 9%. </li>\n<li>Penn detailed the completion of seven securitizations in Q4, including the first residential transition loans (RTL) securitization with a revolving structure, and the first agency-eligible mortgage securitization post year-end, expanding the EFMT branded shelf to five residential loan sectors. He emphasized, \"this expansion allows us to term out financing across all of our major residential loan strategies on a nonrecourse, non-mark-to-market basis... further enhancing balance sheet resilience and capital efficiency.\" </li>\n<li>Penn revealed a targeted common equity raise in January 2026, sized precisely to redeem the highest-cost Series A preferred stock. \"The coupon on our Series A preferred stock was over 9%. So starting tomorrow... our common shareholders will immediately see the benefit of a lower overall cost of capital.\"</li>\n<li>CFO JR Herlihy stated, \"For the fourth quarter, we reported GAAP net income of $0.14 per common share on a fully mark-to-market basis and ADE of $0.47 per share.\" He added, \"Net interest income increased sequentially and we also generated net realized and unrealized gains on non-QM retained tranches and forward MSR-related investments.\" </li>\n<li>Herlihy noted, \"Unencumbered assets... increased 45% to $1.77 billion, which was about 90% -- 95% of total equity.\" He also said, \"the share of long-term non-mark-to-market financings increased to 30% from 17% and the share of unsecured borrowings increased to 18% from 8%.\"</li>\n<li>Co-Chief Investment Officer Mark Tecotzky reported, \"We continue to execute our loan origination to securitization playbook, completing 7 securitizations in Q4 across a variety of loan types and that momentum has carried into 2026.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management stated, \"Our priorities for 2026 are clear. We are focused on growing our loan origination market share while maintaining strong credit performance, which, together with our securitization platform should drive disciplined portfolio growth.\"</li>\n<li>Penn indicated, \"We are estimating that EFC generated an economic return of approximately 2% in January, with loan production and portfolio growth remaining strong, particularly in our non-QM, commercial mortgage bridge and reverse mortgage loan businesses.\"</li>\n<li>Penn highlighted the pending acquisition of a small residential mortgage servicer, which \"will further enhance our vertical integration by bringing more servicing capabilities in-house, especially for delinquent assets.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>The company reported GAAP net income of $0.14 per common share and ADE of $0.47 per share for Q4.</li>\n<li>Portfolio income breakdown as stated by Herlihy: $0.35 per share from Credit, $0.04 from Agency, and $0.15 from Longbridge.</li>\n<li>ADE breakdown: $0.61 per share from the Investment Portfolio segment and $0.13 from the Longbridge segment.</li>\n<li>The adjusted long credit portfolio increased 15% to $4.1 billion quarter-over-quarter.</li>\n<li>Unencumbered assets grew 45% to $1.77 billion; recourse debt-to-equity ratio was 1.9:1 (up from 1.8:1); overall debt-to-equity ratio increased to 9:1 from 8.6:1.</li>\n<li>Book value per share at year-end was $13.16; economic return for Q4 was 4.6% annualized.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Douglas Harter, UBS: Asked about the decision to buy the servicer and whether it changes asset appetite or is about optimizing the existing portfolio. Mark Tecotzky responded that consolidation in the servicing industry left few high-touch servicing options and stated, \"our plan is to build out the technology with the servicer,\" aiming for \"best-in-class protocols and best-in-class workflow.\" Penn clarified, \"Owned within EFC.\"</li>\n<li>Harter followed up on whether the servicer could serve third parties. Tecotzky replied, the initial focus is on building technology and protocols for EFC, with potential to serve others later.</li>\n<li>An analyst from BTIG asked about repo conditions for retained tranches. Tecotzky explained, \"Repo market functioned extremely well... Financing spreads on retained tranches are... relatively low.\" He noted, \"we tend to operate the company very conservatively when it comes to repo\" and do not plan to add more leverage to those tranches.</li>\n<li>Trevor Cranston, Citizens JMP, inquired about Agency-eligible market policy risks. Tecotzky described monitoring for LLPA and G-fee changes, noting, \"a fairly significant change... would be needed to swing the pendulum back over to GSE execution.\"</li>\n<li>Francesco Labetti, KBW, asked about origination competition and margins. Tecotzky stated, \"the market is always competitive, but... you could still price things with the margin and retain things at attractive yields.\" Penn added about reverse mortgages: \"Longbridge is... always in the top 3 originators in the HECM space... margins are excellent and volumes are... quite steady and growing.\"</li>\n<li>Labetti also asked about bank capital standards and mortgage market activity. Tecotzky observed, \"bank support for the mortgage market in 2025\" was \"shockingly underwhelming,\" expecting potential changes from new regulations.</li>\n<li>Timothy D'Agostino, B. Riley, asked for top 2026 priorities. Penn prioritized covering the dividend, strengthening liability structure, supporting originator affiliates, managing delinquencies, and portfolio growth. Herlihy added, \"leverage has actually declined... from 2.3 to 1.9\" while portfolio size doubled in two years.</li>\n<li>Jason Weaver, JonesTrading, prompted on future leverage and securitization pace. Herlihy responded, \"intra-quarter... recourse debt to equity, it fluctuates,\" but projected more expansion with \"additional unsecured note offerings.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts' tone was neutral to slightly positive, focusing on execution details, risk mitigation, and strategic priorities. Questions were probing but not adversarial, with a consistent focus on portfolio growth, capital structure, and servicing integration.</li>\n<li>Management maintained a confident, constructive tone, emphasizing resilience, adaptability, and proactive capital optimization. Penn and Tecotzky frequently referenced deliberate strategic actions and disciplined risk management, using phrases such as \"we continue to execute\" and \"we are focused on growing.\"</li>\n<li>Compared to the previous quarter, both analysts and management showed increased confidence, especially around balance sheet strength and vertical integration, while remaining attentive to market risks.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance language shifted to emphasize continued earnings strength into 2026, portfolio expansion, and vertical integration through the pending servicer acquisition.</li>\n<li>The previous quarter's emphasis on deploying note proceeds and adding agency-eligible mortgage exposure evolved into concrete securitization activity and broader liability optimization this quarter.</li>\n<li>Analysts' focus moved from questions about deployment of new capital and non-QM growth to more detailed queries on servicing strategy, leverage, and competitive positioning.</li>\n<li>Management's tone turned more proactive regarding capital structure and strategic acquisitions, with explicit reference to dividend coverage consistency and expanded technology initiatives.</li>\n<li>Key metrics such as ADE per share and portfolio size remained strong, though net income per share declined from Q3 to Q4.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited \"heightened policy uncertainty, potential restrictions on institutional purchases of single-family rentals, GSE reductions, LLPA changes and mortgage insurance premium cuts\" as ongoing risks.</li>\n<li>Tecotzky highlighted challenges with bank loans and a modest drag from the CLO portfolio, as well as underperformance in RTL due to securitization costs and REO workouts, though \"delinquencies there remain quite manageable.\"</li>\n<li>The company is monitoring the housing market for \"broader signs of weakness\" and maintaining significant credit hedges.</li>\n<li>Analysts questioned the competitive environment, credit risk, and impact of regulatory shifts, with management emphasizing conservative leverage and risk management protocols.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Ellington Financial's fourth quarter showcased robust portfolio expansion, effective capital structure optimization, and enhanced vertical integration initiatives. Management highlighted consistent dividend coverage by distributable earnings, a strengthened liability profile through increased non-mark-to-market and unsecured financing, and strategic moves into servicing. The company's focus on disciplined growth, risk management, and technology-backed origination positions it for continued resilience and earnings stability into 2026, while remaining vigilant to evolving market and policy risks.</p>\n<p><a href=\"https://seekingalpha.com/symbol/efc/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558372-ellington-financial-targets-further-portfolio-growth-and-liability-optimization-through",
            "pub_date": "2026-02-27 07:30:47",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558362",
            "title": "TotalEnergies inks 20-year offtake deal with Alaska LNG project",
            "description": "<html><body><p data-eci=\"true\">TotalEnergies (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a></span>) said Thursday it <a href=\"https://totalenergies.com/news/press-releases/united-states-totalenergies-signs-agreement-export-2-mtpa-lng-20-years-alaska\" rel=\"nofollow\" target=\"_self\" title=\"signed\">signed</a> a <span>preliminary agreement</span> to purchase 2M metric tons/year of liquefied natural gas for 20 years from Glenfarne's Alaska LNG project, <span>marking another step toward commercializing the proposed 20M tons/year export facility.</span></p>\n<p><span>The letter of intent was signed at a ceremony in Washington, D.C., with Alaskan elected officials in attendance.</span></p>\n<p><span>\"<span>The Alaska LNG project is indeed very well geographically positioned to better serve our Asian customers,\" TotalEnergies (<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a>) Chairman and CEO Patrick Pouyanne said. \"It also illustrates TotalEnergies' ambition to consolidate its position as a leading buyer of U.S. LNG while diversifying its supply sources.\"</span></span></p>\n<p><span><span>TotalEnergies (<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a>) said the deal is subject to the project's final investment decision, which Glenfarne said would happen when it contracts for 16M tons/year for the project.</span></span></p>\n<p><span><span>Glenfarne said it now has 13M tons/year covered under preliminary long-term agreements with TotalEnergies (<a href=\"https://seekingalpha.com/symbol/TTE\" title=\"TotalEnergies SE\">TTE</a>), JERA, Tokyo Gas, CPC, PTT and Posco.</span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558362-totalenergies-inks-20-year-offtake-deal-with-alaska-lng-project",
            "pub_date": "2026-02-27 07:20:48",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558363",
            "title": "Chesapeake Utilities reaffirms $7.75–$8 EPS target for 2028 as it launches $75M ERP transformation and advances Florida rate case",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Chesapeake Utilities Corporation (CPK) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Jeffrey Householder, President, CEO &amp; Chairman, highlighted \"2025 was our 19th consecutive year of earnings growth,\" with adjusted earnings of $6.01 per share, a 12% increase over 2024. He emphasized, \"We invested $470 million through 2025, a 32% increase over our 2024 capital spend and $20 million above our 2025 guidance range.\" Above-average residential growth of 3% was cited as the primary driver for the capital program, and nearly 11,000 new customers were added in 2025 across natural gas and electric areas. He announced, \"We're initiating full year 2026 capital expenditure guidance of $450 million to $500 million... including successful completion of a number of projects and initiating construction on a new set of opportunities.\"</li>\n<li>Householder introduced a new technology transformation, stating, \"We're undertaking the largest technology system implementation in our history with our multiyear enterprise resource plan or ERP... which we're calling 1CORE is going to be bigger and even more transformational than anything we've done thus far.\"</li>\n<li>He also announced the Delmarva Regional Enhancement project with an estimated capital investment of $75 million and an in-service date around the end of 2028, and a $6.5 million grant-backed feasibility study for new Virginia infrastructure.</li>\n<li>Beth Cooper, Executive VP, CFO, Treasurer &amp; Assistant Corporate Secretary, stated, \"We generated approximately $639 million of adjusted gross margin, $141 million of adjusted net income and $6.01 of adjusted earnings per share in 2025, all representing double-digit increases over full year 2024.\" She added, \"We ended 2025 at an equity capitalization of 50%, meeting the goal we set at the start of the year, 3 years ahead of the target.\" She reaffirmed the 2028 adjusted EPS range of $7.75 to $8 per share and long-term growth target of 8%.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>The company reaffirmed its 2028 adjusted EPS guidance of $7.75 to $8 per share and outlined a 2026 capital plan of $450 million to $500 million. Cooper reiterated, \"We are reaffirming our 2028 adjusted EPS range of $7.75 to $8 per share as we remain on track to meet our long-term adjusted EPS growth target of 8%.\"</li>\n<li>Management discussed the upcoming general rate case for Florida City Gas, with expectations for interim rates by early July 2026 and an improved allowed ROE.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Cooper reported, \"Adjusted net income was up 16%, which translated into a 12% increase in adjusted EPS after we purposely advanced our equity to total capitalization ratio back to 50%.\" Regulated segment adjusted gross margin was $494 million in 2025, a 12% increase over 2024, and regulated operating income rose 13% to approximately $222 million.</li>\n<li>The unregulated segment delivered $145 million in adjusted gross margin, up 13% year-over-year, with Marlin Gas Services driving $11 million of additional gross margin.</li>\n<li>Dividend policy was highlighted, with an annualized dividend per share of $2.74, a 7% increase from 2024, and a payout ratio enabling 54% of earnings to be retained for reinvestment.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Michael Brown, Barclays: Asked for a walk-through of the growth rate from 2025 to 2028. Cooper replied, \"We have reaffirmed our 2028 EPS guidance... we've historically provided long-term EPS guidance given some of the capital expenditures that we incur... our long-term EPS CAGR of 8%.\"</li>\n<li>Christopher Ellinghaus, Siebert Williams Shank: Inquired about weather impacts in Q1 and growth in FCG customers. Cooper responded, \"In Delaware, there will certainly be an impact, and we've begun to quantify the first part of that for January... there will also be some, to your point, that may come from certainly the propane side as well down there.\"</li>\n<li>Ellinghaus also asked about ERP benefits. Householder explained, \"There are opportunities on the customer service side... reducing the number of calls to our call centers, automatic meter reading... significant opportunities there.\"</li>\n<li>Paul Fremont, Ladenburg: Asked about adjusted gross margin from Marlin and RNG projects. Cooper clarified, \"The line that you're looking at is actually a compilation of Marlin, Full Circle Dairy and our Noble RNG project... a big part of the growth... is actually coming more from Marlin.\"</li>\n<li>Alexis Kania, BTIG: Sought color on Delmarva growth and FCG debt refinancing. Cooper said, \"We continue to actually see strong growth in Delaware... there's a lot of planned also infrastructure growth, particularly in the Southern County of Delaware.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts raised detailed questions regarding growth rates, weather impacts, project specifics, and regulatory developments, reflecting a neutral to slightly positive tone, with interest in sustainability of growth and cost controls.</li>\n<li>Management maintained a confident tone in both prepared remarks and Q&amp;A, consistently reaffirming guidance and capital plans. Householder and Cooper provided detailed responses and emphasized execution of strategic priorities, using language such as \"We remain committed\" and \"We are reaffirming our... guidance.\"</li>\n<li>Compared to the previous quarter, management's tone remains confident, with analysts maintaining a neutral stance, shifting to more granular questions about capital allocation and regulatory risks.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The company moved from annual EPS guidance for 2025 in Q3 to reaffirming only long-term 2028 EPS targets in Q4, while providing a specific 2026 capital expenditure range.</li>\n<li>Strategic focus shifted to accelerating technology transformation with the 1CORE ERP launch and highlighting new major projects (Delmarva Regional Enhancement and Virginia infrastructure study), compared to Q3’s focus on ongoing projects and regulatory filings.</li>\n<li>Analysts in Q4 concentrated on long-term outlook, regulatory events, and operational details, versus Q3’s focus on immediate guidance and project throughput.</li>\n<li>Key metric changes include a reported 12% full-year EPS growth and achieving a 50% equity capitalization target three years ahead of schedule.</li>\n<li>Management’s confidence remained high, with repeated emphasis on execution and growth, while analysts continued to probe for clarity on operational and regulatory developments.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited the Florida City Gas depreciation study outcome as a headwind, stating, \"We were unable to repeat [the RSAM benefit] given the outcome of the Florida City Gas depreciation study.\"</li>\n<li>Cooper noted increased operating expenses and financing costs partially offsetting margin gains, but highlighted ongoing operational efficiencies.</li>\n<li>Regulatory risk is present with the upcoming Florida City Gas rate case, as Moriarty indicated surprise at the regulatory outcome and the need to file a general rate case after unexpected delays.</li>\n<li>Analysts questioned the impact of weather on earnings, customer growth variance across regions, and the ability to achieve planned cost savings from ERP investment.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Chesapeake Utilities closed 2025 with record financial results, strong customer growth, and the achievement of its equity capitalization goal well ahead of schedule. Management reaffirmed its long-term EPS growth targets and capital investment plans while preparing for major technology transformation and regulatory filings in 2026. The company sees continued expansion opportunities in its core and new markets and remains focused on operational efficiency, prudent capital allocation, and engaging with stakeholders to support sustained earnings and dividend growth.</p>\n<p><a href=\"https://seekingalpha.com/symbol/cpk/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558363-chesapeake-utilities-reaffirms-7_75-8-eps-target-for-2028-as-it-launches-75m-erp",
            "pub_date": "2026-02-27 07:15:59",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}