{
    "data": [
        {
            "id": "4403570",
            "title": "LNG shipping rates sink as vessel availability increases",
            "description": "<html><body><p>Shipping costs for liquefied natural gas cargoes have <a href=\"https://www.reuters.com/business/energy/lng-shipping-rates-plunge-increasing-vessel-availability-2025-02-05/\" rel=\"nofollow\" target=\"_self\" title=\"fallen to five-year lows\">fallen to five-year lows</a> as newly built carriers added to the global fleet outstrip shipping demand and shorter average journey times have increased vessel availability, Reuters reported Wednesday.</p> <p>Atlantic freight rates assessed<span class=\"paywall-full-content invisible\"> for vessels with two-stroke engines capable of carrying 174K cm of LNG, the most common type in the market, were at $4,250/day on Tuesday, after prices on Friday sank to $3,500/day, the lowest in data going back five years, according to pricing agency Spark Commodities.</span></p> <p class=\"paywall-full-content invisible\">Atlantic rates are down 82% YTD and have plunged more than 90% from the same time last year, and rates for the same class of ship on Pacific routes have been cut nearly in half so far this year, dropping to $11,000/day on Tuesday, the lowest ever for Spark's dataset and down nearly 80% in the past year.</p> <p class=\"paywall-full-content invisible\">For the older but still common vessel with tri-fuel diesel engines carrying 160K cm of LNG, Atlantic rates were negative for the past week, hitting a record low of minus $2,750/day on Monday before paring losses to reach minus $1,000/day on Tuesday, Spark said.</p> <p class=\"paywall-full-content invisible\">\"Negative round-trip freight rates indicate that shipowner earnings don't fully cover the fuel expenses associated with ballasting their vessel back to load port for a round-trip voyage in the Atlantic basin,\" Spark Commodities analyst Qasim Afghan told Reuters.</p> <p class=\"paywall-full-content invisible\">Higher delivered prices in Europe also incentivized U.S. cargoes to remain in the Atlantic versus travelling to Asia, increasing vessel availability as it results in shorter average journey times, Afghan said, noting that at least six LNG cargoes were diverted from Asia to Europe in January.</p> <p class=\"paywall-full-content invisible\">Potentially relevant stock tickers include (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/GLNG\" title=\"Golar LNG Limited\">GLNG</a></span>), (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TK\" title=\"Teekay Corporation Ltd.\">TK</a></span>), (<a href=\"https://seekingalpha.com/symbol/TNK\" title=\"Teekay Tankers Ltd.\">TNK</a>), (<a href=\"https://seekingalpha.com/symbol/TOPS\" title=\"Top Ships Inc.\">TOPS</a>), (CPLP), (<a href=\"https://seekingalpha.com/symbol/DHT\" title=\"DHT Holdings, Inc.\">DHT</a>), (<a href=\"https://seekingalpha.com/symbol/FRO\" title=\"Frontline plc\">FRO</a>), (<a href=\"https://seekingalpha.com/symbol/KEX\" title=\"Kirby Corporation\">KEX</a>), (<a href=\"https://seekingalpha.com/symbol/CCEC\" title=\"Capital Clean Energy Carriers Corp.\">CCEC</a>), (<a href=\"https://seekingalpha.com/symbol/TEN\" title=\"Tsakos Energy Navigation Limited\">TEN</a>), (<a href=\"https://seekingalpha.com/symbol/DLNG\" title=\"Dynagas LNG Partners LP Common Units\">DLNG</a>)</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1409358751/image_1409358751.jpg",
            "link": "https://seekingalpha.com/news/4403570-lng-shipping-rates-sink-as-vessel-availability-increases",
            "pub_date": "2025-02-05 18:53:17",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403580",
            "title": "Twin Disc sees 23.2% sales growth in Q2 2025, driven by Katsa acquisition and Veth products",
            "description": "<html><body><p>Earnings Call Insights: Twin Disc, Incorporated (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/TWIN\" title=\"Twin Disc, Incorporated\">TWIN</a></span>) Q2 2025</p> <h3>Management View</h3> <ul> <li>CEO John Batten highlighted strong double-digit sales growth, with $89.3 million in revenue, reflecting a 23.2% year-over-year increase. Significant contributions came from the Katsa Oy acquisition, which expanded the company’s engineering capabilities and global footprint. Batten<span class=\"paywall-full-content invisible\"> emphasized the importance of cross-selling opportunities and optimizing shared cost efficiencies.</span> </li> <li class=\"paywall-full-content invisible\">Marine and Propulsion sales grew 23.9% year-over-year, driven by robust demand for Veth products, particularly in electric, hybrid, and conventional propulsion systems. Increased government defense spending also supported demand for patrol boats in response to geopolitical conflicts.</li> <li class=\"paywall-full-content invisible\">Land-based transmissions saw a 19.8% year-over-year increase, supported by demand for advanced configurations in the airport rescue and firefighting transmission business. The industrial segment posted 44.8% growth, benefiting from both the Katsa acquisition and a rebound in Lufkin orders.</li> <li class=\"paywall-full-content invisible\">CFO Jeff Knutson reported a 5% increase in gross profit to $21.7 million but noted a decline in gross profit margins from 28.3% to 24.1%, primarily due to inventory write-downs and unfavorable product mix.</li> <li class=\"paywall-full-content invisible\">Knutson stated, \"Operating cash generation of $4.3 million was strong in the quarter, and EBITDA increased to $6.3 million, up 13.5% compared to the second quarter of fiscal 2024.\"</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management remains optimistic about sustained growth, citing a healthy backlog across end markets despite a sequential and year-over-year decline due to high shipments. Batten stated the focus will remain on \"disciplined inventory management\" and exploring additional strategic acquisitions.</li> <li>Continued emphasis on electrification and hybrid propulsion systems was highlighted as a key growth driver, with Batten noting that these efforts position Twin Disc to address evolving customer needs.</li> <li>Knutson outlined a capital expenditure outlook of $12 million to $14 million for the fiscal year and reaffirmed the goal of converting 60% of EBITDA to free cash flow, though he acknowledged it might be a stretch due to challenges in Q1.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Revenue for the second quarter reached $89.3 million, up 23.2% from the prior year, with $10 million attributed to the Katsa acquisition. On an organic basis, revenue increased by 10.1%.</li> <li>Net income for the quarter was $900,000, or $0.07 per diluted share, compared to a net loss of $900,000, or ($0.07) per share, in Q2 2024.</li> <li>Gross margin decreased by 420 basis points year-over-year due to inventory rationalization costs associated with Katsa, along with unfavorable product mix.</li> <li>EBITDA improved to $6.3 million, an increase of 13.5% from Q2 2024. Operating cash flow reached $4.3 million, reflecting disciplined cost management.</li> <li>Net debt increased to $9 million, driven by the acquisition of Katsa, and the company ended the quarter with $15.9 million in cash.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Simon Wong, Gabelli Funds: \"Can you quantify how much of your oil and gas business was down year-over-year?\" CFO Jeff Knutson: \"It was about a little under 8% of revenue for the quarter and down about 24% compared to the prior year Q2.\"</li> <li>Wong: \"Is the increased quoting activity in oil and gas primarily from North America?\" Knutson: \"It's both North America, Asia, and also some South American activity.\"</li> <li>Wong: \"Are you still targeting 60% EBITDA conversion to free cash flow?\" Knutson: \"Yes, though it might be a stretch this year given Q1 challenges, but we’re on a good trend now following Q2.\"</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed cautious optimism, focusing on oil and gas segment declines, free cash flow targets, and R&amp;D commercialization timelines. Their tone was neutral to slightly positive as they sought clarity on growth areas and operational challenges.</li> <li>Management maintained a confident tone during prepared remarks, highlighting strategic initiatives and operational progress. In the Q&amp;A, Knutson's responses were measured but optimistic, acknowledging challenges while emphasizing recovery and future opportunities.</li> <li>Compared to the previous quarter, management appeared more upbeat regarding operational improvements, though analysts maintained similar levels of caution.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Revenue grew significantly from $72.9 million in Q1 to $89.3 million in Q2, driven by stronger contributions from Katsa and improved demand for Veth products.</li> <li>Gross margin declined from 26.5% in Q1 to 24.1% in Q2 due to inventory write-downs and unfavorable product mix.</li> <li>Analysts' focus shifted from inventory buildup in Q1 to free cash flow targets and oil and gas segment challenges in Q2.</li> <li>Management's tone improved from acknowledging Q1 challenges to emphasizing recovery and strategic progress in Q2.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management cited macroeconomic headwinds in the Asia-Pacific region and subdued oil and gas new builds in North America as ongoing challenges.</li> <li>Gross margin pressures from inventory rationalization and unfavorable product mix were highlighted as key financial risks.</li> <li>Analysts raised concerns about the company’s ability to meet free cash flow targets and the pace of recovery in oil and gas markets.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Twin Disc reported strong revenue growth in Q2 2025, backed by the Katsa acquisition and robust demand for marine and propulsion products. While gross margins faced pressure from inventory rationalization and product mix, the company emphasized operational improvements and strategic investments in electrification and hybrid systems. Free cash flow targets remain a challenge, but management expressed confidence in achieving long-term growth through disciplined cost management and market expansion.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/TWIN/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403580-twin-disc-sees-23_2-percent-sales-growth-in-q2-2025-driven-by-katsa-acquisition-and-veth",
            "pub_date": "2025-02-05 18:55:33",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403559",
            "title": "Bio-Techne spikes as Q2 growth accelerates amid improving market conditions",
            "description": "<html><body><p>Shares of Bio-Techne Corporation (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/TECH\" title=\"Bio-Techne Corporation\">TECH</a></span>) traded higher after the life sciences company topped analysts' expectations with its Q2 FY25 results, indicating a faster topline growth amid early signs of recovery in the <a href=\"https://seekingalpha.com/news/4403371-bio-techne-non-gaap-eps-of-042-beats-by-004-revenue-of-297m-beats-by-1158m\">biopharma end market.</a></p> <p>Minneapolis, Minnesota-based Bio-Techne (<span class=\"ticker-hover-wrapper\">NASDAQ:<a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/TECH\" title=\"Bio-Techne Corporation\">TECH</a></span><span class=\"paywall-full-content invisible\">), which offers life sciences reagents and equipment to serve research, diagnostics, and bioprocessing markets, witnessed tepid growth in fiscal 2023 and 2024 as COVID-driven demand for its products came to an end.</span></p> <p class=\"paywall-full-content invisible\">However, according to its Q2 FY25 results, its revenue for the quarter reached $297.0M, implying ~9% YoY growth, up from ~5% YoY and ~2% YoY growth in Q1 FY25 <a href=\"https://seekingalpha.com/symbol/TECH/income-statement\" rel=\"noopener\" target=\"_blank\">and Q4 FY24, respectively.</a></p> <p class=\"paywall-full-content invisible\">Bio-Techne’s (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/TECH\" title=\"Bio-Techne Corporation\">TECH</a></span>) Protein Sciences Segment, which generates more than 70% of the company’s top line and caters to cell and gene therapy developers, brought in $211.6M with ~7% YoY growth, outperforming TECH’s Diagnostics and Spatial Biology Segment, which grew ~12% YoY.</p> <p class=\"paywall-full-content invisible\">\"It is encouraging to see early signs of improvement in the biopharma end-market, which was evident in our cell and gene therapy and protein analysis instrumentation businesses,” Bio-Techne (<a href=\"https://seekingalpha.com/symbol/TECH\" title=\"Bio-Techne Corporation\">TECH</a>) CEO Kim Kelderman remarked.</p> <p class=\"paywall-full-content invisible\">Meanwhile, the Protein Sciences segment's operating margin also increased to ~41% YoY from ~40% in the year-ago quarter, driven by a volume increase, and TECH’s overall operating margin climbed to ~16% from ~14% in Q2 FY24.</p> <p class=\"paywall-full-content invisible\">“Our portfolio plays a key role in the healthy aging of global populations. The combination of this unique portfolio with the talented Bio-Techne team positions the company for continued differentiated financial <a href=\"https://seekingalpha.com/pr/19991990-bio-techne-releases-second-quarter-fiscal-2025-results#hasComeFromMpArticle=false\" rel=\"noopener\" target=\"_blank\">performance,” Kelderman added.</a></p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2157258075/image_2157258075.jpg",
            "link": "https://seekingalpha.com/news/4403559-bio-techne-stock-spikes-q2-fy25-beat",
            "pub_date": "2025-02-05 18:49:40",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403573",
            "title": "Match Group targets $3.5B total revenue for 2024, with focus on AI and product innovation",
            "description": "<html><body><p>Earnings Call Insights: Match Group (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/MTCH\" title=\"Match Group, Inc.\">MTCH</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li><p>CEO Spencer Rascoff emphasized his enthusiasm for joining Match Group, highlighting the company's mission to connect people and its potential for AI-driven business growth. He stated that AI advancements could create a<span class=\"paywall-full-content invisible\"> significant business inflection, similar to the transition from desktop to mobile. </span></p></li> <li class=\"paywall-full-content invisible\"><p>Gary Swidler, President and CFO, noted that Q4 and full-year 2024 results slightly exceeded expectations due to a strong start to the peak dating season. He reiterated the company's focus on leveraging AI to improve user experience and achieve long-term growth, describing 2025 as a \"critical year for execution.\"</p></li> <li class=\"paywall-full-content invisible\"><p>Steven Bailey, incoming CFO, reported total revenue of $3.5 billion for 2024, a 3% year-over-year increase (6% on an FX-neutral basis). He highlighted achieving the full-year AOI margin target of 36% despite lower-than-expected revenue growth earlier in the year. Bailey also emphasized plans to return at least 100% of free cash flow to shareholders through dividends and share repurchases. </p></li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management reaffirmed their commitment to their financial goals outlined at Investor Day, including driving steadily improving revenue growth, three points of AOI margin expansion by 2027, and strong free cash flow generation.</p></li> <li><p>The company anticipates gradually improving year-over-year revenue trends throughout 2025, supported by new user growth at Tinder and Hinge, planned product and monetization initiatives, and a solid start to the dating season.</p></li> <li><p>Swidler noted that Q1 2025 revenue expectations are influenced by stabilizing but still-negative trends in Tinder's MAU and planned trust and safety initiatives. Hinge's revenue growth is expected to strengthen in the year's second half as user growth remains robust.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Match Group reported total revenue of $3.5 billion for 2024, with a 3% year-over-year increase. The full-year AOI margin target of 36% was achieved.</p></li> <li><p>Tinder's direct revenue was impacted by MAU declines and delayed monetization initiatives. However, the company remains optimistic about new product features to be rolled out in 2025.</p></li> <li><p>Hinge delivered strong performance in 2024, with robust user growth and monetization progress. Management expects Hinge to add a similar quantum of revenue in 2025 as it did in 2024.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Ross Sandler, Barclays: Asked about Rascoff's motivation for joining Match Group. Rascoff highlighted his alignment with the company's mission and the potential for AI to transform online dating.</p></li> <li><p>Benjamin Black, Deutsche Bank: Inquired about the leadership transition and strategic continuity. Rascoff assured a smooth transition and reiterated his full support for the company's financial targets.</p></li> <li><p>Curtis Nagle, Bank of America: Questioned the Q1 2025 revenue guide and the disconnect with initial dating season trends. Steven Bailey explained that while new user trends were solid, immediate revenue impact is modest, with a larger impact expected later in the year.</p></li> <li><p>Jason Helfstein, Oppenheimer: Asked about monetization strategies for Tinder and Hinge. Management emphasized their focus on maximizing total revenue rather than specific metrics like revenue per payer.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Analysts expressed cautious optimism, with questions focusing on leadership changes, monetization strategies, and product innovation.</p></li> <li><p>Management maintained a confident tone, emphasizing their commitment to financial goals and the potential of AI-driven innovations. Rascoff's personal investment in Match Group stock underscored his belief in the company's growth prospects.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li><p>The Q4 2024 call highlighted a stronger focus on AI and product innovation compared to Q3, with management emphasizing the role of new initiatives in driving long-term growth.</p></li> <li><p>Leadership changes were a prominent theme this quarter, with Rascoff stepping in as CEO and Bailey as CFO. This marks a shift in strategic oversight, with renewed urgency and accountability.</p></li> <li><p>Analysts' questions in Q4 were more forward-looking, reflecting interest in 2025 revenue trajectories and product roadmaps, compared to Q3's focus on immediate challenges.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management acknowledged that Tinder's MAU trends remain a challenge, with stabilizing but still-negative growth. Trust and safety initiatives are expected to have short-term impacts on user base and revenue.</p></li> <li><p>Analysts raised concerns about the execution of new product initiatives and their potential to drive meaningful revenue growth, particularly at Tinder.</p></li> <li><p>FX headwinds were mentioned as a factor impacting revenue and margins, particularly at Tinder.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Match Group delivered solid Q4 and full-year 2024 results, driven by a strong start to the peak dating season. CEO Spencer Rascoff and incoming CFO Steven Bailey emphasized AI-driven innovation, trust and safety initiatives, and product development as key priorities for 2025. While Tinder's challenges persist, Hinge's growth trajectory remains robust. Management reaffirmed their commitment to financial targets and long-term shareholder value creation.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/MTCH/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403573-match-group-targets-3_5b-total-revenue-for-2024-with-focus-on-ai-and-product-innovation",
            "pub_date": "2025-02-05 18:43:14",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403569",
            "title": "Tempur Sealy plans to change its name Somnigroup International after officially swallowing up Mattress Firm",
            "description": "<html><body><p> </p> <p>Tempur Sealy International (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TPX\" title=\"Tempur Sealy International, Inc.\">TPX</a></span>) announced on Wednesday that it has completed its previously announced acquisition of Mattress Firm Group, which is the nation's largest mattress specialty retailer.</p> <p>The total purchase price for the deal was approximately $5 billion. The transaction was<span class=\"paywall-full-content invisible\"> funded by approximately $2.7 billion of cash consideration and 34.2 million shares of common stock. The cash payment was funded using a combination of cash on hand and proceeds from existing borrowings.</span></p> <p class=\"paywall-full-content invisible\">As part of the closing, the Lexington, Kentucky-based company announced it will change its official name to Somnigroup International Inc. on February 18 and trade under the stock symbol SGI. Mattress Firm, Dreams, and Tempur Sealy will operate as decentralized business units under Somnigroup International. Mattress Firm and Dreams will continue to operate as multi-branded retailers and Tempur Sealy, primarily a manufacturer, will continue to serve third-party retailers as well as Mattress Firm, Dreams and Tempur Sealy direct-to-consumer channels. </p> <p class=\"paywall-full-content invisible\">In terms of financial expectations, Tempur Sealy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/TPX\" title=\"Tempur Sealy International, Inc.\">TPX</a></span>) highlighted that it generated approximately $8 billion in sales over the previous twelve months on a pro forma basis, net of intercompany sales.</p> <p class=\"paywall-full-content invisible\">Tempur Sealy (<a href=\"https://seekingalpha.com/symbol/TPX\" title=\"Tempur Sealy International, Inc.\">TPX</a>) CEO Scott Thompson said the addition of Mattress Firm will unlock incremental benefits for all stakeholders by accelerating the company's U.S. omnichannel strategy. \"This transaction creates a leading global bedding company with extensive manufacturing capabilities and a broader U.S. retail footprint. Together, the companies are positioned to facilitate enhanced product innovation, improve the customer buying experience, and ensure high-quality, durable products are brought to market,\" he highlighted.</p> <p class=\"paywall-full-content invisible\">In connection with the closing, TPX is expanding its board through the appointment of Peter Sachse, who was noted to bring more than 30 years of executive leadership experience in retail, including serving as CEO of Tailored Brands.</p> <p class=\"paywall-full-content invisible\">The company expects to complete the previously announced divestiture of 73 Mattress Firm retail locations and the Sleep Outfitters subsidiary, which includes 103 specialty mattress retail locations and seven distribution centers, to MW SO Holdings in the second quarter.</p> <p class=\"paywall-full-content invisible\">Shares of Tempur Sealy (<a href=\"https://seekingalpha.com/symbol/TPX\" title=\"Tempur Sealy International, Inc.\">TPX</a>) are up 28% on a year-to-date basis.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/623476890/image_623476890.jpg",
            "link": "https://seekingalpha.com/news/4403569-tempur-sealy-plans-to-change-its-name-somnigroup-international-after-officially-swallowing-up-mattress-firm",
            "pub_date": "2025-02-05 18:43:46",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403571",
            "title": "3 out of the 7 ‘Magnificent Stocks’ are the worst performers year-to-date",
            "description": "<html><body><p class=\"MsoNormal\">Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>), Apple (<a href=\"https://seekingalpha.com/symbol/AAPL\" title=\"Apple Inc.\">AAPL</a>), and Microsoft (<a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a>) are this year’s top worst performers so far, at -13.13%, -8.95%, and -2.51% respectively, within the Global X Dow 30 (<span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/DJIA\" title=\"Global X Dow 30 Covered Call ETF\">DJIA</a></span>).</p> <p class=\"MsoNormal\">International Business Machines (<a href=\"https://seekingalpha.com/symbol/IBM\" title=\"International Business Machines Corporation\">IBM</a>) is the best performer so far, up 18.61%; followed<span class=\"paywall-full-content invisible\"> by 3M (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/MMM\" title=\"3M Company\">MMM</a><span class=\"paywall-full-content invisible\">), up 16.23%; and JPMorgan &amp; Chase (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/JPM\" title=\"JPMorgan Chase &amp; Co.\">JPM</a><span class=\"paywall-full-content invisible\">), up 11.31%.</span></p> <p class=\"MsoNormal paywall-full-content invisible\">In addition, only six Dow (<span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/DJIA\" title=\"Global X Dow 30 Covered Call ETF\">DJIA</a></span>) stocks are up more than 10% year-to-date, also including Amgen (<a href=\"https://seekingalpha.com/symbol/AMGN\" title=\"Amgen Inc.\">AMGN</a>), up 10.83%; Goldman Sachs (<a href=\"https://seekingalpha.com/symbol/GS\" title=\"The Goldman Sachs Group, Inc.\">GS</a>), up 10.43%; and Walmart (<a href=\"https://seekingalpha.com/symbol/WMT\" title=\"Walmart Inc.\">WMT</a>), up 10.17%.</p> <p class=\"MsoNormal paywall-full-content invisible\">Another “Magnificent Seven” stock – Amazon (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>) – is up 8.22%.</p> <p class=\"MsoNormal paywall-full-content invisible\">Here is the full 30 stocks’ performance:</p> <p class=\"MsoNormal paywall-full-content invisible\"> </p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><a href=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/6c045cb698919d656c80a5591fe7790d.png\" rel=\"lightbox\"><img alt=\"Global X Dow 30 performance\" data-caption=\"Global X Dow 30 performance\" data-original-src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/6c045cb698919d656c80a5591fe7790d.png\" data-source=\"Bespoke Investment Group via X.com\" height=\"1082\" src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/6c045cb698919d656c80a5591fe7790d.png?io=getty-c-w900\" width=\"867\"/></a><figcaption class=\"overlay-title\"><p class=\"item-caption\">Global X Dow 30 performance<span class=\"item-source\"> (Bespoke Investment Group via X.com) </span></p></figcaption></figure><p class=\"paywall-full-content invisible\"> </p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1322897616/image_1322897616.jpg",
            "link": "https://seekingalpha.com/news/4403571-3-out-of-the-7-magnificent-stocks-are-the-worst-performers-year-to-date",
            "pub_date": "2025-02-05 18:36:36",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403572",
            "title": "Atmos Energy signals FY 2025 EPS guidance of $7.05-$7.25 amid strong customer growth",
            "description": "<html><body><p>Earnings Call Insights: Atmos Energy Corporation (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ATO\" title=\"Atmos Energy Corporation\">ATO</a></span>) Q1 2025</p> <h3>Management View</h3> <ul> <li>CEO Kevin Akers highlighted that Q1 2025 net income reached $352 million, or $2.23 per diluted share. Capital spending for the quarter amounted to $891 million, focused on system modernization and growth, with over 59,000 new<span class=\"paywall-full-content invisible\"> customers added in the past year.</span> </li> <li class=\"paywall-full-content invisible\">Akers emphasized the strong economic backdrop in Texas, where over 46,000 new customers were added, supported by continued job growth in the region. Additionally, 11 new industrial customers were added, expected to utilize 2.3 Bcf of gas annually.</li> <li class=\"paywall-full-content invisible\">Strategic projects include the completion of the 36-inch Line S-2 project and the commencement of the Bethel to grow Spec project, which will enhance supply reliability and support growth in the Dallas-Fort Worth Metroplex.</li> <li class=\"paywall-full-content invisible\">CFO Chris Forsythe reported a 15% increase in consolidated operating income to $459 million, driven by rate increases, customer growth, and higher industrial load. He also noted a $41 million rise in operating expenses, including increased headcount and safety-related expenses.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>The company reaffirmed its FY 2025 earnings per share guidance at $7.05 to $7.25, reflecting a 7.2% increase over the prior year quarter. Capital spending for the fiscal year is projected at $3.7 billion.</li> <li>Forsythe mentioned that ongoing regulatory filings are expected to deliver $152 million in annualized operating income increases, with additional filings targeting $300 million later in the fiscal year.</li> <li>Management expressed confidence in achieving growth through continued infrastructure investments, supported by a strong balance sheet and liquidity of $5.2 billion.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Q1 diluted EPS was $2.23, representing a 7.2% year-over-year increase.</li> <li>Consolidated operating income was $459 million, up 15% from the prior year, driven by rate increases and customer growth.</li> <li>Operating expenses rose by $41 million, attributed to higher compliance and safety spending, increased headcount, and regulatory changes in bad debt expense recovery.</li> <li>The company completed over $1 billion in long-term debt and equity financing during the quarter, including $650 million in long-term debt and $380 million in equity forward settlement.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>James Ward, Jefferies: Asked about CapEx plans and earned ROE trajectory. CEO Akers explained that the higher CapEx reflects ongoing system modernization and growth projects, including interconnects and storage enhancements.</li> <li>Richard Sunderland, J.P. Morgan: Inquired about equity plans for FY 2025. Forsythe responded that equity issuance is expected to range between $600 million and $800 million for the fiscal year, balanced with long-term debt.</li> <li>David Arcaro, Morgan Stanley: Asked about industrial customer growth and power generation opportunities. Akers noted solid industrial growth but refrained from discussing potential customers until contracts are finalized.</li> <li>Fei She, Barclays: Questioned credit metrics and Moody’s outlook. Forsythe stated that the company is comfortable with its current equity capitalization and does not expect a one-notch downgrade to significantly impact financing costs.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts focused on CapEx, customer growth, and regulatory mechanisms, reflecting a slight positive sentiment. Questions were detailed but non-confrontational, seeking clarity on strategic and financial priorities.</li> <li>Management maintained a confident tone during both prepared remarks and the Q&amp;A. Forsythe provided detailed responses, and Akers highlighted the company’s strong growth trends and financial positioning.</li> <li>Compared to the previous quarter, management maintained a consistent tone of confidence, emphasizing the continuity of their growth strategy.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>The Q1 2025 earnings per share of $2.23 marked an improvement over Q4 2024, which reported full-year EPS of $6.83.</li> <li>Capital spending increased significantly from $2.9 billion for FY 2024 to a projected $3.7 billion for FY 2025, reflecting a heightened focus on system modernization and customer growth.</li> <li>Regulatory filings in Q1 2025 targeting $152 million in annualized operating income increases were a continuation of the $376 million implemented in FY 2024.</li> <li>Analysts' tone remained consistent quarter-over-quarter, focusing on CapEx, equity plans, and industrial growth.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Management flagged rising operating expenses, including higher compliance-related costs and employee expenses, as potential challenges.</li> <li>Regulatory risks were highlighted, with ongoing rate cases in Texas and other jurisdictions requiring successful outcomes to meet growth targets.</li> <li>Analysts raised concerns regarding the impact of tariffs and federal policies on CapEx and O&amp;M costs, though management deemed these risks minimal.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Atmos Energy Corporation delivered strong Q1 2025 results, driven by customer growth, rate increases, and strategic infrastructure investments. The company reaffirmed FY 2025 guidance, projecting EPS between $7.05 and $7.25, supported by its robust capital spending plan and favorable regulatory outcomes. Management remains confident in achieving long-term growth through disciplined execution of its modernization strategy, despite challenges related to rising expenses and regulatory uncertainties.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/ATO/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403572-atmos-energy-signals-fy-2025-eps-guidance-of-7_05-7_25-amid-strong-customer-growth",
            "pub_date": "2025-02-05 18:39:38",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403344",
            "title": "Nasdaq, S&P, Dow slide as Alphabet's earnings disappoint investors",
            "description": "<html><body><p class=\"MsoNormal\">Wall Street's major market averages fell on Wednesday, with the tech focused Nasdaq bottoming the pack, after investors were left unimpressed with Alphabet's results. </p> <p class=\"MsoNormal\">Early on and the Nasdaq Composite (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/COMP:IND\" title=\"NASDAQ Composite Index\">COMP:IND</a></span></span></span></span>) was <span style=\"color: #ff0000;\">-0.5%</span>, the S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a><span class=\"paywall-full-content invisible\">) was </span><span class=\"paywall-full-content invisible\" style=\"color: #ff0000;\">-0.2%</span><span class=\"paywall-full-content invisible\">, and the Dow (</span><span class=\"ticker-hover-wrapper paywall-full-content invisible\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DJI\" title=\"Dow Jones Industrial Average Index\">DJI</a></span></span></span></span><span class=\"paywall-full-content invisible\">) was near flat.</span></p> <p class=\"MsoNormal paywall-full-content invisible\">The 10-year Treasury yield (<a href=\"https://seekingalpha.com/symbol/US10Y\" title=\"United States 10-Year Bond Yield\">US10Y</a>) fell 9 basis points to 4.41%. The 2-year yield (<a href=\"https://seekingalpha.com/symbol/US2Y\" title=\"United States 2-Year Bond Yield\">US2Y</a>) was lower by 5 basis points to 4.17%.</p> <p class=\"MsoNormal paywall-full-content invisible\">Major equity averages closed higher Tuesday as investors combed through another crop of corporate earnings reports while taking in stride news of China's retaliatory tariffs against the U.S.</p> <p class=\"MsoNormal paywall-full-content invisible\">\"After a tricky few days for markets, the last 24 hours saw things begin to stabilize again, with most asset classes unwinding the tariff-driven moves around the weekend,\" Deutsche Bank's Henry Allen said.</p> <p class=\"MsoNormal paywall-full-content invisible\">Aside from the latest trade developments, markets got a further boost from the latest JOLTS report of job openings from the U.S., which showed the labor market remained on an even keel into December, Allen added. </p> <p class=\"MsoNormal paywall-full-content invisible\">Alphabet's stock fell (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>) <span style=\"color: #ff0000;\">-8.3%</span> and (<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>) <span style=\"color: #ff0000;\">-8.6%</span> as the firm narrowly topped the Q4 profit expectations and revenues slightly<a href=\"https://seekingalpha.com/news/4403059-alphabet-gaap-eps-of-2_15-beats-by-0_02-revenue-of-96_5b-misses-by-170m\" rel=\"noopener\" target=\"_blank\" title=\" missed \"> missed </a>expectations.</p> <p class=\"MsoNormal paywall-full-content invisible\">On the economic front, U.S. <a href=\"https://seekingalpha.com/news/4403459-u_s_-private-sector-job-growth-accelerates-more-than-expected-in-january\" rel=\"noopener\" target=\"_blank\" title=\"private sector job\">private sector job</a> growth accelerated more than expected in January.</p> <p class=\"MsoNormal paywall-full-content invisible\">Additionally, the <a href=\"https://seekingalpha.com/news/4403551-u_s_-composite-pmi-edges-higher-in-final-january-print\" rel=\"noopener\" target=\"_blank\" title=\"S&amp;P Global U.S. Composite PMI\">S&amp;P Global U.S. Composite PMI</a> edged up to 52.7 in January's final reading, versus the 52.4 initial estimate and December's 55.4 reading.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/169992540/image_169992540.jpg",
            "link": "https://seekingalpha.com/news/4403344-sp500-nasdaq-dow-jones-outlook-stock-market",
            "pub_date": "2025-02-05 18:35:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403564",
            "title": "GeneDx drops after short report from Grizzly Research",
            "description": "<html><body><ul>\n<li>GeneDX (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/WGS\" title=\"GeneDx Holdings Corp.\">WGS</a></span>) pared an earlier decline and is now <span style=\"color: #ff0000;\">down 3.4%</span> after a short report from Grizzly Research on the genetic testing company.</li>\n<li>Grizzly Research disclosed that it's short shares of GeneDX (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/WGS\" title=\"GeneDx Holdings Corp.\">WGS</a></span>).</li>\n<li>GeneDX didn't immediately respond to Seeking Alpha's email request for comment.</li>\n<li>GeneDX (<a href=\"https://seekingalpha.com/symbol/WGS\" title=\"GeneDx Holdings Corp.\">WGS</a>) has<a href=\"https://seekingalpha.com/symbol/WGS\" rel=\"noopener\" target=\"_blank\" title=\" short interest of 7.8%.\"> short interest of 7.8%.</a>\n</li>\n</ul>\n</body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/95011716/image_95011716.jpg",
            "link": "https://seekingalpha.com/news/4403564-genedx-drops-after-short-report-from-grizzly-research",
            "pub_date": "2025-02-05 18:29:46",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4403351",
            "title": "Crude inventory rises by 8.7M barrels for week ended Jan 31 - EIA",
            "description": "<html><body><div><ul>\n<li>Commercial crude stocks for the week ended January 31: 423.8M barrels.</li>\n<li>Crude inventory change: barrels vs. +8.7M barrels for the week ended Jan. 24. Consensus estimate 2.400M.</li>\n<li>Futures (<a href=\"https://seekingalpha.com/symbol/CL1:COM\" title=\"Crude Oil Futures\">CL1:COM</a>) <font color=\"red\">-1.57%</font> to $71.56 a barrel.</li>\n<li>ETFs: (<a href=\"https://seekingalpha.com/symbol/USO\" title=\"The United States Oil ETF, LP\">USO</a>), (<a href=\"https://seekingalpha.com/symbol/UCO\" title=\"ProShares Trust II - ProShares Ultra Bloomberg Crude Oil\">UCO</a>), (<a href=\"https://seekingalpha.com/symbol/SCO\" title=\"ProShares UltraShort Bloomberg Crude Oil ETF\">SCO</a>), (<a href=\"https://seekingalpha.com/symbol/BNO\" title=\"United States Brent Oil Fund, LP\">BNO</a>), (<a href=\"https://seekingalpha.com/symbol/DBO\" title=\"Invesco DB Oil ETF\">DBO</a>), (<a href=\"https://seekingalpha.com/symbol/USL\" title=\"United States 12 Month Oil Fund, LP\">USL</a>).</li>\n</ul></div>\n</body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4403351-crude-inventory-risesfalls-by-m-barrels-for-week-ended-jan-31-eia",
            "pub_date": "2025-02-05 18:30:48",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}