{
    "data": [
        {
            "id": "4558777",
            "title": "OpenAI's massive funding round should benefit Microsoft, Oracle: BNP",
            "description": "<html><body><p data-eci=\"true\">OpenAI's (<a href=\"https://seekingalpha.com/symbol/OPENAI\" title=\"OpenAI\">OPENAI</a>) <a href=\"https://seekingalpha.com/news/4558700-openai-confirms-110b-funding-round-with-50b-from-amazon-and-30b-from-nvidia-softbank\" target=\"_blank\" title=\"announcement\">announcement</a> that it has raised $110B in new funding should alleviate the concerns about paying its bills and ultimately benefit Microsoft (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a></span>) and Oracle (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ORCL\" title=\"Oracle Corporation\">ORCL</a></span>), BNP Paribas said.</p>\n<p>“Broadly, the formal announcement of OpenAI’s $110B fundraise at a reported $730B pre-money valuation ($840B post-money) should be incrementally positive for Microsoft and Oracle, even if it’s been well telegraphed from media reports in recent months,” BNP analyst Stefan Slowinski wrote in a note to clients. “With fresh capital now secured, OpenAI appears well positioned to fund both its $250B compute contract with Microsoft and $300B compute contract with Oracle.”</p>\n<p>Slowinski added that OpenAI's updated cash burn forecasts imply roughly $180B in funding needs through 2030, which includes the $110B raised from Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>), Amazon (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>), and SoftBank (<a href=\"https://seekingalpha.com/symbol/SFTBY\" title=\"SoftBank Group Corp.\">SFTBY</a>). “As a result, with additional non-strategic investors layering in alongside the initial $110B raise, OpenAI could ultimately be most of the way towards addressing its cumulative cash needs,” Slowinski explained.</p>\n<p>He has a Buy rating on Microsoft and Oracle and respective price targets of $659 and $290.</p>\n<p>Beyond the ability to pay its bills, OpenAI's funding round has other implications for Microsoft and Oracle, Slowinski said. </p>\n<p>For Microsoft, the analyst believes the Satya Nadella-led company will report a “significant gain” in the fiscal third-quarter as its stake in OpenAI is likely to be valued higher. Assuming Microsoft is diluted with this funding round, he believes Microsoft owns roughly $200B worth of OpenAI, or about 7% of Microsoft's market cap. “Removing this from Microsoft’s valuation makes the current multiple that much more attractive,” he explained.</p>\n<p>For Oracle, Slowinski said the debate now moves on to whether Oracle can actually execute its contracts. “While we would have initially assumed that closing the raise would be viewed positively for Oracle, we worry the debate will simply shift to the ROI of AI and whether Oracle’s capital investments will ultimately deliver an attractive return, especially as OpenAI appears to be increasingly diversifying its cloud compute stack,” the analyst explained.</p>\n<p>Other questions may include whether OpenAI needs Oracle Cloud Infrastructure after Oracle delivers on its initial contract, given the increased commitment between OpenAI and Amazon Web Services, Slowinski said.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558777-openais-massive-funding-round-should-benefit-microsoft-oracle-bnp",
            "pub_date": "2026-02-28 00:00:54",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558743",
            "title": "Target's outlook remains “cloudy” and turnaround is stifled by competition, stagnant housing market -- BofA Securities",
            "description": "<html><body><p data-eci=\"true\"><span>Target</span> (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a></span></span>) is set to report quarterly results next Tuesday, March 3, with scrutiny centered on holiday-quarter execution, margin performance, and whether the new CEO can turn the company around.</p>\n<p>BofA Securities’ Christopher Nardone thinks Wall Street’s expectations for positive comparable sales growth beyond the fiscal first quarter may prove “aggressive” despite higher tax refunds, and an EPS recovery will take time.</p>\n<p>“We expect initial 2026 guidance will include a wide range of EPS outcomes; the lower end will likely contemplate continued weakness in comp trends, while the upper end will likely include comp progression driven by management’s actions to turn the business,” Nardone says.</p>\n<p>Meanwhile, Nardone believes Target’s (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) sales outlook remains “cloudy” due to limited green shoots in most discretionary categories, lagging sales in apparel and home (which makes up 50% of Target’s sales), “fierce” competition, and the impact the stagnant housing market is having on Target's (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) home segment, which will take time to recover. <span>  </span></p>\n<p>All of which leads Nardone to reinstate coverage of Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) with an Underperform rating and a $103 price target that assumes ~9% downside from current levels.</p>\n<p><span> </span>“We believe Target’s lack of scale versus larger competitors in digital advertising and third party online marketplaces may inhibit its ability to offset margin pressure and fund key strategic investments (including automation and AI),” Nardone says in his note to clients.</p>\n<p>In the fourth quarter, Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) is expected to have earned a profit of $2.15 per share on $30.5B in revenue, down 11% and 1.4% from the same quarter last year.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558743-targets-outlook-remains-cloudy-and-turnaround-is-stifled-by-competition-stagnant-housing-market",
            "pub_date": "2026-02-27 23:56:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558672",
            "title": "CoreWeave slumps after mixed Q4, analysts mull investor concerns over margins",
            "description": "<html><body><p data-eci=\"true\">Shares of CoreWeave (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/CRWV\" title=\"CoreWeave, Inc.\">CRWV</a></span>) slumped about 16% on Friday after mixed fourth quarter results while analysts discussed investor concerns over margins.</p>\n<p>Morgan Stanley kept its Equal-weight rating and $99 price target on the stock.</p>\n<p>\"Q4 <a href=\"https://seekingalpha.com/news/4558130-coreweave-falls-after-reporting-mixed-q4-financial-results\" target=\"_blank\" title=\"revenues\">revenues</a> up 110% YoY to $1.6B represent unprecedented scaling within our coverage, targets of $30B in ARR exiting FY27 and 8GWs of active power exiting FY30 show mgmt's confidence in the TAM. However, a reset of FY26 margin expectations strikes at the heart of the CRWV debate, keeping us EW,\" said analysts led by Keith Weiss.</p>\n<p>The analysts noted that targeting adjusted operating income at $900 to $1.1B, suggesting operating margins of 8% at the mid-point, fell well below consensus expectations of 21% operating margins in 2026.</p>\n<p>The analysts added that the compounded fourth quarter margins coming in light of expectations strike at the heart of the investor debate on CoreWeave: \"What are the durable margins of this business?\"</p>\n<p>The analysts said that  CoreWeave's management's explanation of timing differences between the delivery of powered shells, provisioning of graphics processing units, or GPUs, and the monetization of those GPUs appeared at odds with the team's assertion that it gets GPUs up and running faster than any other provider in the market and left them with more questions than answers.</p>\n<p>\"Bottom line, if investors can gain confidence in the durable margin profile of CoreWeave being in line with management's mid-20s target, the stock currently well under prices the potential FCF [free cash flow] associated with a ramp to &gt;$80 billion in ARR [Annual Recurring Revenue] over the next 5 years. However, we remain on the sidelines at EW, awaiting more clarity on the unit economics of this rapidly scaling GPUaaS [GPU as a Service]  business and the potential for software (including the recent partnership with Nvidia) to tilt the margin equation more positively,\" said Weiss and his team.</p>\n<p>Evercore maintained its Outperform rating but lowered the price target on the stock to $150 from$160.</p>\n<p>Analysts led by Amit Daryanani said that CoreWeave reported a top-line beat in the fourth quarter as demand remained robust. However, the analysts noted that fourth quarter operating income ($88M versus Street at $133M) and EBITDA ($898M versus consensus at $929M) came in below consensus as ramp-up/installation costs related to an uptick in capacity coming online weighed on profitability.</p>\n<p>\"While the ramp dynamics will create noise around margins near term as CRWV adds more capacity, we note that the overall demand backdrop remains robust and believe CRWV remains well-positioned to capture an outsized share of the AI cloud opportunity. Furthermore, we see potential for upside from 1) monetization of software stack, 2) continued ramp up/installation period management, and 3) upsell of other cloud solutions (CPU, storage),\" said Daryanani and his team.</p>\n<p>Related stocks: Nebius (<a href=\"https://seekingalpha.com/symbol/NBIS\" title=\"Nebius Group N.V.\">NBIS</a>) fell about 7%, while Super Micro Computer (<a href=\"https://seekingalpha.com/symbol/SMCI\" title=\"Super Micro Computer, Inc.\">SMCI</a>) rose around 2% on Friday.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558672-coreweave-slumps-after-mixed-q4-analysts-mull-investor-concerns-over-margins",
            "pub_date": "2026-02-27 23:56:01",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558775",
            "title": "Block clears 50- and 100-day moving averages as RSI now runs toward overbought territory",
            "description": "<html><body><p data-eci=\"true\">Shares of Block (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/XYZ\" title=\"Block, Inc.\">XYZ</a></span>) surged sharply on Friday following the company’s latest earnings release, with investors responding positively to a sweeping restructuring plan centered on automation and efficiency.</p>\n<p>The fintech firm announced it will reduce its workforce by more than 40%, citing advances in intelligent automation and internal productivity initiatives that management believes will enable a leaner, more scalable operating model. </p>\n<p>The market reaction was swift. Block climbed as much as 20% and now trades around $64.70 per share. The rally propelled the stock above both its 50-day and 100-day moving averages — key technical thresholds it had not closed above since January 27 and January 7, respectively. </p>\n<p>Momentum indicators reflect the speed of the move as well. The relative strength index has risen to 63.51, approaching overbought territory but not yet exceeding it. Notably, the stock’s RSI stood at 34.91 earlier this week, near levels typically associated with oversold conditions, underscoring the rapid shift in sentiment. </p>\n<p>Despite Friday’s advance, Block remains down 2.6% year to date and off 20.8% over the past six months, highlighting the significance of the latest rebound within a broader period of volatility.</p>\n<p>Furthermore, see which <a href=\"https://seekingalpha.com/news/4558732-etf-impact-blocks-40-workforce-cut-fuels-20-rally-and-these-funds-are-taking-notice\" target=\"_blank\" title=\"ETFs have the most exposure\">ETFs have the most exposure</a> to XYZ’s recent rally.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558775-block-clears-50--and-100-day-moving-averages-as-rsi-now-runs-toward-overbought-territory",
            "pub_date": "2026-02-27 23:46:38",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558771",
            "title": "Private credit default risk in software could top 15%, warns Marathon’s Bruce Richards: BBG interview",
            "description": "<html><body><p data-eci=\"true\" data-id=\"a0345443-d46e-48ba-9d97-58eafd98bf5f\"><span data-ai=\"\">Marathon Asset Management founder and CEO Bruce Richards has raised alarm bells about the private credit sector’s heavy exposure to the software industry, warning that default rates in software-exposed private credit markets could surge past 15%. </span></p>\n<p data-id=\"a0345443-d46e-48ba-9d97-58eafd98bf5f\"><span data-ai=\"\">R</span><span data-ai=\"\">ichards shared his concerns in a recent interview with Bloomberg Television.</span></p>\n<p data-id=\"b2347969-3e3d-4964-b241-8b9869d134e1\"><span data-ai=\"\">The veteran asset manager pointed to concentration risk as a key vulnerability in the private credit space. According to Richards, the sector has become overly reliant on software companies, creating systemic risks that investors may be underestimating.</span></p>\n<p data-id=\"2ecf8ae9-483d-4974-ba49-b8c092124ec0\"><span data-ai=\"\">Private credit has experienced explosive growth lately as institutional investors searched for yield in a challenging market environment. However, Richards’ warning suggests that the sector’s rapid expansion may have come at the cost of adequate diversification and risk management.</span></p>\n<p data-id=\"5dd078dc-b55a-4ea4-9250-9772694259c2\"><span data-ai=\"\">The potential for double-digit default rates in software-exposed portfolios could have significant implications for pension funds, endowments, and other institutional investors that have allocated heavily to private credit strategies. Many of these investors were attracted by the asset class’s perceived stability and attractive returns.</span></p>\n<p data-id=\"6416f78e-a0b9-48e2-bf46-0a6034fbfd8b\"><span data-ai=\"\">Richards’ cautionary outlook adds to growing concerns among market observers about valuations and credit quality in the private lending space. As interest rates and economic conditions continue to evolve, the concentration risks he identified could become increasingly relevant for portfolio managers evaluating their private credit allocations.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558771-private-credit-default-risk-in-software-could-top-15-warns-marathons-bruce-richards-bbg-interview",
            "pub_date": "2026-02-27 23:41:45",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558755",
            "title": "Emergent BioSolutions plummets on weak 2026 revenue guidance, Q4 results",
            "description": "<html><body><ul>\n<li>Emergent BioSolutions (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EBS\" title=\"Emergent BioSolutions Inc.\">EBS</a></span>) is down ~23% in Friday morning trading after announcing 2026 revenue guidance after Thursday's closing bell that came in well below the consensus.</li>\n<li>The company is projecting revenue this year of $720M-$760M. Consensus is $1.16B.</li>\n<li>Emergent's Q4 financial results were also a disappointment, as both the bottom and top lines <a href=\"https://seekingalpha.com/news/4558246-emergent-biosolutions-non-gaap-eps-of-0_43-misses-by-0_54-revenue-of-148_7m-misses-by-68_8m\" target=\"_self\" title=\"missed expectations\">missed expectations</a> by wide margins. </li>\n<li>Year-over-year revenue dropped ~24% to <span>$148.7M. Q4 Non-GAAP EPS of ($0.43) compares to $0.05 in the year-ago period.</span>\n</li>\n<li><span>Emergent ended 2025 with cash, cash equivalents, and restricted cash of $209.1M compared to $105.6M on Dec. 31, 2024. </span></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558755-emergent-biosolutions-plummets-weak-2026-revenue-guidance-q4-results",
            "pub_date": "2026-02-27 23:36:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558762",
            "title": "TransAlta inks deal with CPPIB, Brookfield for Alberta data center",
            "description": "<html><body><p data-eci=\"true\">TransAlta (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TAC\" title=\"TransAlta Corporation\">TAC</a></span>) +5.4% in early trading Friday after saying it signed an <a href=\"https://seekingalpha.com/pr/20417297-transalta-enters-memorandum-of-understanding-for-data-centre-development-at-keephills-site\" target=\"_self\" title=\"agreement\">agreement</a> <span>with the Canada Pension Plan Investment Board and Brookfield (<a href=\"https://seekingalpha.com/symbol/BN\" title=\"Brookfield Corporation\">BN</a>) to be the exclusive site and power provider for a planned data center in Alberta.</span></p>\n<p><span><span>TransAlta (<a href=\"https://seekingalpha.com/symbol/TAC\" title=\"TransAlta Corporation\">TAC</a>) said the MoU establishes a framework for phased development at its </span>Keephills<span> site in Alberta, including an initial long-term power purchase agreement for ~230 MW and the evaluation of opportunities for additional development totaling up to 1 GW of load.</span></span></p>\n<p><span><span>The announcement came as TransAlta (<a href=\"https://seekingalpha.com/symbol/TAC\" title=\"TransAlta Corporation\">TAC</a>) reported it swung to a <a href=\"https://seekingalpha.com/news/4558638-transalta-non-gaap-eps-of-c006-revenue-of-c599m\" target=\"_self\" title=\"Q4 adjusted loss\">Q4 adjusted loss</a> of C$0.06/share from an adjusted profit of C$0.01/share in the year-earlier quarter, but raised its quarterly dividend to C$0.07/share.</span></span></p>\n<p><span><span>Q4 attributable loss fell slightly to C$62M, or C$0.21/share, compared with a loss of $65M, or C$0.22/share, in the year-earlier quarter, on revenues of C$599M, down 11% Y/Y.</span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558762-transalta-inks-deal-with-cppib-brookfield-for-alberta-data-center",
            "pub_date": "2026-02-27 23:36:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558761",
            "title": "UBS cuts US equities to benchmark, boosts emerging markets on dollar and growth outlook",
            "description": "<html><body><p data-eci=\"true\" data-end=\"362\" data-start=\"93\">UBS has downgraded U.S. equities to benchmark in a fully invested global portfolio, citing stretched valuations, fading buyback support, and rising risks from a weaker dollar, while reiterating a high-conviction overweight on emerging markets.</p>\n<p data-end=\"716\" data-start=\"364\">The bank said the United States has the lowest operational leverage among major regions and historically underperforms when global growth accelerates above 3.5%. UBS now forecasts global GDP growth of 3.4% in 2026, up from 2.7% previously, arguing that a broadening recovery could favor more cyclical markets.</p>\n<p data-end=\"1061\" data-start=\"718\">The bank also warned that a weaker dollar may weigh on unhedged U.S. returns, noting that currency losses have recently outweighed the earnings uplift typically associated with dollar depreciation. Meanwhile, U.S. buyback yields are now broadly in line with global peers, reducing a key pillar of support for earnings per share and valuations.</p>\n<p data-end=\"1189\" data-start=\"1063\">UBS flagged that sector-adjusted price-to-earnings ratios in the U.S. stand about 35% above peers, well above long-term norms.</p>\n<p data-end=\"1475\" data-is-last-node=\"\" data-is-only-node=\"\" data-start=\"1191\">By contrast, emerging markets are seen as benefiting from accelerating global growth, cheaper valuations, and potential dollar weakness. UBS said EM equities offer higher operational leverage, supportive currency dynamics, and improving earnings breadth, reinforcing its overweight stance.</p>\n<p data-end=\"1475\" data-is-last-node=\"\" data-is-only-node=\"\" data-start=\"1191\"><strong>Here are some market tracking funds: </strong><strong>Dow ETFs: </strong>(<a href=\"https://seekingalpha.com/symbol/DIA\" title=\"State Street SPDR Dow Jones Indust Avg ETF Trust\">DIA</a>), (<a href=\"https://seekingalpha.com/symbol/DDM\" title=\"ProShares Ultra Dow30 ETF\">DDM</a>), (<a href=\"https://seekingalpha.com/symbol/UDOW\" title=\"ProShares UltraPro Dow30 ETF\">UDOW</a>), (<a href=\"https://seekingalpha.com/symbol/DOG\" title=\"ProShares Short Dow30 ETF\">DOG</a>), (<a href=\"https://seekingalpha.com/symbol/DXD\" title=\"ProShares UltraShort Dow30 ETF\">DXD</a>), and (<a href=\"https://seekingalpha.com/symbol/SDOW\" title=\"ProShares UltraPro Short Dow30 ETF\">SDOW</a>).<strong>S&amp;P ETFs: </strong>(<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"State Street SPDR S&amp;P 500 ETF Trust\">SPY</a>), (<a href=\"https://seekingalpha.com/symbol/VOO\" title=\"Vanguard 500 Index Fund ETF\">VOO</a>), (<a href=\"https://seekingalpha.com/symbol/IVV\" title=\"iShares Core S&amp;P 500 ETF\">IVV</a>), (<a href=\"https://seekingalpha.com/symbol/RSP\" title=\"Invesco S&amp;P 500 Eql Wght ETF\">RSP</a>), (<a href=\"https://seekingalpha.com/symbol/SSO\" title=\"ProShares Ultra S&amp;P500 ETF\">SSO</a>), (<a href=\"https://seekingalpha.com/symbol/UPRO\" title=\"ProShares UltraPro S&amp;P500 ETF\">UPRO</a>), (<a href=\"https://seekingalpha.com/symbol/SH\" title=\"ProShares Short S&amp;P500 ETF\">SH</a>), (<a href=\"https://seekingalpha.com/symbol/SDS\" title=\"ProShares UltraShort S&amp;P500 ETF\">SDS</a>), and (<a href=\"https://seekingalpha.com/symbol/SPXU\" title=\"ProShares UltraPro Short S&amp;P500 ETF\">SPXU</a>).<strong>Nasdaq ETFs:</strong> (<a href=\"https://seekingalpha.com/symbol/QQQ\" title=\"Invesco QQQ Trust, Series 1 ETF\">QQQ</a>), (<a href=\"https://seekingalpha.com/symbol/QLD\" title=\"ProShares Ultra QQQ ETF\">QLD</a>), (<a href=\"https://seekingalpha.com/symbol/TQQQ\" title=\"ProShares UltraPro QQQ ETF\">TQQQ</a>), (<a href=\"https://seekingalpha.com/symbol/QID\" title=\"ProShares UltraShort QQQ ETF\">QID</a>), and (<a href=\"https://seekingalpha.com/symbol/SQQQ\" title=\"ProShares UltraPro Short QQQ ETF\">SQQQ</a>).</p>\n<p data-end=\"1475\" data-is-last-node=\"\" data-is-only-node=\"\" data-start=\"1191\"><strong>Here are some Emerging Market ETFs: </strong>(<a href=\"https://seekingalpha.com/symbol/IEMG\" title=\"iShares Core MSCI Emerging Markets ETF\">IEMG</a>), (<a href=\"https://seekingalpha.com/symbol/VWO\" title=\"Vanguard Emerging Markets Stock Index Fund ETF\">VWO</a>), (<a href=\"https://seekingalpha.com/symbol/EEM\" title=\"iShares MSCI Emerging Markets ETF\">EEM</a>), (<a href=\"https://seekingalpha.com/symbol/SPEM\" title=\"State Street SPDR Portfolio Emerging Markets ETF\">SPEM</a>), (<a href=\"https://seekingalpha.com/symbol/SCHE\" title=\"Schwab Emerging Markets Equity ETF\">SCHE</a>), and (<a href=\"https://seekingalpha.com/symbol/AVEM\" title=\"Avantis Emerging Markets Equity ETF\">AVEM</a>).</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558761-ubs-cuts-us-equities-to-benchmark-boosts-emerging-markets-on-dollar-and-growth-outlook",
            "pub_date": "2026-02-27 23:31:13",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558768",
            "title": "Laurentian Bank of Canada declares CAD 0.47 dividend",
            "description": "<html><body><ul>\n<li>Laurentian Bank of Canada (LB:CA) declares <a href=\"https://seekingalpha.com/pr/20417652-laurentian-bank-of-canada-declares-dividend-on-its-common-shares\" target=\"_blank\">CAD 0.47/share quarterly dividend</a>, in line with previous.</li>\n<li>Payable May 1; for shareholders of record April 1; ex-div April 1.</li>\n<li><a href=\"https://seekingalpha.com/symbol/LB:CA/dividends?source=news_bullet\">See LB:CA Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558768-laurentian-bank-of-canada-declares-cad-0_47-dividend",
            "pub_date": "2026-02-27 23:31:13",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558765",
            "title": "Amneal outlines 2026 guidance with 12% to 24% EPS growth target, signals acceleration in affordable medicines",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Amneal Pharmaceuticals (AMRX) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Chirag Patel, Co-Founder, Co-CEO, President &amp; Director, reported \"2025 was a defining year of excellent execution and portfolio expansion at Amneal,\" highlighting revenue growth of 8%, adjusted EBITDA up 10%, and adjusted EPS rising 43%. He stated the company is advancing toward \"becom[ing] America's #1 affordable medicines company\" and emphasized leadership in complex generics, injectables, and biosimilars.</li>\n<li>Patel indicated that the Affordable Medicines segment experienced an \"exceptional year for approvals and launches, particularly in complex generics and injectables,\" and forecasted meaningful acceleration in revenue growth for this segment in 2026 and 2027.</li>\n<li>In biosimilars, Patel noted, \"With biosimilar Xolair in the review, we remain on track to have 6 biosimilars in the U.S. market by 2027.\" He identified a \"significant long-term opportunity\" as biologic exclusivity periods expire in the coming decade.</li>\n<li>The collaboration with Pfizer on GLP-1s was described as \"progressing well,\" with Amneal providing manufacturing expertise and retaining marketing rights for 18 countries, including India and Southeast Asia.</li>\n<li>CREXONT, the specialty Parkinson’s therapy, reached 23,000 patients and over 3% market share, with peak U.S. sales potential stated as $300 million to $500 million. The new Brekiya auto-injector for migraine and cluster headache was launched in Q4 and is expected to reach peak sales of $50 million to $100 million.</li>\n<li>Chintu Patel, Co-Founder, Co-CEO &amp; Director, credited operational excellence and portfolio innovation, announcing that \"in 2025 was an exceptionally strong year\" for complex generics launches and highlighted the entry into inhalation medicines as a new growth platform.</li>\n<li>Anastasios Konidaris, Executive VP &amp; CFO, stated, \"The fourth quarter completed another terrific year for Amneal with strong top and bottom line growth as Q4 revenues grew 11%, adjusted EBITDA grew 13% and adjusted EPS grew 75%.\" He reported operating cash flow for the year of $340 million and reduction in net leverage to 3.5x.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Konidaris provided 2026 guidance with expected total company revenue of $3.05 billion to $3.15 billion, representing 1% to 4% growth, adjusted EBITDA growth of 5% to 10%, and adjusted EPS growth of 12% to 24% ($0.93 to $1.03).</li>\n<li>He forecasted Affordable Medicines segment growth of 7% to 8% in 2026, with revenue acceleration supported by new product approvals.</li>\n<li>Specialty segment revenues are projected to be flat in 2026, attributed to CREXONT growth offset by expected generic erosion of RYTARY, but growth is anticipated to resume in 2027 as branded products gain traction.</li>\n<li>Health Care segment revenue is expected between $625 million and $700 million in 2026, down from $745 million in 2025, described as a \"reset level\" due to loss of exclusivity for a key generic product and a shift away from low-margin distribution business.</li>\n<li>Adjusted gross margins are expected to exceed 44% in 2026, with operating cash flow guidance of $325 million to $375 million.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Q4 revenues were reported at $814 million. Affordable Medicines segment revenue was \"essentially flat to $437 million\" due to timing of launches. Specialty revenues increased 38% year-over-year to $167 million, driven by CREXONT, RYTARY, UNITHROID, and initial Brekiya sales. Health Care revenues grew 24% to $211 million, with about $50 million in Q4 from a significant new product line.</li>\n<li>Q4 adjusted EBITDA reached $175 million, and Q4 EPS was $0.21. Full-year 2025 revenue was $3 billion, adjusted EBITDA was $688 million, and adjusted EPS was $0.83. Adjusted gross margin expanded to approximately 43% for the year.</li>\n<li>Net leverage reduced from 3.9x at end of 2024 to 3.5x at end of 2025. Interest expense for 2025 was $217 million, down from $256 million in 2024.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Christopher Schott, JPMorgan: Asked about CREXONT market response post-Phase IV data and 2026 revenue/market share targets. Chirag Patel replied, \"Phase IV...showing 3.13 hours of 'Good On' time...80% of the IR patients are converting to CREXONT,\" and expects to \"more than double the revenue\" and reach 6%+ market share in 2026.</li>\n<li>Schott followed up on Health Care segment 2026 guidance. Konidaris explained the revenue decline is due to \"pivot away from distribution\" and competition for a previously exclusive generic, but said, \"the bottom line is not going to be impacted because...there is other more profitable parts of the business.\"</li>\n<li>Matthew Dellatorre, Goldman Sachs: Inquired about the Pfizer GLP-1 partnership and business development strategy. Chirag Patel responded, \"Facilities actually accelerated in manufacturing...we continue to have the marketing rights for 18 countries,\" and capital allocation will focus on biosimilar vertical integration first.</li>\n<li>David Amsellem, Piper Sandler: Probed on generic Omnipaque and Xolair biosimilar opportunities. Patel said, \"Iohexol...will pick up\" as more strengths are approved, while Xolair is expected to achieve \"immediate bump in the cells\" through private label channels.</li>\n<li>Leszek Sulewski, Truist Securities: Asked about CREXONT persistence and pricing. Patel stated, \"Our gross to net runs is typical in this category, about 40% to 45%.\" Joe Renda, Senior VP, added that CREXONT persistence \"is surpassing that of RYTARY.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on market share gains, new launches, and segment-specific growth dynamics, with a generally positive to slightly positive tone reflected in questions about CREXONT adoption, Health Care profitability, and biosimilar opportunities.</li>\n<li>Management maintained a confident and optimistic tone in both prepared remarks and responses, frequently referencing momentum, robust pipelines, and operational achievements. Phrases such as \"we are very excited\" and \"we remain confident\" were common. Management was more detailed and enthusiastic about future growth in this quarter compared to the prior quarter.</li>\n<li>Compared to Q3 2025, both analysts and management appear more focused on execution of new launches, with increased confidence in pipeline progression and cost controls.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance language evolved from general optimism in Q3 to specific 2026 targets for revenue, EBITDA, and EPS in Q4, and a more detailed focus on Affordable Medicines acceleration.</li>\n<li>Strategic focus shifted toward biosimilar vertical integration and GLP-1 manufacturing, with more explicit capital allocation priorities discussed in Q4.</li>\n<li>Analysts in Q4 concentrated on quantifying specialty product uptake, segment profitability, and competitive positioning, whereas Q3 questions were broader regarding partnerships and regulatory changes.</li>\n<li>Key metrics such as Q4 revenue, adjusted EPS, and gross margin all showed sequential improvement, with more explicit quantification in Q4. Management’s tone reflected greater conviction in sustaining growth, particularly as the company highlighted new launches and cost efficiency gains.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management identified competitive pressures in Health Care from loss of exclusivity on a key generic product and intentional reduction of low-margin distribution business.</li>\n<li>Supply chain complexity and competition were highlighted for new launches like Iohexol, with management noting the need to build capacity and secure approvals for all strengths.</li>\n<li>Analysts raised questions about potential outcomes from the Pfizer GLP-1 partnership and the impact of competitive dynamics in both biosimilars and specialty therapies.</li>\n<li>Management’s mitigation strategies include a focus on higher-margin business, operational cost controls, and targeted investment in vertical integration for biosimilars.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Amneal’s management underscored a year of robust execution and portfolio expansion, setting explicit 2026 targets for revenue and earnings growth. The company is leveraging multiple growth drivers—most notably specialty launches like CREXONT, new biosimilars, and a wave of complex medicines—to accelerate Affordable Medicines performance and offset sector-specific headwinds. With disciplined capital allocation, operational efficiencies, and a strong balance sheet, the company anticipates continued top and bottom line growth, supported by a diversified and innovation-driven portfolio.</p>\n<p><a href=\"https://seekingalpha.com/symbol/amrx/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558765-amneal-outlines-2026-guidance-with-12-percent-to-24-percent-eps-growth-target-signals",
            "pub_date": "2026-02-27 23:25:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}