{
    "data": [
        {
            "id": "4557892",
            "title": "Stellantis shares rise despite EV write-off as turnaround hopes build",
            "description": "<html><body><p data-eci=\"true\">Despite suffering a sizable loss in 2026 tied to a €25B write-off on its electric vehicle business, shares of Stellantis (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/STLA\" title=\"Stellantis N.V.\">STLA</a></span></span>) are higher on Thursday amid expectations that the company will return to a profit under the direction of CEO Antonio Filosa.</p>\n<p>With the EV loss behind it, Stellantis (<a href=\"https://seekingalpha.com/symbol/STLA\" title=\"Stellantis N.V.\">STLA</a>) said it expects to “progressively” improve net revenue, adjusted operating income margin, and industrial free cash flow in 2026 and to see progressive improvements from the first half of the year to the second half.</p>\n<p>“In the second half of the year we began to see initial, positive signs of progress with the early results of our drive to improve quality, strong execution of the launches of our new product wave, and a return to top-line growth. In 2026 our focus will be on continuing to close the execution gaps of the past, adding further momentum to our return to profitable growth,” Filosa said in a statement.</p>\n<p>For FY25, however, the huge EV write-down drove Stellantis (<a href=\"https://seekingalpha.com/symbol/STLA\" title=\"Stellantis N.V.\">STLA</a>) to a loss of €22.3B ($26.3B) and an adjusted operating loss ((AOI)) of €842M with an AOI margin of negative 0.5%. This translated into a loss of €0.42 ($0.50) per share from a profit of €2.48 in 2024.</p>\n<p>The write-off was reflected in the second half, where Stellantis (<a href=\"https://seekingalpha.com/symbol/STLA\" title=\"Stellantis N.V.\">STLA</a>) incurred a loss of €0.60 per share from a profit of €0.08 in H2 2024.</p>\n<p>Sales improved, however, gaining 10% to €79.2B in the second half of 2025 from the same period last year, but were down 2% for all of 2025 to $153.5B.</p>\n<p>Shipments in the second half of 2025 reached 2.8M units, up 11% year-over-year, with North America showing the strongest improvement of +39% from a year ago.</p>\n<p>For the current year, Stellantis (<a href=\"https://seekingalpha.com/symbol/STLA\" title=\"Stellantis N.V.\">STLA</a>) expects to see a mid-single-digit percent increase in net revenue, a low-single-digit AOI margin (versus -0.5% in 2025)—albeit still pressured by a €1.6 tariff expense—and improved industrial free cash flow generation year-over-year (versus negative €4.65B in 2025).</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557892-stellantis-shares-rise-despite-ev-write-off-as-turnaround-hopes-build",
            "pub_date": "2026-02-27 00:05:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557909",
            "title": "Kansas City Fed Manufacturing Composite Index rises to 5 in February",
            "description": "<html><body><p data-eci=\"true\">The Kansas City Composite Index came in at 5 in February, compared to 0 in January, <a href=\"https://www.kansascityfed.org/surveys/manufacturing-survey/tenth-district-manufacturing-activity-rose-slightly-in-february/\" rel=\"nofollow\" target=\"_blank\" title=\"according to\">according to</a> data from the district Federal Reserve bank released on Thursday.</p>\n<p>The Manufacturing Index stood at 10 in February, compared to -2 prior.</p>\n<p>Developing... Check back for updates.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557909-kansas-city-fed-manufacturing-composite-index-rises-to-5-in-february",
            "pub_date": "2026-02-27 00:05:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557927",
            "title": "Qnity Electronics targets $100M EBITDA run rate improvement by 2028 through transformation plan",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Qnity Electronics, Inc. (Q) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li><p>Jon Kemp, CEO, opened the call by stating, \"When we launched Qnity late last year, we detailed our focus on establishing ourselves as the premier technology solutions provider across the semiconductor value chain.\" He highlighted that Qnity delivered its seventh consecutive quarter of strong organic growth and exceeded full year 2025 financial objectives, growing organic sales by 10% and achieving an 11% increase in pro forma adjusted operating EBITDA year-over-year. Kemp emphasized the company's innovation in advanced nodes, advanced packaging, and the introduction of the Emblem CMP pad platform, which is designed for advanced chips and has received strong customer feedback. He also announced a multiyear transformation plan expected to deliver approximately $100 million EBITDA run rate benefit by the end of 2028.</p></li>\n<li><p>Interim CFO Michael Goss reported, \"We had a strong finish to the year with fourth quarter net sales of $1.2 billion, up 8% year-over-year.\" Goss shared that adjusted pro forma operating EBITDA was $349 million and adjusted pro forma EPS for the quarter was $0.82. He noted full year net sales of $4.75 billion, adjusted pro forma operating EBITDA of $1.4 billion, and an adjusted pro forma EPS of $3.35. Goss also announced a $500 million share repurchase authorization and described the company’s financial flexibility with a year-end total cash balance of over $900 million and net leverage of approximately 2.2x. He outlined the three areas of focus for the transformation plan: commercial and innovation excellence, productivity and quality improvements, and strengthening the local-for-local operating model.</p></li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li><p>Qnity Electronics provided 2026 guidance with net sales expected in the range of $4.97 billion to $5.17 billion, adjusted operating EBITDA between $1.465 billion and $1.575 billion, adjusted EPS in the range of $3.55 to $3.95, and adjusted free cash flow of $450 million to $550 million. The company expects CapEx investment in 2026 to be 9% of sales, returning to a 6% run rate in future years. Kemp stated, \"Our newly introduced full year 2026 guidance reflects our conviction that we can continue building on this momentum.\"</p></li>\n<li><p>Management indicated that momentum from AI-led demand continues, particularly in the ICS segment, and expects high single-digit sequential net sales growth in the first quarter with a similar margin profile to Q4 2025.</p></li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li><p>Qnity reported fourth quarter net sales of $1.2 billion and adjusted pro forma operating EBITDA of $349 million. Adjusted pro forma EPS for the quarter was $0.82. The full year saw net sales of $4.75 billion and adjusted pro forma operating EBITDA of $1.4 billion, with a 29.5% margin. The ICS segment delivered net sales of $2.1 billion with 12% organic growth and over 25% EBITDA margin. Adjusted pro forma free cash flow for the year was $706 million, and the cash balance stood at over $900 million.</p></li>\n<li><p>The company announced the Board’s approval of a $500 million share repurchase program and declared its first quarterly dividend.</p></li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li><p>Bhavesh Lodaya, BMO Capital Markets: Asked about the EBITDA guide and key metrics like MSI and PCB. Kemp responded that MSI is expected to be mid-single digits, aligned with market indicators, and PCB trends are in the same range. Lodaya also asked about quarterly cadence, to which Goss replied, \"We've seen less seasonality in our business...we do tend to see a peak -- a little bit of a peak in the third quarter.\"</p></li>\n<li><p>John Ezekiel Roberts, Mizuho Securities: Inquired about the base tax rate and CMP use in packaging. Goss said the tax rate is expected to trend toward the high-teens over time. Kemp confirmed that CMP processes are used in advanced packaging and are a fast-growth area.</p></li>\n<li><p>Christopher Parkinson, Wolfe Research: Asked about operating leverage in both segments. Kemp stated, \"Within the semi segment, margins came in kind of in the mid-30s...really strong operating leverage within the ICS segment.\" Parkinson also questioned cash flow outlook; Goss attributed 2026's $500 million free cash flow guidance to elevated CapEx and ongoing transformation and IT projects.</p></li>\n<li><p>James Schneider, Goldman Sachs: Asked about ICS growth and China sales. Kemp said ICS is expected to outperform semi, and China accounted for just over 30% of total sales, growing high single digits in 2025.</p></li>\n<li><p>Arun Viswanathan, RBC: Asked about guidance range drivers and the transformation plan. Kemp tied low-end guidance to potential memory market constraints and high-end to customer capacity expansions. Goss noted the $100 million benefit from the transformation plan is expected to be realized by 2028, with early benefits in productivity and commercial excellence.</p></li>\n<li><p>Additional questions covered ICS segment drivers, seasonality, growth rates in thermal management and packaging, and the degree of conservatism in the revenue guide. Kemp characterized the 2026 guidance as anchored around mid-single-digit market indicators plus expected outperformance.</p></li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li><p>Analysts maintained a generally neutral to slightly positive tone, probing for clarity on guidance, growth drivers, and transformation execution. They pressed for details on seasonality, segment performance, and conservatism in the outlook.</p></li>\n<li><p>Management presented a confident and optimistic tone in both prepared remarks and responses, using phrases like \"we're proving that the next lead in AI...will be powered by materials innovation\" and \"we have strong confidence in the strength of our platform.\" The tone remained steady and constructive compared to the previous quarter, with increased emphasis on execution and transformation.</p></li>\n<li><p>Compared to the previous quarter, both analysts and management continued to focus on operating leverage, segment growth, and macro recovery, with additional attention on execution of the transformation plan and capital allocation.</p></li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li><p>The current quarter introduced a multiyear transformation plan targeting $100 million EBITDA run rate improvement by 2028 and a $500 million share repurchase authorization, both new versus the prior quarter.</p></li>\n<li><p>Guidance for 2026 reflects higher net sales and earnings targets, and management emphasized strong AI and advanced packaging demand as key growth drivers. The ICS segment remains a standout performer.</p></li>\n<li><p>Analysts maintained focus on utilization trends, capacity investments, and segment growth. Management's confidence level increased, especially regarding transformation initiatives and capital deployment.</p></li>\n<li><p>The prior quarter focused on the successful spin, initial public company momentum, and normalization following spin-related order timing. The current quarter shifts to operational execution, transformation, and capital allocation.</p></li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li><p>Kemp acknowledged the \"significant demand for AI and high-performance computing workloads is creating additional pressure on the global memory market\" and noted that Qnity’s exposure is primarily to premium devices expected to be more resilient.</p></li>\n<li><p>Management cited ongoing monitoring of memory market capacity concerns and recognized that \"our exposure is largely driven to unit-driven consumables.\"</p></li>\n<li><p>The company is watching for signs of downstream demand impact and is committed to supply security through strategic investments and local-for-local manufacturing.</p></li>\n<li><p>Goss stated that elevated CapEx and transformation costs will impact free cash flow in 2026, with normalization expected in later years.</p></li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Qnity Electronics reported strong organic growth and margin performance for 2025, driven by continued strength in advanced nodes, packaging, and interconnect solutions, and introduced a transformation plan targeting $100 million EBITDA run rate improvement by 2028. Management remains confident in the company’s ability to outpace market growth in 2026, supported by robust demand for AI, high-performance computing, and advanced connectivity, while maintaining a disciplined approach to capital allocation and operational execution.</p>\n<p><a href=\"https://seekingalpha.com/symbol/q/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557927-qnity-electronics-targets-100m-ebitda-run-rate-improvement-by-2028-through-transformation",
            "pub_date": "2026-02-27 00:00:46",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557897",
            "title": "Cheniere Energy surges on big Q4 earnings beat, $9B boost to stock buyback authorization",
            "description": "<html><body><p data-eci=\"true\">Cheniere Energy (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/LNG\" title=\"Cheniere Energy, Inc.\">LNG</a></span>) +5.2% in early trading Thursday to its highest level in more than four months after crushing <a href=\"https://seekingalpha.com/news/4557729-cheniere-energy-gaap-eps-of-10_68-beats-by-6_83-revenue-of-5_45b-misses-by-280m\" target=\"_self\" title=\"Q4 earnings\">Q4 earnings</a> estimates and <span>raising its share repurchase target to more than $10B through 2030, reflecting a $9B increase to its existing authorization, which included $1B deployed in Q4.</span></p>\n<p><span>Q4 attributable net income more than doubled to $2.3B, or $10.68/share, from $977M, or $4.33/share, in the year-earlier quarter, liquefied natural gas revenues jumped 24.5% Y/Y to $5.31B, and the number of cargoes exported increased ~11% to 185.</span></p>\n<p><span>Q4 <span>adjusted EBITDA jumped to $2.05B from $1.58B in the year-earlier quarter, beating the $1.95B analyst consensus estimate, primarily due to higher volumes of liquefied natural gas delivered, partially offset by lower total margins per MMBtu of LNG delivered; Q4 distributable cash flow of $1.49B topped the $1.32B consensus estimate.</span></span></p>\n<p><span>Cheniere (<a href=\"https://seekingalpha.com/symbol/LNG\" title=\"Cheniere Energy, Inc.\">LNG</a>) introduced financial guidance ranges for FY 2026 of $6.75B-$7.25B consolidated adjusted EBITDA and $4.35B-$4.85B distributable cash flow, reflecting its previously announced LNG production forecast and expected completion this year of the remaining three trains at Corpus Christi Stage 3, which was 94.1% complete as of December 31.</span></p>\n<p><span>The project is expected to add 10M metric tons/year of LNG to the company's production capacity of 15M tons/year at the Corpus Christi export facility.</span></p>\n<p><span>Cheniere (<a href=\"https://seekingalpha.com/symbol/LNG\" title=\"Cheniere Energy, Inc.\">LNG</a>) said it shipped a record <span>670 cargoes in 2025, up 4% Y/Y.</span></span></p>\n<p><span><span>Separately, Cheniere (<a href=\"https://seekingalpha.com/symbol/LNG\" title=\"Cheniere Energy, Inc.\">LNG</a>) said it entered into a long-term agreement to <a href=\"https://seekingalpha.com/pr/20415060-cheniere-and-cpc-sign-long-term-lng-sale-and-purchase-agreement\" target=\"_self\" title=\"supply\">supply</a> 1.2M metric tons/year of LNG to Taiwan's CPC during 2026-50.</span></span></p>\n<p><span><span>Jefferies analysts reiterated their Buy rating and $251 price target on </span>Cheniere (<a href=\"https://seekingalpha.com/symbol/LNG\" title=\"Cheniere Energy, Inc.\">LNG</a>) fol<span>lowing the Q4 results.</span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557897-cheniere-energy-surges-on-big-q4-earnings-beat-9b-boost-to-stock-buyback-authorization",
            "pub_date": "2026-02-26 23:51:48",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557863",
            "title": "Investors grow more cautious as bearish sentiment rises, shows latest AAII survey",
            "description": "<html><body><p data-eci=\"true\" data-pm-slice=\"0 0 []\">Market sentiment among individual investors grew more cautious in late February, according to the <a href=\"https://www.aaii.com/sentimentsurvey\" rel=\"nofollow\" target=\"_blank\" title=\"latest survey\">latest survey</a> from the American Association of Individual Investors.</p>\n<p data-pm-slice=\"0 0 []\">Bullish sentiment declined to 33.2% for the week ended February 25, down from 34.5% in the prior week, while bearish sentiment rose to 39.8% from 36.9%.</p>\n<p data-pm-slice=\"0 0 []\">Equity markets were mixed during the week as investors assessed earnings developments and broader technology-sector trends, including results from Nvidia. U.S. indexes fluctuated, with technology shares experiencing periods of weakness even as some segments staged rebounds. Global markets showed a divided performance, with parts of Asia reaching record highs while European indexes softened after touching fresh peaks amid renewed tariff concerns.</p>\n<p>Investors remained selective, with defensive positioning gaining traction at times. Bonds outperformed equities during periods of risk aversion, and gold attracted safe-haven demand.</p>\n<p>Broader market commentary pointed to cautious trading conditions, uneven market breadth, and heightened sensitivity to policy, geopolitical, and technology-related developments.</p>\n<p data-pm-slice=\"0 0 []\">According to AAII, neutral sentiment or expectations that stock prices will stay essentially unchanged over the next six months, edged down to 27.0% from 28.5% a week earlier.</p>\n<p>The survey has been conducted by the American Association of Individual Investors since 1987, in which it asks respondents for their thoughts on where the market is heading in the next six months.</p>\n<div> </div>\n<p>S&amp;P 500 Tracking Funds: (MUTF:<a href=\"https://seekingalpha.com/symbol/FXAIX#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">FXAIX</a>), (MUTF:<a href=\"https://seekingalpha.com/symbol/VFIAX#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">VFIAX</a>), (MUTF:<a href=\"https://seekingalpha.com/symbol/VFFSX#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">VFFSX</a>), (MUTF:<a href=\"https://seekingalpha.com/symbol/SWPPX#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">SWPPX</a>), (NYSEARCA:<a href=\"https://seekingalpha.com/symbol/SPY#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">SPY</a>), (NYSEARCA:<a href=\"https://seekingalpha.com/symbol/VOO#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">VOO</a>), (NYSEARCA:<a href=\"https://seekingalpha.com/symbol/IVV#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">IVV</a>), (NYSEARCA:<a href=\"https://seekingalpha.com/symbol/RSP#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">RSP</a>), (NYSEARCA:<a href=\"https://seekingalpha.com/symbol/SSO#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">SSO</a>), (NYSEARCA:<a href=\"https://seekingalpha.com/symbol/SH#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">SH</a>), (NYSEARCA:SDS), and (NYSEARCA:<a href=\"https://seekingalpha.com/symbol/SPXU#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews\">SPXU</a>).</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557863-investors-grow-more-cautious-as-bearish-sentiment-rises-shows-latest-aaii-survey",
            "pub_date": "2026-02-26 23:51:48",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557917",
            "title": "OpenAI plans London as largest research hub outside U.S.",
            "description": "<html><body><p data-eci=\"true\">OpenAI (<a href=\"https://seekingalpha.com/symbol/OPENAI\" title=\"OpenAI\">OPENAI</a>) will launch its biggest research hub in London outside the United States, the company reportedly said on Thursday.</p>\n<p>The company believes Britain’s technology ecosystem offers an ideal setting for investment and the development of new artificial intelligence systems, as per a Reuters report.</p>\n<p>The country's blend of talent, leading universities, and globally respected scientific institutions gives it a competitive edge in a sector viewed as strategically important by governments worldwide, said Mark Chen, OpenAI's research chief.</p>\n<p>Staff based at the new hub will “own key components” of its frontier AI model research, focusing on real-world applications and advancing the development of safe AI systems, the ChatGPT maker added.</p>\n<p>However, specific details of the plan, like the size of any investment or the number of jobs it would involve, have not been made public.</p>\n<p>OpenAI had opened its first international office in London in mid-2023. It currently has over 30 employees in its London team, according to Reuters.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557917-openai-plans-london-as-largest-research-hub-outside-us",
            "pub_date": "2026-02-26 23:45:59",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557921",
            "title": "Nasdaq drops nearly 2% as the tech selloff deepens post Nvidia's earnings",
            "description": "<html><body><p data-eci=\"true\">Wall Street retreated on Thursday as weakness in the technology sector weighed heavily on major averages, pushing the Nasdaq Composite (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/COMP:IND\" title=\"NASDAQ Composite Index\">COMP:IND</a></span></span>) down nearly 2%.</p>\n<p>The decline followed earnings from Nvidia (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a></span></span>), with shares of the mega-cap chipmaker falling roughly 5% a day after reporting quarterly results. </p>\n<p>Semiconductor and semiconductor equipment stocks led the downturn, sliding about 5% on the session and dragging the broader information technology sector lower by approximately 2.5%. The pullback in chip-related names offset relative strength in other pockets of tech, including IT services, which climbed 4%. </p>\n<p>The uneven performance highlights the market’s heightened sensitivity to earnings from large-cap technology companies, particularly those tied to artificial intelligence and data center demand.</p>\n<p>Outlined below are the Nasdaq-100’s (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NDX\" title=\"NASDAQ 100-Index\">NDX</a></span></span>) worst-performing stocks in Thursday’s trading session. </p>\n<ol>\n<li>Applied Materials (<a href=\"https://seekingalpha.com/symbol/AMAT\" title=\"Applied Materials, Inc.\">AMAT</a>), -6.8%</li>\n<li>Lam Research (<a href=\"https://seekingalpha.com/symbol/LRCX\" title=\"Lam Research Corporation\">LRCX</a>), -6.7%</li>\n<li>Broadcom (<a href=\"https://seekingalpha.com/symbol/AVGO\" title=\"Broadcom Inc.\">AVGO</a>), -6.6%</li>\n<li>Western Digital (<a href=\"https://seekingalpha.com/symbol/WDC\" title=\"Western Digital Corporation\">WDC</a>), -6.4%</li>\n<li>ASML Holding (<a href=\"https://seekingalpha.com/symbol/ASML\" title=\"ASML Holding N.V.\">ASML</a>), -6.2%</li>\n<li>Seagate Technology (<a href=\"https://seekingalpha.com/symbol/STX\" title=\"Seagate Technology Holdings plc\">STX</a>), -6.1%</li>\n<li>Micron Technology (<a href=\"https://seekingalpha.com/symbol/MU\" title=\"Micron Technology, Inc.\">MU</a>), -5.9%</li>\n<li>Monolithic Power Systems (<a href=\"https://seekingalpha.com/symbol/MPWR\" title=\"Monolithic Power Systems, Inc.\">MPWR</a>), -5.7%</li>\n<li>NVIDIA (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>), -4.9%</li>\n<li>Synopsys (<a href=\"https://seekingalpha.com/symbol/SNPS\" title=\"Synopsys, Inc.\">SNPS</a>), -4.7%</li>\n</ol>\n<p>Nasdaq ETFs: (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QQQ\" title=\"Invesco QQQ Trust, Series 1 ETF\">QQQ</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QQQM\" title=\"Invesco NASDAQ 100 ETF\">QQQM</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SQQQ\" title=\"ProShares UltraPro Short QQQ ETF\">SQQQ</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TQQQ\" title=\"ProShares UltraPro QQQ ETF\">TQQQ</a></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QLD\" title=\"ProShares Ultra QQQ ETF\">QLD</a></span></span>), and (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QID\" title=\"ProShares UltraShort QQQ ETF\">QID</a></span></span>).</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557921-nasdaq-drops-nearly-2-percent-as-the-tech-selloff-deepens-post-nvidias-earnings",
            "pub_date": "2026-02-26 23:45:59",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557914",
            "title": "Warner Bros. Discovery targets over 140M streaming subscribers in Q1 2026 as global expansion accelerates",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Warner Bros. Discovery (WBD) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>David Zaslav, President, CEO &amp; Director, stated that \"Warner Bros. Motion Picture Group delivered a historic run of success with 9 films debuting #1 at the box office in 2025, 7 consecutive films opening with more than $40 million in box office sales, a first for any studio, and our films spent 16 total weeks atop the global box office.\" Zaslav highlighted the company's film slate success and the strong performance of original content and revived IPs, noting a significant awards season presence with 9 Golden Globe Awards and 30 Academy Award nominations.</li>\n<li>Zaslav emphasized the growing strength of HBO and HBO Max, pointing to the debut of IT: Welcome to Derry as the \"fourth strongest debut season in HBO history, averaging 27 million viewers per episode.\" He indicated momentum in streaming growth, surpassing the 130 million subscriber target, with a path to \"more than 140 million total Streaming subscribers by the end of the first quarter\" and a goal to \"exceed 150 million subscribers by the end of the year.\"</li>\n<li>Zaslav reported, \"our portfolio of networks attracted 30% of all prime time cable viewing in the U.S., and we advanced critical initiatives like the launch of CNN All Access.\" He also cited a \"sequential improvement in advertising trends during the fourth quarter, which has continued into Q1.\"</li>\n<li>Zaslav described a strategic review and corporate reorganization, mentioning a \"63% increase in value versus the first offer received in September\" from the ongoing sales process, with the Board focused on maximizing value for shareholders.</li>\n<li>Gunnar Wiedenfels, Senior EVP &amp; CFO, stated, \"Discovery Global would come out of the gate with roughly, call it, a 3.3x net leverage number. That is absolutely sustainable and supportable...we are very well able and willing to leverage the opportunities in our long-dated low interest capital structure.\"</li>\n<li>Jean-Briac Perrette, President and CEO of Global Streaming &amp; Games, outlined five levers for streaming growth: strengthened content, international volume and penetration growth (with password sharing enforcement ramping up in 2026), product enhancements, retention initiatives, and monetization through both pricing and ad sales expansion.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Zaslav projected, \"we are on track to reach more than 140 million total Streaming subscribers by the end of the first quarter. And we're well on our way to exceed 150 million subscribers by the end of the year.\"</li>\n<li>Management described the 2027 film slate as \"set to deliver a truly monumental year for Warner Bros.\" with major franchise releases, signaling ongoing investment in theatrical content.</li>\n<li>Perrette stated, \"we feel great about the next couple of years. And the really kind of sweet spot of the flywheel we're finally getting into to seeing content, marketing, product enhancements all flow together to drive that growth.\"</li>\n<li>Wiedenfels said, \"we're expecting to be flat to slightly up in international ad sales this year\" and noted the capital structure post-spin as \"absolutely sustainable and supportable.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Zaslav highlighted box office momentum with \"Wuthering Heights, our ninth consecutive theatrical release to open #1, has generated over $160 million at the global box office in 2 weeks, including an $83 million opening weekend.\"</li>\n<li>Wiedenfels referenced the Discovery Global spin-off, stating, \"Discovery Global would come out of the gate with roughly, call it, a 3.3x net leverage number.\"</li>\n<li>Perrette described streaming growth as \"now exceeding the 130 million subscriber target we set out in August 2022.\"</li>\n<li>Management noted \"a sequential improvement in advertising trends during the fourth quarter, which has continued into Q1,\" and cited \"more than 50% growth in linear hours viewed compared to the 2022 winter games\" for the Milano Cortina Olympic Winter Games.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Richard Greenfield, LightShed Partners, LLC: Asked about leverage at Discovery Global and why Versant is not a good comp. Wiedenfels responded that the capital structure is \"absolutely sustainable and supportable\" and does not see an issue with the leverage profile, emphasizing the company's scale and global opportunities.</li>\n<li>Robert Fishman, MoffettNathanson LLC: Asked what is now being appreciated about the company's content and the growth drivers for streaming profits. Zaslav explained the focus on investing in original content, bringing back franchises, and a creative renaissance. Perrette detailed five levers for HBO Max growth, including content, international market expansion, product improvements, retention, and monetization.</li>\n<li>Peter Supino, Wolfe Research, LLC: Inquired about international DTC expansion and ARPU. Perrette stated most markets have turned profitable within 1 to 2 years of launch, and the company's global IP reduces the need for extensive local content spending.</li>\n<li>Bryan Kraft, Deutsche Bank: Asked about the games pipeline and network advertising. Perrette said 2025 was a reset year for games, with major launches coming in 2027-28. Wiedenfels described strong performance in advertising, noting \"sequential improvement... after digesting 400 basis points of NBA headwinds\" and strengths across key networks and international markets.</li>\n<li>John Hodulik, UBS: Sought detail on ad and OpEx savings and sports business strategy. Wiedenfels pointed to \"a big benefit from NBA cost savings\" and ongoing efficiency focus, including the use of AI, with continued discipline in acquiring sports rights.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts were focused on leverage, international profitability, growth levers in streaming, and content investment, displaying a neutral to slightly positive tone, with some probing on risks and sustainability but not overt skepticism.</li>\n<li>Management expressed confidence, describing the capital structure as \"absolutely sustainable,\" and emphasized a \"creative renaissance\" and robust pipeline. The tone was confident and forward-looking, especially during remarks on streaming targets and content strategy.</li>\n<li>Compared to the previous quarter, management's tone remains confident and optimistic, with analysts continuing to probe on leverage and growth sustainability but showing less concern about execution risk given recent performance.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter emphasized the completion of a historic box office run and a record number of #1 debuts, whereas the previous quarter highlighted leadership in box office revenue and an ongoing transformation.</li>\n<li>Guidance language shifted from building toward 150 million streaming subscribers by end of next year to being \"on track\" for 140 million by Q1 and exceeding 150 million by year-end.</li>\n<li>Management continues to focus on global streaming expansion and franchise investment, with an increased emphasis on the Discovery Global spin-off and capital structure sustainability this quarter.</li>\n<li>Analysts in both quarters concentrated on leverage, profitability, and international growth, with the current quarter Q&amp;A reflecting more confidence in streaming profitability and the sustainability of the capital structure.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Wiedenfels acknowledged investor focus on leverage for Discovery Global but described the capital structure as \"absolutely sustainable and supportable.\"</li>\n<li>The company noted ongoing \"secular headwinds\" for linear networks but cited improving advertising trends and audience delivery.</li>\n<li>Management referenced the ongoing sales process and a rigorous, competitive environment, with a focus on maximizing shareholder value and mitigating downside risks.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Warner Bros. Discovery management highlighted a breakout year for original content and box office leadership, the surpassing of key streaming subscriber targets, and momentum in global expansion. The company projects ongoing growth in streaming and profitability, supported by an ambitious content slate, international market penetration, and disciplined capital management, while remaining focused on maximizing shareholder value and managing structural transitions, including the Discovery Global spin-off.</p>\n<p><a href=\"https://seekingalpha.com/symbol/wbd/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557914-warner-bros-discovery-targets-over-140m-streaming-subscribers-in-q1-2026-as-global-expansion",
            "pub_date": "2026-02-26 23:40:58",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557889",
            "title": "U.S. natural gas inventory net change of -52 Bcf for week ended February 20 – EIA",
            "description": "<html><body><ul>\n<li>Stocks for the week ended February 20 were 2,018 Bcf vs. 2,070 Bcf for the week ended February 13.</li>\n<li>Net change:<span> -52 </span>Bcf vs.<span> -144</span><span> </span>Bcf for the week ended February 13.</li>\n<li>Consensus: -<span>36.00B.</span>\n</li>\n<li>ETFs: (<span><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/UNG\" title=\"United States Natural Gas Fund LP ETF\">UNG</a></span></span></span>), (<span><a href=\"https://seekingalpha.com/symbol/BOIL\" title=\"ProShares Ultra Bloomberg Natural Gas ETF\">BOIL</a></span><span>), (</span><span><a href=\"https://seekingalpha.com/symbol/KOLD\" title=\"ProShares UltraShort Bloomberg Natural Gas ETF\">KOLD</a></span><span>), (</span><span><a href=\"https://seekingalpha.com/symbol/FCG\" title=\"First Trust Natural Gas ETF\">FCG</a></span><span>), (</span><span><a href=\"https://seekingalpha.com/symbol/UNL\" title=\"United States 12 Month Natural Gas Fund LP ETF\">UNL</a></span><span>), (</span><span><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/HNU:CA\" title=\"BetaPro Natural Gas Leveraged Daily Bull ETF\">HNU:CA</a></span></span></span><span>)</span>\n</li>\n<li>Click<span> </span><a href=\"https://ir.eia.gov/ngs/ngs.html\" rel=\"nofollow noopener\" target=\"_blank\">here<span> </span></a>to read<span> the full EIA Weekly Natural Gas Storage Report.</span>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557889-us-natural-gas-inventory-net-change-of--52-bcf-for-week-ended-february-20-eia",
            "pub_date": "2026-02-26 23:35:43",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557912",
            "title": "Howden Joinery Group Plc GAAP EPS of 49.20p, revenue of £2.42B",
            "description": "<html><body><ul>\n<li>Howden Joinery Group Plc <a href=\"https://www.howdenjoinerygroupplc.com/docs/librariesprovider25/archives/2025ar/01-ar25-strategic-report.pdf\" rel=\"nofollow\" target=\"_blank\">press release</a>  (HWDJF): FY  GAAP EPS of 49.20p.</li>\n<li>Revenue of £2.42B (+4.3% Y/Y).</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557912-howden-joinery-group-plc-gaap-eps-of-4920p-revenue-of-242b",
            "pub_date": "2026-02-26 23:35:43",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}