{
    "data": [
        {
            "id": "4558934",
            "title": "Arlo projects $375M–$385M service revenue in 2026 as partnerships and SaaS model drive outlook",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Arlo Technologies (ARLO) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Matthew McRae reported \"an incredibly strong fourth quarter\" with total revenue at $141 million and service revenue at $89 million, the latter growing 39% year-over-year and constituting 63% of total revenue. McRae stated, \"Fourth quarter EBITDA hit $23 million, up an incredible 138% year-over-year and resulted in Arlo posting $0.22 of non-GAAP EPS, substantially above the high end of our guidance range.\"</li>\n<li>McRae highlighted the deployment of Arlo Secure 6, noting its \"advanced multi-recognition engine, AI-based scene descriptions, numerous new AI-based audio detections and the only personalized AI micro model capability in the world.\" He emphasized the impact of the largest device launch in company history, shipping \"more than 800,000 units in the first 60 days of production.\"</li>\n<li>McRae emphasized SaaS performance with churn dropping to 1% and subscriber retention at 99%. He added, \"Average monthly revenue per user grew to $15.30 during Q4,\" with these subscriptions generating a 94% gross margin.</li>\n<li>CFO Kurt Binder stated, \"We ended 2025 with actual consolidated revenue of about $530 million and subscriptions and services revenue at $316 million or 60% of total revenue.\" Binder added, \"We delivered an impressive non-GAAP EPS of $0.70, surpassing the high end of our guidance even withstanding the impact of tariffs.\"</li>\n<li>Binder highlighted a 24% increase in paid accounts to 5.7 million and a 23% increase in retail POS volume linked to the new product launch. \"Our services transformation has been remarkable as we ended 2025 with over $316 million in subscriptions and services revenue, up 30% year-over-year.\"</li>\n<li>McRae announced partnerships with Samsung and Comcast, stating that the Comcast partnership \"could grow larger than our Verisure partnership over time.\" The new Samsung service is \"our first partnership that is solely based on SaaS services without reliance on a hardware component.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Binder provided guidance for Q1 2026: consolidated revenue between $135 million and $145 million, GAAP net earnings per share of $0.01 to $0.07, and non-GAAP net income per diluted share of $0.17 to $0.23.</li>\n<li>For full year 2026, Binder forecasted consolidated revenue of $550 million to $580 million, with service revenue targeted at $375 million to $385 million, comprising more than 65% of total revenue. \"We expect our non-GAAP net income per diluted share to be between $0.75 and $0.85 per share.\"</li>\n<li>Management said, \"We will implement initiatives to improve customer retention and drive higher conversion, and we will adjust our innovative service offerings to enable us to deliver ARPU growth and expanded ARR.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Arlo posted Q4 non-GAAP net income of $23.9 million or $0.22 per diluted share. For 2025, non-GAAP net income was $77.3 million or $0.70 per share, up from $0.40 in 2024.</li>\n<li>Non-GAAP gross profit for Q4 was $67.6 million, with a non-GAAP gross margin of 47.8%. Product gross margins rebounded by almost 300 basis points from Q3 to negative 14.4% in Q4.</li>\n<li>Free cash flow for 2025 reached $66.9 million with a free cash flow margin of 12.6%. Year-end cash was $166 million, up $15 million year-over-year after investments and share repurchases.</li>\n<li>Inventory was $41.2 million, down from $44 million in Q3. Inventory turnover was 5.9x for Q4, down from 6.4x in Q3.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Jacob Stephan, Lake Street Capital Markets, LLC: Asked about the Comcast and ADT partnerships. McRae responded, \"ADT is going very well. The technical integration was basically done by the end of last year... the original target was sometime in the middle of this year.\" On Comcast, McRae said, \"The integration of a very large partnership like this takes usually between 9 and maybe 12 months... it could grow larger than our Verisure partnership.\"</li>\n<li>Stephan asked about new hardware products. McRae replied, \"You'll see some updates to some of those products and a couple of new form factors this year... The other thing we're starting to work on is making a more deliberate push into small business.\"</li>\n<li>Rian Bisson, Craig-Hallum: Inquired about shelf share and competition. McRae stated, \"We'll be launching additional product SKUs... expanding into some additional retailers over the next 6 to 9 months as well.\" He discussed potential regulatory actions against certain competitors, \"There's likely to be some action sometime this year that could block the import of 1 or 2 brands that could open up as much as maybe somewhere between 10% and maybe 20% of unit volume in the United States to be captured.\"</li>\n<li>Hamed Khorsand, BWS Financial Inc.: Asked about the cash balance and CapEx for partnerships. Binder noted investments in Origin Wireless and share repurchases, and stated, \"There will be a level of investment we'll need to make... that is factored into our 2026 guidance.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on the scale and timing of partnerships, sustainability of service revenue growth, competitive positioning, and cash deployment. The tone was positive but probing for detail on execution and risks.</li>\n<li>Management’s tone was confident and detailed, repeatedly referencing \"record-breaking\" results and expressing optimism about future growth, as in \"I have never been more excited about the vast opportunities that lay in front of us.\"</li>\n<li>Compared to the previous quarter, management’s sentiment remained highly positive, while analysts showed increased interest in the impact and timing of new partnerships and the durability of Arlo's SaaS model.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Q4 guidance for revenue and EPS was higher than Q3. Service revenue as a percentage of total revenue increased to 63% in Q4 from 57% in Q3.</li>\n<li>Management cited new strategic partnerships in Q4, with Samsung and Comcast added to previously announced collaborations.</li>\n<li>Gross margin improved significantly in Q4, with non-GAAP gross margin up to 47.8% from 41% in Q3, and product gross margins rebounded by almost 300 basis points quarter-over-quarter.</li>\n<li>Analysts’ focus shifted more toward the execution of large partnerships, cash allocation, and the sustainability of SaaS-driven growth.</li>\n<li>Management's confidence in strategic expansion and recurring revenue growth was more prominent in Q4.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management flagged continued uncertainty regarding tariffs, stating, \"Given the lack of clarity, our outlook assumes that we will remain subject to the 20% tariff structure.\"</li>\n<li>Analysts raised questions about the impact of privacy concerns, the risk of AI disintermediation, and supply chain challenges, particularly memory costs and availability. McRae explained, \"There's an inability to actually be disintermediated that doesn't exist in many markets, and that's driven from our dual relationship with the end user.\"</li>\n<li>Binder commented on supply chain, \"At this point in time in all of our discussions with our suppliers, we feel like the supply is available to us and any increase or incremental cost has already been factored into our medium- to long-term plan.\"</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Arlo’s Q4 2025 call showcased record service revenue growth, robust SaaS metrics, and the successful launch of strategic partnerships with Samsung and Comcast, positioning the company for further expansion in 2026. Management projects service revenue to surpass $375 million next year, with continued investment in innovation, channel expansion, and operational execution. The company remains focused on capturing additional market share and driving recurring revenue, supported by a strong balance sheet and a disciplined capital allocation strategy.</p>\n<p><a href=\"https://seekingalpha.com/symbol/arlo/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558934-arlo-projects-375m-385m-service-revenue-in-2026-as-partnerships-and-saas-model-drive-outlook",
            "pub_date": "2026-02-28 06:51:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558917",
            "title": "Gold, silver cap historic month with best-ever dollar gains; U.S.-Iran tensions in focus",
            "description": "<html><body><p data-eci=\"true\">Gold and silver futures rose Friday to wrap up their best-ever monthly dollar gains in February, with gold also enjoying its best monthly percentage increase since January 2012.</p>\n<p>Front-month Comex gold (<a href=\"https://seekingalpha.com/symbol/XAUUSD:CUR\" title=\"Gold Spot Price\">XAUUSD:CUR</a>) for March delivery rallied 10.9% this month to $5,230.50/oz, while front-month March Comex silver (<a href=\"https://seekingalpha.com/symbol/XAGUSD:CUR\" title=\"Silver Spot Price\">XAGUSD:CUR</a>) sizzled 18.4% in February to $92.682/oz, rising 3.3% and 12.5%, respectively, this week.</p>\n<p>Gold has gained for seven straight months, climbing nearly 60% in that time, and silver has increased for 10 consecutive months, skyrocketing 185% for the period.</p>\n<p>On Friday, gold added 1% and silver surged 6.5%, as markets headed into the weekend sensing a heightened risk of U.S. military action against Iran.</p>\n<p>Talks between the two countries ended Thursday without a deal, with the two sides still seen far from any agreement, and the U.S. Embassy in Israel said the State Department authorized non-emergency staff and their families to leave the country, citing safety risks.</p>\n<p><span>\"There's a lot of nervousness surrounding geopolitics, you have all the set-up for a high probability of a military operation over the weekend, so it's a risk-off in a flight to safety,\" Blue Line Futures chief market strategist Phillip Streible said.</span></p>\n<p>Prices also have been supported by uncertainty over U.S. global tariffs and the future of existing trade deals following the Supreme Court's recent ruling, <span>the so-called dollar debasement trade, and concerns about the Federal Reserve’s independence.</span></p>\n<p><span>On Friday,</span> the latest U.S. data showed monthly wholesale inflation unexpectedly sped up in January, helping send <span>U.S. 10‑year Treasury yields to a three-month low, making non-yielding gold more attractive.</span></p>\n<p>Gold has been helped in the near term by the return of China to markets after a pause to celebrate the Lunar New Year, and Suki Cooper of Standard Chartered sees more upside in the longer term, \"continuing to expect gold to retrace its lost gains at a more modest pace.\"</p>\n<p>ETFs: (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GLD\" title=\"SPDR Gold Shares ETF\">GLD</a></span>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GDX\" title=\"VanEck Gold Miners ETF\">GDX</a></span>), (<a href=\"https://seekingalpha.com/symbol/GDXJ\" title=\"VanEck Junior Gold Miners ETF\">GDXJ</a>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IAU\" title=\"iShares Gold Trust ETF\">IAU</a></span>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NUGT\" title=\"Direxion Daily Gold Miners Index Bull 2X Shares ETF\">NUGT</a></span>), (<a href=\"https://seekingalpha.com/symbol/PHYS\" title=\"Sprott Physical Gold Trust USD\">PHYS</a>), (<a href=\"https://seekingalpha.com/symbol/GLDM\" title=\"SPDR Gold MiniShares Trust ETF\">GLDM</a>), (<a href=\"https://seekingalpha.com/symbol/AAAU\" title=\"Goldman Sachs Physical Gold ETF\">AAAU</a>), (<a href=\"https://seekingalpha.com/symbol/SGOL\" title=\"abrdn Physical Gold Shares ETF\">SGOL</a>), (<a href=\"https://seekingalpha.com/symbol/RING\" title=\"iShares MSCI Global Gold Miners ETF\">RING</a>), (<a href=\"https://seekingalpha.com/symbol/BAR\" title=\"GraniteShares Gold Trust ETF\">BAR</a>), (<a href=\"https://seekingalpha.com/symbol/OUNZ\" title=\"VanEck Merk Gold ETF\">OUNZ</a>), (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SLV\" title=\"iShares Silver Trust ETF\">SLV</a></span>), (<a href=\"https://seekingalpha.com/symbol/PSLV\" title=\"Sprott Physical Silver Trust USD\">PSLV</a>), (<a href=\"https://seekingalpha.com/symbol/SIVR\" title=\"abrdn Physical Silver Shares ETF\">SIVR</a>), (<a href=\"https://seekingalpha.com/symbol/SIL\" title=\"Global X Silver Miners ETF\">SIL</a>), (<a href=\"https://seekingalpha.com/symbol/SILJ\" title=\"Amplify Junior Silver Miners ETF\">SILJ</a>)</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558917-gold-silver-cap-historic-month-with-best-ever-dollar-gains-us-iran-tensions-in-focus",
            "pub_date": "2026-02-28 06:51:37",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558930",
            "title": "THS Maple Holdings CFO to depart, hires advisory firm for finance role",
            "description": "<html><body><ul>\n<li>THS Maple Holdings (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/YAY:CA\" title=\"THS Maple Holdings Ltd.\">YAY:CA</a></span>) on Friday said that Chief Financial Officer Claude Lambert will leave his role effective February 26, 2026.</li>\n<li><p data-eci=\"true\" data-pm-slice=\"0 0 []\">The company said it has engaged Services Groupe Pur to provide CFO services effective March 1.</p></li>\n<li>THS said the firm will support financial reporting, regulatory compliance, governance, and strategic financial planning.</li>\n<li>YAY:CA closed <span>-0.0%</span> at $0.095.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20418202-ths-maple-holdings-announces-change-in-chief-financial-officer\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558930-ths-maple-holdings-cfo-to-depart-hires-advisory-firm-for-finance-role",
            "pub_date": "2026-02-28 06:40:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558933",
            "title": "Prime Drink Group appoints Germain Turpin as interim president and CEO",
            "description": "<html><body><ul>\n<li>Prime Drink Group (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DOMWF\" title=\"Prime Drink Group Corp.\">DOMWF</a></span>) on Friday announced the appointment of <span class=\"person\">Germain Turpin</span> as interim President and Chief Executive Officer of the company.</li>\n<li>\n<span class=\"person\">Turpin</span> succeeds Alexandre Côté, who will step down from his position on February 28, 2026, while remaining on the Board of Directors and retaining responsibility for special projects.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20418171-prime-drink-group-announces-management-change\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558933-prime-drink-group-appoints-germain-turpin-as-interim-president-and-ceo",
            "pub_date": "2026-02-28 06:40:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558925",
            "title": "Disc Medicine undergoes restructuring plan; slashes 20% of workforce",
            "description": "<html><body><ul>\n<li>Disc Medicine (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IRON\" title=\"Disc Medicine, Inc.\">IRON</a></span>) said it was beginning a restructuring plan that includes laying off 20% of its employees.</li>\n<li>The announcement comes after the US FDA earlier this month <a href=\"https://seekingalpha.com/news/4552158-disc-medicine-plunges-on-fda-complete-response-letter-for-bitopertin\" target=\"_self\" title=\"issued\">issued</a> a Complete Response Letter for bitoperin. </li>\n<li>The company <a href=\"https://seekingalpha.com/filing/176426070\" target=\"_self\" title=\"added\">added</a> it will incur a $2M charge in regards to the restructuring, primarily due to severance costs. </li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558925-disc-medicine-undergoes-restructuring-plan-slashes-20-percent-workforce",
            "pub_date": "2026-02-28 06:31:33",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558927",
            "title": "Carter’s outlines low to mid-single-digit net sales growth for 2026 as productivity and pricing offsets tariffs",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Carter's, Inc. (CRI) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Douglas Palladini opened by stating, \"As Carter's returns to growth that is long-term, sustainable and profitable, we continue to experience momentum in our business, doing what's right for our brands and consumers, which is yielding improved financial outcomes.\" He highlighted decreased promotional activity, higher pricing, and enhanced brand storytelling as key strategies, noting, \"All apparel brands and all age segments grew versus last year\" in DTC channels and that new Gen Z and millennial families are \"leaning into our better and best product offerings with higher price points.\"</li>\n<li>Palladini emphasized, \"For the first time since 2021, Carter's grew year-over-year revenue, even excluding the 53rd week of sales,\" and noted the third consecutive quarter of retail comp growth with higher average unit retails (AURs) and less promotion.</li>\n<li>CFO Richard Westenberger reported, \"Sales, operating income and earnings per share all exceeded our prior forecast,\" but clarified that \"earnings were still down year-over-year, although at a lower rate than we saw through much of 2025.\"</li>\n<li>Westenberger explained, \"On our over $900 million in net sales, gross margin was 43.2%, which was in line with our previous outlook. This represented a decrease of 460 basis points over last year's fourth quarter gross margin,\" driven primarily by tariffs and higher product costs. He also noted, \"Adjusted operating income was $89 million with an adjusted operating margin of nearly 10%.\"</li>\n<li>Management announced the retirement of Sean McHugh as Treasurer and the appointment of T.C. Robillard as the new Vice President of Investor Relations.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Westenberger stated, \"We're expecting net sales growth in the low to mid-single digits over 2025. This growth reflects anniversarying the extra week in 2025. We're expecting growth in each of our business segments.\"</li>\n<li>For profitability, he said, \"We're expecting adjusted operating income will also grow in the low to mid-single digits over 2025.\"</li>\n<li>Full year gross margin rate is expected to decline somewhat versus 2025, with full year spending roughly comparable to up slightly. The productivity initiatives, including store closures, are expected to largely offset investments and inflation.</li>\n<li>Adjusted earnings per share are \"expected to be down low double digits to down mid-teens over 2025's adjusted earnings per share of $3.47.\"</li>\n<li>First quarter 2026 guidance includes \"net sales...increase in the mid-single digits compared to last year\" and \"first quarter adjusted operating income in the range of $12 million to $15 million.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Fourth quarter net sales were $925 million, up 8% over last year's fourth quarter; excluding the 53rd week, consolidated net sales increased 3%.</li>\n<li>Fourth quarter adjusted earnings per share were $1.90 compared to $2.39 last year.</li>\n<li>Gross margin of 43.2% was down 460 basis points year-over-year, mainly due to a $40 million tariff impact, which was double the impact from Q3.</li>\n<li>Adjusted SG&amp;A increased 5% to $315 million, with increased investments in demand creation and higher wage and rent costs.</li>\n<li>International segment reported net sales increased 10%, with Mexico delivering nearly 30% growth from new stores and double-digit comp sales growth.</li>\n<li>Operating cash flow for 2025 was $122 million, down year-over-year due to lower earnings and higher inventories, in part from tariffs.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Paul Lejuez, Citi: Asked about full price realization and tariff drag on gross margin. Palladini said, \"We are selling more clean ticket product...less product on promotion than we have traditionally,\" and Westenberger quantified, \"for the full year, we're expecting the gross impact to be somewhat over $200 million.\"</li>\n<li>Jay Sole, UBS: Sought detail on U.S. wholesale margins and SG&amp;A guidance. Westenberger replied, \"The most dramatic driver and the most significant driver was the net impact of tariffs...about $40 million that I referenced.\"</li>\n<li>James Chartier, Monness, Crespi, Hardt: Clarified timing of pricing benefits in wholesale and retail. Westenberger responded, \"Pricing is planned up...across the year in each of our segments.\"</li>\n<li>William Reuter, BofA: Asked if price increases at wholesale resulted in changes to shelf space. Palladini answered, \"The answer to the first part is no.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts expressed concern over the impact of tariffs, pricing power, and margin trajectory, with a slightly negative tone in probing for details and risk factors.</li>\n<li>Management maintained a confident and constructive tone in prepared remarks, but responses during Q&amp;A were sometimes cautious, particularly on tariffs and pricing, using phrases like \"we believe\" and \"we're going to wait and see.\"</li>\n<li>Compared to last quarter, management's tone in prepared remarks was more optimistic due to returning revenue growth, while Q&amp;A exchanges remained focused on mitigating external risks.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter introduced explicit low to mid-single-digit growth targets for both net sales and operating income for 2026, while the previous quarter had not reinstated formal guidance due to tariff uncertainty.</li>\n<li>Management's confidence in price increases and productivity initiatives is more pronounced, with concrete references to realized cost savings and store closures.</li>\n<li>Analysts continued to focus on tariff mitigation and pricing power, but with renewed attention to the sustainability of higher pricing and the risk of margin compression.</li>\n<li>Management's tone evolved from caution in the previous quarter to a more assertive stance on growth, while still flagging external risks.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited tariffs as a significant ongoing risk, with Westenberger stating, \"tariffs continue to dominate the headlines.\"</li>\n<li>Macroeconomic conditions, including consumer confidence and inflation, were highlighted as areas of caution.</li>\n<li>Tariff impact on inventory and gross margin remains a key risk, with the expectation that \"gross impact grows to over $200 million\" in 2026.</li>\n<li>Analysts repeatedly questioned the effectiveness of pricing strategies and the potential for consumer resistance or competitive trade-down.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Carter’s management emphasized that the company is building on regained momentum, targeting both sales and operating income growth in 2026 despite substantial tariff headwinds. Leadership is focused on productivity gains, pricing initiatives, and disciplined capital allocation to offset cost pressures, while remaining alert to macroeconomic and policy risks that could affect performance in the year ahead.</p>\n<p><a href=\"https://seekingalpha.com/symbol/cri/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558927-carter-s-outlines-low-to-mid-single-digit-net-sales-growth-for-2026-as-productivity-and",
            "pub_date": "2026-02-28 06:31:33",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558924",
            "title": "Greencastle to raise up to $200,000 in private placement, names new CEO",
            "description": "<html><body><ul>\n<li>Greencastle Resources (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/VGN:CA\" title=\"Greencastle Resources Ltd.\">VGN:CA</a></span>) it plans to raise up to $200,000 through a non-brokered private placement of up to 5 million units priced at $0.04 each.</li>\n<li>Each unit will consist of one common share and one warrant exercisable at $0.05 per share for two years.</li>\n<li>The company said proceeds from the offering will be used to pay accounts payable and will not be used for investor relations or paid to non-arm’s length parties.</li>\n<li>Greencastle said it may pay eligible finders a 6% cash commission and issue finder’s warrants equal to 6% of units sold.</li>\n<li>Closing is subject to corporate and regulatory approvals, including from the TSX Venture Exchange.</li>\n<li>Separately, the company appointed Albert Contardi as CEO and a Director, replacing Anthony Roodenburg.</li>\n<li>GRSFF closed <span>-76.0%</span> at $0.006.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20418173-greencastle-announces-private-placement\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558924-greencastle-to-raise-up-to-200000-in-private-placement-names-new-ceo",
            "pub_date": "2026-02-28 06:26:40",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558923",
            "title": "Calumet targets MaxSAF 150 expansion and $1–$2/gallon SAF contract premiums as operational gains drive leverage reduction",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Calumet, Inc. (CLMT) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Louis Borgmann described 2025 as “a defining high-impact year,” noting that Calumet achieved several strategic milestones, including consistent free cash flow generation in Specialties, proving Montana Renewables’ financial resilience, closing the DOE loan for Montana Renewables, and materially deleveraging the balance sheet. Borgmann stated, “For full year 2025, we delivered $293 million of adjusted EBITDA with tax attributes, nearly a 30% increase year-over-year. We reduced restricted debt by more than $220 million. Net recourse leverage improved from 8.2x to 4.9x.”</li>\n<li>Borgmann highlighted structural improvements: “Fixed costs were down over $40 million. Water treatment costs at Montana Renewables were down over $20 million as were our crude transportation costs in the Specialties business… capital spending was also reduced by roughly $20 million. At the same time, our ops team increased production by roughly 1.3 million barrels on the year.”</li>\n<li>He reported record levels of production in Specialty Products &amp; Solutions, with specialty sales volumes exceeding 20,000 barrels per day throughout every quarter. “Our commercial engine more than kept up as we sustained material margins above historic norms despite softer macro conditions.”</li>\n<li>On Montana Renewables, Borgmann cited a 60% improvement in operating costs over two years and the completion of multiyear SAF contracts at a $1–$2 per gallon premium over renewable diesel. “These contracts are all multiyear… opening up premium renewable markets globally that complement the strong local markets we serve.”</li>\n<li>The MaxSAF 150 expansion project is set to bring 120 million to 150 million gallons of annual SAF capacity online, with the turnaround and project beginning next week and completion targeted for late April.</li>\n<li>CFO David Lunin reported, “We generated $69.3 million of adjusted EBITDA with tax attributes in the quarter and $293.3 million for the full year 2025. Each segment contributed meaningfully to our financial results.” He announced 2026 capital expenditures guidance of $115 million to $145 million, citing a heavy turnaround year, and forecasted increased production year-over-year.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management expects continued cost and reliability improvements in 2026, even with significant turnarounds. Borgmann stated, “We expect for that to continue in 2026 despite what's going to be a very heavy turnaround year.”</li>\n<li>For Montana Renewables, objectives are to “execute MaxSAF 150 safely, on time and on budget in the second quarter; continue improving our already strong cost levels; and… leverage our early mover advantage in SAF as we grow.”</li>\n<li>The company anticipates a “step change financial improvement even in past trough market conditions” as new contracts ramp up and regulatory tailwinds from RVO emerge.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Adjusted EBITDA for Q4 2025 was $69.3 million; full-year adjusted EBITDA reached $293.3 million.</li>\n<li>Specialty Products &amp; Solutions reported $88.5 million adjusted EBITDA for the quarter and $291.8 million for the year, maintaining margins over $60 per barrel and five consecutive quarters of volume above 20,000 barrels per day.</li>\n<li>Performance Brands posted $5.4 million adjusted EBITDA for the quarter and $47.9 million for the year, overcoming the Royal Purple Industrial divestiture.</li>\n<li>Montana Renewables segment posted a Q4 adjusted EBITDA with tax attributes of negative $5.4 million, but $31.3 million for the full year, impacted by transaction costs related to PTC sales. Monetization of production tax credits is expected to normalize going forward.</li>\n<li>Capital expenditures for 2026 are projected at $115 million to $145 million, up due to major scheduled maintenance, but production is still expected to increase.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Alexa Petrick, Goldman Sachs: Asked about macro setup and operational gating items for MaxSAF. Bruce Fleming responded, “The global energy transition is a regulated market… if you want to survive in that environment, be a low-cost provider, be well positioned, be able to shift gears quickly, and we think we are all 3.”</li>\n<li>Conor Fitzpatrick, BofA Securities: Inquired about RINs market and Montana Renewables margin capture. Fleming said, “We capture more than 100% of the renewable diesel index margin… the fourth quarter managed to hit the lowest renewable diesel index margin ever recorded in the history of the world.”</li>\n<li>Sameer Joshi, H.C. Wainwright: Asked about the timing and cost impact of MaxSAF ramp-up and SAF contract premiums. Borgmann replied, “We expect just continued incremental improvement there… as we increase our volume, then we'll see more unit efficiencies drop to the bottom line.” Fleming clarified that SAF contracts are structured for resilience and diversity, with linked feedstock contracts.</li>\n<li>Jason Gabelman, TD Cowen: Queried about sustainability of specialty margins and Performance Brands weakness. Scott Obermeier stated, “Our commercial excellence focus and the initiatives that we've done over the years… has proven to be highly successful, highly durable through really almost any type of market.”</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on clarity regarding regulatory developments, margin sustainability, and the ramp-up of new contracts—tone was neutral to slightly positive, with interest in operational details and financial resilience in the face of macro uncertainty.</li>\n<li>Management maintained a confident and constructive tone, repeatedly emphasizing “step change” improvements and cost discipline. Borgmann’s and Fleming’s responses were detailed and assertive, offering reassurance about execution and risk management.</li>\n<li>Compared to the previous quarter, management’s tone remained optimistic but more focused on the successful delivery of stated milestones and forward-looking growth via new contracts and expansion projects. Analysts’ tone remained consistent, with questions reflecting ongoing interest in regulatory clarity and operational execution.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance language shifted from anticipation of regulatory clarity and project progress in Q3 to confirmation of milestone achievement and new contract completions in Q4.</li>\n<li>Strategic focus moved from cost reductions and project de-risking to executing the MaxSAF 150 expansion and delivering contracted SAF volumes at premium margins.</li>\n<li>Analysts’ questions in both quarters centered on regulatory factors, margin capture, and contract placement, but the Q4 discussion reflected increased confidence in operational execution and contract fulfillment.</li>\n<li>Key metrics show continued reduction in leverage, higher adjusted EBITDA, and ongoing cost discipline. Management’s confidence remained high, now backed by successful execution rather than projections.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management acknowledged ongoing regulatory uncertainty in global energy markets but emphasized a robust framework and readiness to adapt quickly to policy changes.</li>\n<li>Heavy scheduled maintenance in 2026 introduces operational risk, but management expressed preparedness and expects production to increase despite this.</li>\n<li>Transaction costs related to PTC monetization impacted Montana Renewables’ quarterly results but are expected to normalize.</li>\n<li>Analysts raised concerns about the pace of industry utilization increases, potential margin volatility, and the durability of contract premiums, but management asserted confidence in their diversified contract portfolio and cost-positioning.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Calumet enters 2026 with a fundamentally stronger balance sheet, durable cost and reliability improvements, and clear momentum in both Specialty and Renewables segments. The MaxSAF 150 project is on track to deliver 120 million to 150 million gallons of annual SAF capacity, supported by multiyear contracts at a $1–$2 per gallon premium. Management remains focused on operational excellence, prudent capital allocation, and leveraging early mover advantages in renewables to drive long-term value creation and further deleveraging.</p>\n<p><a href=\"https://seekingalpha.com/symbol/clmt/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558923-calumet-targets-maxsaf-150-expansion-and-1-2-gallon-saf-contract-premiums-as-operational",
            "pub_date": "2026-02-28 06:21:25",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558922",
            "title": "Trump Media & Technology Group reports FY25 results",
            "description": "<html><body><ul>\n<li>Trump Media &amp; Technology Group <a href=\"https://seekingalpha.com/pr/20418159-trump-media-and-technology-group-reports-full-year-2025-results\">press release</a>  (DJT): FY Revenue of $3.7M.</li>\n<li>For 2025, TMTG had a $712.3 million consolidated net loss, most of which comprised unrealized losses stemming from a drop in the price of digital assets and digital asset related securities. This included non-cash losses related to changes in the fair value of digital assets and digital assets pledged ($403.2 million) and non-cash losses stemming from the fair value mark to market of digital asset related securities ($178.8 million). The figure also includes $59.2 million in non-cash stock-based compensation and $27.0 million in non-cash interest expense on outstanding debt, leading to consolidated adjusted EBITDA loss of $664.4 million.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558922-trump-media-technology-group-reports-fy25-results",
            "pub_date": "2026-02-28 06:11:28",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558918",
            "title": "Defence Therapeutics to raise up to $11 million in private placement",
            "description": "<html><body><ul>\n<li>Defence Therapeutics (CSE: DTC) (<span class=\"ticker-hover-wrapper\">OTCQB: <span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DTCFF\" title=\"Defence Therapeutics Inc.\">DTCFF</a></span></span>) on Friday said that it plans to raise up to $11 million through a private placement of up to 20 million units priced at $0.55 each.</li>\n<li>Each unit will consist of one common share and one warrant exercisable at $0.65 per share for 24 months.</li>\n<li>The company said it had signed a binding term sheet with two institutional investors for gross proceeds of C$6 million under the offering.</li>\n<li>Proceeds from that portion will be released in monthly cash tranches of C$333,333 over an 18-month term under a sharing agreement, with settlements beginning five months after closing.</li>\n<li>The final amount received under the sharing agreement could be more or less than C$6 million depending on the company’s share price, it said.</li>\n<li>Defence said it intends to use the proceeds to advance its antibody drug conjugate and radiopharmaceutical programs, develop partnerships and for working capital.</li>\n<li>Closing of the offering is expected on or about March 6, subject to approval by the Canadian Securities Exchange.</li>\n<li>DTCFF closed <span>-0.0%</span> at $0.44.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20418154-defence-therapeutics-announces-private-placement-of-units-for-proceeds-of-up-to-11-million\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558918-defence-therapeutics-to-raise-up-to-11-million-in-private-placement",
            "pub_date": "2026-02-28 06:11:28",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}