{
    "data": [
        {
            "id": "4558469",
            "title": "xAI co-founder Toby Pohlen latest executive to exit following SpaceX merger",
            "description": "<html><body><ul>\n<li>Toby Pohlen, a co-founder of xAI (<a href=\"https://seekingalpha.com/symbol/X.AI\" title=\"xAI\">X.AI</a>), said he is leaving Elon Musk’s AI startup, becoming the latest founding executive to exit as the company restructures after its merger with SpaceX (<a href=\"https://seekingalpha.com/symbol/SPACE\" title=\"SpaceX\">SPACE</a>).</li>\n<li>“Today was my last day @xai,” Pohlen wrote on X, saying he planned to sleep more and “think about what I want to do next.” He thanked Musk for “taking me on board.”</li>\n<li>Earlier this month another co-founder, prominent AI researcher Jimmy Ba<a href=\"https://seekingalpha.com/news/4549929-musks-xai-loses-second-co-founder-in-two-days-as-jimmy-ba-departs\" target=\"_blank\" title=\" announced \"> announced </a>that he is stepping down from xAI (<a href=\"https://seekingalpha.com/symbol/X.AI\" title=\"xAI\">X.AI</a>).</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558469-xai-co-founder-toby-pohlen-latest-executive-to-exit-following-spacex-merger",
            "pub_date": "2026-02-27 13:30:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558470",
            "title": "Vtex outlines mid- to high single-digit subscription revenue growth for 2026 while accelerating AI-driven transformation",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: VTEX (VTEX) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Co-CEO Geraldo do Carmo Thomaz acknowledged that \"our recent growth has been below our long-term ambition,\" attributing this mainly to macro challenges in Brazil and Argentina, a more promotional marketplace environment, and longer enterprise decision cycles amid the evolving AI landscape.</li>\n<li>Thomaz emphasized the company's strategy is anchored in four growth levers: global expansion, B2B, retail media, and AI, stating, \"our focus now is disciplined execution.\" He highlighted that in Q4, these levers accounted for about 15% of subscription revenue and contributed nearly half of subscription revenue growth, with global markets delivering 22% subscription revenue growth in 2025.</li>\n<li>The company reported notable client wins and expansions, including Atacado Vila Nova, Lofty Style, Luz da Lua, and TCL in Brazil, as well as Mercacentro in Colombia and Whirlpool launching KitchenAid in Canada.</li>\n<li>CFO Ricardo Sodre stated, \"2025 demonstrated the resilience of our business model and the strengthen of our unit economics,\" with continued efficiency gains and record profitability despite a slower growth environment.</li>\n<li>Sodre also noted, \"we are announcing a new $50 million 12-month share repurchase program for Class A shares.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management targets Q1 2026 subscription revenue to grow at a mid-single-digit percentage rate on an FX-neutral year-over-year basis.</li>\n<li>For the full year 2026, VTEX is targeting subscription revenue to grow at a mid- to high single-digit percentage rate on an FX-neutral basis, with gross profit expected to grow at a high single-digit to low teens percentage rate. Non-GAAP income from operations is targeted in the low 20s percentage margin, and free cash flow in the low 20s percentage margin.</li>\n<li>Sodre explained, \"Assuming FX rates remain broadly consistent with January 2026 averages, the FX-neutral growth guidance outlined above would translate into higher reported USD subscription revenue growth, adding approximately 8.4 percentage points in the first quarter and 4.5 percentage points in the full year 2026.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>GMV reached $6.3 billion in Q4 2025, representing 17.2% year-over-year growth in U.S. dollars and 10.0% in FX-neutral terms.</li>\n<li>Subscription revenue for Q4 was $66.7 million, a 12.2% increase year-over-year in U.S. dollars and 5.4% in FX-neutral terms.</li>\n<li>Subscription gross profit was $54.6 million, with a subscription gross margin of 81.8%, up from 78.8% the prior year. Total gross margin reached 79.6%.</li>\n<li>Operating expenses totaled $38 million, with income from operations of $16.2 million and an operating margin of 23.8%.</li>\n<li>Free cash flow for the quarter was $11.1 million. The company cited a $2 million severance cost due to a sales and marketing reorganization.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Unknown Analyst, JPMorgan: Asked if there is a turning point on elongated sales cycles and about the source of gross margin gains. Mariano Gomide de Faria responded, \"what we were seeing is not a deterioration in competitiveness, but a clear elongation of sales cycle... The primary driver is what we call the AI wait-and-see effect.\" Sodre clarified, \"we gained roughly 3 percentage points in subscription gross margin this quarter... this is basically all AI-driven.\"</li>\n<li>Lucca Brendim, BofA Securities: Inquired about AI risks and capital allocation. Thomaz described AI as a \"structural shift comparable to the move to the cloud,\" emphasizing VTEX’s role as the \"mission-critical orchestration layer of AI-driven commerce.\" Sodre said, \"We prioritize long-term value creation while maintaining the flexibility to navigate a dynamic macro environment.\"</li>\n<li>Rafael Oliveira, UBS: Asked about drivers for revenue growth reacceleration and the B2B pipeline. Thomaz stated, \"Q4 of 2025 subscription revenue growth of 5.4% FX-neutral reflect a cyclical slowdown... our structural foundations have never been stronger.\" On B2B, Mariano added, \"roughly half of our deals in the U.S. and EMEA are now B2B related.\"</li>\n<li>Madison Schrage, KeyBanc: Asked about global expansion priorities and AI in discoverability. Mariano explained, \"recently, precisely in December, we changed a lot of our regional approaches\" to a \"functional-oriented org chart,\" moving away from region-based management.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts raised concerns around elongated sales cycles, AI’s impact, macro headwinds, and the company's ability to reaccelerate growth, with a tone that was probing but not overtly negative.</li>\n<li>Management maintained a measured and confident tone in prepared remarks and Q&amp;A, consistently highlighting discipline and strategic execution. Thomaz used phrases like \"we are well-positioned competitively\" and \"we believe we have the right tools.\"</li>\n<li>Compared to the previous quarter, analyst tone remained focused on macro headwinds and AI’s role, while management showed increased emphasis on execution and R&amp;D investment for AI transformation.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The guidance for Q1 and FY 2026 is consistent with the previous quarter’s focus on mid- to high single-digit FX-neutral subscription revenue growth and profitability, but now includes more explicit targets for gross profit and margin.</li>\n<li>There is a greater emphasis on AI as both a product differentiator and operational efficiency driver, with a reported 3 percentage point gross margin gain attributed to AI in the current quarter.</li>\n<li>Management’s tone reveals stronger confidence in the sustainability of profitability, with a new $50 million share repurchase program as a signal of capital discipline.</li>\n<li>Analysts’ questions continued to revolve around macro challenges, sales cycles, AI adoption, and B2B pipeline, with little change in fundamental concerns.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management identified macroeconomic challenges in Brazil and Argentina, elongated enterprise sales cycles due to \"AI wait-and-see effect,\" and a more promotional marketplace environment as key risks.</li>\n<li>The company noted that 60% of revenue is from take rates on customer GMV, making net revenue retention sensitive to same-store sales growth, which saw a decline due to softer consumer spending.</li>\n<li>Management is mitigating these risks through sales and marketing reorganization, increased R&amp;D for AI products, and ongoing operational discipline.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>VTEX’s leadership emphasized a disciplined approach to execution, underscored by resilient profitability and a clear focus on leveraging AI, B2B, retail media, and global expansion to drive future growth. Management reiterated that, while macro headwinds remain, the company’s operational improvements, AI-driven margin gains, and targeted capital allocation—highlighted by a new share repurchase program—position VTEX to gradually reaccelerate growth and deepen its strategic relevance for enterprise customers in the coming quarters.</p>\n<p><a href=\"https://seekingalpha.com/symbol/vtex/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558470-vtex-outlines-mid-to-high-single-digit-subscription-revenue-growth-for-2026-while",
            "pub_date": "2026-02-27 13:30:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558465",
            "title": "Asia indexes mixed as tech stocks track weakness on Wall Street; KOSPI near all-time high",
            "description": "<html><body><div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558465-asia-indexes-mixed-as-tech-stocks-track-weakness-on-wall-street-kospi-near-all-time-high",
            "pub_date": "2026-02-27 13:25:54",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558463",
            "title": "ASML says next-gen chipmaking tool ready for high-volume production: report",
            "description": "<html><body><ul>\n<li>ASML Holding's (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ASML\" title=\"ASML Holding N.V.\">ASML</a></span></span>)<span> </span>next-generation chipmaking machine is ready for manufacturers to start bringing it into use for production at high volumes, a senior executive told Reuters, a big step for the chip industry.</li>\n<li>The Dutch company produces the world's only commercial extreme ultraviolet lithography (EUV) tools, which are a critical piece of equipment for chipmakers. This new tool will help chipmakers such as Taiwan Semiconductor Manufacturing (<a href=\"https://seekingalpha.com/symbol/TSM\" title=\"Taiwan Semiconductor Manufacturing Company Limited\">TSM</a>) and Intel (<a href=\"https://seekingalpha.com/symbol/INTC\" title=\"Intel Corporation\">INTC</a>)<span> </span>produce more powerful and efficient chips by eliminating several costly and complex steps from the chip-manufacturing process, data from ASML shows.</li>\n<li>ASML plans to release this data, which represents a key milestone, at a technical conference in San Jose on Thursday, the company's chief technology officer, Marco Pieters, <a href=\"https://www.reuters.com/business/asml-says-next-gen-euv-tools-ready-mass-produce-chips-marking-key-shift-ai-chip-2026-02-26/\" rel=\"nofollow\" target=\"_blank\" title=\" told \">told </a><em>Reuters </em>on Wednesday.</li>\n<li>It has taken ASML years to develop the costly, next-generation tools as chipmakers have attempted to determine at what point it makes economic sense to begin to use them for mass production.</li>\n<li>The new tools cost roughly $400 million, twice the cost of the original EUV machines.</li>\n<li>The High-NA EUV tools now experience limited downtime, have produced 500,000 dinner-plate-sized silicon wafers, and can draw sufficiently precise patterns that make up the circuits on the chip, the ASML data shows, Pieters said.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558463-asml-says-next-gen-chipmaking-tool-ready-for-high-volume-rroduction-report",
            "pub_date": "2026-02-27 13:05:51",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558467",
            "title": "SoundHound expects $225M–$260M revenue in 2026 as Agentic AI adoption accelerates across industries",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: SoundHound AI, Inc. (SOUN) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Keyvan Mohajer, Co-Founder, CEO, President &amp; Director, reported, “2025 was a record year for SoundHound, nearly doubling our revenue year-over-year. We also had a record fourth quarter. Revenue was up 59%, while all key profit metrics improved.” He highlighted that SoundHound signed over 100 customer deals in Q4, including major agreements with a Japanese automotive OEM for its AI assistant, a multiyear deal with a leading U.S. telecommunications company, and a global contract with a top athletic shoes and apparel brand. Mohajer emphasized SoundHound’s Agentic platform as “the only solution that is ready to be deployed across a multitude of vertical use cases and a huge and growing range of touch points,” allowing clients to build an agent once and deploy it anywhere.</li>\n<li>Notable wins in Q4 spanned automotive, restaurants, retail, health care, insurance, government, and education, including new partnerships and renewals across regions. Mohajer stated, “We are seeing great traction because our technology is delivering real-world results.” He cited specific customer outcomes such as a large health care network’s AI agent handling more than a third of all patient appointment scheduling and a telecommunications customer achieving a 20% reduction in labor costs for billing disputes.</li>\n<li>Nitesh Sharan, Chief Financial Officer, said, “Q4 was our strongest quarter with $55.1 million in revenue, up 59% and improvements across all profit measures. For the full year, we delivered $169 million in revenue, up 99% versus the prior year.” He noted, “Our monthly active users continue to expand rapidly with Q4 growth in excess of 50% year-on-year. More notably, their query activity or usage continues to accelerate with Q4 audio queries up roughly 75% from the prior year.”</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Sharan shared, “For 2026, we expect our revenue to be in a range of $225 million to $260 million. As in prior years, there will be a ramp in revenue through the year given the nature of our customer base, underlying seasonality, and expected large deal timing, both for renewals and new deals.” He reiterated the company’s commitment to profitable growth and noted, “We remain committed to delivering accelerated growth while being mindful of the journey to profitability.”</li>\n<li>Sharan also stated, “Our long-term expectation is that we can operate this business at scale with 70% plus gross margins and 30% plus EBIT margins.”</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Q4 revenue was $55.1 million, up 59% year-over-year, with enterprise AI, restaurants, and automotive verticals highlighted as growth drivers. For the full year, revenue reached $169 million, nearly doubling from the prior year.</li>\n<li>Sharan reported, “Our GAAP gross margin was 48% and adjusted for noncash amortization of purchase intangibles and employee stock compensation, our non-GAAP gross margin was 61%.” Adjusted EBITDA was a loss of $7.4 million, an improvement of 56% year-over-year. GAAP net income was $40.1 million and GAAP net earnings per share of $0.10, positively impacted by a change in fair value of contingent liabilities. Non-GAAP net loss was $7.3 million and non-GAAP net loss per share was $0.02.</li>\n<li>The balance sheet showed cash and equivalents at quarter end of $248 million with no debt.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Scott Buck, H.C. Wainwright &amp; Co.: Asked about deployment and customer service capacity constraints. Mohajer answered, “We are definitely doing a lot… advances in AI… allow us to deploy faster, go live faster, develop faster. And we are able to keep up with the demand with fewer people and less resources. So demand is going up and what we need to do… is actually going down.”</li>\n<li>Buck followed up on renewals and upselling. Mohajer said, “These renewals are actually an upsell moment because we bring them the Agentic solution… it's basically the renewal with a price increase and sometimes with a bigger volume commitment.”</li>\n<li>Brian Schwartz, Oppenheimer: Inquired about the durability of enterprise AI with LLM competition. Mohajer responded that automation is disrupting traditional software and services but is a tailwind for SoundHound, enabling faster and higher quality delivery. Schwartz asked about investment profile; Sharan said, “We are now shifting from… heavy investment… to this era of breakeven… every incremental dollar point, that should go into fueling growth, but we need to be mindful that we're going to do it efficiently.”</li>\n<li>Vijay Devar (for Mike Latimore, Northland): Queried about Amelia customers on Agentic AI version 7.3 and revenue impact. Sharan said, “We assume that we kind of are on a pathway to get the majority -- vast majority, I think, over 75% migrated over by the middle of this year.” Mohajer added, “Just a pure higher containment rate is expected to increase our revenue. Many of our deals, we get paid when we successfully avoid a caller to go to a human.”</li>\n<li>James Fish, Piper Sandler: Asked how Amelia wins new CX customers over competitors. Mohajer highlighted SoundHound’s deep technology, data, and multi-industry partnerships, stating, “By choosing SoundHound, they are more guaranteed to get the best as soon as it becomes available, no matter where it comes from.” Fish also asked about M&amp;A in guidance and stock-based comp; Sharan replied, “No, our guidance does not contemplate M&amp;A that we haven't done… Our outlook reflects the base of business, the pipeline of deals… we will… update an outlook, we will certainly do that like we have in the past.” On stock comp, Sharan said equity is broadly distributed, and dilution is a consideration, but expects normalization as the company scales.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused on deployment capacity, durability against LLM competition, upsell dynamics, customer migration, pricing, and M&amp;A strategy. Their tone was inquisitive and occasionally skeptical, especially around competitive threats and cost structure.</li>\n<li>Management maintained a confident and assertive stance, often emphasizing efficiency, technological leadership, and market traction. During Q&amp;A, responses remained detailed and direct, with statements like, “We are able to keep up with the demand with fewer people and less resources.”</li>\n<li>Compared to the previous quarter, both management and analysts’ tone is slightly more confident, with management highlighting record performance and an improved path to profitability while analysts probed for risks but acknowledged strong results.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 revenue increased to $225 million–$260 million, compared to the previous year’s range and a strong Q4 performance. The company reiterated the transition to a breakeven phase, highlighting operational efficiencies and cost discipline.</li>\n<li>Management’s tone is more optimistic, citing record customer wins and diversified revenue sources. Analysts’ focus shifted from concerns about automotive softness and integration of acquisitions to exploring expansion capacity and competitive differentiation.</li>\n<li>Gross margin and profitability metrics improved sequentially. The company reported stronger customer diversification and no single customer contributing more than 10% of revenue.</li>\n<li>Strategic priorities remain on Agentic AI, voice commerce, and continued expansion across industries and regions.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management acknowledged resource allocation across expanding verticals but cited AI advances as a mitigating factor for scaling efficiently.</li>\n<li>Analysts raised questions about capacity, pricing, competitive threats from large LLM providers, and stock-based compensation dilution.</li>\n<li>Mohajer and Sharan described mitigation strategies, including upselling existing customers, leveraging proprietary technology, focusing on outcome-based pricing, and maintaining a disciplined approach to M&amp;A.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>SoundHound closed 2025 with record revenue growth and a strong pipeline, driven by broad adoption of its Agentic AI platform and deeper expansion into key verticals. The company projects 2026 revenue between $225 million and $260 million and expects operational efficiencies and customer migration to advanced AI solutions to further fuel growth. Management underscored its commitment to profitability, innovation, and delivering outcome-based value to customers, positioning SoundHound for continued momentum in the evolving AI landscape.</p>\n<p><a href=\"https://seekingalpha.com/symbol/soun/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558467-soundhound-expects-225m-260m-revenue-in-2026-as-agentic-ai-adoption-accelerates-across",
            "pub_date": "2026-02-27 13:00:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557943",
            "title": "Friday’s Economic Calendar",
            "description": "<html><body><div>\n<h3>8:30 AM International Trade in Goods (Advance) </h3> <p data-eci=\"true\">This monthly report offers advance import and export data on the goods components of the monthly trade report.</p> <h3>8:30 AM PPI-Final Demand </h3> <p>The Producer Price Index (PPI) of the Bureau of Labor Statistics (BLS) is a family of indexes that measures the average change over time in the prices received by domestic producers of goods and services.</p> <p>January is expected to show monthly increases of 0.3 percent for total and 0.3 percent for core. </p> <h3>9:45 AM Chicago PMI </h3> <p>The Institute for Supply Management - Chicago compiles a survey and a composite diffusion index of business conditions in the Chicago area. </p> <p>Forecasters expect a slight retreat to 52.5 from a remarkably, surprisingly strong 54.0 in January, after years of contraction. </p> <h3>9:55 AM Construction Spending </h3> <p>The dollar value of new construction activity on residential, non-residential, and public projects. </p> <p>A moderate 0.3 percent rise is the call for December.</p> <h3>1:00 PM Baker Hughes Rig Count </h3> <p>The Baker Hughes North American rig count tracks weekly changes in the number of active operating oil &amp; gas rigs.</p> <h3>3:00 PM Farm Prices </h3> <p>The Department of Agriculture releases at the end of the month the index of prices received by farmers for the preceding month. </p> </div>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557943-fridays-economic-calendar",
            "pub_date": "2026-02-27 13:00:56",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558464",
            "title": "Expensify outlines $6M–$9M free cash flow guidance for 2026 amid expanded AI investment and sales push",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Expensify (EXFY) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Ryan Schaffer, CFO &amp; Director, reported that Expensify \"generated nearly $20 million in free cash flow\" for fiscal year 2025 and highlighted the company's role as the title sponsor of Apple's F1 movie. He shared, \"Revenue was $35.2 million\" for Q4, with average paid members at 650,000 and total interchange of $5.5 million. Schaffer also pointed out, \"Our Q4 operating cash flow was $2.2 million. Our Q4 free cash flow was $3.2 million and net loss was $7.1 million. Our Q4 non-GAAP net loss was $2.1 million and adjusted EBITDA was $3.3 million.\"</li>\n<li>Schaffer stated, \"We are initiating fiscal year 2026 free cash flow guidance of $6 million to $9 million. That's lower than previous years due to a conservative outlook on 2026, combined with the fact that we are expecting to increase investment in sales and marketing as well as AI this year.\"</li>\n<li>Expensify entered a multiyear integration partnership with Uber for Business to automate travel and meal receipts, and was recognized with the TrustRadius 2026 Buyers' Choice Award in the expense management category.</li>\n<li>CEO David Barrett announced, \"New Expensify now has full feature parity with Classic for customers representing 90% of our revenue. That's the target we've been working towards, and we've hit it.\" Barrett added, \"We've now rolled it out to 63% of Classic customers.\"</li>\n<li>Barrett emphasized, \"Expensify connects to over 10,000 global banks and over 80% of those card imports happen via direct bank connections at 0 marginal cost to us.\" He also detailed the launch of a new free submit plan to drive grassroots adoption and explained, \"Our chat-first design makes us AI first by definition, and Concierge is the accountable AI that knows what you're talking about, can fix itself and wrong and works while you sleep.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Schaffer communicated, \"We are initiating fiscal year 2026 free cash flow guidance of $6 million to $9 million. That's lower than previous years due to a conservative outlook on 2026, combined with the fact that we are expecting to increase investment in sales and marketing as well as AI this year.\"</li>\n<li>Expensify expects continued focus on migration of its approved accounting network and ongoing investment in AI and performance improvements. January paid members were reported at 626,000, with management citing seasonality and expectations for future growth in member counts as the year progresses.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Q4 revenue was $35.2 million, with average paid members at 650,000 and total interchange at $5.5 million. Q4 operating cash flow reached $2.2 million, free cash flow was $3.2 million, net loss was $7.1 million, non-GAAP net loss was $2.1 million, and adjusted EBITDA was $3.3 million.</li>\n<li>For the full year 2025, revenue was $142.1 million and total interchange was $21.3 million. Operating cash flow was $20.1 million, free cash flow was $19.9 million, and net loss was $21.4 million. Non-GAAP net income was $5.2 million and adjusted EBITDA was $16.9 million.</li>\n<li>Expensify repurchased over 4.8 million shares of Class A common stock, totaling approximately $9 million in 2025.</li>\n<li>Expensify Travel bookings in Q4 increased 434% compared to Q4 2024, and interchange increased 24% year-over-year for fiscal year 2025.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Aaron Kimson, Citizens JMP Securities, LLC, Research Division: \"What's Expensify's place in an AI world where you can buy code to semifunctional expense management app. I know you just talked about Concierge and the differentiation there. And then what are the primary moats that you see for the business?\" CEO David Barrett: \"Collaboration is one of the key differentiations... Expensify is a tool for collaborating with other AIs as well. ...AI can only really automate what you can personally do... But AI can't like just issue a virtual card. Like you don't have that ability. ...AI doesn't make you PCI compliant. ...I think we've made a point starting years ago, recognizing there's this huge AI disruption on the way. And we invested for 5 years to build a platform that we think isn't merely designed to kind of survive this AI title wave, but really ride it and thrive in it.\"</li>\n<li>Kimson: \"This was the first quarter that paid members have increased since 4Q '24... what do you attribute that small increase in paid members to -- in 4Q '25?\" CFO Schaffer: \"Q4 is generally pretty strong in the same way that January is usually not. ...it's expected because we typically see seasonality. However, I think migration obviously helps us retain customers. ...we think that it's going to help user growth in general.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analyst questions focused on long-term differentiation and competitive moats in an AI-driven software landscape, as well as drivers behind member growth, with a slightly skeptical tone regarding the company's ability to defend its position and maintain growth.</li>\n<li>Management remained confident and optimistic, with Barrett stating, \"I think we've made a point starting years ago, recognizing there's this huge AI disruption on the way. And we invested for 5 years to build a platform that we think isn't merely designed to kind of survive this AI title wave, but really ride it and thrive in it.\"</li>\n<li>Compared to the previous quarter, management's tone was similarly confident, with continued emphasis on AI differentiation and product-led growth. Analysts’ tone continues to be probing on competitive positioning and growth attribution.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Q4 revenue was $35.2 million, slightly above Q3's $35.1 million. Average paid members grew to 650,000 from 642,000 in Q3. Q4 operating cash flow was $2.2 million, compared to $4.2 million in Q3. Q4 free cash flow rose to $3.2 million from $1.2 million in Q3.</li>\n<li>The company completed the migration to feature parity between New Expensify and Classic for 90% of revenue, compared to targeting this milestone in Q3.</li>\n<li>Guidance shifted from a fiscal year 2025 free cash flow range of $19 million to $23 million in Q3 to a lower 2026 guidance of $6 million to $9 million, reflecting increased investment plans.</li>\n<li>Management’s confidence on AI-first strategy and migration progress remained strong, with a notable increase in emphasis on AI-driven product features and cross-selling momentum. Analyst focus shifted toward competitive sustainability and attribution of member growth.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management cited a \"conservative outlook on 2026\" and highlighted increased investment in sales, marketing, and AI as reasons for lower free cash flow guidance.</li>\n<li>Analysts raised concerns about Expensify's differentiation and competitive moat in an environment where AI lowers product development barriers.</li>\n<li>Management outlined that Expensify's strengths include collaborative workflows, regulatory compliance, and the ability to offer spend controls for both human and AI agents.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Expensify closed 2025 with platform migration milestones, robust travel and card growth, and nearly $20 million in free cash flow, while setting a more cautious 2026 free cash flow target of $6 million to $9 million as it increases investments in AI and go-to-market initiatives. Management highlighted new integration partnerships, the rollout of an AI-first product design, and share repurchases as signals of confidence in the business's long-term prospects and continued focus on product-led growth.</p>\n<p><a href=\"https://seekingalpha.com/symbol/exfy/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558464-expensify-outlines-6m-9m-free-cash-flow-guidance-for-2026-amid-expanded-ai-investment-and",
            "pub_date": "2026-02-27 12:50:54",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558461",
            "title": "Allison Transmission raises dividend by 7% to $0.29",
            "description": "<html><body><ul>\n<li>Allison Transmission Holdings (ALSN) declares <a href=\"https://seekingalpha.com/pr/20416539-allison-announces-a-7-percent-increase-to-the-quarterly-dividend-and-the-annual-stockholders\" target=\"_blank\">$0.29/share quarterly dividend</a>, <font color=\"green\">7.4% increase</font> from prior dividend of $0.27.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/ALSN/dividends/yield?source=news_bullet\">Forward yield</a> 0.93%</li>\n<li>Payable March 20; for shareholders of record March 9; ex-div March 9.</li>\n<li><a href=\"https://seekingalpha.com/symbol/ALSN/dividends?source=news_bullet\">See ALSN Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558461-allison-transmission-raises-dividend-by-7-to-029",
            "pub_date": "2026-02-27 12:46:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558446",
            "title": "Anthropic CEO rejects Pentagon demand for unrestricted model access, says threats won’t sway it",
            "description": "<html><body><p data-eci=\"true\">Anthropic (<a href=\"https://seekingalpha.com/symbol/ANTHRO\" title=\"Anthropic\">ANTHRO</a>) on Thursday said that the company “cannot in good conscience” allow the Department of Defense to use its models in all lawful use cases without limitation, adding that the agency’s threats do not change its position.</p>\n<p>“It is the Department’s prerogative to select contractors most aligned with their vision,” CEO Dario Amodei wrote in<span> </span><a href=\"https://www.anthropic.com/news/statement-department-of-war\" rel=\"noopener\" target=\"_blank\">a statement.</a><span> </span>“But given the substantial value that Anthropic’s technology provides to our armed forces, we hope they reconsider.”</p>\n<p><span>\"Partially autonomous weapons, like those used today in Ukraine, are vital to the defense of democracy. Even </span><em>fully<span> </span></em><span>autonomous weapons (those that take humans out of the loop entirely and automate selecting and engaging targets) may prove critical for our national defense. But today, frontier AI systems are simply not reliable enough to power fully autonomous weapons. We will not knowingly provide a product that puts America’s warfighters and civilians at risk,\" he added. </span></p>\n<p>The<span> AI </span>startup has been engaged in tense negotiations with the Pentagon lately, and it said Thursday that those discussions are still ongoing. Defense Secretary Pete Hegseth has threatened to label Anthropic a “supply chain risk” or to invoke the Defense Production Act to force the company to comply with its demands.</p>\n<p><span>Hegseth</span> met with <span>Amodei</span> at the <span> Pentagon</span> on Tuesday and gave <span>Anthropic</span> until Friday evening to accept his agency’s terms. According to a senior Pentagon official, the <span>United States Department of Defense</span> delivered its “last and final offer” to Anthropic on Wednesday night, CNBC reported.</p>\n<p>Chief Pentagon spokesman Sean Parnell said Thursday that the DoD has “no interest” in using Anthropic’s (<a href=\"https://seekingalpha.com/symbol/ANTHRO\" title=\"Anthropic\">ANTHRO</a>) models for fully autonomous weapons or to conduct mass surveillance of Americans, which he noted is illegal. He emphasized that the agency wants the company to agree to allow its models to be used for “all lawful purposes.”</p>\n<p>“This is a simple, common-sense request that will prevent Anthropic from jeopardizing critical military operations and potentially putting our warfighters at risk,” Parnell wrote in<span> </span><a href=\"https://x.com/SeanParnellASW/status/2027072228777734474?s=20\" rel=\"noopener\" target=\"_blank\">a post<span> </span></a>on X on Thursday. “We will not let ANY company dictate the terms regarding how we make operational decisions.”</p>\n<p data-end=\"213\" data-start=\"0\"><span>Anthropic (<a href=\"https://seekingalpha.com/symbol/ANTHRO\" title=\"Anthropic\">ANTHRO</a>)</span> signed a $200 million contract with the <span>United States Department of Defense</span> in July, becoming the first lab to deploy its models in mission workflows on classified networks. Rivals <span>OpenAI (<a href=\"https://seekingalpha.com/symbol/OPENAI\" title=\"OpenAI\">OPENAI</a>)</span>, <span>Google</span> (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>), and <span>xAI</span> (<a href=\"https://seekingalpha.com/symbol/X.AI\" title=\"xAI\">X.AI</a>) also received DoD awards worth up to $200 million last year.</p>\n<div><div data-module=\"mps-slot\" id=\"MidResponsive-1\"></div></div>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558446-anthropic-ceo-rejects-pentagon-demand-for-unrestricted-model-access-says-threats-wont-sway-it",
            "pub_date": "2026-02-27 12:46:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558451",
            "title": "Graphic Packaging Holding declares $0.11 dividend",
            "description": "<html><body><ul>\n<li>Graphic Packaging Holding (GPK) declares <a href=\"https://seekingalpha.com/pr/20416404-graphic-packaging-holding-company-declares-quarterly-dividend\" target=\"_blank\">$0.11/share quarterly dividend</a>, in line with previous.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/GPK/dividends/yield?source=news_bullet\">Forward yield</a> 3.63%</li>\n<li>Payable April 8; for shareholders of record March 15; ex-div March 12.</li>\n<li><a href=\"https://seekingalpha.com/symbol/GPK/dividends?source=news_bullet\">See GPK Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558451-graphic-packaging-holding-declares-0_11-dividend",
            "pub_date": "2026-02-27 12:36:38",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}