{
    "data": [
        {
            "id": "4402765",
            "title": "Raiffeisen Bank targets 6-7% loan growth and 15.2% CET1 ratio in 2025 amid strategic reshaping",
            "description": "<html><body><p>Earnings Call Insights: Raiffeisen Bank International AG (<a href=\"https://seekingalpha.com/symbol/RAIFF\" title=\"Raiffeisen Bank International AG\">OTCPK:RAIFF</a>) Q4 2024</p> <h3>Management View</h3> <ul> <li>Johann Strobl, CEO, reported group consolidated profits of €1.157 billion, reflecting a significant year-on-year decline due to provisions in Russia and the €824 million impact from the Belarus sale. Excluding Russia and Belarus, consolidated profits<span class=\"paywall-full-content invisible\"> for the core group stood at €975 million, with a return on equity of 15%, slightly exceeding guidance. </span> </li> <li class=\"paywall-full-content invisible\">Loans to customers increased by 3% in 2024, while net interest income was flat at €4.155 billion. Fee income grew by 5% to €1.804 billion. Operating expenses finished at €3.3 billion, resulting in a cost-income ratio of 52.5%.</li> <li class=\"paywall-full-content invisible\">A dividend proposal of €1.1 per share was announced, slightly lower than the previous year, reflecting the group's effort to offer shareholders consistent returns despite headwinds.</li> <li class=\"paywall-full-content invisible\">CFO Hannes Mosenbacher highlighted risk costs at 27 basis points for the core group, below the 35 basis points guidance, and noted €370 million in overlays available for 2025.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management expects net interest income to remain stable in 2025, with fee income seeing further improvements. Operating expenses are projected around €3.45 billion, maintaining a cost-income ratio of 52.5%.</li> <li>Loan growth for 2025 is targeted at 6-7%, driven by stronger performance in key markets such as Slovakia, Romania, and Czechia.</li> <li>The CET1 ratio, excluding Russia, is projected to stabilize at 15.2% by the end of 2025, supported by Basel IV implementation.</li> <li>CEO Strobl outlined expectations for profitability at around 10% in 2025, with potential for 13% return on equity once legacy litigation issues in Poland are resolved.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Group consolidated profits fell year-on-year due to the €824 million impact from the Belarus sale and litigation provisions in Poland. For the core group, excluding Russia and Belarus, profits remained stable at €975 million.</li> <li>Fee income grew by 5% year-on-year to €1.804 billion, supported by strong seasonal performance across key markets and product lines in Q4.</li> <li>Net interest income was stable at €4.155 billion, with slight positive contributions from Austria and Czech Republic offsetting headwinds.</li> <li>Loans to customers increased by 3%, with strong trends in corporate lending in Austria and stable retail portfolios, particularly in Slovakia and Czech Republic.</li> <li>Liquidity remained robust, with a CET1 ratio of 15.1% for the core group, excluding Russia.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Benoit Petrarque, Kepler Cheuvreux: Questioned updates on the Russia exit process. CFO Mosenbacher stated that legal proceedings in Russia are delaying potential deals, although discussions with interested parties continue. CEO Strobl added that complexities around equity valuation and legal constraints are key hurdles.</li> <li>Riccardo Rovere, Mediobanca: Asked about the potential to extract dividends from Russian operations. CEO Strobl expressed skepticism about regulatory approval for dividends given current constraints.</li> <li>Paul Fenner, Societe Generale: Inquired about provisions related to the Russian court case. CEO Strobl explained that the €800 million provision reflects current valuation assumptions and legal uncertainties, with further developments contingent on court outcomes.</li> <li>Simon Nellis, Citi: Queried the rationale behind the €1.1 dividend proposal. CEO Strobl emphasized the importance of maintaining a CET1 ratio above the 14.5% target, given ongoing uncertainties.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed skepticism and concern, particularly regarding the ongoing challenges in Russia and the impact of litigation provisions in Poland. Questions focused on the pace of business reduction and potential financial risks.</li> <li>Management maintained a cautiously optimistic tone during prepared remarks but displayed a defensive posture in addressing analyst concerns, particularly regarding Russia. CEO Strobl consistently reiterated the group’s compliance efforts and commitment to derisking.</li> <li>Compared to the previous quarter, management's tone reflected a slight increase in confidence, particularly regarding the core group's performance and outlook.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance for profitability and loan growth has improved, with 2025 targets reflecting higher confidence in operational stability.</li> <li>Strategic focus has shifted further towards derisking the Eastern European footprint, with the closure of the Belarus sale and continued reduction of Russian operations.</li> <li>Analyst questions in the current quarter were more focused on legal and regulatory risks, reflecting heightened concerns compared to the prior period.</li> <li>Management's tone showed a slight improvement in confidence, particularly regarding fee income growth and CET1 ratio stability.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Legal proceedings in Russia, including the €244 million court ruling and related provisions, pose significant uncertainties.</li> <li>Litigation provisions in Poland continue to weigh on profitability, though management expects some relief in 2025.</li> <li>Challenges in exiting Russia are compounded by regulatory constraints and equity valuation complexities.</li> <li>Macroeconomic weaknesses in Austria and Germany, combined with geopolitical risks, remain ongoing concerns.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Raiffeisen Bank International's Q4 2024 performance reflects a stable core group despite external challenges, including legal provisions and the Belarus sale impact. Management provided a cautiously optimistic outlook for 2025, targeting 6-7% loan growth, a 15.2% CET1 ratio, and stable net interest income. However, ongoing litigation and geopolitical tensions remain critical risks to monitor. Investors will likely focus on the group's ability to navigate these challenges while maintaining operational resilience and profitability.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/RAIFF/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402765-raiffeisen-bank-targets-6minus-7-percent-loan-growth-and-15_2-percent-cet1-ratio-in-2025-amid",
            "pub_date": "2025-02-04 19:04:38",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402759",
            "title": "PepsiCo targets low single-digit organic sales growth for 2025 amid selective investments",
            "description": "<html><body><p>Earnings Call Insights: PepsiCo (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/PEP\" title=\"PepsiCo, Inc.\">PEP</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li>CEO Ramon Laguarta highlighted significant reinvestments in Frito-Lay during Q4, funded by one-time gains, with a focus on creating infrastructure to capitalize on opportunities in 2025. He mentioned addressing both value and premium segments<span class=\"paywall-full-content invisible\"> through better price pack architecture and investments in innovation for untapped spaces, particularly in away-from-home opportunities.</span> </li> <li class=\"paywall-full-content invisible\">Laguarta emphasized the growth of PepsiCo's international business, now almost a $40 billion operation, which remains accretive to margins and represents a significant growth driver.</li> <li class=\"paywall-full-content invisible\">CFO Jamie Caulfield noted a 3-point foreign exchange headwind due to a stronger dollar, primarily impacting regions like Mexico. He also cited increased net interest expenses and pension expenses as factors affecting the 2025 financial outlook.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Management issued low single-digit organic sales growth guidance for 2025, reflecting a cautious stance amid global uncertainty and geopolitical factors. They anticipate gradual improvement in North America performance as the year progresses, supported by innovation, away-from-home expansion, and pricing strategies.</li> <li>Laguarta stated that while global unemployment levels are low and inflation appears to be improving, the company remains cautious due to persistent volatility, including geopolitical risks.</li> <li>The company plans to continue systematic productivity programs such as automation, digitalization, and simplification to drive profitability while maintaining flexibility for reinvestments.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>PepsiCo reported a Q4 adjusted EPS of $1.94, aligning with analysts’ expectations. Revenues were $27.89 billion, also meeting estimates.</li> <li>Frito-Lay North America experienced a sequential decline in volumes but saw reinvestments aimed at boosting future growth. The beverages business in North America showed continued margin improvement, aligning with the company's mid-teens margin aspirations for this segment.</li> <li>International markets contributed significantly, with particular strength in Southeast Asia, India, and Brazil. However, softer performance in China, Mexico, and parts of Western Europe, as well as geopolitical challenges in the Middle East, presented headwinds.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>Lauren Lieberman, Barclays: Questioned the ROI of Frito-Lay reinvestments given sequential volume declines. Jamie Caulfield responded that investments were aimed at building momentum for 2025, supported by productivity savings.</li> <li>Bonnie Herzog, Goldman Sachs: Asked about EPS guidance flexibility and investment levels. Laguarta explained the cautious guidance reflects geopolitical risks, while investments are focused on price pack architecture and long-term growth.</li> <li>Steve Powers, Deutsche Bank: Probed whether Frito-Lay pricing could turn negative. Laguarta clarified that the strategy involves surgical price-pack adjustments rather than outright pricing reductions.</li> <li>Robert Moskow, TD Cowen: Inquired about the impact of GLP drugs on salty snack consumption. Laguarta stated no material impact yet, though heightened health awareness among consumers is accelerating portfolio evolution.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts expressed cautious optimism, focusing on concerns about Frito-Lay's ROI, pricing strategies, and category growth sustainability. Sentiment leaned skeptical but constructive.</li> <li>Management maintained confidence during prepared remarks, emphasizing long-term opportunities and resilience. However, responses during Q&amp;A became more defensive, particularly around Frito-Lay investments and pricing strategies.</li> <li>Compared to the previous quarter, management's tone was slightly more cautious, reflecting a volatile macroeconomic backdrop.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Guidance shifted from 4% organic revenue growth in Q3 to low single digits for Q4, emphasizing a more conservative outlook for 2025.</li> <li>Management reiterated confidence in long-term category growth but emphasized short-term tactical adjustments, particularly in North America.</li> <li>Analysts continued to focus on Frito-Lay's performance, with recurring concerns about pricing and ROI on investments.</li> <li>Management's tone remained consistent in highlighting productivity initiatives but showed increased caution regarding geopolitical and consumer uncertainties.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Macroeconomic volatility and geopolitical risks were highlighted as significant challenges. Management acknowledged the impact of a strong dollar and potential government decisions on operations.</li> <li>Analysts raised concerns about category growth sustainability, pricing strategies, and the ROI of Frito-Lay reinvestments.</li> <li>Management pointed to productivity programs and portfolio evolution as key mitigation strategies but acknowledged near-term pressures.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">PepsiCo presented a cautious yet optimistic outlook for 2025, emphasizing low single-digit organic sales growth supported by reinvestments in Frito-Lay, international expansion, and margin improvements in North America beverages. While management expressed confidence in long-term growth drivers, analysts remained concerned about the short-term ROI of investments and the sustainability of category growth amid a volatile macroeconomic environment.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/PEP/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402759-pepsico-targets-low-single-digit-organic-sales-growth-for-2025-amid-selective-investments",
            "pub_date": "2025-02-04 18:56:23",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402729",
            "title": "Oaktree Specialty Lending Q1 results hurt by lower interest income, investment on non-accrual",
            "description": "<html><body><p>Oaktree Specialty Lending (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/OCSL\" title=\"Oaktree Specialty Lending Corporation\">OCSL</a></span>) stock <span style=\"color: #ff0000;\">dropped 3.0%</span> in Tuesday morning trading after the business development company's quarterly total investment income missed the Wall Street consensus as interest income declined and due to the impact of several investments on<span class=\"paywall-full-content invisible\"> non-accrual status.</span></p> <p class=\"paywall-full-content invisible\">Fiscal Q1 adjusted net <a href=\"https://seekingalpha.com/pr/19990039-oaktree-specialty-lending-corporation-announces-first-fiscal-quarter-2025-financial-results\" rel=\"noopener\" target=\"_blank\" title=\"investment income per share of $0.54\">investment income per share of $0.54</a>, meeting the consensus estimate, slipped from $0.55 in the prior quarter, as adjusted total investment income dropped and operating expenses rose, partly offset by lower interest expense and lower management and Part I incentive fees.</p> <p class=\"paywall-full-content invisible\">\"We had several positive outcomes within the portfolio, but continued to face challenges with several names,\" said CEO and Co-Chief Investment Officer Armen Panossian. We remain focused on our underperforming borrowers, working through each situation to identify the appropriate course of action.</p> <p class=\"paywall-full-content invisible\">Missing the consensus of $91.9M, adjusted total investment income for the quarter ended Dec. 31, 2024, decreased to $87.1M from $94.7M in the prior quarter, driven by lower interest income due to declines in reference rates, the impact of certain investments placed on non-accrual status, a smaller investment portfolio, lower dividend income, and lower fee income from a decrease in prepayment fees.</p> <p class=\"paywall-full-content invisible\">Net asset value per share of $ at Dec. 31, 2024 rose/fell from $18.09 at Sept. 30.</p> <p class=\"paywall-full-content invisible\">Oaktree Specialty (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/OCSL\" title=\"Oaktree Specialty Lending Corporation\">OCSL</a></span>) originated $198.1M of new investment commitments and received $352.4M of proceeds from prepayments, exits, other paydowns, and sales during the quarter. The weighted average yield on new debt investments was 9.6%.</p> <p class=\"paywall-full-content invisible\">As of Dec. 31, 2024, the company had nine investments on non-accrual status, which represented 5.1% of the debt portfolio at cost and 3.9% of the debt portfolio at fair value. That compared with nine investments on non-accrual, representing 4.9% of cost and 4.0% of the portfolio's fair value, as of Sept. 30, 2024.</p> <p class=\"paywall-full-content invisible\">On Jan. 31, 2025, Oaktree Specialty (<a href=\"https://seekingalpha.com/symbol/OCSL\" title=\"Oaktree Specialty Lending Corporation\">OCSL</a>) and Oaktree Capital I LP, an affiliate of its adviser, entered a purchase agreement under which Oaktree Capital I purchased 5,672,149 OCSL shares on Feb. 3 for $100.0M. The shares were sold at the company’s net asset value per share as of Jan. 31, 2025, which was $17.63 per share, representing a 10% premium to the stock's closing price on Jan. 31, 2025.</p> <p class=\"paywall-full-content invisible\">Conference<a href=\"https://investors.oaktreespecialtylending.com/\" rel=\"noopener\" target=\"_blank\" title=\" call \"> call </a>at 11:00 AM ET.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1322205585/image_1322205585.jpg",
            "link": "https://seekingalpha.com/news/4402729-oaktree-specialty-lending-q1-results-hurt-by-lower-interest-income-investment-on-non-accrual",
            "pub_date": "2025-02-04 18:54:02",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402756",
            "title": "Sun Country Airlines projects Q1 2025 revenue of $330M-$340M with 7%-9% block hour growth",
            "description": "<html><body><p>Earnings Call Insights: Sun Country Airlines (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/SNCY\" title=\"Sun Country Airlines Holdings, Inc.\">SNCY</a></span>) Q4 2024</p> <h3>Management View</h3> <ul> <li><p>CEO Jude Bricker emphasized the company’s diversified business model, which combines scheduled service, charter, and cargo operations to deliver flexibility and mitigate external shocks. He highlighted agreements in principle with unions for flight<span class=\"paywall-full-content invisible\"> attendants and dispatchers, expected to improve work conditions. </span></p></li> <li class=\"paywall-full-content invisible\"><p>The company took delivery of its first cargo aircraft from a new agreement with Amazon, with plans to grow the cargo fleet to 20 aircraft by summer 2025. Cargo revenue is projected to double within the next year. </p></li> <li class=\"paywall-full-content invisible\"><p>Bricker also noted progress in scheduled service TRASM, which increased nearly 5% in December and January, signaling positive demand trends. He expects continued improvement in unit revenues.</p></li> <li class=\"paywall-full-content invisible\"><p>CFO Dave Davis reported Q4 2024 total revenue of $260.4 million and an adjusted operating margin of 10.6%, both record highs for the company. Adjusted diluted EPS for the year stood at $1.05, and full-year revenue reached $1.08 billion. He stated that cargo and charter revenues were key drivers of growth. </p></li> <li class=\"paywall-full-content invisible\"><p>Davis also highlighted disciplined cost management, with full-year adjusted CASM increasing only 1.3% year-over-year. He expects ex-fuel operating expenses to align with a 9%-10% block hour increase in 2025.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management forecasts Q1 2025 total revenue between $330 million and $340 million, supported by 7%-9% block hour growth. Operating margin is expected to range from 17% to 21%.</p></li> <li><p>Scheduled service ASMs are anticipated to grow 7% in Q1 2025, while unit revenues are projected to remain flat year-over-year.</p></li> <li><p>Cargo operations are poised for sharp growth as eight additional Amazon aircraft are integrated by late summer. Revised Amazon contract rates will escalate throughout 2025, fully taking effect in the second half.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Q4 2024 total revenue of $260.4 million exceeded analysts' estimates of $258 million. Adjusted operating margin reached 10.6%, driven by a 6.1% increase in total revenue compared to the prior year.</p></li> <li><p>Cargo revenue grew 13.1% year-over-year to a quarterly high of $28.6 million, with revenue per block hour up 16%. Charter revenue also rose 2.3% to $48 million, bolstered by a 27% increase in ad hoc charter revenue.</p></li> <li><p>Full-year 2024 operating margin was 9.9%, while adjusted operating margin reached 10.4%, demonstrating operational resilience despite industry overcapacity.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Ravi Shanker, Morgan Stanley: Asked about the impact of strong European demand on Sun Country. CEO Bricker stated that while the airline doesn’t operate in Europe, capacity reallocation to transatlantic markets benefits Sun Country, positively affecting domestic demand.</p></li> <li><p>Duane Pfennigwerth, Evercore: Inquired about booking patterns and capacity adjustments. Bricker explained that holding capacity further out and stabilizing pricing resulted in higher fares and slightly lower load factors.</p></li> <li><p>Brandon Oglenski, Barclays: Asked about network priorities for summer 2025. Bricker highlighted plans to reduce marginally performing markets and improve yields through capacity adjustments.</p></li> <li><p>Catherine O’Brien, Goldman Sachs: Questioned the impact of new labor agreements and fuel costs on Q1 margins. Davis expressed confidence in achieving strong first-quarter results despite these factors.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Analysts expressed cautious optimism, with questions focusing on capacity adjustments, margin resilience, and growth in cargo operations. Concerns about competitive capacity and seasonal demand were evident.</p></li> <li><p>Management maintained a confident tone, emphasizing operational flexibility and growth opportunities, particularly in cargo. Statements like \"we are confident in that guidance\" and \"we expect fares to be substantially higher\" underscored their positive outlook.</p></li> <li><p>Compared to the previous quarter, analysts were more focused on strategic growth areas, while management exhibited increased confidence in navigating capacity rationalization and industry dynamics.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Guidance language shifted from emphasizing modest capacity increases in Q3 to highlighting significant cargo growth and strategic capacity reductions in Q4.</p></li> <li><p>Scheduled service TRASM trends improved, with Q4 seeing a flat year-over-year performance compared to steep declines earlier in 2024.</p></li> <li><p>Analysts shifted their focus from overcapacity concerns in Q3 to strategic opportunities in cargo and network optimization in Q4.</p></li> <li><p>Management's tone appeared more confident, driven by record financial results and positive demand trends.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li><p>Management acknowledged competitive pressures in certain markets but emphasized strategic capacity reductions to sustain profitability.</p></li> <li><p>Analysts raised concerns about seasonal demand variability and potential disruptions from cargo fleet integration.</p></li> <li><p>Mitigation strategies include leveraging the diversified business model and maintaining operational discipline.</p></li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Sun Country Airlines delivered record financial results in Q4 2024, driven by robust growth in its cargo and charter segments. Management projects strong performance in 2025, supported by capacity rationalization, cargo fleet expansion, and improved unit revenues. While analysts raised questions about competitive and seasonal challenges, the company’s diversified business model and strategic adjustments position it well for sustained profitability and growth.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/SNCY/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402756-sun-country-airlines-projects-q1-2025-revenue-of-330m-340m-with-7-percentminus-9-percent",
            "pub_date": "2025-02-04 18:55:41",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402748",
            "title": "Cheap put candidates to consider in the case of a Europe tariff – Barclays",
            "description": "<html><body><p class=\"MsoNormal\">Uncertainty around a possible tariff to the European markets by President Trump is not off the table amid the tariff announcements over the weekend causing material market volatility.</p> <p class=\"MsoNormal\">European equities (<span class=\"ticker-hover-wrapper\">NYSEARCA:<a href=\"https://seekingalpha.com/symbol/VGK\" title=\"Vanguard FTSE Europe ETF\">VGK</a></span>), (<a href=\"https://seekingalpha.com/symbol/IEV\" title=\"iShares Europe ETF\">IEV</a>), (<a href=\"https://seekingalpha.com/symbol/IEUR\" title=\"iShares Core MSCI Europe ETF\">IEUR</a>), (<a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/FEZ\" title=\"SPDR EURO STOXX 50 ETF\">FEZ</a><span class=\"paywall-full-content invisible\">), (</span><a class=\"paywall-full-content invisible\" href=\"https://seekingalpha.com/symbol/STOXX\" title=\"STOXX Europe 600 Index\">STOXX</a><span class=\"paywall-full-content invisible\">) especially autos – down 4% at one point – technology, and basic resources fell considerably around the fears that the European Union could be next, said Stefano Pascale, head of equity derivatives strategy at Barclays, in a note.</span></p> <p class=\"MsoNormal paywall-full-content invisible\">“Markets are likely to remain highly sensitive to tariff developments, making it crucial to monitor risks and hedge against potential selloffs,” he said. “The fall was arguably from exposure to the global economy (including Mexico, Canada, and especially China) but also from fears around 'who's next', as Trump hinted that Europe could be a potential target as well.”</p> <p class=\"MsoNormal paywall-full-content invisible\">To hedge against stocks or sectors that are sensitive to headlines around tariffs, analysts identified cheap put candidates on European Union stocks that are exposed in the case of a tariff announcement.</p> <p class=\"MsoNormal paywall-full-content invisible\">Here are the put candidates:</p> <ul class=\"paywall-full-content invisible\"> <li class=\"MsoNormal\">Adidas AG (<a href=\"https://seekingalpha.com/symbol/ADDYY\" title=\"adidas AG\">OTCQX:ADDYY</a>) – Volatility score: 12; Implied three-month vol: 27%; Skew three-month percentile two-year: 8%</li> <li class=\"MsoNormal\">VAT Group AG (<a href=\"https://seekingalpha.com/symbol/VACNY\" title=\"VAT Group AG\">OTCPK:VACNY</a>) – Volatility score: 38; Implied three-month vol: 35%; Skew three-month percentile two-year: 18%</li> <li class=\"MsoNormal\">Mercedes-Benz Group AG (<a href=\"https://seekingalpha.com/symbol/MBGAF\" title=\"Mercedes-Benz Group AG\">OTCPK:MBGAF</a>) – Volatility score: 42; Implied three-month vol: 27%; Skew three-month percentile two-year: 16%</li> <li class=\"MsoNormal\">Kuehne + Nagel International AG (<a href=\"https://seekingalpha.com/symbol/KHNGF\" title=\"Kuehne + Nagel International AG\">OTCPK:KHNGF</a>) – Volatility score: 42; Implied three-month vol: 24%; Skew three-month percentile two-year: 35%</li> <li class=\"MsoNormal\">LVMH Moët Hennessy - Louis Vuitton, Société Européenne (<a href=\"https://seekingalpha.com/symbol/LVMHF\" title=\"LVMH Moët Hennessy - Louis Vuitton, Société Européenne\">OTCPK:LVMHF</a>) – Volatility score: 49; Implied three-month vol: 27%; Skew three-month percentile two-year: 10%</li> <li class=\"MsoNormal\">Diageo Plc (<a href=\"https://seekingalpha.com/symbol/DEO\" title=\"Diageo plc\">DEO</a>) – Volatility score: 50; Implied three-month vol: 25%; Skew three-month percentile two-year: 5%</li> <li class=\"MsoNormal\">BMW (<a href=\"https://seekingalpha.com/symbol/BMWKY\" title=\"Bayerische Motoren Werke Aktiengesellschaft\">OTCPK:BMWKY</a>) – Volatility score: 59; Implied three-month vol: 29%; Skew three-month percentile two-year: 22%</li> <li class=\"MsoNormal\">Ferrari N.V. (<a href=\"https://seekingalpha.com/symbol/RACE\" title=\"Ferrari N.V.\">RACE</a>) – Volatility score: 64; Implied three-month vol: 26%; Skew three-month percentile two-year: 12%</li> <li class=\"MsoNormal\">Pernod Ricard SA (<a href=\"https://seekingalpha.com/symbol/PDRDF\" title=\"Pernod Ricard SA\">OTCPK:PDRDF</a>) – Volatility score: 76; Implied three-month vol: 30%; Skew three-month percentile two-year: 4%</li> </ul> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/175409767/image_175409767.jpg",
            "link": "https://seekingalpha.com/news/4402748-cheap-put-candidates-to-consider-in-the-case-of-a-europe-tariff-barclays",
            "pub_date": "2025-02-04 18:45:17",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402746",
            "title": "Atkore plunges after management slashes forward guidance",
            "description": "<html><body><p class=\"MsoNormal\">Atkore’s (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ATKR\" title=\"Atkore Inc.\">ATKR</a></span>) stock on Tuesday sank as much as 20% after the maker of electrical equipment slashed its estimate for yearly operating earnings because of weaker demand.</p> <p class=\"MsoNormal\">Management revised its forecast to $5.75 to $6.85 a share from a prior estimate of $7.80<span class=\"paywall-full-content invisible\"> to $8.90 a share for the year ended in September. The average estimate among Wall Street analysts was $8.38 a share.</span></p> <p class=\"MsoNormal paywall-full-content invisible\">As for its fiscal quarter ended in December, earnings were $46.3 million, or $1.31 a share, down from $138.4 million, or $3.61 a share, a year earlier.</p> <p class=\"MsoNormal paywall-full-content invisible\">The results beat the consensus estimate of $1.24 a share.</p> <p class=\"MsoNormal paywall-full-content invisible\">Sales fell 17% from a year earlier to $661.6 million, missing the consensus estimate of $680.8 million. Its electrical unit saw revenue drop 22% to $465.4 million.</p> <p class=\"MsoNormal paywall-full-content invisible\">“Atkore’s first quarter results were in line with the projections for net sales, adjusted ebitda and adjusted diluted EPS we presented in November,” Bill Waltz, president and chief executive of Atkore (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ATKR\" title=\"Atkore Inc.\">ATKR</a></span>), said in a statement.</p> <p class=\"MsoNormal paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/160195969/image_160195969.jpg",
            "link": "https://seekingalpha.com/news/4402746-atkore-plunges-after-management-slashes-forward-guidance",
            "pub_date": "2025-02-04 18:46:55",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402737",
            "title": "BP may spend up to $25B to develop four oil and gas fields at Iraq’s Kirkuk - Reuters",
            "description": "<html><body><p>BP (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a></span>) is expected to spend as much as $25B to redevelop four Kirkuk oil and gas fields, a senior Iraqi oil official told Reuters, as the country seeks to win back foreign investment.</p> <p>If the deal is signed, which the<span class=\"paywall-full-content invisible\"> anonymous official said could occur in the coming weeks, it would mark a breakthrough for Iraq, where production has been constrained by years of war, corruption and sectarian tensions.</span></p> <p class=\"paywall-full-content invisible\">BP (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a></span>) would spend $20B-$25B in a profit-sharing agreement that would last more than 25 years, with the aim of raising capacity to 450K bbl/day in 2-3 years, according to the <a href=\"https://www.reuters.com/business/energy/bp-poised-invest-up-25-billion-iraqs-kirkuk-oil-gas-2025-02-04/\" rel=\"nofollow\" target=\"_self\" title=\"report\">report</a>.</p> <p class=\"paywall-full-content invisible\">The deal reportedly is focused on rehabilitating facilities in four oilfields and developing natural gas to support Iraq's domestic energy needs, and BP (<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a>) would boost crude production capacity from the four oilfields in Kirkuk by 150K bbl/day from current capacity of 300K bbl/day.</p> <p class=\"paywall-full-content invisible\">Under the profit-sharing model being discussed, the senior oil official told Reuters that BP (<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a>) would be able to recover costs and start making profits once it has increased output beyond current levels.</p> <p class=\"paywall-full-content invisible\">A prospective agreement with BP (<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a>) would be the second major deal between Iraq and an international oil company in as many years after an agreement with TotalEnergies valued at ~$27B.</p> <p class=\"paywall-full-content invisible\">BP (<a href=\"https://seekingalpha.com/symbol/BP\" title=\"BP p.l.c.\">BP</a>) was a member of the consortium of companies that discovered oil in Kirkuk in the 1920s and has estimated the area holds ~9B barrels of recoverable oil.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1342084394/image_1342084394.jpg",
            "link": "https://seekingalpha.com/news/4402737-bp-may-spend-up-to-25b-to-develop-four-oil-and-gas-fields-at-iraqs-kirkuk-reuters",
            "pub_date": "2025-02-04 18:43:02",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402749",
            "title": "Fox Corporation targets D2C launch by year-end, sees Tubi revenue crossing $1B in FY2025",
            "description": "<html><body><p>Earnings Call Insights: Fox Corporation (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/FOX\" title=\"Fox Corporation\">FOX</a></span>) Q2 2025</p> <h3>Management View</h3> <ul> <li>Lachlan Murdoch highlighted a strong quarter with EBITDA more than doubling year-over-year to $781 million and revenue increasing 20% to over $5 billion. He emphasized the role of political revenue, strong sports programming, and continued growth<span class=\"paywall-full-content invisible\"> at Tubi, which achieved a 31% increase in ad revenues.</span> </li> <li class=\"paywall-full-content invisible\">Fox News achieved its highest-ever quarterly share of the PrimeTime cable news audience at over 60%, supported by record-breaking presidential election coverage and strong advertiser demand. Murdoch also confirmed all affiliate renewals affecting FY2025 were successfully completed.</li> <li class=\"paywall-full-content invisible\">Tubi's first-ever Super Bowl live stream was announced, aimed at engaging new users and capturing first-party data, with low incremental costs expected.</li> <li class=\"paywall-full-content invisible\">CFO Steve Tomsic noted a 123% increase in EBITDA and strong advertising revenue growth of 21%, driven by political ad spend, robust sports pricing, and Tubi’s momentum.</li> </ul> <h3 class=\"paywall-full-content invisible\">Outlook</h3> <ul class=\"paywall-full-content invisible\"> <li>Murdoch confirmed plans to launch a direct-to-consumer (D2C) service targeting cord-cutters and cord-nevers by the end of calendar year 2025. He clarified that the service would not incur incremental rights costs and would be priced modestly.</li> <li>Tubi is expected to surpass $1 billion in revenue for FY2025, driven by its large AVOD library and targeted advertising capabilities.</li> <li>Political advertising trends are expected to remain strong, with digital platforms like Tubi playing a critical role in capturing targeted ad spend.</li> </ul> <h3 class=\"paywall-full-content invisible\">Financial Results</h3> <ul class=\"paywall-full-content invisible\"> <li>Adjusted EPS came in at $0.96, exceeding analysts’ estimate of $0.64. Revenue totaled over $5 billion, surpassing the $4.82 billion estimate.</li> <li>Cable network revenues grew 31%, supported by a 32% rise in advertising revenues and a 4% increase in affiliate fee revenues. Television segment revenues increased 16%, driven by strong political ad spend, NFL viewership, and growth at Tubi.</li> <li>Free cash flow reflected a deficit of $436 million due to seasonality in working capital, with advertising receivables expected to reverse in the second half of the fiscal year.</li> <li>Shareholder returns included $550 million in share buybacks and a 27% dividend increase.</li> </ul> <h3 class=\"paywall-full-content invisible\">Q&amp;A</h3> <ul class=\"paywall-full-content invisible\"> <li>John Hodulik, UBS: Asked about the D2C launch timeline and affiliate pricing trends. Lachlan Murdoch confirmed the D2C service would launch by year-end, targeting cord-nevers and cord-cutters without affecting traditional distribution customers. Steve Tomsic added that affiliate pricing remained strong due to the focused channel portfolio.</li> <li>Michael Morris, Guggenheim: Questioned sustainability of Fox News advertising strength and the Tubi Super Bowl live stream. Murdoch attributed ad growth to record ratings and over 100 new national advertisers. He highlighted the Super Bowl live stream’s potential to drive first-party data acquisition at minimal cost.</li> <li>Thomas Yeh, Morgan Stanley: Inquired about Tubi’s investment outlook and sports betting licensing. Murdoch stated Tubi’s profitability timeline remains on track and confirmed progress in obtaining sports betting licenses across 26 states.</li> <li>Michael Ng, Goldman Sachs: Asked about subscriber trends and digital investment. Murdoch noted improving subscriber declines at 7% and expressed optimism about the financial potential of new skinny bundles. Tomsic reaffirmed digital losses are on track to decrease significantly this year.</li> </ul> <h3 class=\"paywall-full-content invisible\">Sentiment Analysis</h3> <ul class=\"paywall-full-content invisible\"> <li>Analysts showed cautious optimism, focusing on D2C plans, Tubi growth, and advertising sustainability. Questions about subscriber declines and digital investment reflected skepticism but were addressed with confident responses.</li> <li>Management remained positive, emphasizing strong financial performance, strategic growth initiatives, and shareholder returns. Murdoch consistently highlighted momentum across key segments, while Tomsic provided detailed financial clarity.</li> <li>Compared to the previous quarter, management’s tone was more confident, backed by record-breaking metrics and clear strategic direction.</li> </ul> <h3 class=\"paywall-full-content invisible\">Quarter-over-Quarter Comparison</h3> <ul class=\"paywall-full-content invisible\"> <li>Revenue growth accelerated from 11% in Q1 to 20% in Q2, driven by political ad spend and sports programming.</li> <li>Tubi’s revenue growth increased from 19% to 31% quarter-over-quarter, supported by political advertising and audience expansion.</li> <li>Management tone and confidence improved as affiliate renewals were completed and D2C plans progressed.</li> <li>Analysts’ focus shifted from general performance to strategic initiatives like the D2C launch and Tubi’s profitability timeline.</li> </ul> <h3 class=\"paywall-full-content invisible\">Risks and Concerns</h3> <ul class=\"paywall-full-content invisible\"> <li>Subscriber declines, while improving, remain a challenge, with cord-cutting trends continuing to affect the traditional cable bundle.</li> <li>Legal hurdles surrounding the Venu sports streaming joint venture were cited as a disappointment, potentially limiting sports content distribution options.</li> <li>Analysts raised concerns about long-term sustainability of advertising demand, particularly at Fox News.</li> </ul> <h3 class=\"paywall-full-content invisible\">Final Takeaway</h3> <p class=\"paywall-full-content invisible\">Fox Corporation delivered a record-breaking quarter, driven by strong political ad revenue, robust sports programming, and Tubi’s accelerating growth. The planned D2C launch by year-end 2025 could unlock additional revenue streams while targeting cord-cutters and cord-nevers. With Tubi expected to surpass $1 billion in annual revenue and improving subscriber trends, management’s confidence in its diversified strategy remains high, though challenges in subscriber retention and legal issues around Venu persist.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/FOX/earnings/transcripts\">Read the full Earnings Call Transcript</a></p> </body></html>",
            "image": null,
            "link": "https://seekingalpha.com/news/4402749-fox-corporation-targets-d2c-launch-by-year-end-sees-tubi-revenue-crossing-1b-in-fy2025",
            "pub_date": "2025-02-04 18:43:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402739",
            "title": "Evolent Health gains as activist Engaged Capital reaches cooperation agreement",
            "description": "<html><body><p>Evolent Health (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/EVH\" title=\"Evolent Health, Inc.\">EVH</a></span>)<span style=\"color: #008000;\"> rose 1.2%</span> after activist investor Engaged Capital reached a cooperation agreement with the healthcare services company.</p> <p>Evolent (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/EVH\" title=\"Evolent Health, Inc.\">EVH</a></span>) will add Brendan Springstubb to its board, according to a<a href=\"https://seekingalpha.com/pr/19990166-evolent-health-announces-changes-to-board-of-directors\" rel=\"noopener\" target=\"_blank\" title=\" statement \"> statement </a>on Tuesday. Springstubb was previously a<span class=\"paywall-full-content invisible\"> principal at Engaged Capital. He also held multiple roles at Relational Investors. </span></p> <p class=\"paywall-full-content invisible\">Rich Jelinek, who joined the Evolent (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/EVH\" title=\"Evolent Health, Inc.\">EVH</a></span>) board as independent director in 2023, will be named chair at the 2025 annual meeting, succeeding <span class=\"person\">Cheryl Scott</span>. </p> <p class=\"paywall-full-content invisible\">\"Having worked with Brendan for over 15 years, I know he will be a strong shareholder advocate in the Evolent boardroom,\" <span class=\"person\">Glenn W. Welling</span>, Founder and CIO of Engaged Capital, said in the statement. </p> <p class=\"paywall-full-content invisible\">The agreement with Engaged Capital comes after Evolent shares have tumbled almost 60% since early November when the healthcare company released a Q3 earnings report that fell short of Street estimates and<a href=\"https://seekingalpha.com/news/4263578-evolent-stock-tumbles-post-market-on-q3-report-lowered-guidance\" rel=\"noopener\" target=\"_blank\" title=\" lowered its 2024 guidance.\"> lowered its 2024 guidance. </a></p> <p class=\"paywall-full-content invisible\">There was a report in August that several private equity firms were interested in a<a href=\"https://seekingalpha.com/news/4143895-evolent-health-dips-on-report-elevance-dropped-out-of-bidding\" rel=\"noopener\" target=\"_blank\" title=\" potential deal \"> potential deal </a> for Evolent Health.</p> <p class=\"paywall-full-content invisible\"> </p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1460028504/image_1460028504.jpg",
            "link": "https://seekingalpha.com/news/4402739-evolent-heallth-gains-as-activist-engaged-capital-reaches-cooperation-agreement",
            "pub_date": "2025-02-04 18:37:05",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4402528",
            "title": "Dow, S&P, and Nasdaq rise despite China hitting back with tariffs on U.S. imports",
            "description": "<html><body><p class=\"MsoNormal\">Wall Street trades higher on Tuesday despite the fact that China retaliated with a levy of tariffs on imports of multiple U.S. products.</p> <p class=\"MsoNormal\">Early on and the S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>) was <span style=\"color: #008000;\">+0.4%</span>, the Nasdaq Composite (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/COMP:IND\" title=\"NASDAQ Composite Index\">COMP:IND</a></span></span></span></span></span><span class=\"paywall-full-content invisible\">) was </span><span class=\"paywall-full-content invisible\" style=\"color: #008000;\">+1.1%</span><span class=\"paywall-full-content invisible\">, and the Dow (</span><span class=\"ticker-hover-wrapper paywall-full-content invisible\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DJI\" title=\"Dow Jones Industrial Average Index\">DJI</a></span></span></span></span></span><span class=\"paywall-full-content invisible\">) was near flat.</span></p> <p class=\"MsoNormal paywall-full-content invisible\">The 10-year Treasury yield (<a href=\"https://seekingalpha.com/symbol/US10Y\" title=\"United States 10-Year Bond Yield\">US10Y</a>) rose 1 basis point to 4.58%. The 2-year yield (<a href=\"https://seekingalpha.com/symbol/US2Y\" title=\"United States 2-Year Bond Yield\">US2Y</a>) fell 1 basis point to 4.24%.</p> <p class=\"MsoNormal paywall-full-content invisible\">The tech focused Nasdaq has been helped by shares of Palantir Technologies (<a href=\"https://seekingalpha.com/symbol/PLTR\" title=\"Palantir Technologies Inc.\">PLTR</a>) which popped over <span style=\"color: #008000;\">25%</span> after the firm's fourth quarter 2024 results and outlook blasted past expectations.</p> <p class=\"MsoNormal paywall-full-content invisible\">On the tariff front, the <a href=\"https://seekingalpha.com/news/4402411-tit-for-tat-china-hits-back-with-tariffs-on-u_s_-coal-lng-vehicles\" rel=\"noopener\" target=\"_blank\" title=\"Chinese government\">Chinese government</a> said it would implement a 15% tariff on coal and liquefied natural gas products, as well as a 10% tariff on crude oil, agricultural machinery, and large-displacement cars.</p> <p class=\"MsoNormal paywall-full-content invisible\">Wall Street closed lower on Monday after President Donald Trump announced new tariffs on Canada and Mexico over the weekend. While it was a red day, markets were able to recoup some earlier losses after delays were announced against tariffs towards Mexico.</p> <p class=\"MsoNormal paywall-full-content invisible\">\"The past 24 hours have seen a big roundtrip for many assets classes as strongly negative sentiment gave way to a relief rally on news that the planned 25% tariffs against Mexico and Canada would be delayed,\" Deutsche Bank's Jim Reid said.</p> <p class=\"MsoNormal paywall-full-content invisible\">\"Taxing goods from China is still happening, and China has retaliated. The inflation consequences of these taxes are less obvious to US consumers,\" UBS' Paul Donovan said.</p> <p class=\"MsoNormal paywall-full-content invisible\">On the earnings side, Google parent <a href=\"https://seekingalpha.com/news/4402150-alphabet-q4-preview-eyes-on-ad-business-cloud-sales-and-capital-spend\" rel=\"noopener\" target=\"_blank\" title=\"Alphabet\">Alphabet</a> (<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>) (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>) is expected to release its fourth quarter results today. </p> <p class=\"MsoNormal paywall-full-content invisible\"><a href=\"https://seekingalpha.com/news/4402730-factory-orders-fall-more-than-expected-in-december\" rel=\"noopener\" target=\"_blank\" title=\"U.S. factory orders\">U.S. factory orders</a> fell 0.9% M/M to $578.5B in December. Additionally, <a href=\"https://seekingalpha.com/news/4402713-job-openings-drop-more-than-expected-in-december-hiring-rate-stagnates\" rel=\"noopener\" target=\"_blank\" title=\"job openings\">job openings</a> drop more than expected in December while hiring rate stagnates.</p> </body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/165581156/image_165581156.jpg",
            "link": "https://seekingalpha.com/news/4402528-sp500-nasdaq-dow-jones-outlook-stock-market",
            "pub_date": "2025-02-04 18:34:00",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}