{
    "data": [
        {
            "id": "4558108",
            "title": "HENSOLDT AG ADR reports FY results",
            "description": "<html><body><ul>\n<li>HENSOLDT AG ADR (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/HAGHY\" title=\"HENSOLDT AG ADR\">HAGHY</a></span>): FY Revenue of EUR 2.45M.</li>\n<li>\n<strong>Adjusted EBITDA<span> </span></strong>rises to EUR 452 million (previous year: EUR 405 million)</li>\n<li>\n<strong>Adjusted EBITDA margin<span> </span></strong>at 18.4% exceeds expectations (previous year: 18.1%)</li>\n<li>\n<strong>Adjusted free cash flow<span> </span></strong>grows significantly to EUR 347 million (previous year: EUR 249 million)</li>\n<li>\n<strong>Dividend<span> </span></strong>of EUR 0.55 per share proposed (previous year: EUR 0.50)</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558108-hensoldt-ag-adr-reports-fy-results",
            "pub_date": "2026-02-27 04:06:42",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558106",
            "title": "Tecnoglass outlines $1.06B–$1.13B 2026 revenue target while expanding vinyl and geographic footprint",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Tecnoglass Inc. (TGLS) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Jose Daes, CEO, reported record revenues of $984 million for 2025, crediting strength across business segments and market share gains. He stated, \"Our single family residential business delivered yet another record year with revenues growing to an all-time high of $403 million... Our multifamily and commercial businesses was similarly strong with revenues growing to $580 million on robust demand for our high-performance products.\" The CEO highlighted operational discipline, stating, \"Our team's ability to maintain our industry-leading margin profile through a unique challenging year... more than offset the impact of tariffs and increased raw material costs supporting a stable gross margin for the year.\" He announced the expansion of the share repurchase authorization by $100 million and projected another year of record revenue and value creation in 2026.</li>\n<li>Christian Daes, COO, emphasized double-digit revenue growth in multifamily and commercial business. He referred to the Continental Glass System acquisition, saying, \"Continental continues to integrate smoothly into our operation, enhancing our capabilities in high-end architectural glass and glazing...\" The COO noted the backlog reached a record $1.3 billion, with a book-to-bill ratio of 1.1x for 20 consecutive quarters, and highlighted the shift toward large high-end projects.</li>\n<li>Santiago Giraldo, CFO, commented, \"Total revenues for the fourth quarter increased 2.4% year-over-year to $245.3 million... Full year adjusted EBITDA reached $291.3 million, representing a margin of 29.6%.\" He explained, \"Our balance sheet remains solid with liquidity of approximately $465 million at year-end, including a cash position of approximately $100.9 million.\" Giraldo also announced that the Board approved the redomiciliation of the company from the Cayman Islands into the U.S., subject to shareholder approval, to achieve tax efficiencies and facilitate dividends.</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Management introduced a full year 2026 revenue outlook in the range of $1.06 billion to $1.13 billion, representing growth of approximately 11% at the midpoint. Adjusted EBITDA outlook is set at $265 million to $305 million. The high-end scenario assumes lower interest rates, improved affordability, market share gains, and a 10% reduction in aluminum input costs. The low scenario assumes no Fed rate cuts and flattish single-family revenues.</li>\n<li>CFO Giraldo stated, \"Both assumptions also bake in an incremental amount of installation revenue, in line with our previous discussions around the shift in backlog composition geared to larger projects.\"</li>\n<li>Capital expenditures for 2026 are projected to be $60 million to $75 million, with a potential $20 million to $25 million land purchase for a new U.S. facility not included in the current guidance.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Fourth quarter revenues were $245.3 million, reflecting 2.4% year-over-year growth. Full year revenue reached $983.6 million, up 10.5%. Adjusted EBITDA for the quarter was $62.2 million, with a margin of 25.4%.</li>\n<li>Gross margin for the full year was 42.8%, stable compared to the prior year. Fourth quarter gross margin was 40%, with CFO Giraldo citing \"unfavorable revenue mix,\" \"near all-time high U.S. aluminum costs,\" and \"a significant revaluation of the Colombian peso\" as key headwinds.</li>\n<li>Operating cash flow for the year was $135.8 million. Share repurchases totaled $118 million for the year, including $87.6 million in the fourth quarter.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Sam Darkatsh, Raymond James: Asked about Q1 expectations for sales, gross margin, and EBITDA. Giraldo replied, \"More or less in line with Q4. That's what we would expect.\"</li>\n<li>Darkatsh asked about 2026 margin expectations and tariffs. Giraldo answered, \"On the gross margin from the low to the high end, you have a 200 basis points of difference, from high 30s to low 40s... SG&amp;A, we expect it to go down in terms of percentage of our sales based on the fact that we will not incur aluminum tariffs as we did in 2025.\"</li>\n<li>Rohit Seth, B. Riley: Inquired about timing and extent of pricing actions. CEO Daes responded, \"We have to wait and see the reaction of the total market in order to raise our prices... in residential, our competition is struggling. So they have not raised their prices...\"</li>\n<li>Seth asked about vinyl product line sales. Giraldo said, \"We ended up with vinyl roughly around $10 million for the year. We expect that to increase at least 2.5, 3x for 2026...\"</li>\n<li>Timothy Wojs, Baird: Asked about commercial revenue acceleration in 2026. CEO Daes replied, \"Commercial is going to grow in '26 and '27... we are expanding our reach into other markets... to keep growing at a very big pace, double digits or more.\"</li>\n<li>Julio Romero, Sidoti: Queried showroom contributions. Giraldo stated, \"On the resi side for the showroom revenues, we ended up at about $10 million, and we're expecting to do $30 million to $35 million this year.\"</li>\n<li>Jean Paul Ramirez, D.A. Davidson: Asked about revenue cadence. Giraldo explained, \"Each sequential quarter is going to be incremental revenues as we move through the year... the first quarter is expected to be kind of more or less in line with Q4.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts appeared focused on macro headwinds, input cost pressures, and the ramp-up of new product lines, with a generally neutral to slightly positive tone and persistent requests for quantification and clarification.</li>\n<li>Management maintained a confident and optimistic tone, emphasizing resilience, market share gains, and expansion plans. CEO Daes expressed, \"We have done very well. The company is going to keep striving. We have a lot of plans of growth for '26, '27 and '28.\"</li>\n<li>Compared to the previous quarter, management's tone remained confident, though more detailed about headwinds and mitigation strategies. Analysts continued to probe for specifics, reflecting ongoing caution regarding costs and execution.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The 2026 revenue outlook was set higher than previous preliminary estimates, now explicitly guided at $1.06 billion to $1.13 billion. Adjusted EBITDA guidance narrowed slightly from the previous range.</li>\n<li>Share repurchase authorization expanded from $150 million to $250 million, with repurchases ramping up in Q4 2025.</li>\n<li>Management provided more granular detail on vinyl and showroom growth expectations, while reiterating the strategic shift toward large high-end projects and national geographic expansion.</li>\n<li>Analysts’ questions in both quarters focused on margin sustainability, input costs, and product line ramp-up. Management’s confidence in backlog conversion and growth has increased, with greater transparency on mitigation efforts for aluminum and FX headwinds.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management identified persistent cost pressures from aluminum and foreign exchange. Giraldo explained, \"Global aluminum spot rates spiked higher... U.S. Midwest aluminum premiums more than doubled during the year, creating industry-wide margin pressure.\"</li>\n<li>Tariffs and a stronger Colombian peso continued to impact margins, but management cited pricing actions and hedging strategies as mitigation.</li>\n<li>Analysts frequently probed about timing and magnitude of input cost relief, pricing power, and the execution risks tied to new product lines and geographic growth.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Tecnoglass management emphasized the company's ability to deliver record revenue and maintain strong margins despite significant macroeconomic headwinds in 2025. The outlook for 2026 includes ambitious revenue and EBITDA targets, supported by a record backlog, expanded product lines, and a larger national footprint. Capital allocation remains balanced between growth initiatives and shareholder returns, with a significant increase in buyback authorization and U.S. redomiciliation plans to enhance tax and dividend efficiencies. The company remains focused on mitigating input cost volatility and leveraging operational advantages to drive continued outperformance and shareholder value.</p>\n<p><a href=\"https://seekingalpha.com/symbol/tgls/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558106-tecnoglass-outlines-1_06b-1_13b-2026-revenue-target-while-expanding-vinyl-and-geographic",
            "pub_date": "2026-02-27 04:00:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558107",
            "title": "Ingevity outlines $4.08–$5.20 adjusted EPS guidance for 2026 while strengthening cash flow and share buybacks",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Ingevity Corporation (NGVT) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>David Li, President, CEO &amp; Director, highlighted the completion of the North Charleston CTO refinery and Industrial Specialties product line sale, stating this has “reduced our portfolio volatility, strengthened our profitability and cash flow profile and enhanced our strategic flexibility.”</li>\n<li>Li reported total company adjusted EBITDA growth of nearly 10% over 2024, with industry-leading margins above 30% and $274 million of free cash flow, “slightly exceeding our commitments.” The company used this cash to pay down debt and repurchase over 1 million shares, reducing leverage to 2.6x.</li>\n<li>Performance Materials maintained EBITDA margins above 50% and held revenue flat despite global auto production headwinds, with Li noting, “momentum from continued adoption of hybrids and fuel-efficient ICE vehicles is encouraging.”</li>\n<li>The CEO confirmed that Advanced Polymer Technologies (APT) and Road Markings are undergoing sale processes, with updates to be provided as they advance.</li>\n<li>Phillip Platt, Senior VP of Finance &amp; Chief Accounting Officer, stated: “Total company full year 2025 sales of $1.3 billion declined 8% compared to last year. Performance Materials sales remained flat versus 2024 despite lower auto production driven by industry volatility from tariffs and supply chain disruptions.”</li>\n<li>Platt added, “Adjusted gross profit of $556 million increased 6.8% year-over-year, with gross margin expanding by 610 basis points. Total adjusted EBITDA increased 10% year-over-year to $398 million, with margins expanding 500 basis points to 30.8%.”</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Ingevity expects 2026 adjusted EPS in the range of $4.08 to $5.20 and sales between $1.1 billion and $1.2 billion, with adjusted EBITDA between $380 million and $400 million. Li stated, “We expect 2026 adjusted EPS to be in the range of $4.08 and to $5.20 in a year where we do not expect meaningful recovery in the global economy.”</li>\n<li>Performance Materials sales are expected to grow low single digits with margins consistent with 2025. Sales in Performance Chemicals, including Road Markings, are expected to grow mid-single digits with EBITDA margins in the mid-teens. APT is projected for flat to low single-digit growth, with margins around 20%.</li>\n<li>CapEx guidance is $40 million to $60 million, and free cash flow is expected between $225 million and $250 million, excluding a $95 million litigation-related payment to BASF in the second quarter.</li>\n<li>The company targets $300 million in share repurchases through 2027 and plans to maintain net leverage within 2 to 2.5x.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Total company sales for 2025 were $1.3 billion, a decline of 8%. Adjusted gross profit was $556 million, and total adjusted EBITDA reached $398 million, with an adjusted EBITDA margin of 30.8%.</li>\n<li>Free cash flow of $274 million was the highest in five years, exceeding updated guidance and enabling $56 million in share repurchases. Net leverage improved to 2.6x.</li>\n<li>Performance Materials delivered $607 million in sales, with an EBITDA margin of 53.8%. Performance Chemicals’ combined segment EBITDA margin expanded to 13.5%, up from 4% last year, with a $45 million improvement in total segment EBITDA.</li>\n<li>APT sales declined 15% and EBITDA was 18% lower year-over-year; however, the segment maintained a 20% EBITDA margin due to operational discipline and favorable foreign exchange.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>John McNulty, BMO Capital Markets: Asked about asset sales progress and the impact on share buybacks. Li responded, “we’re encouraged by the interest shown in both assets…we’ll announce something before the end of the year.” Platt confirmed, “the outlook does not include any of the proceeds associated with the APT or the Road Markings potential sales. So we would expect to continue to execute those buybacks of $300 million over the next 2 years.”</li>\n<li>McNulty also queried stranded cost elimination. Platt answered, “we definitely have a clear line of sight to eliminate that $15 million by the end of the year…more so in the back end of the year than the front end.”</li>\n<li>Lee Jagoda, CJS Securities: Asked about auto production assumptions and seasonality for Performance Materials. Li indicated, “we see it as a very resilient market…for 2026, what we’ve kind of baked in is a pretty stable environment.”</li>\n<li>Jagoda also inquired about filtration market expansion. Li explained, “The filtration aspect is built into our guidance, but it’s a pretty small base right now.”</li>\n<li>Daniel Rizzo, Jefferies: Sought margin outlook for the segments. Li reiterated Performance Materials margins “north of 50%,” and Performance Chemicals margins “higher teens or 18%.” Platt confirmed that about 90% of annual EBITDA for Pavement and Road Markings will be recognized in Q2 and Q3.</li>\n<li>Michael Sison, Wells Fargo: Asked about technical edge in filtration. Li described hardwood-based activated carbon’s unique separation properties and planned focus on “water, pharma and food and beverage.”</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed for clarity around asset sales, margin sustainability, and the impact of supply chain challenges, reflecting a neutral to slightly positive tone with interest in strategic execution and capital return.</li>\n<li>Management maintained a confident and optimistic stance in both prepared remarks and Q&amp;A, using phrases such as “we are encouraged,” “have a clear line of sight,” and “expect to maintain that.”</li>\n<li>Compared to the previous quarter, management’s tone has shifted to greater confidence and clarity, especially following portfolio optimization and strong cash flow generation, while analysts remained focused on operational execution and capital allocation.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>The current quarter emphasized successful completion of the Industrial Specialties divestiture, stronger free cash flow, and reduced leverage, compared to the previous quarter’s focus on pending divestitures and ongoing portfolio review.</li>\n<li>Guidance is more specific and optimistic for 2026, supported by robust capital returns and a strong balance sheet.</li>\n<li>Analysts’ questions this quarter concentrated on asset sale progress, the trajectory of stranded cost elimination, and segment margin durability, shifting from the prior quarter’s attention to uncertainty around supply chains and divestiture impacts.</li>\n<li>Management’s confidence in maintaining and potentially growing margins in core businesses is more pronounced, while analysts continued to probe for risks around execution.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Ongoing tariff uncertainty, weak end market demand in APT, and competitive pressures in China were cited as key challenges.</li>\n<li>Management is mitigating volatility through portfolio simplification, cost reduction, and commercial discipline in at-risk segments.</li>\n<li>Seasonality in Pavement Technologies and Road Markings will become more pronounced after the divestiture of Industrial Specialties, with 90% of segment EBITDA expected in Q2 and Q3.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Ingevity’s leadership affirmed a streamlined portfolio and a focus on cash generation, capital returns, and operational discipline. With the sale of Industrial Specialties complete and asset sales for APT and Road Markings progressing, the company enters 2026 with confidence in its guidance, targets for continued margin strength, and a commitment to returning value to shareholders through disciplined buybacks and debt reduction.</p>\n<p><a href=\"https://seekingalpha.com/symbol/ngvt/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558107-ingevity-outlines-4_08-5_20-adjusted-eps-guidance-for-2026-while-strengthening-cash-flow-and",
            "pub_date": "2026-02-27 04:00:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558099",
            "title": "eDreams ODIGEO S.A. reports 9M results",
            "description": "<html><body><ul>\n<li>eDreams ODIGEO S.A. <a href=\"https://seekingalpha.com/pr/20414681-edreams-odigeo-grows-net-income-tenfold-to-40_3-million-as-prime-reaches-7_8-million-members\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EDDRF\" title=\"eDreams ODIGEO S.A.\">EDDRF</a></span>): 9M Revenue of <span>€</span>502.8M.</li>\n<li><span>eDO is on track to meet or exceed its FY26 targets of 7.9 million members, €172.9 million in Adjusted EBITDA, and €155 million in Cash EBITDA. Looking ahead, eDO projects accelerating growth, targeting a 15-20% annual increase in Prime membership between FY27 and FY30</span></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558099-edreams-odigeo-sa-reports-9m-results",
            "pub_date": "2026-02-27 03:56:07",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558100",
            "title": "Piraeus Bank S.A. reports FY results",
            "description": "<html><body><ul>\n<li>Piraeus Bank S.A. <a href=\"https://seekingalpha.com/pr/20414758-piraeus-bank-s-a-full-year-2025-financial-results\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BPIRY\" title=\"Piraeus Bank S.A.\">BPIRY</a></span>): FY  €0.7bn revenues from services | Best-in-class in<span> </span><span>Greece</span>; 0.82% fees over assets, 26% revenues from services out of total revenues</li>\n<li>€2.7bn net revenues | Revenues from services up 7%; NII up qoq, marking prior quarter as the trough</li>\n<li>52bps organic CoR | NPE ratio at 2.0%, NPE coverage at 73% vs 65% a year ago</li>\n<li>+27% AuM yoy | €14.5bn AuM; €1.5bn net inflows in 2025; deposits at €66bn, up €3.2bn, +5% yoy, funding 90% of credit expansion</li>\n<li>18.7% total capital ratio | Buffer of c.275bps above P2G, CET1 ratio at 12.7%; MREL at 29.0% with c.165bps buffer above requirement</li>\n<li>€0.82 EPS after AT1 coupon | Exceeding guidance of €0.80 for the year, fully absorbing the fast decumulation of base rates</li>\n<li>€40c per share cash dividend | On top of €100mn share buyback executed in Q4; €592mn total distribution out of 2025, 7% total yield</li>\n<li>€3.9bn net credit expansion |<span> </span><span>Europe</span>-leading +11% loan growth yoy, with pricing discipline maintained; €0.3bn net credit expansion in retail</li>\n<li>33% cost-to-core income ratio | Best-in-class efficiency ratio confirming cost discipline, despite inflation and ongoing investments</li>\n<li> </li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558100-piraeus-bank-s-a-reports-fy-results",
            "pub_date": "2026-02-27 03:56:07",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558089",
            "title": "Bookstore chains Barnes & Noble and Waterstones are one step closer to an IPO",
            "description": "<html><body><p data-eci=\"true\">Bookstore chains Barnes &amp; Noble and Waterstones are closer to being part of an IPO, according to Bloomberg. Owner Elliott Management has invited investment banks to pitch for roles on an initial public offering in London of the book retailers. Sources indicate that a U.S. listing is still a possibility as well.</p>\n<p>Barnes &amp; Noble's retail comeback is one of the most surprising turnarounds in the retail sector, as the chain defied predictions that physical bookstores were destined for extinction. Just 25 years ago, the company seemed headed for the same fate as Borders, Book World, BookPeople, WaldenBooks, and B. Dalton after closing locations due to the rise of Amazon (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>) and e-commerce book buying. While Barnes &amp; Noble survived, for years the company cycled through CEOs and struggled to find its identity.</p>\n<p>The turning point came in 2019 when Elliott Advisors acquired Barnes &amp; Noble and brought in James Daunt. The chain reverted to its bookstore roots, and Daunt gave individual store managers unprecedented autonomy to curate their inventory based on local tastes. Barnes &amp; Noble also became a more inviting space to relax or hold a small meeting during the same period that certain Starbucks (<a href=\"https://seekingalpha.com/symbol/SBUX\" title=\"Starbucks Corporation\">SBUX</a>) and Panera (<a href=\"https://seekingalpha.com/symbol/PANERA\" title=\"Panera Bread Company\">PANERA</a>) started to resemble a mosh pit of pick-up orders. Barnes &amp; Noble has also benefited from the BookTok phenomenon on TikTok (<a href=\"https://seekingalpha.com/symbol/TIKTOK\" title=\"TikTok\">TIKTOK</a>), as the social media movement made book buying feel participatory and social rather than solitary.</p>\n<p>After bottoming out around 600 stores, Barnes &amp; Noble opened approximately 30 new stores in 2023, 61 in 2024, and 67 in 2025. Notably, Waterstones is adding bookstores as well, with some of the same factors in play.</p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558089-bookstore-chains-barnes-and-noble-and-waterstones-are-one-step-closer-to-an-ipo",
            "pub_date": "2026-02-27 03:40:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558083",
            "title": "Array Technologies plunges by a third after weak earnings guidance; Deutsche Bank downgrades",
            "description": "<html><body><p data-eci=\"true\">Array Technologies (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ARRY\" title=\"Array Technologies, Inc.\">ARRY</a></span>) -35.2% in Thursday's trading to three-month lows after reporting mixed <a href=\"https://seekingalpha.com/news/4557144-array-technologies-non-gaap-eps-of-0_01-misses-by-0_01-revenue-of-226m-beats-by-14_59m\" target=\"_self\" title=\"Q4 results\">Q4 results</a> but guiding <span>FY 2026 earnings far below consensus.</span></p>\n<p><span>The company sees full-year adjusted EPS of $0.65-$0.75, well short of the $0.88 FactSet consensus; revenues of $1.4B-$1.5B, in line with the $1.45B consensus; adjusted EBITDA of $200M-$230M, compared to the $256.4M consensus; and adjusted gross margin of 26%-27%, shy of the 28% consensus estimate.</span></p>\n<p><span>In Deutsche Bank's downgrade of Array (<a href=\"https://seekingalpha.com/symbol/ARRY\" title=\"Array Technologies, Inc.\">ARRY</a>) shares to Hold from Buy with a $9 price target, cut from $11, the bank said the </span><span>weaker-than-expected outlook was due to 45x amortization falloff, although company management said it expects flat core margins Y/Y, while backlog continued to grow in Q4, up 16% Q/Q.</span></p>\n<p><span>\"Management commentary was nothing short of positive during the call... and while we can expect improvements through the year, especially H2 weighted, it seems the market is cautious,\" analyst Connor Blanchard wrote.</span></p>\n<p><span>The bank also downgraded First Solar (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/FSLR\" title=\"First Solar, Inc.\">FSLR</a></span>) to Hold from Buy with a $254 PT, slashed from $300, following its wide <a href=\"https://seekingalpha.com/news/4556363-first-solar-sinks-after-big-q4-miss-downside-full-year-sales-guidance\" target=\"_self\" title=\"Q4 earnings miss\">Q4 earnings miss</a>, which was impacted by under-utilization costs related to the onshoring line in South Carolina and a higher volumes mix coming from India at a lower margin overall.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558083-array-technologies-plunges-by-a-third-after-weak-earnings-guidance-deutsche-bank-downgrades",
            "pub_date": "2026-02-27 03:40:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558088",
            "title": "Mistral AI teams with Accenture to boost enterprise AI adoption in Europe",
            "description": "<html><body><ul>\n<li>French artificial intelligence company Mistral AI announced on Thursday that it has teamed up with Accenture (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ACN\" title=\"Accenture plc\">ACN</a></span>) to boost enterprise adoption of AI in Europe and around the world.</li>\n<li>As part of the deal, Mistral AI, which is backed by Microsoft (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a></span>), will work with Accenture to co-develop and deliver enterprise AI solutions across sectors, the companies said in a statement. “This joint approach will help enterprises capture value quickly and securely, supported by Accenture’s global network of AI specialists and its deep understanding of industry processes, regulatory environments and transformation needs,” the companies <a href=\"https://seekingalpha.com/pr/20414766-accenture-and-mistral-ai-accelerate-enterprise-reinvention-with-scalable-ai-that-delivers\" target=\"_blank\" title=\"added\">added</a>.</li>\n<li>Financial terms of the deal were not disclosed.</li>\n<li>“We are proud to partner with Accenture, whose international reach and industry depth make them an ideal partner to continue driving AI transformations for enterprises at scale,” Arthur Mensch, CEO and co-founder of Mistral AI, said. “Together, we will help organizations deploy AI that meets their needs for performance, control, and customization. This collaboration marks an important milestone for industries around the world to realize the ROI of AI.”</li>\n<li>Mistral AI <a href=\"https://seekingalpha.com/news/4552588-mistral-ai-to-acquire-cloud-service-provider-koyeb\" target=\"_blank\" title=\"said\">said</a> earlier this month that it will acquire cloud computing service provider Koyeb for an undisclosed amount.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558088-mistral-ai-teams-with-accenture-to-boost-enterprise-ai-adoption-in-europe",
            "pub_date": "2026-02-27 03:36:11",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558063",
            "title": "Barclays, Santander, Wells Fargo in Street lenders exposed to failed UK-based MFS - report",
            "description": "<html><body><p data-eci=\"true\">Barclays (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BCS\" title=\"Barclays PLC\">BCS</a></span>) (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BCLYF\" title=\"Barclays PLC\">BCLYF</a></span>), Banco Santander (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SAN\" title=\"Banco Santander, S.A.\">SAN</a></span>) (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BCDRF\" title=\"Banco Santander, S.A.\">BCDRF</a></span>), and Wells Fargo (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/WFC\" title=\"Wells Fargo &amp; Company\">WFC</a></span>) are said to be among the Wall Street lenders exposed to the failed UK mortgage finance firm, Market Financial Solutions.</p>\n<p>Apollo Global Management (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/APO\" title=\"Apollo Global Management, Inc.\">APO</a></span>) unit Atlas SP Partners; Jefferies Financial Group (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/JEF\" title=\"Jefferies Financial Group Inc.\">JEF</a></span>); and Castlelake LP, majority owned by Brookfield (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/BN\" title=\"Brookfield Corporation\">BN</a></span>), are also exposed to MFS, Bloomberg News <a href=\"https://www.bloomberg.com/news/articles/2026-02-26/barclays-atlas-among-firms-exposed-to-collapsed-uk-lender-mfs\" rel=\"nofollow\" target=\"_blank\" title=\"reported\">reported</a>, citing people familiar with the matter. </p>\n<p>This month, the UK-based specialist property finance solutions provider MFS entered into administration.</p>\n<p>Barclays and Atlas had helped arrange over £2B of loans to the firm, lending hundreds of millions of dollars, the Thursday, February 26 report noted.</p>\n<p>Barclays had about £600M tied up in the matter, a judge overseeing the MFS insolvency case reportedly said at the hearing.</p>\n<p>Meanwhile, Atlas was involved as a senior creditor and is pursuing all legal avenues to maximize recoveries on £400M of exposure, a spokesperson told Bloomberg.</p>\n<p>Furthermore, Jefferies had an exposure of ~£100M to MFS, according to a person familiar with the matter.</p>\n<p>And, Castlelake had arranged a lending facility, which has around £400M outstanding, one of the people reportedly said. However, a Castlelake spokesperson told Bloomberg in an emailed statement that they do not have direct unsecured exposure to MFS.</p>\n<p>The MFS issue could increase concerns relating to loose underwriting in credit markets, Bloomberg noted.</p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558063-barclays-santander-wells-fargo-in-street-lenders-exposed-to-failed-uk-based-mfs---report",
            "pub_date": "2026-02-27 03:36:11",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558077",
            "title": "Equinix, CPPIB near $4B deal for atNorth - Bloomberg",
            "description": "<html><body><p data-eci=\"true\">Equinix Inc. (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EQIX\" title=\"Equinix, Inc.\">EQIX</a></span>) and Canada Pension Plan Investment Board are close to an agreement to acquire atNorth Holding AB, a pan-Nordic data center operator.</p>\n<p>The consortium is close to a deal that could value atNorth at about $4 billion, including debt, according to a <a href=\"https://www.bloomberg.com/news/articles/2026-02-26/equinix-cppib-near-4-billion-deal-for-data-center-firm-atnorth\" rel=\"nofollow\" target=\"_blank\" title=\" Bloomberg report \"> Bloomberg report </a>on Thursday, which cited people familiar with the matter. A purchase of atNorth, which is owned by Partners Group Holding (<a href=\"https://seekingalpha.com/symbol/PGPHF\" title=\"Partners Group Holding AG\">PGPHF</a>), may be announced as soon as this week.</p>\n<p>While talks are advanced, a possible deal could still face delays, according to the report.</p>\n<p>CPPIB, Equinix and Partners Group declined to comment to Bloomberg. </p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558077-equinix-cppib-near-4b-deal-for-atnorth-bloomberg",
            "pub_date": "2026-02-27 03:26:47",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}