{
    "data": [
        {
            "id": "4558901",
            "title": "American Healthcare REIT outlines 2026 NFFO growth target of up to $2.05 per share, backed by strong SHOP and Trilogy performance",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: American Healthcare REIT (AHR) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>Jeffrey Hanson, Chairman and Interim CEO &amp; Interim President, began by addressing the leadership transition, stating \"I stepped into the role of Interim CEO, while Danny is on a medical leave of absence. I'm pleased to share that he's at home recovering well and is in good spirits... He intends to return in the relative near term, but it's too early to have timing visibility at this point.\" Hanson emphasized \"This is a seamless continuation of the strategy and execution you've grown to expect from this team... There's no change in strategy. Our investment in capital allocation strategy, risk management framework, balance sheet posture and long-term value orientation remain unchanged.\"</li>\n<li>Gabriel Willhite, Chief Operating Officer, highlighted \"the fourth quarter capped off another exceptional year of outsized NOI growth for AHR. We delivered total portfolio same-store NOI growth of 11.8% in the fourth quarter and 14.2% for the full year 2025.\" Willhite credited the operating portfolio, especially the Trilogy and SHOP segments, for this performance, noting \"same-store occupancy reached 90.6% in Q4, up 275 basis points year-over-year.\"</li>\n<li>Stefan K. Oh, Chief Investment Officer, reported \"We closed on over $950 million of new investments across our Trilogy and SHOP segments... The majority of our acquisition volume this year was within SHOP, where we added newer assets in attractive submarkets... our SHOP segment as the second largest within our diversified portfolio in terms of cash NOI.\"</li>\n<li>Brian Peay, Chief Financial Officer, stated \"We reported normalized funds from operations attributable to common stockholders, or NFFO of $0.46 per diluted share in the fourth quarter of 2025 and $1.72 per diluted share for all of 2025. That represents 22% year-over-year NFFO per share growth in 2025 as compared to 2024.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Brian Peay outlined 2026 guidance, stating \"we issued 2026 NFFO guidance of $1.99 to $2.05 per diluted share. This implies another year of double-digit NFFO per share growth and only includes the previously consummated 2026 acquisitions that Stefan mentioned earlier of $117.5 million.\" Peay provided total portfolio same-store NOI growth guidance for 2026 \"between 7% and 11%. That range is comprised of the following segment level same-store NOI growth ranges: 8% to 12% growth in Trilogy, 15% to 19% growth in SHOP, 0% to 2% growth in Outpatient Medical and a range of 2% to 3% growth in our Triple-Net Leased Properties segment.\"</li>\n<li>Management indicated no change in strategy or risk posture from prior quarters.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Peay reported \"normalized funds from operations attributable to common stockholders, or NFFO of $0.46 per diluted share in the fourth quarter of 2025 and $1.72 per diluted share for all of 2025.\"</li>\n<li>Willhite highlighted \"total portfolio same-store NOI growth of 11.8% in the fourth quarter and 14.2% for the full year 2025.\"</li>\n<li>Trilogy segment delivered \"same-store NOI increased 14% in the fourth quarter and 18.4% for the full year. Same-store occupancy reached 90.6% in Q4, up 275 basis points year-over-year.\"</li>\n<li>SHOP segment \"same-store NOI increased 24.6% in Q4 and 25.2% for 2025 compared to the same period in 2024.\"</li>\n<li>The company improved debt to EBITDA by nearly a full turn in 2025 and ended the year with a 3.4x net debt-to-EBITDA ratio.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Wesley Golladay, Baird, asked about the acquisition environment. Stefan K. Oh responded that the company continues to focus on higher acuity SHOP assets, noting \"for the most part, we're sticking with the higher acuity asset class.\"</li>\n<li>Ronald Kamdem, Morgan Stanley, inquired about SHOP guidance and occupancy. Peay stated \"the more occupied our buildings get, the more pricing power we have. And at 90.6%... we have more and more pricing power.\"</li>\n<li>Kamdem also asked about Trilogy occupancy and mix shift. Willhite explained \"the key thing with Q mix is going to be shifting to the higher payer sources... more people in Medicare setting and Medicare Advantage settings helps and fewer in the Medicaid setting helps.\"</li>\n<li>Austin Wurschmidt, KeyBanc, pressed on Trilogy's NOI growth outlook. Willhite responded \"we've got upside potential that's disproportionate to downside risk... If that trend holds true, then I think you can expect some upside in our occupancy assumptions.\"</li>\n<li>Michael Carroll, RBC, asked about the rollout of the revenue management platform. Willhite said it is \"still too early for us to release the results from it\" but highlighted the collaborative approach with operators.</li>\n<li>Michael Stroyeck, Green Street, asked about seasonality impact on SHOP occupancy. Willhite noted \"through early 2026, we're seeing much less of a flu impact... occupancy is not deeply impacted at least through February.\"</li>\n<li>Stroyeck inquired on triple-net portfolio hospital coverage. Peay said the volatility is due to operational shifts but emphasized the strength of the tenant's commitment and lease guarantee.</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts' questions centered on acquisition strategy, occupancy trends, and operational leverage, with a generally positive but probing tone, especially regarding growth sustainability and competitive positioning.</li>\n<li>Management maintained a confident and steady tone, emphasizing continuity, strong operating results, and a robust acquisition pipeline. Hanson stated \"This is a seamless continuation of the strategy and execution you've grown to expect from this team,\" and Peay expressed \"We are entering 2026 from a position of strength.\"</li>\n<li>Compared to the previous quarter, sentiment from both analysts and management remains confident, with slightly more focus on the impact of leadership transition and sustainability of growth.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 NFFO per diluted share increased to $1.99 to $2.05, compared to previous 2025 guidance of $1.69 to $1.72.</li>\n<li>Total portfolio same-store NOI growth guidance for 2026 set at 7% to 11%, lower than the full year 2025 result of 14.2%.</li>\n<li>SHOP and Trilogy segments continue to be highlighted as key growth drivers, with segment-level guidance reflecting expectations for continued, though moderating, growth.</li>\n<li>Management tone in both quarters emphasized confidence and strategic consistency, but the current quarter provided more detail on leadership continuity due to the CEO’s medical leave.</li>\n<li>Analysts’ focus shifted slightly toward sustainability of high growth rates and implementation of technology-driven revenue management across the portfolio.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management acknowledged the CEO’s medical leave but reassured stakeholders about leadership stability and continuity.</li>\n<li>Willhite discussed seasonality risks, noting flu season had less impact so far in early 2026 but indicated continued monitoring.</li>\n<li>Peay addressed volatility in the triple-net portfolio's hospital coverage, referencing operational changes but emphasizing strong tenant commitment.</li>\n<li>Analysts probed on acquisition timing and competitive dynamics, particularly regarding cap rate compression and asset quality.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>American Healthcare REIT emphasized that its leadership transition has not altered strategic direction or operational focus. The company reported another year of double-digit NFFO growth, driven by strong performance in the Trilogy and SHOP segments, disciplined acquisitions, and a robust pipeline. Guidance for 2026 targets continued growth, supported by high occupancy rates, expanding revenue management initiatives, and an active investment program. Management underscored a position of strength entering the new year, with stable leverage metrics and a clear focus on long-term value creation for shareholders.</p>\n<p><a href=\"https://seekingalpha.com/symbol/ahr/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558901-american-healthcare-reit-outlines-2026-nffo-growth-target-of-up-to-2_05-per-share-backed-by",
            "pub_date": "2026-02-28 05:21:24",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558898",
            "title": "President Trump tells federal agencies to cut ties with Anthropic amid AI dispute",
            "description": "<html><body><p data-eci=\"true\">President Trump demanded on Friday that U.S. government agencies cut their existing ties with generative artificial intelligence company Anthropic (<a href=\"https://seekingalpha.com/symbol/ANTHRO\" title=\"Anthropic\">ANTHRO</a>) amid a dispute over how its AI models are used. </p>\n<p>“The Leftwing nut jobs at Anthropic have made a DISASTROUS MISTAKE trying to STRONG-ARM the Department of War, and force them to obey their Terms of Service instead of our Constitution,” the president wrote on Truth Social. “Their selfishness is putting AMERICAN LIVES at risk, our Troops in danger, and our National Security in JEOPARDY. Therefore, I am directing EVERY Federal Agency in the United States Government to IMMEDIATELY CEASE all use of Anthropic’s technology. We don’t need it, we don’t want it, and will not do business with them again! There will be a Six Month phase out period for Agencies like the Department of War who are using Anthropic’s products, at various levels. Anthropic better get their act together, and be helpful during this phase out period, or I will use the Full Power of the Presidency to make them comply, with major civil and criminal consequences to follow.”</p>\n<p>Anthropic on Thursday said that the company “cannot in good conscience” allow the Department of Defense to use its models in all lawful use cases without limitation, adding that the agency’s threats do not change its position.</p>\n<p>“It is the Department’s prerogative to select contractors most aligned with their vision,” CEO Dario Amodei wrote in a <a href=\"https://www.anthropic.com/news/statement-department-of-war\" rel=\"nofollow\" target=\"_blank\" title=\"statement\">statement</a>. “But given the substantial value that Anthropic’s technology provides to our armed forces, we hope they reconsider.”</p>\n<p><span>“Partially autonomous weapons, like those used today in Ukraine, are vital to the defense of democracy. Even </span><em>fully<span> </span></em><span>autonomous weapons (those that take humans out of the loop entirely and automate selecting and engaging targets) may prove critical for our national defense. But today, frontier AI systems are simply not reliable enough to power fully autonomous weapons. We will not knowingly provide a product that puts America’s warfighters and civilians at risk,” Amodei added. </span></p>\n<p>The<span> AI </span>startup had been engaged in tense negotiations with the Pentagon lately, and it said Thursday that those discussions were still ongoing. Defense Secretary Pete Hegseth had threatened to label Anthropic a “supply chain risk” or to invoke the Defense Production Act to force the company to comply with its demands.</p>\n<p><span>Hegseth</span><span> </span>met with <span>Amodei</span><span> </span>at the<span> </span><span>Pentagon</span><span> </span>on Tuesday and gave<span> </span><span>Anthropic</span><span> </span>until Friday evening to accept his agency’s terms. According to a senior Pentagon official, the<span> </span><span>U.S. Department of Defense</span><span> </span>delivered its “last and final offer” to Anthropic on Wednesday night, CNBC reported.</p>\n<p>Chief Pentagon spokesman Sean Parnell said Thursday that the DoD had “no interest” in using Anthropic’s models for fully autonomous weapons or to conduct mass surveillance of Americans, which he noted is illegal. He emphasized that the agency wants the company to agree to allow its models to be used for “all lawful purposes.”</p>\n<p>“This is a simple, common-sense request that will prevent Anthropic from jeopardizing critical military operations and potentially putting our warfighters at risk,” Parnell wrote in<span> </span><a href=\"https://x.com/SeanParnellASW/status/2027072228777734474?s=20\" rel=\"noopener\" target=\"_blank\">a post<span> </span></a>on X on Thursday. “We will not let ANY company dictate the terms regarding how we make operational decisions.”</p>\n<p data-end=\"213\" data-start=\"0\"><span>Anthropic </span>signed a $200M contract with the<span> </span><span>United States Department of Defense</span><span> </span>in July, becoming the first lab to deploy its models in mission workflows on classified networks. Rivals<span> </span><span>OpenAI (<a href=\"https://seekingalpha.com/symbol/OPENAI\" title=\"OpenAI\">OPENAI</a>)</span>,<span> </span><span>Google</span><span> </span>(<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a></span>) (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a></span>), and <span>xAI</span><span> </span>(<a href=\"https://seekingalpha.com/symbol/X.AI\" title=\"xAI\">X.AI</a>) also received DoD awards worth up to $200M last year.</p>\n<div><div data-module=\"mps-slot\" id=\"MidResponsive-1\"></div></div>\n<div class=\"signup_widget_placeholder\"></div>\n\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558898-president-trump-tells-federal-agencies-to-cut-ties-with-anthropic-amid-ai-dispute",
            "pub_date": "2026-02-28 05:21:24",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558896",
            "title": "Hawaiian Electric GAAP EPS of $0.23, revenue of $805.82M",
            "description": "<html><body><ul>\n<li>Hawaiian Electric <a href=\"https://seekingalpha.com/pr/20418039-hei-reports-fourth-quarter-and-full-year-2025-results\">press release</a>  (HE): Q4  GAAP EPS of $0.23.</li>\n<li>Revenue of $805.82M (+0.8% Y/Y).</li>\n<li>Shares <font color=\"green\">+1.68%</font> AH.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558896-hawaiian-electric-gaap-eps-of-0_23-revenue-of-805_82m",
            "pub_date": "2026-02-28 05:16:08",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558892",
            "title": "SA Analyst sees a signal in the noise as stocks retreat on sticky PPI",
            "description": "<html><body><p data-eci=\"true\">Wall Street’s major market averages finished lower on Friday after the January wholesale inflation report came in hotter than expected, dampening investor sentiment and reinforcing concerns that price pressures remain sticky.</p>\n<p>The blue-chip Dow Jones Industrial Average (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DJI\" title=\"Dow Jones Industrial Average Index\">DJI</a></span></span></span></span>) fell 1%, while the benchmark S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>) declined 0.4%. The tech-heavy Nasdaq Composite (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/COMP:IND\" title=\"NASDAQ Composite Index\">COMP:IND</a></span></span></span>) shed 0.9% on the session, though its weekly performance told a more nuanced story. </p>\n<p>According to Seeking Alpha analyst Alex King of <a href=\"https://seekingalpha.com/author/cestrian-capital-research\" target=\"_blank\" title=\"Cestrian Capital Research\">Cestrian Capital Research</a>, underlying market dynamics may be shifting despite the day’s losses.</p>\n<p>“There is signal in the noise this week,” King said. “For some weeks now the Nasdaq has been the weaker of the three main U.S. equity indices. This week — of all weeks, the week in which we are being told that software is going to zero — the Nasdaq will close more or less flat on the week, versus declines in the S&amp;P, the Dow and the Russell 2000.” </p>\n<p>King added that the relative resilience could mark the early stages of a rotation back into technology shares, particularly software.</p>\n<p>“We believe that sleeping on software will be a mistake,” he added.</p>\n<p><strong>Market Tracking ETFs: </strong>(<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DIA\" title=\"State Street SPDR Dow Jones Indust Avg ETF Trust\">DIA</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DDM\" title=\"ProShares Ultra Dow30 ETF\">DDM</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DOG\" title=\"ProShares Short Dow30 ETF\">DOG</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DXD\" title=\"ProShares UltraShort Dow30 ETF\">DXD</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SDOW\" title=\"ProShares UltraPro Short Dow30 ETF\">SDOW</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SPY\" title=\"State Street SPDR S&amp;P 500 ETF Trust\">SPY</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/VOO\" title=\"Vanguard 500 Index Fund ETF\">VOO</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IVV\" title=\"iShares Core S&amp;P 500 ETF\">IVV</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/RSP\" title=\"Invesco S&amp;P 500 Eql Wght ETF\">RSP</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SSO\" title=\"ProShares Ultra S&amp;P500 ETF\">SSO</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/UPRO\" title=\"ProShares UltraPro S&amp;P500 ETF\">UPRO</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SH\" title=\"ProShares Short S&amp;P500 ETF\">SH</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SDS\" title=\"ProShares UltraShort S&amp;P500 ETF\">SDS</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SPXU\" title=\"ProShares UltraPro Short S&amp;P500 ETF\">SPXU</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QQQ\" title=\"Invesco QQQ Trust, Series 1 ETF\">QQQ</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QQQM\" title=\"Invesco NASDAQ 100 ETF\">QQQM</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/TQQQ\" title=\"ProShares UltraPro QQQ ETF\">TQQQ</a></span></span></span></span>), (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/QID\" title=\"ProShares UltraShort QQQ ETF\">QID</a></span></span></span></span>), and (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SQQQ\" title=\"ProShares UltraPro Short QQQ ETF\">SQQQ</a></span></span></span></span>).</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558892-sa-analyst-sees-a-signal-in-the-noise-as-stocks-retreat-on-sticky-ppi",
            "pub_date": "2026-02-28 05:06:42",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558855",
            "title": "Duke Energy continues gains for seven straight sessions",
            "description": "<html><body><p data-eci=\"true\">Duke Energy (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/DUK\" title=\"Duke Energy Corporation\">DUK</a></span></span>) shares continued gains for seven straight sessions, as the stock closed 1.25% higher at $130.84 on Friday.</p>\n<p>The energy company gained nearly 2% in the preceding six sessions. The shares have gained over 9% in the past month.</p>\n<p>Looking at Seeking Alpha’s <a href=\"https://seekingalpha.com/symbol/DUK/ratings/quant-ratings\" target=\"_blank\" title=\"quant rating\">quant rating</a>, DUK has a Hold rating with a score of 3.18 out of 5. The company has been graded A+ for profitability but is dragged down by a D- grade for growth and a D+ for momentum and revisions.</p>\n<p>Turning to the <a href=\"https://seekingalpha.com/symbol/DUK/ratings/sell-side-ratings\" target=\"_blank\" title=\"Wall Street\">Wall Street</a> community, 10 out of 22 analysts rated DUK a Buy and above, 12 analysts have given the stock a Hold recommendation, and no one recommended Sell or below.</p>\n<p>Seeking Alpha analysts have <a href=\"https://seekingalpha.com/symbol/DUK/ratings/author-ratings\" target=\"_blank\" title=\"issued\">issued</a> a Buy call for DUK, with two analysts rating it Buy, while one analyst suggested to Hold.</p>\n<p>Seeking Alpha analyst Zoltan Ban <a href=\"https://seekingalpha.com/article/4869052-duke-energy-beats-expectations-continues-to-be-a-buy\" target=\"_blank\" title=\"rated\">rated</a> DUK a Buy, raising the price target to $118 from under $115, reflecting improved fundamentals and continued outperformance versus peers.</p>\n<p>Ban highlighted that Duke Energy Corporation delivered strong Q4 and FY2025 results, with revenue up nearly 7% and net income approaching $5 billion.</p>\n<p>Ban added that DUK benefits from demographic trends in its main markets and a lower forward P/E than NextEra. However, he warned that rising debt-servicing costs, now over 11% of revenues, remain a key concern.</p>\n<p>On a year-to-date basis, the shares have gained 11%, outpacing the broader market, which rose by nearly 1%.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558855-duke-energy-continues-gains-for-seven-straight-sessions",
            "pub_date": "2026-02-28 05:06:42",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558894",
            "title": "MFIC signals aggressive $100M stock repurchase plan as board lowers dividend to $0.31 amid NAV decline",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: MidCap Financial Investment Corporation (MFIC) (mfic) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Tanner Powell reported net investment income per share of $0.39 and a GAAP net loss per share of $0.14 for the quarter, noting that the loss included $0.04 of onetime financing-related expenses. He stated that \"NAV per share was $14.18 at the end of December, down 3.3% compared to the prior quarter,\" attributing the decline to investments from 2022 and earlier. Powell emphasized the company’s focus on first lien positions, low software exposure, and cautious use of PIK, adding that recent paydowns from Merx and the full repayment of a nonaccrual position highlighted MFIC’s ability to \"maximize recoveries on challenged credits.\"</li>\n<li>Powell announced the repurchase of approximately 1.1 million shares at an average discount of 18%, costing $12.9 million and generating $0.03 per share of NAV accretion. He further revealed that the Board authorized a new $100 million stock repurchase plan, stating, \"we expect to utilize aggressively in combination with a 10b5-1 trading plan to capitalize on what we believe is a compelling opportunity for our stockholders.\"</li>\n<li>The Board declared a quarterly dividend of $0.31 per share, with Powell explaining, \"we have reassessed the long-term earnings power of the company, and the Board has concluded that it was prudent to adjust the dividend at this time.\"</li>\n<li>President Ted McNulty detailed $141 million in new commitments with a weighted average spread of 497 basis points and net fundings for the quarter of $25 million. He also highlighted the portfolio's diversification across 247 companies and 46 industries, with direct origination representing 96% of the portfolio.</li>\n<li>CFO Kenneth Seifert reported, \"Total investment income for the December quarter was approximately $78.4 million, a decline of $4.2 million or 5.1% from the prior quarter. This reduction was largely driven by lower interest income resulting from decreased base rates, new nonaccrual positions and continued asset spread compression.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul><li>Management expects to fully utilize the $107.9 million in current stock repurchase authorization by late May if current discount and trading volumes persist. Powell indicated confidence in maintaining the new $0.31 dividend, citing expected repayments, especially from Merx, and recent capital structure initiatives to reduce the cost of capital as factors that \"cushion the dividend.\"</li></ul>\n<h3>Financial Results</h3>\n<ul><li>Net investment income per share was $0.39, and GAAP net loss per share was $0.14, or $0.10 excluding onetime financing costs. NAV per share declined to $14.18. Total investment income decreased to $78.4 million due to lower base rates, new nonaccruals, and spread compression. Net expenses fell to $42.4 million, driven by the absence of incentive fees and lower interest expense. The portfolio had a net loss of $45.3 million, with negative performance contributions from LendingPoint, Renovo, Amplity, Bird Rides, New Era, and Banner Solutions. Positive contributions included Merx and Compass Health. The cost of debt declined to 5.95% from 6.37% in the prior quarter.</li></ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Richard Shane, JPMorgan: Asked about the persistence of stock discounts and whether more aggressive strategies to unlock value were under consideration. Powell replied, \"we'll continue to consider everything with an eye towards just sort of making sure that like the shareholders get the full value that we feel like they're entitled to in whatever form we can get it to them.\"</li>\n<li>Kenneth Lee, RBC: Questioned the discretionary nature of the new $100 million repurchase and dividend sustainability. Powell confirmed repurchase flexibility and use of a 10b5-1 plan. On the dividend, Powell stated, \"when we looked at the earnings power and we looked at the models, $0.31 was appropriate and achievable,\" citing progress with Merx and reduced capital costs as supporting factors.</li>\n<li>Robert Dodd, Raymond James: Sought insight into MFIC’s below-average software leverage and portfolio construction. Executive Chairman Howard Widra explained the focus on companies with more embedded performance consistency and fewer aggressive growth strategies, while Powell highlighted that \"90% has financial covenants\" in the software book.</li>\n<li>Casey Alexander, Compass Point: Asked about the commonality among underperforming credits. Widra characterized them as \"longer-dated credits that have -- many of which have had been on watch list,\" with Powell adding these credits often have \"idiosyncratic issues... sometimes compounded by some of those pockets of stress and in particular, some self-induced such as acquisition strategies...\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts pressed management on stock repurchase strategy, dividend sustainability, and portfolio risk, reflecting a slightly skeptical but constructive tone.</li>\n<li>Management maintained a measured confidence in prepared remarks, but showed more caution on dividend outlook and persistent market discounts during Q&amp;A, using phrases such as \"we'll continue to consider everything\" and \"when we looked at the earnings power...$0.31 was appropriate and achievable.\" Compared to last quarter, there was an increase in defensive language and acknowledgment of external pressures.</li>\n<li>The overall tone was more cautious than the previous quarter, with management more openly addressing risks and the sustainability of shareholder returns.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Dividend reduced from $0.38 to $0.31 per share, attributed to lower base rates and spread compression. NAV per share fell further, and net investment income per share increased slightly from $0.38 to $0.39, but GAAP earnings swung from a $0.29 profit to a $0.14 loss.</li>\n<li>Stock repurchase activity intensified, with a new $100 million plan announced, compared to a more passive approach last quarter.</li>\n<li>Portfolio yield and spread compressed, and the cost of debt declined following refinancing efforts.</li>\n<li>Analysts shifted focus from M&amp;A opportunities and portfolio leverage last quarter to more pointed questions on share buybacks, dividend policy, and software risk exposure.</li>\n<li>Management’s tone shifted from highlighting resilience and opportunity to more directly addressing challenges in earnings power and persistent market discounts.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Persistent market discounts to NAV and the challenge of unlocking shareholder value were flagged by both analysts and management.</li>\n<li>Lower base rates and spread compression continue to pressure earnings power and dividend coverage.</li>\n<li>Portfolio risk is exemplified by legacy investments from earlier vintages, with management noting \"idiosyncratic issues\" and self-induced challenges, particularly relating to acquisition strategies.</li>\n<li>The software portfolio’s modest leverage and high covenant quality were presented as mitigants to sector-specific risk, but management acknowledged selectivity and market caution.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>MFIC management emphasized a proactive approach to addressing persistent market discounts through an aggressive $100 million stock repurchase plan, while recalibrating the dividend to $0.31 per share in response to reduced earnings power from lower base rates and spread compression. The company’s portfolio remains primarily first lien with limited software exposure and robust covenant quality, but legacy investments continue to weigh on NAV. Management underscored ongoing efforts to maximize recoveries, reduce capital costs, and assure shareholders that all strategies to unlock value are under consideration in a challenging market environment.</p>\n<p><a href=\"https://seekingalpha.com/symbol/mfic/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558894-mfic-signals-aggressive-100m-stock-repurchase-plan-as-board-lowers-dividend-to-0_31-amid-nav",
            "pub_date": "2026-02-28 05:01:33",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558888",
            "title": "QIA, Visa and ADIA set to anchor SoftBank's PayPay IPO - report",
            "description": "<html><body><p data-eci=\"true\"><span>Qatar Holdings, an investment arm of Qatar Investment Authority,  the <span>Abu Dhabi Investment Authority, and Visa (<a href=\"https://seekingalpha.com/symbol/V\" title=\"Visa Inc.\">V</a>) are preparing to invest more than $200 million as cornerstone investors in the U.S. initial public offering of Softbank's (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SFTBY\" title=\"SoftBank Group Corp.\">SFTBY</a></span>) PayPay, according to a Reuters report.</span></span></p>\n<p><span><span>Digital payments provider PayPay is targeting a valuation of as much as $14 billion in an IPO, according to the Reuters report on Friday. PayPay plans to list on the Nasdaq next month.</span></span></p>\n<p><span><span>PayPay, SoftBank, Qatar Holdings, Visa and ADIA did not immediately respond to requests for comment from Reuters. </span></span></p>\n<p><span><span>PayPay filed its preliminary prospectus for a U.S. IPO <a href=\"https://seekingalpha.com/news/4551263-softbank-backed-paypay-files-for-us-ipo-after-government-shutdown-delay\" target=\"_blank\" title=\"earlier this month\">earlier this month</a>. It expects to trade on the Nasdaq under the symbol \"PAYP\".</span></span></p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558888-qia-visa-and-adia-set-to-anchor-softbanks-paypay-ipo-report",
            "pub_date": "2026-02-28 05:01:33",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558889",
            "title": "Not all abroad is beating the S&P 500",
            "description": "<html><body><p data-eci=\"true\">International equities have been markedly outpacing the U.S., although a quick scan shows there are still country exchange-traded funds lagging even a tiny S&amp;P 500 (<a href=\"https://seekingalpha.com/symbol/SP500\" title=\"S&amp;P 500 Index\">SP500</a>) (<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"State Street SPDR S&amp;P 500 ETF Trust\">SPY</a>) gain so far this year. </p>\n<p>U.S. stocks (<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"State Street SPDR S&amp;P 500 ETF Trust\">SPY</a>) were up less than 1% year-to-date as of Friday midafternoon trading, trailing emerging markets (<a href=\"https://seekingalpha.com/symbol/EEM\" title=\"iShares MSCI Emerging Markets ETF\">EEM</a>) +14%. South Korea (<a href=\"https://seekingalpha.com/symbol/EWY\" title=\"iShares MSCI South Korea ETF\">EWY</a>) is the largest foreign gainer, surging 55% in a historic, AI-led rally, followed by Peru (<a href=\"https://seekingalpha.com/symbol/EPU\" title=\"iShares MSCI Peru and Global Exposure ETF\">EPU</a>) +29% and Thailand (<a href=\"https://seekingalpha.com/symbol/THD\" title=\"iShares MSCI Thailand ETF\">THD</a>) +25%.</p>\n<p>On the other hand, Denmark (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EDEN\" title=\"iShares MSCI Denmark ETF\">EDEN</a></span>) is leading the international losers, sliding 5.4% YTD, amid <a href=\"https://seekingalpha.com/news/4556068-novo-downgraded-jp-morgan-cagrisema-data\" target=\"_blank\" title=\"disappointing news\">disappointing news</a> around Novo Nordisk (<a href=\"https://seekingalpha.com/symbol/NVO\" title=\"Novo Nordisk A/S\">NVO</a>) (<a href=\"https://seekingalpha.com/symbol/NONOF\" title=\"Novo Nordisk A/S\">NONOF</a>). From there, Indonesia (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IDX\" title=\"VanEck Indonesia Index ETF\">IDX</a></span>) slid 3.6%, Kuwait (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/KWT\" title=\"iShares MSCI Kuwait ETF\">KWT</a></span>) -3.5%, India (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/IMVP\" title=\"Invesco India ETF\">IMVP</a></span>) -2.9% and Argentina (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ARGT\" title=\"Global X MSCI Argentina ETF\">ARGT</a></span>) -0.3%.</p>\n<p> </p>\n<figure class=\"regular-img-figure\" contenteditable=\"false\"><span><img alt=\"SPY, EDEN, IDX, KWT, IMVP, ARGT year-to-date price returns\" data-caption=\"SPY, EDEN, IDX, KWT, IMVP, ARGT year-to-date price returns\" data-original-src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/084488b4b6df008b8d5158d4c7d2e23e.png\" data-rel=\"lightbox\" data-source=\"Seeking Alpha\" fetchpriority=\"high\" height=\"311\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\" src=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/084488b4b6df008b8d5158d4c7d2e23e.png?io=w640\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/084488b4b6df008b8d5158d4c7d2e23e.png?io=w750 750w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/084488b4b6df008b8d5158d4c7d2e23e.png?io=w640 640w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/084488b4b6df008b8d5158d4c7d2e23e.png?io=w480 480w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/084488b4b6df008b8d5158d4c7d2e23e.png?io=w320 320w,https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/084488b4b6df008b8d5158d4c7d2e23e.png?io=w240 240w\" width=\"900\"/></span><figcaption class=\"overlay-title\"><p class=\"item-caption\">SPY, EDEN, IDX, KWT, IMVP, ARGT year-to-date price returns<span class=\"item-source\"> (Seeking Alpha) </span></p></figcaption></figure><p> </p>\n<p><strong id=\"docs-internal-guid-d805c68c-7fff-b79e-ae8f-4c65d19fece8\"><span>Emerging Market ETFs: </span></strong>(<a href=\"https://seekingalpha.com/symbol/IEMG\" title=\"iShares Core MSCI Emerging Markets ETF\">IEMG</a>), (<a href=\"https://seekingalpha.com/symbol/VWO\" title=\"Vanguard Emerging Markets Stock Index Fund ETF\">VWO</a>), (<a href=\"https://seekingalpha.com/symbol/EEM\" title=\"iShares MSCI Emerging Markets ETF\">EEM</a>), (<a href=\"https://seekingalpha.com/symbol/SPEM\" title=\"State Street SPDR Portfolio Emerging Markets ETF\">SPEM</a>), (<a href=\"https://seekingalpha.com/symbol/SCHE\" title=\"Schwab Emerging Markets Equity ETF\">SCHE</a>), and (<a href=\"https://seekingalpha.com/symbol/AVEM\" title=\"Avantis Emerging Markets Equity ETF\">AVEM</a>).</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/cdn/s3/uploads/attachment/image/084488b4b6df008b8d5158d4c7d2e23e.png?io=w640",
            "link": "https://seekingalpha.com/news/4558889-not-all-abroad-is-beating-the-sp-500",
            "pub_date": "2026-02-28 04:56:34",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558891",
            "title": "SpaceX targets confidential IPO filing as soon as next month - report",
            "description": "<html><body><p data-eci=\"true\">Elon Musk's SpaceX (<a href=\"https://seekingalpha.com/symbol/SPACE\" title=\"SpaceX\">SPACE</a>) may file confidentially for an initial public offering as soon as next month.</p>\n<p>SpaceX (<a href=\"https://seekingalpha.com/symbol/SPACE\" title=\"SpaceX\">SPACE</a>) plans to submit its draft IPO registration to the US Securities and Exchange Commission next month, according to a<a href=\"https://www.bloomberg.com/news/articles/2026-02-27/spacex-is-said-to-weigh-confidential-ipo-filing-as-soon-as-march\" rel=\"nofollow\" target=\"_blank\" title=\" Bloomberg report \"> Bloomberg report </a> on Friday, which cited people familiar with the matter. The filing would allow SpaceX to keep its plans on track for a June listing.</p>\n<p>A listing for SpaceX would raise as much as $50 billion, and the company could seek a valuation in the IPO of more than $1.75 trillion, according to the report. </p>\n<p>SpaceX (<a href=\"https://seekingalpha.com/symbol/SPACE\" title=\"SpaceX\">SPACE</a>) didn’t immediately respond to a request for comment from Bloomberg.</p>\n<p>Shares of EchoStar (<a href=\"https://seekingalpha.com/symbol/SATS\" title=\"EchoStar Corporation\">SATS</a>) rose 6.8% following the report.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558891-spacex-targets-confidential-ipo-filing-as-soon-as-next-month-report",
            "pub_date": "2026-02-28 04:51:04",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558890",
            "title": "Applied Optoelectronics targets over $1B in 2026 revenue as 800G and 1.6T production ramps",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Applied Optoelectronics (AAOI) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Chih-Hsiang Lin highlighted record quarterly results, stating \"total revenue increased 83% compared to 2024 to a record $456 million.\" He emphasized the \"robust demand in both our CATV and data center business\" and noted a \"fourth 800G buying order from one of our major hyperscale customers to support its AI data center growth.\" Lin added, \"We have become ramping up production of this 800G module in anticipation of a strong volume ramp starting in Q2.\"</li>\n<li>Lin discussed manufacturing expansion, saying, \"due to the software investment we have made, we have materially expanded our manufacturing capacity.\"</li>\n<li>CFO Stefan Murry stated, \"we are pleased to deliver record fourth quarter results that were in line with or better than our expectations and which capped off the strongest year in our company's history.\" Murry also outlined four key priorities for 2026: \"scaling our next-generation data center products...expanding our production capacity...diversifying our revenue base; and...strengthening operational execution to improve our margins and long-term profitability.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Murry projected Q1 2026 revenue between $150 million and $165 million, with non-GAAP gross margin in the range of 29% to 31%. Non-GAAP net income is expected to be in the range of a loss of $7 million to a loss of $0.3 million and non-GAAP earnings per share between a loss of $0.09 per share and breakeven.</li>\n<li>He added, \"we expect to generate over $1 billion in revenue this year with a non-GAAP operating profit of over $120 million.\"</li>\n<li>Management stated that \"this revenue level is limited by our production capacity and supply chain, not market demand, which we believe is much larger.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Q4 2025 revenue was $134.3 million, up 34% year-over-year and 13% sequentially, and in line with guidance of $125 million to $140 million.</li>\n<li>Non-GAAP gross margin was 31.4%, above the high end of the guidance range. Non-GAAP loss per share was $0.01, narrower than the guidance range of a loss of $0.13 to a loss of $0.04.</li>\n<li>Data center revenue was $74.9 million, up 69% year-over-year and 70% sequentially. Sales of 100G products increased 54% year-over-year; 400G products increased 141% year-over-year.</li>\n<li>CATV revenue was $54 million, up 3% year-over-year but down 24% sequentially from a record Q3.</li>\n<li>Operating expenses were $49.3 million or 37% of revenue.</li>\n<li>Cash and equivalents at quarter end were $216 million; inventory was $183.1 million. Capital investments for the quarter totaled $84 million.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Simon Leopold, Raymond James: Asked for clarification on 800G revenue, to which Murry replied \"it was below $4 million.\" Lin added, \"a lot below it is delayed to Q1, but we have emphasized the revenue will be big in Q2 next year across the target.\"</li>\n<li>Leopold inquired about gross margin trajectory. Lin responded, \"the gross margin for 1.6T is much, much higher than the other products...I believe we're going to achieve 40% gross margin by late Q3 or Q4 next year.\"</li>\n<li>Leopold questioned CATV outlook. Murry explained, \"they're spending this year and next year a significant amount of their spend...towards the amplifiers...and that's where we play.\"</li>\n<li>Michael Genovese, Rosenblatt Securities: Asked about 800G ramp milestones. Murry said, \"the firmware has to be modified to work with all those different platforms...that should be done in the middle of next month...that's basically the last hurdle to kind of unleash the ramp.\"</li>\n<li>Genovese questioned production mix. Lin explained, \"by end of next year, I would say more than 55% will be manufactured in the U.S. or even 60% or 65%...but let me say that more than 80%, 85% of investment will be in Texas.\"</li>\n<li>George Notter, Wolfe Research: Asked about tariffs. Murry stated, \"the one place where I'm pretty confident in saying it's not going to be tariff, it's product that's made in the U.S., and that's what we're scaling up to do.\"</li>\n<li>Ryan Koontz, Needham &amp; Company: Inquired about laser supply. Murry said, \"we're planning to triple our production of indium phosphide-related devices here...by the middle part of next year.\"</li>\n<li>Tim Savageaux, Northland Capital Markets: Asked about data center revenue growth. Murry replied, \"we also do expect to see some revenue in 800 gig, just not the dramatic ramp that we expect to see starting in Q2.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts focused heavily on near-term 800G ramp, production bottlenecks, gross margin targets, and CATV demand, with a tone that was inquisitive but occasionally pressing, especially regarding execution timelines and supply constraints. </li>\n<li>Management maintained a confident tone in prepared remarks, using phrases like \"we believe this positions us well\" and \"we are pleased to deliver record fourth quarter results.\" During Q&amp;A, management acknowledged some operational bottlenecks and displayed slight defensiveness when clarifying production and margin timelines, but reiterated confidence in ramping capacity and meeting demand.</li>\n<li>Compared to the previous quarter, both analysts and management displayed increased optimism, especially regarding scale and demand, but with heightened scrutiny around execution risk and production capacity.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for 2026 shifted to a higher revenue target ($1 billion) versus prior focus on achieving $300 million in CATV; margin expansion targets became more specific, aiming for 40% gross margin by late Q3 or Q4 next year.</li>\n<li>Strategic focus moved decisively toward scaling 800G and 1.6T production and U.S. manufacturing footprint; capital investment plans expanded significantly relative to Q3.</li>\n<li>Analysts in both quarters pressed for details on production scaling and customer demand, but Q4's exchanges were more focused on resolving capacity bottlenecks and ramping new products. </li>\n<li>Management's tone evolved from cautious optimism to confident ambition, particularly in outlining explicit targets and acknowledging capacity as the main constraint.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management noted supply chain and manufacturing capacity as the primary constraints to revenue growth, rather than demand.</li>\n<li>Ongoing firmware optimization was cited as a reason for delayed 800G revenue in Q4, with expectations for resolution in Q1 and ramp in Q2.</li>\n<li>Tariffs remain a cost risk, though Murry explained efforts to onshore production to mitigate this.</li>\n<li>Analysts repeatedly questioned execution risks in manufacturing scale-up and order fulfillment.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Applied Optoelectronics closed 2025 with record results and signaled a pivotal year ahead, targeting over $1 billion in revenue for 2026 as it ramps 800G and 1.6T production for hyperscale data center customers. Management underscored that near-term growth is gated by manufacturing capacity rather than demand, with substantial investments focused on U.S. expansion and automation. The outlook is anchored by strong customer commitments and a robust product pipeline, though execution risks tied to supply chain and scaling remain under close watch by both management and analysts.</p>\n<p><a href=\"https://seekingalpha.com/symbol/aaoi/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558890-applied-optoelectronics-targets-over-1b-in-2026-revenue-as-800g-and-1_6t-production-ramps",
            "pub_date": "2026-02-28 04:31:26",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}