{
    "data": [
        {
            "id": "4558595",
            "title": "Jamieson Wellness reports Q4 results",
            "description": "<html><body><ul>\n<li>Jamieson Wellness <a href=\"https://seekingalpha.com/pr/20416597-jamieson-wellness-inc-reports-fourth-quarter-and-full-year-2025-results\">press release</a>  (JWEL:CA): Q4 Non-GAAP EPS of C$0.90.</li>\n<li>Consolidated revenue increased 13.4% to C$277.7 million, driven by 17.1% growth in Jamieson Brands, partially offset by an expected decline in Strategic Partners revenue</li>\n<li>Gross profit increased by C$18.5 million to C$118.7 million, mainly driven by higher Jamieson Brands revenues and increased margins.</li>\n<li>Consolidated revenue increased 13.4% to C$277.7 million, driven by 17.1% growth in Jamieson Brands, partially offset by an expected decline in Strategic Partners revenue</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558595-jamieson-wellness-reports-q4-results",
            "pub_date": "2026-02-27 18:35:57",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558587",
            "title": "LafargeHolcim reports FY results",
            "description": "<html><body><ul>\n<li><p data-eci=\"true\">LafargeHolcim <a href=\"https://www.holcim.com/media/media-releases/full-year-2025-results\" rel=\"nofollow\" target=\"_blank\">press release</a>  (HCMLF): FY Earnings per share of CHF 3.22, up 5.0%</p></li>\n<li>Full-year net sales of CHF 15 724 million, +3.0% in LC, up 3.4% in Q4 Recurring EBIT of CHF 2 876 million, +10.3% in LC, up 12.2% in Q4 </li>\n<li>Expansion of industry-leading recurring EBIT margin to 18.3%, +80bps</li>\n<li>Free cash flow of CHF 2 154 million, cash conversion of 54%</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558587-lafargeholcim-reports-fy-results",
            "pub_date": "2026-02-27 18:21:36",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558583",
            "title": "Diamond Hill Investment reports Q4 results",
            "description": "<html><body><ul>\n<li>Diamond Hill Investment <a href=\"https://seekingalpha.com/pr/20416576-diamond-hill-investment-group-inc-reports-2025-financial-results\">press release</a>  (DHIL): Q4 Adjusted earnings per share attributable to common shareholders - diluted was $11.56, compared to $12.92 in 2024.</li>\n<li>Assets under management (\"AUM\") and assets under advisement (\"AUA\") combined were $31.0 billion, compared to $31.9 billion as of December 31, 2024.</li>\n<li>Average AUM and AUA combined were 31.8 billion, compared to $31.6 billion during 2024.</li>\n<li>Net client outflows were $2.7 billion, compared to $0.3 billion of net outflows during 2024.</li>\n<li>Revenue was $147.1 million, compared to $151.1 million in 2024.</li>\n<li>Net operating profit margin was 25% in 2025, compared to 29% in 2024, respectively.</li>\n<li>Adjusted net operating profit margin<sup>1</sup> was 29% in 2025 compared to 32% in 2024.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558583-diamond-hill-investment-reports-q4-results",
            "pub_date": "2026-02-27 18:16:14",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558584",
            "title": "ECN Capital declares $0.01 dividend",
            "description": "<html><body><ul>\n<li>ECN Capital (ECN:CA) declares <a href=\"https://seekingalpha.com/pr/20416857-ecn-capital-reports-us-0_05-in-adjusted-net-income-per-common-share-in-q4-2025\" target=\"_blank\">C$0.01/share quarterly dividend</a>, in line with previous.</li>\n<li>Payable March 31; for shareholders of record March 20; ex-div March 20.</li>\n<li><a href=\"https://seekingalpha.com/symbol/ECN:CA/dividends?source=news_bullet\">See ECN:CA Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558584-ecn-capital-declares-0_01-dividend",
            "pub_date": "2026-02-27 18:16:14",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558576",
            "title": "LSI Industries prices $90M stock offering",
            "description": "<html><body><ul>\n<li>LSI Industries (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/LYTS\" title=\"LSI Industries Inc.\">LYTS</a></span>) has <a href=\"https://seekingalpha.com/pr/20417058-lsi-industries-prices-public-offering-of-common-stock\" target=\"_blank\" title=\" priced \">priced </a>its underwritten public offering of 4.6M shares at $19.75 per share to raise approximately $90M in gross proceeds.</li>\n<li>The firm has granted the underwriters a 30-day option to purchase up to an additional 690,000 shares at the public offering price, less underwriting discounts and commissions.</li>\n<li>The offering is expected to close on or about March 2, 2026, subject to the satisfaction of customary closing conditions.</li>\n<li>The firm plans to use the net proceeds to implement its growth and acquisition strategy, including payment of a portion of the purchase price for its proposed Royston Group acquisition, repayment of borrowings under the proposed senior secured credit facility commitment letter, dated January 21, 2026, and for general working capital and corporate purposes.</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558576-lsi-industries-prices-90m-stock-offering",
            "pub_date": "2026-02-27 18:10:50",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558580",
            "title": "NetApp declares $0.52 dividend",
            "description": "<html><body><ul>\n<li>NetApp (NTAP) declares <a href=\"https://seekingalpha.com/pr/20416501-netapp-reports-third-quarter-of-fiscal-year-2026-results\" target=\"_blank\">$0.52/share quarterly dividend</a>, in line with previous.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/NTAP/dividends/yield?source=news_bullet\">Forward yield</a> 2.1%</li>\n<li>Payable April 22; for shareholders of record April 3; ex-div April 3.</li>\n<li><a href=\"https://seekingalpha.com/symbol/NTAP/dividends?source=news_bullet\">See NTAP Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558580-netapp-declares-0_52-dividend",
            "pub_date": "2026-02-27 18:10:50",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558573",
            "title": "PubMatic targets double-digit revenue growth in H2 2026 while accelerating agentic AI adoption",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: PubMatic (PUBM) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Rajeev Goel stated that PubMatic delivered \"an exceptionally strong fourth quarter, with revenue and adjusted EBITDA ahead of guidance, healthy margins and strong cash flow.\" Goel highlighted that the company's CTV revenue grew over 50% year-over-year, excluding political, and that Activate activity grew over three times. Emerging revenues, including Activate, commerce media, and new AI solutions, nearly doubled over 2024 and now comprise nearly 10% of total revenues. Goel emphasized PubMatic's leadership in AI solutions and projected accelerated double-digit percentage growth for the second half of 2026. </li>\n<li>Goel announced the launch of AgenticOS and noted: \"By 2028, I expect 25% of all digital advertising to be executed autonomously via agentic AI. And by 2030, I expect that to jump to 50%.\" He also referenced the company’s partnerships and new product launches, including a partnership with NVIDIA and the rollout of AI Insights for publishers.</li>\n<li>Goel underlined the company’s progress in DSP diversification, saying PubMatic integrated 50 new DSP partners and grew its buyer-focused go-to-market team by nearly 20% year-over-year. The company now partners with 28 of the top 30 global streamers, and its OpenWrap SDK is integrated with Google AdMob and Google Ad Manager for mobile app.</li>\n<li>CFO Steven Pantelick stated, \"Q4 was a pivotal turning point for us, as we significantly exceeded expectations on both revenue and adjusted EBITDA. Adjusting for political revenues and revenues derived from the legacy DSP referenced mid last year, the remainder of our business, which represented 83% of revenue in Q4, grew 18% year-over-year.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Pantelick reported that January revenues were in line with expectations and ad spending was healthy. PubMatic expects Q1 revenue to be in the range of $58 million to $60 million, and Q1 adjusted EBITDA is expected to be between (-$0.5 million) and $1 million. \"We expect to return to double-digit revenue growth in the second half of this year, with a corresponding expansion of our margins from revenue growth, supported by disciplined investment and increased efficiencies from AI,\" Pantelick said.</li>\n<li>Full-year cost of revenue is expected to marginally increase in the low single digits, primarily due to industry-wide utility cost pass-throughs from data center providers, while full-year operating expenses are expected to grow in the mid-single-digit percentages. Pantelick explained, \"Full-year CapEx is projected to be approximately $15 million to $19 million and reflects a shift away from investments for increased ad impression capacity and instead towards expanding support for AI workloads.\"</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Pantelick reported, \"Q4 adjusted EBITDA was $27.8 million or 35% margin, which included a foreign exchange impact of approximately $0.5 million due to the weakening U.S. dollar over the quarter. Q4 GAAP net income was $6.7 million, or $0.14 per diluted share.\"</li>\n<li>The company generated $81 million in net operating cash flows in 2025, up 10% over 2024, and delivered free cash flow of $46 million, a 32% increase over last year. Cash and equivalents stood at $145.5 million with zero debt at quarter-end.</li>\n<li>Emerging revenue streams in Q4 grew over 75% year-over-year and represented roughly 12% of total revenues. Pantelick stated, \"In just a few months, nearly 10% of publishers on our platform are now deriving revenue from our AI solutions and generating incremental revenue for PubMatic.\"</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Shweta Khajuria, Wolfe Research, LLC: Asked about the Amazon partnership. Goel explained, \"We're 1 of 3 SSPs in their Certified Supply Exchange program...it exceeded the targets that we laid out in 2025, and we're excited about the growth opportunity for that in 2026.\"</li>\n<li>Matthew Condon, Citizens JMP Securities, LLC: Asked about PubMatic’s differentiators in the AI-driven ad landscape. Goel responded, \"We are uniquely positioned to win in this arena for a few reasons. So, first is that we have a significant advantage with respect to deep customer integrations...Second, with Activate, buyers can now buy directly in our SSP...Third is that we've launched AgenticOS...And then fourth, we have purpose-built AI infrastructure.\"</li>\n<li>Barton Crockett, Rosenblatt Securities Inc.: Asked about long-term agentic AI adoption. Goel affirmed, \"...I do think, as I mentioned earlier, this is going to be not just technology, but a value chain disruptor.\"</li>\n<li>Robert Coolbrith, Evercore ISI: Asked about drivers of upside in the quarter. Pantelick highlighted, \"We saw strong growth in emerging revenues, which grew over 75% in the fourth quarter year-over-year. We saw mobile app accelerate to 25% growth. And we saw CTV continue to perform double-digit rates.\"</li>\n<li>Matthew Swanson, RBC Capital Markets, Research Division: Inquired about DSP diversification. Goel stated, \"We've made tremendous headway in expanding our DSP mix...there's a lot of opportunity, and we have a really robust road map going after this group of DSPs.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analyst tone was positive to slightly cautious, with a focus on understanding strategic differentiation, AI monetization, and DSP diversification. Questions reflected optimism about the company’s innovation while probing for the durability of growth and execution on new initiatives.</li>\n<li>Management maintained a confident tone in both prepared remarks and Q&amp;A, with repeated references to exceeding expectations, robust growth areas, and early leadership in AI. Goel consistently emphasized, \"We are uniquely positioned\" and Pantelick referenced \"pivotal turning point\" and \"multi-year innovation road map.\"</li>\n<li>Compared to Q3, management’s tone strengthened, shifting from expectation-setting to highlighting tangible execution and early wins in agentic AI and emerging revenue streams. Analyst sentiment also improved, with more questions about scaling and monetization versus fundamental risks.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Q4 guidance and commentary signaled a shift from cautious growth to a more assertive outlook, with explicit forecasts for double-digit revenue growth in the second half of 2026 and expanded AI-related revenue.</li>\n<li>Strategic focus evolved from initial AI adoption and infrastructure investment in Q3 to direct monetization and rapid scaling of agentic AI and Activate in Q4.</li>\n<li>Key metrics improved: Q4 adjusted EBITDA margin of 35% versus 16% in Q3; net operating cash flows rose to $81 million; free cash flow increased 32% year-over-year.</li>\n<li>Management's confidence increased, emphasizing structural inflection points, accelerated growth, and emerging revenue streams outpacing market rates.</li>\n<li>Analyst focus in Q4 shifted toward AI-driven differentiation, revenue scaling, and DSP diversification, compared to Q3’s questions on stabilization and infrastructure differentiation.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management noted continued headwinds from a large legacy DSP, with Pantelick stating, \"The big headwind that we're working through is what we called out mid last year is the large legacy DSP.\"</li>\n<li>Pantelick addressed industry-wide utility cost pass-throughs as a factor in rising cost of revenue, with efforts underway to offset these costs via efficiency initiatives.</li>\n<li>Potential impact from regulatory or legal outcomes was discussed, including ongoing litigation against Google and uncertainty around the Google DOJ case. Goel stated, \"We, like you are waiting for the court's verdict in terms of remedies...none of that potential tailwind is included in the forward outlook.\"</li>\n<li>Analysts raised concerns about channel shifts due to LLM models and AI search; Goel indicated limited impact to current revenue streams.</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>PubMatic management emphasized that the company has entered 2026 with a stronger revenue mix, improved cost structure, and expects to return to double-digit revenue growth in the second half of the year. Early adoption and scaling of agentic AI, robust CTV and mobile growth, and disciplined expense management have positioned PubMatic for durable long-term shareholder value, with AI innovations expected to drive both revenue and operational efficiencies as the company leads the transformation in digital advertising.</p>\n<p><a href=\"https://seekingalpha.com/symbol/pubm/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558573-pubmatic-targets-double-digit-revenue-growth-in-h2-2026-while-accelerating-agentic-ai",
            "pub_date": "2026-02-27 18:01:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558572",
            "title": "Equinix, CPP Investments to buy atNorth for $4B",
            "description": "<html><body><p data-eci=\"true\">Equinix (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/EQIX\" title=\"Equinix, Inc.\">EQIX</a></span>) and Canada Pension Plan Investment Board (CPP Investments) have entered into a joint agreement to purchase atNorth, a pan-Nordic data center operator, from Partners Group for $4B.</p>\n<p>CPP Investments will invest around $1.6B, owning ~60% controlling interest, and Equinix will own ~40% stake. The transaction is expected to be immediately accretive upon close to Equinix's adjusted funds from operations ((AFFO)) per share.</p>\n<p><span>\"The scalable sites of atNorth are very complementary to Equinix's connectivity services and global footprint. Combined with our joint focus on sustainability, this acquisition is expected to enhance our ability to help customers unlock the full potential of the Nordics' expanding digital landscape,\" explained </span><span>Bruce Owen</span><span>, president, EMEA, Equinix.</span></p>\n<p>The agreement supports atNorth in its continued rapid scaling, through capturing opportunities created by rising demand for data center infrastructure. atNorth has an installed and active development pipeline of around 800 MW that will come online over the next five years.</p>\n<p>In addition, it has plans for significant further expansion, with an additional 1 GW of secured power and a considerable amount of future capacity planned, providing a platform for future expansion across the Nordics.</p>\n<p>As part of the transaction, CPP Investments and Equinix have provisionally agreed to a financing package of $4.2B (€3.6B), underwritten by a group of European and Canadian lenders to fund the deal as well as the capital required to fund the expansion of the business.</p>\n<p>Source: <a href=\"https://seekingalpha.com/pr/20417138-cpp-investments-and-equinix-to-acquire-atnorth-for-us-4-billion\">Press Release</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558572-equinix-cpp-investments-to-buy-atnorth-for-4b",
            "pub_date": "2026-02-27 18:01:52",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558571",
            "title": "Pembina Pipeline declares $0.71 dividend",
            "description": "<html><body><ul>\n<li>Pembina Pipeline (PBA) declares <a href=\"https://seekingalpha.com/pr/20416868-pembina-pipeline-corporation-reports-results-for-the-fourth-quarter-of-2025-and-provides\" target=\"_blank\">$0.71/share quarterly dividend</a>, in line with previous.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/PBA/dividends/yield?source=news_bullet\">Forward yield</a> 6.45%</li>\n<li>Payable March 31; for shareholders of record March 16; ex-div March 16.</li>\n<li><a href=\"https://seekingalpha.com/symbol/PBA/dividends?source=news_bullet\">See PBA Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder_news_bottom\"></div></body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558571-pembina-pipeline-declares-0_71-dividend",
            "pub_date": "2026-02-27 17:56:02",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4558569",
            "title": "Palmer Square Capital BDC declares $0.36 dividend",
            "description": "<html><body><ul>\n<li>Palmer Square Capital BDC (PSBD) declares <a href=\"https://seekingalpha.com/pr/20414932-palmer-square-capital-bdc-inc-announces-fourth-quarter-and-full-year-2025-financial-results\" target=\"_blank\">$0.36/share quarterly dividend</a>, in line with previous.</li>\n<li>\n<a href=\"https://seekingalpha.com/symbol/PSBD/dividends/yield?source=news_bullet\">Forward yield</a> 13.52%</li>\n<li>Payable April 9; for shareholders of record March 27; ex-div March 27.</li>\n<li><a href=\"https://seekingalpha.com/symbol/PSBD/dividends?source=news_bullet\">See PSBD Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4558569-palmer-square-capital-bdc-declares-0_36-dividend",
            "pub_date": "2026-02-27 17:50:53",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}