{
    "data": [
        {
            "id": "4557799",
            "title": "Magnite signals CTV surpasses 50% of business as 2026 growth targets outlined",
            "description": "<html><body><p data-eci=\"true\">Earnings Call Insights: Magnite (MGNI) Q4 2025</p>\n<h3>Management View</h3>\n<ul>\n<li>CEO Michael Barrett highlighted that \"in Q4, CTV contribution ex-TAC grew 32% ex political, meaningfully above our guide. That acceleration began in Q3 and strengthened into year-end. As we enter 2026, CTV is now larger than DV+ making streaming the majority of our business.\" Barrett emphasized a broad-based adoption across \"media owners, agencies and DSPs,\" naming LG Ads, Netflix, Paramount, Roku, VIZIO, Walmart, and Warner Bros. Discovery as key growth partners. He stated, \"ClearLine activation continues to gain momentum as buyers increasingly seek direct, transparent and efficient access to premium streaming supply.\"</li>\n<li>Barrett reported, \"In DV+, we operate in a highly competitive market where we hold mid-single-digit share. In CTV, our share is multiple times better. As dollars migrate into streaming, they moved into a segment where we have deeper integrations, stronger publisher relationships and differentiated infrastructure.\"</li>\n<li>Barrett addressed AI, stating that Magnite executed \"what we believe was the industry's first agent-to-agent campaign\" using the AdCP protocol, partnering with Scope3 and MiQ. He asserted, \"AI is not displacing our infrastructure. It is increasing throughput across it.\"</li>\n<li>CFO David Day stated, \"As Michael mentioned, we had a strong Q4 and finish to the year with a great performance in CTV, achieving 20% contribution ex-TAC growth or 32% excluding political, significantly exceeding our expectations. CTV reached 48% of our total contribution ex-TAC for Q4.\"</li>\n<li>Day reported, \"Adjusted EBITDA grew 9% to $84 million, resulting in a 43% margin. For the full year, contribution ex-TAC totaled $670 million, a year-over-year increase of 10% or 14%, excluding the impact of political.\"</li>\n<li>Day announced a new two-year share repurchase program of up to $200 million, with the company planning \"to be more aggressive with share repurchases given our future expected significant and consistent free cash flow generation.\"</li>\n</ul>\n<h3>Outlook</h3>\n<ul>\n<li>Day guided that for Q1 2026, \"we expect contribution ex-TAC to be in the range of $157 million to $161 million, which represents growth of 8% to 10%. Contribution ex-TAC attributable to CTV to be in the range of $81 million to $83 million, which represents growth of 28% to 31%, surpassing 50% of total contribution ex-TAC for the first time. DV+ contribution ex-TAC to be in the range of $76 million to $78 million, which represents a decline of 6% to 8%.\"</li>\n<li>For the full year 2026, Day stated, \"we anticipate total contribution ex-TAC growth to be at least 11%, adjusted EBITDA percentage growth in the mid-teens, adjusted EBITDA margin greater than 35% free cash flow growth greater than 30% and CapEx of approximately $60 million, a reduction from prior year.\"</li>\n<li>Estimates do not include potential market share gains from Google AdTech remedies.</li>\n</ul>\n<h3>Financial Results</h3>\n<ul>\n<li>Total revenue for Q4 was $205 million, up 6% from Q4 2024. Contribution ex-TAC was $195 million, up 8%, within the guidance range and up 16%, excluding political. CTV contribution ex-TAC was $94 million, up 20% year-over-year or 32% excluding political, significantly exceeding the top end of guidance. DV+ contribution ex-TAC was $101 million, a decrease of 1% or an increase of 4%, excluding political.</li>\n<li>Operating expenses totaled $153 million, a slight decrease from $154 million a year ago. Net income was $123 million, driven by a $90 million one-time tax benefit. Cash balance at quarter-end was $553 million. Debt interest expense was $4 million; net leverage was 0.</li>\n<li>The company repurchased or withheld over 5.2 million shares for approximately $79 million during 2025.</li>\n</ul>\n<h3>Q&amp;A</h3>\n<ul>\n<li>Laura Martin, Needham: Asked about the sustainability and drivers of CTV growth. Barrett said, \"You don't grow at 32% and not have everything firing at all cylinders...the appeal of CTV, the pricing, the performance metrics of it, it's really just increasing in velocity of appeal.\"</li>\n<li>Martin inquired about risk reduction due to deep infrastructure. Barrett replied, \"We are highly differentiated...we have a leading programmatic ad server that's coupled with the leading SSP platform. We're building more and more tools.\"</li>\n<li>Daniel Kurnos, Benchmark: Probed the mix shift to CTV and organic growth. Day explained, \"If you just look at the expectations versus consensus for like Q1...you've got DV+ $8 million or $9 million lower and CTV higher by that same amount.\"</li>\n<li>Kurnos asked about margin outlook. Day responded, \"With this opportunity in CTV, it's sort of a little bit of a onetime shot on the headcount and continuing to make the improvements on our tech stack infrastructure...to really set us up for more rapidly expanding margin in future years.\"</li>\n<li>Shyam Patil, Susquehanna: Asked about sustainable CTV and DV+ growth rates. Barrett indicated high teens to 20s growth as sustainable for CTV due to secular shifts; DV+ seen as more volatile but with opportunities in mobile app and emerging categories. On OpenPath, Barrett stated, \"OpenPath has played out exactly as we thought it would. It's a modest impact in terms of the DV+ performance has no impact on the CTV performance.\"</li>\n<li>Jason Kreyer, Craig-Hallum: Asked about AI agent adoption. Barrett replied, \"Interest is very high. Reality, very little and budgets are being allocated to it...we are ready to catch the dollars when they come scaled, but that is not going to happen any coming quarter.\"</li>\n<li>Shweta Khajuria, Wolfe: Asked for clarity on AdCP and AdTech case. Barrett said, \"Anyone can build an agent, the question is what data is that agent working on...as long as the playing field was more level that we would be a huge beneficiary of that, and we still believe that to this day.\"</li>\n</ul>\n<h3>Sentiment Analysis</h3>\n<ul>\n<li>Analysts expressed a positive to slightly positive tone, focusing on the durability and breadth of CTV growth and the company’s infrastructure moat. Questions were constructive and future-oriented.</li>\n<li>Management maintained a confident and slightly more assertive tone, especially on CTV, AI integration, and the company’s strategic positioning. Barrett stated, \"We believe Magnite is foundational to how the next era of advertising will transact, and we have never been more confident in our strategic position.\"</li>\n<li>Compared to the previous quarter, management’s confidence increased, especially regarding CTV’s dominance and AI’s role. Analysts continued to focus on CTV momentum and competitive positioning, with slightly more emphasis on AI and structural risks.</li>\n</ul>\n<h3>Quarter-over-Quarter Comparison</h3>\n<ul>\n<li>Guidance for CTV growth was raised, with Q1 2026 CTV contribution ex-TAC expected to surpass 50% of the total for the first time, compared to 45% CTV mix in Q3 2025.</li>\n<li>Management commentary shifted from emphasizing agency marketplace traction and AI technology foundations in Q3 to stressing CTV’s majority status and the commercial impact of AI integrations in Q4.</li>\n<li>Q4 saw a more aggressive capital return policy with a new $200 million share repurchase plan, compared to $88 million remaining in the prior authorization in Q3.</li>\n<li>Analysts in both quarters emphasized competitive differentiation and the impact of industry-wide shifts, but Q4 included more questions on risk, take rates, and AI agent adoption.</li>\n<li>Management’s tone was notably more confident in Q4, citing foundational infrastructure in streaming and better market share in CTV.</li>\n</ul>\n<h3>Risks and Concerns</h3>\n<ul>\n<li>Management highlighted continued pressure in DV+ from budget reallocations to CTV. \"DV+ grew 4% ex-political in Q4, modestly below expectations, and that pressure has increased in Q1.\"</li>\n<li>Weakness identified in technology and food and beverage verticals within DV+.</li>\n<li>Ongoing uncertainty around remedies from the Google AdTech trial, with no market share gains included in guidance. \"The expectation is it's any week now, but that could be delayed a little bit longer as it relates to predicted outcome.\"</li>\n<li>AI agent adoption remains early, with interest high but minimal immediate budget impact. Barrett said, \"Interest is very high. Reality, very little and budgets are being allocated to it.\"</li>\n</ul>\n<h3>Final Takeaway</h3>\n<p>Magnite’s management underscored the company’s transformation as CTV becomes the core of its business, supported by stronger publisher relationships, differentiated infrastructure, and expanding AI capabilities. The company forecasts robust CTV and total contribution ex-TAC growth for 2026, while planning substantial capital returns through share repurchases. Leadership signaled heightened confidence in navigating secular trends and competitive shifts, positioning Magnite as a foundational player in the evolving digital advertising landscape.</p>\n<p><a href=\"https://seekingalpha.com/symbol/mgni/earnings/transcripts\">Read the full Earnings Call Transcript</a></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557799-magnite-signals-ctv-surpasses-50-percent-of-business-as-2026-growth-targets-outlined",
            "pub_date": "2026-02-26 21:30:45",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557393",
            "title": "Earnings Snapshot: Novavax beats Q4 revenue estimates; introduces FY26 outlook",
            "description": "<html><body><p data-eci=\"true\"><span><span><a aria-label=\"Expand image into lightbox view\" href=\"https://static.seekingalpha.com/uploads/2026/2/26/saupload_Screenshot_2026-02-26_185649.png\" rel=\"lightbox\" role=\"button\" target=\"_blank\"><img fetchpriority=\"high\" height=\"423\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\" src=\"https://static.seekingalpha.com/uploads/2026/2/26/saupload_Screenshot_2026-02-26_185649.png?io=w640\" srcset=\"\" width=\"100%\"/></a></span></span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/uploads/2026/2/26/saupload_Screenshot_2026-02-26_185649.png",
            "link": "https://seekingalpha.com/news/4557393-earnings-snapshot-novavax-beats-q4-revenue-eaimates-introduces-fy26-outlook",
            "pub_date": "2026-02-26 21:30:45",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557789",
            "title": "Rithm Property Trust sets $10M stock buyback plan",
            "description": "<html><body><ul>\n<li>Rithm Property Trust (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/RPT\" title=\"Rithm Property Trust Inc.\">RPT</a></span>) board of directors has authorized the repurchase of up to $10M of the company’s common stock through March 1, 2027.</li>\n<li>The new repurchase program replaces any prior share repurchase authorization.</li>\n<li>Source: <a href=\"https://seekingalpha.com/pr/20415370-rithm-property-trust-announces-10-million-common-stock-repurchase-program\">Press Release</a>\n</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557789-rithm-property-trust-sets-10m-stock-buyback-plan",
            "pub_date": "2026-02-26 21:25:46",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557790",
            "title": "Oddity Tech falls again after bull ratings are pulled on Wall Street",
            "description": "<html><body><p data-eci=\"true\">Oddity Tech (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ODD\" title=\"Oddity Tech Ltd.\">ODD</a></span>) went into freefall on Wednesday after the company disclosed that it experienced significant abnormal increases in its new user acquisition cost. The company said the unprecedented dislocation was with the large advertising partner Meta Platforms (<a href=\"https://seekingalpha.com/symbol/META\" title=\"Meta Platforms, Inc.\">META</a>), which it believes is due to recent changes in its algorithm.</p>\n<p>On Wall Street, the stock saw a two-notch downgrade at Bank of America to Underperform and was cut at JPMorgan to Neutral and at Barclays to Equal Weight. </p>\n<p>Bank of America analyst Anna Lizzul summed up the negative vibe by saying the firm sees a low likelihood of recovery for Oddity Tech (<a href=\"https://seekingalpha.com/symbol/ODD\" title=\"Oddity Tech Ltd.\">ODD</a>) until at least 2027, given the widespread impact of the user acquisition cost issue. \"We see challenges ahead as ODD experiences disruptions to acquiring new users to its core brands while continuing to spend on marketing, attempting to maintain growth and launch new brands,\" warned Lizzul. \"In addition, we see a more competitive landscape in beauty, with ODD at risk of losing market share due to a lack of retail presence during a time when new user acquisition online is facing disruptions,\" she added.</p>\n<p>Shares of Oddity Tech (<a href=\"https://seekingalpha.com/symbol/ODD\" title=\"Oddity Tech Ltd.\">ODD</a>) were down another 6.3% in premarket trading on Thursday after tumbling more than 49% on Wednesday.</p>\n<p> </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557790-oddity-tech-falls-again-after-bull-ratings-are-pulled-on-wall-street",
            "pub_date": "2026-02-26 21:25:46",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557784",
            "title": "CCL Industries Non-GAAP EPS of C$1.03, revenue of C$1.88B",
            "description": "<html><body><ul>\n<li>CCL Industries <a href=\"https://seekingalpha.com/pr/20414454-ccl-industries-announces-2025-fourth-quarter-and-record-annual-results\">press release</a>  (CCDBF): Q4  Non-GAAP EPS of C$1.03.</li>\n<li>Revenue of C$1.88B (+3.9% Y/Y).</li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557784-ccl-industries-non-gaap-eps-of-c103-revenue-of-c188b",
            "pub_date": "2026-02-26 21:10:47",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557658",
            "title": "AI setting stage for Snowflake's growth in fiscal '27, say analysts",
            "description": "<html><body><p data-eci=\"true\">Shares of Snowflake (<span class=\"ticker-hover-wrapper\"><span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/SNOW\" title=\"Snowflake Inc.\">SNOW</a></span></span>) were largely flat premarket on Thursday after fiscal fourth quarter results beat estimates, while analysts noted that AI is setting the stage for durable growth in fiscal 2027 for the company.</p>\n<p>Evercore kept its Outperform rating on Snowflake but lowered the price target to $225 from $300.</p>\n<p>\"While investors may have been looking for a slightly bigger F4Q bear, we believe that preliminaryFY27 growth guidance of 27%, with only 1pt of contribution from Observe, speaks to SNOW’s strong position entering the year,\" said analysts led by Kirk Materne.</p>\n<p>Last month, Snowflake said it was <a href=\"https://seekingalpha.com/news/4537748-snowflake-to-acquire-ai-powered-observability-platform-provider-observe\" target=\"_blank\" title=\"acquiring\">acquiring</a> observability platform provider Observe.</p>\n<p>The analysts noted that their channel and survey work continues to indicate that Snowflake is benefiting from secular tailwinds that are powering data modernization vendors, and the company’s AI products are seeing solid traction from a proof of concept, or POC, perspective.</p>\n<p>\"SNOW delivered solid F4Q results highlighted by product revenue of $1,227mn (+30%), above mgmt. guidance of $1,195-2,000mn (+27%) and Street ests. of $1,201mn (+27%). Mgmt. flagged that the beat was driven by stable growth in the core business and a step-up in growth contribution from AI workloads,\" said Materne and his team.</p>\n<p>The analysts see fiscal first quarter/ fiscal 2027 product revenue guidance of $1.262B to $1.267B (+27%)/ $5.660B (+27%) as solid. The analysts added that the guidance does not currently include much upside from AI products, and the Observe acquisition is expected to contribute about 1 point of growth to product revenue in fiscal 2027.</p>\n<p>\"Given SNOW’s history of beating by ~3pts, the guide essentially infers acceleration to ~30%,\" said Materne and his team.</p>\n<p>Morgan Stanley maintained its Overweight rating but reduced the price target on the stock to $245 from $270, noting that fourth quarter results showed unlocks from AI have set the stage for durable growth in fiscal 2027.</p>\n<p>\"Product rev growth improved to 30% in 4Q with 1Q27/FY27 guide of +27% coming ahead of expectations. With full year of Snowflake Intelligence, clear momentum with Cortex Code and a stable core, we see a path to 30% growth in FY27, which we think ultimately will get rewarded,\" said analysts led by Sanjit Singh.</p>\n<p>Wells Fargo kept its Overweight rating and cut the price target to $210 from $290, noting that AI can drive upside to fiscal 2027 guidance.</p>\n<p>\"SNOW has one of the best opportunities to capture AI usage in SW [software]. Cortex Code is an unlock for both migrations and non-technical users, and this larger TAM can drive more query volume. Core biz is strong and additional AI upside is worth waiting for,\" said analyst Ryan MacWilliams and his team.</p>\n<p>The analysts noted that the fourth quarter came in slightly below what investors hoped, but the fiscal 2027 and first quarter of fiscal 2027 guidance showed confidence in core business strength.</p>\n<p>In addition, MacWilliams and his team said that the fiscal 2027 outlook presents a path to about 30% exit revenue growth, and they think growing adoption of Cortex AI could be a key lever.</p>\n<p>\"We believe investors may not be appreciating the benefits Cortex Code brings to the broader Cortex AI suite, and how AI can drive data gravity and AI use cases towards SNOW,\" the analysts added.</p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557658-ai-setting-stage-for-snowflakes-growth-in-fiscal-27-say-analysts",
            "pub_date": "2026-02-26 21:10:47",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557733",
            "title": "World Economic Forum CEO steps down after Epstein ties examined",
            "description": "<html><body><p data-eci=\"true\">Børge Brende said on Thursday he decided to step down as president and CEO of the World Economic Forum, a few weeks after the forum opened an independent investigation into his relationship with convicted sex offender Jeffrey Epstein.</p>\n<p>A statement from WEF Co-Chairs André Hoffmann and Larry Fink said the independent review led by an outside counsel concluded and found \"no additional concerns beyond what has been previously disclosed.\"</p>\n<p>Over three million pages of documents relating to Epstein have been released by the U.S. Justice Department, showing the extent of the disgraced financier's connections with the world's rich and powerful. Those documents indicated that Brende had three business dinners with Epstein and communicated with him through text messages and email, Reuters reported.</p>\n<p>The Norwegian had previously said he was unaware of Epstein's past and criminal activities before he met him in 2018 and that he regretted not having vetted him more thoroughly, the Reuters report<a href=\"https://www.reuters.com/world/ceo-world-economic-forum-quits-after-epstein-ties-scrutinised-2026-02-26/\" rel=\"nofollow\" target=\"_blank\" title=\" said \"> said</a>. Epstein was convicted of sex offenses in 2008.</p>\n<p>Brende's departure ends his eight-and-a-half-year tenure at the forum, which has been \"<span>profoundly rewarding,\" he said in a statement released by the World Economic Forum. \"I am grateful for the incredible collaboration with my colleagues, partners, and constituents, and I believe now is the right moment for the Forum to continue its important work without distractions.\"</span></p>\n<p><span>Alois Zwinggi will serve as interim president and CEO  of the WEF, Hoffman and Fink said in their statement. The organization's board of trustees will oversee the leadership plan, including the search for a permanent successor, they <a href=\"https://www.weforum.org/press/2026/02/press-statement-from-co-chairs-andre-hoffmann-and-larry-fink-on-behalf-of-the-board-of-trustees/\" rel=\"nofollow\" target=\"_blank\" title=\"added.\">added.</a></span></p>\n<p><span><strong>Dear readers:</strong> We recognize that politics often intersects with the financial news of the day, so we invite you to <a href=\"https://seekingalpha.com/article/4867594-politics-and-the-markets-022626\" target=\"_blank\" title=\"click here\">click here</a> to join the separate political discussion.</span></p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557733-world-economic-forum-ceo-steps-down-after-epstein-ties-examined",
            "pub_date": "2026-02-26 21:05:35",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557776",
            "title": "NovavaxEPS of $0.11, revenue of $147.14M beats by $57.28M",
            "description": "<html><body><ul>\n<li>Novavax <a href=\"https://seekingalpha.com/pr/20415322-novavax-reports-fourth-quarter-and-full-year-2025-financial-results-and-operational\">press release</a> (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NVAX\" title=\"Novavax, Inc.\">NVAX</a></span>): Q4 EPS of $0.11 may not be comparable to consensus of -$0.58.</li>\n<li>Revenue of $147.14M (+66.6% Y/Y) <span> beats by $57.28M</span>.</li>\n<li>FY26 revenue consensus of $460.68M</li>\n<li><div class=\"table-responsive\">\n<span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><div class=\"table-responsive\">\n<span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table data-should-enlarge=\"true\"><tbody>\n<tr>\n<td colspan=\"1\" rowspan=\"1\"><p data-eci=\"true\">$ in millions</p></td>\n<td colspan=\"1\" rowspan=\"1\">\n<p>Full Year 2026</p>\n<p>(as of February 26, 2026)</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\"><p>Combined R&amp;D and SG&amp;A Expenses</p></td>\n<td colspan=\"1\" rowspan=\"1\"><p>$380 - $420</p></td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\"><p>Less: R&amp;D Reimbursements</p></td>\n<td colspan=\"1\" rowspan=\"1\"><p>($70 - $80)</p></td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\"><p>Non-GAAP Combined R&amp;D and SG&amp;A Expenses</p></td>\n<td colspan=\"1\" rowspan=\"1\"><p>$310 - $340</p></td>\n</tr>\n</tbody></table>\n<span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button class=\"sa-table-enlarge-button\" type=\"button\">Click to enlarge</button>\n</div>\n<span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button class=\"sa-table-enlarge-button\" type=\"button\">Click to enlarge</button>\n</div></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557776-novavaxeps-of-0_11-revenue-of-147_14m-beats-by-57_28m",
            "pub_date": "2026-02-26 21:05:35",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557737",
            "title": "Nvidia's strong execution, guidance mean growth concerns are 'overblown,' analysts say",
            "description": "<html><body><p data-eci=\"true\">How's that for an encore?</p>\n<p>Nvidia (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a></span>) not only <a href=\"https://seekingalpha.com/news/4556780-nvidia-pops-q4-results-guidance-blow-past-wall-streets-forecast\" target=\"_blank\" title=\"topped\">topped</a> fourth-quarter estimates by a wide margin, but its guidance surprised even the most bullish analysts. The Jensen Huang-led company expects sales for the next quarter to be $78B, plus or minus 2%, well above Wall Street's forecast of $72.8B. </p>\n<p>Nonetheless, shares only rose roughly 1% in premarket trading on Thursday. Wall Street analysts believe there's more where that came from: it will just take more time.</p>\n<p>“NVDA is clearly firing on all cylinders, both internally and across its vast supply chain, as it continues to ramp Blackwell production (GB200+GB300) while simultaneously preparing for the imminent ramp of its Vera Rubin platform (on track for C2H26),” J.P. Morgan analyst Harlan Sur wrote in a note to clients. “Even so, the stock response suggests investors were left wanting more, which we think is tied to continued uncertainty around the growth trajectory for NVDA’s Data Center business in CY27, given massively expanded capex budgets for key customers (aggregate capex for the top 5 US hyperscalers is now forecast to grow ~70% Y/Y to $650B+ in CY26) alongside significantly compressed FCF profiles. Taking a step back though, with the stock trading at ~19x pre-call Street CY27E EPS, NVDA to us looks like a coiled spring that has been tightened even further post this set of results.”</p>\n<p>Sur has an Overweight rating on Nvidia and upped his price target to $265 from $250 after the results. </p>\n<p>Morgan Stanley analyst Joseph Moore had a similar take, in that he was “surprised” by the muted reaction to the stock, given that the results were the “largest, cleanest beat and raise in the history of the semis industry.” Moore has an Overweight rating on Nvidia and raised his price target to $260 from $250.</p>\n<p>“We would continue to argue that the long term also looks pretty good, while conceding that the growth next year will still be somewhat capital markets driven,” Moore wrote in a note to clients. He added that the questions about the hyperscalers free cash flow generation may be part of the reason for the muted reaction, but that could be alleviated by increased token monetization. </p>\n<p>“LLM frontier model developers are calling for hundreds of gigawatts of compute capacity by 2029,” Moore continued. “Paying for all of that will be challenging, but we continue to point out that the compute demand is needed to manage inference/token growth, not aspirational training clusters, for the most part. NVIDIA believes that the cash issues will be resolved by the cash flows of AI factories being much better than expected - but that in turn requires token monetization that is also better than expected. While we would stop short of believing the most bullish 5-year views, we do continue to think that there is no visibility to any pause in the current levels of strong demand.”</p>\n<p>RBC Capital Markets analyst Srini Pajjuri said the muted reaction suggests a concern from the market about “peaking revenue momentum,” but it's unlikely to slow down massively.</p>\n<p>“While y/y growth should eventually moderate from current (70%+) levels, we expect strong double-digit growth to sustain well into CY27,” Pajjuri wrote. “Our base case is for a gradual slowdown in hyperscaler capex, which we believe valuation is already discounting to a large extent.” He reiterated his Outperform rating on Nvidia and raised his price target to $250 from $240.</p>\n<p>Others, including Seeking Alpha analyst <a href=\"https://seekingalpha.com/author/semiconductor-analyst\" rel=\"noopener\" target=\"_blank\" title=\"Semiconductor Analyst\">Semiconductor Analyst</a>, had similar takes. “The level of capex growth left a strong chance of another round of positive surprises in NVDA’s earnings,” Seeking Alpha analyst <a href=\"https://seekingalpha.com/author/semiconductor-analyst\" target=\"_blank\" title=\"Semiconductor Analyst\">Semiconductor Analyst</a> said in an email. “I think this quarter showed exactly that. Big techs are now slightly above 50% of the data center revenue mix (taking a bit of share), which also suggests other revenue sources remain healthy. Agentic AI adoption is accelerating fast, and it is the most tangible driver of hardware demand in this stage of the AI rollout.” </p>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557737-nvidias-strong-execution-guidance-means-growth-concerns-are-overblown-analysts-say",
            "pub_date": "2026-02-26 21:00:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "4557769",
            "title": "Arhaus declares $0.35 special dividend",
            "description": "<html><body><ul>\n<li>Arhaus (ARHS) declares <a href=\"https://seekingalpha.com/pr/20414824-arhaus-reports-fourth-quarter-and-full-year-2025-financial-results-announces-special-cash\" target=\"_blank\">$0.35/share special dividend</a>.</li>\n<li>Payable March 31; for shareholders of record March 18; ex-div March 18.</li>\n<li><a href=\"https://seekingalpha.com/symbol/ARHS/dividends?source=news_bullet\">See ARHS Dividend Scorecard, Yield Chart, &amp; Dividend Growth.</a></li>\n</ul>\n<div class=\"signup_widget_placeholder\"></div>\n</body></html>",
            "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
            "link": "https://seekingalpha.com/news/4557769-arhaus-declares-035-special-dividend",
            "pub_date": "2026-02-26 21:00:49",
            "source": "seekalpha",
            "kind": 1,
            "language": "en"
        }
    ]
}