{
    "data": [
        {
            "title": "Burger King's new AI agent will listen to orders and 'coach' workers on being 'hospitable'",
            "description": "<div>Burger King has introduced a new AI chatbot into its daily fast food restaurant operations. “Patty,” the AI voice powered by an OpenAI base model, will live inside employees’ headsets in an effort to collect data on \"friendliness\" and simplify workflow. The bot is part of a new web and app platform, BK Assistant, that is designed to provide training and operational support. It’s expected to do everything from alerting managers about items that are no longer available to helping workers remember the ingredients in limited time offers. It will also analyze the conversation between an employee and customer at the drive-thru window. Burger King told NBC News Thursday that BK Assistant will not be listening to all of employees’ conversations, and that the goal of the system isn’t about “scoring” people or encouraging workers to stick to scripts. The assistant will, however, begin listening from the moment a customer pulls up to place their order, until the point when their car drives away. The system will gather data points from employees’ interactions with customers, for example with the use of keywords like “welcome,” “please” and “thank you,” which the company said it explored as a signal to help managers understand service patterns. “One of the ways that we started this was, you know, picking certain keywords… but it’s one mechanism that was used to iterate on how to define friendliness,” said Thibault Roux, Burger King’s chief digital officer, during an interview with NBC News.  “It’s really a coaching tool, right? To help you as an employee, become more hospitable, and we’re going to help you also with certain operation flaws that may occur that can be a little bit complex,” he added.  The voice-enabled headset is currently being piloted in 500 restaurants. Both the web and app versions of BK Assistant are expected to be available to Burger King restaurants in the U.S. by the end of 2026. </div>",
            "link": "https://www.nbcnews.com/business/consumer/burger-king-ai-chatbot-please-thank-you-rcna260848",
            "pub_date": "2026-02-27 11:05:56",
            "source": "nbcnews",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Grandson of Reese's Peanut Butter Cups inventor is in pieces over missing milk chocolate",
            "description": "<div>For the grandson of the inventor of the Reese’s Peanut Butter Cups, all it took was one bite of a Valentine’s Day Reese’s Mini Heart to leave him, well, heartbroken. “It didn’t taste like milk chocolate,” Brad Reese told NBC News. “It tasted cheap.” Reese said he looked at the front of the package and saw the words “peanut butter” but not the words “milk chocolate.” And when he flipped the bag over and read the list of ingredients, he was, as he put it, “horrified.” Hershey’s, which makes the beloved butter cups and seasonal spinoffs like mini-hearts, had replaced the milk chocolate with a chocolate-flavored coating “that definitely was not chocolate,” according to Reese. Make Reese's Great Again “For most of my life I ate at least one Reese’s Butter Cup per day, and sometimes something seasonal like a Reese’s heart or a Reese’s Christmas tree,” said Reese, 70. “But this was inedible. I threw it in the garbage.” Then Reese, who is so enthralled with his grandfather’s sweet creation that he often ventures out clad in orange and brown Reese’s jerseys and who for 25 years has used his personal website to promote peanut butter cups and his family history, took a closer look at the ingredients on other Hershey’s candies that descend from his grandfather’s inventions. “You know the Reese’s Mini Eggs they sell at Easter? No milk chocolate in that,” Reese said. Same goes for Reese’s Pieces, which were introduced in 1978 but really took off after they were featured in the 1982 movie “E.T. the Extra-Terrestial.” So Reese posted a link to a letter he wrote to Todd Scott, who does the corporate branding for Hershey’s, on his LinkedIn page. And he revamped his website, which includes a photograph of a brown baseball cap emblazoned with the words “Make Reese’s Great Again.” Reese invoked the name of his grandfather H.B. Reese, who invented the iconic peanut butter cup in 1928 and started a candy company that produced them until 1963, when his sons sold the firm to the Hershey Co. “My grandfather,” Reese wrote, “built REESE’S on a simple, enduring architecture: Milk Chocolate + Peanut Butter.” “But today, REESE’S identity is being rewritten, not by storytellers, but by formulation decisions that replace Milk Chocolate with compound coatings and Peanut Butter with peanut-butter style cremes across multiple REESE’S products.” The letter went viral.  “Now everybody wants to talk with me except Hershey,” Reese said. “Nobody from the company has called me.” 'Product recipe adjustments' Hershey spokesperson Allison Mason insisted that the Reese’s Peanut Butter Cups “are made the same way they have always been.\" But she conceded that, as the company has expanded its “Reese’s product line,” it has tinkered with the original recipe. “We make product recipe adjustments that allow us to make new shapes, sizes and innovations that Reese’s fans have come to love and ask for, while always protecting the essence of what makes Reese’s unique and special: the perfect combination of chocolate and peanut butter,” Mason said via email.  Mason also confirmed that the Valentine’s Day Reese’s Mini Hearts don’t have the milk chocolate designation on the front of the packaging because the candies actually have a chocolate-flavored coating. And because the term is regulated by the Food and Drug Administration, it can’t legally be referred to as milk chocolate. Reese said he’s not sure chocolate-flavored coatings are being limited to butter cup spinoffs.  “Now I hear that the butter cups being produced at their factory in Mexico for the European market are not being made with chocolate,” he said. “The people there don’t have the taste history we have here, they don’t know how delicious Reese’s Peanut Butter Cups are. How can I promote a product that will be sold in some place like Poland that isn’t a real Reese’s Peanut Butter Cup?” “That is not accurate,” Mason, the Hershey spokesperson, said in response to Reese's assertions that the European market is getting a faux butter cup. \"Mr. Reese is not affiliated with the Hershey Company. Our iconic Reese’s Peanut Butter Cups are made with the same recipe.” One of the reasons candy companies began looking for alternatives to chocolate was that the price of the main ingredient — cocoa — climbed by 136% from July 2022 to February 2024, according to U.N. Trade and Development. The chief culprit? Climate change that has caused extreme heat and droughts resulting in poor harvests in the so-called Cocoa Belt in west Africa, where 70% of the world’s cocoa supply is grown, the agency reported. But since then, Reuters recently reported, cocoa prices have plunged by 70% because of falling demand and because candy makers have developed alternatives to chocolate. Legacy, purpose and peanut butter cups “I understand why Hershey’s might be looking for alternatives to chocolate, but it doesn’t give them a license to cheapen the product,” Reese said. “They should be creating different candies, not undermining consumers’ trust in an iconic product.” Reese, who lives in West Palm Beach, Florida, said he was 8 months old when his grandfather died. He said he had plenty of girlfriends but never married or had children. He said that after having served in the Army back in the 1970s, he tried his hand at various businesses with mixed success. “I excelled at failure,” he said with a laugh. But Reese said he has always been fascinated by his family history, and, after he was diagnosed with cancer in 2015, he found his calling, along with a feeling of purpose, by singing the praises of the Reese’s Peanut Butter Cups to anyone who would listen.  “I really care about this, so that’s why I find it so painful that my grandfather’s legacy is being diminished,” he said.  Will he continue his habit of eating one peanut butter cup per day?  “For now, I’m taking a break,” Reese said.</div>",
            "link": "https://www.nbcnews.com/news/us-news/grandson-reeses-peanut-butter-cups-inventor-pieces-missing-milk-chocol-rcna259732",
            "pub_date": "2026-02-24 02:41:34",
            "source": "nbcnews",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walmart’s sales are increasingly driven by higher-income shoppers",
            "description": "<div>As Americans struggle with the cost of living, many are turning to Walmart to save. The discount retailer said it’s especially seeing growth among higher-income shoppers. “The majority of our share gains came from households making more than $100,000,” John Furner, who took over as CEO at the start of February, said Thursday morning on a call with Wall Street analysts. “For households earning below $50,000, we continue to see that wallets are stretched. And in some cases, people are managing spending paycheck to paycheck.” It aligns with a pattern experts are calling a K-shaped economy. The wealthy, benefitting from stock market gains and higher wage growth, are driving an outsize share of consumer spending. Meanwhile, many on the lower end of the “K” are finding their paychecks can’t keep up with rising costs of food, housing, utilities and child care, even with wage growth. Labor market data released earlier this month showed the U.S. added almost no jobs in 2025, and while hiring appeared solid in January, the jury’s still out on whether more robust job growth will return. Prices in January rose 2.4% compared with a year earlier, higher than the Federal Reserve’s 2% target but at a slower rate than in the past few months. Walmart, which has a reputation for discounts, is traditionally seen as a bellwether for the U.S. economy and consumer confidence. On Thursday, executives pointed to a so-called hiring recession, lower consumer sentiment and student loan delinquencies as reasons to be cautious about the future. Other retailers that also traditionally cater to lower-income Americans are seeing more growth among higher-income shoppers and are increasingly reliant on them. Dollar Tree said at the end of last year that around 60% of its new shoppers came from households earning more than $100,000. Discount grocer Aldi has been drawing in higher-income shoppers seeking value — and plans to open 180 new stores this year. Consumers have also had to navigate price hikes on many goods as a result of President Donald Trump’s wide-ranging tariff hikes on major U.S. trading partners. An analysis last week from the Federal Reserve Bank of New York found consumers and businesses paid nearly 90% of the tariff costs. But Walmart’s chief financial officer, John David Rainey, said Thursday in an interview with Bloomberg that tariff-driven inflation has reached or is reaching its peak. That’s a big contrast to comments last month from Amazon CEO Andy Jassy, who said in an interview with CNBC that tariffs are starting to “creep into some of the prices.” Walmart announced Thursday that same-store sales for its Walmart U.S. business rose 4.6% in the quarter that ended Jan. 31, exceeding analysts’ expectations. The company’s stock rose Thursday, even though its profit forecast for the year came in under Wall Street’s estimates. Walmart earlier this month hit a major milestone: It became the first traditional brick-and-mortar retailer to reach a $1 trillion market valuation, joining a handful of other U.S. companies, mostly in tech. But on Thursday, it lost its status as the biggest global company by revenue to rival Amazon. Fortune also said Thursday that Amazon would overtake Walmart as the top company on the Fortune 500 list. Walmart recently has made moves to position itself as a tech-forward competitor to Amazon, switching from trading on the New York Stock Exchange to the tech-heavy Nasdaq in December and investing more in artificial intelligence. The company noted that inventory and labor are its largest costs and that technology including A.I. would help it grow at a lower cost. The company last year said it planned to cut 1,500 corporate jobs in a restructuring. “The way we’re using technology and A.I. is helping us create great customer solutions, reduce friction, simplify decision-making and pinpoint where our inventory is, all while maintaining the trust we’ve earned from our customers and members,” said Furner.</div>",
            "link": "https://www.nbcnews.com/business/consumer/walmart-earnings-sales-higher-income-shoppers-rcna259629",
            "pub_date": "2026-02-19 23:36:47",
            "source": "nbcnews",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "No bones about it: Judge allows Buffalo Wild Wings to keep 'boneless' chicken on menu",
            "description": "<div>Are boneless wings any different from chicken nuggets? A federal judge weighed in Tuesday in a lawsuit against Buffalo Wild Wings. In a 10-page ruling, U.S. District Judge John Tharp in Illinois said the sports bar franchise can continue to call its popular menu item “boneless wings,” even though they are “essentially chicken nuggets.” A wing lover by the name of Aimen Halim filed a lawsuit in March 2023 claiming violations of the Illinois Consumer Fraud Act over Buffalo Wild Wings’ calling them “boneless wings” instead of “chicken nuggets.” Tharp decided Tuesday there wasn’t enough meat on the bones of his argument. “Boneless wings are not a niche product for which a consumer would need to do extensive research to figure out the truth,” Tharp wrote. “Instead, 'boneless wings' is a common term that has existed for over two decades.” “Halim did not 'drum' up enough factual allegations to state a claim,\" Tharp added. \"Though he has standing to bring the claim because he plausibly alleged economic injury, he does not plausibly allege that reasonable consumers are fooled by Buffalo Wild Wings' use of the term 'boneless wings.'\" Still, Tharp is allowing Halim to amend his initial complaint by March 20 in case he can \"provide additional facts about his experience that would demonstrate that BWW is committing a deceptive act.\"  Halim said in his lawsuit that he went to a Buffalo Wild Wings restaurant in January 2023 and expected to receive \"wings that were deboned.\" He argued that Buffalo Wild Wings' product should be called something different, like “chicken poppers.” Buffalo Wild Wings didn’t immediately respond to a request for comment. In his ruling, Tharp cited a 2024 Ohio Supreme Court ruling on restaurants and what customers can expect when they place an order. \"As the Ohio Supreme Court recently put it, '[a] diner reading ‘boneless wings’ on a menu would no more believe that the restaurant was warranting the absence of bones in the items than believe that the items were made from chicken wings, just as a person eating ‘chicken fingers’ would know that he had not been served fingers,\" he wrote.</div>",
            "link": "https://www.nbcnews.com/news/us-news/judge-allows-buffalo-wild-wings-keep-boneless-chicken-menu-nuggets-rcna259460",
            "pub_date": "2026-02-18 21:29:00",
            "source": "nbcnews",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Salmon sold at BJ's recalled for potential listeria contamination",
            "description": "<div>One brand of farm-raised Atlantic salmon sold at BJ's Wholesale Club has been recalled due to a potential listeria contamination, according to a release from the Food and Drug Administration.  Wellsley Farms Farm-Raised Atlantic Salmon is sold in 2-lb bags at BJ's and is packaged with the Wellsley Farms logo and text that reads \"Farm-Raised Atlantic Salmon\" on the front. Lot 3896 of the product has been recalled by the company, Slade Gorton & Co., the FDA said.  The specific salmon product was sold at BJ's stores in Delaware, Maryland, New Jersey, New York, North Carolina, Pennsylvania and Virginia from Jan. 31 to Feb. 7, the FDA release said.  According to the FDA, the agency found Listeria monocytogenes in the salmon through a sample the agency randomly collected. The company is investigating how its food was contaminated and is taking steps to prevent it from happening again in the future, the release said.  BJ's is working to notify members who may have purchased the recalled salmon. The UPC code (888670025963) and recalled lot number (3896) are on the back side of the packaging, below the cooking instructions, the FDA release said.  Short-term symptoms of a listeria infection for healthy individuals includes high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, the FDA said. It can also cause miscarriage and stillbirth for pregnant women.  If you have symptoms of a listeria infection, the FDA says you should contact a health care provider. No illnesses related to this recall have been reported, according to the release.  If you think you bought the recalled product, call 1-888-628-0730 for instructions on how to obtain a full refund and what to do with the remaining product, according to the release. </div>",
            "link": "https://www.nbcnews.com/news/us-news/salmon-sold-bjs-recalled-potential-listeria-contamination-rcna259245",
            "pub_date": "2026-02-17 01:46:05",
            "source": "nbcnews",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The coming weeks could see key tests of U.S. consumers' outlook ",
            "description": "<div>For a few weeks, it looked like the U.S. consumer might have gone cold. December retail sales came in flat despite the usual holiday rush as spending across categories like apparel, furniture and restaurants all softened over the month, according to data compiled by the Commerce Department. Then came Winter Storm Fern. The last week of January brought the coldest end to the month since 1995 and the most snowfall in 60 years, according to the retail weather analytics firm Planalytics. Mall traffic plunged. Outlet center visits fell nearly 13% from a year earlier, and apparel retail traffic dropped more than 8%, the firm estimates. So the question now for both Main Street retailers and Wall Street investors is whether the weather temporarily froze spending or exposed a deeper chill in consumer demand. The answer depends on where you look.  First, the good news: Foot traffic data from Placer.ai shows that retail traffic had rebounded from thost late January declines by the first week of February, with indoor malls up more than 7% and open-air shopping centers climbing nearly 8%. In another sign of resilience, the Bank of America Institute's latest “Consumer Checkpoint” report showed that January's “total card spending per household rose 2.6% year-over-year\" — the strongest pace in nearly two years — despite weather‑related disruptions. Internal bank data also showed that the winter storm’s drag on spending was heavily concentrated in the South, lower Midwest and Northeast of the country, according to the report, released Thursday. More than just the weather threatens to chill the consumer outlook this winter, however.  The little 'k' inside the big 'K' Bank of America's report sounded fresh alarms about a trend that has been evolving for several years: high earners driving much of overall consumer spending. “We are concerned that a ‘K’ shape is opening up between higher-income households and middle-income households, alongside the existing gap with lower-income households,” David Michael Tinsley, a senior economist at the institute, wrote in the report. Ted Rossman, a principal analyst at Bankrate, said this spending by higher-income households is masking cutbacks that are happening further down the income ladder. “Many lower- and middle-income households are tapped out by the cumulative effects of inflation and high interest rates,” he wrote in an email to NBC News. Although inflation cooled overall last month, sticky categories like food and shelter continue to pose affordability challenges for many households. Prolonged cold weather also typically translates into higher utility bills. In January, utility prices rose 9.8% from a year earlier, adding to the pressure. Plus, the January jobs report offered its own mixed signals: Hiring came in stronger than expected, but the gains were concentrated in just two industries, elder care and construction. So while the broader economy appears to be stable, there are warning signs under the hood. This uneven foundation is what makes the next few weeks particularly important as a barometer of the broader consumer outlook. Shopping vs. saving First up, Valentine’s Day. The National Retail Federation is projecting record spending Saturday, with total outlays expected to reach $29.1 billion. Presidents’ Day sales and promotions are also underway this holiday weekend, as many retailers slash prices to clear out seasonal stock left over from the holidays and the previous year to make room for new merchandise. Big-ticket items are typically on deep discount this weekend including household appliances, furniture, mattresses and electronics. And finally, tax refunds are beginning to roll out. These are often the largest single cash infusion many households receive all year. But this year, those refunds could be even bigger than usual because of legislation passed by Congress and signed into law by President Donald Trump in 2025. The Bank of America Institute estimates refunds could be 25% higher this year than last. The wild card? What Americans do with that money. \"A portion of these funds will likely be spent quickly, helping ease affordability pressures felt by lower- and middle-income households,\" Bank of America Institute economists wrote in a new report released Friday.  \"However,\" the bank continued, \"not all of the money will flow immediately into spending. A meaningful share of refunds typically goes into savings.\" The bank said it typically sees a \"fairly regular seasonal pattern\" in which savings rise in the spring as bonuses and tax refunds hit bank accounts before tapering off later in the year. \"So bigger refunds this year may bolster savings for some time,\" the economists wrote. It’s also possible that with more money in hand, some people will decide to spend a larger portion of their refunds now. So yes, January brought a shopping freeze, but the coming weeks will reveal whether consumers feel financially secure enough about the future to spend in the present.</div>",
            "link": "https://www.nbcnews.com/business/consumer/tax-refunds-consumer-confidence-rcna259056",
            "pub_date": "2026-02-15 00:50:58",
            "source": "nbcnews",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Saks is closing more stores as its bankruptcy progresses ",
            "description": "<div>The next phase of bankruptcy restructuring is underway for the retail empire behind Saks 5th Avenue, Bergdorf Goodman and Neiman Marcus. Saks Global announced Tuesday that it is closing eight Saks Fifth Avenue stores and one Neiman Marcus location. Saks Fifth Avenue locations in Alabama, Ohio, New Jersey, Louisiana, Pennsylvania, Arizona, Virginia and Oklahoma are slated to close their doors later this Spring, a company spokesperson told NBC News. One Neiman Marcus location in Massachusetts will also close.  Starting this weekend, the company will also close 14 locations of its Fifth Avenue Club personal shopping services, leaving just two in operation.  Saks said it doesn’t plan to make any changes to its Bergdorf Goodman stores.  Saks Global is also shutting down Horchow.com and transitioning Horchow luxury designer home furnishings to NeimanMarcus.com, starting on Feb. 19.  The company called these changes an “initial phase of optimization,” aimed at pivoting the business’ attention onto its luxury products and services, along with its partnerships. Saks Global entered Chapter 11 bankruptcy proceedings on Jan. 14. The retailer struggled to stay afloat after it found itself with more than $2.5 billion of debt following its acquisition of Neiman Marcus in 2024.  More recently, Saks Global missed debt payments, signaling the company might not be able to recover from its heavy debt load. The company recently announced it was winding down most of its off-price empire, Saks OFF 5TH. Twenty-three locations closed on Feb. 2, and the luxury department store giant revealed plans to shutter all but 12 of its off-price locations.  Saks Global also confirmed it would close its five remaining locations of Neiman Marcus’ off-brand entity, Last Call. In total, Saks Global plans to eliminate 57 stores in total.  “By optimizing our operational footprint, we will be better positioned to deliver exceptional products, elevated experiences and highly personalized service across all channels, while simultaneously positioning our company to make investments that enable long-term growth and value creation,” said Geoffroy van Raemdonck, chief executive officer of Saks Global.</div>",
            "link": "https://www.nbcnews.com/business/consumer/saks-fifth-avenue-stores-bankruptcy-rcna258397",
            "pub_date": "2026-02-11 06:48:24",
            "source": "nbcnews",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target will invest more in stores, cut 500  jobs as new CEO takes the reins",
            "description": "<div>Target will restructure parts of its organization and eliminate about 500 roles, company executives wrote Monday in an internal memo, as the retail giant looks to rebuild its customer base and return to growth. The cuts include roughly 400 positions across Target’s supply chain operations and about 100 roles at the store district level. No  store-level jobs will be affected but some regional offices will be closed, a Target spokesperson told NBC News.  The memo provided to NBC News came from chief stores officer Adrienne Costanzo and chief supply chain and logistics officer Gretchen McCarthy. They wrote that Target will be “consolidating the number of store districts to streamline our field structure and better empower our store directors to meet guests’ needs.”  The retail giant said the organizational changes are intended to allow the company to redirect investment into its stores, including additional labor and hours, along with a new guest experience training for employees.  Store workers will not see any changes to their starting wages, which depending on the location, are typically $15 - $24 an hour, according to a spokesperson.  Target, which has about 2,000 U.S. stores, has ceded market share to rivals like Walmart and Amazon in recent years.  Inflation has weighed on shoppers, and customers have voiced frustration over cluttered stores and inconsistent merchandise that strayed from the retailer’s identity as a polished, affordable-chic chain. In recent years, the retailer has also been challenged by customers over its responses to controversial issues, from DEI initiatives to the recent turmoil in Minneapolis.  In an effort to reconnect with customers, the retailer rolled out what it called its \"10-4 program\" in 2025, an internal training that encouraged employees to make eye contact, smile and exhibit welcoming behavior when they were within 10 feet of customers— underscoring the company’s renewed focus on service as a differentiator. Monday's memo said the changes are expected to help employees in stores “work more efficiently and with more focus.”  Target added workers who are impacted have already been notified and will be supported with resources and benefits.  The restructuring marks one of the first major changes from Target's new CEO Michael Fiddelke, who took over the top job at a challenging moment for the retailer.  The company reports fourth quarter and full-year earnings on March 3.</div>",
            "link": "https://www.nbcnews.com/business/consumer/target-invest-stores-cut-jobs-rcna258267",
            "pub_date": "2026-02-10 09:08:11",
            "source": "nbcnews",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How grocery prices have changed since Trump took office",
            "description": "<div>Are President Donald Trump’s policies bringing down grocery bills? Grocery prices have been on the rise for most of the past six years, as supply chain bottlenecks, the war in Ukraine and excessive profit-taking here in America have put a strain on consumers’ wallets.  Trump campaigned heavily on the price of food in 2024, promising that if elected he would lower costs. Has that happened? To find out, NBC News is tracking the average grocery price of eggs, beef, and other common grocery-basket goods. The average price of eggs — a frequent stand-in for inflation during the campaign — have declined from a spring 2025 peak and is now down 30% since Trump took office last year. Average orange juice prices are up 28% and ground beef prices are up 15% from January 2025. Pork bacon and chicken prices are also up. Since 2021, NBC News has monitored the average point-of-sale price for eggs, chicken, bread, ground beef and other common grocery items. The graphic below shows their current average prices, along with how much those prices have changed since Trump took office in 2025. The grocery price data, provided by the global marketing research firm NIQ, is collected from real checkout prices paid nationwide at grocery stores, drugstores, mass merchandisers, selected dollar stores, selected warehouse clubs and military commissaries. The Bureau of Labor Statistics’ monthly consumer price index, which uses human data collectors and includes other food product categories, is another resource for average price data. This article will be updated twice each month.</div>",
            "link": "https://www.nbcnews.com/data-graphics/grocery-price-tracker-inflation-trends-eggs-bread-trump-administration-rcna257424",
            "pub_date": "2026-02-08 20:07:58",
            "source": "nbcnews",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How snack makers are trying to win back fed-up consumers ",
            "description": "<div>One of the biggest snacking days of the year is almost here, and consumers are hungry for cheaper chips.  The good news: Some Super Bowl snacks could cost less this year. PepsiCo announced this week that it is cutting prices up to 15% for several popular snacks including Doritos, Lay’s, Cheetos and Tostitos. The price cut comes after years of rising costs at the supermarket. Grocery prices have climbed 2.4% over the last year and 25.6% over the last five years, according to the Bureau of Labor Statistics.  And salty snack retail prices jumped around 38% from 2020 to mid-2024, according to a report from Jefferies. Those higher prices are weighing on many consumers. A new report from Pew Research Center this week found 66% of Americans are very concerned about the price of food and consumer goods. “They are value-obsessed now, and it’s out of necessity,” said Brian Choi, managing partner and CEO at The Food Institute, an industry data and consulting firm. “You’re seeing consumers shift down to private labels, so not the Doritos,” he said. “They’re looking for the Aldi version, or the Trader Joe’s version because a lot of times, the price of chips are $2, maybe even $3, lower per package.” The discount supermarket chain Aldi has seen explosive growth in recent years. Aldi said 17 million new customers visited its American stores in 2025, and it plans to open more than 180 stores in the U.S. this year alone. This shift to store brands and away from retail brands could pose a challenge to companies like Pepsi, which makes Doritos and Ruffles, and Mondelez, which makes Oreos and Ritz crackers. “The average shopping basket of the consumer in the U.S., whether you’re in the higher or in the lower social economic classes, has not increased for the last two, three years,” said Dirk Van de Put, chairman and CEO of Mondelez, on a call with analysts this week. “Within that basket, they have spent more money on the basics: milk, meat, bread and so on. And as a consequence, snacking is being affected.” Economists say consumers are separating into two tiers — what they’re calling a K-shaped economy. The wealthy, benefitting from stock market gains and higher wage growth, are driving an outsize share of consumer spending.  Meanwhile, many lower- and middle-income Americans feel like their paychecks can’t keep up with rising costs for food, housing, utilities and child care — and are falling behind. “There is clearly a group of consumers, the more wealthy consumers that do spend differently,” said Van de Put. “You can see that things like premium and better-for-you are growing within the snacking markets.” “But the bulk of the consumers, they are really into value-seeking,” he added. PepsiCo’s decision to cut its chip prices could help the company to hold on to loyal customers and potentially even build goodwill with shoppers who are looking for deals. The 15% reduction is for wholesale prices, so individual retailers will ultimately decide whether to pass the full discount on to consumers.  But at least one grocery CEO said his stores will pass PepsiCo’s wholesale price cuts on to consumers. “I haven’t seen this happen in years, where they’re lowering the prices to us. Bravo to Pepsi,” said Stew Leonard, chief executive officer of Stew Leonard’s, a regional grocery chain in New York, New Jersey and Connecticut, in an interview with NBC News.  “I think it’s a great signal for the whole economy that Pepsi, one of the largest food manufacturers in the world, is taking a step to lower their price,” he added.  With the new PepsiCo cuts, an 8-ounce bag of Lay’s potato chips could drop from $4.99 to $4.29, while a 9.25-ounce bag of Doritos could fall from $6.29 to $5.49. Even a small change can make a big difference. “You won’t believe what happens to volume when I lower the price 10 cents,” said Leonard. “Food is a very price-sensitive item for customers, and they will travel for a good deal.” PepsiCo’s price reductions could be just the first step in a broader push by snack makers to win back inflation-weary consumers.” “This is just a tip of the iceberg,” said Choi. “We’re gonna see a lot more. I’m positive.”</div>",
            "link": "https://www.nbcnews.com/business/consumer/super-bowl-snacks-pepsi-rcna257783",
            "pub_date": "2026-02-07 07:42:50",
            "source": "nbcnews",
            "kind": 1,
            "language": "en"
        }
    ]
}