{
    "data": [
        {
            "id": "69a1c6d2f2604c0001f4759d",
            "title": "What&#39;s Going On With CoreWeave Stock Today?",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\"><strong>CoreWeave Inc. </strong><a class=\"ticker-link\" data-exchange=\"NASDAQ\" data-ticker=\"CRWV\" href=\"https://www.benzinga.com/quote/CRWV\" rel=\"noopener\" target=\"_blank\">(NASDAQ:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/CRWV\" target=\"_blank\">CRWV</a>)<!-- --> shares fell in premarket trading Friday after the AI cloud provider issued lighter-than-expected <a href=\"https://www.benzinga.com/markets/earnings/26/02/50913508/coreweave-stock-slides-on-mixed-q4-earnings-despite-signaling-hypergrowth-ahead\" rel=\"noreferrer noopener\" target=\"_blank\">first-quarter revenue guidance.</a></p><!--/$--><!--$--><ul class=\"wp-block-list\">\n<li><strong>CoreWeave shares are trending. <a href=\"https://www.benzinga.com/analyst-stock-ratings/price-target/26/02/50933596/coreweave-posts-q4-revenue-beat-guides-to-140-growth-in-2026\" target=\"_blank\">Where are CRWV shares going?</a></strong></li>\n</ul><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">The company posted fourth-quarter revenue of $1.57 billion, narrowly topping Wall Street’s $1.55 billion projection, but its near-term outlook disappointed investors.</p><!--/$--><!--$--><p class=\"block core-block\">Needham analyst Mike Cikos reiterated a Hold rating on the stock.</p><!--/$--><!--$--><h3 class=\"wp-block-heading\"><strong>CoreWeave Guidance Trails Expectations</strong></h3><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><h3 class=\"wp-block-heading\"><strong>Heavy Investment Cycle</strong></h3><!--/$--><!--$--><p class=\"block core-block\">Agrawal said the company expanded its revolving credit facility to $2.5 billion. CoreWeave secured more than $18 billion in debt and equity financing during 2025.</p><!--/$--><!--$--><p class=\"block core-block\">The company also announced a $2 billion investment from Nvidia Corp. <a class=\"ticker-link\" data-exchange=\"NASDAQ\" data-ticker=\"NVDA\" href=\"https://www.benzinga.com/quote/NVDA\" rel=\"noopener\" target=\"_blank\">(NASDAQ:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/NVDA\" target=\"_blank\">NVDA</a>)<!-- --> tied to an expanded commercial partnership.</p><!--/$--><!--$--><p class=\"block core-block\">Agrawal said the company lowered its weighted average interest rate by 300 basis points in 2025.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">He added that the reduction represents nearly $700 million in annualized interest savings. CoreWeave faces no major debt maturities until 2029, excluding amortizing contract-backed obligations.</p><!--/$--><!--$--><h3 class=\"wp-block-heading\"><strong>CapEx Surge And Capacity Growth</strong></h3><!--/$--><!--$--><p class=\"block core-block\">The company plans capital expenditures between $30 billion and $35 billion in 2026.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">That spending more than doubles 2025 investment levels. Management expects active power capacity to exceed 1.7 gigawatts by year-end, up from 850 megawatts across 43 data centers.</p><!--/$--><!--$--><p class=\"block core-block\">CoreWeave reported a contracted revenue backlog of $66.8 billion entering 2026.</p><!--/$--><!--$--><p class=\"block core-block\">Agrawal said, \"Contracted customer demand, deep strategic partnerships, active infrastructure deployment, industry-leading capabilities, and a thoughtful approach to capital markets give us the confidence to put these numbers forward.\"</p><!--/$--><!--$--><p class=\"block core-block\">The company expects to exit 2026 with annualized run-rate revenue between $17 billion and $19 billion.</p><!--/$--><!--$--><p class=\"block core-block\">It projects that the figure will surpass $30 billion by the end of 2027.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>CRWV Price Action:</strong> CoreWeave shares are trading lower by about 18% to $80.12 at last check on Friday.</p><!--/$--><!--$--><p class=\"block core-block\"><em>Image: Shutterstock</em></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50934407\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/27/14-2B-Meta-Deal-Secured.jpeg",
            "link": "https://www.benzinga.com/markets/equities/26/02/50934407/whats-going-on-with-coreweave-stock-today",
            "pub_date": "2026-02-28 00:31:18",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a1c3d3f2604c0001f473c4",
            "title": "The AI Race Behind Crypto&#39;s Next Bull Run",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\">For most of its history, crypto has moved in cycles driven by speculation, liquidity, and macro sentiment. Each rally has exposed familiar weaknesses: fraud, unstable platforms, and weak risk controls. The next bull run may look different. This time, the quiet driver may not be a new token narrative but artificial intelligence reshaping how crypto manages trust, regulation, and market risk.</p><!--/$--><!--$--><p class=\"block core-block\">AI is increasingly being used as an infrastructure layer rather than a marketing label. Instead of promising higher returns, it is applied to monitoring activity, controlling automated decisions, and helping users move more safely between payments, savings, and trading. That shift could matter more for long-term adoption than any single price trigger.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\"><strong>AI as the Trust Engine for Adoption</strong></h2><!--/$--><!--$--><p class=\"block core-block\">Crypto adoption has always been limited by operational risk. Wallet hacks, exchange collapses, and protocol exploits created the perception that participation required technical skill and emotional tolerance for chaos. AI changes that equation by introducing constant oversight.</p><!--/$--><!--$--><p class=\"block core-block\">Machine learning systems can detect abnormal transaction patterns, flag potential fraud, and evaluate behavioral risk in real time. This allows platforms to intervene before losses spread. It also enables sophisticated onboarding and identity verification systems that meet regulatory standards without turning crypto into a slow manual process.</p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><p class=\"block core-block\">Platforms such as Aurum are prioritizing AI-driven controls before expanding into advanced automation. Bryan Benson, CEO at Aurum, said, \"Without trust, the growth side does not go very far.\" </p><!--/$--><!--$--><p class=\"block core-block\">When quizzed on the impact of AI in crypto transactions and financial products, he added that \"risk management comes first. Without trust, the growth side does not go very far. AI already has real value in fraud detection, monitoring, compliance, and the controls that keep automated decisions within set limits.\"</p><!--/$--><!--$--><p class=\"block core-block\">For investors, this matters because adoption accelerates when friction declines. The more AI reduces user error and operational complexity, the more likely institutions and retail participants are to treat crypto as a financial service rather than a speculative experiment.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\"><strong>Regulation Becomes Enforceable at Scale</strong></h2><!--/$--><!--$--><p class=\"block core-block\">Regulation has often been portrayed as crypto's main obstacle, but enforcement has historically been slow and reactive. AI changes that balance by making oversight continuous rather than episodic.</p><!--/$--><!--$--><p class=\"block core-block\">Regulators and compliance teams increasingly rely on machine learning to analyze transaction flows, identify manipulation, and trace illicit activity across wallets. Blockchain analytics firms already use AI models to cluster addresses and detect behavior linked to money laundering or wash trading.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">This shift matters for markets because predictable enforcement reduces uncertainty. When monitoring becomes systematic rather than selective, the cost of operating legally falls relative to the cost of operating outside the rules. Over time, this favors platforms that invest in compliance infrastructure and penalizes opaque or poorly governed projects.</p><!--/$--><!--$--><p class=\"block core-block\">From an investment perspective, regulation supported by AI is not only about restriction. It is about legitimacy. Assets that can survive algorithmic scrutiny are more likely to be integrated into traditional financial systems, from custody solutions to exchange traded products.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\"><strong>AI as a Risk Management Layer</strong></h2><!--/$--><!--$--><p class=\"block core-block\">Volatility in crypto is not just a price phenomenon. It reflects instability in liquidity, governance, and market structure. AI is increasingly used to model these risks before they show up in charts.</p><!--/$--><!--$--><div class=\"nativo-placement-in-content-ap\"></div><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">By embedding these safeguards, platforms make risk management more practical and accessible, helping users navigate crypto more confidently.</p><!--/$--><!--$--><p class=\"block core-block\">Machine learning systems can identify unusual trading behavior, forecast liquidity stress, and highlight vulnerabilities in smart contracts. In decentralized finance, some tools assign risk scores to protocols based on code quality, transaction activity, and historical exploits. This does not eliminate risk but allows investors to measure exposure rather than treating every asset as a binary bet.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\"><strong>The Growth Engine Follows the Safety Layer</strong></h2><!--/$--><!--$--><p class=\"block core-block\">Once AI establishes monitoring and control, it becomes a platform for new financial products. Automated portfolio tools, adaptive yield strategies, and intelligent payment routing are easier to deploy when risk is continuously evaluated.</p><!--/$--><!--$--><p class=\"block core-block\">This is where the next bull run narrative may differ from earlier cycles. Instead of tokens competing on ideology or novelty, projects may compete on reliability and usability. The strongest systems will be those that make movement between holding, spending, and trading feel seamless rather than speculative.</p><!--/$--><!--$--><p class=\"block core-block\">AI also enables personalization at scale. Instead of static interfaces, users can interact with systems that adjust to their risk tolerance and behavior. That type of financial guidance has traditionally been limited to wealth management clients. In crypto, it can now be embedded directly into platforms.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\"><strong>New Risks Introduced by Automation</strong></h2><!--/$--><!--$--><p class=\"block core-block\">The AI layer does not remove danger. It changes its form. Black box models can make decisions that users do not fully understand. Bias in training data can amplify existing inequalities. False positives can freeze funds or block legitimate activity.</p><!--/$--><!--$--><p class=\"block core-block\">There is also the risk of regulatory overreach. AI-driven surveillance can extend beyond fraud prevention into broader behavioral tracking. Privacy-focused assets may come under increasing pressure as analytics tools improve.</p><!--/$--><!--$--><p class=\"block core-block\">For markets, this creates a tradeoff. Efficiency and security increase, but transparency and autonomy may decline. Investors will need to assess not only token economics but also how much control is embedded in the systems that support them.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\"><strong>What This Means for the Next Cycle</strong></h2><!--/$--><!--$--><p class=\"block core-block\">Every major financial expansion has been driven by infrastructure. Railroads enabled industrial growth. Payment networks enabled globalization. Risk models enabled modern capital markets. In crypto, AI may play that role.</p><!--/$--><!--$--><p class=\"block core-block\">The next bull run is likely to reward projects that treat AI as a foundation rather than a feature. Systems that improve fraud detection, enforce limits on automation, and integrate compliance into their design will be better positioned to attract institutional capital.</p><!--/$--><!--$--><p class=\"block core-block\">At the same time, assets that rely purely on narrative without operational discipline may struggle to compete in a market where oversight is continuous and algorithmic.</p><!--/$--><!--$--><p class=\"block core-block\">Crypto has always promised a world without intermediaries. AI introduces a different promise: a system that can watch itself. If that promise holds, the next rally may be driven less by speculation and more by structure.</p><!--/$--><!--$--><p class=\"block core-block\">The race is already underway. The winners may not be the loudest projects, but the ones quietly building the control systems that allow crypto to grow without repeating its past failures.</p><!--/$--><!--$--><p class=\"block core-block\"><strong><em>Benzinga Disclaimer: This article is from an unpaid external contributor. It does not represent Benzinga’s reporting and has not been edited for content or accuracy.</em></strong></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50933920\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "",
            "link": "https://www.benzinga.com/news/26/02/50933920/the-ai-race-behind-cryptos-next-bull-run",
            "pub_date": "2026-02-28 00:18:30",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a1c4faf2604c0001f4747f",
            "title": "Why Nvidia&#39;s Record Profits Weren&#39;t Enough: Chip Stocks Tumble As AI Hype Hits A Wall",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\"><a href=\"https://www.benzinga.com/topic/semiconductor-chips\" rel=\"noreferrer noopener\" target=\"_blank\">Semiconductor stocks declined</a> Friday as investors reacted to <strong>Nvidia Corp’s</strong> <a class=\"ticker-link\" data-exchange=\"NASDAQ\" data-ticker=\"NVDA\" href=\"https://www.benzinga.com/quote/NVDA\" rel=\"noopener\" target=\"_blank\">(NASDAQ:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/NVDA\" target=\"_blank\">NVDA</a>)<!-- --> earnings and broader uncertainty around artificial intelligence, while rising oil prices and bond gains added to market volatility.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">Chip Stocks Slide As Nvidia Weighs On Sector</h2><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">Chipmakers dragged stocks lower after Nvidia's results failed to reassure investors about the artificial-intelligence outlook.</p><!--/$--><!--$--><p class=\"block core-block\">On Wednesday, Nvidia reported fourth-quarter revenue of $68.13 billion, up 73% year-over-year and above the <a href=\"https://www.benzinga.com/markets/earnings/26/02/50872236/nvidia-q4-highlights-record-revenue-data-center-demand-customers-are-racing-to-invest-in-ai-compute\" rel=\"noreferrer noopener\" target=\"_blank\">Street estimate of $66.0 billion</a>.</p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><p class=\"block core-block\">The data center segment generated a record $62.3 billion in revenue, rising 75% Y/Y. Gaming and AI PC revenue reached $3.7 billion, up 47% Y/Y.</p><!--/$--><!--$--><p class=\"block core-block\">Looking ahead, Nvidia expects first-quarter revenue between $76.44 billion and $79.56 billion, above the Street estimate of $71.96 billion.</p><!--/$--><!--$--><p class=\"block core-block\">Nvidia said it has secured inventory and capacity to meet demand for the next several quarters, though supply constraints could weigh on the gaming segment in the first quarter and beyond.</p><!--/$--><!--$--><p class=\"block core-block\">Nvidia fell 5.5% despite issuing a bullish forecast, weighing on nearly every stock in a major semiconductor index.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">Earnings Across Tech Draw Mixed Reaction</h2><!--/$--><!--$?--><template id=\"B:3\"></template><div></div><!--/$--><!--$?--><template id=\"B:4\"></template><div></div><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$?--><template id=\"B:5\"></template><div></div><!--/$--><!--$?--><template id=\"B:6\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">Hardika Singh of Fundstrat Global Advisors <a href=\"https://www.bloomberg.com/news/articles/2026-02-25/asian-stocks-to-climb-as-nvidia-boosts-sentiment-markets-wrap?sref=TBDibEcD\" rel=\"noreferrer noopener\" target=\"_blank\">told</a> Bloomberg Nvidia's strong revenue, net income and guidance did not spark a frenzy because the company rarely misses those benchmarks.</p><!--/$--><!--$--><div class=\"nativo-placement-in-content-ap\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">AI Profitability Concerns Create Headwinds</h2><!--/$--><!--$--><p class=\"block core-block\">Matt Maley of Miller Tabak said Nvidia delivered solid earnings and guidance, but investors still question whether the company can sustain its elevated gross margins.</p><!--/$--><!--$--><p class=\"block core-block\">Matt Maley of Miller Tabak told Bloomberg that he sees several potential headwinds, including doubts about AI profitability.</p><!--/$--><!--$--><p class=\"block core-block\">He warned that these factors could make the month difficult for stocks.</p><!--/$--><!--$--><p class=\"block core-block\">Meanwhile, oil prices rose after Iran described its nuclear talks with the U.S. as intense, prompting investors to seek safety in bonds.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>Price Action:</strong> Nvidia shares were down 1.80% at $181.56, Broadcom shares were down 0.95% at $318.63, Advanced Micro Devices shares were down 1.40% at $200.83 and Micron Technology shares were down 0.13% at $415.02 at the time of publication on Friday, <a href=\"https://www.benzinga.com/pro/\" rel=\"noreferrer noopener\" target=\"_blank\">according to Benzinga Pro data</a>.</p><!--/$--><!--$--><p class=\"block core-block\"><em>Image via Shutterstock</em></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50934100\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/27/Artificial-Intelligence-Simplifying-Task.jpeg",
            "link": "https://www.benzinga.com/markets/tech/26/02/50934100/why-nvidias-record-profits-werent-enough-chip-stocks-tumble-as-ai-hype-hits-a-wall",
            "pub_date": "2026-02-28 00:23:26",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a1c12324c37e0001bc12aa",
            "title": "Why Is JinkoSolar Stock Falling Friday?",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\"><strong>JinkoSolar Holding Co., Ltd. </strong><a href=\"https://www.benzinga.com/quote/JKS\" rel=\"noreferrer noopener\" target=\"_blank\"></a><a class=\"ticker-link\" data-exchange=\"NYSE\" data-ticker=\"JKS\" href=\"https://www.benzinga.com/quote/JKS\" rel=\"noopener\" target=\"_blank\">(NYSE:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/JKS\" target=\"_blank\">JKS</a>)<!-- --> shares plunged Friday after the company unveiled weak <a href=\"https://www.benzinga.com/pressreleases/26/02/n50924434/jinkosolars-subsidiary-jinko-solar-co-ltd-announces-certain-preliminary-unaudited-financial-result\" rel=\"noreferrer noopener\" target=\"_blank\">preliminary 2025 results</a> for its majority-owned subsidiary,<strong> Jiangxi Jinko</strong>, flagging a sharp drop in revenue and a substantial net loss for the full year.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">2025 Preliminary Results Impact JKS Stock</h2><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">JinkoSolar has released preliminary unaudited financial results for its majority-owned subsidiary, Jiangxi Jinko, revealing a steep deterioration in performance for the full year ended December 31, 2025.</p><!--/$--><!--$--><p class=\"block core-block\">Jiangxi Jinko recorded total revenues of 65.49 billion yuan (~$9.57 billion), marking a sharp 29.18% year-on-year decline from 92.47 billion yuan in 2024. The subsidiary swung to a net loss of 6.79 billion yuan, compared to a net profit of 98.9 million yuan in the prior year — a staggering 6,959.50% reversal. Excluding non-recurring gains and losses, the net loss widened further to 7.64 billion yuan.</p><!--/$--><!--$--><p class=\"block core-block\">Falling prices for photovoltaic products drove the deterioration, pushing operating losses to 9.11 billion yuan, compared with an operating profit of 792.96 million yuan in 2024.</p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><p class=\"block core-block\">Total equity attributable to the parent company also contracted by 21.19%, dropping from 32.31 billion yuan to 25.46 billion yuan.</p><!--/$--><!--$--><p class=\"block core-block\">JinkoSolar, which holds approximately 55.59% equity interest in Jiangxi Jinko, cautioned investors that these results remain unaudited, are subject to change, and differ from its consolidated financials prepared under U.S. GAAP.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">JKS Faces Bearish Sentiment</h2><!--/$--><!--$--><p class=\"block core-block\">JinkoSolar’s stock is currently trading below several key moving averages, which typically signals bearish sentiment among investors. The shares are 6.4% below the 20-day SMA, 7.7% below the 50-day SMA, and 3.9% below the 100-day SMA, yet they remain 4.2% above the 200-day SMA. This mixed positioning suggests a lack of clear directional momentum in the near term.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">Upcoming Earnings</h2><!--/$--><!--$--><p class=\"block core-block\">JinkoSolar Holding Co. will release its next financial update on March 25, 2026.</p><!--/$--><!--$--><ul class=\"wp-block-list\">\n<li><strong>EPS Estimate</strong>: Loss of 62 cents (Up from a loss of $1.02 YoY)</li>\n<li><strong>Revenue Estimate</strong>: $2.79 billion (Down from $2.83 billion YoY)</li>\n</ul><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\"><strong>Analyst Consensus &amp; Recent Actions:</strong> The stock carries a Hold Rating with an average price target of $28.62. Recent analyst moves include:</p><!--/$--><!--$--><ul class=\"wp-block-list\">\n<li><strong>Roth Capital</strong>: Neutral (Raises Target to $25.00) (Nov. 21, 2025)</li>\n<li><strong>Goldman Sachs</strong>: Sell (Raises Target to $20.00) (Nov. 19, 2025)</li>\n<li><strong>Goldman Sachs</strong>: Sell (Raises Target to $18.00) (Oct. 8, 2025)</li>\n</ul><!--/$--><!--$--><h2 class=\"wp-block-heading\"> Benzinga Edge Scorecard</h2><!--/$--><!--$--><p class=\"block core-block\">Below is the <a href=\"https://www.benzinga.com/screener\" rel=\"noreferrer noopener\" target=\"_blank\">Benzinga Edge scorecard</a> for the company, highlighting its strengths and weaknesses compared to the broader market:</p><!--/$--><!--$--><ul class=\"wp-block-list\">\n<li><strong>Momentum</strong>: Neutral (Score: 64.67) — The stock shows moderate momentum in the market.</li>\n</ul><!--/$--><!--$--><div class=\"nativo-placement-in-content-ap\"></div><!--/$--><!--$--><p class=\"block core-block\"><strong>The Verdict:</strong> JinkoSolar’s Benzinga Edge signals neutral market performance, with a moderate Momentum score of 64.67 — neither significantly outperforming nor lagging its peers.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>JKS Price Action:</strong> JinkoSolar Holding Co shares were down 4.38% at $25.30 at the time of publication on Friday, <a href=\"https://www.benzinga.com/pro/\" rel=\"noreferrer noopener\" target=\"_blank\">according to Benzinga Pro data</a>.</p><!--/$--><!--$--><p class=\"block core-block\"><em>Photo by Robert Way via Shutterstock</em></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50933426\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/27/Shanghai-china-november-20th-2022-Jinko-.jpeg",
            "link": "https://www.benzinga.com/trading-ideas/movers/26/02/50933426/why-is-jinkosolar-stock-falling-friday",
            "pub_date": "2026-02-28 00:07:02",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a1c1c424c37e0001bc1371",
            "title": "CoreWeave Posts Q4 Revenue Beat, Guides To 140% Growth In 2026",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\">Shares of<strong> CoreWeave Inc <a class=\"ticker-link\" data-exchange=\"NASDAQ\" data-ticker=\"CRWV\" href=\"https://www.benzinga.com/quote/CRWV\" rel=\"noopener\" target=\"_blank\">(NASDAQ:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/CRWV\" target=\"_blank\">CRWV</a>)<!-- --> </strong>tanked in early trading on Friday, after the company reported <a href=\"https://www.benzinga.com/markets/earnings/26/02/50913508/coreweave-stock-slides-on-mixed-q4-earnings-despite-signaling-hypergrowth-ahead\" target=\"_blank\">mixed fourth-quarter results</a>.</p><!--/$--><!--$--><p class=\"block core-block\">Here are the key analyst insights:</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\"><strong>Check out <a href=\"https://www.benzinga.com/analyst-stock-ratings\" target=\"_blank\">other analyst stock ratings</a></strong>.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>DA Davidson: </strong>CoreWeave reported total revenue of $1.6 billion, representing 110% year-on-year growth, Platt said in a note. The company's revenue backlog grew to $66.8 billion, mainly due to an additional contract from <strong>Meta Platforms Inc </strong>(NASDAQ:<a class=\"ticker\" href=\"https://www.benzinga.com/quote/META\" target=\"_blank\">META</a>) valued around $5 billon, he added.</p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><p class=\"block core-block\">CoreWeave reported strong earnings, driven by \"continued strong demand for AI compute,\" the analyst wrote. Management guided to full-year revenues of $12B-$13 billion, implying 140% growth at the midpoint, he further stated.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>Cantor Fitzgerald: </strong>CoreWeave's backlogs grew more than 400% in the fourth quarter, up $11.2 billion sequentially and more than $50 billion year-on-year, Blakey said. The company exited 2025 with backlogs of $66.8 billion, providing strong visibility into the company's guidance for the second half of 2026 and 2027, he added.</p><!--/$--><!--$?--><template id=\"B:3\"></template><div></div><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\"><strong>Needham</strong><strong>: </strong>CoreWeave reported revenue of $1.57 billion, topping consensus of $1.55 billion, Cikos said. He added, however, that the company's operating profit of $88 million fell short of market expectations of $133 million.<strong></strong></p><!--/$--><!--$--><p class=\"block core-block\">Management projected capex to grow to $30-$35 billion, up more than 100% from $14.8 billion in 2025, the analyst stated. \"We remain Hold-rated as we expect CoreWeave to continue prioritizing CapEx spend, cutting into profitability, and muddying the evaluation of underlying unit economics,\" he further wrote.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>CRWV Price Action:</strong> Shares of CoreWeave had declined by 17.9% to $80.04 at the time of publication on Friday.</p><!--/$--><!--$--><p class=\"block core-block\"><em>Image: Shutterstock</em></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50933596\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/27/Close-Up-Of-CoreWeave-Logo-And-Name-On-S.jpeg",
            "link": "https://www.benzinga.com/analyst-stock-ratings/price-target/26/02/50933596/coreweave-posts-q4-revenue-beat-guides-to-140-growth-in-2026",
            "pub_date": "2026-02-28 00:09:31",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        }
    ]
}