{
    "data": [
        {
            "id": "69a2008ff2604c0001f4a543",
            "title": "Apollo&#39;s MFIC Slashes Dividend, Marks Down Assets, Announces $100M Buyback",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\"><strong>Apollo Global Management </strong><a class=\"ticker-link\" data-exchange=\"NYSE\" data-ticker=\"APO\" href=\"https://www.benzinga.com/quote/APO\" rel=\"noopener\" target=\"_blank\">(NYSE:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/APO\" target=\"_blank\">APO</a>)<!-- --> announced that its private credit fund, <strong>MidCap Financial Investment Corp.</strong> <a class=\"ticker-link\" data-exchange=\"NASDAQ\" data-ticker=\"MFIC\" href=\"https://www.benzinga.com/quote/MFIC\" rel=\"noopener\" target=\"_blank\">(NASDAQ:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/MFIC\" target=\"_blank\">MFIC</a>)<!-- -->, has reduced its dividend and re-evaluated its asset values, due to challenges in certain segments of its loan portfolio.</p><!--/$--><!--$--><p class=\"block core-block\">MFIC is resetting its payout strategy, slashing its quarterly dividend from 38 cents to 31 cents per share. The direct lender also reported a roughly 3% markdown in its asset base, attributing the move to underperforming legacy loans and a shifting interest rate environment, Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2026-02-27/apollo-private-credit-fund-marks-down-portfolio-on-soured-loans\" target=\"_blank\">reports</a>.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">They<a href=\"https://www.globenewswire.com/news-release/2026/02/26/3246064/0/en/MidCap-Financial-Investment-Corporation-Reports-Financial-Results-for-the-Quarter-and-Fiscal-Year-Ended-December-31-2025.html\" target=\"_blank\"> </a>also revealed a new $100 million stock repurchase plan authorized by its Board of Directors.</p><!--/$--><!--$--><p class=\"block core-block\">\"With respect to software, our exposure is meaningfully lower than the broader BDC industry. As of Dec. 31, 2025, software represented only 11.4 percent of MFIC's portfolio at fair value. We have constructed a portfolio that we believe is relatively resilient to AI-related risks, with an emphasis on businesses that have long-standing, entrenched customer relationships,\" <strong>Ted McNulty</strong>, the company's president and CIO said.</p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><p class=\"block core-block\">As reported by Bloomberg, private credit managers are facing increased scrutiny from investors concerned about their exposure to the tech sector, particularly due to disruptions caused by artificial intelligence.</p><!--/$--><!--$--><p class=\"block core-block\">Midcap Financial's stock is down 8.5% on Friday and down 14.5% this month. Meanwhile, Apollo's stock is down 20% this month, its worst performance since 2011.</p><!--/$--><!--$--><p class=\"block core-block\"><em>Image by Piotr Swat via Shutterstock</em></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50945001\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/27/Konskie--Poland---November-15--2024-Apol.jpeg",
            "link": "https://www.benzinga.com/markets/private-markets/26/02/50945001/apollos-mfic-slashes-dividend-marks-down-assets-announces-100m-buyback",
            "pub_date": "2026-02-28 04:37:38",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a1ff86f2604c0001f4a48b",
            "title": "$1000 Invested In Accenture 20 Years Ago Would Be Worth This Much Today",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\">Accenture (NYSE:<a class=\"ticker\" href=\"https://www.benzinga.com/quote/ACN\" target=\"_blank\">ACN</a>) has outperformed the market over the past 20 years by 1.08% on an annualized basis producing an average annual return of 9.83%. Currently, Accenture has a market capitalization of $128.04 billion. </p><!--/$--><!--$--><p class=\"block core-block\"><strong>Buying $1000 In ACN:</strong> If an investor had bought $1000 of ACN stock 20 years ago, it would be worth <strong>$6,427.09</strong> today based on a price of $208.04 for ACN at the time of writing.</p><!--/$--><!--$--><h3 class=\"block core-block\">Accenture's Performance Over Last 20 Years</h3><!--/$--><!--$?--><template id=\"B:1\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">Finally -- what's the point of all this? The key insight to take from this article is to note how much of a difference compounded returns can make in your cash growth over a period of time.</p><!--/$--><!--$--><p class=\"block core-block\"><em>This article was generated by Benzinga's automated content engine and reviewed by an editor.</em></p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--></div></div>",
            "image": "",
            "link": "https://www.benzinga.com/insights/news/26/02/50944835/1000-invested-in-accenture-20-years-ago-would-be-worth-this-much-today",
            "pub_date": "2026-02-28 04:33:14",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a1fec4f2604c0001f4a40a",
            "title": "OpenAI Lines Up $110B In Private Round — What&#39;s Driving The Long-Term Bet",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\">What just happened? There is no sugar-coating it, the artificial intelligence (AI) arms race just hit a new gear!</p><!--/$--><!--$--><p class=\"block core-block\">In a shocking announcement on Friday, OpenAI said it had lined up a staggering $110 billion in new funding from three of the most powerful players in the tech industry, Amazon, NVIDIA, and SoftBank, giving the AI firm a pre-money valuation of $730 billion ahead of what could be a blockbuster IPO later this year. </p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">The deal doubles the size of OpenAI’s last funding round, which raised a <a href=\"https://www.cnbc.com/2025/03/31/openai-closes-40-billion-in-funding-the-largest-private-fundraise-in-history-softbank-chatgpt.html\" rel=\"nofollow\" target=\"_blank\">record-setting $40 billion in March 2025</a>. This time, the stakes are bigger, the partners are more strategic, and the implications for the AI industry can only be best explained as they come.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">Amazon, Nvidia, and SoftBank are Betting Big</h2><!--/$--><!--$--><p class=\"block core-block\">CEO Sam Altman did not mince words when describing what this moment means for the company. “<em>We’re super excited about this deal,</em>” he told CNBC’s Squawk Box Friday morning.</p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><p class=\"block core-block\">Amazon is leading this charge by investing $50 billion in this round ($15 billion upfront, and the other $35 billion will be invested after satisfactory progress. Both NVIDIA and SoftBank are committing $30 billion each. Other investors are not exempt from this fundraising and are welcome to join as the project progresses.</p><!--/$--><!--$--><p class=\"block core-block\">“<em>AI is going to happen everywhere. It’s transforming the whole economy, and the world needs a lot of collective computing power to meet the demand,</em>” he said.</p><!--/$--><!--$--><p class=\"block core-block\">For Altman, this is not just a fundraiser. It is a declaration that OpenAI is ready to play at a scale no private AI company has ever attempted.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">Why Invest So Much?</h2><!--/$--><!--$--><p class=\"block core-block\">The trio of investors is not writing these checks out of charity. Amazon Web Services (AWS) automatically replaces OpenAI Frontier as the exclusive third-party cloud distribution partner for OpenAI’s enterprise solution for deploying AI agents. Furthermore, Amazon (through AWS) will benefit from an extra $100 billion over a period of eight years, in addition to the <a href=\"https://openai.com/index/aws-and-openai-partnership/\" rel=\"nofollow\" target=\"_blank\">previous $38 billion deal with OpenAI</a>. </p><!--/$--><!--$--><p class=\"block core-block\">The two companies co-develop a “<a href=\"https://www.emergentmind.com/topics/stateful-runtime-management\" rel=\"nofollow\" target=\"_blank\">Stateful Runtime Environment</a>” for agents that runs natively in Amazon Bedrock. This is built to assist enterprises in running AI applications at a faster time to production for multi-step workflows, as well as offer a better fit for long-horizon work.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">Altman highlighted that OpenAI and Amazon share a belief that AI should show up in ways that are practical and genuinely useful for people. He said, “<em>Combining OpenAI’s models with Amazon’s infrastructure and global reach helps us put powerful AI into the hands of businesses and users at real scale.</em>“</p><!--/$--><!--$--><p class=\"block core-block\">The deal with NVIDIA provides OpenAI access to the next generation of computing infrastructure at a time when access to GPUs is one of the most contested resources in tech.</p><!--/$--><!--$--><p class=\"block core-block\">Meanwhile, OpenAI expects to ride on SoftBank's willingness to make big bets early, offers distribution expertise, and global access to capital.</p><!--/$--><!--$--><p class=\"block core-block\">Altman summarized the value proposition of the deal as this:</p><!--/$--><!--$--><div class=\"nativo-placement-in-content-ap\"></div><!--/$--><!--$--><p class=\"block core-block\">“<em>SoftBank, Nvidia, and Amazon are long-term partners who share our ambition to turn real scientific progress into systems that deliver meaningful benefits for people at global scale.</em>“</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">The Market Prospect</h2><!--/$--><!--$--><p class=\"block core-block\">OpenAI’s user metrics give context to why these investors are lining up. ChatGPT now has more than 900 million weekly active users and over 50 million consumer subscribers. More than 9 million paying business users rely on the platform for work, and January and February 2026 are on track to be the largest months for new subscriber sign-ups in the company’s history.</p><!--/$--><!--$--><p class=\"block core-block\">The user metrics provided by OpenAI provide some context for why these investors are risking it all. One of the company's generative AI, ChatGPT, currently boasts more than 900 million weekly active users and over 50 million consumer subscribers. In addition, over 9 million paying business users rely on the platform, with February 2026 showing record numbers in the company’s history in response to the new investment.</p><!--/$--><!--$--><p class=\"block core-block\">The company is projecting a figure of over $280 billion in total revenue by 2030, roughly split between consumer and enterprise businesses. OpenAI also expects approximately $600 billion in total compute spend by 2030, and this again illustrates the enormous capital required to achieve AGI.</p><!--/$--><!--$--><p class=\"block core-block\">Despite all this, OpenAI clarified that there might not be a return on investment until 2030; thus, the partners are betting on a company that is currently losing money.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">What This Means for the AI Ecosystem</h2><!--/$--><!--$--><p class=\"block core-block\">The investment involves multiple strategic partnerships that are capable of not just disrupting the AI infrastructure but also altering its market dynamics.</p><!--/$--><!--$--><p class=\"block core-block\">With this development, Amazon now has a cloud infrastructure partner that helps it speed up its AI product pipeline, while NVIDIA can attract large customers for its future-generation chips. Similarly, this enables SoftBank to expand its AI technologies ahead of what many see as a generation-defining shift in the industry. </p><!--/$--><!--$--><p class=\"block core-block\">This deal comes at a time when OpenAI is facing its toughest competition since its inception. Google's Gemini is quickly becoming the go-to option for consumers, whereas Anthropic is what business enterprises prefer. OpenAI is fighting back by speeding up both its research and its sales efforts.</p><!--/$--><!--$--><p class=\"block core-block\">Altman captured the urgency in a statement on Friday: </p><!--/$--><!--$--><p class=\"block core-block\">“<em>We are entering a new phase where frontier AI moves from research into daily use at a global scale. Leadership will be defined by who can scale infrastructure fast enough to meet demand, and turn that capacity into products people rely on.</em>“</p><!--/$--><!--$--><p class=\"block core-block\">He added that the funding will not compromise the company’s existing partnership with Microsoft. Microsoft Azure remains the sole provider of cloud services for OpenAI's APIs and first-party products, with no changes to its intellectual property arrangements.</p><!--/$--><!--$--><p class=\"block core-block\">With $110 billion freshly committed, an IPO possibly on the horizon, and three tech giants on its side, OpenAI is making a bold statement that it is well-positioned to win the race to AGI.</p><!--/$--><!--$--><p class=\"block core-block\"><strong><em>Benzinga Disclaimer: This article is from an unpaid external contributor. It does not represent Benzinga’s reporting and has not been edited for content or accuracy.</em></strong></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50944718\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "",
            "link": "https://www.benzinga.com/Opinion/26/02/50944718/openai-lines-up-110-billion-in-private-round-what-is-driving-the-long-term-bet",
            "pub_date": "2026-02-28 04:29:59",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a1feebf2604c0001f4a42a",
            "title": "Minnesota Man Hides Retirement Contributions From Wife Who Says &#39;Debt Is Normal&#39; — Dave Ramsey Fires Back, &#39;No More&#39;",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\">Secret savings felt safer than another fight about money. </p><!--/$--><!--$--><p class=\"block core-block\">Anthony <a href=\"https://www.youtube.com/watch?v=uE6_NuZ3kWo\" target=\"_blank\">wrote</a> to \"The Ramsey Show\" that he quietly increased his retirement contributions, diverting $65 from each paycheck into an online investing platform because his wife believes \"debt is normal.\"</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">He admitted the deception was wrong but said he felt stuck. The Minnesota resident's frustration  prompted hosts <strong>John Delony</strong> and <a href=\"https://www.benzinga.com/personal-finance/management/26/02/50771918/dave-ramsey-says-d-i-v-o-r-c-e-yet-urges-counseling-first-after-husband-refuses-budget-and-keeps-buying-trucks-and-muscle-cars\" target=\"_blank\"><strong>Dave Ramsey</strong></a> to respond bluntly.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>Don't Miss:</strong></p><!--/$--><!--$--><ul class=\"wp-block-list\">\n<li><strong>Wall Street's $12B Real Estate Manager Is Opening Its Doors to Individual Investors — <a href=\"https://www.benzinga.com/money/lightstone\" target=\"_blank\"><strong>Without the Crowdfunding Middlemen</strong></a></strong></li>\n<li><strong><a href=\"https://www.benzinga.com/money/paladin-power-storage\" target=\"_blank\">This Energy Storage Company Already Has $185M in Contracts—Shares Are Still Available</a></strong></li>\n</ul><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">The Cost Of Quiet Accounts</h2><!--/$--><!--$--><p class=\"block core-block\">Anthony wrote that he wants to tackle their <a href=\"https://www.benzinga.com/personal-finance/management/26/02/50531998/you-have-enough-crap-to-last-you-for-the-rest-of-your-life-dave-ramsey-tells-94k-earner-who-says-im-out-of-control\" target=\"_blank\">debt</a> more aggressively but cannot persuade his wife to be more frugal. He said lying to provide for his family \"hurts\" and asked what to do next.</p><!--/$--><!--$--><p class=\"block core-block\">\"Stop lying,\" Delony said. \"This is not a money situation. This is something that’s deeper than this.\" He urged Anthony and his wife to sit down with a trusted mediator, such as a marriage counselor, pastor or a trustworthy friend, for a direct, truth-telling conversation about their relationship.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">Ramsey Says Draw A Line</h2><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">\"No more,\" Ramsey said.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>Trending: Before the IPO: <a href=\"https://www.benzinga.com/money/elf-labs-ip\" target=\"_blank\"><strong>How One Company Quietly Locked Up 500+ Iconic Character Rights</strong></a></strong></p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">He said Anthony should look his wife in the eye and refuse to continue living \"broke to broke to broke and in debt our whole lives.\" </p><!--/$--><!--$--><p class=\"block core-block\">He also said Anthony must have an \"or what?\" moment — meaning he must decide what happens if she refuses to change rather than continuing to postpone an inevitable confrontation.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">The Issue Goes Beyond Dollars</h2><!--/$--><!--$?--><template id=\"B:3\"></template><div></div><!--/$--><!--$--><div class=\"nativo-placement-in-content-ap\"></div><!--/$--><!--$--><p class=\"block core-block\">Delony said that hiding, lying, stealing or cheating does not help a marriage, even when someone believes they are protecting their family. \"We're going to do what it takes to win,\" Ramsey said.</p><!--/$--><!--$--><!--/$--><!--$--><p class=\"block core-block\">As Anthony considers next steps, working with a financial advisor could provide a structured way to review debt, savings and long-term plans.</p><!--/$--><!--$--><p class=\"block core-block\"><a href=\"https://benzingapartners.go2cloud.org/aff_c?offer_id=731&amp;aff_id=1\" target=\"_blank\">Money Pickle</a> connects users with vetted fiduciary financial advisors who are legally obligated to act in their clients' best interests. After completing a brief online questionnaire, individuals can schedule a complimentary, no-obligation session to discuss retirement planning, debt strategy or overall financial organization.</p><!--/$--><!--$--><!--/$--><!--$--><p class=\"block core-block\"><em><strong>Image: Shutterstock</strong></em></p><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/27/Refinancing-Activity-More-Than-Doubles.jpeg",
            "link": "https://www.benzinga.com/personal-finance/management/26/02/50944747/minnesota-man-hides-retirement-contributions-from-wife-who-says-debt-is-normal-dave-ramsey-fires-back-no-more",
            "pub_date": "2026-02-28 04:30:38",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a1fb1df2604c0001f4a0a9",
            "title": "The Trend Is Your Friend: 7 Charts Most Investors Are Missing",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\">Something unusual is happening across global markets. Record streaks, rare rotations and historic moves are surfacing <a href=\"https://www.benzinga.com/author/piero-cingari\" target=\"_blank\">at the same time.</a></p><!--/$--><!--$--><p class=\"block core-block\">From global equities to commodities to individual stocks, trends are emerging that we haven't seen in years — and in some cases, ever.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">Here are seven charts quietly reshaping market leadership — even if few are paying attention.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">1. Global Stocks Are On a Historic Run, But The US Is Not Joining The Party</h2><!--/$--><!--$--><p class=\"block core-block\">The <strong>All Country ex-U.S. ETF <a class=\"ticker-link\" data-exchange=\"ARCA\" data-ticker=\"ACWX\" href=\"https://www.benzinga.com/quote/ACWX\" rel=\"noopener\" target=\"_blank\">(NYSE:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/ACWX\" target=\"_blank\">ACWX</a>)</strong> – the benchmark tracking global equities outside the United States – has now logged 10 straight weeks of gains — the longest streak on record.</p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><p class=\"block core-block\">At the same time, the <strong>iShares MSCI Emerging Markets ETF </strong><a class=\"ticker-link\" data-exchange=\"ARCA\" data-ticker=\"EEM\" href=\"https://www.benzinga.com/quote/EEM\" rel=\"noopener\" target=\"_blank\">(NYSE:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/EEM\" target=\"_blank\">EEM</a>)<!-- --> has also advanced for 10 consecutive weeks, another all-time streak.</p><!--/$--><!--$--><p class=\"block core-block\">Is the center of gravity in global markets shifting away from the U.S.?</p><!--/$--><!--$--><p class=\"block core-block\">Read also: <a href=\"https://www.benzinga.com/markets/equities/26/02/50930242/trumps-america-is-losing-the-crown-a-new-market-order-is-rising\" target=\"_blank\">Trump’s America Is Losing The Crown: A New Market Order Is Rising</a></p><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">2. Precious Metals Extend Their Historic Moves</h2><!--/$--><!--$--><p class=\"block core-block\">Gold has outperformed the S&amp;P 500 for seven straight weeks, the longest stretch since February 2008.</p><!--/$--><!--$--><p class=\"block core-block\">Silver has gone even further — 10 consecutive months of gains, an unprecedented streak.</p><!--/$--><!--$--><p class=\"block core-block\">Historically, these types of moves preceded major economic shocks. </p><!--/$--><!--$--><p class=\"block core-block\">What are precious metals trying to tell us this time?</p><!--/$--><!--$--><p class=\"block core-block\">Read also: <a href=\"https://www.benzinga.com/markets/commodities/26/02/50915441/gold-is-sending-a-message-we-havent-heard-since-2008\" target=\"_blank\">Gold Is Sending A Message We Haven’t Heard Since 2008</a></p><!--/$--><!--$?--><template id=\"B:3\"></template><div></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">3. South Korea Is On Fire</h2><!--/$--><!--$--><p class=\"block core-block\">The<strong> iShares MSCI South Korea ETF</strong> <a class=\"ticker-link\" data-exchange=\"ARCA\" data-ticker=\"EWY\" href=\"https://www.benzinga.com/quote/EWY\" rel=\"noopener\" target=\"_blank\">(NYSE:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/EWY\" target=\"_blank\">EWY</a>)<!-- --> has climbed for 10 straight weeks, its longest streak since January 2006.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">Even more striking, the broader South Korean equity market has surged 55% in just two months — the strongest two-month performance since April 2009.</p><!--/$--><!--$--><p class=\"block core-block\">As U.S. tech begins to wobble, parts of tech in Asia are staging blockbuster rallies.</p><!--/$--><!--$--><p class=\"block core-block\">Is the center of gravity in global technology starting to shift?</p><!--/$--><!--$?--><template id=\"B:4\"></template><div></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">4. Energy Is Beating Tech — By A Lot</h2><!--/$--><!--$?--><template id=\"B:5\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">Meanwhile, the <strong>VanEck Oil Services ETF</strong> <a class=\"ticker-link\" data-exchange=\"ARCA\" data-ticker=\"OIH\" href=\"https://www.benzinga.com/quote/OIH\" rel=\"noopener\" target=\"_blank\">(NYSE:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/OIH\" target=\"_blank\">OIH</a>)<!-- --> has posted nine consecutive weekly gains, its longest run since 2022.</p><!--/$--><!--$--><p class=\"block core-block\">Read also: <a href=\"https://www.benzinga.com/etfs/broad-u-s-equity-etfs/26/02/50905025/ai-driven-sector-rotation-wall-street-why-energy-outperforms-tech-2026-goldman-halo-trade\" target=\"_blank\">Something Unseen Since The Russian Invasion Of Ukraine Is Happening On Wall Street</a></p><!--/$--><!--$?--><template id=\"B:6\"></template><div></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">5. Value vs. Growth: A Comeback We Haven't Seen Since 2001</h2><!--/$--><!--$?--><template id=\"B:7\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">That's not a small swing. It's the kind of rotation that historically shows up at major turning points in market leadership. </p><!--/$--><!--$--><p class=\"block core-block\">Read also: <a href=\"https://www.benzinga.com/markets/tech/26/02/50869554/ai-winners-losers-us-sector-rotation-labor-exposure\" target=\"_blank\">Winners And Losers Of AI: The New Divide Reshaping US Market Leadership</a></p><!--/$--><!--$?--><template id=\"B:8\"></template><div></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">6. A Historic Pullback in Microsoft</h2><!--/$--><!--$--><p class=\"block core-block\"><strong>Microsoft Corp. <a class=\"ticker-link\" data-exchange=\"NASDAQ\" data-ticker=\"MSFT\" href=\"https://www.benzinga.com/quote/MSFT\" rel=\"noopener\" target=\"_blank\">(NASDAQ:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/MSFT\" target=\"_blank\">MSFT</a>)</strong> has now recorded five consecutive monthly losses, its longest losing streak since February 2009. </p><!--/$--><!--$--><p class=\"block core-block\">For one of the market's most dominant mega-caps, that kind of sustained weakness is rare — and it suggests that even the most crowded leadership trades are no longer immune to pressure.</p><!--/$--><!--$?--><template id=\"B:9\"></template><div></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">7. A Warning From Apollo</h2><!--/$--><!--$--><p class=\"block core-block\"><strong>Apollo Global Management Inc.</strong> <a class=\"ticker-link\" data-exchange=\"NYSE\" data-ticker=\"APO\" href=\"https://www.benzinga.com/quote/APO\" rel=\"noopener\" target=\"_blank\">(NYSE:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/APO\" target=\"_blank\">APO</a>)<!-- --> has declined over 20% in February, the worst month since 2011. </p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">In a month dominated by concerns over AI-driven disruption in software, investors have also been unloading asset managers — a sign that anxiety may be spreading beyond tech and into private equity and credit markets.</p><!--/$--><!--$--><p class=\"block core-block\">Is this where the next crack could emerge?</p><!--/$--><!--$--><p class=\"block core-block\">Read also: <a href=\"https://www.benzinga.com/analyst-stock-ratings/analyst-color/26/02/50779196/ai-disruption-is-reshaping-software-and-credit-markets-may-be-next\" target=\"_blank\">AI Disruption Is Reshaping Software — And Credit Markets May Be Next</a></p><!--/$--><!--$?--><template id=\"B:a\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\"><em>Image: Shutterstock</em></p><!--/$--><!--$--><p class=\"block core-block\"><br/></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50944038\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/27/Candlestick-Chart-Showing-Falling-Stock-.jpeg",
            "link": "https://www.benzinga.com/markets/equities/26/02/50944038/trend-is-your-friend-7-charts-most-investors-are-probably-missing",
            "pub_date": "2026-02-28 04:14:25",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        }
    ]
}