{
    "data": [
        {
            "id": "69a20267f2604c0001f4a6de",
            "title": "Investors Eye Covered Call ETFs For Steady Income — But There&#39;s A Trade-Off",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\"><a href=\"https://www.benzinga.com/etfs\" target=\"_blank\">Options-based ETFs</a>, especially those that offer a covered call strategy, are gaining traction in 2026, especially for investors looking to generate income in a volatile market environment.</p><!--/$--><!--$--><p class=\"block core-block\">The biggest player in this space is the <strong>JPMorgan Equity Premium Income ETF</strong> <a class=\"ticker-link\" data-exchange=\"ARCA\" data-ticker=\"JEPI\" href=\"https://www.benzinga.com/quote/JEPI\" rel=\"noopener\" target=\"_blank\">(NYSE:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/JEPI\" target=\"_blank\">JEPI</a>)<!-- -->, which has an AUM of about $44.5 billion and offers a 30-day SEC yield of 8.13%. This ETF offers a hybrid model of investing in defensive stocks and investing 15% of the assets in equity-linked notes that mimic out-of-the-money covered call writing on the<strong> S&amp;P 500 Index</strong>. This provides upside and income generation through steady income flows. This year so far, $1.43 billion has flowed into the fund, according to <em>Etf Db</em>.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">Income Vs. Upside</h2><!--/$--><!--$--><p class=\"block core-block\">These funds generate cash flow by selling call options on equity holdings, collecting premiums that are distributed among shareholders. The trade-off is obvious: upside participation is capped during market rallies. </p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><p class=\"block core-block\">These funds offer high income, downside risk reduction, and the potential to outperform in a sideways market where option premiums remain high and capital gains are harder to capture. But they underperform in a strong bull market if not capped. Investors should also be mindful of the type of strategy used, holdings, expense ratios, and taxes before investing. </p><!--/$--><!--$--><p class=\"block core-block\">For investors prioritizing monthly income, the steady distribution stream can outweigh the opportunity cost of limited upside. So the fact that 2026 is turning out to be good for the funds so far might suggest the investor mood is conservative.</p><!--/$--><!--$--><p class=\"block core-block\">With billions invested in covered call ETFs, these funds are moving from being tactical yield vehicles to being core portfolio income solutions, especially attractive to retirees who want to receive regular income without sacrificing equities entirely.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">However, its success is also tied to volatility conditions and investor expectations. As a result, should a bull market persist for an extended period, <strong>traditional index-based ETFs</strong> may prove to be more effective. But in an atmosphere of rate uncertainty and episodic volatility, investor demand for yield-enhanced equity investments shows few signs of fading.</p><!--/$--><!--$--><p class=\"block core-block\"><em>Photo: bigjom jom via Shutterstock</em></p><!--/$--><!--$--><p class=\"block core-block\"><br/></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50945316\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/27/Businessman-Pointing-At-Etf-exchange-Tra.jpeg",
            "link": "https://www.benzinga.com/etfs/specialty-etfs/26/02/50945316/investors-eye-covered-call-etfs-for-steady-income-but-theres-a-trade-off",
            "pub_date": "2026-02-28 04:45:30",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a202bef2604c0001f4a71e",
            "title": "Here&#39;s How Much You Would Have Made Owning Shell Stock In The Last 5 Years",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\">Shell (NYSE:<a class=\"ticker\" href=\"https://www.benzinga.com/quote/SHEL\" target=\"_blank\">SHEL</a>) has outperformed the market over the past 5 years by 2.88% on an annualized basis producing an average annual return of 15.03%. Currently, Shell has a market capitalization of $233.13 billion. </p><!--/$--><!--$--><p class=\"block core-block\"><strong>Buying $100 In SHEL:</strong> If an investor had bought $100 of SHEL stock 5 years ago, it would be worth <strong>$203.96</strong> today based on a price of $82.72 for SHEL at the time of writing.</p><!--/$--><!--$--><h3 class=\"block core-block\">Shell's Performance Over Last 5 Years</h3><!--/$--><!--$?--><template id=\"B:1\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">Finally -- what's the point of all this? The key insight to take from this article is to note how much of a difference compounded returns can make in your cash growth over a period of time.</p><!--/$--><!--$--><p class=\"block core-block\"><em>This article was generated by Benzinga's automated content engine and reviewed by an editor.</em></p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--></div></div>",
            "image": "",
            "link": "https://www.benzinga.com/insights/news/26/02/50945375/heres-how-much-you-would-have-made-owning-shell-stock-in-the-last-5-years",
            "pub_date": "2026-02-28 04:46:58",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a2008ff2604c0001f4a543",
            "title": "Apollo&#39;s MFIC Slashes Dividend, Marks Down Assets, Announces $100M Buyback",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\"><strong>Apollo Global Management </strong><a class=\"ticker-link\" data-exchange=\"NYSE\" data-ticker=\"APO\" href=\"https://www.benzinga.com/quote/APO\" rel=\"noopener\" target=\"_blank\">(NYSE:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/APO\" target=\"_blank\">APO</a>)<!-- --> announced that its private credit fund, <strong>MidCap Financial Investment Corp.</strong> <a class=\"ticker-link\" data-exchange=\"NASDAQ\" data-ticker=\"MFIC\" href=\"https://www.benzinga.com/quote/MFIC\" rel=\"noopener\" target=\"_blank\">(NASDAQ:</a><a class=\"ticker\" href=\"https://www.benzinga.com/quote/MFIC\" target=\"_blank\">MFIC</a>)<!-- -->, has reduced its dividend and re-evaluated its asset values, due to challenges in certain segments of its loan portfolio.</p><!--/$--><!--$--><p class=\"block core-block\">MFIC is resetting its payout strategy, slashing its quarterly dividend from 38 cents to 31 cents per share. The direct lender also reported a roughly 3% markdown in its asset base, attributing the move to underperforming legacy loans and a shifting interest rate environment, Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2026-02-27/apollo-private-credit-fund-marks-down-portfolio-on-soured-loans\" target=\"_blank\">reports</a>.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">They<a href=\"https://www.globenewswire.com/news-release/2026/02/26/3246064/0/en/MidCap-Financial-Investment-Corporation-Reports-Financial-Results-for-the-Quarter-and-Fiscal-Year-Ended-December-31-2025.html\" target=\"_blank\"> </a>also revealed a new $100 million stock repurchase plan authorized by its Board of Directors.</p><!--/$--><!--$--><p class=\"block core-block\">\"With respect to software, our exposure is meaningfully lower than the broader BDC industry. As of Dec. 31, 2025, software represented only 11.4 percent of MFIC's portfolio at fair value. We have constructed a portfolio that we believe is relatively resilient to AI-related risks, with an emphasis on businesses that have long-standing, entrenched customer relationships,\" <strong>Ted McNulty</strong>, the company's president and CIO said.</p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><p class=\"block core-block\">As reported by Bloomberg, private credit managers are facing increased scrutiny from investors concerned about their exposure to the tech sector, particularly due to disruptions caused by artificial intelligence.</p><!--/$--><!--$--><p class=\"block core-block\">Midcap Financial's stock is down 8.5% on Friday and down 14.5% this month. Meanwhile, Apollo's stock is down 20% this month, its worst performance since 2011.</p><!--/$--><!--$--><p class=\"block core-block\"><em>Image by Piotr Swat via Shutterstock</em></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50945001\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/27/Konskie--Poland---November-15--2024-Apol.jpeg",
            "link": "https://www.benzinga.com/markets/private-markets/26/02/50945001/apollos-mfic-slashes-dividend-marks-down-assets-announces-100m-buyback",
            "pub_date": "2026-02-28 04:37:38",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a1ff86f2604c0001f4a48b",
            "title": "$1000 Invested In Accenture 20 Years Ago Would Be Worth This Much Today",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\">Accenture (NYSE:<a class=\"ticker\" href=\"https://www.benzinga.com/quote/ACN\" target=\"_blank\">ACN</a>) has outperformed the market over the past 20 years by 1.08% on an annualized basis producing an average annual return of 9.83%. Currently, Accenture has a market capitalization of $128.04 billion. </p><!--/$--><!--$--><p class=\"block core-block\"><strong>Buying $1000 In ACN:</strong> If an investor had bought $1000 of ACN stock 20 years ago, it would be worth <strong>$6,427.09</strong> today based on a price of $208.04 for ACN at the time of writing.</p><!--/$--><!--$--><h3 class=\"block core-block\">Accenture's Performance Over Last 20 Years</h3><!--/$--><!--$?--><template id=\"B:1\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">Finally -- what's the point of all this? The key insight to take from this article is to note how much of a difference compounded returns can make in your cash growth over a period of time.</p><!--/$--><!--$--><p class=\"block core-block\"><em>This article was generated by Benzinga's automated content engine and reviewed by an editor.</em></p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--></div></div>",
            "image": "",
            "link": "https://www.benzinga.com/insights/news/26/02/50944835/1000-invested-in-accenture-20-years-ago-would-be-worth-this-much-today",
            "pub_date": "2026-02-28 04:33:14",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a1fec4f2604c0001f4a40a",
            "title": "OpenAI Lines Up $110B In Private Round — What&#39;s Driving The Long-Term Bet",
            "description": "<div><div class=\"sc-gfrmXj kPLDLR\"><!--$--><p class=\"block core-block\">What just happened? There is no sugar-coating it, the artificial intelligence (AI) arms race just hit a new gear!</p><!--/$--><!--$--><p class=\"block core-block\">In a shocking announcement on Friday, OpenAI said it had lined up a staggering $110 billion in new funding from three of the most powerful players in the tech industry, Amazon, NVIDIA, and SoftBank, giving the AI firm a pre-money valuation of $730 billion ahead of what could be a blockbuster IPO later this year. </p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">The deal doubles the size of OpenAI’s last funding round, which raised a <a href=\"https://www.cnbc.com/2025/03/31/openai-closes-40-billion-in-funding-the-largest-private-fundraise-in-history-softbank-chatgpt.html\" rel=\"nofollow\" target=\"_blank\">record-setting $40 billion in March 2025</a>. This time, the stakes are bigger, the partners are more strategic, and the implications for the AI industry can only be best explained as they come.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">Amazon, Nvidia, and SoftBank are Betting Big</h2><!--/$--><!--$--><p class=\"block core-block\">CEO Sam Altman did not mince words when describing what this moment means for the company. “<em>We’re super excited about this deal,</em>” he told CNBC’s Squawk Box Friday morning.</p><!--/$--><!--$--><div class=\"sc-jHrKIi gTZsSs\"></div><!--/$--><!--$--><p class=\"block core-block\">Amazon is leading this charge by investing $50 billion in this round ($15 billion upfront, and the other $35 billion will be invested after satisfactory progress. Both NVIDIA and SoftBank are committing $30 billion each. Other investors are not exempt from this fundraising and are welcome to join as the project progresses.</p><!--/$--><!--$--><p class=\"block core-block\">“<em>AI is going to happen everywhere. It’s transforming the whole economy, and the world needs a lot of collective computing power to meet the demand,</em>” he said.</p><!--/$--><!--$--><p class=\"block core-block\">For Altman, this is not just a fundraiser. It is a declaration that OpenAI is ready to play at a scale no private AI company has ever attempted.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">Why Invest So Much?</h2><!--/$--><!--$--><p class=\"block core-block\">The trio of investors is not writing these checks out of charity. Amazon Web Services (AWS) automatically replaces OpenAI Frontier as the exclusive third-party cloud distribution partner for OpenAI’s enterprise solution for deploying AI agents. Furthermore, Amazon (through AWS) will benefit from an extra $100 billion over a period of eight years, in addition to the <a href=\"https://openai.com/index/aws-and-openai-partnership/\" rel=\"nofollow\" target=\"_blank\">previous $38 billion deal with OpenAI</a>. </p><!--/$--><!--$--><p class=\"block core-block\">The two companies co-develop a “<a href=\"https://www.emergentmind.com/topics/stateful-runtime-management\" rel=\"nofollow\" target=\"_blank\">Stateful Runtime Environment</a>” for agents that runs natively in Amazon Bedrock. This is built to assist enterprises in running AI applications at a faster time to production for multi-step workflows, as well as offer a better fit for long-horizon work.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">Altman highlighted that OpenAI and Amazon share a belief that AI should show up in ways that are practical and genuinely useful for people. He said, “<em>Combining OpenAI’s models with Amazon’s infrastructure and global reach helps us put powerful AI into the hands of businesses and users at real scale.</em>“</p><!--/$--><!--$--><p class=\"block core-block\">The deal with NVIDIA provides OpenAI access to the next generation of computing infrastructure at a time when access to GPUs is one of the most contested resources in tech.</p><!--/$--><!--$--><p class=\"block core-block\">Meanwhile, OpenAI expects to ride on SoftBank's willingness to make big bets early, offers distribution expertise, and global access to capital.</p><!--/$--><!--$--><p class=\"block core-block\">Altman summarized the value proposition of the deal as this:</p><!--/$--><!--$--><div class=\"nativo-placement-in-content-ap\"></div><!--/$--><!--$--><p class=\"block core-block\">“<em>SoftBank, Nvidia, and Amazon are long-term partners who share our ambition to turn real scientific progress into systems that deliver meaningful benefits for people at global scale.</em>“</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">The Market Prospect</h2><!--/$--><!--$--><p class=\"block core-block\">OpenAI’s user metrics give context to why these investors are lining up. ChatGPT now has more than 900 million weekly active users and over 50 million consumer subscribers. More than 9 million paying business users rely on the platform for work, and January and February 2026 are on track to be the largest months for new subscriber sign-ups in the company’s history.</p><!--/$--><!--$--><p class=\"block core-block\">The user metrics provided by OpenAI provide some context for why these investors are risking it all. One of the company's generative AI, ChatGPT, currently boasts more than 900 million weekly active users and over 50 million consumer subscribers. In addition, over 9 million paying business users rely on the platform, with February 2026 showing record numbers in the company’s history in response to the new investment.</p><!--/$--><!--$--><p class=\"block core-block\">The company is projecting a figure of over $280 billion in total revenue by 2030, roughly split between consumer and enterprise businesses. OpenAI also expects approximately $600 billion in total compute spend by 2030, and this again illustrates the enormous capital required to achieve AGI.</p><!--/$--><!--$--><p class=\"block core-block\">Despite all this, OpenAI clarified that there might not be a return on investment until 2030; thus, the partners are betting on a company that is currently losing money.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">What This Means for the AI Ecosystem</h2><!--/$--><!--$--><p class=\"block core-block\">The investment involves multiple strategic partnerships that are capable of not just disrupting the AI infrastructure but also altering its market dynamics.</p><!--/$--><!--$--><p class=\"block core-block\">With this development, Amazon now has a cloud infrastructure partner that helps it speed up its AI product pipeline, while NVIDIA can attract large customers for its future-generation chips. Similarly, this enables SoftBank to expand its AI technologies ahead of what many see as a generation-defining shift in the industry. </p><!--/$--><!--$--><p class=\"block core-block\">This deal comes at a time when OpenAI is facing its toughest competition since its inception. Google's Gemini is quickly becoming the go-to option for consumers, whereas Anthropic is what business enterprises prefer. OpenAI is fighting back by speeding up both its research and its sales efforts.</p><!--/$--><!--$--><p class=\"block core-block\">Altman captured the urgency in a statement on Friday: </p><!--/$--><!--$--><p class=\"block core-block\">“<em>We are entering a new phase where frontier AI moves from research into daily use at a global scale. Leadership will be defined by who can scale infrastructure fast enough to meet demand, and turn that capacity into products people rely on.</em>“</p><!--/$--><!--$--><p class=\"block core-block\">He added that the funding will not compromise the company’s existing partnership with Microsoft. Microsoft Azure remains the sole provider of cloud services for OpenAI's APIs and first-party products, with no changes to its intellectual property arrangements.</p><!--/$--><!--$--><p class=\"block core-block\">With $110 billion freshly committed, an IPO possibly on the horizon, and three tech giants on its side, OpenAI is making a bold statement that it is well-positioned to win the race to AGI.</p><!--/$--><!--$--><p class=\"block core-block\"><strong><em>Benzinga Disclaimer: This article is from an unpaid external contributor. It does not represent Benzinga’s reporting and has not been edited for content or accuracy.</em></strong></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50944718\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "",
            "link": "https://www.benzinga.com/Opinion/26/02/50944718/openai-lines-up-110-billion-in-private-round-what-is-driving-the-long-term-bet",
            "pub_date": "2026-02-28 04:29:59",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        }
    ]
}