{
    "data": [
        {
            "id": "69a3a287f2604c0001f4cad5",
            "title": "Iran&#39;s Supreme Leader Ayatollah Ali Khamenei Killed, State Media Confirms",
            "description": "<div><div class=\"sc-iViryI frOthR\"><!--$--><p class=\"block core-block\">Hours after Israeli officials said Iran's Supreme Leader <strong>Ayatollah Ali Khamenei</strong> was killed in strikes, Iran's state media confirmed the death of the leader.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\"><strong>State Media Confirms Khamenei's Death</strong></h2><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">Khamenei's death was also announced by President <strong>Donald Trump</strong> on Truth Social, calling him \"one of the most evil people in history.\"</p><!--/$--><!--$--><p class=\"block core-block\">State media confirmed the death of the 86-year-old Supreme Leader on Saturday.</p><!--/$--><!--$--><p class=\"block core-block\">“We have lost a great leader and we are mourning him, a leader who was unique in in terms of purity of spirit, strength of faith, resourcefulness in affairs, courage in the face of the arrogant, and jihad in the path of God”, a statement from Iran’s Revolutionary Guards said, according to a Reuters report.</p><!--/$--><!--$--><div class=\"sc-BjUjF epByxC\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\"><strong>Mourning Period Announced</strong></h2><!--/$--><!--$--><p class=\"block core-block\">Khamenei, according to state media, was \"carrying out his assigned duties\" at his office. The attack, according to the report, \"occurred in the early hours of Saturday morning.\"</p><!--/$--><!--$--><p class=\"block core-block\">Tehran has announced a 40-day public mourning period, as per state media.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\"><strong>Trump Says Bombing To Continue</strong></h2><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">Trump, in his Truth Social post said that \"heavy and pinpoint\" bombing will continue in Iran \"uninterrupted throughout the week\" or as long as necessary to achieve \"peace\" in the Middle East.</p><!--/$--><!--$--><p class=\"block core-block\"><em>Photo courtesy: FotoField / Shutterstock.com</em></p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50953582\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/28/Ayatollah-Ali-Khamenei.jpeg",
            "link": "https://www.benzinga.com/news/politics/26/02/50953582/irans-supreme-leader-ayatollah-ali-khamenei-killed-state-media-confirms",
            "pub_date": "2026-03-01 10:20:58",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a38fdaf2604c0001f4ca85",
            "title": "They Planned To Crush Their Mortgage With Extra Payments. Suddenly, He Wants To Redirect The Money Into Crypto. &#39;He Has A Friend Who&#39;s In On It&#39;",
            "description": "<div><div class=\"sc-iViryI frOthR\"><!--$--><p class=\"block core-block\">A couple in Indianapolis thought they had a straightforward plan: work hard, throw every extra dollar at the house and be mortgage-free in six years.</p><!--/$--><!--$--><p class=\"block core-block\">Now that plan is under pressure.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">Monica called “<a href=\"https://youtu.be/qQQ2LsAoS2E?si=YJNzGMVf2_Ru4os-&amp;t=1299\" target=\"_blank\">The Ramsey Show</a>” about a disagreement over redirecting their extra mortgage payments into crypto. She and her husband both work full-time. He also works a part-time job, and until now, that second paycheck has gone straight toward extra principal payments. They owe about $244,000 on their home and have been paying double, $4,800 a month, to speed things up.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>Don't Miss:</strong></p><!--/$--><!--$--><ul class=\"wp-block-list\">\n<li><strong><a href=\"https://www.benzinga.com/money/paladin-power-storage\" target=\"_blank\">This Energy Storage Company Already Has $185M in Contracts—Shares Are Still Available</a></strong></li>\n<li><strong>Before the IPO: <a href=\"https://www.benzinga.com/money/elf-labs-ip\" target=\"_blank\"><strong>How One Company Quietly Locked Up 500+ Iconic Character Rights</strong></a></strong></li>\n</ul><!--/$--><!--$--><div class=\"sc-BjUjF epByxC\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">A Sudden Pivot Toward Crypto</h2><!--/$--><!--$--><p class=\"block core-block\">But starting in March, her husband wants to redirect the part-time income into cryptocurrency.</p><!--/$--><!--$--><p class=\"block core-block\">“He has a friend who’s in on it,” Monica said, explaining that the friend claims to have been “very successful” recently.</p><!--/$--><!--$--><p class=\"block core-block\">That shift has created tension at home.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">Monica said she worries about being controlling. She grew up in a household where her mother “wore the pants,” and she doesn't want to repeat that dynamic. Still, she feels uneasy abandoning a plan they made together.</p><!--/$--><!--$--><p class=\"block core-block\">Co-host <strong>George Kamel</strong> didn't hesitate. “You’re not being controlling,” he told her. “If my wife said, ‘Hey, I know we got debt to pay down. I’m going to go gamble in Vegas instead. Are you okay with that?’ I think it’s wise as a spouse to say, ‘That’s not a good idea.'”</p><!--/$--><!--$--><p class=\"block core-block\">Kamel pointed out that paying down a mortgage offers a guaranteed return equal to the interest rate. Crypto, on the other hand, <a href=\"https://www.benzinga.com/crypto/cryptocurrency/26/02/50746507/bitcoin-fears-mount-peter-schiff-warns-of-84-crash-scenario\" target=\"_blank\">is volatile</a>. “There is a guaranteed outcome of paying down your mortgage,” he said.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>Trending: This Under-$1 Pre-IPO AI Company Is Still Open to Retail Investors —<a href=\"https://www.benzinga.com/money/immersed\" target=\"_blank\"><strong> Learn More</strong></a></strong></p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">Co-host <strong>John Delony</strong> pushed the conversation deeper. “This is not about crypto,” he said. He suggested the real issue may be fear of missing out, pride or a desire to speed up the six-year payoff timeline.</p><!--/$--><!--$--><p class=\"block core-block\">Monica agreed that her husband likely sees crypto as a shortcut. If it jumps in value, they could wipe out the mortgage faster.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">Security First, Speculation Later</h2><!--/$--><!--$--><p class=\"block core-block\">The hosts warned about what can happen when risk tolerance shifts. Delony shared a story of another caller whose spouse secretly <a href=\"https://www.benzinga.com/personal-finance/management/26/02/50621475/her-husband-borrowed-250k-against-the-family-home-to-buy-crypto-she-says-he-lost-it-all-after-accidentally-pressing-sell-short\" target=\"_blank\">borrowed $250,000 against their home</a> and lost it in crypto.</p><!--/$--><!--$--><p class=\"block core-block\">“Wealth gained hastily will dwindle, but whoever gathers little by little will increase it,” Kamel said, quoting Proverbs 13:11.</p><!--/$--><!--$--><div class=\"nativo-placement-in-content-ap\"></div><!--/$--><!--$--><p class=\"block core-block\">Their broader point was about order. Eliminate existential risks first–the house, the cars, the basics. Then take calculated risks with money you can afford to lose.</p><!--/$--><!--$--><p class=\"block core-block\">They even offered a compromise: pay off the house, invest 15% into retirement and build up cash reserves. After that, if he wants to buy crypto with a set amount, go for it.</p><!--/$--><!--$--><p class=\"block core-block\">“Nobody calls in saying, ‘Oh my gosh, worst decision of our life. We are deeply in debt,'” Kamel said of people who paid off their homes. “They’re debt-free.”</p><!--/$--><!--$--><!--/$--><!--$--><p class=\"block core-block\">For couples who want growth without extreme swings, there are other options. <a href=\"https://benzingapartners.go2cloud.org/aff_c?offer_id=705&amp;aff_id=1\" target=\"_blank\">Motley Fool Asset Management's</a> newest factor ETF offerings are the focus for investors looking for balance. </p><!--/$--><!--$--><p class=\"block core-block\">Each passive ETF offers a growth-oriented alternative to broad index funds, allowing investors to diversify their portfolio based on their investment goals. The funds are composed of U.S. companies vetted and rated by analysts. That approach will appeal to people who want market exposure without betting on a single volatile asset.</p><!--/$--><!--$--><p class=\"block core-block\">In the end, Monica's situation isn't just about crypto. It's about alignment.</p><!--/$--><!--$--><p class=\"block core-block\">She values stability and the peace that comes with owning a home outright. Her husband appears to value speed and the possibility of a big upside.</p><!--/$--><!--$--><p class=\"block core-block\">The hard part won't be predicting the next crypto cycle. It will be getting on the same page about what financial freedom actually means.</p><!--/$--><!--$--><!--/$--><!--$--><p class=\"block core-block\"><strong><em>Image: Shutterstock</em></strong></p><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/28/Lock-In-Effect-Still-Limits-Supply.jpeg",
            "link": "https://www.benzinga.com/personal-finance/management/26/02/50953498/they-planned-to-crush-their-mortgage-with-extra-payments-suddenly-he-wants-to-redirect-the-money-into-crypto-he-has-a-friend-whos-in-on-it",
            "pub_date": "2026-03-01 09:01:18",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a35e3ff2604c0001f4c9bf",
            "title": "Khamenei Killed In Israeli Strike on Compound",
            "description": "<div><div class=\"sc-iViryI frOthR\"><!--$--><p class=\"block core-block\">On Saturday, Israeli officials said Iranian Supreme Leader Ayatollah<strong> Ali Khamenei</strong> was killed after an Israeli airstrike hit his compound in Tehran, a development that could accelerate a power struggle inside the Islamic Republic and reshape Tehran's regional posture. The news lands as <a href=\"https://www.benzinga.com/markets/market-summary/26/02/50953084/us-israel-military-strikes-on-iran-threaten-oil-supply-markets-brace-for-volatility\" target=\"_blank\">U.S. Israel strikes</a> have also targeted Iran's leadership and military infrastructure, with President <strong>Donald Trump</strong> describing \"major combat operations\" designed to curb Tehran's missile program and its network of armed partners across the Middle East.</p><!--/$--><!--$--><p class=\"block core-block\">Fox News <a href=\"https://www.foxnews.com/world/irans-supreme-leader-ali-khamenei-dead-after-idf-strike-hits-tehran-compound-israeli-source-confirms\" target=\"_blank\">reports</a> a senior Israeli official told the outlet that the strike left Khamenei's compound in ruins and that the leader died after the attack. The report also quoted Foundation for Defense of Democracies Iran program senior director <strong>Behnam Ben Taleblu</strong> calling Khamenei an ideologue who prioritized protecting his project through calculated risk-taking.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">Khamenei's decades-long rule shaped Iran's internal security model and its approach to projecting force abroad, including financing and directing allied armed groups. The same proxy strategy became central to the U.S. rationale for the weekend's campaign, with Trump saying the objective included dismantling Tehran's missile capabilities and its proxy network.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">Larijani’s Role Amid Rising Geopolitical Tensions</h2><!--/$--><!--$--><p class=\"block core-block\">Khamenei had previously elevated <strong>Ali Larijani</strong> to a de facto crisis manager role, anticipating potential clashes with the U.S. and intensifying internal state management. </p><!--/$--><!--$--><div class=\"sc-BjUjF epByxC\"></div><!--/$--><!--$--><p class=\"block core-block\">Larijani’s expanded responsibilities include overseeing nuclear discussions and coordinating with partners like Russia, reflecting a broader strategy to maintain stability under pressure. </p><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">The Impact Of Khamenei’s Death On Oil Prices</h2><!--/$--><!--$--><p class=\"block core-block\">Energy markets were already on edge after Saturday's U.S.-Israel strikes raised fears of disruptions near the Strait of Hormuz, a corridor that carries about 20% of global oil supply. Some major oil companies and trading houses paused crude and refined-product movements through the passage following the attacks.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">By Friday, Brent crude settled near $73 a barrel and was up about 20% in 2026. Capital Economics economist <strong>William Jackson</strong> wrote that even if the fighting stays limited, Brent could drift toward $80, while a longer supply shock could push prices toward $100 and add roughly 0.6 to 0.7 percentage points to global inflation.</p><!--/$--><!--$--><p class=\"block core-block\">Khamenei's legacy also includes the architecture he built to keep the system functioning beyond any single leader, including the Office of the Supreme Leader, known as the Bayt. </p><!--/$--><!--$--><h2 class=\"wp-block-heading\">Will Geopolitical Tensions Spark A Market Crash?</h2><!--/$--><!--$--><p class=\"block core-block\">Investors were also watching broader risk gauges that have been jumpy in 2026, including tariff-driven turbulence and a sharp tech selloff. The VIX volatility index is up about a third this year, while the MOVE index tied to U.S. rates volatility has gained about 15%.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">Currency traders have been weighing how an oil shock could shift flows into perceived havens, with analysts at Commonwealth Bank of Australia noting the dollar slipped about 1% during last June's conflict before rebounding within days. They also said a longer fight that constrains supply could support the dollar against most peers, while the yen and Swiss franc could hold up better, reports the outlet. </p><!--/$--><!--$--><p class=\"block core-block\">Khamenei's tenure was marked by repeated crackdowns on dissent, including mass unrest in 2009 and in 2022 after <strong>Mahsa Amini</strong> died in custody, according to Fox News. The outlet also cited an Iran International investigation estimating as many as 30,000 people may have been killed over two days, Jan. 8 to 9, 2026, during another wave of protests and security response.</p><!--/$--><!--$--><p class=\"block core-block\">International monitors have documented elevated execution levels, with Amnesty International saying Iranian authorities carried out more than 1,000 executions in 2025, while a U.N. report put 2024 executions at at least 975, the outlet reported. Those domestic controls underpinned Khamenei's ability to sustain confrontations abroad, even as Israel targeted senior figures around him during a 12-day war in June 2025.</p><!--/$--><!--$--><div class=\"nativo-placement-in-content-ap\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">Exiled Crown Prince of Iran Reza Pahlavi’s Response</h2><!--/$--><!--$--><p class=\"block core-block\">Iran's exiled crown prince <strong>Reza Pahlavi</strong>, the son of Iran's last Shah, hailed the joint U.S.–Israeli strikes on Iran as a historic turning point, asserting that the Islamic Republic is \"on the verge of collapse.\"</p><!--/$--><!--$--><p class=\"block core-block\">Pahlavi, who has been based in the United States since leaving Iran during the 1979 revolution, called on citizens to withdraw their support from the ruling establishment.</p><!--/$--><!--$--><p class=\"block core-block\">In a message posted X, he described the developments as a defining moment for the country's future. </p><!--/$--><!--$--><!--/$--><!--$--><p class=\"block core-block\">He said the assistance pledged by the U.S. president to the Iranian people had now materialized, characterizing the action as a humanitarian effort aimed at dismantling the regime's repressive institutions rather than harming the Iranian nation itself.</p><!--/$--><!--$--><p class=\"block core-block\">Image: Shutterstock/FotoField</p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50953296\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/28/A-Portrait-Of-Ayatollah-Ali-Khamenei--Th.jpeg",
            "link": "https://www.benzinga.com/news/politics/26/02/50953296/khamenei-killed-in-israeli-strike-on-compound",
            "pub_date": "2026-03-01 05:29:39",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a35cecf2604c0001f4c9b3",
            "title": "CIA Warns Iran&#39;s IRGC Might Maintain Power Despite Khamenei&#39;s Removal",
            "description": "<div><div class=\"sc-iViryI frOthR\"><!--$--><p class=\"block core-block\">On Saturday, the U.S. Central Intelligence Agency weighed scenarios in which the U.S. and Israeli strikes on Iran could still leave the country led by hardline Islamic Revolutionary Guard Corps figures even if Supreme Leader <strong>Ayatollah Ali Khamenei</strong> were removed, according to people briefed on the intelligence.</p><!--/$--><!--$--><p class=\"block core-block\">That risk is colliding with immediate market concerns after the assault jolted energy trading and put the Strait of Hormuz—through which roughly 20% of global oil supply moves—at the center of <a href=\"https://www.benzinga.com/markets/market-summary/26/02/50953084/us-israel-military-strikes-on-iran-threaten-oil-supply-markets-brace-for-volatility\" target=\"_blank\">oil supply fears</a>.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">As <a href=\"https://www.reuters.com/world/middle-east/prior-iran-attacks-cia-assessed-khamenei-would-be-replaced-by-hardline-irgc-2026-02-28/\" target=\"_blank\">per </a>Reuters, the CIA's work product, drafted over the past two weeks, did not pick a single outcome as most likely and instead mapped multiple paths for Iran after a U.S. intervention.</p><!--/$--><!--$--><p class=\"block core-block\">One of those paths, people familiar with the assessments said, involved IRGC-linked figures stepping into power, a shift that would keep Iran's security apparatus at the core of the state.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">Energy Markets Brace For Supply Disruption</h2><!--/$--><!--$--><p class=\"block core-block\">Oil traders were already focused on the chokepoint risk because Iran sits opposite key Gulf producers at Hormuz, and any widening conflict could interrupt tanker traffic.</p><!--/$--><!--$--><div class=\"sc-BjUjF epByxC\"></div><!--/$--><!--$--><p class=\"block core-block\">Some large oil companies and major trading firms paused crude and refined-product movements through the corridor after the strikes, tightening near-term supply logistics.</p><!--/$--><!--$--><p class=\"block core-block\">Brent crude settled near $73 a barrel on Friday and was up about 20% for the year before the weekend escalation, leaving prices elevated heading into the next trading sessions.</p><!--/$--><!--$--><p class=\"block core-block\">Capital Economics economist <strong>William Jackson</strong> wrote that even if fighting stays limited, Brent could drift toward $80, while a more severe disruption could push it toward $100.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">Jackson also estimated a prolonged supply hit could add roughly 0.6 to 0.7 percentage points to global inflation, a concern for central banks already watching sticky price pressures.</p><!--/$--><!--$--><p class=\"block core-block\">In Singapore, OCBC strategist <strong>Christopher Wong</strong> told Reuters, The strike raises geopolitical risk premia as markets head into Mondays open, and he flagged potential upside gaps for gold alongside firmer oil.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">Could Military Strikes Ignite A Regime Change?</h2><!--/$--><!--$--><p class=\"block core-block\">The CIA's scenario planning examined how military action might—or might not—translate into leadership change inside the Islamic Republic, with the IRGC viewed as a potential beneficiary of turmoil.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">As reported by Reuters, the agency's analysis was shared in the run-up to Saturday's operation and was framed as a range of possibilities rather than a forecast.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>Donald Trump</strong> has publicly signaled interest in a different government in Tehran, while not laying out who Washington sees as a viable successor leadership.</p><!--/$--><!--$--><p class=\"block core-block\">Inside the U.S. government, the decision to strike followed weeks of debate after deadly protests that erupted in Iran in December.</p><!--/$--><!--$--><p class=\"block core-block\">U.S. officials also pursued nuclear diplomacy in parallel, but talks in Geneva did not produce an agreement.</p><!--/$--><!--$--><div class=\"nativo-placement-in-content-ap\"></div><!--/$--><!--$--><p class=\"block core-block\">During a briefing to the congressional \"Gang of Eight\" last week, Secretary of State <strong>Marco Rubio</strong> indicated that an operation was probable, while emphasizing that Trump retained the option to step back should negotiations prove successful.</p><!--/$--><!--$--><p class=\"block core-block\">As per the outlet, two people familiar with the matter said Rubio updated the group again on Friday night, signaling the attack could begin within hours even as Trump retained discretion to halt it.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">Strategic Leadership Shift Amid Rising Tensions</h2><!--/$--><!--$--><p class=\"block core-block\"><a href=\"https://www.benzinga.com/news/politics/26/02/50770865/irans-khamenei-elevates-larijani-as-prospects-of-war-with-us-grow\" target=\"_blank\">This context is underscored by</a> Ayatollah Ali Khamenei’s recent elevation of Ali Larijani to a de facto crisis manager role, as Iran prepares for potential conflict with the U.S., which has raised the stakes for negotiations surrounding a nuclear deal. </p><!--/$--><!--$--><p class=\"block core-block\">With President Donald Trump issuing a 10-to-15-day ultimatum for a resolution, heightened military readiness and internal governance strategies are being employed to maintain stability amid escalating tensions.</p><!--/$--><!--$--><p class=\"block core-block\">Larijani’s new position as head of Iran’s Supreme National Security Council, which includes directing crackdowns on dissent and coordinating with international allies, reflects a significant shift in leadership dynamics that could influence Iran’s response to U.S. military actions. </p><!--/$--><!--$--><p class=\"block core-block\">This backdrop amplifies the geopolitical risk for energy markets, particularly as oil prices surge on fears of disruptions in the Strait of Hormuz, a critical shipping route.</p><!--/$--><!--$--><div class=\"bz-optimizely-campaign bz-optimizely-campaign-bottom-50953284\" data-nosnippet=\"true\"></div><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/28/Iran-Insists-It-Wont-Build-Nukes.jpeg",
            "link": "https://www.benzinga.com/news/politics/26/02/50953284/cia-warns-irans-irgc-might-maintain-power-despite-khameneis-removal",
            "pub_date": "2026-03-01 05:23:59",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "69a35783f2604c0001f4c9a5",
            "title": "&#39;Plumber Is Going To Make More Money Than A Doctor,&#39; Says Grant Cardone. He Predicts Blue-Collar Pay Hits $350K A Year…&#39;Until The Robots Come&#39;",
            "description": "<div><div class=\"sc-iViryI frOthR\"><!--$--><p class=\"block core-block\">Everyone keeps asking the <a href=\"https://www.benzinga.com/startups/25/02/43679965/klarnas-ceo-says-ai-can-already-do-all-the-jobs-that-we-as-humans-do-and-hes-proving-it-by-shrinking-his-workforce-by-22\" target=\"_blank\">same question about artificial intelligence</a>: which jobs are actually safe?</p><!--/$--><!--$--><p class=\"block core-block\">On a recent interview on the <a href=\"https://www.youtube.com/watch?v=3YENqzvBQz8\" target=\"_blank\">\"Wealthy Way Podcast\"</a> with host Ryan Pineda, real estate investor Grant Cardone did not talk about coders or consultants. He went straight to plumbers.</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">\"I mean, the future is going to be plumbers, roofers, HVAC, uh, guys doing siding, construction,\" Cardone said.</p><!--/$--><!--$--><p class=\"block core-block\">Then he attached a number.</p><!--/$--><!--$--><p class=\"block core-block\">\"Well, those guys are going to make 350 grand a year. The the plumber is going to make more money than a doctor in the future.\"</p><!--/$--><!--$--><p class=\"block core-block\">It was not framed as permanent immunity from automation. It was a timing call.</p><!--/$--><!--$--><p class=\"block core-block\"><strong>Don't Miss:</strong></p><!--/$--><!--$--><ul class=\"wp-block-list\">\n<li><strong>Wall Street's $12B Real Estate Manager Is Opening Its Doors to Individual Investors — <a href=\"https://www.benzinga.com/money/lightstone\" target=\"_blank\"><strong>Without the Crowdfunding Middlemen</strong></a></strong></li>\n<li><strong>1.5 Million Users Are Already Working Inside This AI Platform — <a href=\"https://www.benzinga.com/money/immersed\" target=\"_blank\"><strong>Investors Can Still Get In</strong></a></strong></li>\n</ul><!--/$--><!--$--><div class=\"sc-BjUjF epByxC\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">The Shortage Before The Software</h2><!--/$--><!--$--><p class=\"block core-block\">Cardone says that <a href=\"https://www.benzinga.com/markets/tech/26/02/50472991/filterbuy-ceo-david-heacock-says-ais-biggest-economic-impact-will-hit-blue-collar-industries-not-silicon-valley\" target=\"_blank\">skilled trades</a> are headed for a pay surge because of simple supply and demand.</p><!--/$--><!--$--><p class=\"block core-block\">\"I think blue-collar is going to get a big swing and they're going to make a bunch of money because there's going to be a shortage. You're just not going to be able to get enough plumbers.\"</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><p class=\"block core-block\">The premise is straightforward. Pipes still burst. HVAC systems still fail. Roofs still leak. If fewer workers enter those fields while demand remains steady, pricing power rises.</p><!--/$--><!--$--><p class=\"block core-block\">He added a caveat.</p><!--/$--><!--$--><p class=\"block core-block\">\"Until the robots come.\"</p><!--/$--><!--$--><div class=\"min-w-[300px] w-[300px] min-h-[250px] raptive-ad-placement mx-auto overflow-hidden min-w-[300px]\"></div><!--/$--><!--$--><h2 class=\"wp-block-heading\">Robots In The House Before The Job Site</h2><!--/$--><!--$--><p class=\"block core-block\">When asked whether robots will eventually handle those jobs, Cardone said yes — just not immediately.</p><!--/$--><!--$--><p class=\"block core-block\">\"Yeah, I think they will. Yeah, but not tomorrow.\"</p><!--/$--><!--$--><p class=\"block core-block\"><strong>Trending: <a href=\"https://www.benzinga.com/money/valley-wellness\" target=\"_blank\"><strong>Own a Stake in California's New Standard for Luxury Behavioral Health</strong></a></strong></p><!--/$--><!--$--><p class=\"block core-block\">He predicted robotics will show up inside homes before they dominate construction sites.</p><!--/$--><!--$--><p class=\"block core-block\">\"I think robots are going to <a href=\"https://www.benzinga.com/news/topics/25/08/47121576/elon-musk-says-everyone-will-want-their-own-personal-robot-that-can-mow-the-yard-or-babysit-priced-at-30k-he-thinks-anyone-could-afford-one\" target=\"_blank\">robots are going to assist you in your home</a> before they they they they build buildings,\" he said.</p><!--/$--><!--$--><p class=\"block core-block\">Then he described what that could look like personally.</p><!--/$--><!--$--><div class=\"nativo-placement-in-content-ap\"></div><!--/$--><!--$--><p class=\"block core-block\">\"And I think that I'll have two at least two robots at my house, maybe three. I'll have one doing the landscaping,\" he said on the podcast. \"I'll have one doing the the the in interior stuff cleaning 24/7. They're going to be cleaning while I'm sleeping.\"</p><!--/$--><!--$--><p class=\"block core-block\">In that timeline, AI starts as assistance. Replacement comes later.</p><!--/$--><!--$--><h2 class=\"wp-block-heading\">The Two Investment Lanes</h2><!--/$--><!--$--><p class=\"block core-block\">Taken together, Cardone's comments outline two very different money plays.</p><!--/$--><!--$--><p class=\"block core-block\">The first is near term. If skilled trades face labor shortages, wages and service margins could rise. Investors might look at established trade businesses or service companies positioned to benefit from pricing power.</p><!--/$--><!--$--><!--/$--><!--$?--><template id=\"B:2\"></template><div></div><!--/$--><!--$--><p class=\"block core-block\">For investors convinced that household robots and AI-assisted services are inevitable, exposure to <a href=\"https://benzingapartners.go2cloud.org/aff_c?offer_id=727&amp;aff_id=1\" target=\"_blank\">emerging companies in that space</a> represents a different kind of bet.</p><!--/$--><!--$--><p class=\"block core-block\">Cardone's forecast is less about plumbers versus doctors and more about sequencing. Skilled trades may command higher pay while labor remains scarce. Meanwhile, AI developers are building the systems that could eventually change how those trades operate.</p><!--/$--><!--$--><p class=\"block core-block\">The robots may not be installing sinks tomorrow. But if his timeline proves accurate, they might be mowing lawns while the plumber invoices at $350,000 a year — and capital will already be positioned ahead of the shift.</p><!--/$--><!--$--><!--/$--><!--$--><p class=\"block core-block\"><em><strong>Image: Shutterstock</strong></em></p><!--/$--></div></div>",
            "image": "https://www.benzinga.com/files/images/story/2026/02/28/Professional-Plumber-Checking-Drain-Pipe.jpeg",
            "link": "https://www.benzinga.com/news/topics/26/02/50953271/plumber-is-going-to-make-more-money-than-a-doctor-says-grant-cardone-he-predicts-blue-collar-pay-hits-350k-a-yearuntil-the-robots-come",
            "pub_date": "2026-03-01 05:00:54",
            "source": "benzinga",
            "kind": 1,
            "language": "en"
        }
    ]
}