{
    "data": [
        {
            "title": "Decree moves to restore order to gold market",
            "description": "<div id=\"abody\">\n<p><i>Compiled by Vũ Hoa</i></p><p>Việt Nam’s newly issued Decree 340e/2025/NĐ-CP on gold trading management is being hailed by experts as a necessary step to restore order in the precious metals market, even as misinformation about the law has triggered public unease and stirred an unexpected surge in silver demand.</p><p>Over the past week, domestic gold prices experienced dramatic volatility. SJC gold bars briefly climbed to historic highs near VNĐ190–191 million (US$7,260–$7,340) per tael before retreating sharply, ending the week around VNĐ169–172 million ($6,480–$6,620) per tael amid strong profit-taking and global market adjustments. That marked a swing of more than VNĐ20 million per tael in just two days, one of the steepest short-term drops in recent memory.</p><p>Silver surged alongside gold earlier in the week, with some domestic silver products outpacing gold’s gains on a percentage basis. Certain sterling silver bars reached over VNĐ4 million per tael and above VNĐ100 million per kilogram, reflecting double-digit weekly gains before easing slightly as prices corrected.</p><p>Against this backdrop of wild price swings, social media platforms have also seen a flood of unverified claims that authorities might confiscate gold without invoices, fuelling fear and confusion among retail investors.</p><p>However, specialists say such rumours are completely false and legally baseless.</p><p>A long-time monetary policy observer from Đa Phương Law Firm said Decree 340 is designed to combat ‘goldisation’ of the economy, rein in smuggling and profiteering, and re-establish transparency in the gold market.</p><p>“Decree 340/2025/NĐ-CP does not target lawful assets held by citizens,” the expert said.</p><p>“Confiscation provisions apply only to unlicensed production or trading of gold bars, illegal import/export of gold materials and bullion, and business activities without proper licences – acts that harm the economy.”</p><p>The specialist also highlighted that spreading false information could be subject to penalties under the Law on Cybersecurity, urging investors to rely on official sources from the Government and the State Bank of Vietnam.</p><p>As gold prices soared then plunged, many retail buyers shifted interest to silver, seen as a more accessible store of value amid tightening gold supplies and elevated prices.</p><p>On Trần Nhân Tông Street in Hà Nội – long known as the capital’s 'gold street' – queues of buyers this week formed not for gold, but for silver bars.</p><p>Investors reported being unable to buy silver in the morning and learning in the afternoon that inventories had been exhausted, with some shops issuing appointment slips with delivery scheduled months out.</p><p>Chu Tuấn Long, a resident of Hà Nội, said he purchased about 21 kilogrammes of silver two weeks ago when prices were around VNĐ90 million per kilo, but now supply is scarce amidst high demand.</p><p>Financial analyst Lưu Điển said the price movements reflect a classic “communicating vessels” effect.</p><p>“When the traditional safe-haven channel – gold is tightened by regulation and priced at extreme highs, money flows to silver. Silver’s smaller denominations and liquidity make it easier for retail investors,” he said.</p><p>Yet he warned that part of the surge appears driven by fear of missing out, and that chasing silver after its recent rally carries short-term correction risks. He also noted that the buy–sell spreads remain wide, making active trading less attractive for quick gains without a long holding horizon.</p><p><b>Call for calm and diversification</b></p><p>Authorities and market watchers are urging investors to remain calm, avoid misinformation, and make purchases only at licensed outlets with fully documented invoices – described by experts as the best legal protection for asset ownership.</p><p>“Documentation is your best legal protection,” one analyst said.</p><p>Observers suggest that regulators should expand public communication about Decree 340 and improve the flow of legitimate gold and silver supply to meet genuine demand, rather than allow artificial scarcity to fuel irrational price spikes.</p><p>In the meantime, financial advisers are reminding investors not to 'put all their eggs in one basket' amid precious metal market turbulence. Alternatives like bank deposits or fundamentally sound equities may offer more stable avenues in a volatile environment.</p><p>For now, Decree 340 is being seen as a tool to clean up the gold market, and the notable shift toward silver appears to be a natural market reaction. What investors need most, experts say, is a cool head and reliable information so they do not become casualties of short-term price fever. — VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1764964/decree-moves-to-restore-order-to-gold-market.html",
            "pub_date": "2026-02-02 10:03:10",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Digging deep for growth while keeping the planet in mind",
            "description": "<div id=\"abody\">\n<p>Compiled by Vũ Hoa</p><p>HÀ NỘI — Việt Nam’s mining industry is entering a pivotal stage as the drive for economic development increasingly goes hand in hand with environmental protection and social welfare.</p><p>With the Law on Geology and Minerals 2024 coming into effect on July 1, 2025, the sector is expected to enter a new era of transparency, efficiency and sustainability. Yet experts stress that for the law to become an effective management tool, it requires collective commitment from regulators, enterprises and the community.</p><p>According to the Department of Geology and Minerals of Việt Nam, the new law serves as the highest legal framework governing all geological and mineral activities. It embodies the Party and State’s stance on managing, exploiting and utilising resources efficiently and economically, providing a strategic foundation for long-term industry development.</p><p>One of its key breakthroughs is the clearer classification of minerals and the introduction of integrated strategic planning. Significantly, it also decentralises power to localities in licensing and oversight, helping to shorten administrative procedures and enhance the accountability of local governments.</p><p><b>Rising compliance costs</b></p><p>While the law is seen as a solid legal basis, challenges remain on the ground. Chief among them are compliance costs, particularly for small- and medium-sized enterprises (SMEs).</p><p>CEO of Thạch Nhất Co Ltd Nguyễn Lộc R said businesses supported the stricter provisions on environmental standards, safety and planning.</p><p>“In principle, we welcome these regulations. But in practice, investing in waste treatment technology and modern machinery to meet the new standards requires significant capital that is beyond the capacity of most SMEs,” he said.</p><p>Many firms are left with the stark choice of taking out loans to upgrade or risk being pushed out of the market. While decentralisation is a positive step, administrative procedures remain complicated, and re-licensing older projects under the new law could present a major hurdle, according to Lộc.</p><p>“We hope the Government will introduce supportive policies or flexible transition mechanisms to give businesses sufficient time and resources to adapt,” Lộc said.</p><p>From a community perspective, the law must also deliver genuine transparency.</p><p>Nguyễn Thị Hiên, a resident of Đông Hải Commune in the north-eastern province of Quảng Ninh, said: “The law mentions environmental protection, but what we really want is meaningful participation in monitoring — from the initial environmental impact assessment to the operational phase.</p><p>\"There must be transparent, public mechanisms for communities to access information and raise timely concerns. Otherwise, there is a risk of projects being pushed through without proper oversight, as has happened before.”</p><p>From a scientific and legal standpoint, experts argue that consistency across laws is crucial.</p><p>Dr Phan Tùng Lâm from the Việt Nam–China International Commercial Arbitration Centre pointed out that the biggest challenge would lie in aligning the new law with other regulations, such as the Land Law, Environmental Protection Law and investment and construction rules.</p><p>“Overlaps and contradictions between legal documents can create loopholes in management and barriers for businesses,” he said. “A project might be licensed for mining but then face obstacles in land-use conversion or environmental compliance. The core issue is to establish effective inter-sectoral co-ordination, with detailed and coherent guiding regulations to ensure alignment.”</p><p>The need for effective governance is heightened by Việt Nam’s significant mineral potential. The country is home to an estimated 3.05 billion tonnes of bauxite in the Central Highlands, 2.6 billion tonnes of apatite in Lào Cai, and over 40 billion tonnes of limestone alongside 7 billion tonnes of clay for cement production. It also boasts substantial deposits of nickel (3.6 million tonnes), tungsten (100,000 tonnes, the third-largest globally), as well as lithium reserves in Quảng Ngãi and about 25 tonnes of gold.</p><p>Such resources could provide a powerful engine for growth — if managed in a way that balances economic, social and environmental interests.</p><p>Most experts and stakeholders agree that the law will only be effective if there is close co-ordination across government, business and society.</p><p>The State must refine institutions, issue clear technical standards and strengthen local management capacity. Enterprises, in turn, need to treat environmental protection as a non-negotiable obligation alongside social responsibility. Meanwhile, the media and local communities can play a vital role in ensuring transparency and accountability.</p><p>This collaboration should go beyond principle and take shape through specific mechanisms, such as community participation in project appraisal, open access to monitoring data, regular drills for incident response and public disclosure of violations and penalties.</p><p>The application of science and technology, particularly green solutions, will also be key to minimising impacts and restoring ecosystems after mining.</p><p>As Việt Nam moves forward, the Law on Geology and Minerals 2024 has the potential to become a true instrument of transparent governance, linking resource exploitation with environmental stewardship and long-term benefits for both the nation and its people. — VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1726147/digging-deep-for-growth-while-keeping-the-planet-in-mind.html",
            "pub_date": "2025-09-29 12:10:39",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "PPP incentives create strong momentum for tech enterprises",
            "description": "<div id=\"abody\">\n<p> </p><p><i><b>Compiled by Vũ Hoa</b></i></p><p>A growing wave of public–private partnership (PPP) initiatives in science, technology and digital transformation is opening up significant opportunities for technology enterprises, as Việt Nam strengthens its legal framework and introduces some of the most generous incentives yet for innovation-driven projects.</p><p>HCM City’s dynamic start-up ecosystem – ranked among the world’s top 110 and among Southeast Asia’s top five – reflects the country’s rising ambition to promote innovation as a new engine of growth. The momentum has been amplified since the Government issued Decree 180/2025/NĐ-CP in July, creating a dedicated framework for PPPs in science, technology, innovation and digital transformation.</p><p>This decree expands cooperation models beyond traditional PPP structures, allowing public assets, joint laboratories, digital platforms and research missions to be implemented through flexible partnerships between the State, businesses and research institutions.</p><p>The reforms coincide with broader amendments to the PPP Law in 2024 and 2025, which have widened the scope of PPP investment, streamlined procedures and strengthened risk-sharing mechanisms. Together, they form a coherent legal ecosystem aimed at helping Việt Nam mobilise around US$245 billion for major infrastructure and technology projects through 2030.</p><p>One of the most notable changes is the level of State participation. Science and technology PPPs are now eligible for exceptionally high proportions of public capital, ranging from one half to as much as 70 per cent of total investment, making them among the most generously supported PPP sectors in the country.</p><p>To accelerate deployment, these projects are also exempt from investment policy approval procedures, allowing investors to move directly to feasibility study preparation, appraisal and contracting. Investors are no longer required to establish separate project companies as long as project revenues and costs are independently recorded.</p><p>Risk sharing policies in the early years of operation have also been significantly improved. Tech-related PPP projects are not required to share revenue increases during their first three years. During this same period, if actual revenue falls below the approved financial plan, the State may cover the entire shortfall.</p><p>In addition, Decree 180 allows enterprises engaged in PPP projects to count double their actual research and development expenditures as deductible costs when calculating corporate income tax – an unprecedented tax incentive designed to encourage stronger private sector participation in high-tech fields.</p><p>These reforms have triggered a surge in interest across ministries and provinces. The Ministry of Finance has received proposals from nearly 10 ministries and over 20 localities, identifying close to 80 potential projects related to digital infrastructure, data platforms, artificial intelligence (AI), smart cities and co-operative innovation models.</p><p>Lào Cai and Cần Thơ have already introduced projects on digital education systems, AI-based student assessment, data exchange platforms and smart urban databases. Đà Nẵng is preparing a digital twin initiative for urban management, while major universities such as Hà Nội University of Science and Technology are designing PPP models that link Government, enterprises and research institutions.</p><p>According to Phạm Thy Hùng, deputy director of the Public Procurement Agency under the Ministry of Finance, the legal framework for PPPs is now largely complete, spanning laws, decrees and ministerial circulars. The ministry is working directly with provincial authorities and technology enterprises to refine project proposals and identify the most viable options. It is also preparing a detailed handbook guiding PPP procedures in science, technology and innovation, expected to be issued in January 2026.</p><p>Despite the favourable environment, many businesses are still awaiting further details on asset valuation, revenue-sharing formulas, output-based indicators for innovation projects and cost norms for new digital services. These clarifications, they say, will be essential for assessing investment opportunities with accuracy and confidence.</p><p>Deputy Minister of Finance Trần Quốc Phương emphasised that innovation has been identified as a strategic pillar of Việt Nam’s long-term development under Resolution 57-NQ/TW.</p><p>Although still emerging, fields like digital infrastructure, AI and PPPs between Government, enterprises and research institutions hold significant potential to generate breakthrough growth. He noted that Việt Nam aims to continue fostering creative PPP models that reflect global digital economy trends and support the country’s broader transformation goals. — VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1731311/ppp-incentives-create-strong-momentum-for-tech-enterprises.html",
            "pub_date": "2025-12-08 10:40:53",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Infrastructure bonds to become new capital pillar for national projects",
            "description": "<div id=\"abody\">\n<p> </p><p>Compiled by Thu Hà</p><p>HÀ NỘI — As Việt Nam enters the largest infrastructure development phase and needs hundreds of billions of US dollars for infrastructure investment, State budget and bank credit are limited.</p><p>Analysts believe that infrastructure bonds will become a new pillar of long-term capital for national projects.</p><p>Analysts of VIS Rating, an affiliate of Moody’s, estimate that by 2030, Việt Nam will need about US$245 billion for highways, railways, renewable energy and transmission infrastructure. However, public investment capital can only meet about 70 per cent of the demand, while the banking system - the main funding channel - is facing clear limitations.</p><p>Maturity pressure makes it difficult for banks to pursue long-term loans of 15-20 years. Besides, Basel III international banking standards require banks to maintain higher equity capital to reduce risks, causing costs for bank credit for long-term projects and construction risks being always high in the early stages.</p><p>Director and senior expert of VIS Rating, Dương Đức Hiếu said that bank credit used to be the key source of funding for infrastructure projects.</p><p>However, in the past three years, outstanding loans for transport have decreased by an average of 10 per cent per year, reflecting the trend of tightening compliance with capital safety indicators, especially limiting the use of short-term capital for medium- and long-term loans, according to Hiếu.</p><p>When the funding room is narrowed, banks cannot continue to shoulder the majority of capital resources for projects with payback periods lasting decades.</p><p>The State budget still plays a pivotal role but is no longer able to aid all investment needs. The official development assistance (ODA) capital from developed countries or international organisations for developing or underdeveloped countries, which once played an important role in the early stages of reform, has also significantly decreased.</p><p>Meanwhile, the target of high GDP growth and the need to develop modern infrastructure require a more diverse and stable long-term capital structure.</p><p>According to Hiếu, in that context, infrastructure bonds are considered a new pillar alongside the State budget and bank credit.</p><p>The completion of the legal framework after the volatile period of 2021-2022 has created a more transparent foundation, reduced systemic risks and strengthened investor confidence, which is an important condition for the bond channel to return to its role as a long-term capital leader.</p><p>The popular model in the world, especially in energy and transport projects, is to use bank loans in the early stages, when construction risks and investment costs are high, and switch to issuing long-term bonds after the project is in stable operation.</p><p>In Việt Nam, the demand for infrastructure bond investment is assessed to be very large. The total asset value of bond funds has doubled compared to the crisis bottom in 2023. However, many fund management units say they do not have enough products to buy, when most of the portfolio still has to be placed in bank bonds or certificates of deposit.</p><p>In addition, life insurance groups, pension funds and institutional investors, which own long-term capital sources of 15-20 years, are also lacking suitable products.</p><p>The Ministry of Finance has recently proposed allowing the insurance sector to buy recapitalised bonds and restructure debts, opening up a large space for the market in the future.</p><p>“The potential demand for infrastructure bonds is huge. When the new policy is activated, the market will accelerate strongly,” Hiếu said.</p><p><b>Infrastructure bond fund</b></p><p>The bond market is entering a period of comprehensive restructuring. New requirements, such as credit rating, transparency of records and strict auditing, will help reduce systemic risks, increase investor confidence, and direct capital flows back to quality projects and good cash flow.</p><p>Experts say that infrastructure bonds will emerge as a spearhead, when real estate projects – a sector that used to account for a large proportion – are being tightened; while the trade, service and infrastructure sectors need long-term capital that banks find difficult to meet.</p><p>On this basis, the formation of an infrastructure bond fund is considered a necessary step to raise private capital for national projects. This fund is expected to be a closed-end fund and issue listed certificates, helping investors trade flexibly while maintaining a stable capital scale.</p><p>At least 65 per cent of the fund's net asset value will be invested in safe infrastructure bonds, government bonds or deposits.</p><p>Statistics in the first 10 months of 2025 show that the total value of corporate bonds issued reached VNĐ482 trillion, but 69 per cent of which belonged to banks, while infrastructure and real estate only accounted for 23 per cent, clearly reflecting the imbalance between infrastructure capital needs and actual mobilisation.</p><p>The launch of the infrastructure bond fund is expected to regulate this capital flow, channel capital resources to key projects and meet long-term investment needs.</p><p>Despite the huge potential, infrastructure bonds do not mean absolute safety.</p><p>Lawyer Lê Thị Nhung, Director of law firm L&amp;A Legal Experts, said that risks mainly focused on project quality, implementation progress, financial plans and the ability to ensure cash flow.</p><p>To minimise the risks, Nhung proposed to develop a set of independent and transparent appraisal criteria; prepare separate risk reports for each project; regularly disclose information on progress, changes in total investment and capital use; and apply mandatory credit ratings to large issuances.</p><p>If designed correctly, this mechanism would help individual investors access infrastructure bonds more safely, while creating a basis for sustainable development of long-term infrastructure projects.</p><p>The infrastructure bond fund could act as a professional ‘filter’ if properly designed, helping individual investors access long-term products with controlled risk, Nhung said. — BIZHUB/VNS</p><p> </p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1730779/infrastructure-bonds-to-become-new-capital-pillar-for-national-projects.html",
            "pub_date": "2025-12-01 09:50:51",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Proposal of removing construction permits in urban areas raises controvery",
            "description": "<div id=\"abody\">\n<p> </p><p>HÀ NỘI — The proposal to exempt construction permits for individual houses under seven floors in urban areas, raised in the draft amendment of the Construction Law, is attracting significant attention from the public and experts.</p><p>This change is expected to substantially reduce administrative procedures but also poses challenges in managing construction orders where the planning framework is not yet complete.</p><p>At a recent discussion session during the 10th plenary of the 15th National Assembly, deputy Đinh Ngọc Minh stated that the draft amended Construction Law, which only exempts construction permits for houses under seven floors in rural areas, does not reflect actual conditions.</p><p>He said urban residents also face many costs and procedures, while planning information is increasingly transparent. Expanding the permit exemption to urban areas, together with a unified set of technical standards issued by the Ministry of Construction, would help shorten timelines and significantly reduce costs for citizens.</p><p>Minh argued that the current construction investment process includes many repetitive appraisal steps. Once a project has passed pre-feasibility studies, feasibility studies and technical design assessments, requiring another permit is unreasonable. This reform also aligns with the Government’s directives.</p><p>Prime Minister Phạm Minh Chính has consistently emphasised reducing administrative procedures, especially for projects that already have detailed planning or urban design. The Ministry of Construction has been instructed to summarise pilot experiences and propose expanded implementation within the year.</p><p>Legal experts note that if applied under the right conditions, removing permit requirements could create major benefits for both citizens and management agencies.</p><p>At present, applying for a construction permit typically takes three to four months. Documents often need to be revised multiple times, increasing consulting costs and delaying construction plans.</p><p>Without the need for a permit, people could begin construction immediately after completing design documents and complying with planning standards.</p><p>This reform would also reduce pressure on management agencies. Instead of processing tens of thousands of permit applications each year, they could focus on on-site inspections and addressing major violations.</p><p>In the context of Việt Nam’s transition toward digital urban governance, Chairman of the HCM City Real Estate Association (HoREA) Lê Hoàng Châu said that in many developed countries, people simply access planning data to design and build houses in accordance with permitted standards.</p><p>As Việt Nam moves toward digital government, reducing procedural intervention and increasing reliance on data is seen as an inevitable trend, according to Châu.</p><p><b>Risks</b></p><p>However, planning and legal experts warn that overly rapid implementation could lead to serious problems, especially given the numerous gaps in 1/500-scale planning across urban areas.</p><p>According to lawyer Phạm Thanh Tuấn, in many major cities, only some streets have 1/500 detailed planning. Without detailed planning as a foundation, allowing people to build based on their own interpretation could easily result in violations.</p><p>Trần Ngọc Chính, chairman of the Vietnam Urban Planning and Development Association, said that 1/500 planning includes the most important indicators such as density, height, setbacks and even basement regulations.</p><p>“If planning exists, the permit becomes unnecessary but if planning does not exist, the permit cannot be removed,” he said.</p><p>Concerns also extend to potentially rising violations in narrow residential areas. Việt Nam’s urban areas often consist of small and irregular land plots.</p><p>Without the existing verification step, people may be unable to determine required setbacks or technical standards. When violations occur deep inside alleys, inspection, enforcement and remediation become extremely complicated.</p><p>Protecting the rights of neighbouring households is another issue that requires careful consideration. Deputy Minister of Construction Nguyễn Danh Huy previously stated that when permits are abolished, the biggest challenge is ensuring that new construction does not block or encroach on neighbouring properties or cause safety risks.</p><p>Đào Ngọc Nghiêm, deputy chairman of the Vietnam Urban Planning and Development Association, said that abolishing permits will require local authorities to closely monitor construction from the outset. People would still need to submit construction notices. This means the monitoring apparatus must have sufficient resources and clearer regulations.</p><p><b>Property data</b></p><p>Experts agree that the core issue is not simply whether to abolish or retain construction permits, but whether there is a clear and comprehensive data and planning system capable of replacing the current pre-inspection process.</p><p>To address this, lawyer Tuấn proposed accelerating planning digitalisation, integrating land, architectural and construction indicators into an online system and applying technology in checking planning and urban design at the online platform.</p><p>With such tools, people would only need to fill in their land plot information on the platform to learn how many floors or what density they are permitted to build.</p><p>Management processes should also shift to a smart post-inspection model, focusing on high-risk areas instead of conducting widespread inspections.</p><p>Many experts agree that if Việt Nam intends to implement permit exemptions on a large scale, it must accelerate completion of 1/500 detailed planning and urban design. This is both costly and complex, especially in existing neighbourhoods with many small land lots.</p><p>Therefore, Châu from HoREA suggested socialising planning work and prioritising areas with high construction demand.</p><p>A more suitable roadmap would involve step-by-step implementation. The first phase could exempt permits in areas with detailed planning or urban design. The next phase could expand to areas with updated planning, while simultaneously completing open data systems for easy public access.</p><p>The Government has emphasised the common goal of creating the most favourable conditions for people and businesses while still ensuring safety and construction order. The ministry now reviews all regulations, assessing the impact of abolishing permits, and plans to streamline procedures by 2025.</p><p>A step-by-step roadmap, accompanied by planning completion and technology application, is considered the most feasible solution to ensure that this policy brings real benefits to people while maintaining urban discipline. — VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1730212/proposal-of-removing-construction-permits-in-urban-areas-raises-controvery.html",
            "pub_date": "2025-11-23 14:31:10",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Policy gaps stall Việt Nam’s push for battery storage",
            "description": "<div id=\"abody\">\n<p> </p><p><span><span><span>Compiled by Thu Trà</span></span></span></p><p>HÀ NỘI — Việt Nam’s solar and wind sectors are expanding rapidly, but experts warn that without large-scale battery storage, fully harnessing the country’s abundant renewable electricity remains a distant dream. </p><p>The battery energy storage systems (BESS) are no longer viewed as auxiliary equipment but as a core component of the clean-energy ecosystem. The technology enables the storage of renewable electricity, stabilises grid frequency, eases transmission congestion and smooths peak and off-peak loads. For businesses, these capabilities translate into lower operating costs and a higher share of on-site green power.</p><p>According to Đào Hoàng Duy, Deputy General Director of Sales &amp; Marketing at GG Industries, a manufacturer of energy storage systems, Việt Nam’s hundreds of industrial parks — many linked to global supply chains — face mounting pressure to adopt clean energy and cut emissions.</p><p>Solar and wind power are inherently unstable — only battery storage allows companies to secure a reliable electricity supply, he told <i>saigontimes.vn. </i></p><p>Duy noted that Việt Nam’s three-tier electricity tariff provides a strong incentive for BESS adoption, as off-peak rates are roughly one-third of peak-hour prices. Once the direct power purchase agreement (DPPA) mechanism comes into effect, a solar power plus BESS model could enable companies to meet their own green-energy needs and even sell surplus electricity within industrial parks.</p><p>At the start of 2024, BESS was still a new concept. But in the past six months, Duy said his company has consulted more than 200 businesses, highlighting the strong interest. Yet market growth remains constrained by legal uncertainties, leaving many companies unsure where to begin.</p><p><b>Regulatory confusion</b></p><p>Confusion over BESS investment extends beyond businesses to local authorities.</p><p>Phan Văn Dũng from Phú Thọ Province's Department of Industry and Trade said many consulting units and businesses have approached his department for guidance, but it lacks a regulatory framework.</p><p>He told <i>saigontimes.vn</i> that total BESS capacity is determined centrally but not allocated to localities, preventing departments from processing project applications. </p><p>Uncertainty over whether BESS projects should be classified as energy infrastructure or auxiliary equipment further complicates matters. Even small projects must navigate adjustments to land-use planning and investment approvals — a lengthy process, Dũng said.</p><p>Echoing Dũng’s concerns, Trần Văn Hợi from Anh Duong Power Co in HCM City said interpretations vary by locality.</p><p>Enterprises spend months obtaining construction permits, fire safety approvals and technical appraisals. While the technology evolves rapidly, the procedures remain too slow, he said.</p><p>Hợi proposed national standards for BESS systems, covering design, safety and fire prevention, to provide local authorities with a unified reference framework.</p><p><b>Market and financial hurdles</b></p><p>Nguyễn Anh Tuấn, vice president of the Vietnam Energy Association, identified the lack of a market mechanism for BESS as the biggest bottleneck.</p><p>There is no payment system for ancillary services, no valuation of the difference between storage and generation and no clear bidding process, Tuấn said, adding that without visible cash flow, businesses are reluctant to make large investments.</p><p>Investment costs also remain high, with battery cells and modules accounting for 85 per cent of total system value. For small and medium-sized enterprises, building a BESS facility can be a major financial burden. Many banks also do not accept BESS assets as collateral, limiting access to green financing.</p><p>Duy from GG Industries petitioned the State to recognise the value of BESS assets to develop the BESS market.</p><p>Once a legal framework exists, banks will lend and businesses will invest, Duy told an online newspaper.</p><p>Other challenges include complex grid integration and environmental concerns related to battery recycling and disposal, industry insiders said.</p><p><span><span><span><b>Initial steps into the sector</b></span></span></span></p><p>At the Việt Nam-China-ASEAN International Energy Forum 2025, T&amp;T Group’s Deputy CEO Nguyễn Thị Bình said battery storage was still a high-barrier field.</p><p>Global competitors, especially in China, had a decade-long lead in technology and scale, while Việt Nam currently lacked domestic manufacturers, she said.</p><p>Bình said local production, supported by government incentives, could help level the playing field. T&amp;T’s vision was to build Việt Nam into a manufacturing and technology hub for renewable energy equipment, especially in the green industrial parks being developed under government planning.</p><p>\"I believe the Government will strongly encourage locally produced storage batteries, especially those invested in by Vietnamese investors, and there will certainly be supportive and preferential mechanisms to enhance competitiveness in the market,” she said.</p><p>T&amp;T plans to launch joint-venture battery storage products in 2026, starting with 2GWh annual production and scaling up to 10GWh within three years. This initiative is intended to meet anticipated demand once pricing and installation regulations are clarified.</p><p>Meanwhile, Marubeni Corporation, via its subsidiary Marubeni Green Power Việt Nam, has entered the battery storage sector with a demonstration project in partnership with Vingroup.</p><p>A VinFast Energy-developed BESS was installed at a Vingroup resort to reduce electricity costs by leveraging time-of-use rate differences — one of the first such business models in Việt Nam. — VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1729692/policy-gaps-stall-viet-nam-s-push-for-battery-storage.html",
            "pub_date": "2025-11-17 10:30:46",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Bankruptcy Law aims for modern economic pragmatism",
            "description": "<div id=\"abody\">\n<p> </p><p>Compiled by Hoàng Anh</p><p>In an increasingly competitive economic climate, more than 58,000 Vietnamese enterprises withdrew from the market in January alone — a trend that has become a growing concern among policymakers. </p><p>According to the General Statistics Office, over 52,000 of those firms only suspended operations temporarily, yet the scale of the issue is large. On average, about 26,300 businesses ceased operations each month in the first quarter of 2025.</p><p>Under the 2014 Law on Bankruptcy, an enterprise that fails to meet its debt obligations within three months of the due date may be declared bankrupt. The process is clearly defined on paper — from filing and acceptance to potential recovery and final declaration. Yet while the law sets out a procedural path, its application in practice tells a different story.</p><p>Between 2015 and 2023, courts nationwide handled only about 1,500 bankruptcy cases, a tiny fraction compared with the hundreds of thousands of businesses that stop operating each year. Of those, only 150 were formally declared bankrupt, and just six entered a recovery process. </p><p>The numbers highlight a deeper reality: most enterprises simply shut down quietly, bypassing legal resolution or rehabilitation. Analysts say the current system is too complex and time-consuming, and offers little chance of genuine recovery.</p><p>At a recent meeting of the National Assembly (NA)’s working group on the amended Law on Bankruptcy, Vice Chairman of the National Assembly Lê Minh Hoan proposed a shift in perspective to view bankruptcy not as an end, but as an opportunity for renewal.</p><p>Drawing on international practice, he noted that in many economies, firms deliberately file for bankruptcy as a step toward restructuring and restarting operations. </p><p>“It should not be that once a business is clinically dead, it is dead forever,” he said. “We should look at bankruptcy as part of the business life cycle, a moment for renewal rather than termination.”</p><p>Hoan suggested that the law’s title itself be changed to 'Law on Recovery and Bankruptcy', signalling a more humane, supportive and forward-looking approach. </p><p>“The law should carry a spirit of partnership between the State and enterprises, helping reduce risks and encouraging a culture of legitimate failure and rebirth,” he said. Properly handled cases of bankruptcy, he added, could even serve as examples — showing that failure, when managed responsibly, can be a pathway to progress.</p><p><b>Reform with caution</b></p><p>NA Vice Chairman and Senior Lieutenant General Trần Quang Phương endorsed the proposed renaming, while emphasising the need for simplified and faster procedures. </p><p>“The problem is how to design a process quick enough to handle such enterprises efficiently,” he said. His comments reflected a pragmatic counterpoint to the more optimistic vision of his colleague.</p><p>He cautioned that recovery should remain the enterprise’s choice, not a State-imposed requirement. </p><p>“The law should provide legal support, not expand State power to force recovery or liquidation — unless the business operates in sectors of strategic importance,” he noted.</p><p>NA deputy Nguyễn Minh Sơn of Đồng Tháp Province shared this concern, pointing out that the handling of bankrupt enterprises has been slow and inefficient. “This amendment is necessary to accelerate the process and to deal with businesses that are effectively ‘dead but unburied’,” he said.</p><p>The NA’s Economic and Financial Committee reported that, while the 2014 law already includes provisions for recovery, implementation has been hampered by a lack of clear procedural guidance. This institutional bottleneck underscores why several lawmakers believe a new framework is urgently needed. Renaming and restructuring the law, they said, could help clarify the practical link between bankruptcy and recovery.</p><p>Economists added that the new provisions would introduce a structured rescue framework within the law, aligning with international standards and economic logic to prevent moral hazard. The aim is to create a balanced system that encourages timely restructuring while protecting creditors’ rights. This approach would align Việt Nam’s bankruptcy regime more closely with modern economic pragmatism.</p><p>Nevertheless, several delegates have voiced caution. They warned that if recovery mechanisms are misused to delay genuine bankruptcy, they could lead to asset losses and undermine creditor confidence. The proposed use of public funds to cover recovery-related costs also raises concerns about fiscal burden and accountability.</p><p>“The law must carefully define eligibility, supervision and financial responsibilities,” one delegate said. “Otherwise, recovery could become an excuse for postponing liquidation, increasing systemic risk.”</p><p>Observers agree that the success of the amended law will depend on effective enforcement — how courts, creditors and regulators coordinate to ensure both efficiency and integrity in implementation. Without robust oversight, even the best-intentioned reforms could falter.</p><p>Beyond technical revisions, the debate signals a broader evolution in Việt Nam’s economic thinking. Economists said for decades, bankruptcy has carried the stigma of failure — a final, negative judgment. </p><p>The proposed amendments suggest a new philosophy: that failure is part of growth, and that the legal system should facilitate legitimate recovery rather than simply close doors. It also reflects Việt Nam’s maturing market mindset, as policymakers seek to align business laws with global norms of transparency, accountability and second-chance entrepreneurship.</p><p>If successfully implemented, the new law could reshape the business environment, encouraging openness, strengthening creditor confidence and allowing entrepreneurs to re-enter the market more quickly after failure. </p><p>By redefining bankruptcy as renewal, Việt Nam moves toward a more resilient and forgiving economic ecosystem, one that values perseverance as much as success. VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1728735/bankruptcy-law-aims-for-modern-economic-pragmatism.html",
            "pub_date": "2025-11-03 10:40:45",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Việt Nam puts an end to lump-sum tax, aiming for a level playing ground",
            "description": "<div id=\"abody\">\n<p> </p><p><b>Compiled by Mai Linh</b></p><p>HÀ NỘI — The Ministry of Finance has approved a comprehensive plan to abolish the long-standing lump-sum tax regime for business households, aiming to modernise tax administration and create a fairer business environment.</p><p>Under the plan, all business households nationwide will shift to a self-declaration and payment system from January 1, 2026, marking the end of a mechanism that has been in place for decades.</p><p>The plan seeks to simplify administrative procedures, accelerate digital transformation and cut compliance costs by at least 30 per cent, promoting the growth of the private sector, according to the ministry. Its goal is to establish a modern, transparent and equitable tax system that puts taxpayers at the centre of reform.</p><p>To achieve this, the Ministry of Finance will focus on overhauling legal frameworks and policies to ensure consistency and timely implementation. It will propose amendments to the Law on Tax Management and related documents to formally abolish the lump-sum tax on business households.</p><p>Policies on personal income tax and value-added tax will also be revised to redefine taxable thresholds and calculation methods for business households operating at a scale similar to small and medium-sized enterprises (SMEs).</p><p>For households maintaining proper accounting records, personal income tax will be calculated on net income to encourage transparency and fair competition.</p><p>The ministry also plans to revise the laws on fees and charges and on supporting SMEs, alongside proposing a new separate law on individual business.</p><p>The tax authority will expand the use of digital tools – including AI-powered chatbots and automated e-filing systems – to support taxpayers, simplify declaration forms and reduce errors.</p><p>Supervision will be strengthened through risk-based management and electronic invoice tracking to combat fraud, invoice trading and tax evasion.</p><p>All household businesses using e-invoices generated from cash registers, as required under Decree 70/2025, must complete registration before the new model takes effect.</p><p>“The reforms are not meant to impose new burdens but to support business households,” said Deputy Director of the General Department of Taxation Mai Sơn.</p><p>He added that tax authorities were simplifying procedures, cutting compliance costs and partnering with technology firms to make the transition easier.</p><p> </p><p> <b>65% exempted</b></p><p>Under the plan, business households are divided into three groups based on their annual revenue, each with specific tax obligations.</p><p>The first group includes households with annual revenue under VNĐ200 million (US$8,000). They will be exempt from both value added tax (VAT) and personal income tax (PIT). The threshold is double the previous level, providing relief to millions of small family-run shops and traders, estimated to account for more than 65 per cent of all business households. However, they must declare twice per year.</p><p>The second group includes those with revenue between VNĐ200 million and under VNĐ3 billion per year.</p><p>For VAT, Group 2 will pay following the direct method or may voluntarily register for the deduction method if they meet the qualifying conditions. PIT will also be based on a percentage of revenue depending on the type of activity.</p><p>The tax rates will vary depending on their business sector, such as 1.5 per cent for distribution and trading, 4.5 per cent for manufacturing and food services, 7 per cent for other services and 10 per cent for property leasing.</p><p>Group 2 will be required to maintain simplified accounting books under standardised templates and file tax declarations quarterly, or four times per year.</p><p>A key change under the new regime requires all household businesses with annual revenue above VNĐ1 billion and operating in retail or direct consumer services to issue e-invoices generated from cash registers connected to tax authorities.</p><p>They will be required to open separate bank accounts for business transactions. If a household’s annual revenue exceeds VNĐ3 billion for two consecutive years, it will be reclassified into Group 3.</p><p>Group 3, with annual revenue exceeding VNĐ3 billion, will be treated similarly to small enterprises, requiring them to adopt the VAT deduction method.</p><p>Group 3 will be subject to a PIT rate of 17 per cent of profit. Businesses earning over VNĐ50 billion per year must declare tax monthly, while quarterly reporting is required for the rest.</p><p>Issuance of invoices is compulsory for Group 3 and they must open separate bank accounts for their businesses.</p><p>The ministry said the Government encourages Group 3 to convert into enterprise models to enjoy additional incentives under Resolution 68-NQ/TW on private sector development and Resolution 198/2025/QH15 on special mechanisms and policies for private economic growth.</p><p>For individuals doing business on e-commerce platforms, if the platform has a payment function, it will withhold, declare and pay VAT and PIT on behalf of the seller, calculated as a percentage of revenue. If the individual’s annual revenue is below VNĐ200 million, any excess tax paid will be refunded.</p><p>If the platform does not have a payment function, the individual must declare and pay taxes on their own.</p><p>Experts say the move will close long-standing loopholes that allowed large traders to disguise themselves as household businesses to enjoy lump-sum tax benefits and evade taxes.</p><p>“It’s a transition period for small traders and household businesses to prepare and familiarise themselves with tax declaration and payment,” said Nguyễn Văn Được, general director of Trọng Tín Accounting and Tax Consulting Company Limited.</p><p>Statistics from the Ministry of Finance showed that by the end of 2024, there were about 3.6 million household and individual businesses in Việt Nam, up 6 per cent from 2023.</p><p>As of the first seven months of 2025, out of 2.35 million active household businesses, about 65.7 per cent, equivalent to 1.5 million, earned less than VNĐ200 million per year in revenue. This group paid a total of VNĐ2.41 trillion in taxes during the period.</p><p>About 791,000 households, or 33.6 per cent of the total, earned between VNĐ200 million and under VNĐ3 billion. This group contributed VNĐ7.886 trillion in tax.</p><p>About 12,000 households earned between VNĐ3 billion and VNĐ50 billion, contributing VNĐ1.032 trillion in tax, while 1,464 households reported annual revenue above VNĐ50 billion and paid VNĐ288 billion in taxes.</p><p>In the first nine months of 2025, more than 18,500 lump-sum taxpayers shifted to the declaration method, while nearly 2,530 households upgraded to enterprise status. — VNS</p><p> </p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1728186/viet-nam-puts-an-end-to-lump-sum-tax-aiming-for-a-level-playing-ground.html",
            "pub_date": "2025-10-27 11:30:38",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "2024 Land Law: unresolved issues in land valuation",
            "description": "<div id=\"abody\">\n<p>Compiled by Yến Vy</p><p><span>HÀ NỘI — After more than a year of implementation, the 2024 Land Law has revealed numerous shortcomings, among which land valuation stands out as a 'backbone' factor determining the effectiveness of many policies related to land recovery, compensation, resettlement and land use rights auctions. </span></p><p><span>To ensure that policies are implemented effectively, fairly and sustainably, it is urgent to amend and supplement the Land Law, particularly regarding the land valuation mechanism.</span></p><p><span>The 2024 Land Law was expected to address the limitations of the 2013 Land Law, especially in determining land prices that are more in line with the market, ensuring fairness for landowners whose land is acquired and facilitating investment projects. However, the implementation has shown that many bottlenecks related to land valuation need to be resolved quickly.</span></p><p><span>Experts have pointed out that for a long time, the land price table was set lower than the actual market prices, creating distortions in land compensation. The 2024 Land Law officially eliminates the land price framework and stipulates that the land price table will be set annually, with hopes to adjust prices more timely and in accordance with actual conditions.</span></p><p><span>However, in some localities, the land price table is still set much lower than the actual market value, leading to significant differences between compensation prices and the market sale prices of land for development projects. </span></p><p><span>This has led to complaints, public resistance and enterprises having to carefully consider their financial plans when participating in projects.</span></p><p><span>The Hanoi Department of Agriculture and Environment reported that, according to Article 159 of the 2024 Land Law, the starting price for land use rights auctions for land plots with invested infrastructure must be determined based on the land price table. </span></p><p><span>However, in many areas, the land price table is still lower than market prices, insufficient to cover the costs of investment, site clearance and land development.</span></p><p><span>In theory, the 'specific land price' is set by authorities at the time of land allocation or transaction and is supposed to reflect the market more accurately than the general land price table. However, in practice, determining specific land prices is very difficult. </span></p><p><span>Setting these prices requires many factors such as location, legal status, infrastructure, development potential, but the current mechanisms and methods for specific land valuation are not clear, and still rely heavily on the experience of appraisers.</span></p><p><span>Even the timing for determining specific land prices is not standardised. Additionally, the overlap of authorities and the lack of clear jurisdiction between localities often leads to disputes and complaints between citizens and government bodies.</span></p><p><span>This is one of the reasons why many localities are still hesitant to widely apply specific land prices, and when they do, it often leads to questions or public reactions. Furthermore, the legal documents guiding the implementation of the 2024 Land Law are still slow to be completed, causing localities to stall in applying land valuation methods.</span></p><p><span>These practical issues are creating bottlenecks that prevent the 2024 Land Law from fully realising its expected benefits. </span></p><p><span>Recently, Deputy Prime Minister Trần Hồng Hà chaired a meeting to report on feedback from Government members on the Draft Law amending and supplementing several articles of the 2024 Land Law, urging ministries, agencies, and associations to focus on analysing and discussing the issues that need urgent amendment to resolve bottlenecks that hinder socio-economic development, and to address issues with the land price table's market-based approach.</span></p><p><span><b>Relieving pressure</b></span></p><p><span>A difficult reality is that land prices in many regions are rising, especially in expanding urban areas. When a project takes several years to complete, if land prices are determined once based on the land price table or an initial specific price, investors may suffer losses if the land price increases significantly during the project. </span></p><p><span>Furthermore, if landowners are compensated based on a price lower than what companies could make by reselling the land, it could lead to feelings of 'unfairness'.</span></p><p><span>On the other hand, allowing land prices to be adjusted based on market prices during project implementation could lead to price inflation, as parties may collude to artificially raise land prices for profit. </span></p><p><span>As a result, many enterprises and experts have pointed out that the current land valuation method still carries risks and does not fully ensure fairness.</span></p><p><span>Ngô Gia Cường, director of Vietnam Appraisal and Inspection Co.Ltd (VAI), noted that when constructing the land price table, it is almost impossible to apply valuation methods as prescribed for land used for production or commercial services, as these must be interpolated based on percentages of residential land prices.</span></p><p><span>Many localities still use this interpolation method for land price tables, showing that the land price appraisal boards cannot properly implement the regulations of the Land Law, which requires land prices to be determined using official land valuation methods (none of which allow interpolation). </span></p><p><span>This means that even though the 2024 Land Law has removed the land price framework, there is still a risk that the land price tables for 2026 could repeat this limitation.</span></p><p><span>Separating and adding a distinct set of principles for land valuation when building land price tables, different from the market-based principles used for determining specific land prices, would help align the policy with theory and prevent policy volatility, said Cường.</span></p><p><span>Adding specific principles for constructing land price tables would also provide a clear legal basis for localities to have the authority and flexibility to build land price tables, stabilising tax revenues without causing significant fluctuations for the affected parties.</span></p><p><span>Establishing land prices in land price tables separately from market prices would stabilise the target groups, while ensuring that the prices used for determining financial obligations were not affected by the volatile, cyclical, and hard-to-predict fluctuations of the Vietnamese real estate market, added Cường.</span></p><p><span>Dr Nguyễn Thường Lạng, senior lecturer at the National Economics University, remarked that an important first step was to adjust the primary land price, which was the price set by the government when land is first allocated. </span></p><p><span>The valuation should not be entirely based on market prices. Instead, the primary land price should be set at a favorable level to incentivise businesses to invest and develop, rather than at a high level aimed at maximising budget revenues.</span></p><p><span>“If the primary land price is set too high, it will not only increase input costs for businesses, but it will also push up the land price market as a whole, putting pressure on the entire economy,” said Lạng.</span></p><p><span>Additionally, he proposed that land price regulation should rely on a framework of reference prices, differentiated by region and development goals. </span></p><p><span>Moreover, the State should proactively use various tools to regulate land prices to ensure transparency, fairness, and effectiveness. </span></p><p><span>Land auctions should be reasonably controlled to prevent price inflation, distorting the market. The regulatory tools must balance the interests of the government, businesses and citizens. </span></p><p><span>These tools should not only include administrative measures such as planning, pricing, and land-use limits, but also economic tools like taxes, interest rates, investment incentives, and other fiscal policies. — VNS</span></p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1726620/2024-land-law-unresolved-issues-in-land-valuation.html",
            "pub_date": "2025-10-06 09:35:36",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Crypto market poised to explode as the Government inches closer to legalise digital asset exchange",
            "description": "<div id=\"abody\">\n<p>Complied by Mai Linh</p><p>A wave of optimism is sweeping through the digital asset market as the Government inches closer to legalising the digital asset market which is expected to create a regulatory breakthrough that could make Việt Nam one of the leading crypto and blockchain hubs of the region.</p><p>The newly passed Law on Digital Technology Industry together with a draft framework to legalise the pilot operation of digital asset exchanges scheduled to be realised within August will mark a transformative shift for a market long operating in the shadow and now eyeing explosive growth to capitalise on the billions-of-dollars market.</p><p>At the Government’s conference on Wednesday, Deputy Minister of Finance Nguyễn Đức Chi said that the pilot project on crypto asset market had been basically completed in terms of criteria for market participants, technical conditions, operation procedures, financial capacity and expertise of service providers.</p><p>The project had been reported to the Government with a resolution expected to be issued within August or September.</p><p>Chi added that during the pilot phase, there would be more than one exchange allowed to operate in order to create a healthy competitive environment. However, there wouldn't be too many exchanges in the pilot phase to facilitate the management and efficiency evaluation.</p><p>The Ministry of Finance proposed that the private economic sector be encouraged to participate in providing services in the crypto asset market, he said.</p><p>According to Deputy Governor of the State Bank of Vietnam Phạm Tiến Dũng, over the past year, steady and notable progress has been made in developing institutions and a legal framework for digital assets and blockchain technology.</p><p>Crucially, the Law on Digital Technology Industry, effective from January 1, 2026, defines digital assets in law for the first time, establishing ownership rights, business conditions, and information safety regulations. This breakthrough provides a transparent legal foundation for blockchain-based business and research in Việt Nam.</p><p>In addition, the National Assembly has passed a resolution on the establishment of an international financial centre (IFC), covering innovation and specialised digital asset exchanges.</p><p>The draft resolution on the pilot implementation of digital asset market is being finalised and submitted to the Government for approval in August. Crypto asset exchanges will be piloted in the IFC which is being pushed to go operational in HCM City and Đà Nẵng by the end of this year.</p><p>Tô Trần Hoà, Deputy Head of the Market Development Department under the State Security Commission, said that the draft would regulate the establishment of businesses providing digital asset services with strict requirements.</p><p>For example, companies must meet high cybersecurity standards to operate a crypto asset exchange, according to Hoà. The minimum capital for an exchange is VNĐ10 trillion (US$381 million), three times higher than establishing a bank and 33 times higher than an airline.</p><p>In the draft, the management of digital assets will focus on trading, transfer and serving anti-money laundering. Digital assets will not be recognised as a means of payment.</p><p><b>In the shadows</b></p><p>A youthful population, high internet penetration and growing tech enthusiasm are propelling Việt Nam into the global spotlight as one of the most dynamic markets for digital assets and blockchain technology in recent years.</p><p>In its 2024 Global Crypto Adoption Index, Chainalysis Statista ranked Việt Nam 5th worldwide in overall interest in digital assets, third in usage of international crypto platforms and 6th in decentralised exchange trading volume (DEX).</p><p>Data of Chainalysis Statista also showed that users have transacted more than $100 billion through digital assets, a significant figure when compared to Việt Nam’s remittance flow which stood at just $14 billion in 2023.</p><p>The number of Vietnamese using digital accounts has increased from just 2.06 million in 2019 to an estimated 10.15 million, excluding the non-fungible token (NFT) market, making Việt Nam 4th globally in term of users in 2023.</p><p>In comparison, there were around 10 million domestic securities accounts as of May 2025 after 25 years of the stock market development, according to statistics of the Việt Nam Securities Depository.</p><p>This marked a significant shift to digital asset investment although it has not been legally recognised in Việt Nam.</p><p>Due to the lack of regulatory framework, operation in the grey zone poses significant risks to businesses and investors, according to Nguyễn Trung Thuật, CEO of venture investment fund Kyros Ventures.</p><p>A number of startups were forced to register in crypto-friendly countries such as Singapore.</p><p>\"Vietnamese is incredibly quick to spot trends but most of the value they create ends up abroad,\" Thuật said, adding that his fund has supported over 200 Vietnamese blockchain projects, but nearly all are located overseas.</p><p>Thuật emphasised the need for a domestic asset exchange that ensures technological robustness, transparency, security, and a fair listing mechanism.</p><p>“If there’s a regulation but no product, users will leave. If there’s a product but no regulation, start-ups won’t dare to go public,” Thuật said.</p><p>“Việt Nam needs both, and can learn from international experiences.”</p><p>In the context that traditional capital raising channels such as banks and securities are under pressure, the flow of money into digital assets and crypto currencies is described as a giant underground economy that cannot be ignored, according to Trần Dinh from Việt Nam Blockchain Association.</p><p>“Improving the regulatory framework will also help Việt Nam attract a huge amount of foreign capital into the fintech sector, create more momentum for economic growth and activate a wave of start-ups and develop the domestic digital technology ecosystem,” he added.</p><p><b>Excitement for a new industry</b></p><p>The recognition of crypto assets is expected to open up a new industry in Việt Nam which will appeal to international investors.</p><p>Trần Xuân Tiến, Vice President of the HCM City Blockchain Association said that legalising digital assets would help startups move out of the grey zone to compete fairly with traditional businesses while expanding beyond fintech to apply digital assets into other industries.</p><p>The new legal framework would also push traditional businesses to apply blockchain and form new industries, Tiến added.</p><p>The law sent a signal, but other factors needed to be put into consideration including incentive policies, tax policies and market openness, he said.</p><p>According to Lynn Hoàng, country director of Binance in Việt Nam, many countries began to pay attention and develop regulatory framework for digital assets, generally believing that blockchain will be the technology of the future.</p><p>“We are eagerly awaiting a legal framework that would allow the pilot launch of digital asset exchanges,” said Mai Huy Tuấn, general director of SSI Digital, adding that digital asset businesses would have the opportunity to test new products within a clear regulatory environment.</p><p>Preparations had been made for many years, and a green light button was needed to activate, he said.</p><p>Developing a legal framework requires a balance between management to protect investors while ensuring innovation is not stifled, according to Minister of Finance Nguyễn Văn Thắng.</p><p>Việt Nam also faces a shortage of resources and talents in digital assets and blockchains.</p><p>Establishing a clear, consistent and flexible inter-agency coordination mechanism is essential to ensure efficiency in pilot implementation of digital asset market because digital asset market spans multiple sectors, including finance, technology, risk management and investor protection.</p><p>Developing a comprehensive legal framework for digital assets has become an urgent priority, not only to foster the digital economy and protect users but also to achieve broader economic goals. Besides, an appropriate regulatory framework will help minimise the risks related to fraud, scams and asset loss, according to the minister.</p><p>Vũ Ngọc Sơn, head of research, consulting, and technology development and international cooperation at NCA, highlighted Việt Nam’s strong logic and mathematical skills, especially among engineers, as a key advantage in cybersecurity, with local developers known for their persistence in identifying vulnerabilities in open-source blockchain systems.</p><p>He outlined four pillars to establish Việt Nam as a blockchain security centre, including a strong legal framework, robust technical standards, a well-trained human resource base and international cooperation, particularly in intelligence-sharing and cross-border cybercrime prevention.</p><p>According to data from crypto asset information provider CoinMarketCap, more than 118 million digital assets are currently issued and actively traded with a total market capitalisation of more than $3.37 trillion and daily trading volume of $100 billion.</p><p>Bitcoin, Ethereum, Tether, XRP and BNB are the five largest cryptocurrencies by market capitalisation, altogether accounting for more than 80 per cent of the total value of the global digital asset market.</p><p>A report by Triple A showed that global average crypto ownership rate is 6.8 per cent with more than 560 million people worldwide holding cryptocurrencies. — VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1723032/crypto-market-poised-to-explode-as-the-government-inches-closer-to-legalise-digital-asset-exchange.html",
            "pub_date": "2025-09-17 10:42:24",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Tax changes proposed for business individuals expected to create fairness",
            "description": "<div id=\"abody\">\n<p> </p><p>Compiled by Thu Hà</p><p>Many experts have supported the Ministry of Finance’s recent proposal to apply a 17 per cent personal income tax (PIT) on profits of a number of business individuals and households as the policy change creates fairness while promoting the companies transformations into an enterprise model.</p><p>However, the experts also note, there needs to be a detailed impact assessment of the change before any application to make the policy effective.</p><p>According to the latest draft amendment to the Personal Income Tax Law of the Ministry of Finance (MoF) that has recently been sent to the Ministry of Justice for review, the MoF proposes to amend and complete regulations on tax calculation methods for business individuals and households from January 1, 2026.</p><p>Specifically, PIT on income of business individuals and households with annual revenue above the threshold prescribed by the Government will be 17 per cent. In which, taxable income is determined by the businesses’ revenue minus reasonable costs related to production and business activities during the tax period.</p><p>According to the MoF, the 17 per cent PIT is the same as the corporate income tax (CIT) rate currently applying for small- and medium-sized enterprises (SMEs) with annual revenue from VNĐ3-50 billion.</p><p>For business individuals and households with revenue below the threshold prescribed by the Government, they will continue to pay tax according to the lump-sum tax policy as currently.</p><p>The Government will regulate and adjust the threshold of revenue to suit the socio-economic situation of each period. Currently, the threshold of annual revenue to be taxed is VNĐ200 million (nearly US$7,600).</p><p>According to Nguyễn Văn Thức, Chairman of the Board of Members of BCTC Tax Agent Company Limited, with the Party, State and Government encouraging the development of the private economy and promoting business individuals and households to transform into enterprises, the MoF’s 17 per cent PIT proposal for business individuals that is similar to the CIT for SMEs is well-founded and in the right direction.</p><p>“This policy creates fairness between large business individuals and small enterprises, while promoting transparency in business activities\", Thức explains.</p><p>Sharing the same views, Dr Vũ Văn Tính from the Academy of Public Administration and Government (APAG)’s Law Faculty said that the MoF's proposal to apply a 17 per cent PIT rate to business individuals with high revenue is a reasonable step. Instead of taxing on revenue under the current lump-sum tax policy, the new policy will tax on actual profit of business individuals.</p><p>“This creates equality among taxpayers, because the current lump-sum tax policy is often imposed on the entire revenue, not reflecting the actual capacity, which causes an inequality between business individuals and enterprises,” Tính said.</p><p>According to Tính, the new 17 per cent PIT rate is the same as the CIT rate for SMEs with revenue from VNĐ3-50 billion so it helps unify the Government’s policies, while also encouraging business individuals to professionalise and transform into the enterprise model to enjoy incentives.</p><p>Tính added: “First of all, this tax rate will eliminate tax advantages. Currently, despite having very large revenues, many business individuals and households still enjoy a lump-sum tax rate that is much lower than the 20 per cent CIT rate for enterprises. When applying a 17 per cent tax rate that is close to the 20 per cent CIT rate, this advantage disappears.”</p><p>In addition, when transforming from the business individual model to the enterprise model, business individuals will enjoy many incentives regarding legality, access to capital, brands and trade agreements that business individuals haven’t got yet, Tính said.</p><p>\"This tax rate also narrows the gap in tax obligations between business individuals and enterprises, making the transformation from a business individual to an enterprise a reasonable choice for long-term, transparent and more systematic development,\" Tính  said.</p><p>Agreeing with this view, Associate Professor Dr Nguyễn Thường Lạng, a lecturer at the National Economics University, said that this is an important step in tax reform, because the shift from the current lump-sum tax policy to tax based on actual profits will accurately reflect the tax payment capacity of each group of taxpayers.</p><p>“This approach not only increases State budget revenue but also creates a healthy competitive environment, encouraging business households and individuals to operate more transparently and systematically,” Lạng said.</p><p>Lạng believes though the new policy may increase tax obligations for business households and individuals, it also comes with many benefits in terms of law, capital, brand and integration, thereby promoting business individuals and micro-enterprises to develop to a larger scale.</p><p>“This is the foundation for all businesses, from small to large, to improve productivity and quality, towards sustainable growth,” Lạng said.</p><p><b>Detailed impact assessment needed</b></p><p>However, according to Lạng, there needs to be a detailed impact assessment and specific quantification to make the policy to be effective when it is passed. He suggests if all conditions are not met, a pilot programme can be conducted first to make appropriate adjustments.</p><p>To apply the tax changes, management authorities must deal with three main challenges.</p><p>First, the cost calculation, including the opportunity cost, must be transparent and complete according to accounting standards. There needs to be a clear manual.</p><p>Second, the electronic invoice system and revenue calculation needs to be convenient, accurate and reflect honestly, so that the market operates transparently and sustainably.</p><p>Third, it is necessary to eliminate overlaps in policies, while at the same time harmonising the interests of all relevant parties to maintain fairness within an acceptable range.</p><p>Notably, Lạng pointed out that Việt Nam should refer to international experiences, where the tax systems are designed to be friendly and clear, ensuring both fairness and maintaining stable revenue sources.</p><p>Meanwhile, in order for the policy to truly come into effect and not create additional burdens, Dr Tính of APAG believes that it is necessary to set a high enough income threshold and only applicable to the group of high profitable business individuals. He believes that this approach will absolutely protect small business individuals and startups.</p><p>However, experts believe that the management authorities need to promote communication to help taxpayers understand the tax change to bring about effectiveness when the policy is passed.</p><p>In addition, the Government should extend the application period of the new tax policy until 2027 as it will help business individuals and households have time to prepare and gradually get used to the new policy.</p><p>For tax authorities, there needs to be preparation and support for business households and individuals on how to keep books, invoices and documents to follow the new tax policy. — BIZHUB/VNS</p><p> </p><p> </p><p>                                                                 </p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1725189/tax-changes-proposed-for-business-individuals-expected-to-create-fairness.html",
            "pub_date": "2025-09-17 10:42:28",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Việt Nam's auto parts industry accelerates, leaving ‘screw curse’ behind",
            "description": "<div id=\"abody\">\n<p><span>Compiled by Thu Trà</span></p><p>HÀ NỘI — Việt Nam’s auto parts industry is rapidly emerging as a key player in the region, overcoming long-standing limitations once symbolised by the so-called 'screw curse' – the inability to produce anything beyond basic components. Today, Vietnamese manufacturers are producing a wide range of advanced components, including electric motors, cables, digital displays and electronic modules.</p><p>With Việt Nam’s domestic automotive market reaching a scale considered attractive for long-term investment, industry experts are calling for a coordinated and strategic push to develop the entire automotive supply chain. This includes not only attracting foreign direct investment (FDI) but also strengthening the role of local enterprises, particularly small and medium-sized businesses in the ecosystem.</p><p><b>SMEs at the forefront of transformation</b></p><p>Among those is An Thinh Technology Co, a Vietnamese SME located in the Tân Thuận Export Processing Zone in HCM City.</p><p>Founded in 2007, An Thinh began as a manufacturer of household electrical items such as sockets, plugs and power cords. It was not until 2019 that the company pivoted into automotive, producing wiring components and car jacks for both domestic and international brands. Since then, its sales have grown by double digits annually.</p><p>Nguyễn Khánh Linh from An Thinh Technology Co explained that the shift required more than new equipment. The biggest challenge was changing the mindset of the engineering team to meet the automotive industry’s strict quality standards, he told saigontimes.vn.</p><p>In Đồng Nai Province’s Giang Điền Industrial Park, another SME, Vnines Innovation, is making its mark. Founded in 2020, the company focuses on electric motors, controllers and electronic modules for electric vehicles (EVs) and motorbikes.</p><p>According to the deputy director of Vnines' quality management department, Hồ Khắc Tú, his company already supplies major domestic automakers and exports to markets in North America, Europe and Asia.</p><p>Amphenol RF Vietnam, located in Tân Kim Industrial Park in Tây Ninh Province, is one of the newest entrants to the sector. The factory was established in May 2024 following a strategic decision by its US-based parent company to relocate production from China to Việt Nam, Plant Manager Nguyễn Phước Hiền told saigontimes.vn.</p><p>Hiền noted that the facility specialises in assembling RF connectors and RF cables for automobiles.</p><p>Industry experts say the growing participation of SMEs is the clearest indicator of Việt Nam’s advancing auto parts industry.</p><p><span><b>'Thousand-mile' leap in certification and capability</b></span></p><p>Việt Nam's automotive supply chain is not only expanding, it is maturing. As of May 20, 2025, Việt Nam had 858 enterprises and manufacturing facilities certified to the International Automotive Task Force (IATF) standards, up from just 38 facilities a mere 18 months earlier, according to data from the Việt Nam Association for Supporting Industries (VASI). This represents an astonishing 22-fold increase in a short span.</p><p>Việt Nam now ranks second in Southeast Asia, trailing only Thailand (1,947) and ranking ahead of Malaysia (639). On a broader regional scale, Việt Nam is now seventh out of eight countries in Asia listed by IATF that have more than 500 certified facilities.</p><p>Official data from the Ministry of Industry and Trade offers further insight. As of April 2025, more than 360 Vietnamese companies were directly involved in the automotive supply chain.</p><p>When indirect suppliers are included, the ecosystem expands to around 5,000 companies. Of them, 70 per cent supply only domestic manufacturers, 8 per cent serve foreign firms and 17 per cent supply both.</p><p>In total, 25 per cent of Vietnamese enterprises now participate in the global automotive supply chain, reflecting the industry’s growing integration with international markets.</p><p>According to the executive director of Certification, Training and Assessment at SGS Vietnam, Nguyễn Nam Trân, meeting IATF standards opens the door to new markets for Vietnamese suppliers.</p><p><b>Aiming higher</b></p><p>Industry insiders said as Việt Nam's car sales approach the critical threshold of 500,000 units annually, local and foreign automotive suppliers are showing increased interest in expanding operations, signalling a turning point for the country's auto parts industry.</p><p>An Thinh Technology Co said that it aims to begin producing car wiring harnesses in the near future. A wiring harness for a gasoline or electric car can require the participation of up to 10 companies. The firm said it plans to expand its factory, pending approval from a foreign carmaker.</p><p>Meanwhile, Tú from Vnines Innovation revealed plans to increase factory capacity, boost output and diversify into components for electric vehicles and motorbikes.</p><p>SMEs in Việt Nam’s auto parts sector are beginning to pursue their own ambitious goals, but challenges remain along the way.</p><p>For Amphenol RF Vietnam, a major obstacle is talent. As the company plans to expand its factory workforce from 60 to 100 employees by the end of the year, sourcing skilled labour remains challenging, given that most workers in the surrounding Long An area come from agricultural backgrounds.</p><p>At An Thinh, the primary challenge is maintaining compliance with increasingly stringent environmental standards. Accurately measuring greenhouse gas emissions to meet customer requirements has proven to be a complex task. Still, the company – like many others – believes that what was once just a dream is now an achievable milestone for those bold enough to take the leap.</p><p>Việt Nam's auto parts industry is on a fast track to growth, with the market valued at US$4.5 billion in 2023 and projected to exceed $13 billion by 2032. The data comes from a recent report by US-based firm Research and Markets. — VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1724724/viet-nam-s-auto-parts-industry-accelerates-leaving-screw-curse-behind.html",
            "pub_date": "2025-09-17 10:42:31",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Developing LNG power: unlocking bottlenecks",
            "description": "<div id=\"abody\">\n<p>HÀ NỘI — After many efforts to overcome numerous challenges, the first thermal power project using imported LNG, Nhơn Trạch 3&amp;4, is finally expected to begin commercial operation in the fourth quarter of this year.</p><p>Most other LNG projects in the Power Plan VIII are still in the investment phase or looking for investors.</p><p>The goal of putting around 15 LNG power projects into operation before 2030 is proving to be quite difficult.</p><p>This was how Nguyễn Duy Giang, deputy general director of the Petrovietnam Power Corporation (PV Power), said about LNG power project investment at the recent 2025 Annual Oil and Energy Forum with the theme 'Energy Transition: Vision and Action'.</p><p><b>Addressing issues</b></p><p>Sharing the challenges of the Nhơn Trạch 3&amp;4 project, Giang explained that the implementation of the Nhơn Trạch 3&amp;4 LNG power project encountered many obstacles, but PV Power had received help from the Government, Prime Minister and various ministries to address these issues.</p><p>In addition, the project had been allowed by the Government to apply the principle of converting gas prices to electricity prices and was guaranteed a consumption of 65 per cent of the annual LNG electricity output for 10 years.</p><p>This has been a positive sign for other LNG projects, but in reality, many foreign investors still believe that such a 65 per cent electricity output guarantee is below the project's breakeven point.</p><p>They hoped that the guaranteed percentage would be raised to 80-90 per cent for 15-20 years, said Giang.</p><p>In addition, the implementation of LNG power projects also faces difficulties in clearing transmission line capacity under the Power Plan VIII.</p><p>Notably, Nhơn Trạch 3&amp;4 is the first project to borrow foreign capital without government guarantees. This meant other LNG power projects would likely face difficulties, given that the government guarantee mechanism was no longer available, Giang said.</p><p>The reality is that the challenges in implementing LNG power projects are manifold.</p><p>Recently, despite five consortia being invited to bid for the Nghi Sơn LNG power project, none of them submitted any bid documents.</p><p>For PV Power, the reason was that the investment calculations, development strategy, and the 65 per cent electricity output guarantee were not attractive enough to investors, said Giang.</p><p>Meanwhile, T&amp;T Group's decision not to submit a bid was mainly due to bidding terms, particularly the requirement to submit a bid guarantee of 1 per cent of the total investment, which amounted to US$22 million for the Nghi Sơn LNG power project.</p><p>Furthermore, even if an investor wins the bid, it can not immediately proceed with the project as they still have to negotiate contracts with Thanh Hóa Province and the Power Purchase Agreement (PPA) with EVN.</p><p>Assessing the difficulties in implementing LNG power projects, Dr. Nguyễn Quốc Thập, chairman of the Vietnam Petroleum Association (VPA), said that the primary issue was the slow growth of the LNG power consumption market compared to the target set in Power Plan VIII and the adjusted version.</p><p>Many investors are concerned that the high production costs of LNG electricity would make it difficult to sell electricity to the Vietnam Electricity (EVN).</p><p>This was a complex issue that Decree No 56/2025/NĐ-CP, dated March 3, this year, or Decree No 100/2025/NĐ-CP, dated May 8, this year, can not resolve, as they did not address the needs of investors and related companies.</p><p>Notably, there is still no standard PPA for LNG power projects, including both BOT and IPP projects, and the power grid planning is not synchronised with the source development planning.</p><p>Although the Electricity Law allowed private entities to participate in power grid development, current guiding decrees were still vague, Thập pointed out.</p><p><b>Industrial consumers</b></p><p>To address the challenges in LNG power projects, the VPA has proposed the development and enactment of a law on national energy, integrating the Electricity Law, Law on Minerals, and other related laws, as energy is a crucial part of national infrastructure and a foundation for developing all other economic sectors.</p><p>Additionally, the Government should synchronise the planning of LNG ports, LNG power plants, transmission systems and large industrial consumers to attract investment.</p><p>Investment procedures for BOT and IPP projects should be simplified, as current procedures prolong the investment process and put Vietnamese enterprises at a disadvantage.</p><p>A selection mechanism for large-scale, key LNG power projects should also be developed, and guarantees for certain special projects need to be considered.</p><p>The LNG power market is not aimed at general consumers but rather focuses on industrial users who want long-term commitments.</p><p>If future policies address this issue, it would resolve the concerns about guarantees, commitments for output consumption, and LNG supply contracts between power plants and LNG suppliers.</p><p>This would also relieve the Government from worrying about guarantees, and EVN would not have to worry about potential losses or responsibility for guarantees, emphasised the VPA Chairman.</p><p>Additionally, allowing qualified LNG power plant investors to independently invest in infrastructure to connect power plants with electricity buyers is also an important solution to resolve existing difficulties in LNG power project implementation, according to the chairman.</p><p>Proposing a new approach to developing energy transition projects, Nguyễn Đức Hiển, deputy head of Policy and Strategy Department under the Central Economic Commission, emphasised the need to focus on reforming the electricity market, electricity trading mechanisms, electricity prices and resolving pending issues from wholesale to retail.</p><p>In reality, no single policy could solve every problems, he said. Vulnerable groups needed their own specific support policies, while electricity prices must gradually approach market rates, said Hiển.</p><p>As one of the key energy transition pillars for Việt Nam from now until 2035, LNG power is an inevitable trend to replace high carbon-emitting power sources like coal and oil.</p><p>Therefore, to accelerate LNG power projects, ministries and agencies should also make appropriate adjustments when co-operating with foreign investors.</p><p>This is also the realisation of the principle of \"harmonising benefits and sharing risks\" highlighted by Prime Minister Phạm Minh Chính in matters related to economic cooperation and investment, said Giang. — VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1722580/developing-lng-power-unlocking-bottlenecks.html",
            "pub_date": "2025-09-17 10:42:35",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "New tax plan could discourage stock investment: insiders",
            "description": "<div id=\"abody\">\n<p>Compiled by Ly Ly Cao</p><p>HÀ NỘI — Last week’s draft proposal by the Ministry of Finance (MoF) to impose a 20 per cent personal income tax on profits from securities trading has sparked widespread debate among legal experts, market participants, and industry bodies, with many warning it could discourage investment and hinder the growth of Việt Nam’s \"fledgling\" capital market.</p><p>The proposal is part of the ministry’s plan to amend the Law on Personal Income Tax, which includes new regulations for taxing individual earnings from stock market activities. </p><p>Speaking to <i>Tuổi Trẻ</i> (Youth) newspaper, the CEO of a credit rating agency said that the 20 per cent tax on investment profits is not a new concept. Previously, the Personal Income Tax Law allowed individuals to choose between two methods: a provisional tax of 0.1 per cent on the transfer value or applying a 20 per cent tax rate on net income.</p><p>The 0.1 per cent tax on the transfer value was uniformly applied for convenience and to prevent revenue loss.</p><p>The CEO noted that technically, securities companies are able to track the cost base and profit for each stock, so calculating tax on gains is no longer difficult.</p><p>However, he cautioned that the proposed 20 per cent rate is excessively high and could disincentivise retail investors from entering the market.</p><p>Phan Phương Nam, vice dean of the International Law Faculty at Hồ Chí Minh City University of Law, said that investors should be allowed to choose between the two taxation methods, with a gradual shift toward taxing only net profits to ensure fairness. </p><p>\"If the flat 20 per cent tax is applied, investors should also be allowed to carry forward losses, as many experience gains only in one year after several years of investment,\" Nam said.</p><p>He also proposed applying family deductions for professional investors who rely solely on securities income to align with the principles of equitable taxation.</p><p>Nguyễn Hoàng Hải, vice chairman of the Vietnam Association of Financial Investors (VAFI), raised concerns over how interest expenses would be allocated for tax purposes. </p><p>\"If someone borrows VNĐ5 billion ( over US$191,200) to invest in multiple stocks but only sells one, how would you allocate that interest expense in a way that is acceptable to the tax authorities?\" Hải asked.</p><p>He also highlighted that many investors use collateral like real estate to obtain investment loans, further complicating expense tracking.</p><p><b>Nurturing revenue or overtaxing</b></p><p>A securities firm’s executive pointed out that Việt Nam’s capital market is still at an early stage of development and should be nurtured rather than overtaxed. </p><p>\"Tax authorities should focus on growing the tax base by encouraging long-term market participation. Overtaxing could stifle future revenue potential,\" he said.</p><p>Nguyễn Thế Minh, head of the Research and Development Division at Yuanta Securities Vietnam, acknowledged that taxing investment profit aligns with international standards. Still, he recommended a tiered tax system based on holding periods. </p><p>\"Higher tax rates could apply for stocks held under one year, while long-term investments, over ten years, could be tax-exempt. This would both discourage speculative trading and incentivise long-term investment,\" Minh said.</p><p>Another controversial proposal in the draft is to tax stock dividends and bonus shares at the time of issuance, rather than when the investor sells the shares. </p><p>\"Taxing stock dividends immediately upon issuance would make this option less attractive and reduce a valuable tool for companies to reinvest profits,\" according to the Vietnam Chamber of Commerce and Industry (VCCI).</p><p>The General Department of Taxation said that personal income tax collected from securities-based dividends between 2016 and 2024 totalled over VNĐ1.3 trillion. However, under the proposed change, this figure could have reached VNĐ17.4 trillion, a more than 13-fold increase.</p><p>VCCI emphasised that most investors tend to hold such shares long-term, which suggests the deferred tax method better supports reinvestment and enterprise growth. </p><p>\"The VNĐ10 trillion in 'uncollected' taxes is actually retained by businesses and channelled into production, job creation and GDP growth. Taxing it prematurely could disrupt this cycle,\" the organisation warned.</p><p>VCCI further noted that receiving stock dividends does not create immediate income for shareholders, as there is no increase in real asset value at the time of issuance. </p><p>\"This is a technical adjustment in capital structure. Imposing tax here burdens investors financially without corresponding liquidity, especially for those who do not immediately sell the shares,\" the chamber argued.</p><p>Such a move, they stressed, could erode confidence in long-term investing. \"Investors may ask: why receive shares and face future uncertainty when cash dividends offer immediate income and the ability to pay taxes upfront?\"</p><p>VCCI recommended that lawmakers retain the current policy of collecting personal income tax on securities only at the point of transfer. </p><p>This approach not only safeguards investor interests but also supports sustainable revenue streams and corporate development.</p><p>Last week, the MoF also proposed a 20 per cent tax on income from real estate transactions, which would be calculated based on the profit from each transaction (selling price minus purchase price and related costs). </p><p>If the purchase price and costs cannot be determined, the tax will be directly applied to the selling price, taking into account the holding period. —BIZHUB/VNS</p><p> </p><qb-toolbar class=\"qb--mac-os\" contenteditable=\"false\" id=\"qb-toolbar-container\"><qb-div class=\"qb-toolbar__wrapper\"></qb-div></qb-toolbar><qb-toolbar class=\"qb--mac-os\" contenteditable=\"false\" id=\"qb-toolbar-container\"><qb-div class=\"qb-toolbar__wrapper qb-toolbar--small\"></qb-div></qb-toolbar>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1722154/new-tax-plan-could-discourage-stock-investment-insiders.html",
            "pub_date": "2025-09-17 10:42:39",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Double-digit growth is possible, but only with reforms",
            "description": "<div id=\"abody\">\n<p>HÀ NỘI — At the Government's online conference with provincial authorities on 16 July, the Ministry of Finance presented two scenarios.</p><p>The first scenario targets an annual growth rate of 8 per cent in 2025. Under this projection, if GDP growth in the third quarter reaches 8.3 per cent year-on-year, in line with the trajectory outlined in Resolution 154, and fourth-quarter growth hits 8.5 per cent – 0.1 percentage point higher than the base scenario – Việt Nam’s GDP would exceed US$508 billion by year-end, with per capita GDP surpassing $5,000.</p><p>Key growth drivers for the second half of the year under this scenario include total realised investment across the economy at roughly $108 billion, retail sales and consumer service revenue (at current prices) growing by at least 12 per cent, and total import-export turnover for 2025 rising by 16 per cent or more. The average consumer price index (CPI) is expected to remain within the 4.5–5 per cent range.</p><p>In the second – more ambitious scenario which the ministry recommended, the economy projects annual GDP growth of 8.3 to 8.5 per cent. This would require third-quarter growth of 8.9 to 9.2 per cent year-on-year – 0.6 to 0.9 percentage points higher than in the first scenario – and fourth-quarter growth of 9.1 to 9.5 per cent, or 0.7 to 1.1 percentage points above the base case. Under this trajectory, Việt Nam’s GDP would exceed $510 billion by the end of 2025, with per capita GDP reaching over $5,020.</p><p>The main growth levers in this scenario include total realised investment of approximately $111 billion, retail and consumer service turnover rising by at least 13 per cent, and import-export value growing by 17 per cent or more. CPI projections remain unchanged at an average of 4.5 to 5 per cent.</p><p>According to the ministry, alongside capitalising on market opportunities to boost consumption and exports, investment remains the key engine of growth – one that still holds considerable room for expansion. Stronger investment inflows in the second half of 2025 are expected to not only elevate growth in the short term but also lay the foundation for new productive capacity, creating space for the economy to achieve growth of 10 per cent or more in 2026.</p><p>In the first half of 2025, GDP rose 7.52 per cent – the strongest first-half performance since 2011. Exports increased 14.4 per cent to $219.83 billion. Registered FDI reached over $21.5 billion, up 32.6 per cent year-on-year, according to the General Statistics Office<i>.</i></p><p>“These results show that Việt Nam is moving ‘against the wind’, maintaining strong momentum,\" said Deputy Prime Minister Nguyễn Chí Dũng.</p><p>Yet ambition alone is not enough.</p><p>“If we do not adopt new steps or bold approaches, we will never reach these goals,” Dũng added.</p><p>Despite impressive gains, Việt Nam has never achieved double-digit growth. Its long-term average remains around 6.4 per cent. Structural challenges, particularly in productivity and institutional effectiveness, continue to constrain progress.</p><p>Dr Nguyễn Sĩ Dũng, former deputy head of the National Assembly Office, described the current moment as a strategic turning point: “The world is changing rapidly – climate change, digital transformation, geopolitical disputes. Countries that adapt quickly and reform their institutions will rise. Those that hesitate will be left behind.”</p><p>Việt Nam's labour productivity growth is a case in point.</p><p>According to Dr Đặng Đức Anh, deputy director of the Central Institute for Economic Management, average productivity rose from 4.53 per cent (2011–15) to 6.05 per cent (2016–20), but dropped again to 4.67 per cent in the 2021–24 period.</p><p>“The pace of improvement is slowing. Our application of science, technology, and innovation remains limited,” Anh added.</p><p>Emerging sectors such as clean energy, semiconductors, AI, and advanced materials remain underdeveloped. Meanwhile, traditional drivers, like low-cost manufacturing, are losing momentum. The economy still relies heavily on assembly and raw processing, while high-value segments like design and R&amp;D remain weak.</p><p>“These structural weaknesses, if not addressed decisively, will weigh down Việt Nam’s ambitions,” said Đức Anh.</p><p>Institutional reform is widely seen as the cornerstone of a new growth phase.</p><p>“Institutions are the operating system of the economy,” said Nguyễn Sĩ Dũng.</p><p>“Short-term growth can come from capital or labour. But sustainable, innovative growth depends on transparent, effective, and fair institutions.”</p><p>He argued that Việt Nam must begin with a mindset shift, adding: “Reform is not just about passing laws. It’s about building a governance system that is strategic and adaptive.”</p><p>From the business community, Đậu Anh Tuấn, deputy secretary general of the Việt Nam Chamber of Commerce and Industry (VCCI), emphasised two priorities: shift from pre-approval to post-audit governance and improve policy execution.</p><p>“If growth targets are tied to local officials’ KPIs, we will see clearer progress, even in the short term,” Tuấn said</p><p>The energy sector illustrates the stakes. According to Vũ Tú Thành of the US-ASEAN Business Council, Việt Nam should remove capacity quotas in its power plan and allow direct power purchase agreements (DPPA) across clean energy sources.</p><p>“This would unlock investment and strengthen energy security,” he said, adding that Việt Nam has the potential to lead growth in Southeast Asia. But to realise that potential, it must move decisively. Double-digit growth is within reach, but only if reform keeps pace with ambition. — VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1721711/double-digit-growth-is-possible-but-only-with-reforms.html",
            "pub_date": "2025-09-17 10:42:44",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Government’s target of having 2 million enterprises by 2030 under big challenge",
            "description": "<div id=\"abody\">\n<p> </p><p>Compiled by Thu Hà</p><p>HÀ NỘI — Facing many difficulties due to declining market demands, new tariff policies and geopolitical uncertainties in the global market, a Government target of two million enterprises operating in the economy by 2030 has become a big challenge, experts said.</p><p>A report of the Ministry of Finance showed the country had about 940,078 operating enterprises as of early this year, of which nearly 98 per cent were small- and medium-sized enterprises (SOEs). Thus, to have 2 million enterprises by 2030, the country needs to have nearly 1.1 million new enterprises within the next five years.</p><p>According to economist Trần Hoàng Ngân, Việt Nam sees an increase of only 30,000 to 40,000 enterprises a year on average. Therefore, it is very tough for the country to have 2 million enterprises in five years.</p><p>Ngân believes there must be special solutions on improving the business environment and encouraging business households to transform to enterprises.</p><p>\"We can achieve the goal if we have policies to support business households to transform to enterprises. At the same time, we must also improve and expand larger-scale enterprises\", Ngân said.</p><p>Sharing the same view, Đậu Anh Tuấn, Deputy General Secretary of the Vietnam Chamber of Commerce and Industry, said that the country currently had about 5.2 million business households, many of which having annual revenue as high as that of medium-sized private enterprises.</p><p>If only one-third of the business households are changed to enterprises, the goal of having more than 1 million new enterprises in the next five years could be feasible.</p><p>Experts say that as the rate of enterprises withdrawing from the market has often been more than 70 per cent in recent years, it is necessary to have incentive policies to help newly-established enterprises and SMEs to operate and develop in the market.</p><p>National Assembly deputy Trần Thị Vân believes that compared to supporting policies on credit, land access, human resource training and administrative procedure reform, incentives on tax exemption and reduction has a quick and direct impact as they do not have to go through many procedures, helping start-ups and SMEs overcome the initial difficult period and improve their competitiveness.</p><p><b>Solutions</b></p><p>To realise the ambitious goal of having 2 million enterprises, Minister of Finance Nguyễn Văn Thắng has emphasised some key solutions.</p><p>Firstly, the Ministry of Finance is committed to creating a transparent, fair and favourable business environment. Barriers to market entry and compliance costs will be removed through substantial reductions in administrative procedures and reforms of business conditions, according to the minister.</p><p>“Digital transformation in State management will also be promoted to create optimal conditions for businesses to start up and operate, helping to reduce costs and increase confidence in the policy system,” Thắng said.</p><p>From July 1, 2025, all administrative procedures and public services will be provided on the National Public Service Portal, creating a truly ‘one-stop’ system, allowing businesses to conduct all transactions without having to travel to many agencies.</p><p>Secondly, a breakthrough solution is to promote the transformation of business households to enterprises, taking advantage of the potential of more than 5 million business households currently.</p><p>The Ministry of Finance is reviewing and perfecting policies to narrow the gap between business households and enterprises in terms of management, finance and accounting.</p><p>Support policies include exemption of corporate income tax for the first three years of operation, exemption of business license tax, and provision of digital platforms and free accounting software to improve management capacity, according to Thắng.</p><p>These policies have been included in the Government's Resolution with the goal of encouraging business households to transform into enterprises voluntarily and sustainably.</p><p>This not only helps increase the number of enterprises, but also contributes to the transparency of economic activities, expands the formal economic sector, and facilitates small businesses' access to resources such as capital, technology and markets.</p><p>Besides, Thắng said, the Government needed to focus on improving the competitiveness of enterprises, especially in the context of increasingly fierce global competition. Accordingly, the Ministry of Finance proposed to prioritise supporting enterprises in terms of land, capital, market, technology and digital transformation.</p><p>“Bottlenecks such as high logistics costs, lack of an ecosystem supporting digital transformation in the industry, and low labour productivity will be removed through specific policies,” Thắng said.</p><p>The resilience and adaptability of enterprises to economic shocks also needed to be focused on. Programmes to support startups, training, and market connections would be widely implemented, especially in localities with potential for private economic development, Thắng said, adding that the Ministry of Finance would coordinate with ministries, branches, and business associations to ensure that the policies reach the right businesses, bringing high implementation efficiency.</p><p>The minister affirmed that the private economic sector had been identified as the most important driver of the economy, especially when traditional growth drivers such as investment, consumption, and export were under great pressure.</p><p>The strong development of the private sector would strengthen the confidence of people and businesses in the economic prospects, while creating a solid foundation for the 2026-2030 development period with the target of double-digit growth.</p><p>Policies to support private enterprises would not only focus on increasing quantity but also aim to improve quality, helping enterprises participate more deeply in the global supply chain, take advantage of free trade agreements, and contribute positively to the State budget.</p><p>However, Thắng noted, a close coordination between ministries, branches, and localities was necessary to ensure that these policies would be effectively implemented, creating a truly favourable business environment for enterprises. — BIZHUB/VNS</p><p> </p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1720897/government-s-target-of-having-2-million-enterprises-by-2030-under-big-challenge.html",
            "pub_date": "2025-09-17 10:42:47",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Vietnamese start-ups eye global markets through strategic franchising",
            "description": "<div id=\"abody\">\n<p>Compiled by Thu Trà</p><p><span><span>HÀ NỘI — Franchising abroad is emerging as an effective strategy for businesses </span></span>—<span><span> especially start-ups </span></span>—<span><span> to rapidly scale up their operations, enhance brand recognition and open new channels to sell raw materials and services in international markets. </span></span></p><p><span><span>While the opportunities are significant, experts said that success hinges on the internal capabilities and readiness of each business to capitalise on these prospects.</span></span></p><p><span><span><b>Global expansion through franchising</b></span></span></p><p><span><span>As the global franchising model gains momentum, Vietnamese start-ups </span></span>—<span><span> particularly in the food and beverage (F&amp;B) sector </span></span>—<span><span> are increasingly eyeing international markets as a key growth avenue. While established names like Highlands Coffee and Trung Nguyen Legend have paved the way abroad, a new generation of dynamic, creative brands such as Three O’Clock, HappiTea and Pho’S are taking centre stage in this next wave of international expansion.</span></span></p><p><span><span>Among the rising stars, coffee chain Three O’Clock is making notable moves. The brand is set to open its first five franchise stores in India in the next quarter, following a deal with FranGlobal earlier this year. The deal also includes franchise rights for Nepal, Sri Lanka and Bangladesh, <i>thesaigontimes.vn</i> reported. </span></span></p><p>Three O'Clock<span><span> founder and CEO </span></span>Thuận Nguyễn <span><span>told <i>thesaigontimes.vn</i> that her firm aims to open at least 100 stores over the next decade. </span></span></p><p><span><span>She highlighted a growing global shift from tea to coffee among younger demographics as a key market driver. In addition, her brand has recently inked a second exclusive international franchise agreement, expanding into countries within the Gulf Cooperation Council (GCC).</span></span></p><p><span><span>Another standout is Phuc Tea, whose franchise brand HappiTea has established a presence in the Philippines and is now expanding into India, the UAE, Saudi Arabia, Kuwait and Qatar. </span></span></p><p><span><span>Some Vietnamese start-ups in the service sector have also started to go international. </span></span></p><p><span><span>Taking advantage of competitive costs, Gozo Company has signed three franchise contracts in Thailand, opening up the potential for logistics service development in the ASEAN region. </span></span></p><p><span><span>According to CEO Phan Duy Minh, Gozo's advantage lies in its service prices being about 30 per cent lower and its free franchise method, which only requires partners to invest in space, helping to expand quickly without needing large capital.</span></span></p><p><span><span>Meanwhile, Care With Love, which offers health care services for moms and babies at home, has marked its first step into international franchising with the opening of a branch in Cambodia. After nearly four months of operation, the Cambodian franchise has already achieved approximately 80 per cent of its revenue target. </span></span></p><p><span><span>Building on this momentum, the company is planning further expansion into Dubai and other Middle Eastern markets, and is currently in negotiations to enter the Philippines, the online newspaper cited Chairwoman of the Board of Directors </span></span>Trần Thảo Vi<span><span> as saying. </span></span></p><p><span><span>According to Vi, the key to successful franchising in the service sector lies in standardising operational processes and selecting experienced local partners. She said that comprehensive support across recruitment, training and supervision is essential for ensuring consistent service quality and long-term franchise success in international markets.</span></span></p><p><span><span><b>Untapped potential</b></span></span></p><p><span><span>Encouraging signs show that Vietnamese start-ups are increasingly adopting franchising as a flexible and scalable strategy for international expansion. By leveraging digital platforms and forming strategic partnerships, these businesses aim to systematically tap into global markets.</span></span></p><p><span><span>However, despite the growing interest and early momentum, Việt Nam's presence in the international franchising landscape remains limited.</span></span></p><p><span><span>Even Napoli Coffee, one of Việt Nam’s most prominent franchise brands with over 3,000 stores nationwide, currently operates only four international outlets in Laos, Malaysia, South Korea and China.</span></span></p><p><span><span>According to Nguyễn Đức Hưng, CEO of brand owner Napoli Coffee Export Import Trading Production JSC, these overseas stores are primarily operated by individual overseas Vietnamese franchisees and have yet to adopt a standardised, professional franchising model.</span></span></p><p><span><span>In response, the company is now developing international franchising standards, with the goal of expanding its footprint to 100 overseas stores within the next five years, he added.</span></span></p><p><span><span>Experts said that the food and service sectors hold significant potential for international expansion if executed properly. However, small Vietnamese businesses often face major hurdles related to professionalism, operational systems and brand trust when entering foreign markets.</span></span></p><p><span><span>Key challenges include geographical distance, language barriers, maintaining operational control, ensuring consistent service quality, exporting raw materials and securing qualified workers.</span></span></p><p><span><span>Other promising sectors for Vietnamese franchising businesses include beverages, textiles and footwear, experts note. By leveraging local resources, these firms have the potential to move up the value chain </span></span>—<span><span> for example, by processing tea into value-added products like milk tea, rather than exporting raw materials.</span></span></p><p><span><span>In the textile and footwear industries, there is growing potential for building independent brands instead of remaining solely as manufacturing hubs. The franchising trend is also expanding into technology start-ups, including in emerging fields such as logistics, virtual reality and augmented reality.</span></span></p><p>F<span><span>ranchising is an effective strategy for international market expansion across all sectors, according to </span></span>franchise expert Nguyễn Phi Vân<span><span>.  Agricultural products such as tea and coffee have demonstrated the success of this approach. When franchised effectively, these products have seen their value increase by 30 to 70 times, thanks to raw materials, accessories and branding.</span></span></p><p><span><span>Market research firm Technavio has projected the global franchising industry to grow by approximately 10 per cent annually, reaching a value of US$4.38 trillion by 2027. </span></span>— VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1720016/vietnamese-start-ups-eye-global-markets-through-strategic-franchising.html",
            "pub_date": "2025-09-17 10:42:51",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Banks leverage national data integration to reach customers",
            "description": "<div id=\"abody\">\n<p> </p><p>Compiled by Hoàng Anh </p><p>HÀ NỘI — Banks in Việt Nam are developing fully digital lending services, enabling customers to apply for and receive loans entirely through online platforms.</p><p>This digital shift benefits customers with greater convenience while allowing banks to cut costs.</p><p>The national population database is now connected and synchronised with databases from 18 ministries and sectors, four State-owned corporations, and the administrative systems of all 63 provinces and cities. This integration supports data sharing and enrichment, laying the groundwork for cleaner and more comprehensive datasets.</p><p>Access to this massive amount of data allows banks to expand their digital offerings, particularly online lending. Speaking at a recent conference on digital transformation in the banking sector, Nguyễn Thị Ngoan, CFO of MISA, said the company recognised the potential of leveraging this valuable data and launched MISA Lending to connect micro and small enterprises with banks and credit institutions. The platform supports lending based on real-time enterprise data.</p><p>To date, loans worth VNĐ22.5 trillion (US$887 million) have been disbursed via the platform. Thirty per cent of businesses have successfully accessed credit, ten times higher than traditional models, while maintaining risk levels deemed acceptable by banks. Vũ Hồng Phú, a member of MB’s executive board, noted that enterprises with healthy cash flow histories, regular payroll disbursements, and full tax compliance are prioritised for credit approval, possibly without collateral.</p><p>In 2024, MB issued unsecured loans based on data to over 4,000 enterprises, reducing processing time by 80 per cent.</p><p>“A total of 14,500 disbursement orders were executed automatically in just minutes,” Phú said.</p><p>“Previously, each would take two hours; now it only takes five to 15 minutes. This automation saved 36,000 labour hours in 2024, equivalent to 4,500 workdays.”</p><p>At VietinBank, corporate clients can now receive disbursements online via the VietinBank eFAST platform. According to Deputy CEO Trần Công Quỳnh Lân, the bank has processed over 87,000 online disbursement transactions worth more than VNĐ270 trillion, with 36 per cent of corporate loans now disbursed online.</p><p>Meanwhile, MSB has successfully digitised the entire credit approval process by leveraging national data systems, including tax and invoice data, and the national population database. Thousands of businesses have received loans via digital channels, with approvals granted within minutes.</p><p>Đinh Thị Tố Uyên, Deputy CEO of MSB, said that with machine learning capabilities and access to integrated data, including fintech platforms like MISA, we can approve loans within four minutes. Connecting accounting systems and tax data provides real-time insights into a business’s financial health, which allows us to make immediate lending decisions once customers register and provide basic information.</p><p>Banks have been expanding in the personal loan segment through digital channels. Industry experts said that as the digital transformation race in banking accelerates, data cleansing, system integration, and applications of artificial intelligence (AI) and machine learning will become increasingly common. These tools support personalised services, aligning offerings more precisely with customer needs and behaviour. For instance, OCB provides salary-based online loans starting from as little as VNĐ100,000.</p><p>Banks recognise that competitiveness hinges on more than traditional relationships or proximity. The ability to provide timely, relevant, and convenient services is becoming the defining factor. To enhance security for online lending, banks are ramping up security, using big data and AI to assess borrowers’ credit history, spending behaviour, and business performance before approving disbursements.</p><p>Phạm Anh Tuấn, Director of the Payment Department at the State Bank of Vietnam (SBV), stressed that rising cybercrime requires financial institutions to invest heavily in security.</p><p>“As banks use AI to develop products, criminals are also exploiting it for fraud,” he warned.</p><p>As a result, SBV will soon introduce regulations requiring service suspension for digital platforms that fail to meet international standards.  Service providers must remain vigilant, he said, as cybercrime can happen at any time.</p><p>He added that all credit institutions are required to submit information on suspected fraudulent accounts to the SBV to build a shared database. So far, over 350,000 suspicious accounts have been logged, and the database will operate on a win-win principle: institutions that contribute data will also receive shared information in return.</p><p>Since April 1, BIDV has piloted a system that notifies customers if a recipient account is flagged as suspicious. In the first month, 40,000 customers were asked to cancel transactions, avoiding potential fraud totalling VNĐ160 billion. Other major banks, including Vietcombank, MB, VietinBank, and Agribank, are set to adopt this system. After a mid-year review, SBV plans to roll it out sector-wide.</p><p>Once fully implemented, the system will offer customers greater peace of mind when transferring funds, helping to reduce fraud. Ultimately, however, the final decision still rests with the customer. — VNS</p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1719144/banks-leverage-national-data-integration-to-reach-customers.html",
            "pub_date": "2025-09-17 10:42:54",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Land speculation surges amid apartment market stabilisation in Q1",
            "description": "<div id=\"abody\">\n<p>Compiled by Ly Ly Cao</p><p>HÀ NỘI — As the real estate market enters the second quarter of 2025, a noticeable divergence is emerging between different housing segments.</p><p>While apartment prices in key urban centres are stabilising after years of sharp increases, land plots and individual houses in many provincial areas are heating up again and not necessarily for healthy reasons.</p><p>According to a first quarter report by the Ministry of Construction, apartment and house transactions across the country totalled 33,585, up 132 per cent from the previous quarter.</p><p>Land transactions also climbed, reaching 101,049, a 16.4 per cent increase quarter-on-quarter.</p><p>Despite this apparent growth, market dynamics remain uneven.</p><p>In major cities such as Hà Nội, HCM City, Đà Nẵng and Cần Thơ, the market for condominiums and apartments has cooled noticeably.</p><p>Price levels in Q1 were largely flat compared to Q4 2024, indicating a period of consolidation after years of escalation.</p><p>Many experts consider this a natural correction phase.</p><p>In Hà Nội, for instance, primary apartment prices surged by over 72 per cent between Q2 2019 and Q4 2024, while Đà Nẵng saw a near 50 per cent increase and HCM City prices climbed over 34.3 per cent in the same period, according to a study conducted by the Vietnam Association of Realtors (VARS).</p><p>However, recent data suggests that this momentum is now slowing, possibly due to tighter credit conditions, stricter investor sentiment and a gradual shift toward more realistic pricing.</p><p>Additionally, the government’s broader housing strategy is moving forward, albeit with challenges. The national plan to build one million social housing units by 2030 remains a key priority.</p><p>As of Q1 2025, 103 social housing projects have been completed with 66,755 units delivered, while 140 projects are under construction and an additional 414 projects have received investment approval.</p><p>But while apartment prices in urban centres remain relatively stable, land prices in various suburban and rural provinces are exhibiting alarming spikes.</p><p>The report by the Ministry of Construction points to renewed waves of speculation as the driving force, especially in provinces such as Bắc Giang, Phú Thọ, Ninh Bình, Thái Bình, Hưng Yên, Hải Phòng and Đồng Nai.</p><p>One catalyst behind this trend is unverified information about potential administrative changes - notably plans to merge districts or upgrade rural areas into provincial centres.</p><p>“The news of upcoming mergers and administrative restructuring has become fertile ground for land price speculation,” the Ministry of Construction warned.</p><p>Take Bắc Giang and Phú Thọ Provinces, for example. In just a few months, land prices in some districts have surged by 20 – 30 per cent, largely based on rumours that certain localities may become part of larger urban zones.</p><p>Similar patterns are unfolding in Thái Bình and Ninh Bình Provinces, where brokers are marketing land based on speculative future gains rather than actual infrastructure development or demographic demand.</p><p>Experts say such behaviour reflects a speculative mindset that is far removed from long-term, sustainable investment.</p><p>This creates risks not only for individual investors but also for the broader housing market, as land bubbles can distort development priorities and misallocate capital.</p><p>In Đồng Nai Province, the land price situation is particularly sensitive due to its proximity to HCM City and ongoing infrastructure projects such as Long Thành International Airport.</p><p>While some of the price growth in this area may be justified by genuine improvements, the Ministry of Construction cautioned against speculative fever, warning that \"price hikes not based on real demand or planning will lead to volatility and higher risks for buyers.\"</p><p>Authorities have urged local governments to closely monitor transaction data and tighten land use and planning regulations.</p><p>Provinces are being encouraged to provide accurate, transparent updates to residents to combat misinformation and dampen the effects of rumour-driven speculation.</p><p><b>Financing challenges</b></p><p>The report also points out that only 38 out of 63 provinces had submitted project lists for a significant housing credit programme, which aims to provide VNĐ120 trillion (about US$5.2 billion) in loans for social housing.</p><p>So far, the disbursement for this programme has reached only VNĐ3.4 trillion, highlighting the gap between intention and execution.</p><p>The government is working to stimulate lending for housing projects, especially those catering to low-income groups.</p><p>The State Bank of Vietnam has set a target for credit growth in the real estate sector at around 16 per cent for 2025, which is crucial for supporting ongoing housing initiatives. — BIZHUB/VNS</p><qb-toolbar class=\"qb--mac-os\" contenteditable=\"false\" id=\"qb-toolbar-container\"><qb-div class=\"qb-toolbar__wrapper\"></qb-div></qb-toolbar><qb-toolbar class=\"qb--mac-os\" contenteditable=\"false\" id=\"qb-toolbar-container\"><qb-div class=\"qb-toolbar__wrapper qb-toolbar--small\"></qb-div></qb-toolbar>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1718316/land-speculation-surges-amid-apartment-market-stabilisation-in-q1.html",
            "pub_date": "2025-09-17 10:42:59",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Việt Nam enforces e-invoicing for business households to enhance tax transparency",
            "description": "<div id=\"abody\">\n<p><i><b>Compiled by Ly Ly Cao</b></i></p><p>HÀ NỘI — Việt Nam is accelerating its digital transformation in the tax sector by extending the use of electronic invoices (e-invoices) to household businesses, a significant move aimed at reducing revenue loss and enhancing transparency.</p><p>Since June 1, a wide range of business households have been required to issue e-invoices generated directly from cash registers. The e-invoice system allows transactions to be recorded in real time and automatically sent to the tax authorities.</p><p>This is a fundamental change in the tax authority's method of managing household businesses, as stipulated in Decree 70/2025.</p><p>In the first quarter of this year, more than 3.6 million business households across the country contributed nearly VNĐ8.7 trillion (US$334.5 million) to the State budget, marking a more than 30 per cent increase compared to the same period in 2024.</p><p>Household businesses, which include small traders, market vendors and service providers, have traditionally operated with minimal oversight, often issuing paper invoices or none at all.</p><p>Most of them support the new tax management regulations. They believe these changes will help reduce certain risks, such as mistakenly paying taxes due to confusion between personal and business finances, selling goods without issuing invoices and suffering financial losses from not controlling input materials or outgoing orders.</p><p>Many households have proactively started using sales management software like KiotViet, Sapo and Salesbook, which offer tailored solutions for various customer segments and industries.</p><p>However, a few still rely on integrated services like electronic invoices and comprehensive solutions provided by large companies such as Viettel, VNPT and Misa.</p><p>Despite this, some households remain hesitant about changing their business practices.</p><p>Nguyễn Huy Hùng, who operates a catering business on Lý Thường Kiệt Street in Hà Nội, said he invested about VNĐ10 million to install new equipment.</p><p>He also hired a young employee to manage the counter, making it easier to input information and process orders.</p><p>Hùng told <i>the Saigon Times</i> that hiring staff was a reluctant but necessary step since many older employees are not tech-savvy. He also expressed concerns about potential technical issues when the new system goes live, which could lead to mistakes on incoming invoices or delays in issuing invoices.</p><p>This could result in penalties from tax authorities if suppliers fail to provide timely support. Therefore, he hopes the tax authority will create binding agreements with equipment suppliers to ensure they assist business households.</p><p>Nguyễn Hữu Tài, who runs a mobile coffee business in Hà Nội, highlighted the challenges posed by his non-fixed location. He and his staff often face limitations with data transmission and equipment placement, making it difficult to install similar machines to those used in stationary shops.</p><p>As a result, he is exploring service options that can be integrated into phones or compact, user-friendly devices.</p><p>From an expert's perspective, Nguyễn Văn Được, general director of Trọng Tín Accounting and Tax Consulting Company, said that transitioning from paper invoices to electronic invoices may pose initial challenges for business households.</p><p>Not every household or individual business has the necessary technology or equipment, such as cash registers. This lack of resources complicates the transition, as they must invest in new equipment and learn how to use it.</p><p>Additionally, many business households have enjoyed lump-sum tax arrangements in the past, and now they must declare all revenue and expenses, which can create reluctance to comply.</p><p>Được noted that Decree 70/2025 requires business households to make this transition. If the tax authority provides support in terms of policy and technology, and taxpayers have the necessary conditions yet still delay compliance, penalties may be imposed. Thus, it’s essential to gradually ease these constraints to support business households while ensuring accountability.</p><p>Currently managing over 271,000 business households, nearly 30 per cent more than the same period in 2024, the Tax Department of Region I is actively collaborating with all districts and localities to ensure that no unregistered households are overlooked.</p><p>The authority is also adding to its management list all business households required to use invoices generated from cash registers.</p><p>\"From now until June 1, we will launch public awareness campaigns to address the challenges faced by business households during this transition,” Nguyễn Tiến Minh, deputy head of the Tax Department of Region I under the Ministry of Finance, told<i> </i><i>vtv.vn</i>.</p><p>“We will partner with electronic invoice solution providers to offer the best support tailored to the needs of these households, linking electronic invoices from cash registers with electronic tax declarations.\"</p><p>The Minister of Finance has also reached out to leaders of various provinces and centrally governed cities, urging them to support the tax sector in promoting the nationwide implementation of electronic invoices from cash registers.</p><p>Nevertheless, the mandate comes with clear enforcement measures. Household businesses that fail to register for or issue e-invoices as required may face administrative penalties, including fines and potential suspension of operations. — BIZHUB/VNS</p><p></p>\n\n</div>",
            "link": "https://vietnamnews.vn/economy/business-beat/1716993/viet-nam-enforces-e-invoicing-for-business-households-to-enhance-tax-transparency.html",
            "pub_date": "2025-09-17 10:43:02",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        }
    ]
}