{
    "data": [
        {
            "title": "Starbucks (SBUX) and the Coffee Conundrum",
            "description": "<div class=\"RichTextArticleBody RichTextBody\">\n<p>Like many coffee aficionados, I have something of a love/hate relationship with <b>Starbucks (SBUX)</b>. My main gripe is that the company’s food and beverage offerings have always been pricey compared to the fare served in most <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/value-stocks/fast-food-on-the-chopping-block\">fast-food restaurants</a></span> and run-of-the-mill coffee houses.</p><p>On the other hand, Starbucks coffee houses tend to be very inviting compared to others, with the intoxicating aroma of freshly brewed java greeting the customer while the décor, background music and overall ambience can be quite relaxing. The free wi-fi for those who want to bring their laptops and work while sipping is an added bonus.</p><p>And while I’ve always found their famous house coffee, Pike Place Roast, to be bitter tasting and disagreeable, some of their other flavors and blends make up for that (admittedly perceived) shortcoming.</p><p>My personal favorite flavored coffee by Starbucks is Maple Pecan: While not consistently available as a standard brewed coffee or syrup option in Starbucks cafe locations, it has historically been a ground coffee and K-cup option available at grocery stores during the fall season. In fact, the flavor has built up such a cult following over the last few years that Walmart (in particular) and other stores have been carrying it year-round since at least 2023.</p><p>Like virtually everything else, the price of this offering has risen in the last few years, jumping from its 2020-2022 average price of $9.95 per bag in my neck of the woods to $14.47 in the last couple of years (which was the price at which I recently purchased it). Imagine my surprise, then, when I returned to buy another bag a couple of weeks ago and saw it had risen to $17.13—a whopping 18% increase in just one week!</p><p>Maple Pecan isn’t the only Starbucks bagged coffee that has increased in cost lately, as many of its other blends have witnessed similar nationwide price hikes in early 2026. I mention this because, up until my sticker shock experience this week, I had been seriously contemplating adding SBUX to the <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/https:/investments.cabotwealth.com/website-cabot-turnaround-letter\"><i>Cabot Turnaround Letter</i></a></span> portfolio once again, as discussed in a recent issue. (We made a nice profit in SBUX in late 2024/early 2025 before taking profits on it in the <i>Cabot Turnaround Letter</i>.)</p><p>But after seeing the latest price hike (which I have since confirmed was more than just a local phenomenon), it has forced me to take a closer look at what exactly is going on not only at Starbucks, but in the retail coffee industry at large.</p><p>As it turns out, the factors driving price jumps in Starbucks coffee have been impacting coffee prices categorically across the nation for the past year. Recent government data show that coffee is, in fact, one of the fastest-growing food categories for inflation in U.S. grocery stores. And as one industry source put it, “A $2 to $3 jump in a premium flavored coffee bag in a short period of time isn’t unusual in this environment.”</p><p>[text_ad]</p><p>Industry experts inform us that prices paid by consumers are largely determined by how much roasters pay for raw coffee beans, but other major factors include weather/climate in key growing regions like Colombia and Brazil, plus labor and fertilizer costs. More recently, tariffs have been a driving force behind coffee price increases.</p><p>Each of the aforementioned factors has been negatively converging on the industry in the last couple of years, pushing prices higher on the retail level. On the tariff front, a Reuters report in December noted that coffee drinkers still face higher prices even after Trump’s recent rollback on the tariffs that he placed on the commodity last summer. “Costs are mostly still filtering through supply chains and have yet to reach consumers,” Reuters acknowledged.</p><p>Beyond the tariffs, experts say the high retail prices for coffee have been primarily driven by the worldwide coffee bean supply shortages of the last four years, which have resulted in a more than doubling of raw bean prices in just the 12 months between March 2024 and March 2025!</p><p>On that score, an international industry trade house has released its latest revision of independent coffee crop forecasts for major producer Brazil, projecting the country’s total coffee production for the July 2026 to June 2027 season at approximately 76 million bags. If realized, this amounts to a sizable annual increase over previous years—around 20%.</p><p>According to coffee trading company I&amp;M Smith Ltd., “These projections still point toward a recovery in production and [the] large Brazilian harvest to come. Which, if it comes to fruition, will provide welcome relief to the global supply pipeline. A larger Brazilian output is viewed as essential to meet domestic consumption requirements and to sustain average annual exports of approximately 43 million bags to consuming markets.”</p><p>Industry analysts estimate that it takes at least nine months for raw bean prices to ripple down to the retail level, and the predicted coffee production surplus is expected to push arabica beans down by around a third of their current cost by this year’s fourth quarter, per a Rabobank report (see chart below). As an inveterate coffee consumer, all I can say is “here’s hoping!”</p><div class=\"Enhancement ImageEnhancement\" data-align-center=\"\">\n<div class=\"Enhancement-item\">\n<figure class=\"Figure\">\n<a class=\"AnchorLink\" data-cms-ai=\"0\" id=\"image-d40000\" name=\"image-d40000\"></a>\n<picture>\n<source height=\"422\" media=\"(min-width: 768px)\" srcset=\"https://cabot.brightspotgocdn.com/dims4/default/a123557/2147483647/strip/true/crop/1033x727+0+0/resize/600x422!/format/webp/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8f%2Fad%2F428efe1a4033b293d31bc0268620%2Fcoffee-production-surplus.png 1x,https://cabot.brightspotgocdn.com/dims4/default/798fb5d/2147483647/strip/true/crop/1033x727+0+0/resize/1200x844!/format/webp/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8f%2Fad%2F428efe1a4033b293d31bc0268620%2Fcoffee-production-surplus.png 2x\" type=\"image/webp\" width=\"600\"/>\n<source height=\"422\" media=\"(min-width: 768px)\" srcset=\"https://cabot.brightspotgocdn.com/dims4/default/26e442c/2147483647/strip/true/crop/1033x727+0+0/resize/600x422!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8f%2Fad%2F428efe1a4033b293d31bc0268620%2Fcoffee-production-surplus.png\" width=\"600\"/>\n<source height=\"327\" srcset=\"https://cabot.brightspotgocdn.com/dims4/default/8dc7136/2147483647/strip/true/crop/1033x727+0+0/resize/464x327!/format/webp/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8f%2Fad%2F428efe1a4033b293d31bc0268620%2Fcoffee-production-surplus.png 1x\" type=\"image/webp\" width=\"464\"/>\n<source height=\"327\" srcset=\"https://cabot.brightspotgocdn.com/dims4/default/6315fa6/2147483647/strip/true/crop/1033x727+0+0/resize/464x327!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8f%2Fad%2F428efe1a4033b293d31bc0268620%2Fcoffee-production-surplus.png\" width=\"464\"/>\n<img alt=\"coffee production surplus.png\" class=\"Image\" height=\"327\" loading=\"lazy\" src=\"https://cabot.brightspotgocdn.com/dims4/default/6315fa6/2147483647/strip/true/crop/1033x727+0+0/resize/464x327!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8f%2Fad%2F428efe1a4033b293d31bc0268620%2Fcoffee-production-surplus.png\" srcset=\"https://cabot.brightspotgocdn.com/dims4/default/6315fa6/2147483647/strip/true/crop/1033x727+0+0/resize/464x327!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8f%2Fad%2F428efe1a4033b293d31bc0268620%2Fcoffee-production-surplus.png 1x\" width=\"464\"/>\n</picture>\n</figure>\n</div>\n</div><p><i>Source: Reuters</i></p><p>As for <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/value-stocks/starbucks-sbux-pricing-itself-out\">Starbucks</a></span>, the recent price increases aren’t expected to significantly dent demand for its products since the company caters to a predominantly upper-middle-class clientele and promotes its offerings as “affordable luxuries” for customers with higher disposable incomes. Analysts, on balance, don’t seem to be too concerned that the recent price hikes will significantly dent revenue; in fact, the consensus is for revenue to increase modestly this year (by 3% year-on-year) while comparable store sales are projected to improve. Earnings, meanwhile, are expected to increase 7%.</p><p>However, Starbucks’ higher operating costs are constraining margins (indeed, one news outlet described the margin trend as “sinking”), as well as ongoing investments in store operations and some of its recent turnaround initiatives. Consequently, margins aren’t expected to fully rebound this year, which could serve as a deterrent for some investors.</p><p>That said, recent metrics suggest that the overall turnaround under CEO Brian Niccol is proceeding apace, with domestic store growth reported for the first time in two years in January, and with plans to open an ambitious 600 to 650 net new company-owned and licensed cafes in fiscal 2026.</p><p>In its recent Analyst/Investor Day, the top brass acknowledged that “targeted pricing” will likely be needed this year in order to offset inflation, as well as “technology-driven productivity efficiencies where practical,” adding that innovation will be a primary driver of higher sales despite the higher prices.</p><p>The company further expects the cost savings from its strategic initiatives will propel growth going forward, and I believe this assessment will prove correct. The projected coffee supply increase—and presumptive retail price declines later this year—should also help, as should the company’s multi-pronged strategic improvements (which are starting to gain traction).</p><p>All told, I still believe Starbucks’ longer-term turnaround prospects are intact in spite of the current coffee price spikes and company margin issues.</p><p>[author_ad]</p>\n</div>",
            "pub_date": "2026-02-27 15:05:41",
            "link": "https://www.cabotwealth.com/daily/value-stocks/starbucks-sbux-coffee-conundrum",
            "image": "https://cabot.brightspotgocdn.com/dims4/default/d7d49e5/2147483647/strip/true/crop/1103x833+78+0/resize/90x68!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F37%2F76%2F0b14aab73eb5b672041ffe19d3b1%2Fstarbucks-coffee-cups.jpg",
            "source": "cabotwealth",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Cannabis Rescheduling Remains on Track",
            "description": "<div class=\"RichTextArticleBody RichTextBody\">\n<p>We continue to get solid signals from the Trump administration that cannabis rescheduling is on track.</p><p>This makes cannabis stocks a buy ahead of a potentially big move up in these names on actual rescheduling news.</p><p>Before we get to the most recent positive signals from the administration on rescheduling, here’s the backdrop.</p><h2><b>Rescheduling 101</b></h2><p>Back in late December, <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.whitehouse.gov/presidential-actions/2025/12/increasing-medical-marijuana-and-cannabidiol-research/\" rel=\"noopener\" target=\"_blank\">President Donald Trump surprised conservatives by ordering Attorney General Pam Bondi to reschedule cannabis</a></span>. Trump believes cannabis has medical benefits, and he also needs the swing and youth votes in the upcoming midterms.</p><p>Rescheduling would really help cannabis companies since it would neutralize an <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/cannabis-stocks/280e-hidden-tax-benefits-cannabis-companies\">IRS rule that blocks the deduction of operating expenses against revenue</a></span> from the sale of drugs in Schedule I of the Controlled Substances Act. Rescheduling would move cannabis to Schedule III.</p><p>Trump told Bondi to act expeditiously. Now it’s been two months, so the cannabis crowd is losing heart. Cannabis stocks are in the doldrums. But they will get a big bounce if rescheduling actually happens, which I believe will be the case. The timing is hard to predict, but Trump did ask Bondi to act quickly.</p><p>Though the rescheduling delays have turned the cannabis investing crowd negative, I remain fairly certain rescheduling will happen. We continue to get solid signals from the White House that rescheduling is on track. Rescheduling will be a significant catalyst for cannabis stocks.</p><p>[text_ad]</p><h2><b>3 Bullish Rescheduling Signals</b></h2><p>Here are the three recent bullish signals from the Trump administration on rescheduling.</p><p>1) The first sign came after former drug czar Bill Bennett criticized rescheduling in a media interview. The White House responded by reiterating that it isn’t backing down on the rescheduling reform.</p><p>Bennett, the nation’s first drug czar under President George H.W. Bush, spoke out against President Donald Trump’s rescheduling plan in a Fox News Digital interview. “I love almost everything he does, but I don’t love this,” he said. Bennett claimed cannabis is a “gateway drug” that harms academic performance. He’s also unhappy about the cultural normalization of cannabis among young people.</p><p>Following Bennett’s anti-cannabis comments, the White House made it clear it will stay the course on rescheduling. “The President’s historic action paved the way for the development of promising new treatments for American patients, especially veterans,” White House spokesman Kush Desai subsequently told Fox News Digital.</p><p>2) In a recent Fox Business interview, Food and Drug Administration Commissioner Marty Makary also reiterated the administration’s intent to reschedule to promote medical research. He said the Trump administration is “very serious” about making sure that the medical use of cannabis is advanced. “And so, we’ve taken action to change the scheduling from Schedule I to Schedule III,” he said in the interview.</p><p>3) A third sign that the White House won’t drop the ball on rescheduling happened when Trump recently pardoned a former NFL star who was convicted of trafficking cannabis. All told, Trump granted cannabis-related clemency to five ex-NFL players. They included Nate Newton, who helped the Dallas Cowboys win three Super Bowls in the 1990s. Newton was convicted in 2002 in Texas for possessing 175 pounds of cannabis. The Trump pardons do not directly address rescheduling, but it is a confirmation that Trump is oddly cannabis friendly.</p><p>For suggestions on the best stocks and exchange-traded funds to own ahead of this rally, <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/https:/investments.cabotwealth.com/website-cabot-cannabis-investor\">subscribe to <i>Cabot Cannabis Investor</i> here</a></span>.</p><p>[author_ad]</p>\n</div>",
            "pub_date": "2026-02-26 15:10:16",
            "link": "https://www.cabotwealth.com/daily/cannabis-stocks/cannabis-rescheduling-remains-on-track",
            "image": "https://cabot.brightspotgocdn.com/dims4/default/36b3d28/2147483647/strip/true/crop/1869x1412+128+0/resize/90x68!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F2c%2F57%2Ff8e05aa34d24b9ac6c01a9cb84c7%2Fistock-1327731035.jpg",
            "source": "cabotwealth",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "The International Small-Cap ETFs Crushing Global Markets",
            "description": "<div class=\"RichTextArticleBody RichTextBody\">\n<p>With both U.S. small-cap stocks and international stocks posting some of the strongest returns in the market, an obvious question begs to be asked … why not combine these themes and add exposure to international small-cap stocks right now?</p><p>There are, of course, major differences between U.S.-focused small-cap stocks and small caps domiciled in other countries. But let’s put that discussion aside for today and just look at performance to see if this idea is worth exploring.</p><p>Year to date, the <b>S&amp;P 600 Small-Cap Index ETF (IJR)</b> is up 6.2%, well ahead of the flat performance of the S&amp;P 500 and the -1.9% return of the Nasdaq.</p><p>Meanwhile, the <b>iShares All Country World ex-US MSCI (ACWX)</b> is up 8%. And the <b>iShares MSCI Emerging Markets ex China ETF (EMXC) </b>is up a whopping 14.5%.</p><p>Clearly, there is something going on with both small caps and <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/international-stocks\">international stocks</a></span>. I’ve written extensively about <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/small-cap-stocks/why-russell-2000-is-crushing-rest-of-market\">why U.S. small caps are doing well</a></span>; so, for today, I want to focus on why international stocks are performing and then run through some options for how you can get exposure through international small-cap ETFs.</p><p>[text_ad]</p><h3><b>Why International Markets Are Outperforming</b></h3><p>The <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.nytimes.com/2026/01/31/business/sell-america-dollar-financial-markets.html\" rel=\"noopener\" target=\"_blank\">“Sell America”</a></span> trade that emerged in 2024 gained significant momentum through 2025 and into 2026. At its core, this trend reflects a bet that the extended era of American economic and market dominance is shifting.</p><p>Adding credibility to this view is a <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/stock-market/dollar-weakness-elephant-in-room\">weak dollar</a></span>, which is creating a currency tailwind for U.S. investors in international stocks. This is because favorable exchange rate movements enhance USD-denominated returns from overseas equities.</p><p>Also, valuation gaps between U.S. and international markets have become too wide to ignore. Overseas stock markets trade at significantly lower price-to-earnings ratios while still housing many high-quality companies. <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/international-stocks/emerging-market-bull-is-roaring-2026\">Emerging markets</a></span> look especially appealing from a valuation perspective, and for some investors offer a compelling risk-reward profile as compared to stretched U.S. equity valuations.</p><p>Finally, geopolitical and policy shifts are redistributing global capital flows. One outcome is that there’s been an uptick in <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/international-stocks/profit-from-great-rebalancing\">global capital rotating out of U.S. stocks and into European, Japanese, and emerging markets</a></span>.</p><p>To be clear, I’m not suggesting we should all go out and sell out of American stocks entirely. However, it does make sense to consider tactical rebalancing to ramp up international exposure.</p><h2><b>How To Gain Exposure to International Small-Cap Stocks</b></h2><p>There are many ways to gain international exposure with individual stocks. But for many investors who don’t want to take on company-specific risk and deal with buying stocks on foreign exchanges, the easiest will be a diversified international small-cap ETF.</p><p>There are numerous options available. Here are six options I like that can get the job done.</p><h3><b>Build International Exposure with Small-Cap ETFs: Six Ideas</b></h3><p><b>iShares International Small-Cap Equity Multifactor ETF (ISCF)</b><br/>This ex-U.S. developed-market ETF focuses on equities scored on quality, value, momentum and low volatility. It has $611 million in assets under management (AUM), launched in 2015 and has an expense ratio of 0.23%. It is heavily focused on APAC (38%), Europe (37%), and the Americas (18%), with significant sector exposure to financials (24%) and industrials (20%). The ISCF yields around 3.4%. The ETF is up 8.2% YTD.</p><p><b>iShares MSCI EAFE Small-Cap ETF (SCZ)</b><br/>SCZ is a much more popular fund than the ISCF, as evidenced by having $14 billion in AUM. It’s also been around longer, having launched in 2007. The expense ratio is a little higher at 0.4%, and the dividend is a little lower, at 3.0%. Interestingly, the fund’s performance isn’t much different from that of the ISCF lately, having returned 8.4% YTD. Geographic exposure is a little different (though not much), with 47% in APAC, 33% in Europe and 14% in the Americas. The SCZ is heavy on financials (25%), industrials (18%) and materials (12.6%).</p><p><b>iShares MSCI Europe Small-Cap ETF (IEUS)</b><br/>The IEUS has a YTD gain of 4.9%. As the name states, this is a Europe-focused fund (66% weight). The IEUS allocates 18% to the Americas and 9.9% toward APAC. Financials (26%) and industrials (22%) are the two biggest sector weights. The IEUS is not a hugely popular fund, with just $153 million in AUM. But it yields 3%, has been around since 2007 and its European focus may be just what some investors are looking for.</p><p><b>WisdomTree International SmallCap Dividend Fund (DLS)</b><br/>WisdomTree’s DLS ETF isn’t the biggest small-cap fund out there, but it has $1 billion in AUM and has been around since 2006, so it’s relatively well-known. The dividend yield is a healthy 3.5%, and YTD performance of 8.9% is solid. Geographic exposure is heavy on APAC (43%) and Europe (38%), with financials (22%), industrials (20%) and materials (12%) the three highest sector weights.</p><p><b>Schwab Fundamental International Small Equity ETF (FNDC)</b><br/>Schwab’s small-cap international funds are among the best-performing out there. The FNDC has returned 11% YTD, making it the best performer of this group in 2025. FNDC has $3 billion in AUM, and it offers a respectable dividend yield of 3.4%. Geographic and sector exposure is similar to the DLS from WisdomTree, though FNDC has a little more APAC (49%) and a little less Europe (27%). As the name suggests, the ETF has a fundamental focus. Firms with the right mix of adjusted sales, operational cash flow, dividends and buybacks are the focus.</p><p><b>Schwab International Small-Cap Equity ETF (SCHC)</b><br/>Schwab’s SCHC ETF ditches the fundamental focus and simply covers the bottom 10% of the eligible universe of stocks in the FTSE Developed ex-US Index with market caps over $150 million. The lack of a fundamental screen hasn’t hurt much lately. The fund is up 10.3% YTD. It is larger than the FNDC in terms of AUM, which sits at $6 billion. Compared to the FNDC, European exposure is a bit higher (34%) and APAC a bit lower (36%). Again, sector exposure is heavy on financials (23%), industrials (18%) and materials (16%).</p><h3><b>Which International Small-Cap ETF to Buy?</b></h3><p>Any of the above small-cap ETFs should work for their intended purpose. My suggestion would be to diversify between two or three to capture different geographic tilts and investment philosophies. Be sure to mix in at least one with a dividend focus and one with a fundamental focus. Both should give some downside protection.</p><p>As always, be sure to average in.</p><p>[author_ad]</p>\n</div>",
            "pub_date": "2026-02-25 15:06:05",
            "link": "https://www.cabotwealth.com/daily/small-cap-stocks/international-small-cap-etfs-crushing-global-markets",
            "image": "https://cabot.brightspotgocdn.com/dims4/default/4a91fae/2147483647/strip/true/crop/3436x2596+200+0/resize/90x68!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F15%2F20%2Fedd6f55845f29375ba0806cb82fb%2Fistock-1263178673.jpg",
            "source": "cabotwealth",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Why the Emerging Market Bull Is Roaring Into 2026",
            "description": "<div class=\"RichTextArticleBody RichTextBody\">\n<p>Emerging market stocks are off to their fastest relative outperformance ever, so far in 2026.</p><p>The cycle of interest in emerging markets waxes and wanes. Due to its performance in 2025, it is back in the spotlight and headlines. Emerging market (EM) equities are building on momentum from 2025, when they were up 33% – more than double the returns of the S&amp;P 500.</p><p>There are multiple reasons for this surge, which is moving into a higher gear so far this year.</p><p>A <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/international-stocks/stocks-strong-weak-dollar\">weaker U.S. dollar</a></span> is one driver, tariffs leading to more regionally integrated economic growth is another. Under pressure from President Trump’s tariffs, countries around the world are rushing into new trade deals, such as India recently signing deals with South Korea, Canada, Brazil, and the European Union.</p><p>In addition, emerging market earnings are accelerating. Despite impressive gains, EM stocks still offer investors lower valuations relative to U.S. markets. Finally, tech-heavy Asian markets, and stronger economic growth, are all winds at the back of emerging markets.</p><p>[text_ad]</p><h2>Emerging Market ETFs Are One Way to Play It</h2><p>Exchange-traded funds (ETFs) are also being launched hand over fist, and there are now more publicly traded ETFs than stocks. Morningstar reports that investment firms launched 997 new actively managed ETFs in the U.S. last year, nearly triple the average of the previous five years.</p><p>Many investors automatically reach for a broad <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/international-stocks/emerging-markets-etfs-gain-steam-choose-carefully\">emerging market ETF</a></span> such as the <b>iShares MSCI Emerging Market ETF (EEM)</b>.<b> </b>The <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/https:/investments.cabotwealth.com/website-cabot-explorer\"><i>Cabot Explorer</i></a></span><i> </i>goes a step further to screen<i> </i>stocks for higher-quality companies by dividend yields with the <b>WisdomTree Emerging Markets High Dividend Fund (DEM)</b>.</p><p>This is just a start since the emerging markets moniker is, in many ways, an outdated concept.</p><p>It was first used by <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.uopeople.edu/about/leadership/antoine-van-agtmael/\" rel=\"noopener\" target=\"_blank\">Antoine van Agtmael</a></span>, an economist at the International Finance Corporation (IFC), a division of the World Bank, in 1981 as a more acceptable term than “Third World” economy. Wall Street quickly adopted it as a good marketing term, highlighting higher growth prospects in these markets.</p><p>Investors in the<b> iShares MSCI Emerging Market ETF (EEM) </b>may think they are getting exposure to a wide variety of markets, but 45% of their money is going to China and Taiwan. Add South Korea and India, and you get to almost 75%.</p><p>But the collection of countries in the emerging basket varies widely, including Vietnam, Brazil, Mexico, South Africa, Indonesia, Russia, Saudi Arabia, and Malaysia. That is why my mantra when speaking about investing in emerging markets is “look under the hood” to see what you are buying. This goes for investing in ETFs or specific stocks.</p><p>For example, the <b>iShares MSCI South Korea ETF (EWY)</b> currently has 93 positions. That sounds well diversified, but when you look at the holdings, you’ll see that EWY has two holdings comprising 47% of this ETF’s assets. Very few investors realize this tremendous concentration. Those companies are Samsung and SK Hynix. This has been great as this ETF soared in 2025 and it is difficult to invest directly in Samsung without access to the Korean stock exchange.</p><p>The <b>Vanguard FTSE Emerging Markets ETF (VWO)</b> is one of the largest, low-cost (only 0.07% expense ratio) funds tracking over 5,000 stocks in emerging economies.</p><p>Country-specific ETFs are a creative way of building a portfolio and learning more about specific markets. The <b>iShares MSCI India ETF (INDA)</b> is getting a lot of attention as India’s GDP is forecast to grow 6.9% in 2026 as AI hyperscalers build out data centers.</p><p>ETFs are pushing the envelope of risk, so I advise some caution. There are now about 400 single-stock ETFs trading on the market. The highly risky funds use strategies to produce a target of double or triple the daily return of an underlying stock.</p><h3>...But There’s a Better Way</h3><p>Emerging market stocks are still the best way to zero in on opportunities.</p><p>This week, the <i>Cabot Explorer</i> will recommend a South Korean stock trading at a deep discount despite double-digit revenue growth. <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/https:/investments.cabotwealth.com/website-cabot-explorer\">Join the <i>Cabot Explorer</i></a></span> today so you don’t miss this opportunity.</p><p>[author_ad]</p>\n</div>",
            "pub_date": "2026-02-24 15:06:03",
            "link": "https://www.cabotwealth.com/daily/international-stocks/emerging-market-bull-is-roaring-2026",
            "image": "https://cabot.brightspotgocdn.com/dims4/default/302cf95/2147483647/strip/true/crop/794x600+203+0/resize/90x68!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F51%2F45%2Faf8ee688f98322e2ea95d814b478%2Fbull-market-volatility.jpg",
            "source": "cabotwealth",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Dollar Weakness: The Elephant in the Room",
            "description": "<div class=\"RichTextArticleBody RichTextBody\">\n<p>The long-awaited promise of inflation’s “impending” demise remains distant as we head further into 2026.</p><p>Economists have been assuring us since at least 2023 that inflation is abating. But far from this, what we’re actually seeing is a persistently <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/international-stocks/stocks-strong-weak-dollar\">weak dollar</a></span> that is keeping prices elevated across several asset categories.</p><p>Unfortunately, due to the somewhat politically sensitive nature of this topic, persistent inflation also serves as an inexpedient subject—a proverbial “elephant in the room”—that many analysts shy away from discussing. But given the impact that currency weakness is having on a huge swath of assets, it cannot be so easily ignored by investors right now.</p><p>Reasons for the dollar’s increasing weakness range from supply shocks—particularly as it pertains to the disruptive impact of global wars—and policy impositions (including tariffs) in recent years that have, in some cases, undermined private sector production. These events have converged to restrict the ready availability of goods in some markets, even as <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/stock-market/qes-return-means-more-asset-price-inflation\">money “printing”</a></span> continues apace.</p><p>In other words, the prevailing conditions over the last few years have allowed for inflation’s classic definition of “too much money chasing too few goods” to exert a negative influence on consumers.</p><p>[text_ad]</p><p>For instance, according to a poll conducted last fall by the PNC’s <i>Financial Wellness in the Workplace Report</i>, two-thirds (67%) of Americans live paycheck to paycheck. Meanwhile, Axios reports that at least 65% of Americans “feel financially squeezed at least some of the time each month.” The percentage of Americans reporting cost-of-living pressures is up significantly in each of the last two years, and based on recent currency trends, it’s unlikely this year will buck that trend.</p><p>A recent event in the currency market drew further attention to this problem after an intervention by the Federal Reserve a few weeks ago. According to an article in <i>Fortune</i>, the <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://fortune.com/2026/01/26/fed-rate-check-us-dollar-gold/\" rel=\"noopener\" target=\"_blank\">dollar’s decline</a></span> was due to the New York Fed, at the behest of the U.S. Treasury, conducting a “rare rate check” with currency traders on the dollar/Japanese yen exchange rate.</p><p>Currency traders were apparently spooked by the rate check and began selling the dollar, forcing it into what <i>Fortune</i> called “an unusually steep decline given the gargantuan scale of the dollar in the global economy.” The result was the U.S. Dollar Index (DXY) plummeting to its lowest level in four years—an event that can signal or precede higher inflation.</p><p>Another result of the weakening dollar has been the relentless rise in precious metals prices like <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/precious-metals-investing/10-000-gold-isnt-crazy\">gold</a></span> and silver, with the yellow metal briefly hitting a lifetime high of $5,600 an ounce a couple of weeks ago before pulling back. And while gold is still below that all-time high, its persistent strength reflected in the rising trend of the last several months is another indication of just how entrenched dollar weakness has become.</p><p>Another consequence of currency weakness has been a surge in crude oil prices. Light sweet crude oil futures are up 22% from last year’s low around Christmas, in part due to dollar weakness (which magnifies rallies). And of course, stronger oil prices increase transportation costs, which in turn eventually filter into higher prices for a wide range of consumer goods.</p><div class=\"Enhancement ImageEnhancement\" data-align-center=\"\">\n<div class=\"Enhancement-item\">\n<figure class=\"Figure\">\n<a class=\"AnchorLink\" data-cms-ai=\"0\" id=\"image-1b0000\" name=\"image-1b0000\"></a>\n<picture>\n<source height=\"310\" media=\"(min-width: 768px)\" srcset=\"https://cabot.brightspotgocdn.com/dims4/default/dcf7a58/2147483647/strip/true/crop/1253x647+0+0/resize/600x310!/format/webp/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F21%2Ffb%2Ffbd76a9447b9bb2775d143b73823%2Flight-crude-oil-price-chart-2-20-26.png 1x,https://cabot.brightspotgocdn.com/dims4/default/54dcc25/2147483647/strip/true/crop/1253x647+0+0/resize/1200x620!/format/webp/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F21%2Ffb%2Ffbd76a9447b9bb2775d143b73823%2Flight-crude-oil-price-chart-2-20-26.png 2x\" type=\"image/webp\" width=\"600\"/>\n<source height=\"310\" media=\"(min-width: 768px)\" srcset=\"https://cabot.brightspotgocdn.com/dims4/default/d5af8e4/2147483647/strip/true/crop/1253x647+0+0/resize/600x310!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F21%2Ffb%2Ffbd76a9447b9bb2775d143b73823%2Flight-crude-oil-price-chart-2-20-26.png\" width=\"600\"/>\n<source height=\"240\" srcset=\"https://cabot.brightspotgocdn.com/dims4/default/19e743c/2147483647/strip/true/crop/1253x647+0+0/resize/464x240!/format/webp/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F21%2Ffb%2Ffbd76a9447b9bb2775d143b73823%2Flight-crude-oil-price-chart-2-20-26.png 1x\" type=\"image/webp\" width=\"464\"/>\n<source height=\"240\" srcset=\"https://cabot.brightspotgocdn.com/dims4/default/b68e0e4/2147483647/strip/true/crop/1253x647+0+0/resize/464x240!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F21%2Ffb%2Ffbd76a9447b9bb2775d143b73823%2Flight-crude-oil-price-chart-2-20-26.png\" width=\"464\"/>\n<img alt=\"light-crude-oil-price-chart-2-20-26.png\" class=\"Image\" height=\"240\" loading=\"lazy\" src=\"https://cabot.brightspotgocdn.com/dims4/default/b68e0e4/2147483647/strip/true/crop/1253x647+0+0/resize/464x240!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F21%2Ffb%2Ffbd76a9447b9bb2775d143b73823%2Flight-crude-oil-price-chart-2-20-26.png\" srcset=\"https://cabot.brightspotgocdn.com/dims4/default/b68e0e4/2147483647/strip/true/crop/1253x647+0+0/resize/464x240!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F21%2Ffb%2Ffbd76a9447b9bb2775d143b73823%2Flight-crude-oil-price-chart-2-20-26.png 1x\" width=\"464\"/>\n</picture>\n</figure>\n</div>\n</div><p>In view of the dollar’s persistent weakness, it behooves investors to hedge by having some exposure to assets that tend to actually benefit from this environment. Included in this category are, of course, the traditional safe havens of gold and silver (and related mining stocks).</p><h2>The Assets That Benefit from Dollar Weakness</h2><p>But other assets can also benefit from a weak dollar, including industrial, healthcare, materials and energy sector stocks. <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/stock-market/strength-in-consumer-staples-communication-stocks\">Consumer staples</a></span> can also benefit, due not only to the defensive nature of this sector, but also because many of the companies in this space are multinational, which means they generate significant revenue outside the U.S. and experience higher profits when foreign sales are converted into dollars. (And to that end, we have ample exposure to this sector in the <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/https:/investments.cabotwealth.com/website-cabot-turnaround-letter\"><i>Cabot Turnaround Letter</i></a></span>.)</p><p>Yet another overlooked area that can also benefit from persistent currency weakness is the airlines, since they generate significant revenue outside the U.S. and can see increased profits when foreign sales are converted into dollars. Moreover, dollar weakness tends to increase international demand for U.S. travel. (Hence, the recent addition of an undervalued airline stock to our <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/https:/investments.cabotwealth.com/website-cabot-turnaround-letter\"><i>Cabot Turnaround Letter</i></a></span> portfolio.)</p><p>In terms of inflation’s impact on the broad equity market, while higher raw material prices can crimp corporate profit margins—in turn resulting in lower stock prices—it’s also true that inflation of the runaway variety can boost demand for equities in general as a currency hedge. That is, if the dollar is in free fall, investors often turn to any asset (including equities) to preserve their diminishing wealth, resulting in stock prices rising categorically in local-currency terms (e.g., Venezuela, whose stock market led the world in returns in 2016 due to a hyperinflationary crisis that year).</p><p>This isn’t to say the U.S. will experience a Venezuela-type hyperinflationary event anytime soon. Rather, my point is that with inflation now becoming a secular trend, it necessitates a judicious approach by having broad exposure to the sectors/industries most likely to thrive in a weak currency environment.</p><p>[author_ad]</p>\n</div>",
            "pub_date": "2026-02-23 15:00:54",
            "link": "https://www.cabotwealth.com/daily/stock-market/dollar-weakness-elephant-in-room",
            "image": "https://cabot.brightspotgocdn.com/dims4/default/41237c6/2147483647/strip/true/crop/1774x1340+231+0/resize/90x68!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F41%2Ffd%2Fe3749d0144afb53da8498a14c877%2Fistock-1460500012.jpg",
            "source": "cabotwealth",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Stock Market Performance By U.S. President: Which Party Gets Better Returns?",
            "description": "<div class=\"RichTextArticleBody RichTextBody\">\n<p>Some feared that Joe Biden would be bad for stocks.</p><p>Others (probably not the same people) were sure that U.S. markets would tank under Donald Trump, as reflected by the overnight cratering in stock futures the night he won his first term in 2016, in a surprise over Hillary Clinton.</p><p>Instead, both Biden and Trump have been good for stocks – or at least U.S. stocks have flourished during their terms in office.<br/>In Biden’s four years, the S&amp;P 500 returned 56%, despite decades-high inflation and interest rates. During Trump’s first four years, <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.barrons.com/livecoverage/trump-inauguration-day-news/card/how-the-stock-market-has-performed-under-each-president-since-eisenhower-SEFsrItoOUZUAwcHxNWY?gaa_at=eafs&amp;gaa_n=AWEtsqfFbAOYJiT1t0_7NmBps2rJ1_x7TrhveSgGt4dEp3sEYR7D_X9w_V4ajCVveV4%3D&amp;gaa_ts=69963c47&amp;gaa_sig=9M2IHBA8KvpJFWf0jRlVNaA4CEjR67pQ919hbwZE3BoiMndifFqRrGlrgQIjhIVtliej9_HnfYd3bV6yDsyCZg%3D%3D\" rel=\"noopener\" target=\"_blank\">the S&amp;P gained 67%,</a></span> despite the worst global pandemic in a century. And for all the angst over tariffs, still-high prices and declining consumer sentiment over the past 13 months since Trump’s second inauguration, stocks are doing just fine, up 12.7% – slightly better than their historical 10% annual return.</p><p>In fact, every U.S. President dating back to George W. Bush has “outperformed” the 40% average four-year return that dates back to Dwight Eisenhower’s first term. Bush the Second is actually the only “underperformer” of the last 40 years, in fact, dating back to Ronald Reagan’s mere 30% return in his first term.<br/>Which party gets the better returns? That would be the Democrats, perhaps to the surprise of some.</p><p></p><p>[text_ad]</p><h2><b>Democratic vs. Republican Presidents, By the Numbers</b></h2><p>According to <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://economics.td.com/us-presidential-elections-stock-market\" rel=\"noopener\" target=\"_blank\">data compiled by TD Economics and Bloomberg</a></span>, through 2024, and thus the end of Biden’s term, the average annual return under Democratic presidents, dating back to 1946, is just over 10%. The average return under Republican presidents is just over 6%, though the past 13 months of Trump’s second term have likely improved that calculus a tad.</p><p>The best stock market performance by a president in the post-World War II era came under Bill Clinton; the S&amp;P 500 was up a whopping 210% in his two-term presidency, from 1993-2001. The second-best return under a U.S. president? That would be Barack Obama’s eight-year tenure, when the S&amp;P was up 189% from 2009-2017.</p><p>Next up are a pair of Republican presidents: stocks rose 129% under Dwight Eisenhower (1953-1961) and 117% under Ronald Reagan (1981-1989).</p><p>Rounding out the top five is Democrat Harry S. Truman, who saw the S&amp;P rise 87% during his eight-year term (1945-1953). President Trump is currently on pace to surpass him and enter the top five, though who knows what will happen over the next three years.</p><h3><b>Trump vs. Biden vs. Obama</b></h3><p>Of course, context matters when it comes to U.S. presidencies.</p><p>It’s important to note that Obama took office just as stocks were hitting multi-year lows on the heels of the worst recession since the Great Depression. Obama benefited from the bounce-back—though, you could argue that he was largely responsible for facilitating it.</p><p>On the flip side, President Trump had the bad fortune of being in office when the worst global pandemic in more than a century forced Americans to stay home almost an entire year and the economy to plunge. One can debate how his handling of Covid-19 impacted the economy and by extension the stock market (I’m not touching that one). But the coronavirus would have been bad news for any president, at least for a time.</p><p>Biden certainly benefited from global post-Covid reopening trends and a resilient U.S. consumer, at least in the first year of his term. But he gave back a lot of those returns in his second year, when inflation spiked above 9% and the Fed started raising interest rates at a breakneck pace, leading to a bear market in 2022.</p><p>And that’s really the point. Stock market rallies can last for generations, cross aisles, and survive times of terrible political turmoil like we have now. Though Wall Street historically prefers a Democrat in office, there has been many a <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/stock-market/100-year-stock-market-chart-bull-run-far-from-over\" rel=\"noopener\" target=\"_blank\">bull market</a></span> on the watches of Republican presidents. For evidence, look no further than Donald Trump’s five years in office.</p><p>Bottom line: markets are apolitical. Investors don’t normally care who’s president, just so long as companies – and the U.S. economy – continue to grow far more often than they contract.</p><p>Speaking even more broadly, the market’s gravitational pull is up. And it’s the person in the White House’s job not to screw it up – regardless of party.</p><p></p><p>[author_ad]</p><p><i>*This post is periodically updated to reflect market conditions.</i><br/></p>\n</div>",
            "pub_date": "2026-02-20 15:05:43",
            "link": "https://www.cabotwealth.com/daily/stock-market/stock-market-performance-us-president",
            "image": "https://cabot.brightspotgocdn.com/dims4/default/784b0a7/2147483647/strip/true/crop/1059x800+71+0/resize/90x68!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fb3%2F5e%2F9c0ec3c134e5882e2dc77d019a9b%2Fwhite-house-washington.jpg",
            "source": "cabotwealth",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Bank on Dividend Growth in a Changing Market",
            "description": "<div class=\"RichTextArticleBody RichTextBody\">\n<p>The market is changing. It’s still a <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/stock-market/100-year-stock-market-chart-bull-run-far-from-over\">bull market</a></span>, but with different heroes and goats.</p><p>The bull market that existed for the first three years since October of 2022 has turned upside down. For most of that time technology, and particularly AI stocks, soared while most other stocks did very little. Now, previously meandering stocks are killing it while technology sinks.</p><p>Over the past three months, eight of the eleven S&amp;P sectors have outperformed the index, and none of them are technology. In fact, technology has been the worst performer of the eleven S&amp;P 500 sectors over that period. Several cyclical sectors have posted 15% to 20% year-to-date returns while the S&amp;P index is in negative territory.</p><p>Is this a lasting trend or a temporary aberration? The rally in non-tech stocks indicates investor confidence regarding the state of the economy in the quarters ahead. Will that economic growth materialize? Are technology and the AI trade finished, or is this just another periodic consolidation? Even if the current weakness proves temporary, will it end shortly or persist for most of the year?</p><p>No one really knows the answer. That makes it tough to invest. You don’t want to jump into some of these hot sectors after they’ve already had a big move. At the same time, you may not want to try to catch a falling knife in technology stocks.</p><p>Anything can happen in the next several months. Remember the pandemic? It’s easier to focus on the longer term instead of trying to guess the next temporary gyrations on Wall Street. Sectors go in and out of favor all the time. Industry leadership changes often. But one strategy has been a winner in just about every kind of market over time – dividend growth.</p><p>Over time, companies that continue to pay dividends have generated higher annualized returns with far less volatility than any other market segment. <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/dividend-stocks\">Dividend stocks</a></span> have vastly outperformed non-dividend payers over time because of the dividend and the company.</p><p>Dividends have accounted for 31% of the S&amp;P 500 total return since 1926. Although the percentage has been lower in recent decades, they still account for a significant part of returns, especially in flat or down years.</p><p>But even more important than the dividends themselves is the company. Businesses that can pay and maintain a dividend for long periods of time have consistent businesses with an established niche that reliably generates bankable revenue in any environment. Dividends are a great way to screen companies. These companies walk the walk. That said, companies that can do all the above plus consistently <i>grow</i> the dividend are at the next level and historically generate even higher returns over time.</p><p>It’s hard to say what kind of market it will be in three months or six months. Dividend growers tend to rise with the market if things go well and deliver strong relative performance when things go sideways or get dicey. These stocks transcend short-term market trends.</p><p>[text_ad]</p><p>You don’t have to reinvent the wheel. Navigate the uncertain market the way so many have successfully invested in uncertain environments throughout history. Bank on dividend growth with this legendary security.</p><h2>A Legendary Dividend Growth Stock</h2><p></p><h3><b>Enterprise Product Partners L.P. (EPD)</b></h3><p><b>Yield: 5.9%</b><br/><b>Years of consecutive dividend growth: 28</b></p><p>Enterprise Product Partners is one of the largest midstream energy companies and Master Limited Partnerships in the country, with a vast portfolio of service assets connected to the heart of American energy Production. It is connected to every major U.S. shale basin and 90% of American refiners east of the Rockies and offers export facilities in the Gulf of America.</p><p>Current assets include the following:<br/></p><ul class=\"rte2-style-ul\" id=\"rte-c90c3742-0d03-11f1-84cb-77bf54b49c2b\"><li>50,000 miles of pipeline</li><li>300 million barrels of liquids storage</li><li>20 deepwater docks</li><li>45 natural gas processing trains</li><li>26 fractionators</li></ul><p>As a <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/dividend-stocks/golden-age-midstream-energy-companies\">midstream energy</a></span> partnership, Enterprise is not reliant on volatile commodity prices because they generate about 80% of revenues from fees for storing, processing, and transporting oil and gas. They collect tolls on the U.S. energy highway at a time when production is likely to increase substantially.</p><p>The first thing that probably comes to mind when considering EPD is the distribution. EPD currently pays a $2.18 annual dividend, which translates to a 6.2% yield at the current price. Is that massive yield safe?</p><p>As an <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/stock-market/what-is-an-mlp-and-how-do-i-pay-taxes-on-my-mlps\">MLP</a></span>, Enterprise pays no income tax at the corporate level and pays out the bulk of earnings in the form of distributions. The payout ratio has been in the 65% to 80% range over the past few years, which is lower than most MLPs and enables the partnership to invest its own capital in growth projects at a lower cost.</p><p>Enterprise is commonly regarded as having one of the best balance sheets in the midstream space, with low debt, high credit ratings, and a surprisingly low payout ratio for an MLP. The payout also has a stellar 1.7 times coverage with cash flow, one of the best in the sector. It’s also an MLP that has increased distributions every year for 28 consecutive years. The distribution has continued and grown during recessions and depression-like environments for the energy industry. It should be rock solid in the years ahead.</p><p>EPD has performed very well over the last several years. Since the beginning of 2022, EPD returned 121% with distributions reinvested, which is more than double the S&amp;P return of 51% over the same period. The MLP provided double the market returns with just a small fraction of the volatility.</p><p>Yet, despite the recent success, EPD still sells well below the all-time high with much higher earnings and a PE ratio of 13 compared to near 30 times for the overall market. It also has a beta of just .66, meaning it is a third less volatile than the S&amp;P.</p><p>The future is shaping up to be even better. Not only is Enterprise expanding capacity at significant levels. It’s expanding in the highest growth area of the energy market, natural gas liquids (NGLs).</p><p>The partnership is building out gas and NGL processing facilities and pipelines from the booming Permian basin to boost capacity on routes to the Gulf Coast. It’s also expanding its export facilities.</p><p>Enterprise is on the cusp of more unitholder investment. The partnership invested $6 billion in expansion projects over the past few years. The new capacity should significantly expand cash flow and earnings.</p><p>Management also said that the partnership will be shifting money from growth projects to share buybacks and distributions over the next several years.</p><p>The dynamics of the energy industry should also be highly favorable to midstream energy companies in the years ahead. The global energy industry has had many years of capital underinvestment that will continue to limit supply amid ever-rising global demand, especially for natural gas.</p><p>The distributions will continue to flow in any kind of market. And the price has also proven resilient in the face of inflation, rising interest rates, and a slowing economy.</p><p>[author_ad]</p>\n</div>",
            "pub_date": "2026-02-19 15:06:02",
            "link": "https://www.cabotwealth.com/daily/dividend-stocks/bank-on-dividend-growth-changing-market",
            "image": "https://cabot.brightspotgocdn.com/dims4/default/9523e2f/2147483647/strip/true/crop/3049x2304+203+0/resize/90x68!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F1c%2Fb8%2F9d59730246d99713e76f4604df09%2Fdollar-bills-and-upward-sloping-arrow-comparing-growth-investing-and-value-investing.jpg",
            "source": "cabotwealth",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Income Disparity, Opportunity and the Stock Market",
            "description": "<div class=\"RichTextArticleBody RichTextBody\">\n<p>A longtime Cabot customer sent me a note this morning on top of a Cabot Wealth Daily article from November of 2015. The column, written by my friend and predecessor here, Tim Lutts, is just as timely today as it was ten years ago. So, I include it here below, unchanged.</p><p>By way of introduction, I will just add that I strongly believe our job here at Cabot is to help you invest profitably, regardless of market conditions. That’s what we’ve done for more than 55 years, and what I expect to continue to do for the foreseeable future.</p><p>At the same time, there are choices we make as a country that have implications for the investing environment and serious investors should be aware of them.</p><p>Tim’s column discusses the impact of the widening income disparity, its impact on the stock market, and the idea of a guaranteed basic income.</p><p>It’s worth noting that this last idea has continued to gain traction since Tim wrote about it in 2015. Presidential candidate Andrew Yang made the idea part of his proposed platform. A number of countries, states, and municipalities have been experimenting with the idea. In fact, right now in Salem, Massachusetts, where Cabot is based, there is a pilot program in progress.</p><p>For your investing success,<br/>Ed Coburn <br/>President, Cabot Wealth Network</p><p>[text_ad]</p><h2>A Crazy Idea?</h2><p><b>by Tim Lutts (November 3, 2015)</b></p><p>What follows just might sound like the craziest thing I’ve ever written. But hear me out if you can—and try to keep an open mind.</p><p>I’ve been writing about investing and capitalism for the past 29 years, and in that time I’ve seen a lot of truly great companies created.</p><p>Among the public companies that have changed my life—in a good way—are Amazon, Apple, Cisco, Chipotle Mexican Grill, eBay, Expedia, Facebook, Google, Home Depot, Intel, LinkedIn, Microsoft, Monster, Netflix, Paypal, Tesla Motors, TripAdvisor and Whole Foods.</p><p>In a world without capitalism, those companies would not exist.</p><p>And the capitalism that thrives in the U.S. helps everyone!</p><p>It enables millions of people in developing countries to own cell phones and televisions and thus learn what’s happening in the wide world.</p><p>It’s reducing global poverty and hunger at a good pace.</p><p>And it’s boosted the standard of living in every corner of our own country.</p><p>Bottom line: The pie is getting larger, both globally and in the U.S.</p><p>At the same time, however, the income gap in this country has continued to widen, with the top 1% of earners in the U.S. taking an increasingly larger piece of the pie, and using their money—either individual or corporate—to exert an overweight influence on matters of importance.</p><p>The political dimensions of this influence are well known these days.</p><p>It’s one reason we once again have a Clinton and a Bush running for president.</p><p>It’s one reason that hedge fund operators avoid paying normal income tax rates on much of their compensation.</p><p>It’s one reason that so many U.S. corporations have been successful in minimizing their taxes as well.</p><p>And it’s one reason that we’re still putting ethanol in our cars—something that defies all economic sense unless you live in Iowa.<br/>But the influence of this money goes far beyond politics!</p><p>Because the 1% can’t actually use all their wealth, they “invest” it in stocks, real estate, sports teams, automobiles, fine wine, fine art, etc. Some of it goes into private equity, minting “unicorns” like Uber, Airbnb and Square. And some of it is simply sitting idle, working hard to avoid the taxman.</p><p>In the process, this money, which is allocated based on the perceptions and values of the moneyed class, as opposed to those of the vast middle class, creates bubbles.</p><p>In the late 1990s, it created the stock market bubble.</p><p>In the years leading up to 2007, it created the real estate bubble.</p><p>Today, there are signs of a bubble in private equity.</p><p>I could argue that we’re in an extended bubble in the bond market.</p><p>And someday in the future (note the Ferrari IPO), we may see a bubble in the collectible car market.</p><p>What this money doesn’t do, to a large degree, is trickle down to people at the bottom, the 90% of working-class people who are struggling to get ahead.</p><p>And what it doesn’t do is send market signals about what really matters to the majority of Americans. (I credit James Livingstone’s book, <i>Against Thrift</i>, for this idea.) In short, the economic power of the rich is so great that it distorts the free market.</p><p>Now, maybe you’re okay with that. I totally understand the mindset of business owners and investors. I am both.</p><p>But consider this.</p><p>Even though we’ve enjoyed a long economic recovery from the recession of 2007-2009, the vast middle class is still struggling. The real unemployment rate—including the underemployed and discouraged—is 10% (almost double the commonly quoted 5.1%) and the youth unemployment rate is 12.7%.</p><p>Now, you can find a lot of culprits when you look to the reason for this unemployment, from the inability of our elementary school systems to adjust to the digital age, to the self-esteem craze that praises all kids equally, to overworked single parents, to too much time spent taking tests or playing sports, to the college borrowing boom that sent kids to college who got little out of it but debt.</p><p>But it might just be that it’s not all their fault. It might just be that the growing ability of machines to perform a growing variety of tasks in our world means we will never have full employment again. And if that is so, it’s worth asking if full employment is even a proper goal.</p><p>Crazy, huh?</p><p>Ten years ago, I would have thought so. I was born and raised in a Yankee household where productive work was highly valued, and I maintain those values today.</p><p>But I’ve seen human toll collectors and bank tellers and supermarket checkout people replaced by machines. In recent years, I’ve seen writers replaced by machines. I’ve seen farms become enormously more dependent on machines than human labor. I’ve seen the Tesla Motors factory where robots do both heavy lifting and precision assembly. I know that sooner than we expect, self-driving cars and trucks will manage themselves far more efficiently and safely than flawed and distracted humans do today. And I know beyond a shadow of a doubt that the trend of machines replacing people will continue.</p><p>In fact, a study at Oxford University found that 47% of jobs are at risk of computerization over the next two decades. That includes positions in transport and logistics, office and administration, sales and construction, and even law, financial services and medicine.</p><p>---</p><h3>Why Work?</h3><p>So I ask, in a world where an increasing amount of work can be done by machines, is it necessary—or even desirable—that all people work, or are there other pursuits that might be more valuable—like caring for one’s children or elderly parents, for example?</p><p>Granted, it’s easier not to ask the questions. For most people, it’s easier not to question the way things are. For most people, it’s easier to keep on watching the unemployment numbers and speculating on when the Fed will raise interest rates.</p><p>And speaking of interest rates, the big picture as I see it is this: From the end of World War II until 1980, interest rates rose as people grew increasingly eager to borrow for the future—because the future was bright!</p><p>Yes, the common wisdom is that interest rates were high to combat inflation, but inflation occurred because demand for goods and services—by Baby Boomers in particular—outstripped supply.</p><p>From 1980 until the present, contrarily, interest rates have declined, as people have become increasingly less willing to borrow for the future and Baby Boomers have been preparing for retirement. As a result, today, federal debt pays nothing, as people feel more comfortable with their money “safe” rather than lending it out.</p><p>Again, the common wisdom is that interest rates are low because inflation is low, but that’s because demand for goods is low relative to supply! And part of the reason for that is that the increase in supply has equaled—and in some cases exceeded—the spending capabilities of regular consumers.</p><p>And one reason for that is that (by some measures) the wages of most American workers have stagnated since the 1970s, with roughly 25% of workers (including 40% of those in restaurants and food service) now using public assistance to supplement what they earn.</p><p>But that welfare system is less generous than it used to be, with a patchwork of means-tested systems (one person counted 79 programs!) that often penalizes people for working. And it’s not very efficient.</p><p>And the job market is not what it used to be either! Gone are the days when a person could count on—or even want—lifetime employment in a company. </p><p>Nowadays, there are seasonal jobs (like working for Amazon and UPS around the holidays) that ebb and flow with demand. And there are growing economies like Uber and Airbnb where people have no boss but themselves.</p><p>So.</p><p>Putting these disparate ideas together…<br/></p><ol id=\"rte-5c28c570-0c32-11f1-98b6-eb0d21cf90a2\" start=\"1\"><li>Capitalism is good.</li><li>But the rich and powerful are increasingly denying the working class a fair share of the rewards of growth.</li><li>And the rich and powerful, by misallocating capital, are not providing useful signals to markets.</li><li>Meanwhile, growing machine-driven efficiencies and changes in labor markets mean underemployment among certain populations is likely to become increasingly common.</li><li>And our welfare system is ripe for improvement.</li></ol><p>… my conclusion is that the value of work as a valuable activity is due for reexamination. And that if a higher-value activity can be found, society should find a way to support it.</p><p>Now, I expect some readers will press delete and move on here. It’s good to have that power.</p><p>But I’ve finally gotten to the point of this column, and it’s this: that a Guaranteed Basic Income is an idea worth considering.</p><h3>Guaranteed Basic Income</h3><p>A Guaranteed Basic Income (GBI) would be just what it says, a guaranteed payment, by the federal government, to all adult U.S. citizens or residents.<br/>There would be no means testing, save for that detail about citizenship or residency. Every living adult, regardless of race, marital status, gender, criminal record, education and income level, would receive the same payment, every year. Even Donald Trump.</p><p>One result of this payment is that millions of Americans would no longer be poor, and thus, millions of Americans would be less inclined to break the law.<br/>Additionally, a multitude of current assistance programs could be abolished, shrinking the size of the federal government.</p><p>The libertarian right likes the idea of transferring power from the government back to the people. And it likes the idea that people would get cash (to use as they choose) rather than the goods and services the government decides they need.</p><p>The left likes GBI because it thinks society is unequal and wants to redistribute wealth.</p><p>And the technology elite like the idea because it’s so radical, so unpopular (even unknown) among all major parties. One, Albert Wenger, of Union Square Ventures, told a TED audience recently, “What we see in startups is that the most powerful innovative ideas are ones truly dismissed by the incumbents.” A minimum income would allow us to “embrace automation rather than be afraid of it” and let more of us participate in the era of “digital abundance.”</p><p>But would it actually work?</p><p>Over the decades, there have been some pilot programs.</p><p>There were eight “negative income tax” trials in the U.S. back in the 1970s, where people received payments and the government clawed back most of it in taxes based on your other income. The trials reduced poverty, but people worked slightly less than normal.</p><p>A pilot program in rural Manitoba, Canada in the 1970s showed that a “Mincome” not only ended poverty but also reduced hospital visits and raised high-school completion rates. Again, people worked slightly less than previously. However, the only two groups who worked significantly less were new mothers and teenagers working to support their families. New mothers spent this time with their infant children, and working teenagers put significant additional time into their schooling.</p><p>In Namibia, a trial program cut poverty from 76% to 37%, increased non-subsidized incomes, reduced child malnutrition, raised education and health standards, and cut crime levels. And in this case, participants used the extra income to engage in more productive economic activities.</p><p>A trial in India involving 6,000 people paid them $7 month—about a third of subsistence levels. It, too, proved successful at reducing poverty. And here, too, the amount of work people were doing increased.</p><p>Back in the U.S., there’s the Eastern Band of Cherokee Indians, based in North Carolina, whose members receive payments of several thousand dollars twice a year as dividends from the profits of the Harrah’s Cherokee casino. Over time, the payments have contributed to significant declines in poverty, behavioral problems, crime, substance abuse and psychiatric problems, and increases in on-time graduation.</p><p>And in Alaska, every resident gets a dividend check—in recent years, it’s been between $1,000 and $1,500 per person—representing their share of the state’s oil revenues.</p><p>Summing up, the greatest negative effect from these programs seems to be that in America, some people, given free money, will work less—but mainly to care for family members or attend school.</p><p>And that’s not really a negative at all.</p><p>But how much would such a program cost, and who would pay for this?</p><p>According to Danny Vinik at Business Insider: “In 2012, there were 179 million Americans between the ages of 21 and 65 (when Social Security would kick in). The poverty line was $11,945. Thus, giving each working-age American a basic income equal to the poverty line would cost $2.14 trillion.”</p><p>Today, all federal and state benefits for low-income Americans cost about $1 trillion a year, so closing that gap would mean raising taxes on the rich and closing loopholes.</p><p>Tax hikes, of course, have been proposed many times before and the arguments for and against are well known. Closing loopholes is also a no-brainer. But thanks to the dollars and ingenuity of those who benefit, there always seem to be loopholes!</p><p>But remember what I wrote about what the rich do with their money? They invest it in collectibles. They buy real estate. They buy bonds, paying dearly for safety. And in the process, they distort the free market in the same way that Super PACs distort elections; the voices of the little people are drowned out by the dollars of the rich.</p><p>So the upside from the Guaranteed Basic Income would be:<br/></p><ol id=\"rte-5c28c571-0c32-11f1-98b6-eb0d21cf90a2\" start=\"1\"><li>That poverty in the U.S. is reduced.</li><li>That crime in the U.S. is reduced.</li><li>That markets become more efficient, as the market power of the working class gains a bit more power relative to the rich.</li></ol><p>Lastly, making a big idea even bigger, there’s the possibility of funding the GBI through monetary policy. Why not give money to people instead of banks? People would spend it, and it would work its way back to the banks rather than vice versa.</p><p>What would have happened if the Fed had taken the $3.5 trillion used to buy debt through the various Quantitative Easing programs and just given it to people as income instead? Wouldn’t that have been interesting?<br/>______________<br/>What do you think about this? Good, bad, worth a try? I welcome your thoughts and feedback and will follow up.</p><p>Email me at <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"mailto:support@cabotwealth.com\" rel=\"noopener\" target=\"_blank\">support@cabotwealth.com</a></span> with Crazy Idea in the subject line.</p><p>[author_ad]<br/></p>\n</div>",
            "pub_date": "2026-02-18 15:06:27",
            "link": "https://www.cabotwealth.com/daily/dividend-stocks/guaranteed-basic-income",
            "image": "https://cabot.brightspotgocdn.com/dims4/default/088276c/2147483647/strip/true/crop/4955x3744+330+0/resize/90x68!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fae%2F1a%2Fc22951aa14d166221ecbff785357%2F100-dollars.jpg",
            "source": "cabotwealth",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Investing in Real Assets Beyond Gold and Silver",
            "description": "<div class=\"RichTextArticleBody RichTextBody\">\n<p>As 2026 takes off, several trends are clear.</p><p>AI disruption is rampant, the economy uncertain, the Magnificent 7 stocks are lagging, <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/stock-market/foreign-currency-etfs-hedge-weakening-u-s-dollar\">weakness in the U.S. dollar</a></span> continues, inflation is stubborn, emerging market and <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/international-stocks\">international stocks</a></span> are moving, and investors are looking to hedge all of this by moving more into real assets as opposed to financial assets.</p><p>The dollar is the central issue. It has slumped about 10% over the past year despite factors that should support the currency: a strong U.S. stock market, a decent economy, consumer resilience, and higher interest rates in the U.S. than in much of the developed world.</p><p>The recent four-year low in the dollar is making international investors a bit nervous about the United States, where they have invested $36 trillion into stocks and long-term bonds.</p><p>Foreign holdings of Treasurys hit a record $9.4 trillion in November, but the pace of buying has slowed. Meanwhile, Beijing has been reducing its holdings of U.S. Treasury bonds over the last decade from $1.3 trillion to about $700 billion. China is the third-largest foreign holder of Treasuries, after Japan and the U.K. Japan is the top buyer, with $1.2 trillion. Foreign investors hold about 30% of total U.S. government debt.</p><p>Still, foreigners bought $689 billion in stocks in 2025 through November, according to U.S. Treasury Department data, up sharply from $197 billion the previous year. It estimates that foreigners own about 20% of the value of all U.S. publicly traded stocks.</p><p>But now capital flows seem to be going through Globalization 2.0 as flows expand to international markets and real assets.</p><p>[text_ad]</p><p>You may have noticed that the mainstream financial media is now preaching the newfound religion of international diversification. Last year, the MSCI all-country world ex-U.S. index surged 29% in U.S. dollar terms, posting its best performance in more than a decade and speeding past the S&amp;P 500’s 16% gain.</p><p>Gold and silver have also been on a tear as investors seek a hedge to financial and political instability and risk. It is not just China’s central bank that is stockpiling gold. Chinese investors purchased over 400 metric tons of gold bars and coins in 2025, a 28% jump from the year before and nearly a third of global purchases in the retail category, according to the World Gold Council.</p><p>But in 2025, the <b><i>Cabot Explorer</i></b> looked beyond gold and silver to capture more exotic metals poised for explosive growth.</p><h2>How <i>Cabot Explorer</i> Captured Even Better Returns in Real Assets</h2><p>Supply and demand signals led us to believe that palladium and platinum will outperform as EV demand slowed and South Africa faces some production challenges. Platinum and palladium are usually considered rarer, more useful, and, therefore, pricier and more valuable than gold. There is 30 times more gold in the Earth’s crust than platinum, and in the early 1970s, platinum was five times the price of gold. Now, gold is three times the price of platinum.</p><p>But platinum wasn’t just cheaper than gold ... <i>It was trading near the lowest discount to gold in history</i>. By this, I mean the price of platinum divided by the price of gold for nearly four decades. We captured the relative price gap between gold and these critical minerals and captured the potential snapback – what analysts refer to as “reversion to the mean.”</p><p>Looking back, platinum usually traded for more than gold during the last three decades, and at times, the premium was significant, with platinum trading for more than double the price of gold in the early to mid-2000s.</p><p>That trend had largely reversed – bringing us to a discount that became extreme. The only other time we saw a similar situation was in 2020, when platinum traded for a 60% discount to gold, and then platinum rallied 121% over the next 11 months, while gold surged 25%.</p><p>The setup was similar for palladium. This critical metal had crashed even worse than platinum.</p><p>Believing that platinum and palladium were both poised for major moves higher, the <b><i>Cabot Explorer</i></b> recommended the <b>Sprott Platinum and Palladium ETF (SPPP)</b> in June 2025.</p><p>As we expected, SPPP more than doubled by the end of 2025.</p><p>Watching trends, comparing values, exploring the world for the best stocks and ETFs is what the <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/https:/investments.cabotwealth.com/website-cabot-explorer\"><b><i>Cabot Explorer</i></b></a></span> is all about. Join today to protect and grow your portfolio.</p><p>[author_ad]</p>\n</div>",
            "pub_date": "2026-02-17 15:10:39",
            "link": "https://www.cabotwealth.com/daily/precious-metals-investing/investing-in-real-assets-beyond-gold-silver",
            "image": "https://cabot.brightspotgocdn.com/dims4/default/ef74189/2147483647/strip/true/crop/3591x2713+631+0/resize/90x68!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2F04%2Faa%2F8d9cae2a4d13a0c4af28e517bae5%2Fistock-1426311277.jpg",
            "source": "cabotwealth",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Invest in Stocks That Are Not Being Disrupted by AI",
            "description": "<div class=\"RichTextArticleBody RichTextBody\">\n<p>For most of the past decade, investors were trained to think this way: If a business is digital, scalable, subscription-based, and “asset-light,” it deserves a premium. AI is starting to flip that script. And early in 2026, the theme has been owning stocks where AI is an enhancer, not a replacement—and be careful with businesses where AI turns the product somewhat into a commodity.</p><p>That’s not an anti-tech argument. It’s a <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/how-to-invest/how-to-profit-from-moat-stocks\">moat</a></span> argument. This is what I mean …</p><p>The <b>iShares Expanded Tech-Software ETF (IGV) </b>has been hit hard, with a roughly 20% loss in 2026 as investors worry that new AI tooling could undercut classic enterprise software economics—contributing to steep declines and major market-cap erosion.</p><p>Whether every fear is justified doesn’t matter in the short run. What matters is that software is no longer automatically viewed as “undisruptable.” The market is repricing perceived defensibility.</p><p>[text_ad]</p><p>And while software has been hit hard, these sectors, which are seemingly not at risk of being disrupted by AI, have been ramping higher in 2026:</p><p><b>Oil/energy ETF (XLE)</b> is up 20% year to date, led by <b>XOM, HAL, </b>and<b> CVX</b> all of which are up 15% or more in 2026.<br/><b>Chemicals</b>, led by <b>DOW, CE, </b>and<b> APD</b>, all have been racing higher in 2026.<br/><b>Transports (IYT)</b>, which is higher by 6% this year, led by big gains in <b>CSX, UNP, XPO, LUV, UPS </b>and many more.</p><p>And interestingly, <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/options-trading/unusual-option-activity-scanner-big-hedge-funds\">option activity</a></span> has been running wild in these sectors even as they are making new highs, including these trades from the last week:</p><p><i>Buyer of 25,000 </i><b><i>Marriot (MAR)</i></b><i> June 340 Calls for $40.60 – Stock at 360</i><br/><i>Buyer of 7,000 </i><b><i>Real Estate ETF (IYR)</i></b><i> April 95 Calls for $5.40 – Stock at 99</i><br/><i>Buyer of 5,000 </i><b><i>Energy ETF (XLE)</i></b><i> December 75 Calls for $3.64 – Stock at 53.3</i><br/><i>Buyer of 30,000 </i><b><i>Dow (DOW)</i></b><i> April 37.5/47.5 Bull Call Spreads for $1.05 – Stock at 33.85</i><br/><i>Buyer of 3,500 </i><b><i>Verizon (VZ)</i></b><i> May 50 Calls for $1.05 – Stock at 47.5</i><br/><i>Buyer of 1,000 </i><b><i>UPS (UPS)</i></b><i> September 110 Calls for $14.75 – Stock at 119 (rolled from April calls)</i></p><p>I like these groups and stocks a lot as they have been grossly underowned for years, and if there is a shift into the long-forgotten stocks, the move higher could be parabolic.</p><p>Finally, on this topic of AI and sectors that may be at risk, <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://x.com/mattshumer_\" rel=\"noopener\" target=\"_blank\"><b>@mattshumer_</b></a></span> posted an inside look at AI on X last week that got the attention of many on Wall Street, where he theorized that these sectors are ripe for disruption:</p><p><b><i>Financial analysis.</i></b><i> Building financial models, analyzing data, writing investment memos, generating reports. AI handles these competently and is improving fast.</i><br/><b><i>Writing and content.</i></b><i> Marketing copy, reports, journalism, technical writing. The quality has reached a point where many professionals can’t distinguish AI output from human work.</i><br/><b><i>Software engineering.</i></b><i> This is the field I know best. A year ago, AI could barely write a few lines of code without errors. Now it writes hundreds of thousands of lines that work correctly. Large parts of the job are already automated: not just simple tasks, but complex, multi-day projects. There will be far fewer programming roles in a few years than there are today.</i><br/><b><i>Medical analysis.</i></b><i> Reading scans, analyzing lab results, suggesting diagnoses, reviewing literature. AI is approaching or exceeding human performance in several areas.</i><br/><b><i>Customer service.</i></b><i> Genuinely capable AI agents... not the frustrating chatbots of five years ago...</i></p><p>Stepping back, it’s unlikely that software and <span class=\"LinkEnhancement\"><a class=\"Link\" data-cms-ai=\"0\" href=\"https://www.cabotwealth.com/daily/growth-stocks\">growth stocks</a></span> are all dead, as there absolutely will be winners from those groups. That being said, in early 2026, there is no question that stocks in the Oil, Chemicals, and Transports groups have been the market leaders.</p><p>[author_ad]</p>\n</div>",
            "pub_date": "2026-02-16 15:10:41",
            "link": "https://www.cabotwealth.com/daily/stock-market/invest-stocks-not-being-disrupted-by-ai",
            "image": "https://cabot.brightspotgocdn.com/dims4/default/9d30eab/2147483647/strip/true/crop/1620x1224+414+0/resize/90x68!/quality/90/?url=https%3A%2F%2Fk2-prod-cabot.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ff2%2F56%2F4f42fd95437a951ea708148fff76%2F3.jpg",
            "source": "cabotwealth",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}