{
    "data": [
        {
            "title": "Hong Kong budget 2026-27: minister defends cuts to kindergarten subsidy",
            "description": "Hong Kong authorities have defended a controversial subsidy cut for the kindergarten sector for the coming financial year, saying the low birth rate and resultant shrinking pupil population have prompted a reassessment of education policy priorities.\nSecretary for Education Christine Choi Yuk-lin said on Friday that the government would channel more resources towards promoting “high-quality education” and adopt a more targeted approach to helping pupils in need.\nAccording to the 2026-27 budget, which was unveiled on Wednesday, the early childhood sector will receive HK$4.5 billion (US$575 million) from the government, a drop of 6.6 per cent from the current financial year ending on March 31.\nThe government will also scrap two grants that fund kindergarten activities and the hiring of supply teachers. The policies cost authorities HK$15.9 million and HK$24.9 million, respectively, in the last school year.\nIn a media briefing to explain the measures, Choi said: “Hong Kong’s population structure is undergoing changes, with a decline in birth rate and a fall in the school-aged population.”\nThe government has estimated that there will be just 105,800 toddlers enrolled in kindergartens in the next school year, 79,000 of whom will attend subsidised institutions, both of which are record lows.\n“The government’s investment in education has not actually decreased. It is just that resources are now being more flexibly allocated according to the actual situation,” Choi said.\nShe said the cuts had followed a comprehensive review by the Education Bureau.\n“We are of the view that [the cut] will not affect the operation of kindergartens,” the minister said, adding that there were still more than 10 government grants available to kindergartens.\n\n\n\n\nIn comparison, government cuts to the primary and secondary education sectors stood at less than 2 per cent and 1 per cent, respectively. Meanwhile, spending will increase by 4 per cent for the tertiary and vocational education sectors.\nThe latest budget did not reintroduce a HK$2,500 grant for secondary, primary and kindergarten pupils, despite its scrapping last year under cost-cutting measures prompting a backlash.\nChoi said on Friday that the government planned to use its allocated funds to further promote “high-quality education”.\n“We hope to allocate our resources to help push up education quality,” she said, citing the use of artificial intelligence (AI) in curricula and AI training for teachers as examples.\n“This is to be in line with the national development laid down in the 15th five-year plan for 2026–30.”\nAt the same briefing, Secretary for Labour and Welfare Chris Sun Yuk-han also vowed to continue efforts to attract talent to the city.\n“Although it seems there is not much coverage about it in the budget, Hong Kong attracts talent through its institutional strength, not by increasing expenditure,” he said.\nIn the latest budget, government spending on education is forecast to reach HK$112 billion in 2026-27, accounting for 13.3 per cent of total estimated government expenditure. The figure is 1 per cent higher than the 2025-26 revised estimate.\nOn the social welfare front, expenditure is expected to reach HK$148.1 billion, about 17.6 per cent of total government spending for 2026-27, and 14.4 per cent higher than the 2025-26 revised estimate.\n",
            "link": "https://www.scmp.com/news/hong-kong/education/article/3344918/hong-kong-budget-2026-27-minister-defends-cuts-kindergarten-subsidy?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 21:46:14",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Moore Threads’ flagship AI chip compatible with latest Alibaba models",
            "description": "Semiconductor designer Moore Threads Technology has achieved full-stack compatibility between its flagship MTT S5000 graphics processing unit (GPU) and Alibaba Cloud’s Qwen3.5-series artificial intelligence models, as China’s tech self-reliance efforts gather pace.\nBeijing-based Moore Threads, founded by former Nvidia executive James Zhang Jianzhong, on Thursday said the firm’s flagship AI chip was now compatible with the three new models under the latest Qwen series – Qwen3.5-35B-A3B, Qwen3.5-122B-A10B and Qwen3.5-27B.\nAlibaba Cloud is the AI and cloud computing services unit of Hangzhou-based Alibaba Group Holding, owner of the South China Morning Post.\nThe announcement comes a day after Alibaba Cloud released its Qwen 3.5 medium model series, part of the Qwen 3.5 family unveiled earlier this month. The company had earlier touted how the series performed in certain benchmarks with leading models from OpenAI, Anthropic and Google DeepMind.\nMoore Threads’ initiative reflects how Chinese chip developers are rushing to support the country’s top-performing AI models. These GPU designers – including MetaX Integrated Circuits, Biren Technology and Enflame – are in a heated race to fill the void left by Nvidia in the domestic market.\nNvidia does not know if and when its much-anticipated H200 chips would be allowed into China, the company said on Thursday.\nThat showed the ongoing regulatory uncertainty from Beijing regarding GPU imports, which Chinese “big tech” companies are keen to acquire for their AI development projects.\n\nIn a separate move, AI start-up DeepSeek has given Chinese chip designers early access to its coming V4 model for performance optimisation, something it has not done with US chip suppliers, according to a report on Wednesday by Reuters, citing sources familiar with the matter.\nHuawei Technologies was among the domestic suppliers with access to the new DeepSeek model, the report said, adding that this pre-release engagement was not standard industry practice.\nDeepSeek and Huawei did not immediately respond to requests for comment on Friday.\nFor Moore Threads, which made a splash on the capital market through its Shanghai listing in December, it has stepped up efforts to make its GPUs compatible with the latest Chinese AI models on the market.\nEarlier this month, the company announced “day zero” chip compatibility with Zhipu AI’s GLM-5 model, which was launched ahead of China’s Spring Festival holiday.\nAs part of the chip designer’s latest initiatives, developers now can develop new models using the company’s native programming language based on its MUSA – for Meta-computing Unified System Architecture – ecosystem.\nThat would make the development process much easier by lowering the difficulty of transforming from Nvidia’s CUDA – for Compute Unified Device Architecture – platform. These platforms provide the software layer that lets developers harness the power of GPUs for applications.\n",
            "link": "https://www.scmp.com/tech/tech-trends/article/3344877/moore-threads-flagship-ai-chip-compatible-alibaba-models-tech-self-reliance-push?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 21:36:06",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "3 injured in Hong Kong after wild boar wanders into residential area",
            "description": "Three people suffered leg injuries after a wild boar was found roaming inside an MTR station and at a residential estate in Hong Kong on Friday.\nPolice said they received multiple reports of sightings of the wild boar at Wu Kai Sha station and the Lake Silver housing complex at 5.08pm.\n\nThe force said two men and one woman aged 45 to 87 suffered leg injuries, but it was unclear whether the boar wounded them.\nThey were taken to Prince of Wales Hospital in Sha Tin for treatment.\nAuthorities later found the wild boar in the car park of Silver Lake, but the animal fled in the direction of Lee On Estate.\n",
            "link": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3344905/3-injured-hong-kong-after-wild-boar-wanders-residential-area?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 20:06:49",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New World reports loss as deleveraging takes priority, dividend suspended",
            "description": "New World Development posted a net loss of HK$3.73 billion (US$477 million) for the first half of fiscal 2026, as asset write-downs continued to weigh on earnings despite improving Hong Kong home sales and ongoing deleveraging efforts.\nThe loss narrowed 44 per cent year on year for the six months ended December 31, as impairments on investment properties eased and financing and tax expenses related to mainland projects declined, according to a Hong Kong stock exchange filing on Friday. No interim dividend was declared.\n“Our team has worked very hard during this period, leading to ongoing improvements in our operations,” said CEO Echo Huang during the earnings call on Friday.\nHuang said the red ink was mainly attributable to non-cash provisions, including impairments on properties under development and completed units held for sale. She stressed that underlying operations had improved and that “we have achieved good results in improving revenue and reducing costs.”\n\nRevenue fell 50 per cent to HK$8.39 billion, dragged down by weaker construction income and fewer property handovers in mainland China.\n“In 2025, we capitalised on the recovery in Hong Kong’s real estate market to seize new opportunities,” Huang said in the filing. “In a volatile market, our focus is not only on growing our business, but also on the continuous optimisation of our financial structure.”\nDeleveraging remains central to the group’s strategy.\nTotal debt declined by HK$1.7 billion to HK$144.3 billion. However, net debt rose HK$2.6 billion to HK$122.7 billion, with the gearing ratio increasing to 59.7 per cent from 58.1 per cent a year earlier.\nChief financial officer Edward Lau attributed the rise to the accounting treatment of Hong Kong joint ventures, as well as repayments of construction loans tied to those projects.\nManagement has stepped up liquidity measures, including bank refinancing and residential asset sales, raising more than HK$34.8 billion from property disposals since early 2025.\n“When cash flow is stable, we will continue to reduce debt – that’s our topmost goal,” Lau said, adding there were currently no further debt exchange plans.\nAddressing market speculation, Huang said the company had no plans for share placements or rights issues.\nShe added that the group’s seven debt-reduction initiatives were “working”, supported by improving contracted sales and a steady recovery in leasing across its mall and office portfolio. Since early 2025, NWD has raised more than HK$34.8 billion through property disposals and sales.\nHong Kong contracted sales reached HK$10.3 billion in the first half, the highest level since 2021, with the Deep Water Pavilia project 93 per cent sold. More than 1,300 units are scheduled for launch in the second half.\nShares of NWD closed 3.6 per cent higher to HK$10.86 on Friday ahead of the earnings announcement. The stock has gained 49.4 per cent so far this year, as Hong Kong’s housing market shows signs of stabilising.\nHowever, Morgan Stanley gave the embattled developer a “reduce” rating with a target price of HK$6.50, according to a report earlier this month.\nThe results come as its parent, Chow Tai Fook Enterprises, faces continued investor scrutiny over its capital allocation and restructuring strategy amid market speculation about potential external investment.\nHong Kong’s property sector remains under pressure from elevated borrowing costs and cautious buyer sentiment, although recent mortgage easing has supported transaction volumes.\nNWD plans to launch about 1,300 units in the next six months, including the low-density luxury project Pavilia Rosa on Rose Street in Kowloon, Grand Austin Bohemian in Tsim Sha Tsui, and Phase 3 of The Pavilia Farm in Tai Wai, which will provide 540 units.\n“Many prospective buyers are shifting their stock market profit into the real estate market,” Huang said.\n",
            "link": "https://www.scmp.com/business/article/3344882/new-world-reports-first-half-loss-deleveraging-takes-priority-dividend-suspended?module=top_story&pgtype=subsection",
            "pub_date": "2026-02-27 19:55:58",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Retiree jailed for 8 months over seditious posts against Hong Kong government",
            "description": "A Hong Kong court has jailed a retiree for eight months for posting speeches on his social media account in which he seditiously criticised authorities and called on voters to boycott last year’s Legislative Council election.\nLam Ming-chung, 68, on Friday admitted to posting seditious content on his Facebook account between September 2024 and November last year, in violation of the domestic national security law.\nAccording to the prosecution, the defendant spread hatred against authorities in 130 posts in which he criticised the police, the judiciary and the Hong Kong government in general.\nHe also declared on his Facebook account that he would not vote in the Legco election last December and called for a boycott ahead of the poll.\nHe said candidates involved in politics were essentially sending themselves to the “guillotine”.\nDefence counsel Jonathan Man Ho-ching told the court that these redundant criticisms on his personal social media account, with only about 10 friends connected, were an emotional outlet for Lam.\n“I hope the court can understand the defendant as a stubborn elderly person who vented irrationally,” he said. “Of course, his venting crossed the line.”\nMan said his client was an educated man who graduated from the Chinese University of Hong Kong’s department of philosophy in 1981, and had an established career in translation.\nThe lawyer said Lam had taken part in the Basic Law Drafting Committee’s work in the late 1980s, drafting the translation material for the city’s mini-constitution.\nMan added that Lam had been a “law-abiding citizen” his whole life but got carried away by the hatemongering speeches online after the 2019 anti-government protests.\nIn the sentencing at West Kowloon Court, Chief Magistrate So Wai-tak noted that the defendant had published an average of 11 posts every month for over a year, with content that repeatedly defamed law enforcement and incited the public to disobey the law.\nAlthough no evidence suggested that the defendant’s speeches successfully agitated anyone, Lam had set all his posts containing seditious content to be publicly viewable.\nSo set a starting point of 15 months’ imprisonment before reducing it by one third to reflect Lam’s timely plea.\nHe gave a further discount of two months at his discretion for the defendant’s good character and family circumstances.\n",
            "link": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3344895/retiree-jailed-8-months-over-seditious-online-posts-against-hong-kong-government?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 19:21:01",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South China Morning Post publisher Tammy Tam appointed to Law Reform Commission",
            "description": "The publisher of the South China Morning Post, Tammy Tam, has been appointed to Hong Kong’s Law Reform Commission as the representative for the media industry for a three-year term starting in March.\nTam succeeded May Chan Suk-mei, a news director at Commercial Radio, who completed two three-year terms, with Secretary for Justice Paul Lam Ting-kwok, thanking Chan for her valuable contributions and insights.\nThe appointment by Chief Executive John Lee Ka-chiu was announced on Friday by the commission, which advises the government on legal reforms to keep Hong Kong’s laws up to date and responsive to societal needs.\n“The [commission] believes that Ms Tam’s rich experience in journalism will certainly assist the [commission] in expanding its reach in the community,” the body said.\nThe 12-member commission, chaired by Lam, includes the chief justice of the Court of Final Appeal and the law draftsman as ex officio members, as well as legal professionals, scholars and a media representative, among others.\nLee also reappointed Professor Alexander Loke from the School of Law at City University for a second three-year term beginning March 1.\nThe commission said it believed that Loke’s legal expertise in the laws of contract, company and securities would continue to benefit the body’s work.\n",
            "link": "https://www.scmp.com/news/hong-kong/society/article/3344886/south-china-morning-post-publisher-tammy-tam-appointed-law-reform-commission?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 18:41:04",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong exports surge 33.8% in January thanks to rebound from 2025’s low base",
            "description": "Hong Kong’s exports surged by more than 30 per cent in the first month of 2026, thanks to a rebound from last year’s low base after US-China trade war fears eased.\nAccording to the Census and Statistics Department, the total value of Hong Kong’s export of goods rose in January by 33.8 per cent year on year to HK$520.6 billion (US$66.6 billion), while the value of imports surged by 38.1 per cent to HK$534.7 billion.\n“Exports to most markets and of most major commodities increased visibly,” a government spokesman said on Friday.\n“While the low base of comparison last year amid the early arrival of Chinese New Year contributed to the strong year-on-year rise, the underlying growth momentum remained robust.”\nHe added that on a seasonally adjusted basis, the value of merchandise exports in a three-month period ending January picked up by 9.4 per cent compared with the preceding three-month period.\nThe second trade war began after United States President Donald Trump took office in January last year and imposed a 10 per cent tariff on China in early February.\n\nThe two nations struck what the White House called a “historic” agreement in November. Trade tensions between the world’s two largest economies subsequently appeared to de-escalate.\n“Looking ahead, Hong Kong’s merchandise trade performance will be underpinned by the sustained moderate expansion of the global economy and strong global demand for AI-related electronic products,” the spokesman said.\n“Meanwhile, the government will stay vigilant to the trade policy developments in the external environment.”\nThe latest figures also showed a trade deficit of HK$14.1 billion, equivalent to 2.6 per cent of the value of imports of goods, was recorded in January 2026.\nIn a statement last month, the department said that Hong Kong’s exports in 2025 rose by 15.4 per cent year on year to a “historical high”.\nIt added that authorities expected the city’s trade would continue to be supported by sustained global economic growth, improved ties with new markets and strong demand for artificial intelligence-enabled products.\n",
            "link": "https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3344880/hong-kong-exports-surge-338-january-thanks-rebound-2025s-low-base?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 18:01:59",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pop Mart’s Merodi Hong Kong debut highlights challenges of sustaining IP success",
            "description": "At Pop Mart’s shop in Hong Kong’s bustling Causeway Bay shopping district, a display of the toymaker’s newly launched character, Merodi, drew little attention on Friday morning.\n“A few people are buying it,” a salesperson said. “It’s not very well known yet.”\nThe new series, Merodi After School, features a mischievous little girl with the magical ability to talk to animals. It was created by Taiwanese artist Will Chen Wei-hua.\nThe launch came two months after Pop Mart’s previous debut, Supertutu, and is part of the company’s efforts to speed up the roll-out of new intellectual properties (IPs) beyond its most successful character, Labubu. Like Supertutu, however, Merodi’s launch has so far drawn an underwhelming response.\nThe new IP was released online at 10pm on Thursday night and was still available on Friday, unlike many of the toymaker’s more popular characters, which often sold out shortly after debut, including Twinkle Twinkle. Last August, mini Labubus sold out in 60 seconds.\nInvestors, however, seem confident. On Friday, Pop Mart’s shares closed more than 2 per cent higher at HK$229.80.\n\n“We think the new IPs require a longer cycle to raise their profile among customers,” said Jeff Zhang, an equity analyst at Morningstar. “With fashion risks remaining high, it’s natural to see some IPs failing to reach critical mass eventually, and Pop Mart will adjust product roll-outs accordingly.\n“We think Pop Mart will keep launching new IPs to capture fans’ preferences, so the tepid response to one or two may not significantly impact its reputation.”\nRichard Lin, chief consumer analyst at investment bank SPDB International, said Labubu was not an overnight hit.\n“It wasn’t actually that popular before [K-pop girl group Blackpink member] Lisa helped popularise it,” Lin said. “It needs to gain traction on social media first.”\nAs Labubu’s meteoric rise cools, Pop Mart faces challenges in turning hype into stable IP.\nIn 2024, Labubu dolls began to gain global attention after Lisa posted photos of herself with the plush toys as well as keychain pendants on Instagram. Since then, celebrities such as Rihanna, Kim Kardashian and David Beckham have endorsed the “ugly cute” character.\nLabubu was at one point in 2025 priced at more than 20 times its retail value in secondary markets, becoming Pop Mart’s most successful line to date.\nPop Mart’s share price dropped from a peak of HK$339.80 in late August last year to HK$187.70 by the end of 2025 as prices of some of Labubu models in the secondary market fell, fuelling debate over whether the company’s success had become too reliant on short-lived hype.\nFor the full year, Labubu’s sales volume exceeded 100 million units, chairman Wang Ning said at an internal gala, according to mainland media.\nOn Friday morning, shoppers at the Pop Mart store in Causeway Bay were seen shaking Labubu or Twinkle Twinkle blind boxes, hoping to guess what is inside, while a queue formed at the checkout counter.\nAs for Merodi, a salesperson said: “It is cute. I would sometimes recommend it to customers.”\n",
            "link": "https://www.scmp.com/business/companies/article/3344856/merodi-debut-hong-kong-shows-pop-marts-struggle-beyond-ip-darling-labubu?module=top_story&pgtype=subsection",
            "pub_date": "2026-02-27 17:41:38",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pop Mart’s Merodi Hong Kong debut highlights challenges of sustaining IP success",
            "description": "At Pop Mart’s shop in Hong Kong’s bustling Causeway Bay shopping district, a display of the toymaker’s newly launched character, Merodi, drew little attention on Friday morning.\n“A few people are buying it,” a salesperson said. “It’s not very well known yet.”\nThe new series, Merodi After School, features a mischievous little girl with the magical ability to talk to animals. It was created by Taiwanese artist Will Chen Wei-hua.\nThe launch came two months after Pop Mart’s previous debut, Supertutu, and is part of the company’s efforts to speed up the roll-out of new intellectual properties (IPs) beyond its most successful character, Labubu. Like Supertutu, however, Merodi’s launch has so far drawn an underwhelming response.\nThe new IP was released online at 10pm on Thursday night and was still available on Friday, unlike many of the toymaker’s more popular characters, which often sold out shortly after debut, including Twinkle Twinkle. Last August, mini Labubus sold out in 60 seconds.\nInvestors, however, seem confident. On Friday, Pop Mart’s shares closed more than 2 per cent higher at HK$229.80.\n\n“We think the new IPs require a longer cycle to raise their profile among customers,” said Jeff Zhang, an equity analyst at Morningstar. “With fashion risks remaining high, it’s natural to see some IPs failing to reach critical mass eventually, and Pop Mart will adjust product roll-outs accordingly.\n“We think Pop Mart will keep launching new IPs to capture fans’ preferences, so the tepid response to one or two may not significantly impact its reputation.”\nRichard Lin, chief consumer analyst at investment bank SPDB International, said Labubu was not an overnight hit.\n“It wasn’t actually that popular before [K-pop girl group Blackpink member] Lisa helped popularise it,” Lin said. “It needs to gain traction on social media first.”\nAs Labubu’s meteoric rise cools, Pop Mart faces challenges in turning hype into stable IP.\nIn 2024, Labubu dolls began to gain global attention after Lisa posted photos of herself with the plush toys as well as keychain pendants on Instagram. Since then, celebrities such as Rihanna, Kim Kardashian and David Beckham have endorsed the “ugly cute” character.\nLabubu was at one point in 2025 priced at more than 20 times its retail value in secondary markets, becoming Pop Mart’s most successful line to date.\nPop Mart’s share price dropped from a peak of HK$339.80 in late August last year to HK$187.70 by the end of 2025 as prices of some of Labubu models in the secondary market fell, fuelling debate over whether the company’s success had become too reliant on short-lived hype.\nFor the full year, Labubu’s sales volume exceeded 100 million units, chairman Wang Ning said at an internal gala, according to mainland media.\nOn Friday morning, shoppers at the Pop Mart store in Causeway Bay were seen shaking Labubu or Twinkle Twinkle blind boxes, hoping to guess what is inside, while a queue formed at the checkout counter.\nAs for Merodi, a salesperson said: “It is cute. I would sometimes recommend it to customers.”\n",
            "link": "https://www.scmp.com/business/companies/article/3344856/merodi-debut-hong-kong-shows-pop-marts-struggle-beyond-ip-darling-labubu?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 17:36:00",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Germany’s Merz meets China’s tech vanguard, including Alibaba and Unitree CEOs",
            "description": "German Chancellor Friedrich Merz visited China’s eastern tech hub of Hangzhou on Thursday and met leading figures including those from Alibaba Group Holding and Unitree Robotics, signalling growing international recognition of the country’s robotics and artificial intelligence technologies.\nMerz had lunch and took group photos with local entrepreneurs, including Alibaba CEO Eddie Wu Yongming and Unitree founder and CEO Wang Xingxing, according to a social media account run by Chinese state broadcaster China Central Television CCTV. Alibaba owns the South China Morning Post.\nHe met representatives from 10 companies in Hangzhou that specialise in AI, humanoid robots and electric vehicles (EVs). Other companies at the meeting included AI glasses start-up Rokid, brain-machine interface innovator BrainCo, and EV makers Geely and Leapmotor.\n\nThe stop in Hangzhou, the capital of eastern Zhejiang province, marked the conclusion of Merz’s first official trip to China, reflecting Germany’s attempt to work further with the engines of China’s digital and robotics economy. Analysts also expected it to strengthen Merz’s position when he meets US President Donald Trump in early March.\nA highlight of the visit was Merz’s tour of Unitree, a leader in humanoid robots. Unitree’s Wang showcased humanoids dancing, boxing and performing martial arts, according to a report by CCTV.\nWang said on Thursday on social media that it was an honour to meet Merz and that he looked forward to “collaborating with global enterprises for mutual success”.\n\nMerz tried on Rokid’s AI glasses and expressed “strong interest and appreciation for the product”, according to the Hangzhou-based company.\n“Through these glasses, we see a vast future for Sino-German cooperation,” said Misa Zhu, founder and CEO of Rokid, in a statement on Thursday. “Rokid is willing to combine China’s digital innovation with Germany’s precision craftsmanship to deepen cooperation in areas such as smart cockpits and industrial manufacturing, achieving mutual empowerment.”\nEarlier in Beijing, Merz met entrepreneurs including Xiaomi founder and CEO Lei Jun, JD.com founder and chairman Richard Liu Qiangdong and William Li Bin, founder and CEO of EV maker Nio, according to CCTV.\nMerz also attended a Mercedes-Benz autonomous driving showcase where he experienced a system developed by Chinese start-up Momenta, which said the German chancellor highly praised the collaboration.\n",
            "link": "https://www.scmp.com/tech/article/3344835/germanys-merz-meets-chinas-tech-vanguard-including-alibaba-and-unitree-ceos?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 17:31:09",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong workers least happy among 8 Asia-Pacific economies: survey",
            "description": "Hong Kong employees are the least happy among eight Asia-Pacific economies, including Singapore, with only 47 per cent of local workers reporting that they felt happy at work, a leading job recruitment platform has found.\nOn Friday, Jobsdb released its survey of 1,020 local workers, which also found that 44 per cent of local respondents reported burnout at work and about 66 per cent were dissatisfied with their stress levels.\nHong Kong’s workplace happiness ranked the lowest among the eight markets surveyed, each covering about 1,000 respondents.\nWorkers in Indonesia and the Philippines were the happiest, with 82 per cent and 77 per cent reporting that they felt happy at work, respectively.\nThey were followed by Malaysia at 70 per cent, Thailand at 67 per cent, New Zealand at 65 per cent, Australia at 57 per cent, Singapore at 56 per cent and finally Hong Kong.\n“In the emerging markets, Indonesia and the Philippines, they generally have a more positive and sanguine view of life, so that explains part of the cultural differences between the gap,” said Bill Lee Chern-hsing, managing director of Jobsdb Hong Kong.\nLee said Hong Kong employers often viewed salary increases as the main factor in workers’ happiness, but noted there were other elements they could control that could affect employees’ happiness.\nJobsdb conducted a statistical analysis to rank the importance of workplace happiness drivers among Hong Kong respondents, finding that “purpose at work” was the most important driver, with salary only ranking fifth.\nLee suggested that employers find ways to connect their employees’ work with the wider mission and purpose of their companies.\n“It will help employees feel more involved, that there is a direct impact in what I’m doing every day on what the organisation is doing,” he said.\nResponding to the result of more than four in 10 workers experiencing burnout in Hong Kong, Lee suggested that the issue should be addressed “through open communication and a supportive culture”.\n“When employees feel both purposeful and supported, companies see the payoff. Happy workers are five times more motivated and far less likely to leave.”\n",
            "link": "https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3344863/hong-kong-workers-least-happy-among-8-asia-pacific-economies-survey?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 16:46:36",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SHKP, Hong Kong’s bellwether developer, posts 36% jump in first-half net profit",
            "description": "Sun Hung Kai Properties (SHKP), Hong Kong’s largest developer by market capitalisation, reported a 36.2 per cent year-on-year jump in first-half net profit to HK$10.25 billion (US$1.3 billion).\nRevenue rose 32 per cent to HK$52.7 billion for the six months ended December from a year earlier, while operating income increased 10.7 per cent to HK$13.4 billion, the developer said in a filing to the Hong Kong stock exchange on Thursday. Underlying profit, which discounts property revaluations, gained 17 per cent to HK$12.2 billion.\nThe revenue, however, missed analysts’ estimates of HK$53.4 billion, while operating income beat forecasts of HK$12.82 billion, according to Bloomberg data.\nHong Kong accounted for HK$46.4 billion of the company’s revenue, followed by the mainland with HK$6.25 billion and other locations with HK$1 million.\nSHKP’s results are typically viewed as a bellwether of the city’s property market, given its extensive project pipeline and the scale of developments slated for completion in the coming years.\nChairman and managing director Raymond Kwok Ping-luen highlighted rising uncertainties brought about by geopolitical risks as well as the rapid development of artificial intelligence and robotics, noting that they were likely to lead the “global economy into uncharted waters”.\n\n“Despite increasing volatility in the market, anticipated further interest-rate cuts in the US, easing Sino-US tensions and accelerated investment in technology should support moderate global economic growth in 2026,” he said in the statement.\nKwok said the group planned to launch several new residential projects in Hong Kong over the next 10 months, including the second phase of Cullinan Harbour in Kai Tak, a project near the Tsuen Wan West MTR station, a project at Sha Po South in Yuen Long, the first phase of a large-scale development next to the Kwu Tung MTR station, a project near the City One MTR station in Sha Tin and the first phase of the Tung Shing Lei project in Yuen Long.\nSo far this year, the developer has sold out six rounds of sales totalling about 1,400 flats at its Sierra Sea project, the city’s largest residential development since 1999. Sierra Sea, located in Shap Sze Heung, between Sai Kung and Ma On Shan, consists of 9,700 units.\nSHKP’s major projects to be completed in Hong Kong from 2025 up to the end of its 2027-28 financial year would span 1.65 million sq ft to 4.37 million sq ft a year, it said in an earlier filing. Additionally, 10.3 million sq ft would be completed by the end of the 2028-29 financial year and beyond.\nInvestors have turned increasingly optimistic on Hong Kong’s property sector, singling out SHKP as a key beneficiary due to its 19.7 million sq ft of developable land, much of it tied to the government’s Northern Metropolis project, according to a note by Citi on Thursday.\nMeanwhile, annual earnings at Hysan Development, the largest commercial landlord in Causeway Bay, rose 28.3 per cent to HK$2.5 billion in 2025, driven mainly by the fair value gain from the disposal of flats in its upscale Bamboo Grove project in Mid-Levels, according to its filing on Thursday.\nIts recurring underlying profit, however, dropped 1.9 per cent to HK$1.91 billion, with chairman Irene Lee Yun-lien saying that “2025 was a pivotal year of progress and transformation for Hysan”.\nHysan’s turnover rose 1.6 per cent to HK$3.46 billion, with revenue from residential sales jumping 5 per cent, retail rising 2.6 per cent and office reporting flat growth.\nLast year, the company handed over 54 units in Bamboo Grove to buyers, with sales amounting to about HK$1.82 billion. With the units’ carrying value at HK$1.22 billion, Hysan said the disposal resulted in a fair value gain of HK$592 million.\nLooking ahead, Lee said 2026 would “present its own set of challenges”, but added that the group would be “battle-proven and ready”.\nHysan’s Lee Garden Eight project, a 1 million sq ft commercial development, will be ready in the third quarter of the year and will expand the company’s Lee Gardens leasable portfolio by about 30 per cent.\n",
            "link": "https://www.scmp.com/business/article/3344741/shkp-hong-kongs-bellwether-developer-posts-36-jump-first-half-net-profit?module=top_story&pgtype=subsection",
            "pub_date": "2026-02-27 16:46:36",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Paul Chan confident Hong Kong can handle debt of bond-driven growth",
            "description": "Hong Kong’s finance chief has assured the public that the city can manage its debt after proposing the issuance of more bonds to accelerate the development of the Northern Metropolis, expressing confidence in the long-term investment returns from the megaproject.\nFinancial Secretary Paul Chan Mo-po sought to reassure the public during a radio programme on Friday after a university student voiced concerns that his generation might suffer if the city failed to repay the growing number of bonds issued by the current administration.\nIn his latest budget, Chan proposed raising the borrowing cap of two bond programmes from HK$700 billion to HK$900 billion (US$89.4 billion to US$115 billion), describing this as a “balanced” approach that could fast-track the development of the Northern Metropolis and other public works projects.\nHe explained on Friday that land revenue would no longer be sufficient to cover the government’s capital works expenditure, prompting the authorities to rely more on bond issuance to finance infrastructure investment.\nHowever, a caller, a university student surnamed Choi, told Chan he was concerned the government might struggle to repay the debt.\n“In like 10 or 20 years later, if your estimates are unfortunately found to be inaccurate and the economic returns are not as high as expected, then it is possible that Hong Kong would not be able to repay the bonds and it’s likely to burden my generation. I believe that no one wants this to happen,” he said.\n\nThe student questioned whether the government was confident that the economic returns on the investment would be sufficient to repay the HK$900 billion in bonds, and whether a future administration would resist issuing new bonds to pay off old ones.\nChan said the income from bond issuance would be used solely for infrastructure investment.\n“It won’t be applied to fund our operating expenditure. This is a physical discipline that we strictly adhere to,” he said.\nHe added that the government would expedite land formation and infrastructure development in the Northern Metropolis to attract business, technology and manufacturing enterprises.\n“When these companies set up their operation, they will contribute to my tax income, to our employment, to our GDP,” he said.\nChan reassured listeners that the city’s debt-to-GDP level — currently at 14.4 per cent — remained “very safe” by international standards, even though the budget projects it will rise to 19.9 per cent over the next five years.\n“We are very confident with the growing economy [and] with the investment, we will be able to service this debt,” he said.\nOn geopolitical uncertainties and ongoing tariff regimes from the United States, Chan said the city had built a “strong buffer” to withstand various volatilities.\n\n\n\n\nHe added that Hong Kong should seize the opportunities arising from current circumstances to position itself strategically, noting that a significant amount of capital continued to flow into the city, making it a safe haven amid global geopolitical tensions.\nDuring the radio show, another caller questioned the government’s decision to cut kindergarten funding, noting that Hong Kong already had one of the lowest birth rates in the world.\nThe education sector earlier warned that cancelling two kindergarten grants for the new school year would cost each subsidised preschool about HK$40,000 on average.\nChan said his latest budget also proposed increasing the existing child allowance and personal allowance, allowing a family with two children to enjoy additional disposable income from tax reductions of slightly more than HK$10,000.\n",
            "link": "https://www.scmp.com/news/hong-kong/education/article/3344852/paul-chan-vows-hong-kong-can-handle-debt-bond-driven-growth?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 16:40:57",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New show to replace ‘Symphony of Lights’ at tourist spots in second half of year",
            "description": "A brand new light show to replace Hong Kong’s 22-year-old “A Symphony of Lights” will be launched in various sightseeing spots, such as The Peak, as early as the second half of this year, the city’s tourism minister has said.\nSecretary for Culture, Sports and Tourism Rosanna Law Shuk-pui also said on Friday that the new show would build on last year’s “Immersive Light Show in Central”, which featured dynamic 3D projections and adaptable themes.\nAccording to the latest budget unveiled on Wednesday, the city will bring down the curtain on A Symphony of Lights, a nightly laser-and-light display synchronised across dozens of buildings since 2004.\n“Over the past 20 years, A Symphony of Lights has been optimised and updated many times, but relying solely on laser performances from buildings has become somewhat insufficient,” Law said.\n“After gathering feedback over the past year, we have decided not to allocate resources for major modifications to it.”\nShe added that authorities would organise special farewell events to mark the end of the two-decade-old show.\nLaw described the transition as a move towards greater flexibility and engagement.\nShe noted that the light show held at the Hong Kong WinterFest last year, which projected 3D festive animations with music onto eight buildings in Central, had “received very good responses” and offered greater flexibility and changeable themes.\nThe Tourism Board was actively exploring light festival concepts at established tourist spots, with The Peak cited as a key site that could draw repeat visits, Law said.\n“The Peak is a place many tourists go to on their first trip to Hong Kong,” she noted.\n“If they come several times, they might not return, but if we introduce something like a light festival to create an atmosphere, it will greatly enhance the appeal of this traditional attraction at night.”\n\nLaw said the new events would align with festive periods, such as the Mid-Autumn Festival and Halloween, to maximise their impact.\nBut they would not be offered daily, so as to encourage return trips.\n“I’ve often said lately, [it’s about the] fear of missing out – if the light shows are only tied to festivals or special themes, you won’t see it if you don’t come to Hong Kong at that time,” Law said.\n“So you must come at a specific time to watch it. After seeing it once, you won’t say ‘I’ve seen it before, so no need to come again’, because the next time there’s another attractive theme, you might feel it’s worth coming back for that.”\nLaw said the government would reveal further details of the show, including its expected cost, later.\n“We have to be very responsive, so authorities will not wait five or 10 years to review – we have to make adjustments all the time to keep pace,” she said.\n",
            "link": "https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3344826/new-show-replace-symphony-lights-tourist-spots-second-half-year?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 15:35:54",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong stocks head for worst month since October on AI disruption angst",
            "description": "Hong Kong stocks headed for a monthly decline as jitters about artificial intelligence’s potential disruption to traditional industries continued to weigh on investor sentiment.\nThe Hang Seng Index rose 0.6 per cent to 26,545.09 as of 9.45am on Friday. For the month, the benchmark has dropped 3.2 per cent, the steepest since October. The Hang Seng Tech Index gained 0.9 per cent.\nOn the mainland, the CSI 300 Index slipped 0.4 per cent and the Shanghai Composite Index retreated 0.1 per cent.\nSun Hung Kai Properties, Hong Kong’s biggest developer by market capitalisation, rallied 5.4 per cent to HK$143.70 after posting a 36 per cent profit increase in the first half. CK Asset Holdings rose 3.4 per cent to HK$49.72, extending gains after agreeing to sell a UK power distributor with other listed vehicles owned by billionaire Li Ka-shing.\nThe so-called AI scare trade has roiled global stocks this month, with investors wary that the technology could upend industries from logistics and software to wealth management. Even strong earnings results from Nvidia did little to reverse sentiment, as revenue fell short of Wall Street’s most bullish estimates.\nOther major Asian markets traded on a weak note. Japan’s Nikkei 225 slipped 0.7 per cent, while South Korea’s Kospi retreated 2.1 per cent and Australia’s S&amp;P/ASX 200 was little changed.\n",
            "link": "https://www.scmp.com/business/china-business/article/3344801/hong-kong-stocks-head-worst-month-october-ai-disruption-angst?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 14:30:53",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gloomy weekend forecast for Hong Kong, with showers from Saturday",
            "description": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. Get faster notifications on the latest updates by downloading our app.\nHong Kong can expect gloomy weather and occasional rain this weekend, with showers persisting into next week, according to the city’s weather forecaster.\nThe Observatory said on Friday that under the influence of a broad low-pressure trough, there would be a few showers on Saturday, accompanied by stronger winds from the east.\n“A strong easterly airstream will affect the coast of Guangdong during the weekend. As the easterly airstream is replaced by a humid southerly airstream early next week, it will be warm during the day and there will still be a few showers over the coast of southern China,” it said.\nAccording to the latest nine-day forecast, it will be mainly cloudy next week, with showers on Monday and Tuesday expected to persist into the following two days.\nA cold front is expected to move across the coast of Guangdong next Tuesday, bringing stronger winds and showers over the region.\nThe weather in Hong Kong is expected to improve next weekend with sunny intervals, the Observatory said.\nTemperatures will fall in the middle and latter parts of next week. The minimum temperature is expected to lower gradually from 23 degrees Celsius (73 Fahrenheit) on Monday to 17 degrees on Friday.\n",
            "link": "https://www.scmp.com/news/hong-kong/health-environment/article/3344822/gloomy-weekend-forecast-hong-kong-showers-saturday?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 13:20:50",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China computing tech stalwarts Hygon, Sugon post revenue surge amid AI boom",
            "description": "Semiconductor designer Hygon Information Technology and supercomputer maker Sugon, two stalwarts of China’s tech self-reliance efforts, reported surging revenue for 2025 amid strong domestic demand for home-grown computing systems.\nThe two Shanghai-listed companies’ latest financial results reflect a broader trend across China’s public and private sectors to increase engagement with domestic technology suppliers, as artificial intelligence development projects in the country intensified.\nHeadquartered in Beijing, Hygon posted revenue of 14.4 billion yuan (US$2.1 billion) last year, a 56.9 per cent jump from 2024. Profit attributable to shareholders reached 2.54 billion yuan, up 32 per cent from a year earlier.\nHygon attributed the hefty sales growth to the “continued rise in demand for domestically produced high-end chips”. The company said its market share in high-end processors expanded amid cooperation with original equipment manufacturers and other partners in key industries and fields.\nThe firm expected even faster growth – between 62.9 per cent and 75.8 per cent – this first quarter, driven by increased investment in research and development due to “demand from the AI industry”.\n\nSugon, which makes high-performance computing systems and is the largest shareholder of Hygon, posted a 13.9 per cent year-on-year increase in revenue to 14.97 billion yuan last year. Its net profit rose 10.5 per cent to 2.11 billion yuan.\nThe strong performance of Hygon and Sugon also indicated the urgency in China to strengthen support for its domestic supply chain, as US tech restrictions and geopolitical tensions continue to affect the country’s technology sector.\nDespite major demand from Chinese AI companies, imports of Nvidia’s H200 graphics processing units into the country remain in limbo.\nChina, meanwhile, has continued to invest massive resources to build computing capacity amid a heated AI arms race with the US. In the five years to June 2025, the number of gigabit broadband users in the country grew 34-fold to 226 million, substantially lifting the country’s computing power demand.\nIn December, Hygon and Sugon called off plans for a mega-merger after months of talks, citing how “the market environment has changed significantly since the initial planning stages of this transaction”.\nThey said the factors affecting their respective stocks included “changes in the domestic and international environment, the overall trend of the mainland share market, changes in the artificial intelligence industry’s popularity and market expectations” .\nThe aborted merger dashed industry expectations that consolidating the assets of Sugon and Hygon would create a major domestic ecosystem covering advanced processors and high-performance servers.\n",
            "link": "https://www.scmp.com/tech/big-tech/article/3344729/china-computing-stalwarts-hygon-sugon-post-revenue-surge-ai-boom-tech-self-reliance?module=top_story&pgtype=subsection",
            "pub_date": "2026-02-27 12:50:55",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong’s CK Hutchison vows legal action over ‘unlawful’ Panama port seizure",
            "description": "Hong Kong’s CK Hutchison Holdings has vowed to pursue all possible legal action, both domestically and internationally, to protect its interests, calling Panama’s move to take over its two ports unlawful.\nThe conglomerate, led by the family of Hong Kong tycoon Li Ka-shing, issued the warning in its second statement in a week after the Panama Maritime Authority acted on a presidential decree allowing it to take over and operate the Balboa and Cristobal ports at either end of the Panama Canal.\nThe move followed a Supreme Court ruling last month that declared unconstitutional the law approving the concession held by CK Hutchison’s subsidiary, Panama Ports Company (PPC).\n“PPC has been advised that the ruling, the executive decree and corresponding actions taken by the Panama state relating to the operations of PPC’s terminals at the two ports are inconsistent with the relevant legal framework and the law that approved the concession contract,” the statement read.\n“The group continues to work with its legal counsel, has reserved all its rights, and intends to take all legal steps properly available to it to protect the group’s interests including recourse to additional national and international legal proceedings in the matter.”\nOn Tuesday, CK Hutchison had already condemned what it described as the uninvited takeover of its ports by Panamanian authorities, calling it “the culmination of a campaign” against PPC.\nIt said the government representatives had made direct physical entry into the two ports, telling PPC that the concession “no longer exists” and instructing its staff to follow their orders “under threat of criminal prosecution”.\n\n\n\n\nThe conglomerate warned that Panama would be responsible for “any harm and damage caused by the confiscatory actions it has taken”.\nSecretary for Commerce and Economic Development, Algernon Yau Ying-wah, earlier lodged a “strong protest” with Panama’s consul general in the city, expressing dissatisfaction with Panama’s actions and stressing that the government was firmly committed to safeguarding the rights of Hong Kong’s overseas enterprises.\nPanama’s takeover caps a year-long dispute over control of the two ports on the key shipping route, which has become a flashpoint in the geostrategic rivalry between Washington and Beijing.\nUS President Donald Trump had pledged to “take back” the canal from what he claimed was Chinese control.\nThe dispute also intersected with a separate attempt by CK Hutchison to sell more than 40 ports worldwide in a multibillion-dollar deal with a consortium led by US asset management giant BlackRock and shipping group MSC.\nThe deal drew the ire of Beijing, with Chinese regulators subsequently launching a comprehensive antitrust review in late March 2025, effectively halting the sale.\nReports indicated that Beijing sought a greater role for state-owned shipping giant Cosco in any arrangement involving the Panama terminals.\n",
            "link": "https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3344809/hong-kongs-ck-hutchison-vows-legal-action-over-unlawful-panama-port-seizure?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 12:46:02",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia reports record earnings quarter as China’s H200 sales freeze persists",
            "description": "Nvidia has yet to generate any revenue from its H200 chips in China and does not know if any sales will be allowed in the country, the company said, as the US chip giant reported record quarterly revenue on surging demand for data centre processors.\nWhile the Santa Clara-based tech giant remains the primary beneficiary of the global generative artificial intelligence boom, its ability to navigate the US-China tech war has become a challenge, with the pipeline for the H200 – Nvidia’s second-most powerful graphics processing unit to date – still dry in China.\nNo revenue had been booked from H200 chips and imports by China remained uncertain, despite small amounts being cleared by Washington for China-based customers, said Colette Kress, Nvidia’s executive vice-president and chief financial officer, during a post-earnings call on Thursday.\nThe remarks echoed those of US Commerce Department official David Peters, who said on Tuesday that Nvidia had yet to sell any H200 units in China.\nThe comments underscore regulatory uncertainty from Beijing regarding the imports of the GPU, which remains a key option for Chinese tech giants to train their AI models, after it was cleared by Washington in January on condition that the shipments do not exceed 50 per cent of the volume sold in the US.\nKress also flagged rising competition in China, where domestic chipmakers have rushed to initial public offerings (IPOs) in recent months to meet soaring demand and position themselves as alternatives to Nvidia.\n\n“Our competitors in China, bolstered by recent IPOs, are making progress and have the potential to disrupt the structure of the global AI industry over the long term,” said Kress, who added that the US must “engage every developer and be the platform of choice for every commercial business, including those in China” to maintain its leadership in AI computing.\nNvidia’s revenue in China fell to US$19.7 billion for the financial year ended January 25, down from US$25 billion a year earlier, according to its latest earnings release.\nJensen Huang, president and CEO of Nvidia, struck an upbeat tone, highlighting the company’s deeper partnerships this quarter with leading frontier model makers including OpenAI, Meta, Anthropic and xAI, which will use Nvidia’s Blackwell and coming Rubin processors for training and inference.\nThe optimism was reflected in the company’s quarterly earnings. It reported a revenue of US$68.1 billion for the quarter ended on January 25, up 73 per cent from a year earlier, beating the consensus estimate of US$65.8 billion. That was largely attributed to growth in its data centre revenue, which surged 75 per cent year on year to a record US$62.3 billion.\nFor the current financial quarter, it expected revenue to be around US$78 billion, compared with US$26 billion from the same period last year, also above forecasts.\nHuang said the company was able to move quickly because global demand for tokens had “gone completely exponential” as the industry went through an inflection point.\n“We know that the amount of computation necessary for the modern way of doing software is growing exponentially, and our strategy is to deliver an entire AI infrastructure every single year,” he said.\nThe earnings came amid concerns about AI’s economic impact, after a report by US research outfit Citrini forecast mass unemployment and recession by 2028 due to agentic AI models. The warning triggered a sell-off on Wall Street, as investors feared traditional business models could be cannibalised.\n“At a system level, we expect Nvidia to continue to be the leader across both training and reasoning-focused inference workloads,” Citi Research analysts said in a recent note. As rising capital expenditure levels among US hyperscalers raised concerns over an AI bubble, these investments would reaccelerate industry revenue and earnings growth, they added.\nNvidia shares initially jumped nearly 4 per cent in after-hours trading on the earnings beat before paring gains to trade flat.\n",
            "link": "https://www.scmp.com/tech/article/3344663/china-freeze-h200-chip-sales-clouds-nvidias-record-earnings?module=top_story&pgtype=subsection",
            "pub_date": "2026-02-27 11:35:55",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "On This Day|Legendary Hong Kong actor Ng Man-tat dies at 70 in 2021 – SCMP archive",
            "description": "This article was first published on February 27, 2021.\nBy Phila Siu\nLegendary Hong Kong actor Ng Man-tat, best known for co-starring alongside “king of comedy” Stephen Chow Sing-chi in many popular films, died on Saturday afternoon of liver cancer. He was 70.\nNg’s friend, Tenky Tin Kai-man, chairman of the Federation of Hong Kong Filmmakers, said the famous actor died peacefully at Tai Wai’s Union Hospital at 5.16pm, accompanied by his children and wife.\n“He left peacefully,” Tin said at the hospital. “He died in his sleep.”\n\nTin said earlier in the day Ng did not know his condition was so serious and had expected to recover.\nNg was born in Xiamen, in southeastern China, in 1951, and came to Hong Kong at the age of five. In the 1970s he attended acting classes organised by Television Broadcasts, and was a classmate of Chow Yun-fat, another renowned actor.\n\nHe started drawing public attention for his roles in the television programme called Chor Lau-heung, which was first broadcast in 1979.\nHis first film in 1981, Heroic Cops, was about illegal immigrants in Hong Kong.\nJust when Ng started rising to fame in the 1980s, he fell into a haze of drinking, gambling and womanising that left him with a debt of HK$300,000 (US$38,680). He sought help from his friend Chow Yun-fat, but was rejected.\n“I’d feel ashamed if I had to declare bankruptcy. I realised that I needed to figure a way out. I didn’t dare telling my family at the beginning and so I went to find [Chow Yun-fat],” Ng said in an interview in mainland China some years ago.\n“He did quite well in Hong Kong. He was popular and had made a lot of money. I asked him to lend me HK$300,000 in the 1980s, but he would not do so. I was upset. He wouldn’t lend me the money and wouldn’t say why.”\nHe realised that Chow would not give him money because that would not ultimately help him. He declared bankruptcy, worked hard, and worked his way up again. He was later thankful that Chow did not lend him the money.\nHe starred with Stephen Chow in the television dramas The Final Combat and The Justice of Life in the late 1980s and viewers fell in love with the pair’s chemistry.\n\nThereafter, he took part in many comedies with Stephen Chow, including All for the Winner in 1990 and Shaolin Soccer in 2001, which was the pair’s last film together.\nEarlier this month, Ng was asked in a mainland Chinese television programme if he would work with Stephen Chow again on a film.\nHe replied: “I’m not dead yet and he hasn’t retired. There’ll definitely be a chance.”\n\nNg was also a household name on the mainland. He starred in the mainland Chinese sci-fi blockbuster, The Wandering Earth, in 2017.\nThe news of his death has attracted more than 2.1 billion views on Weibo, China’s microblogging site.\n",
            "link": "https://www.scmp.com/news/hong-kong/society/article/3344578/legendary-hong-kong-actor-ng-man-tat-dies-70-2021-scmp-archive?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 11:31:11",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        }
    ]
}