{
    "data": [
        {
            "title": "Man claiming to have Aids arrested after hijacking Hong Kong bus, causing crash",
            "description": "A man who claims to have Aids has been arrested after hijacking a bus in Hong Kong and causing it to crash, the South China Morning Post has learned.\nA source said the 28-year-old mainland Chinese man, surnamed Miao, had blood stains on his hands when he was apprehended.\nThe man also incoherently spoke in Chinese and appeared dazed, according to the insider.\nThe 54-year-old Citybus driver, surnamed Choi, made a report to police at 6.45pm on Friday after upper-deck passengers told him that Miao had struck the rear-right windows with an emergency escape hammer, shattering them.\n\nAs Choi pulled over near 255 King’s Road in North Point to check the windows, Miao rushed down, jumped into the driver’s seat and released the handbrake, causing the bus to roll backwards and collide with a KMB bus behind it.\nChoi tried but failed to restrain Miao, who was later arrested by police outside an HSBC branch on King’s Road.\nFollowing further investigation, police arrested him on four charges: criminal damage, taking a vehicle without permission, driving without a licence and driving without third-party insurance.\nSince Miao claimed to have Aids and had been in physical contact and a struggle with the driver, both were taken to Eastern District Hospital for treatment.\n",
            "link": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3344948/man-claiming-have-aids-arrested-after-hijacking-hong-kong-bus-causing-crash?module=top_story&pgtype=section",
            "pub_date": "2026-02-28 11:46:32",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Some Hong Kong landlords spend millions fixing subdivided flats ahead of new law",
            "description": "Some Hong Kong landlords have spent millions renovating their subdivided flats to be among the first to meet the new standards coming into effect on March 1, but many others remain taken aback by the high costs and are unsure whether to proceed.\nBuilding experts have also warned of the challenges facing landlords seeking certification under the new law, including meeting waterproofing and fire safety requirements, which will require professional advice and supervision.\nMatthew Lau Chi-kwong, a landlord operating more than 500 subdivided homes across over 50 whole flats, is among the first to rectify his properties.\n“My stock is too big. I have to follow the government policy … However, I will not rush to rectify all of them to stay flexible,” he said.\nLau has spent around HK$2 million (US$255,672) to upgrade 20 standard flats by merging smaller units and installing windows, among other works. One project involved converting a flat of more than 1,000 sq ft in Happy Valley into four subdivided homes, each renting for about HK$13,000 per month.\n\n\nThe Basic Housing Units Ordinance stipulates that only subdivided homes that meet minimum standards and are certified by building professionals can be legally leased. Those failing to comply face a maximum fine of HK$300,000 and three years’ imprisonment.\nCertified properties, or “basic housing units”, must measure at least 86 sq ft, have a ceiling height of 2.3 metres (7.5 feet), proper windows and at least one toilet per unit, among other requirements. Certificates must be renewed every five years.\nFrom March 1, landlords can apply for certification, or they have a year to register for a grace period granting them until February 2030 to complete the required rectifications while continuing to lease their properties legally.\nLau said he would apply for the grace period to maximise rental returns but would take his time renovating the rest of his portfolio, as some projects could cost up to HK$400,000 per standard flat.\n“I would rather return them to the owners, or I can turn them into storage space for rental profits,” he said, adding that some could also be converted into bed-space dormitories with shared toilets and kitchens, which are not subject to the new ordinance.\nLau said he still saw ongoing business potential in the basic housing market, citing increasing demand from mainland Chinese students and professionals who preferred renting to buying as well as from local residents priced out of home ownership.\n“For qualified subdivided homes, the rent will not drop but increase. Those with good qualities can have their rent increased by 10 to 20 per cent,” he said.\nSonny Fung, who manages around 100 subdivided flats of 100 and 120 sq ft each, also sees an opportunity to profit from local tenants and imported workers.\nHowever, he expressed doubt about consistent returns from non-local students, some of whom view Hong Kong merely as a stepping stone.\n\nFung said his flats were already relatively spacious and well equipped, meaning he only needed to spend about HK$30,000 installing fire doors and safety equipment for three to four subdivided units within each standard flat.\nHe added that this was far lower than the general estimate of at least HK$120,000 for units requiring full rectification, including space rearrangement, toilet repairs and basic amenities.\nFung, who plans to expand his business to 500 basic housing units, said he believed that large-scale operators would dominate the future market due to their stronger resources and capital.\n“I estimate that it can take over a year to recover the renovation cost of a flat, as salaries go up and materials aren’t cheap either,” he said.\n“Many landlords are doing their calculations. They have earned much and they do not want to take risks.”\n\n\nComhome Social Realty, a social enterprise specialising in subdivided housing rental services, said it had begun receiving inquiries since January from landlords owning only a few subdivided homes in one flat.\n“Generally, owners are adopting a wait-and-see approach to the new law’s execution, as well as other owners’ responses. They tend to apply for the grace period first,” Comhome director Chan Tsz-hei said.\nHe added that many landlords were unaware of specific requirements, such as the installation of official water meters, waterproof toilets and a sink located outside the bathroom.\n“Some owners have said they may quit the market if the rectification cost is too high,” he said.\n\n\n\n\nApart from renovation work, landlords must also hire professionals for certification. Robin Leung Chi-tim, the immediate past president of the Hong Kong Institute of Surveyors, said certification alone could cost at least HK$15,000 per subdivided home, depending on its complexity.\nHe warned of possible hidden costs, citing water leakage as an example.\n“It takes time to conduct waterproof tests and requires cooperation from the flat underneath,” he said.\n“Upon discovering water leakage, we have to resolve the issue. It is not an easy task, as we have to look for the origin, which can be the floor, the wall or the drain … Each of them has different tests.”\nLeung also noted that verifying the fire resistance of fire safety doors could be difficult if landlords failed to provide the necessary certificates.\n“We would encourage landlords to hire registered professionals for design and planning, as well as work supervision, to save their costs in the long run. After all, they have to be certified again five years later,” he said.\n",
            "link": "https://www.scmp.com/news/hong-kong/society/article/3344935/hong-kong-landlords-split-over-costly-upgrades-meet-subdivided-housing-law?module=top_story&pgtype=section",
            "pub_date": "2026-02-28 10:10:48",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The big cornerstone comeback: what’s driving investors back to Hong Kong IPOs?",
            "description": "Until last year, Fidelity International’s most significant cornerstone commitments on the Hong Kong initial public offering (IPO) market dated back to 2021, when Chinese short-video platform Kuaishou Technology raised US$5.4 billion and healthcare firm Medlive Technology completed a US$543.4 million listing.\nThen for the next four years, the asset manager went quiet.\nLate last year it returned to Chinese assets in force. It backed gold miner Zijin Gold International’s US$3.2 billion listing in September 2025, followed by crypto platform HashKey Group, snack retailer Busy Ming and pork giant Muyuan Foods.\nFidelity’s comeback is not an isolated case.\nHeavyweight global investors such as BlackRock, Temasek and Qatar Investment Authority are reappearing in cornerstone books, signalling a shift in sentiment – and raising the question of what has changed in Hong Kong’s favour.\n“We have seen a robust comeback of international long-only investors – especially European and Middle Eastern sovereign funds – in Hong Kong’s IPO market, and we expect that momentum to carry into 2026,” said John Lee, vice-chairman and head of Greater China for global banking at UBS.\nThe return is not limited to Europe and the Middle East, with US and Singapore-based funds also re-emerging as cornerstone backers in major listings, particularly across consumption, industrial and hi-tech sectors.\n\n\n“In 2023 and 2024, many international investors reduced China exposure altogether,” Lee said. “But the tone has definitely changed over the past 12 to 18 months, with a gradual return of investors adding back China weightings – a trend that became more pronounced by the middle of 2025.”\nThe shift has been supported by improving sentiment towards consumption, clearer policy direction in technology and industrial upgrading, and growing confidence in the global competitiveness of Chinese companies, particularly in artificial intelligence and advanced manufacturing, he added.\nHong Kong’s equity market delivered its strongest annual gains since 2017 last year, supported by improved liquidity and renewed risk appetite. Benchmarks outpaced several major developed-market indices, while valuations remained well below those of US peers.\nFor investors such as Fidelity International, the move reflects a strong recalibration of risk appetite.\n“The Hong Kong IPO market today feels more anchored by companies listing for longer-term strategic reasons rather than short-term fundraising considerations,” said Tina Tian, portfolio manager at Fidelity International.\nFrom a risk-reward perspective, it felt like the right time to re-engage with Hong Kong, she added, noting that from both an issuer and investor perspective the quality and structure of the IPO pipeline had improved materially.\n“As global regulatory and geopolitical dynamics evolved, a Hong Kong IPO or secondary listing is increasingly seen as a way to broaden the investor base, enhance liquidity and maintain access to international capital within a familiar regulatory framework,” Tian said.\nThe cornerstone investor has long been a steady feature of Hong Kong’s IPO market, offering much-needed ballast to a market prone to sharp swings.\nWith early commitments to buy sizeable stakes and lock-up periods after listing, cornerstone funds anchor pricing, signal confidence and help stabilise deals before trading begins.\nForeign capital accounted for about 27 per cent of all 353 cornerstone investors across the top 20 IPOs of 2025 and those priced up to February 3, this year, according to data compiled by the SCMP.\nTheir presence has grown not only in headcount but also in investment size, with commitments noticeably larger than in 2022.\n“Large scale US funds are leaning into China’s consumption, infrastructure and industrial sectors,” a shift away from their earlier preference for property developers, said George Wu, partner at global law firm DLA Piper.\nThe contrast in cornerstone investor profiles between recent and older deals is stark.\nWhen China Tourism Group Duty Free raised US$2.3 billion in August 2022, the year’s largest IPO in Hong Kong, its cornerstone line-up was dominated by state-backed funds, including China State-owned Enterprise Mixed Ownership Reform Fund and China Structural Reform Fund.\nFast forward to last year, and the names tell a different story.\nMainland Chinese soft drink maker Eastroc Beverage, which raised US$1.3 billion in the city’s largest IPO as of February 3, drew 16 cornerstone investors, including six global heavyweights such as sovereign wealth fund Qatar Investment Authority – the single largest cornerstone investor with US$150 million – alongside Temasek, BlackRock, Fidelity and JPMorgan Asset Management.\nBlackRock put US$35 million into snack retailer Busy Ming. In industrials, Oaktree and Jane Street joined BlackRock in backing machinery maker Sany Heavy Industry, while Jane Street also took a cornerstone stake in air-conditioning components supplier Zhejiang Sanhua Intelligent Controls.\nMiddle Eastern sovereign wealth funds have been among the most active backers of China’s cutting-edge technology listings.\nAbu Dhabi Investment Authority was the largest cornerstone investor in AI start-up MiniMax with a US$65 million commitment and also led the cornerstone line-up in Shenzhen Edge Medical with US$15 million.\nKuwait Investment Authority ranked among the biggest cornerstone investors in battery giant Contemporary Amperex Technology, pledging US$500 million.\n“The direction of private capital flows is driven mainly by financial returns,” Wu said. “But in certain sensitive tech areas, geopolitical and national security concerns inevitably discourage some investors from taking action.”\n\n\n\n\nM&amp;G Investments, the London-based asset manager, was involved last year in the listings of logistics firm Jingdong Industrials and bubble tea chain Mixue Group as a cornerstone investor.\n“Our intention is to be long-term shareholders from the outset,” said Vikas Pershad, portfolio manager for Asian equities at M&amp;G Investments.\n“We see compelling opportunities in several areas: the renewables supply chain, scaled franchise-driven business models expanding domestically and internationally, technology platforms and logistics companies.\n“The common characteristics across these sectors are wide competitive moats, improving unit economics, robust balance sheets, long growth runways and valuations that remain discounted relative to global peers.”\nThe share of IPO proceeds locked up by cornerstone investors also climbed between 2021 and 2026, with the portion of total funds rising to roughly 49 per cent from about 14 per cent, according to LSEG Data &amp; Analytics data.\nMore than 270 global institutions acted as cornerstone investors in Hong Kong IPOs last year, while 40 listings included at least one international cornerstone backer, Hong Kong Exchanges and Clearing (HKEX) data showed.\nSo far in 2026, cornerstone tranches have accounted for around half of the US$1.81 billion raised across 11 Hong Kong IPOs.\nFor many global long-only investors, the renewed participation as cornerstone investors marks a clear break from the years when exposure to Chinese equities – and Hong Kong IPOs in particular – was sharply reduced or frozen altogether.\n“That said, state-linked capital helped companies bridge a difficult funding period and reach the IPO stage,” Wu said. “At the same time, local governments were advancing industrial upgrading amid property downturn and sluggish consumption, and companies urgently needed capital between 2022 and 2024. It was a very reasonable match.”\n“The direction of Chinese government capital flows is about supporting local industries, promoting employment and creating local social and economic value,” he added.\nGovernment-backed entities made up about 18 per cent of all cornerstone investors across the largest IPOs of 2025 and those priced up to February 3, this year.\nWhile Chinese government-linked investment vehicles have scaled back their overall share of cornerstone allocations during 2022 and 2024, they continue to anchor the country’s strategic sectors such as artificial intelligence, semiconductors, electric vehicles and new energy.\nAnalysts said their holdings underscored China’s push to shift away from property-driven growth towards new economic engines.\nSeveral semiconductor and biotech deals this year saw meaningful government participation. For instance, cornerstone investors in OmniVision Integrated Circuits, GigaDevice Semiconductor and Shanghai Iluvatar CoreX Semiconductor all included state-linked funds.\nWhile state backing has supported demand in strategic sectors, the broader revival in cornerstone activity has been driven by the return of international investors alongside reforms introduced by Hong Kong’s bourse operator.\nHKEX, which runs Asia’s third-largest stock market with a capitalisation of about US$6.5 trillion, has in recent years introduced a series of listing changes aimed at widening the pipeline of issuers and expanding the base of institutional investors.\n\n\nIts IPO allocation overhaul, effective August 4, guaranteed institutional investors at least 40 per cent of new shares through the bookbuilding tranche while cutting the potential clawback to the retail subscription pool to 35 per cent from 50 per cent under the old rules, a move aimed at reducing volatility in debut trading.\nThe growing prevalence of so-called A+H listings and “return-to-Hong Kong” transactions has also meant that investors are increasingly engaging with companies that are already well researched and subject to regulatory oversight in other major markets, helping to rebuild confidence in deal quality.\nThat shift has been reinforced by changes to the listing regime. Since 2018, HKEX has introduced Chapter 18A and, more recently, Chapter 18C to accommodate pre-revenue biotech and specialist technology companies, widening the pipeline of issuers and drawing fresh pools of capital.\nJohnson Chui, managing director and head of global issuer services at HKEX, said the increasingly diverse mix of participants in IPOs reflected investor confidence in Hong Kong as a resilient and internationally competitive capital-raising venue.\n“HKEX will continue to enhance its attractiveness to global investors,” he said.\nAccording to Peihao Huang, head of equity capital markets for Asia Pacific at J.P. Morgan, cornerstone investors were essential to issuers and banks in setting valuation parameters, identifying opinion-leading institutions and reducing execution risk and helping build momentum during book-building.\nShe added that the presence of well-known international cornerstone investors often strengthened demand from other institutional and retail investors, as their participation was widely viewed as a validation of deal quality and valuation discipline.\n“Cornerstone participation has always been a defining feature of Hong Kong IPOs, but in this cycle it has become the new norm,” she said.\n",
            "link": "https://www.scmp.com/business/banking-finance/article/3344890/big-cornerstone-comeback-whats-driving-investors-back-hong-kong-ipos?module=top_story&pgtype=section",
            "pub_date": "2026-02-28 10:10:48",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese chip firms Cambricon, Moore Threads post sales jump on domestic demand",
            "description": "Chinese chip designers from Cambricon Technologies and Moore Threads Technology to MetaX Integrated Circuits posted stellar earnings on Friday, driven by growing demand for domestic semiconductors amid Beijing’s tech-sufficiency push.\nBeijing-based Cambricon, seen as a local alternative to US chip giant Nvidia, reported a net profit of 2.06 billion yuan (US$301 million) for 2025, its first full-year profit since listing in 2020, according to a filing to the Shanghai Stock Exchange.\nRevenue for the year rose 450 per cent to 6.5 billion yuan from a year earlier.\nThe company credited the revenue growth to the competitiveness of its chip products, which lifted its market share amid rising demand for artificial intelligence computing resources that support AI adoption across diverse business scenarios.\nCambricon’s shares closed 0.8 per cent higher at 1,178 yuan.\n\nMoore Threads and MetaX reported annual revenues of 1.5 billion yuan and 1.6 billion yuan for 2025, up 243 per cent and 121 per cent year on year, respectively.\nBoth companies reported annual losses but narrowed them on the back of strong product demand.\nMoore Threads narrowed its annual loss by 36.7 per cent to 1.02 billion yuan, thanks to “market recognition of its products” amid the country’s AI boom, the company said in its earnings statement to the Shanghai exchange. MetaX narrowed its annual loss by nearly 44 per cent to 781 million from a year earlier.\nMoore Threads’ shares closed flat at 608.30 yuan, while MetaX’s shares rose 0.4 per cent to 535.62 yuan.\nMeanwhile, Zhongji Innolight, a telecom-equipment maker, reported a 60 per cent increase in revenue last year to 38.2 billion yuan, while profit surged 108 per cent to 10.8 billion yuan, supported by its clients’ investments in AI infrastructure equipment.\nEarlier this week, a slew of Chinese tech firms, from semiconductor designer Hygon Information Technology and foundry Hua Hong Semiconductor to supercomputer maker Sugon, reported rising revenue on domestic demand for home-grown computing systems.\nHygon posted a 57 per cent jump in annual revenue to 14.4 billion yuan and a 32 per cent increase in profit to 2.54 billion yuan last year, attributing the results to a “continued rise in demand for domestically produced high-end chips”.\nSugon, a maker of high-performance computing systems and Hygon’s largest shareholder, saw revenue rise 13.9 per cent year on year to 14.97 billion yuan last year, while net profit increased 10.5 per cent to 2.11 billion yuan.\nChinese foundry Hua Hong reported record revenue for the fourth quarter of 2025, reaching US$660 million, up 22.4 per cent from a year earlier.\nTheir rising sales came as Beijing has yet to approve the sale of Nvidia’s highly sought-after H200 chips, leaving local firms, which are racing to embrace AI across their organisations for efficiency gain, scrambling to adopt domestic alternatives.\nAt its recent earnings call, Nvidia said it had yet to generate any revenue from its H200 chips in China. It said it did not know if any sales would be allowed in the country, after posting record quarterly revenue on surging demand for its data centre processors.\n",
            "link": "https://www.scmp.com/tech/article/3344927/chinese-chip-firms-cambricon-moore-threads-post-sales-jump-surging-domestic-demand?module=top_story&pgtype=section",
            "pub_date": "2026-02-28 10:10:48",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Breakthrough or hype? How WeRide aims to edge rivals in crowded robotaxi field",
            "description": "WeRide, one of China’s big three robotaxi companies, has cut research and development (R&amp;D) costs by “millions” of US dollars by using artificial intelligence to train its fleet in virtual worlds, its CEO said.\nWhile rivals had also developed AI models simulating the physical world, WeRide’s efforts stood out as it was using its world model Genesis to support its global expansion strategy, said Tony Han.\n“It’s the first real marriage between physical AI and generative AI,” Han told the South China Morning Post.\nA major challenge for the autonomous vehicle industry has been the high costs associated with developing self-driving algorithms that can generalise across different markets and terrains.\nIn particular, the low tolerance for accidents has meant algorithms must be trained on many low-probability “edge cases” that occur in the real world, as shown by a recent incident in the US where a Waymo robotaxi drove passengers into a police stand-off.\n\nThis has pushed many of the industry’s leading players, including Waymo and Tesla, to turn to AI world models as they seek to reduce unit costs to drive fleet expansion.\nIn China, Guangzhou-based WeRide and crosstown rival Pony.ai have both emphasised their world model efforts in recent months, as they look to keep up with Baidu’s Apollo Go, the domestic leader by fleet size.\nHan said Genesis had allowed WeRide to test new self-driving algorithms in a matter of days in a virtual world, where previously the same tests would have required hundreds of cars operating in the real world for months.\nCrucially, Genesis enables WeRide engineers to simulate rare edge cases that are key to ensuring self-driving safety yet difficult to capture in the real world.\nThis had resulted in a reduction of at least 75 per cent in WeRide’s data labelling and collection costs, Han said, adding that such costs made up a large percentage of the company’s R&amp;D spending – around 316 million yuan (US$46 million) in the third quarter of 2025, or around 73 per cent of total operating expenses.\nHan said Genesis was almost entirely the result of advancements in generative AI technology in recent years. The company’s early experiments with physical world simulations had been rudimentary, with cars and pedestrians represented by Roblox-like blocks, limiting practical usefulness.\nThis changed as generative AI, which uses machine learning to create models of its underlying datasets, made virtual worlds increasingly accurate depictions of the real world.\n\nWeRide trained Genesis using billions of kilometres of real-world driving data collected by the company, including more than eight years of real-world edge cases. Its powerful capabilities mean WeRide could sell the model as a stand-alone product in future – a long-standing “dream” for Han, a former chief scientist of autonomous driving at Baidu.\nHan said limits on access to computational power, more than rising graphics processing unit (GPU) prices, were now the main obstacle to continued improvement, given the clear upside of investment in this area for WeRide’s bottom line.\n“Every dollar we spend improving Genesis leads to 10 times more R&amp;D efficiency, because it’s less spent on road testing and recruiting data labourers,” he said, adding they were now “probably” doubling their GPU stock every quarter. “The constraint is the shortage of memory and availability of certain advanced GPUs.”\nWith the help of AI, WeRide aims to ramp up its global fleet from around 1,000 today to up to 3,000 robotaxis by the end of this year.\nHowever, investors have shown concern for WeRide’s future in a crowded field. Apollo Go and Pony.ai aside, Chinese start-ups such as AutoX and Momenta have also recently expanded pilot programmes, while Volkswagen announced this week its plans to launch its first robotaxi fleet in the US.\nSince its November listing, WeRide’s Hong Kong shares have fallen more than 20 per cent, while its Nasdaq shares have slumped almost 70 per cent in the past year. Analysts have highlighted the company’s continued R&amp;D-driven losses as a point of concern, with profitability not expected until 2030.\n\nIt remains uncertain whether Genesis will give WeRide an edge over rivals, with Pony.ai recently touting that its world model PonyWorld generates 10 billion kilometres for testing each week.\nLeading US player Waymo also unveiled its world model earlier this month, built on Google DeepMind’s most powerful world model Genie 3. It said the collaboration with its fellow Alphabet subsidiary gave its model an edge over others in the autonomous vehicle industry, as Genie 3 was trained on a huge number of videos and not just real-world driving data.\nBeyond technical indicators, Han pointed to WeRide’s aggressive global expansion strategy as a differentiator from its competitors, as the strategy could be further enhanced with a powerful world model even if it was not industry-leading.\nWhile WeRide still lags far behind Baidu’s Apollo Go in domestic deployment, the company has already expanded to more than 40 cities across 11 countries and regions, one of the highest in the world, compared with eight for Pony.ai and three for Waymo.\nThe company struck a deal last year with Grab, the largest ride-hailing app in Southeast Asia, and announced a major expansion of its partnership with Uber earlier this month to deploy at least 1,200 robotaxis across the Middle East as soon as 2027.\nMeanwhile, Baidu said on Thursday that Apollo Go had reached 26 cities globally.\n“Genesis for us makes sense from a business expansion perspective,” said Han. “It allows us to more easily get into a new country or market without having to do all the hard work of collecting new road data.”\nWith earnings coming up on March 23, investors could expect to see a Genesis-powered boost to the company’s financial health, he said. “I think we will have very good numbers.”\n",
            "link": "https://www.scmp.com/tech/article/3344817/breakthrough-or-hype-how-weride-aims-steer-past-rivals-crowded-robotaxi-field?module=top_story&pgtype=section",
            "pub_date": "2026-02-28 10:10:48",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Breakthrough or hype? How WeRide aims to edge rivals in crowded robotaxi field",
            "description": "WeRide, one of China’s big three robotaxi companies, has cut research and development (R&amp;D) costs by “millions” of US dollars by using artificial intelligence to train its fleet in virtual worlds, its CEO said.\nWhile rivals had also developed AI models simulating the physical world, WeRide’s efforts stood out as it was using its world model Genesis to support its global expansion strategy, said Tony Han.\n“It’s the first real marriage between physical AI and generative AI,” Han told the South China Morning Post.\nA major challenge for the autonomous vehicle industry has been the high costs associated with developing self-driving algorithms that can generalise across different markets and terrains.\nIn particular, the low tolerance for accidents has meant algorithms must be trained on many low-probability “edge cases” that occur in the real world, as shown by a recent incident in the US where a Waymo robotaxi drove passengers into a police stand-off.\n\nThis has pushed many of the industry’s leading players, including Waymo and Tesla, to turn to AI world models as they seek to reduce unit costs to drive fleet expansion.\nIn China, Guangzhou-based WeRide and crosstown rival Pony.ai have both emphasised their world model efforts in recent months, as they look to keep up with Baidu’s Apollo Go, the domestic leader by fleet size.\nHan said Genesis had allowed WeRide to test new self-driving algorithms in a matter of days in a virtual world, where previously the same tests would have required hundreds of cars operating in the real world for months.\nCrucially, Genesis enables WeRide engineers to simulate rare edge cases that are key to ensuring self-driving safety yet difficult to capture in the real world.\nThis had resulted in a reduction of at least 75 per cent in WeRide’s data labelling and collection costs, Han said, adding that such costs made up a large percentage of the company’s R&amp;D spending – around 316 million yuan (US$46 million) in the third quarter of 2025, or around 73 per cent of total operating expenses.\nHan said Genesis was almost entirely the result of advancements in generative AI technology in recent years. The company’s early experiments with physical world simulations had been rudimentary, with cars and pedestrians represented by Roblox-like blocks, limiting practical usefulness.\nThis changed as generative AI, which uses machine learning to create models of its underlying datasets, made virtual worlds increasingly accurate depictions of the real world.\n\nWeRide trained Genesis using billions of kilometres of real-world driving data collected by the company, including more than eight years of real-world edge cases. Its powerful capabilities mean WeRide could sell the model as a stand-alone product in future – a long-standing “dream” for Han, a former chief scientist of autonomous driving at Baidu.\nHan said limits on access to computational power, more than rising graphics processing unit (GPU) prices, were now the main obstacle to continued improvement, given the clear upside of investment in this area for WeRide’s bottom line.\n“Every dollar we spend improving Genesis leads to 10 times more R&amp;D efficiency, because it’s less spent on road testing and recruiting data labourers,” he said, adding they were now “probably” doubling their GPU stock every quarter. “The constraint is the shortage of memory and availability of certain advanced GPUs.”\nWith the help of AI, WeRide aims to ramp up its global fleet from around 1,000 today to up to 3,000 robotaxis by the end of this year.\nHowever, investors have shown concern for WeRide’s future in a crowded field. Apollo Go and Pony.ai aside, Chinese start-ups such as AutoX and Momenta have also recently expanded pilot programmes, while Volkswagen announced this week its plans to launch its first robotaxi fleet in the US.\nSince its November listing, WeRide’s Hong Kong shares have fallen more than 20 per cent, while its Nasdaq shares have slumped almost 70 per cent in the past year. Analysts have highlighted the company’s continued R&amp;D-driven losses as a point of concern, with profitability not expected until 2030.\n\nIt remains uncertain whether Genesis will give WeRide an edge over rivals, with Pony.ai recently touting that its world model PonyWorld generates 10 billion kilometres for testing each week.\nLeading US player Waymo also unveiled its world model earlier this month, built on Google DeepMind’s most powerful world model Genie 3. It said the collaboration with its fellow Alphabet subsidiary gave its model an edge over others in the autonomous vehicle industry, as Genie 3 was trained on a huge number of videos and not just real-world driving data.\nBeyond technical indicators, Han pointed to WeRide’s aggressive global expansion strategy as a differentiator from its competitors, as the strategy could be further enhanced with a powerful world model even if it was not industry-leading.\nWhile WeRide still lags far behind Baidu’s Apollo Go in domestic deployment, the company has already expanded to more than 40 cities across 11 countries and regions, one of the highest in the world, compared with eight for Pony.ai and three for Waymo.\nThe company struck a deal last year with Grab, the largest ride-hailing app in Southeast Asia, and announced a major expansion of its partnership with Uber earlier this month to deploy at least 1,200 robotaxis across the Middle East as soon as 2027.\nMeanwhile, Baidu said on Thursday that Apollo Go had reached 26 cities globally.\n“Genesis for us makes sense from a business expansion perspective,” said Han. “It allows us to more easily get into a new country or market without having to do all the hard work of collecting new road data.”\nWith earnings coming up on March 23, investors could expect to see a Genesis-powered boost to the company’s financial health, he said. “I think we will have very good numbers.”\n",
            "link": "https://www.scmp.com/tech/article/3344817/breakthrough-or-hype-how-weride-aims-steer-past-rivals-crowded-robotaxi-field?module=top_story&pgtype=subsection",
            "pub_date": "2026-02-28 10:10:48",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong developer Sino Land posts steady profit amid market improvements",
            "description": "Major Hong Kong developer Sino Land posted a steady net profit for the six months ended December, propped up by early gains from a recovery in the city’s residential property market.\nSino Land reported a net profit of HK$2.22 billion (US$284 million) in the first half of its current financial year – excluding revaluation losses on investment properties – that was slightly down from HK$2.24 billion a year earlier, according to its Hong Kong stock exchange filing on Friday.\nThe company’s revenue rose 34.5 per cent to HK$5.19 billion from HK$3.85 billion a year ago. Revenue from property sales, including sales of associates and joint ventures, jumped 2.8 times to HK$6.91 billion from HK$2.45 billion in the same period in 2024.\nTaking into account a HK$682 million revaluation loss on investment properties, the developer earned HK$1.53 billion in the period, down from HK$1.82 billion a year ago.\n“I am encouraged by the clear improvement in both the economic and operating environment,” chairman Daryl Ng Win Kong said in the filing, citing the interest-rate-cut cycle, Hong Kong’s talent admission scheme and mainland China’s national economic blueprint for bolstering the property sector.\nDelivering his first earnings after taking over the chairman role from his father, Ng highlighted the city’s encouraging property sales performance in the second half of 2025, which delivered proceeds of HK$6.5 billion.\nThe developer’s results come as the city’s housing market showed signs of stabilising. Home prices have climbed 3.7 per cent so far this year, according to the Centaline City Leading Index, after gaining 1.6 per cent in January.\n\nTransaction volumes have also strengthened. Primary home sales surged to a seven-year high in January, reaching about 1,500 units – up 101 per cent year on year – while secondary sales hit an eight-year high at 4,100 units, a 44 per cent increase from a year ago.\nSino Land’s shares edged down 0.1 per cent to HK$12.78 on Friday, but rose 25 per cent this year. Out of the 12 analysts’ recommendations of the stock tracked on Bloomberg, 10 suggested “Buy” and two said “Hold”.\nThe company has two new residential projects in the pipeline: one in Tseung Kwan O and another at Wing Kwong Street in To Kwa Wan that is being co-developed with the Urban Renewal Authority.\nLast month, a joint venture between Sino Land and Great Eagle Holdings won a government residential site tender in Kowloon for HK$1.61 billion, outbidding major Hong Kong developers. It followed another tender win in Tuen Mun for HK$1.09 billion last August.\n“With interest rates on a downward trajectory, we will continue to strategically allocate our cash resources and actively pursue opportunities,” Ng said.\nSino Land declared an interim dividend of HK$0.15 per share to be payable either by cash or shares on April 23.\nProfit at the company’s Sino Hotels unit – owner of City Garden Hotel in Fortress Hill, Conrad Hong Kong in Admiralty and the Royal Pacific Hotel &amp; Towers in Tsim Sha Tsui – increased 19.3 per cent in the six months to December to HK$51.9 million from HK$43.5 million a year earlier, according to a separate disclosure.\nTsim Sha Tsui Properties, another listed company under the Sino Group, recorded a 13 per cent drop in profit to HK$905 million from HK$1.04 billion in the year-earlier period.\n",
            "link": "https://www.scmp.com/business/companies/article/3344915/hong-kong-developer-sino-land-posts-steady-profit-points-clear-market-improvements?module=top_story&pgtype=subsection",
            "pub_date": "2026-02-28 10:01:39",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Personal data stolen in ransomware attack on Hong Kong’s Ngong Ping 360 attraction",
            "description": "The operator of Hong Kong’s Ngong Ping 360 cable car attraction has apologised after the personal data of visitors and employees was stolen in a ransomware attack.\nThe company on Thursday detected irregularities in its internal network system and alerted police and the Office of the Privacy Commissioner for Personal Data.\n“Subsequent investigation confirmed that certain data had been stolen and the company was subjected to a ransom demand,” the operator said on Friday. “Ngong Ping 360 deeply apologises for any inconvenience caused to guests, employees and relevant stakeholders by this incident.”\nA preliminary assessment found the breach compromised information about staff, annual pass holders, suppliers and tenants at Ngong Ping Village, as well as guests on promotional lists.\n“It has been initially confirmed that the involved guest data consists of names and contact details (such as phone numbers or email addresses),” the company said.\nThe operator emphasised that the compromised internal network was separate from the cable car operation system, and safety and electronic payment data remained unaffected.\n“Cable car ticketing, boarding services and other operations continue as normal, and guests may proceed with their journeys between Tung Chung and Ngong Ping as usual,” it said.\nThe attraction, which operates the longest bicable cable car system in Asia, deployed additional staff on-site to manage crowd flow and established a dedicated inquiry hotline at 3666 0622.\n“Ngong Ping 360 will fully cooperate with [the] police investigation and make every effort to protect the rights and interests of guests, employees and relevant stakeholders,” the operator said.\nThe Office of the Privacy Commissioner for Personal Data said it had launched an investigation into the breach after receiving a notification on Thursday and had advised the operator to inform the affected parties as soon as possible.\nThe South China Morning Post has reached out to police for comment.\n",
            "link": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3344932/personal-data-stolen-ransomware-attack-hong-kongs-ngong-ping-360-attraction?module=top_story&pgtype=section",
            "pub_date": "2026-02-28 08:01:35",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong to offer 9 residential sites to developers in 2026-27 land sale plan",
            "description": "Nine residential sites will be offered to developers in the coming financial year to provide about 6,650 flats under Hong Kong’s land sale programme, after authorities highlighted the property market had stabilised in the latest budget.\nCombined with other land sources, such as urban redevelopment, private development and projects linked to railway properties, the potential supply of new flats is estimated to reach an eight-year high of about 22,580 in the 2026-27 financial year.\nThe current record was set in 2018-19 when about 25,500 flats were made available.\nSecretary for Development Bernadette Linn Hon-ho revealed on Friday that the coming land sale programme would offer nine residential sites, including three that were on the previous list of plots.\n“It is obvious that the market is recovering and transactions have steadily increased,” she said.\nThe nine sites are located in Stanley, Hung Shui Kiu, Ho Man Tin, Sai Kung, Sha Tin and Tung Chung. Each plot is expected to yield between 250 and 1,580 flats.\nThree of the sites are in Hung Shui Kiu, an area of the New Territories that authorities aim to turn into a hub for high-value professional services and logistics as part of the Northern Metropolis megaproject.\n\n\n\n\nThese sites are expected to provide about 3,120 flats, accounting for nearly half of the potential supply from the nine sites.\n“In the future, about half or more of the [city’s overall] supply will come from the Northern Metropolis,” Linn said.\nThe megaproject involves transforming 30,000 hectares (74,130 acres) of land into an economic powerhouse and housing hub.\nThe government also aims to build 308,000 flats across the city over the next 10 years.\nLinn said it was “natural” for more supply to come from the Northern Metropolis, as it was a new development area, whereas the city’s existing urban core was already densely populated.\nShe said the government only planned to put up a site in Tung Chung for sale in the first quarter of 2026-27. The site was part of the previous programme and could provide about 990 flats, she added.\nThe new financial year will be the second consecutive year to exclude commercial sites from the land sale programme.\nFinancial Secretary Paul Chan Mo-po said on Wednesday that the residential property market had just stabilised but the commercial market remained relatively weak, keeping land premium income at a low level.\nThe administration forecast that the programme would generate HK$18 billion in land premiums in 2026-27, an increase of nearly 3 per cent from the modified estimate for the current financial year.\n",
            "link": "https://www.scmp.com/news/hong-kong/society/article/3344926/hong-kong-land-sale-scheme-offer-9-residential-sites-developers-2026-27?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 22:51:49",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US ruling on Insta360 infringing GoPro patent has no impact on current offerings",
            "description": "A US trade panel investigating a patent dispute between GoPro and Chinese rival Insta360 found a violation involving design applied to outdated cameras of the Chinese firm, effectively allowing it to remain in the US market without any restrictions.\nThe case centred on six patents held by GoPro. The US International Trade Commission (ITC) on Thursday determined violation of one patent relating to camera design, and issued orders “prohibiting the unlicensed importation by Insta360 of certain cameras and camera systems” that infringe the patent. The order will go into effect after a presidential review.\nThe design is best known for GoPro’s Hero action camera, which has been widely compared with Insta360’s Ace series.\nHowever, the ban “applies only to certain legacy models in Insta360’s Ace series and has no impact on Insta360’s current product offerings in the United States”, said the Shenzhen-based device maker, also known as Arashi Vision, in a statement.\nThe remaining five patents, relating to utility features such as stabilisation, horizon levelling and distortion correction, do not constitute infringement, according to the ruling.\n“As a result of the commission’s ruling, Insta360 will continue to import and sell its existing product line-up in the United States without restriction,” Insta360 said. It called the result “a complete victory”.\nSan Mateo, California-based GoPro hailed the ITC’s decision on design infringement, which it said “reinforces the integrity of GoPro’s visual identity in the marketplace”.\nIn 2024, GoPro filed a complaint against Insta360, alleging a violation of Section 337 of the US Tariff Act of 1930, a law that targets imports that violate intellectual property rights or other fair competition practices.\nLast year, an Administrative Law Judge (ALJ) issued a similar ruling, finding a violation of the design patent but none related to the five utility patents.\nThe ITC’s decision on Thursday upheld the ALJ’s decision on the design patent, but reversed some details regarding two other patents.\nThe dispute comes as the two camera makers are locked in fiercer competition. GoPro, which has long dominated the action-camera segment, has seen a growing challenge from Insta360, best known for panoramic cameras, and DJI, the Chinese drone giant.\nGoPro’s global market share of action cameras dropped to 18 per cent as of September 2025, compared with 84 per cent in 2022, according to Beijing-based consultancy Meritco Services. At the same time, DJI’s share rose to 66 per cent and Insta360’s to 13 per cent.\n",
            "link": "https://www.scmp.com/tech/article/3344875/us-trade-panel-rules-insta360-infringed-gopro-design-no-impact-current-offerings?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 22:30:56",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong budget 2026-27: minister defends cuts to kindergarten subsidy",
            "description": "Hong Kong authorities have defended a controversial subsidy cut for the kindergarten sector for the coming financial year, saying the low birth rate and resultant shrinking pupil population have prompted a reassessment of education policy priorities.\nSecretary for Education Christine Choi Yuk-lin said on Friday that the government would channel more resources towards promoting “high-quality education” and adopt a more targeted approach to helping pupils in need.\nAccording to the 2026-27 budget, which was unveiled on Wednesday, the early childhood sector will receive HK$4.5 billion (US$575 million) from the government, a drop of 6.6 per cent from the current financial year ending on March 31.\nThe government will also scrap two grants that fund kindergarten activities and the hiring of supply teachers. The policies cost authorities HK$15.9 million and HK$24.9 million, respectively, in the last school year.\nIn a media briefing to explain the measures, Choi said: “Hong Kong’s population structure is undergoing changes, with a decline in birth rate and a fall in the school-aged population.”\nThe government has estimated that there will be just 105,800 toddlers enrolled in kindergartens in the next school year, 79,000 of whom will attend subsidised institutions, both of which are record lows.\n“The government’s investment in education has not actually decreased. It is just that resources are now being more flexibly allocated according to the actual situation,” Choi said.\nShe said the cuts had followed a comprehensive review by the Education Bureau.\n“We are of the view that [the cut] will not affect the operation of kindergartens,” the minister said, adding that there were still more than 10 government grants available to kindergartens.\n\n\n\n\nIn comparison, government cuts to the primary and secondary education sectors stood at less than 2 per cent and 1 per cent, respectively. Meanwhile, spending will increase by 4 per cent for the tertiary and vocational education sectors.\nThe latest budget did not reintroduce a HK$2,500 grant for secondary, primary and kindergarten pupils, despite its scrapping last year under cost-cutting measures prompting a backlash.\nChoi said on Friday that the government planned to use its allocated funds to further promote “high-quality education”.\n“We hope to allocate our resources to help push up education quality,” she said, citing the use of artificial intelligence (AI) in curricula and AI training for teachers as examples.\n“This is to be in line with the national development laid down in the 15th five-year plan for 2026–30.”\nAt the same briefing, Secretary for Labour and Welfare Chris Sun Yuk-han also vowed to continue efforts to attract talent to the city.\n“Although it seems there is not much coverage about it in the budget, Hong Kong attracts talent through its institutional strength, not by increasing expenditure,” he said.\nIn the latest budget, government spending on education is forecast to reach HK$112 billion in 2026-27, accounting for 13.3 per cent of total estimated government expenditure. The figure is 1 per cent higher than the 2025-26 revised estimate.\nOn the social welfare front, expenditure is expected to reach HK$148.1 billion, about 17.6 per cent of total government spending for 2026-27, and 14.4 per cent higher than the 2025-26 revised estimate.\n",
            "link": "https://www.scmp.com/news/hong-kong/education/article/3344918/hong-kong-budget-2026-27-minister-defends-cuts-kindergarten-subsidy?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 21:46:14",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Moore Threads’ flagship AI chip compatible with latest Alibaba models",
            "description": "Semiconductor designer Moore Threads Technology has achieved full-stack compatibility between its flagship MTT S5000 graphics processing unit (GPU) and Alibaba Cloud’s Qwen3.5-series artificial intelligence models, as China’s tech self-reliance efforts gather pace.\nBeijing-based Moore Threads, founded by former Nvidia executive James Zhang Jianzhong, on Thursday said the firm’s flagship AI chip was now compatible with the three new models under the latest Qwen series – Qwen3.5-35B-A3B, Qwen3.5-122B-A10B and Qwen3.5-27B.\nAlibaba Cloud is the AI and cloud computing services unit of Hangzhou-based Alibaba Group Holding, owner of the South China Morning Post.\nThe announcement comes a day after Alibaba Cloud released its Qwen 3.5 medium model series, part of the Qwen 3.5 family unveiled earlier this month. The company had earlier touted how the series performed in certain benchmarks with leading models from OpenAI, Anthropic and Google DeepMind.\nMoore Threads’ initiative reflects how Chinese chip developers are rushing to support the country’s top-performing AI models. These GPU designers – including MetaX Integrated Circuits, Biren Technology and Enflame – are in a heated race to fill the void left by Nvidia in the domestic market.\nNvidia does not know if and when its much-anticipated H200 chips would be allowed into China, the company said on Thursday.\nThat showed the ongoing regulatory uncertainty from Beijing regarding GPU imports, which Chinese “big tech” companies are keen to acquire for their AI development projects.\n\nIn a separate move, AI start-up DeepSeek has given Chinese chip designers early access to its coming V4 model for performance optimisation, something it has not done with US chip suppliers, according to a report on Wednesday by Reuters, citing sources familiar with the matter.\nHuawei Technologies was among the domestic suppliers with access to the new DeepSeek model, the report said, adding that this pre-release engagement was not standard industry practice.\nDeepSeek and Huawei did not immediately respond to requests for comment on Friday.\nFor Moore Threads, which made a splash on the capital market through its Shanghai listing in December, it has stepped up efforts to make its GPUs compatible with the latest Chinese AI models on the market.\nEarlier this month, the company announced “day zero” chip compatibility with Zhipu AI’s GLM-5 model, which was launched ahead of China’s Spring Festival holiday.\nAs part of the chip designer’s latest initiatives, developers now can develop new models using the company’s native programming language based on its MUSA – for Meta-computing Unified System Architecture – ecosystem.\nThat would make the development process much easier by lowering the difficulty of transforming from Nvidia’s CUDA – for Compute Unified Device Architecture – platform. These platforms provide the software layer that lets developers harness the power of GPUs for applications.\n",
            "link": "https://www.scmp.com/tech/tech-trends/article/3344877/moore-threads-flagship-ai-chip-compatible-alibaba-models-tech-self-reliance-push?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 21:36:06",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "3 injured in Hong Kong after wild boar wanders into residential area",
            "description": "Three people suffered leg injuries after a wild boar was found roaming inside an MTR station and at a residential estate in Hong Kong on Friday.\nPolice said they received multiple reports of sightings of the wild boar at Wu Kai Sha station and the Lake Silver housing complex at 5.08pm.\n\nThe force said two men and one woman aged 45 to 87 suffered leg injuries, but it was unclear whether the boar wounded them.\nThey were taken to Prince of Wales Hospital in Sha Tin for treatment.\nAuthorities later found the wild boar in the car park of Silver Lake, but the animal fled in the direction of Lee On Estate.\n",
            "link": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3344905/3-injured-hong-kong-after-wild-boar-wanders-residential-area?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 20:06:49",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New World reports loss as deleveraging takes priority, dividend suspended",
            "description": "New World Development posted a net loss of HK$3.73 billion (US$477 million) for the first half of fiscal 2026, as asset write-downs continued to weigh on earnings despite improving Hong Kong home sales and ongoing deleveraging efforts.\nThe loss narrowed 44 per cent year on year for the six months ended December 31, as impairments on investment properties eased and financing and tax expenses related to mainland projects declined, according to a Hong Kong stock exchange filing on Friday. No interim dividend was declared.\n“Our team has worked very hard during this period, leading to ongoing improvements in our operations,” said CEO Echo Huang during the earnings call on Friday.\nHuang said the red ink was mainly attributable to non-cash provisions, including impairments on properties under development and completed units held for sale. She stressed that underlying operations had improved and that “we have achieved good results in improving revenue and reducing costs.”\n\nRevenue fell 50 per cent to HK$8.39 billion, dragged down by weaker construction income and fewer property handovers in mainland China.\n“In 2025, we capitalised on the recovery in Hong Kong’s real estate market to seize new opportunities,” Huang said in the filing. “In a volatile market, our focus is not only on growing our business, but also on the continuous optimisation of our financial structure.”\nDeleveraging remains central to the group’s strategy.\nTotal debt declined by HK$1.7 billion to HK$144.3 billion. However, net debt rose HK$2.6 billion to HK$122.7 billion, with the gearing ratio increasing to 59.7 per cent from 58.1 per cent a year earlier.\nChief financial officer Edward Lau attributed the rise to the accounting treatment of Hong Kong joint ventures, as well as repayments of construction loans tied to those projects.\nManagement has stepped up liquidity measures, including bank refinancing and residential asset sales, raising more than HK$34.8 billion from property disposals since early 2025.\n“When cash flow is stable, we will continue to reduce debt – that’s our topmost goal,” Lau said, adding there were currently no further debt exchange plans.\nAddressing market speculation, Huang said the company had no plans for share placements or rights issues.\nShe added that the group’s seven debt-reduction initiatives were “working”, supported by improving contracted sales and a steady recovery in leasing across its mall and office portfolio. Since early 2025, NWD has raised more than HK$34.8 billion through property disposals and sales.\nHong Kong contracted sales reached HK$10.3 billion in the first half, the highest level since 2021, with the Deep Water Pavilia project 93 per cent sold. More than 1,300 units are scheduled for launch in the second half.\nShares of NWD closed 3.6 per cent higher to HK$10.86 on Friday ahead of the earnings announcement. The stock has gained 49.4 per cent so far this year, as Hong Kong’s housing market shows signs of stabilising.\nHowever, Morgan Stanley gave the embattled developer a “reduce” rating with a target price of HK$6.50, according to a report earlier this month.\nThe results come as its parent, Chow Tai Fook Enterprises, faces continued investor scrutiny over its capital allocation and restructuring strategy amid market speculation about potential external investment.\nHong Kong’s property sector remains under pressure from elevated borrowing costs and cautious buyer sentiment, although recent mortgage easing has supported transaction volumes.\nNWD plans to launch about 1,300 units in the next six months, including the low-density luxury project Pavilia Rosa on Rose Street in Kowloon, Grand Austin Bohemian in Tsim Sha Tsui, and Phase 3 of The Pavilia Farm in Tai Wai, which will provide 540 units.\n“Many prospective buyers are shifting their stock market profit into the real estate market,” Huang said.\n",
            "link": "https://www.scmp.com/business/article/3344882/new-world-reports-first-half-loss-deleveraging-takes-priority-dividend-suspended?module=top_story&pgtype=subsection",
            "pub_date": "2026-02-27 19:55:58",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Retiree jailed for 8 months over seditious posts against Hong Kong government",
            "description": "A Hong Kong court has jailed a retiree for eight months for posting speeches on his social media account in which he seditiously criticised authorities and called on voters to boycott last year’s Legislative Council election.\nLam Ming-chung, 68, on Friday admitted to posting seditious content on his Facebook account between September 2024 and November last year, in violation of the domestic national security law.\nAccording to the prosecution, the defendant spread hatred against authorities in 130 posts in which he criticised the police, the judiciary and the Hong Kong government in general.\nHe also declared on his Facebook account that he would not vote in the Legco election last December and called for a boycott ahead of the poll.\nHe said candidates involved in politics were essentially sending themselves to the “guillotine”.\nDefence counsel Jonathan Man Ho-ching told the court that these redundant criticisms on his personal social media account, with only about 10 friends connected, were an emotional outlet for Lam.\n“I hope the court can understand the defendant as a stubborn elderly person who vented irrationally,” he said. “Of course, his venting crossed the line.”\nMan said his client was an educated man who graduated from the Chinese University of Hong Kong’s department of philosophy in 1981, and had an established career in translation.\nThe lawyer said Lam had taken part in the Basic Law Drafting Committee’s work in the late 1980s, drafting the translation material for the city’s mini-constitution.\nMan added that Lam had been a “law-abiding citizen” his whole life but got carried away by the hatemongering speeches online after the 2019 anti-government protests.\nIn the sentencing at West Kowloon Court, Chief Magistrate So Wai-tak noted that the defendant had published an average of 11 posts every month for over a year, with content that repeatedly defamed law enforcement and incited the public to disobey the law.\nAlthough no evidence suggested that the defendant’s speeches successfully agitated anyone, Lam had set all his posts containing seditious content to be publicly viewable.\nSo set a starting point of 15 months’ imprisonment before reducing it by one third to reflect Lam’s timely plea.\nHe gave a further discount of two months at his discretion for the defendant’s good character and family circumstances.\n",
            "link": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3344895/retiree-jailed-8-months-over-seditious-online-posts-against-hong-kong-government?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 19:21:01",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South China Morning Post publisher Tammy Tam appointed to Law Reform Commission",
            "description": "The publisher of the South China Morning Post, Tammy Tam, has been appointed to Hong Kong’s Law Reform Commission as the representative for the media industry for a three-year term starting in March.\nTam succeeded May Chan Suk-mei, a news director at Commercial Radio, who completed two three-year terms, with Secretary for Justice Paul Lam Ting-kwok, thanking Chan for her valuable contributions and insights.\nThe appointment by Chief Executive John Lee Ka-chiu was announced on Friday by the commission, which advises the government on legal reforms to keep Hong Kong’s laws up to date and responsive to societal needs.\n“The [commission] believes that Ms Tam’s rich experience in journalism will certainly assist the [commission] in expanding its reach in the community,” the body said.\nThe 12-member commission, chaired by Lam, includes the chief justice of the Court of Final Appeal and the law draftsman as ex officio members, as well as legal professionals, scholars and a media representative, among others.\nLee also reappointed Professor Alexander Loke from the School of Law at City University for a second three-year term beginning March 1.\nThe commission said it believed that Loke’s legal expertise in the laws of contract, company and securities would continue to benefit the body’s work.\n",
            "link": "https://www.scmp.com/news/hong-kong/society/article/3344886/south-china-morning-post-publisher-tammy-tam-appointed-law-reform-commission?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 18:41:04",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong exports surge 33.8% in January thanks to rebound from 2025’s low base",
            "description": "Hong Kong’s exports surged by more than 30 per cent in the first month of 2026, thanks to a rebound from last year’s low base after US-China trade war fears eased.\nAccording to the Census and Statistics Department, the total value of Hong Kong’s export of goods rose in January by 33.8 per cent year on year to HK$520.6 billion (US$66.6 billion), while the value of imports surged by 38.1 per cent to HK$534.7 billion.\n“Exports to most markets and of most major commodities increased visibly,” a government spokesman said on Friday.\n“While the low base of comparison last year amid the early arrival of Chinese New Year contributed to the strong year-on-year rise, the underlying growth momentum remained robust.”\nHe added that on a seasonally adjusted basis, the value of merchandise exports in a three-month period ending January picked up by 9.4 per cent compared with the preceding three-month period.\nThe second trade war began after United States President Donald Trump took office in January last year and imposed a 10 per cent tariff on China in early February.\n\nThe two nations struck what the White House called a “historic” agreement in November. Trade tensions between the world’s two largest economies subsequently appeared to de-escalate.\n“Looking ahead, Hong Kong’s merchandise trade performance will be underpinned by the sustained moderate expansion of the global economy and strong global demand for AI-related electronic products,” the spokesman said.\n“Meanwhile, the government will stay vigilant to the trade policy developments in the external environment.”\nThe latest figures also showed a trade deficit of HK$14.1 billion, equivalent to 2.6 per cent of the value of imports of goods, was recorded in January 2026.\nIn a statement last month, the department said that Hong Kong’s exports in 2025 rose by 15.4 per cent year on year to a “historical high”.\nIt added that authorities expected the city’s trade would continue to be supported by sustained global economic growth, improved ties with new markets and strong demand for artificial intelligence-enabled products.\n",
            "link": "https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3344880/hong-kong-exports-surge-338-january-thanks-rebound-2025s-low-base?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 18:01:59",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pop Mart’s Merodi Hong Kong debut highlights challenges of sustaining IP success",
            "description": "At Pop Mart’s shop in Hong Kong’s bustling Causeway Bay shopping district, a display of the toymaker’s newly launched character, Merodi, drew little attention on Friday morning.\n“A few people are buying it,” a salesperson said. “It’s not very well known yet.”\nThe new series, Merodi After School, features a mischievous little girl with the magical ability to talk to animals. It was created by Taiwanese artist Will Chen Wei-hua.\nThe launch came two months after Pop Mart’s previous debut, Supertutu, and is part of the company’s efforts to speed up the roll-out of new intellectual properties (IPs) beyond its most successful character, Labubu. Like Supertutu, however, Merodi’s launch has so far drawn an underwhelming response.\nThe new IP was released online at 10pm on Thursday night and was still available on Friday, unlike many of the toymaker’s more popular characters, which often sold out shortly after debut, including Twinkle Twinkle. Last August, mini Labubus sold out in 60 seconds.\nInvestors, however, seem confident. On Friday, Pop Mart’s shares closed more than 2 per cent higher at HK$229.80.\n\n“We think the new IPs require a longer cycle to raise their profile among customers,” said Jeff Zhang, an equity analyst at Morningstar. “With fashion risks remaining high, it’s natural to see some IPs failing to reach critical mass eventually, and Pop Mart will adjust product roll-outs accordingly.\n“We think Pop Mart will keep launching new IPs to capture fans’ preferences, so the tepid response to one or two may not significantly impact its reputation.”\nRichard Lin, chief consumer analyst at investment bank SPDB International, said Labubu was not an overnight hit.\n“It wasn’t actually that popular before [K-pop girl group Blackpink member] Lisa helped popularise it,” Lin said. “It needs to gain traction on social media first.”\nAs Labubu’s meteoric rise cools, Pop Mart faces challenges in turning hype into stable IP.\nIn 2024, Labubu dolls began to gain global attention after Lisa posted photos of herself with the plush toys as well as keychain pendants on Instagram. Since then, celebrities such as Rihanna, Kim Kardashian and David Beckham have endorsed the “ugly cute” character.\nLabubu was at one point in 2025 priced at more than 20 times its retail value in secondary markets, becoming Pop Mart’s most successful line to date.\nPop Mart’s share price dropped from a peak of HK$339.80 in late August last year to HK$187.70 by the end of 2025 as prices of some of Labubu models in the secondary market fell, fuelling debate over whether the company’s success had become too reliant on short-lived hype.\nFor the full year, Labubu’s sales volume exceeded 100 million units, chairman Wang Ning said at an internal gala, according to mainland media.\nOn Friday morning, shoppers at the Pop Mart store in Causeway Bay were seen shaking Labubu or Twinkle Twinkle blind boxes, hoping to guess what is inside, while a queue formed at the checkout counter.\nAs for Merodi, a salesperson said: “It is cute. I would sometimes recommend it to customers.”\n",
            "link": "https://www.scmp.com/business/companies/article/3344856/merodi-debut-hong-kong-shows-pop-marts-struggle-beyond-ip-darling-labubu?module=top_story&pgtype=subsection",
            "pub_date": "2026-02-27 17:41:38",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pop Mart’s Merodi Hong Kong debut highlights challenges of sustaining IP success",
            "description": "At Pop Mart’s shop in Hong Kong’s bustling Causeway Bay shopping district, a display of the toymaker’s newly launched character, Merodi, drew little attention on Friday morning.\n“A few people are buying it,” a salesperson said. “It’s not very well known yet.”\nThe new series, Merodi After School, features a mischievous little girl with the magical ability to talk to animals. It was created by Taiwanese artist Will Chen Wei-hua.\nThe launch came two months after Pop Mart’s previous debut, Supertutu, and is part of the company’s efforts to speed up the roll-out of new intellectual properties (IPs) beyond its most successful character, Labubu. Like Supertutu, however, Merodi’s launch has so far drawn an underwhelming response.\nThe new IP was released online at 10pm on Thursday night and was still available on Friday, unlike many of the toymaker’s more popular characters, which often sold out shortly after debut, including Twinkle Twinkle. Last August, mini Labubus sold out in 60 seconds.\nInvestors, however, seem confident. On Friday, Pop Mart’s shares closed more than 2 per cent higher at HK$229.80.\n\n“We think the new IPs require a longer cycle to raise their profile among customers,” said Jeff Zhang, an equity analyst at Morningstar. “With fashion risks remaining high, it’s natural to see some IPs failing to reach critical mass eventually, and Pop Mart will adjust product roll-outs accordingly.\n“We think Pop Mart will keep launching new IPs to capture fans’ preferences, so the tepid response to one or two may not significantly impact its reputation.”\nRichard Lin, chief consumer analyst at investment bank SPDB International, said Labubu was not an overnight hit.\n“It wasn’t actually that popular before [K-pop girl group Blackpink member] Lisa helped popularise it,” Lin said. “It needs to gain traction on social media first.”\nAs Labubu’s meteoric rise cools, Pop Mart faces challenges in turning hype into stable IP.\nIn 2024, Labubu dolls began to gain global attention after Lisa posted photos of herself with the plush toys as well as keychain pendants on Instagram. Since then, celebrities such as Rihanna, Kim Kardashian and David Beckham have endorsed the “ugly cute” character.\nLabubu was at one point in 2025 priced at more than 20 times its retail value in secondary markets, becoming Pop Mart’s most successful line to date.\nPop Mart’s share price dropped from a peak of HK$339.80 in late August last year to HK$187.70 by the end of 2025 as prices of some of Labubu models in the secondary market fell, fuelling debate over whether the company’s success had become too reliant on short-lived hype.\nFor the full year, Labubu’s sales volume exceeded 100 million units, chairman Wang Ning said at an internal gala, according to mainland media.\nOn Friday morning, shoppers at the Pop Mart store in Causeway Bay were seen shaking Labubu or Twinkle Twinkle blind boxes, hoping to guess what is inside, while a queue formed at the checkout counter.\nAs for Merodi, a salesperson said: “It is cute. I would sometimes recommend it to customers.”\n",
            "link": "https://www.scmp.com/business/companies/article/3344856/merodi-debut-hong-kong-shows-pop-marts-struggle-beyond-ip-darling-labubu?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 17:36:00",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Germany’s Merz meets China’s tech vanguard, including Alibaba and Unitree CEOs",
            "description": "German Chancellor Friedrich Merz visited China’s eastern tech hub of Hangzhou on Thursday and met leading figures including those from Alibaba Group Holding and Unitree Robotics, signalling growing international recognition of the country’s robotics and artificial intelligence technologies.\nMerz had lunch and took group photos with local entrepreneurs, including Alibaba CEO Eddie Wu Yongming and Unitree founder and CEO Wang Xingxing, according to a social media account run by Chinese state broadcaster China Central Television CCTV. Alibaba owns the South China Morning Post.\nHe met representatives from 10 companies in Hangzhou that specialise in AI, humanoid robots and electric vehicles (EVs). Other companies at the meeting included AI glasses start-up Rokid, brain-machine interface innovator BrainCo, and EV makers Geely and Leapmotor.\n\nThe stop in Hangzhou, the capital of eastern Zhejiang province, marked the conclusion of Merz’s first official trip to China, reflecting Germany’s attempt to work further with the engines of China’s digital and robotics economy. Analysts also expected it to strengthen Merz’s position when he meets US President Donald Trump in early March.\nA highlight of the visit was Merz’s tour of Unitree, a leader in humanoid robots. Unitree’s Wang showcased humanoids dancing, boxing and performing martial arts, according to a report by CCTV.\nWang said on Thursday on social media that it was an honour to meet Merz and that he looked forward to “collaborating with global enterprises for mutual success”.\n\nMerz tried on Rokid’s AI glasses and expressed “strong interest and appreciation for the product”, according to the Hangzhou-based company.\n“Through these glasses, we see a vast future for Sino-German cooperation,” said Misa Zhu, founder and CEO of Rokid, in a statement on Thursday. “Rokid is willing to combine China’s digital innovation with Germany’s precision craftsmanship to deepen cooperation in areas such as smart cockpits and industrial manufacturing, achieving mutual empowerment.”\nEarlier in Beijing, Merz met entrepreneurs including Xiaomi founder and CEO Lei Jun, JD.com founder and chairman Richard Liu Qiangdong and William Li Bin, founder and CEO of EV maker Nio, according to CCTV.\nMerz also attended a Mercedes-Benz autonomous driving showcase where he experienced a system developed by Chinese start-up Momenta, which said the German chancellor highly praised the collaboration.\n",
            "link": "https://www.scmp.com/tech/article/3344835/germanys-merz-meets-chinas-tech-vanguard-including-alibaba-and-unitree-ceos?module=top_story&pgtype=section",
            "pub_date": "2026-02-27 17:31:09",
            "source": "scmp",
            "kind": 1,
            "language": "en"
        }
    ]
}