{
    "data": [
        {
            "id": 3849369,
            "title": "US stocks slip lower; Alphabet earnings weigh on sentiment",
            "description": "<div>Investing.com-US stocks slipped lower Wednesday, pressured chiefly by losses in technology stocks after underwhelming earnings from Google-owner Alphabet as well as trade tensions between the US and China. <br>At 09:50 ET (14:50 GMT), the Dow Jones Industrial Average fell 30 points, or 0.1%, the S&P 500 index dropped 15 points, or 0.3%, and the NASDAQ Composite slipped 100 points, or 0.5%.<br>Alphabet slides as Q4 earnings underwhelm <br>Sentiment has been hit Wednesday, with the tech-led Nasdaq leading the losses, after Alphabet’s (NASDAQ:GOOGL) fourth-quarter revenue missed expectations, especially on disappointing earnings from its cloud division, which is closely tied to AI. <br>The search giant said it plans to spend $75 billion on building out its artificial intelligence capabilities this year, well above the $58 billion in capital expenditures pencilled in by analysts.<br>Wall Street’s AI spending has come under heightened scrutiny in recent weeks, especially with the release of China’s DeepSeek R1 AI model, which appeared to operate on a substantially smaller budget. This triggered a massive rout in tech valuations last week, one that Wall Street is still struggling to recover from, with Alphabet trading over 6% lower.<br>Apple (NASDAQ:AAPL) stock also fell over 1% after Bloomberg reported that Chinese regulators are considering whether to open a formal probe into the iPhone giant’s App Store fees and policies.<br>Beijing could move against Apple <br>Beijing's potential move against the iPhone giant could be seen as past a brewing trade war with China, after Trump’s 10% tariffs against the country took effect. Beijing retaliated with its own import tariffs and export controls, and also launched an antitrust investigation into Google. <br>Trump signaled that he was in no hurry to negotiate with Chinese President Xi Jinping, with the tariffs now set to remain in place for the foreseeable future. <br>Analysts warned that increased trade tariffs - which will be borne by US importers, could underpin inflation and pressure growth.<br>Earnings season continues <br>There are more major earnings to digest Wednesday.<br>Walt  Disney  (NYSE:DIS) stock slipped slightly after the entertainment company reported a loss of subscribers at its Disney+ streaming service, even as itposted better-than-anticipated first-quarter earnings, bolstered in large part by returns during the holiday period from its animated film \"Moana 2\".<br>Uber Technologies (NYSE:UBER) stock fell almost 6% after the ride-hailing and food delivery giant forecast current-quarter bookings below estimates, joining a slew of US companies in warning that a strong dollar could hurt the first three months of 2025.<br>Advanced Micro Devices (NASDAQ:AMD) shares slumped almost 10% after its fourth-quarter data center revenue came in at $3.9 billion, below consensus expectations of $4.15 billion.<br>Chipotle Mexican Grill (NYSE:CMG) stock fell over 4% after the burrito chain reported fourth-quarter same-store sales that rose less than expected. <br>Markets have been bolstered by mostly solid quarterly corporate returns, with more than three-fourths of the 211 firms in the S&P 500 that have reported so far unveiling better-than-anticipated results.<br><br> <br><br>ADP employment data stronger than expected<br>Private employers in the US hired more workers than anticipated in January, according to data released earlier Wednesday, in a sign of stability in labor demand at the start of 2025.<br>Private payrolls increased by 183,000 during the month, according to data from payrolls processor ADP, above the expected 148,000 growth.<br>The numbers serve, along with a raft of other labor market data this week, to help paint a picture of the US labor market in the early days of the first quarter, ahead of Friday's widely-watched nonfarm payrolls report.<br>Data released on Tuesday showed that US job openings in December decreased by more than anticipated, although hiring remained resilient.<br>Crude slips on US inventories build<br>Oil prices slipped lower Wednesday after higher-than-expected US crude inventories data raised concerns over consumption levels in the world’s largest consumer.<br>By 09:50 ET, the US crude futures (WTI) slipped 1.2% to $71.82 a barrel, while the Brent contract fell 1.2% to $75.30 a barrel.<br>Crude stocks rose by just over 5 million barrels in the week ended Jan. 31, according to data from the American Petroleum Institute, while gasoline inventories rose by a similar amount.<br>Official US government oil inventory data from the Energy Information Administration are due to be released later in the session.<br>(Ambar Warrick contributed to this article.)</div>",
            "link": "https://www.investing.com/news/stock-market-news/us-stock-index-futures-dip-as-alphabet-earnings-underwhelm-3849369",
            "pub_date": "2025-02-05 22:54:53",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3850542,
            "title": "Alphabet, Apple, Chipotle and Uber fall premarket; Snap rises",
            "description": "<div>Investing.com - US stock futures slipped lower Wednesday, as investors focused on a slew of earnings and trade tensions between the US and China.<br>Here are some of the biggest premarket US stock movers today:<br><br>Alphabet (NASDAQ:GOOGL) stock fell 6.9% after the Google parent said it plans to spend $75 billion on building out its artificial intelligence capabilities this year, well above the $58 billion in capital expenditures pencilled in by analysts. <br><br><br>Apple (NASDAQ:AAPL) stock fell 2% after Bloomberg reported that Chinese regulators are considering whether to open a formal probe into the iPhone giant’s App Store fees and policies.<br><br><br>Snap (NYSE:SNAP) stock rose 2.3% after the Snapchat-owner posted better-than-expected quarterly earnings and issued upbeat guidance on the back of stabilizing digital ad spending.<br><br><br>Chipotle (NYSE:CMG) stock fell 4.6% after the burrito chain reported fourth-quarter same-store sales that rose less than expected.<br><br><br>AMD (NASDAQ:AMD) stock fell 9.8% after the computer hardware manufacturer's fourth-quarter data center revenue came in at $3.9 billion, below consensus expectations of $4.15 billion.<br><br><br>Walt  Disney  (NYSE:DIS) stock rose 1.6% after the media giant posted better-than-anticipated first-quarter earnings, bolstered in large part by returns during the holiday period from its animated film \"Moana 2\".<br><br><br>Uber (NYSE:UBER) stock fell 5.3% after the ride-hailing and food delivery giant forecast current-quarter bookings below estimates, joining a slew of US companies in warning that a strong dollar could hurt the first three months of 2025.<br><br><br> New York Times  (NYSE:NYT) stock rose 0.2% after the newspaper forecast first-quarter subscription revenue growth below estimates, signaling growing competition for attracting new subscribers. <br><br><br>Emerson Electric (NYSE:EMR) stock fell 1.5% after the engineering company issued weaker-than-expected guidance for the second quarter.<br><br><br>Capri (NYSE:CPRI) stock fell 3.3% after the fashion holding company forecast annual revenue below estimates, as the Michael Kors owner grappled with slowing demand for luxury goods and persistent declines in the Americas and Asia.<br><br><br>Harley-Davidson (NYSE:HOG) stock fell 3.1% after the motorcycle manufacturer said it expects 2025 motorcycle revenue to be flat to down 5%, as consumers pulled back from big-ticket purchases.<br><br> </div>",
            "link": "https://www.investing.com/news/stock-market-news/alphabet-apple-chipotle-and-uber-fall-premarket-snap-rises-3850542",
            "pub_date": "2025-02-05 20:58:42",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3849702,
            "title": "Futures dip, Alphabet spending plans, Snap tops estimates - what's moving markets",
            "description": "<div>Investing.com - U.S. stock futures point lower on Wednesday, with traders focused on a slew of earnings and trade tensions between the U.S. and China. Alphabet (NASDAQ:GOOGL) outlines a spike in capital expenditures despite recent DeepSeek-inspired worries over AI spending, while Snap's quarterly results top estimates. Meanwhile, Nvidia-rival Advanced Micro Devices (NASDAQ:AMD) unveils disappointing quarterly data center revenues.<br>1. Futures lower<br>Stock futures on Wall Street dipped on Wednesday, as investors assessed a wave of corporate earnings and the outlook for potential trade negotiations between the U.S. and China.<br>By 03:34 ET (08:34 GMT), the S&P 500 futures contract had slipped by 25 points or 0.4%, Nasdaq 100 futures had fallen by 138 points or 0.6%, and Dow futures had dropped by 65 points or 0.2%.<br>The major averages all ended higher in the prior session, buoyed in part by hopes that U.S. President Donald Trump's decision to delay tariffs on Mexico and Canada signaled possible flexibility in his negotiating stance with China. Although a 10% levy on China came into effect on Tuesday, sentiment was also supported by a retaliation from Beijing that some observers perceived to be relatively restrained and a move to position itself for trade talks.<br>However, it remained unclear when Trump and Chinese President Xi Jinping would speak. Trump said he was in no rush to hold the discussions.<br>\"A consensus U.S.-China deal does seem the most likely scenario, but we sense markets are under-pricing the risk of a more prolonged trade spat,\" analysts at ING said in a note to clients.<br>Markets have also been bolstered by mostly solid quarterly corporate returns, with more than three-fourths of the 211 firms in the S&P 500 that have reported so far unveiling better-than-anticipated results.<br>2. Alphabet outlines spending hike<br>Still, some key earnings reports have not been viewed favorably by investors, including figures from Google-parent Alphabet.<br>The search giant said it plans to spend $75 billion on building out its artificial intelligence capabilities this year, well above the $58 billion in capital expenditures pencilled in by analysts. Concerns have swirled around heavy AI spending by Big Tech names like Alphabet, particularly in the wake of the emergence of a low-cost AI model from Chinese start-up DeepSeek last week.<br>DeepSeek's claim that its model delivered comparable performance to OpenAI's ChatGPT with less-advanced chips and at a fraction of the cost has been met with widespread skepticism, but has still sparked worries around both the necessity - and eventual profitability - of massive AI spending. Alphabet CEO Sundar Pichai said that Google's Gemini AI models are similar in efficiency to DeepSeek.<br>Compounding the disappointment around Alphabet's numbers was its key cloud computing division. Revenue at the business expanded by 30% in the fourth quarter to $11.96 billion, slowing from growth of 35% in the prior quarter. Analysts were anticipating an uptick of 32.3% to $12.16 billion, according to LSEG data cited by Reuters.<br>Shares in Alphabet slumped by more than 7% in extended hours trading.<br>3. Snap's earnings top estimates<br>Snap shares jumped more than 5% in after-hours trading after the Snapchat-owner posted better-than-expected quarterly earnings and issued upbeat guidance on the back of stabilizing digital ad spending.<br>The short-form video platform reported earnings per share of $0.16, comfortably beating analysts’ estimates of a loss of $0.04. Revenue rose to $1.56 billion, slightly ahead of Wall Street expectations of $1.55 billion.<br>\"Active advertisers more than doubled in [the fourth quarter], with the improvements we have made to our advertising platform driving improved advertiser performance and helping to grow revenue 14% year-over-year,” said CEO Evan Spiegel.<br>Daily active users (DAUs), a key metric for social media companies, climbed to 453 million in the quarter, and Snap projected first-quarter DAUs to reach about 459 million.<br>4. AMD data center revenue disappoints<br>Advanced Micro Devices shares slumped in extended hours trading after its fourth-quarter data center revenue came in at $3.9 billion, below consensus expectations of $4.15 billion.<br>The performance of the data center unit is key for AMD, as it is one measure of the strength of demand for its processors that compete with rival Nvidia's (NASDAQ:NVDA) chips.<br>Chief Executive Lisa Su later told analysts that AMD's data center sales in the current quarter will fall by around 7% versus the prior quarter. Su also declined to present an exact forecast for revenue from AMD's high-end AI chips, saying it anticipates \"tens of billions\" in sales over the \"next couple of years\".<br>Elsewhere,  Novo Nordisk  (CSE:NOVOb) (NYSE:NVO) forecast slower sales growth for 2025 than 2024, suggesting the Danish drugmaker, which sells popular weight management drug Wegovy, is losing its edge in the competitive obesity market.<br>On Wednesday, the earnings parade marches on, with results due out from chipmaker Qualcomm (NASDAQ:QCOM), media giant Walt  Disney  (NYSE:DIS), and ride-hailing group Uber (NYSE:UBER).<br>5. Gold touches record high<br>Gold prices hit a record high in Asian trade on Wednesday as safe haven demand for the yellow metal was underpinned by persistent concerns over a brewing trade war between the U.S. and China.<br>President Trump’s suggestion that the U.S. could \"take over\" Gaza and relocate Palestinians also drove haven demand, given that it drew a sharp rebuke from several countries in the region.<br>Bullion prices were also aided by weakness in the dollar, which wiped out all of its gains this week after Trump postponed his tariffs on Mexico and Canada.<br>In oil markets, crude prices slipped on higher-than-expected US crude inventories data and worries over Sino-American trade tensions.</div>",
            "link": "https://www.investing.com/news/economy/futures-dip-alphabet-spending-plans-snap-tops-estimates--whats-moving-markets-3849702",
            "pub_date": "2025-02-05 16:40:54",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3849522,
            "title": "Novo Nordisk sees slower sales growth in 2025",
            "description": "<div> By Maggie Fick and Stine Jacobsen LONDON/COPENHAGEN (Reuters) -Wegovy maker Novo Nordisk (NYSE:NVO) on Wednesday forecast sales would grow at a slower rate this year although the outlook was roughly in line with market expectations as the pace of ferocious demand for its wildly popular obesity drug Wegovy eases somewhat. The Danish company said it expects sales growth in local currencies to range between 16% and 24%, less than the 26% growth seen in 2024. That compares with analysts expectations of just under 20%. The company is also grappling with competition from Eli Lilly (NYSE:LLY). It said fourth-quarter operating profit jumped 37% to 36.7 billion Danish crowns ($5.12 billion), better than the 33.6 billion forecast by analysts in a company poll. It predicted operating profit for 2025 to climb between 19% and 27%, compared to growth of 26% last year. During the fourth quarter, sales of Wegovy more than doubled to 19.9 billion crowns from 9.6 billion a year ago, in line with expectations and more than the 17.3 billion crowns achieved in the third quarter.  ($1 = 7.1674 Danish crowns) </div>",
            "link": "https://www.investing.com/news/stock-market-news/novo-nordisk-q4-profit-beats-expectations-sees-slower-growth-in-2025-3849522",
            "pub_date": "2025-02-05 15:45:39",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3849623,
            "title": "GSK lifts long-term sales outlook on strong Specialty Medicines growth",
            "description": "<div>Investing.com - GSK (LON:GSK) on Wednesday raised its long-term sales outlook, now expecting annual revenue to exceed £40 billion by 2031, an upward revision from the previous projection of £38 billion. <br>This increase reflects the company’s confidence in its expanding portfolio of specialty medicines, a strong late-stage pipeline, and anticipated success of new product launches over the coming years.<br>The pharmaceutical company reported a solid financial performance for 2024, with total sales reaching £31.4 billion, representing a 7% increase at constant exchange rates. <br>Growth was largely driven by a surge in specialty medicines, which saw a 19% rise in sales. Oncology treatments nearly doubled in revenue, while HIV and respiratory medicines also delivered double-digit gains. <br>However, the vaccines segment struggled, posting a 4% decline, with Arexvy, its respiratory syncytial virus vaccine, falling 51% in sales. <br>General medicines saw moderate growth of 6%, with Trelegy, a key respiratory drug, posting a strong 27% increase.<br>Despite strong revenue expansion, total operating profit fell by 33%, largely due to a £1.8 billion charge related to Zantac litigation settlements. <br>However, the company’s core operations remained strong, with core operating profit growing by 11%. <br>The earnings per share figures reflected this divide, with total EPS declining by 40% to 63.2p, while core EPS increased by 10% to 159.3p. <br>The company’s cash flow position remained solid, generating £8 billion from operations and ending the year with a reduced net debt of £13.1 billion, down from £15 billion.<br>GSK’s global performance showed strength across key markets. Sales in the United States reached £16.4 billion, up 6% at constant exchange rates, while Europe posted £6.7 billion in revenue, a 4% increase. <br>International markets led regional growth, climbing 11% to £8.3 billion. The company’s expansion in specialty medicines has been instrumental in this upward trajectory, with strong demand for its HIV treatments, respiratory therapies, and growing oncology presence.<br>The company’s research and development efforts continue to shape its future outlook. Currently, 71 specialty medicines and vaccines are in clinical development, with 19 in late-stage trials or under regulatory review. <br>Five major product approvals are expected in 2025, including Blenrep for multiple myeloma and depemokimab for severe asthma. Key late-stage trials in oncology, respiratory diseases, and HIV are also expected to be catalysts for long-term growth.<br>“In particular, we are increasing and prioritising R&D investment to promising new long-acting and specialty medicines in Respiratory, Immunology & Inflammation, Oncology and HIV. Our outperformance and stronger balance sheet support these investments and others planned in R&D,” said Emma Walmsley, chief executive at GSK in a statement.<br>By 2025, GSK expects turnover to grow between 3% and 5%. Core operating profit and core earnings per share are expected to grow between 6% and 8%. <br>A £2 billion share buyback program is set to be implemented over the next 18 months by the firm, a move that signals confidence in its long-term strategy. <br>Dividends are expected to increase to 64p per share in 2025, which is an increase from 61p per share in 2024.</div>",
            "link": "https://www.investing.com/news/stock-market-news/gsk-lifts-longterm-sales-outlook-on-strong-specialty-medicines-growth-3849623",
            "pub_date": "2025-02-05 15:51:34",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3849456,
            "title": "Drone attack sparks blaze at oil depot in Russia's Krasnodar, governor says",
            "description": "<div> (Reuters) - A Ukrainian drone attack overnight sparked a fire at an oil depot in Russia's southern region of Krasnodar that has since been extinguished, regional officials said on Wednesday.  A series of drone attacks by Ukraine on Russia's energy facilities have sparked fires in recent days at a major oil refinery in the Volgograd region, as well as at the Astrakhan gas processing plant.  \"The fire in a tank with oil product residues in the village of Novominskaya in the Kanevsky District was fully extinguished,\" the region's operational authorities said on the Telegram messaging app. Earlier, Veniamin Kondratyev, governor of the Krasnodar region, said that there were no injuries in the fire that was caused by a falling drone debris. A team of 19 people wielding 19 items of equipment were fighting the flames, he said.  Kondratyev did not say which depot was on fire or detail the extent of damage.  The Russian defence ministry said that four Ukrainian drones were destroyed over the Russian territory overnight, but did not mention the Krasnodar region in a statement on the Telegram messaging app. The ministry only reports drones that its air defence systems destroy, not how many were launched.  There was no immediate comment from Ukraine. Kyiv says that its attacks inside Russia are aimed at destroying infrastructure key to Moscow's war in Ukraine and are in response to Russian continued bombing of Ukraine.   </div>",
            "link": "https://www.investing.com/news/stock-market-news/drone-attack-sparks-blaze-at-oil-depot-in-russias-krasnodar-governor-says-3849456",
            "pub_date": "2025-02-05 15:56:16",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3849169,
            "title": "Nissan calls off Honda merger talks, Nikkei says",
            "description": "<div> By Maki Shiraki and Daniel Leussink TOKYO (Reuters) - Japan's Nissan (OTC:NSANY) has called off merger talks with rival  Honda  (NYSE:HMC), the Nikkei newspaper said, abandoning a tie-up that would have created the world's no.3 automaker and raising questions about how it will drive a turnaround by itself. Shares in Nissan slid more than 4% before trade was suspended by the Tokyo Stock Exchange following the report. Shares of Honda continued to trade and finished the day up more than 8%, in a sign of apparent investor relief that the deal had been scrapped. Honda, Japan's second-largest car maker, and Nissan, its third-largest, last year said they were in discussions to merge and create the world's third-largest automaker by sales, bulking up in an industry that faces a vast threat from China's BYD (SZ:002594) and other electric vehicle entrants. But the talks have been complicated by growing differences on both sides, according to two people familiar with the matter, both of whom declined to be identified because they were not authorised to speak to the media. Reuters earlier reported Nissan could call off the talks. As of late afternoon, its board was still meeting to decide on the course of action, a person with knowledge of the matter said. Honda had sounded out Nissan about becoming a subsidiary, one of the people said, adding that such an arrangement was a departure from the spirit of discussions originally framed as a merger of equals. A Nissan spokesperson said the Nikkei report was not based on information announced by the company and that it aimed to finalise its future direction by mid-February and would announce it at that time. A Honda spokesperson said it had not heard anything from Nissan about a decision to withdraw from their memorandum of understanding to work on a merger. The development raises fresh questions about how hard-hit Nissan could ride out its latest crisis without external help. Nissan is in the middle of a turnaround plan, aiming to cut 9,000 employees and 20% of global capacity. Honda, with a market value nearly five times bigger than Nissan, was increasingly worried about its smaller rival's progress on the turnaround plan, said the other person. The tie-up talks have coincided with the disruption posed by potential tariffs from U.S. President Donald Trump. Tariffs against Mexico would be more painful for Nissan than for Honda or  Toyota  (NYSE:TM), according to analysts. \"Investors may get concerned about Nissan's future (and) turnaround,\" said Morningstar analyst Vincent Sun. \"Nissan also has a larger risk exposure to U.S.-Mexico tariffs than Honda and Toyota.\" CONTROL Nissan has been hit harder than some other carmakers by the shift to EVs, having never fully recovered after years of crisis sparked by the arrest and removal of former Chairman Carlos Ghosn in 2018.  \"The news saying that Nissan did not want to be a Honda subsidiary appears to highlight that control was a contentious issue,\" said Christopher Richter, Japan autos analyst at brokerage CLSA. \"Without being able to have control, Honda appears to be walking away.\" Nissan's long-term alliance partner  Renault  (EPA:RENA) had said it would be open in principle to the merger with Honda. The French automaker owns 36% of Nissan, including 18.7% through a French trust.  Nissan and Honda had initially said they planned to decide the direction of the integration by the end of January, but that was later pushed back to mid-February. Sources told Reuters last month that Nissan's smaller alliance partner Mitsubishi Motors (OTC:MMTOF), which had considered joining the merger, might not do so.  </div>",
            "link": "https://www.investing.com/news/stock-market-news/nissan-and-honda-may-call-off-merger-talks-asahi-says-3849169",
            "pub_date": "2025-02-05 16:00:41",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3849658,
            "title": "Chinese firms control around 75% of Indonesian nickel capacity, report finds",
            "description": "<div> JAKARTA (Reuters) - Chinese firms control about 75% of Indonesia's nickel refining capacity, raising concern over supply chain control and environmental risks, Washington-based global security nonprofit C4ADS has said in a report. According to the report, Indonesia's 8 million metric ton refining capacity was distributed across 33 companies, but ownership tracing showed shareholder overlap, and ultimately Chinese companies controlled about three-quarters of smelting capacity as of 2023. \"As Indonesia aims to use the nickel industry for economic growth, this substantial foreign influence could limit its ability to control and shape the industry for its benefit,\" said the report, released on Tuesday. The reliance on Chinese-controlled nickel production also places U.S. and European automakers at a competitive disadvantage in the global EV market amid increasingly restrictive policies against trade with China, the report said. Nickel is a key battery component. Indonesia's mining ministry did not immediately comment. An Indonesian official said last year that Chinese companies were approaching Indonesian and South Korean firms for potential partnerships to reduce their stakes in smelters and make their product more accessible to the U.S. market. President Prabowo Subianto formed a task force to develop the downstream mineral industry with domestic financing to \"gradually reduce perception that foreigners got the most benefits,\" Mining Minister Bahlil Lahadalia said last month. The C4ADS report found that two Chinese companies, Tsingshan Holding Group and Jiangsu Delong Nickel Industry Co Ltd, accounted for more than 70% of Indonesia's refining capacity as of 2023. The two were among the earliest investors when Indonesia started a push for domestic processing of nickel ore - a move that has made it the world's dominant producer. Last year, a court in Central Sulawesi sentenced two workers at Indonesia Tsingshan Stainless Steel to seven months jail for negligence that led to a fire and deaths at a Tsingshan facility in December 2023. In early 2023, two workers were killed in clashes at the PT Gunbuster Nickel Industry smelter in North Morowali owned by Jiangsu Delong Nickel Industry.  Tsingshan's unit Eternal Tsingshan and Jiangsu Delong's joint-venture Obsidian Stainless Steel did not immediately respond to requests for comment. Jiangsu Delong could not immediately be reached for comment. Tsingshan has been selling stakes in some of its smelters, including an October deal with Indonesian state miner  Aneka Tambang  (JK:ANTM) for 30% of PT Jiu Long Metal Industry.  </div>",
            "link": "https://www.investing.com/news/stock-market-news/chinese-firms-control-around-75-of-indonesian-nickel-capacity-report-finds-3849658",
            "pub_date": "2025-02-05 16:07:05",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3849443,
            "title": "Novo Nordisk earnings preview: BofA analysts weigh in ahead of Q4 results",
            "description": "<div>Investing.com- Bank of America (BofA) analysts expect a mixed fourth-quarter performance for Danish pharmaceutical giant Novo Nordisk (NYSE:NVO) citing weaker-than-consensus sales estimates, but see a solid outlook for 2025.Analysts forecast Novo Nordisk’s 2024 group sales to reach DKK 282.7 billion, representing 22% year-on-year growth, aligning with the lower end of the company’s guidance range of 22-26%.However, this estimate is roughly 1% below consensus projections, analysts said. Earnings before interest and tax (EBIT) are expected at DKK 124.8 billion, also at the lower end of forecasts due to the dilutive impact of the Catalent acquisition, which BofA estimates will weigh on margins in the near term.For the fourth quarter, analysts anticipate total sales of DKK 19.1 billion for Novo Nordisk’s blockbuster obesity drug Wegovy, falling short of the DKK 20.2 billion consensus.U.S. sales are projected to remain flat sequentially at DKK 15.1 billion, while ex-U.S. sales are seen at DKK 4.0 billion, factoring in a lower inventory stocking effect from the previous quarter, according to BofA.The diabetes treatment Ozempic is also expected to show slowing prescription growth, with Q4 sales forecast at DKK 32.6 billion, 8% higher year-over-year but below the DKK 33.9 billion consensus estimate, analysts said in a note.Despite the near-term softness, BofA maintains a “Buy” rating on Novo Nordisk, highlighting a strong 2025 outlook.The investment bank forecasts 18-24% sales and EBIT growth next year, with foreign exchange tailwinds contributing an estimated 2% to sales and 3% to EBIT.Analysts believe margin expansion and continued demand for weight-loss treatments will drive long-term growth, supporting their DKK 1,075 price target.</div>",
            "link": "https://www.investing.com/news/pro/novo-nordisk-earnings-preview-bofa-analysts-weigh-in-ahead-of-q4-results-432SI-3849443",
            "pub_date": "2025-02-05 12:01:02",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3849490,
            "title": "Gold prices hit record high above $2,850/oz on trade war fears, Gaza uncertainty",
            "description": "<div>Investing.com- Gold prices hit a record high in Asian trade on Wednesday as safe haven demand for the yellow metal was underpinned by persistent concerns over a brewing trade war between the U.S. and China. <br>U.S. President Donald Trump’s comments on the U.S. taking over the Gaza strip and relocating Palestinians from the region also drove haven demand, given that it drew a sharp rebuke from several countries in the region. <br>Bullion prices were also aided by weakness in the dollar, which wiped out all of its gains this week after U.S. President Donald Trump postponed trade tariffs on Mexico and Canada.<br>But Trump offered no such relief to China, keeping traders largely biased towards safe havens. China also retaliated against U.S. trade tariffs on Tuesday. <br>Spot gold jumped 0.6% to a record high of $2,858.27 an ounce, while gold futures expiring in April rose 0.4% to $2,885.39 an ounce. <br>Gold surges as US-China trade tensions simmer <br>Bullion prices benefited from safe haven buying after Trump’s 10% tariffs on China took effect from Tuesday. Beijing retaliated to this with its own import tariffs, export controls, as well some measures against select U.S. companies, such as Google (NASDAQ:GOOGL). <br>Trump also signaled that he was in no hurry to talk to Chinese President Xi Jinping, lessening the possibility of a de-escalation in trade tensions. Trump’s tariff relief for Canada and Mexico came only following dialogue with their heads of state. <br>A Sino-U.S. trade war stands to potentially disrupt global trade, and is expected to pressure growth in the world’s biggest economies.<br>Trump’s China tariffs also sparked fears that he will make good on his threats to impose universal trade tariffs, as well as targeted duties on Taiwan and Europe. <br>Still, analysts expect any prolonged trade tariffs to push up U.S. inflation and keep interest rates high for longer. Such a scenario could diminish gold’s long-term prospects. <br>Other precious metals dipped on Wednesday. Platinum futures fell slightly to $1,011.30 an ounce, while silver futures fell 0.3% to $32.938 an ounce.<br>Among industrial metals, benchmark copper futures on the London Metal Exchange steadied at $9,193.50 a ton, while March copper futures were flat at $4.3675 a pound. <br>Gaza uncertainty increases after Trump comments <br>Haven demand was also boosted by Trump proposing a U.S. takeover of the Gaza strip, after proposing that the Palestinians in the region should be resettled. <br>Trump said during a White House conference with Israeli Prime Minister Benjamin Netanyahu that the U.S. will “take over” the Gaza Strip, level the site and rebuild it as an economic development. He also repeated his calls to relocate Palestinians from Gaza into neighboring states. <br>Trump’s comments- which were scant on details, but could upturn decades of U.S. policy in the Middle East- drew sharp rebukes from Palestinian leaders and Arab countries.<br>This drove up concerns over renewed geopolitical tensions in the Middle East.</div>",
            "link": "https://www.investing.com/news/commodities-news/gold-prices-hit-record-high-above-2850oz-on-trade-war-fears-gaza-uncertainty-3849490",
            "pub_date": "2025-02-05 14:01:47",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        }
    ]
}