{
    "data": [
        {
            "id": 2658206,
            "title": "黄金需求创新高！2025年初金价上涨10%后，将继续刷新记录？",
            "description": "<div> 投资慧眼Insights - 各国央行对黄金的需求并未显示出放缓的迹象，2025年金价有望继续上涨。2月5日，世界黄金协会发布报告称，由于各国央行继续以惊人的速度囤积黄金，去年黄金需求创下了历史新高。2024年，黄金总需求同比增长1%，至4974吨的历史最高水平。各国央行购买了1045吨黄金，价值约960亿美元。其中，波兰、印度和土耳其是最大的买家。15年来，各国央行一直是黄金的净买家，但自乌克兰战争爆发以来，各国央行每年购买黄金的速度大约翻了一番。因为各国央行减少了对美元资产的购买，重新平衡储备。“各国央行的购买量非常广泛，比我们年初估计的还要多。”该贸易组织高级市场策略师John Reade说。\"我们预计各国央行将继续保持主导地位，黄金ETF投资者也将加入战局。”黄金首饰是个例外，由于价格飙升，黄金首饰需求有所下降。中国是珠宝消费量下降的主要原因。“中国仍是最大的黄金市场——虽然珠宝需求大幅下降，但投资需求却有所增加。”Reade表示，“两者之间的比率几乎可以作为衡量中国经济信心的粗略指标。”世界黄金协会表示，如果中国人民银行继续宣布购买黄金，投资者情绪可能会有所上升。展望2025年，协会指出，今年地缘政治和经济不确定性依然很高，各国央行很可能再次将黄金作为稳定的战略资产。截至发稿，黄金价格上涨0.6%，报2860美元/盎司，再次刷新记录。2025年初至今，金价已累计上涨近10%。华尔街多数投行给予黄金的目标价为3000美元，这意味着金价还能上涨5%。【图源：TradingView；黄金价格近半年走势】原文链接</div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2658206",
            "pub_date": "2025-02-05 16:08:17",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658149,
            "title": "蛇年首个交易日：上证指数收跌0.65%， DeepSeek概念股掀涨停潮",
            "description": "<div>英为财情Investing.com -周三，2月5日，春节后首个交易日，A股全天高开低走，沪指回调，科创50涨近3%。截至收盘，上证指数收跌0.65%，报3229.49点，深证成份指数收涨0.08%，报10164.22点，创业板指数（价格）收跌0.04%，报2062.92点，中国A50期货指数截稿前跌2.2%，报12753点。今日市场整体涨多跌少，全市场超3400只个股上涨，超1800只个股下跌。沪深两市全天成交额1.29万亿，较上个交易日放量1717亿。盘面上，DeepSeek概念股全天大涨，安凯微、每日互动、三六零、天娱数科等超10股涨停；AI应用端表现活跃，万兴科技等涨停，昆仑万维、金山办公等多股涨超10%。国际金价突破2860美元/盎司，黄金股表现活跃，赤峰黄金涨超8%，晓程科技、四川黄金、中金黄金、湖南黄金涨幅居前。下跌方面，白酒、零售、食品等大消费板块今日表现低迷，岩石股份、好想你盘中跌停，三只松鼠、甘源食品、古井贡酒跌幅居前。巨丰投顾郭一鸣指出，贸易战的阴霾和聯儲局不降息带来的压力，与国内消费市场的强劲复苏形成鲜明对比。不过，随着国内经济整体稳步修复，在政策持续发力以及近期人民币汇率小幅回升趋势下，股市春季行情仍值得期待。机会方面，当前我国新旧动能转换背景下，科技板块顺应发展新质生产力的指引，同时产业周期仍处于向上通道，基本面趋势更好、确定性更强。AI技术应用端等细分领域值得重点关注，而随着政策持续向消费倾斜，消费板块估值修复的机会同样值得跟踪。<br>如何发现被低估的股票？InvestingPro公允价值工具助你一臂之力。多维度估值模型，从现金流、营收、净利等数据对股票进行全方位估值。<br>此外，订阅InvestingPro，还将得到更多功能：<br>ProPicks AI：AI智能选股策略，战绩显赫。<br>股票筛选器：Pro版100+筛选条件，Pro+版超1000种指标，精准挖掘优质股票。<br>热门投资组合：沃伦·巴菲特、大空头和索罗斯（George Soros）投资组合，一键直达<br>点击此处进一步了解InvestingPro，领取超值优惠。<br></div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2658149",
            "pub_date": "2025-02-05 15:35:43",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658136,
            "title": "澳元/美元前景：突破0.633或引发新一轮上涨",
            "description": "<div><br>周三（2月5日）欧市盘前，澳元/美元于0.6250附近小幅波动。尽管澳大利亚的Judo银行采购经理人指数（PMI）有所改善，但市场的风险规避情绪以及对澳洲联储可能降息的预期，仍然对澳元形成压制。基本面分析澳大利亚经济数据表现不佳尽管澳大利亚的Judo银行采购经理人指数（PMI）有所回升，但总体经济表现依然较为疲弱。1月份，澳大利亚的Judo银行综合PMI从12月的50.2升至51.1，显示出私营部门活动的温和增长。虽然这一增幅反映出一定的增长，但增长速度仍然较为缓慢。服务业的PMI也从50.8上升至51.2，连续第十二个月呈现扩张趋势，显示出服务业的稳定增长。然而，整体增长的力度仍不够强劲，未能为澳元带来明显的支撑。此外，市场普遍关注澳洲联储的政策动向。由于经济增长放缓，澳洲联储可能会在2月进一步降息，以刺激经济复苏。自2023年11月以来，澳洲联储一直将官方现金利率维持在4.35%，并且强调只有通胀能够“可持续地”回到2%-3%的目标区间时，才会考虑降息。因此，降息预期的升温可能会进一步施压澳元，尤其是在全球经济不确定性加大的背景下，市场对于风险较高资产的需求可能会进一步降低。市场风险情绪对澳元的影响由于全球经济的不确定性，市场风险情绪持续高企，市场对风险资产的需求下降。作为商品货币，澳元往往受到全球风险情绪的影响，尤其是在全球经济面临较大压力时，澳元的表现通常不如美元强势。分析师认为，鉴于目前的全球经济和贸易格局情况，市场可能更倾向于选择避险资产，从而进一步压低了澳元的汇率。技术面分析师解读：1.汇率走势分析目前，澳元/美元交投于0.6250附近，尽管有一些反弹的迹象，但整体走势依然显示出弱势。根据技术图表的分析，澳元/美元汇率已经进入了一个下降通道。从日线图来看，汇率近期在该通道的上轨和下轨之间震荡整理。（澳元/美元日线图，来源易汇通）2.相对强弱指数（RSI）从14日相对强弱指数（RSI）的角度来看，目前该指数处于50水平附近，反映出市场的动能处于中性区域。RSI指标未能显示出明显的超买或超卖信号，这意味着目前市场的价格走势较为平稳，缺乏明确的方向性。然而，如果RSI指数持续突破50，可能会形成较为强劲的看涨信号，预示着汇率可能会迎来一波上涨行情。3. 支撑与阻力水平技术面上，澳元/美元可能会在短期内面临一些支撑和阻力位。汇率的短期支撑位于0.6240附近，这是9日均线的位置。此外，下降通道的上轨也可能为汇率提供一定支撑。如果汇率出现回落，进一步接近通道的下轨0.6140附近，可能会加强市场的空头情绪，推动价格进一步下行。另一方面，如果汇率持续突破当前的下降通道，可能会迎来一波反弹。上方的主要阻力位在0.6330附近，这是1月24日所创下的七周高点。如果汇率能够持续站稳该水平，则有可能进入更强的上涨趋势。结论综合来看，澳元/美元目前面临诸多挑战，基本面上受到澳大利亚经济增长放缓以及澳洲联储降息预期的影响，短期内可能仍会维持弱势。技术面上，虽然RSI保持中性，且存在一定支撑位，但若无法持续突破下降通道的上轨，仍可能继续保持震荡下行的态势。市场关注全球贸易局势的变化和澳洲联储的货币政策动向。如果这些因素发生重大变化，可能会引发澳元/美元汇率的剧烈波动。汇价短期内可能以震荡整理为主，但突破0.6330的上方阻力后，可能会看到更强的上涨趋势。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2658136",
            "pub_date": "2025-02-05 15:21:44",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658112,
            "title": "全球基金大举撤离印度股市！连续22天抛售刷新纪录",
            "description": "<div> 智通财经APP获悉，全球基金对印度股票的连续抛售创下新纪录，主要系企业盈利放缓加剧，新兴市场资产面临的更大范围抛售进一步加剧。根据彭博汇编的数据，截至周一，海外基金已连续22个交易日净抛售印度本地股票，超过了2020年3月的上一次连续抛售。这些基金周一净卖出4.165亿美元的本土股票，使得这一时期资金流出总额达到约90亿美元。尽管周六的印度联邦预算提供了超过110亿美元的减税，依然没有阻挡住海外基金的撤资步伐。花旗集团策略师苏伦德拉•戈亚尔(Surendra <br>Goyal)在一份报告中写道，外资对印度本地股市配置比例处于15年来最低水平。他写道：“尽管持续的外资外流可能影响近期表现，但预算对增长是有利的。”自9月底以来，海外投资者已卖出超210亿美元的印度本地股票，这导致印度证券交易所NSE Nifty 50指数较去年创纪录水平下跌逾9%。尽管外国投资者纷纷忙于抛售股票，当地机构和散户投资者也在将资金投入市场，并限制了下跌空间。数据显示，自9月底以来，印度国内基金净买入逾320亿美元股票。减税措施和抛售后估值的修正让一些策略师认为，最糟糕的时期可能已经过去。摩根士丹利上月表示，印度股市回调是买入良机。基准的NSE Nifty <br>50指数周二上涨1.6%，创下1月2日以来最大涨幅，随后该指数继续上涨0.1%。这一涨幅也帮助该指数抹去了今年以来的跌幅。在衍生品领域，全球基金在印度国家证券交易所(National Stock Exchange of India <br>Ltd.)交易的指数期货中持有的看跌头寸较预算公布前减少了一半，表明市场情绪有所改善。尽管如此，随着美国总统唐纳德•特朗普的关税政策使发展中市场的前景复杂化，印度股市仍处于全球市场波动加剧的十字路口。价值160亿美元的iShares <br>MSCI Emerging Markets ETF(股票代码EEM)上个月遭遇了自去年8月以来最大规模的撤资。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2658112",
            "pub_date": "2025-02-05 15:17:09",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658110,
            "title": "特朗普突踩刹车！美加墨关税战火暂停，欧盟嗅到谈判良机？",
            "description": "<div> 智通财经APP获悉，欧盟正在为一场跨大西洋贸易战做准备，但美国总统唐纳德·特朗普本周决定推迟对墨西哥和加拿大征收广泛关税，这增强了欧盟对通过谈判达成可接受结果的信心。知情人士透露，特朗普对美洲贸易问题的态度逆转，为负责贸易事务的欧盟委员会的战略提供了信息，该机构准备对特朗普的关税威胁做出适当回应以免激怒美国。但知情人士表示，欧盟战略面临的一个主要障碍是，它未能与新一届美国政府建立良好的联系。美国一些关键贸易官员的任命仍在等待参议院的批准。知情人士表示，欧盟还将寻求化解与美国在钢铁和铝出口问题上的冲突，这场冲突将于下月进入白热化阶段。本周，特朗普加大了针对欧盟的言辞攻势，称征收关税“肯定会发生”，理由是与欧盟存在巨大的贸易逆差。媒体早些时候报道称，欧盟委员会已经准备了广泛的报复清单，以防美国实施这一威胁。欧盟与美国贸易欧盟委员会主席冯德莱恩周一在布鲁塞尔举行欧盟领导人会议后表示：“当受到不公平和武断的攻击时，欧盟将坚决回应。”目前还不清楚特朗普想从欧盟得到什么，而且他对欧洲的愤怒由来已久，因此可能更难达成协议。媒体早些时候报道称，欧盟委员会准备了一份改善与美国双边关系的提议，其中包括增加液化天然气、化肥和武器的进口。其他潜在合作领域包括出口管制、投资审查等。知情人士表示，欧盟委员会计划效仿2018年对美贸易战的策略，针对美国政治敏感选区加征关税。特朗普批准对来自加拿大和墨西哥的商品征收高达25%的关税，并在与墨西哥总统克劳迪娅·辛鲍姆和加拿大总理贾斯汀·特鲁多通电话后，暂停征收关税一个月。知情人士表示，一些国家认为暂缓征收关税是一个积极的信号，表明关税不是特朗普的最终目标，而是谈判的一部分。3月底，欧盟将恢复对价值约30亿美元的美国产品征收关税。这场斗争始于2018年，当时美国以国家安全为由对价值近70亿美元的欧洲钢铁和铝出口征收关税。作为报复，欧盟对政治敏感的公司征收了报复性关税，其中包括哈雷戴维森(HOG.US)的摩托车和李维斯(LEVI.US)的牛仔裤。双方同意在2021年暂时休战，当时美国取消部分措施，而欧盟冻结了所有限制性措施。知情人士表示，欧盟可能会将暂停征收这些关税的期限延长至3月份之后，以避免激怒美国政府并寻求达成积极协议。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2658110",
            "pub_date": "2025-02-05 15:17:18",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658089,
            "title": "港股延续震荡走势 后续投资机遇在哪？",
            "description": "<div> 财联社2月5日讯(编辑胡家荣)今日港股市场未能延续近日的涨势，目前三大指数集体调整。截至发稿，恒生指数跌1.18%，报20543.80点；科技指数跌1.23%，报4916.06点。注：恒生指数的表现<br>近期走势回顾节后开盘首日，港股市场震荡微跌，次日因加墨关税暂缓的消息而大幅上涨。中金公司对此指出，特朗普渐进式的加征关税思路基本符合市场预期，短期影响相对可控。该券商测算，30%关税情形下，市场的反应可能更多类似2019年4月第三轮关税后的情况。尽管基本符合预期且实际影响可控，但短期内对于两会财政政策强刺激的预期可能难以抱有很强期待。海外资金流出缓解EPFR数据显示，截至1月29日，海外主动型基金流出海外中资股市场收窄至1.8亿美元(vs.此前一周流出2.6亿美元)，已连续16周流出。海外被动型基金流入扩大至5.4亿美元(vs.此前一周流入1.9亿美元)。市场展望在当前外部扰动相对可控、内部呈现回暖态势但有所分化的情形下，中金公司认为两会前“足够力度”的财政政策兑现可能性仍有限。因此，政策真空期市场可能更多体现为阶段波动后的震荡结构行情，静待企业年报业绩及两会政策动向以提供下一步方向。整体市场仍未摆脱震荡格局，短期谨慎为主。在政策托底但过强预期不现实的假设下，低迷时可以更积极介入，但亢奋时要适度获利。恒指在19,000点是日线，周线和月线的关键支撑位。相比A股，港股的优势在于估值和行业结构，缺点在流动性，因此只要在合适的位置介入，可以提供更强的结构韧性。结构上，中金继续建议稳定回报(分红+回购，尤其是净现金占比较高的增长性公司)加结构成长，例如关注具备自身产业趋势和政策支持方向的科技板块，如半导体、人工智能及机器人等，以及政策支持下边际需求改善，叠加行业自身出清更充分板块，如以旧换新下的家电、汽车，互联网等部分消费服务、家电、纺服。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2658089",
            "pub_date": "2025-02-05 15:18:29",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658135,
            "title": "世界黄金协会：各国央行连续第三年购买超过1000吨黄金",
            "description": "<div><br>各国央行继续主导黄金市场，2024年连续第三年购买了超过1000吨黄金，约占去年总需求的20%。在周三（2月5日）发布的年度和第四季度黄金需求趋势报告中，世界黄金协会（World Gold Council）表示，2024年实物黄金总需求升至4974吨，创历史新高。报告指出，创纪录的需求推动金价连续创下历史新高。引用伦敦金银市场协会（London Bullion Market Association）的价格数据，2024年第四季度黄金均价升至每盎司2663美元的创纪录高位。2024年的平均价格上涨至每盎司2386美元，比2023年的平均价格上涨了23%。“创纪录的黄金价格使得第四季度创造了1110亿美元的成交量。2024年，这一数字达到了有史以来最高的3820亿美元。”报告称，除了央行的需求外，黄金的投资需求也触及四年高位，因为场外交易需求超过了对黄金支持的交易所交易基金（ETF）相对中性的需求。分析师在报告中表示：“2024年是自2020年以来持有量基本保持不变的第一年，与此前三年的大量流出形成对比。”总投资需求增加到1179.5吨，比2023年的945.5吨增加25%。世界黄金协会市场策略师卡瓦托尼（Joseph Cavatoni）在接受采访时表示，消费数据继续显示，黄金已重新确立了其作为重要全球金融资产的地位。他说：“持有黄金的用途是明确而易懂的。”“当我们观察央行的需求时，他们持有黄金的合理性仍然非常强。不断增加的政府债务负担和急剧变化的地缘政治格局表明，各国央行将继续购买黄金。”展望未来，Cavatoni表示，特朗普新政府的不可预测性导致的地缘政治不确定性重新出现，为央行进一步的需求奠定了基础。“在连续三年给人惊喜之后，有更多证据支持这样一种观点，即各国央行可能在2025年再次重复1000吨以上的净买入。然而，我们保留谨慎态度，将其反映在潜在的下行风险中，而不是我们的核心观点中，”WGC分析师在报告中表示。“我们认为，武装冲突转向全球贸易和经济冲突，可能会支持央行的净买入趋势。”与此同时，股市不确定性上升、通胀压力加大以及经济增长停滞，预计将推动多面手投资者通过ETF重新进入黄金市场。“我们认为，利率普遍较低、股票估值高、美元走软以及地缘政治风险（主要表现为贸易和经济的不确定性）对黄金ETF、场外交易和基于期货的投资有利。”Cavatoni说，总的来说，更大的趋势是，考虑到市场上所有的不确定性，到2025年，对黄金的需求将保持在高位，即使金价上涨。虽然ETF市场预计将吸引新的投资者关注，但世界黄金协会预测，随着价格上涨对消费者购买力的影响，金条和金币的需求将保持健康，但较去年有所下降。根据报告，全球金条和金币需求总量为1186.3吨，与2023年的1189.8吨基本持平。世界黄金协会认为，2025年的前景与此类似。“在西方，欧洲的经济低迷和高价格可能会对需求造成压力，通胀担忧和冲突风险也会下降，但较低的利率可能会在今年下半年吸引欧洲的经济活动。在美国，共和党的总统任期历来都伴随着低于平均水平的金条和金币需求；然而，地缘政治环境可能会缓和这种回调。”珠宝行业是黄金市场的软肋尽管黄金市场在2024年出现了历史性的需求，但全球货币创纪录的价格对珠宝需求造成了影响。报告称，珠宝总需求降至1877.1吨，比2023年报告的2110.6吨下降了11%。世界黄金协会表示：“除了受新冠疫情影响的2020年需求跌破1400吨外，我们需要回到2009年，才能找到黄金珠宝需求的最后一个可比年份。”黄金市场一个有趣的方面是，印度再次成为全球最大的黄金消费国，因为亚洲大国的需求疲软尤为明显。亚洲大国的珠宝需求降至479.3吨，比前一年的630.2吨下降了24%。“整个2024年，亚洲大国珠宝需求的环境非常具有挑战性，受到收入增长下降和金价飙升导致的消费者信心低迷的双重打击。珠宝零售行业面临挑战，商店全年关闭，”分析师们表示。与此同时，印度的珠宝行业去年下降了2%，消耗了563.4吨黄金。分析师表示：“在金价屡创新高的一年中，年度需求仅下降了2%，这一事实证明了印度黄金珠宝需求的弹性，突显了对7月份关税削减的反应力度，以及该国相对健康的经济增长。”人工智能的进化也在推动黄金需求尽管科技板块和人工智能在去年推动股市创下历史新高，但在黄金市场上，这一板块基本上被忽视了。然而，该公司去年实现了稳健增长，达到了4年来的最高水平。去年，科技行业消耗了326.1吨黄金，比2023年增长了7%。WGC表示：“在2024年期间，由于人工智能相关应用的持续强劲，以及消费电子市场在经历了特别疲软的2023年后的一些复苏，电子产品需求（该领域的主要需求类别）得到了提振。”尽管去年强劲的需求推高了金价，但它也刺激了供应的增加。世界黄金协会表示，2024年全球黄金供应量增加了1%，达到创纪录的4974.5吨。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2658135",
            "pub_date": "2025-02-05 15:20:17",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658060,
            "title": "美股危险了？大摩警告：特朗普冲击下 标普500未来半年最多跌8%",
            "description": "<div> 财联社2月5日讯（编辑 刘蕊）尽管在去年底，华尔街主流投行普遍对美股在今年的前景感到乐观。然而，仅仅过去一个多月，华尔街上就传出了不少担忧的声音。近日，摩根士丹利首席投资官威尔逊（Mike Wilson）表示，由于宏观经济前景的一系列挑战可能使美股难以大幅上涨，今年年初的几个月里，美股市场将难以保持2024年的涨势。威尔逊预计，标普500指数未来三到六个月将在5500-6100点之间交投。而这意味着在接下来的几个月里，标普500指数最多将下跌8%，或最多上涨1%左右。利空比利好更早到来威尔逊表示，他之所以预测这一前景，在很大程度上是因为考虑到特朗普政策带来的潜在风险。威尔逊表示：“关税和移民限制一直在议程上，这两者在短期内都对经济增长不利…在我看来，投资者之前对这些风险的态度是自满（而忽视了），而他们现在已经到了不得不直面这些风险的时刻。”在此前，投资者一直看好特朗普上台后可能带来的增长前景。例如，根据高盛的预测，特朗普的减税计划被认为有可能在未来两年提振标普500指数成分股公司的盈利增长。但威尔逊认为，这些利好政策要对市场产生积极影响，还需要时间。“这也符合我们的观点，即今年上半年美股可能更为艰难，因为相比于那些对美股有利的政策，反而是那些对美股不利的政策可能会更早地立即实施，而对股市有利的政策——如放松监管、延长税收和减少政府支出等，还没有来得及起效果。”关税冲击已经近在眼前最近几天，特朗普的关税计划也变得更加清晰：特朗普已经宣布对从加拿大和墨西哥进口的产品征收25%的关税——尽管后来他又将这两项关税计划推迟了至少一个月，但并未缓解人们对通胀上升、利率上升和经济增长放缓的担忧。据高盛估计，美国对加拿大和墨西哥征收关税可能会使标普500指数成份股公司的每股盈利下降2%-3%。该银行预测，未来几个月标普500指数可能下跌5%。大摩的威尔逊则在研究报告中补充称：“从现在开始，这些关税持续的时间越长，市场之前的基准观点可能受到考验。”不过，摩根士丹利仍预计今年全年美股将上涨：他们预计标普500指数年底将收于6500点，较当前水平上涨8%。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2658060",
            "pub_date": "2025-02-05 14:51:20",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658052,
            "title": "港股异动 | 博彩股午后急跌 1月澳门博彩收入同比下滑5.6% 大摩看好博彩需求在2月回升",
            "description": "<div> 智通财经APP获悉，博彩股午后急跌，截至发稿，银河娱乐(00027)跌3.7%，报29.9港元；永利澳门(01128)跌3.33%，报5.22港元；金沙中国(01928)跌3.24%，报16.72港元；美高梅中国(02282)跌2.91%，报10.02港元。消息面上，澳门博彩监察协调局数据显示，1月博彩收入为182.54亿澳门元，同比下滑5.6%，为连续第二个月同比负增长。里昂发表研报指，澳门今年1月博彩总收入为183亿澳门元，较预期低6%，表现不尽如人意。另外，今年1月29至31日期间，澳门平均每天仅有15.06万人次游客，游客数量也不多。大摩发表报告称，澳门1月赌收同比降6%至183亿澳门元，意味着每日赌收约为5.89亿澳门元，低于市场预期，相信与今年农历新年于1月28日至2月4日有关，预计博彩需求可能会在2月回升，预计赌收将同比增长3%至190亿澳门元，相当于日均赌收约为6.78亿澳门元。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2658052",
            "pub_date": "2025-02-05 14:51:46",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657998,
            "title": "机构预测金价或突破3000美元 山东黄金涨超7%领跑黄金股",
            "description": "<div> 财联社2月5日讯(编辑胡家荣) 受全球市场避险需求激增影响，港股黄金板块今日集体走强。截至发稿，山东黄金(01787.HK)、招金矿业(01818.HK)、灵宝黄金(03330.HK)分别上涨7.39%、4.04%、1.66%。注：黄金股的表现<br>这一表现与春节期间国际金价的强势突破形成共振——伦敦现货黄金与纽约商品交易所(COMEX)黄金期货价格双双刷新历史纪录。截至发稿，现货黄金涨0.41%，报2852.87美元。注：国际金价的表现<br>地缘风险叠加政策变数 黄金避险属性凸显德国商业银行分析师卡斯滕·弗里奇指出，美国前总统特朗普近期关于扩大进口关税的言论加剧了市场对全球贸易环境恶化的担忧。这种政策不确定性促使投资者加速转向黄金等传统避险资产，推动金价进入上行通道。再者摩根大通最新数据显示，尽管上周黄金市场出现113亿美元的资金净流出，但贸易摩擦风险的攀升正驱动资金重新回流贵金属领域。多家国际投行已上调黄金长期目标价花旗集团在最新研报中强调，若国际贸易紧张局势持续升级，未来6-12个月内金价有望冲击每盎司3000美元的历史性高位。国内券商也对黄金股持乐观态度。中信建投证券认为，随着美联储加息周期接近尾声，全球流动性环境趋于宽松，黄金开采企业将迎来盈利修复周期。同时，兼具消费属性和供应约束的基本金属板块也被列为重点配置方向。中金公司预测2025年金价将突破3000美元/盎司，并特别指出人民币计价的黄金可能因汇率因素实现更大涨幅。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657998",
            "pub_date": "2025-02-05 14:51:58",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}