{
    "data": [
        {
            "id": 3849301,
            "title": "These 2 industries are most at risk from Trump's tariffs: RBC",
            "description": "<div>Investing.com - These two industries stand to be the most affected by Trump’s tariffs, RBC analysts said given the potential cost increases and supply chain disruptions. RBC highlighted U.S. heating, ventilation, and air conditioning (HVAC) and automotive industry.  Trump announced a 25% tariff on goods from Canada and Mexico, along with an additional 10% tariff on Chinese imports. However, the former president later agreed to delay tariffs on Canada and Mexico by a month, adding to market uncertainty.RBC noted that while many industrial companies operate with an \"in-country/for-country\" manufacturing strategy, which mitigates tariff risks, some sectors remain vulnerable. The HVAC industry, in particular, faces substantial exposure, as about 40% of U.S. HVAC production capacity is located in Mexico.Lennox reported that roughly $1 billion, or 20%, of its output would be affected by tariffs, as it manufactures lower-end products in Mexico while keeping premium production in the US. Other HVAC players expected to be impacted include Carrier Global (NYSE:CARR), Trane Technologies (NYSE:TT), and  Johnson Controls  (NYSE:JCI).The auto industry is also at risk, particularly companies with significant exposure to original equipment manufacturers. RBC highlighted  Eaton  (NYSE:ETN) with 16% auto OEM exposure, followed by Trane, Carrier, Gates Industrial (NYSE:GTES) at 9%, and Graco (NYSE:GGG) at 9%.Analysts expect companies to pass on increased costs to customers through price hikes, a strategy effectively used during the 2018 trade war. However, price-setting power will be crucial in determining which firms can weather the impact. Companies with strong market positions and high profit margins, the ‘Price-Makers’, should be able to implement price increases effectively, while ‘Price-Takers’ with weaker margins could struggle, RBC said.Despite prior supply chain shifts away from China, RBC noted that recent investments in Mexico could now face renewed risks under Trump’s proposed tariff regime.Investors will be closely watching corporate earnings calls this week for management commentary on tariff exposure and pricing strategies, RBC said, adding that the rapidly evolving trade landscape could lead to further adjustments.</div>",
            "link": "https://www.investing.com/news/pro/these-2-industries-are-most-at-risk-from-trumps-tariffs-rbc-432SI-3849301",
            "pub_date": "2025-02-05 07:31:02",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3848916,
            "title": "Snap shares jump on surprise profit, upbeat outlook",
            "description": "<div>Investing.com -  Snap Inc  (NYSE:SNAP) shares jumped more than 7% in after-hours trading after the Snapchat owner posted better-than-expected quarterly earnings and issued an upbeat outlook on the back of stabilizing digital ad spending. <br>The social media company reported earnings per share of $0.16, comfortably beating analysts’ estimates of a loss of $0.04. Revenue rose to $1.56 billion, slightly ahead of Wall Street expectations of $1.55 billion.\"Active advertisers more than doubled in Q4, with the improvements we have made to our advertising platform driving improved advertiser performance and helping to grow revenue 14% year-over-year,” said CEO Evan Spiegel. <br>Daily active users (DAUs), a key metric for social media companies, climbed to 453 million in the quarter, and Snap projected first-quarter DAUs to reach about 459 million. The company expects first-quarter revenue to range between $1.325 billion and $1.360 billion.<br>\"We continue to see encouraging trends in engagement metrics, including increased contentactive days among less frequent and more casual users,\" Snap said in a statement.<br>Snap has been reviving its advertising business following a slump in recent years. The company also plans to expand its full-time headcount by 8% to 10% over the course of 2025.</div>",
            "link": "https://www.investing.com/news/stock-market-news/snap-shares-jump-on-surprise-profit-upbeat-outlook-3848916",
            "pub_date": "2025-02-05 05:17:37",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3849324,
            "title": "US private prison stocks dip on Trump-El Salvador deportation talk",
            "description": "<div>Investing.com- Shares of CoreCivic Inc and GEO Group- the two biggest private prison operators in the U.S., sank on Tuesday as President Donald Trump said he supported an offer from El Salvador to house U.S. criminals. <br>CoreCivic Inc (NYSE:CXW) slid 5.7% to $18.88, while  Geo Group Inc  (NYSE:GEO) fell 7.8% to $28.560. Both stocks steadied in aftermarket trade. <br>The White House is assessing whether it could take up an offer from El Salvador President Nayib Bukele to house U.S. inmates in the country’s CECOT mega prison, U.S. Secretary of State Marco Rubio said on Tuesday. <br>Trump said he would enact the move “in a heartbeat” if he had the legal backing to do so. Billionaire Elon Musk, who appears to be a major part of Trump’s administration, called the move a “great idea.” <br>A deal with El Salvador will essentially outsource a part of the U.S. prison system to the country. <br>“We are willing to take in only convicted criminals (including convicted U.S. citizens) into our mega-prison (CECOT) in exchange for a fee. The fee would be relatively low for the U.S. but significant for us,” Bukele had said in a social media post. <br>Still, the legality of such a deal was unclear, given that U.S. courts have protections for U.S. citizens that prevent them from being deported. Concerns over dangerous prison conditions in El Salvador, as noted by the U.S. State Department, could also block any move to deport U.S. citizens. <br>Any such deal with El Salvador will take business away from U.S. prison operators, which were initially expected to benefit from Trump’s crackdown on illegal immigration and border security. Trump signed several executive orders enacting such a crackdown in his first few days in office. <br>Core Civic and Geo shares had rallied sharply after Trump’s election victory in November on the prospect of increased government business. They had also surged after Trump’s 2016 election victory. <br> </div>",
            "link": "https://www.investing.com/news/stock-market-news/us-private-prison-stocks-dip-on-trumpel-salvador-deportation-talk-3849324",
            "pub_date": "2025-02-05 07:58:14",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3849360,
            "title": "Trump says US will take over the Gaza Strip, Palestinians should leave",
            "description": "<div>Investing.com- U.S. President Donald Trump said on Tuesday that the U.S. will take over the Gaza Strip and rebuild it, and repeated his comments suggesting that Palestinians living there should be relocated. <br>Trump said the U.S. will take over the territory and rebuild it, calling the area a “demolition site.” <br>“We’ll own it and be responsible for dismantling all of the dangerous and unexploded bombs and other weapons on the site, level the site, and get rid of the destroyed buildings,” Trump said in a White House conference with Israeli Prime Minister Benjamin Netanyahu. <br>“Create an economic development that will supply unlimited numbers of jobs and housing for the people of the area... Do a real job. Do something different,” Trump said.<br>The U.S. President claimed that such a move would bring “great stability” to the Middle East. <br>Trump also repeated his suggestion of permanently displacing Palestinians from Gaza, claiming that they could “go to other countries of interest with humanitarian hearts.” Trump also referred to living in Gaza as a “miserable existence.” <br>“They’re going to have peace, they’re not going to be shot at and killed, and destroyed,” Trump said. <br>The latest Israel-Hamas, which began in late-2023 following a Hamas attack on Israel, sparked a humanitarian crisis in Gaza as Israel battered the region with missile strikes and ground assaults.<br>Israel and Hamas signed a ceasefire in the final days of the Biden administration, with fighting having paused since mid-January. <br></div>",
            "link": "https://www.investing.com/news/economy/trump-says-us-will-take-over-the-gaza-strip-palestinians-should-leave-3849360",
            "pub_date": "2025-02-05 08:37:28",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3849369,
            "title": "US stock index futures dip as Alphabet earnings underwhelm",
            "description": "<div>Investing.com- U.S. stock index futures fell on Tuesday evening, pressured chiefly by losses in technology stocks as underwhelming earnings from Google owner Alphabet raised more questions about artificial intelligence demand. <br>Futures retreated after a positive session on Wall Street, as investors were relieved by President Donald Trump postponing plans to impose steep trade tariffs on Canada and Mexico. But Trump’s tariffs on China still took effect, drawing ire and retaliation from Beijing. <br>Concerns over a brewing trade war had battered Wall Street on Monday, with U.S. stock benchmarks still struggling to recover from those losses. <br>S&P 500 Futures fell 0.4% to 6,042.25 points, while Nasdaq 100 Futures fell 0.5% to 21,569.0 points by 19:05 ET (00:05 GMT). Dow Jones Futures fell 0.1% to 44,642.0 points. <br>Alphabet slides as Q4 earnings underwhelm <br>Alphabet’s class A shares (NASDAQ:GOOGL) slid 7.4% in aftermarket trade, after the company’s fourth-quarter revenue missed expectations, especially on disappointing earnings from its cloud division, which is closely tied to AI. <br>The print raised questions about just how much of an earnings driver AI was, following a similar pattern from peer Microsoft’s earnings last week. Alphabet, like Microsoft (NASDAQ:MSFT), signaled that it will spend vast amounts of capital on AI in 2025. <br>Wall Street’s AI spending has come under heightened scrutiny in recent weeks, especially with the release of China’s DeepSeek R1 AI model, which appeared to operate on a substantially smaller budget. <br>This had triggered a massive rout in tech valuations last week, one that Wall Street is still struggling to recover from. Alphabet’s earnings could trigger a fresh tech rout, although the company’s Wall Street peers were largely unchanged in aftermarket trade. <br>Wall St shrugs off China trade jitters; more earnings awaited <br>Wall Street indexes ended Tuesday’s session higher, aided by a round of dip buying after steep losses on Monday. <br>Investors largely looked past a brewing trade war with China, after Trump’s 10% tariffs against the country took effect. Beijing retaliated with its own import tariffs and export controls, and also launched an antitrust investigation into Google. <br>Trump signaled that he was in no hurry to negotiate with Chinese President Xi Jinping, with the tariffs now set to remain in place for the foreseeable future. <br>Analysts warned that increased trade tariffs- which will be borne by U.S. importers, could underpin inflation and pressure growth.<br>The S&P 500 rose 0.7% to 6,037.83 points, while the NASDAQ Composite rose 1.4% to 19,654.02 points on Tuesday. The Dow Jones Industrial Average rose 0.3% to 44,556.04 points. <br>More major earnings are on tap this week, with magnificent seven member Amazon.com Inc (NASDAQ:AMZN) set to report on Thursday. Before that, prints from  Uber Technologies Inc  (NYSE:UBER), Walt  Disney  Company (NYSE:DIS), Qualcomm Incorporated (NASDAQ:QCOM), and MicroStrategy Incorporated (NASDAQ:MSTR) are due on Wednesday. <br></div>",
            "link": "https://www.investing.com/news/stock-market-news/us-stock-index-futures-dip-as-alphabet-earnings-underwhelm-3849369",
            "pub_date": "2025-02-05 08:49:20",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3848847,
            "title": "Analysis-Trade war with China casts dark cloud over new US LNG projects",
            "description": "<div> By Curtis Williams HOUSTON (Reuters) - President Donald Trump's emerging trade war with Beijing poses a new threat to billions of dollars in planned U.S. liquefied natural gas export projects, many of which rely on China as a key buyer, according to analysts, industry sources, and company filings. The threat reflects the double-edged nature of Trump's protectionist policies, which are intended to boost U.S. business and force action to stop drug trafficking and illegal immigration, but could also inadvertently undermine his hopes of vastly expanding U.S. energy output. \"The tariffs may impact long-term contracting and offtake agreements...and make it more difficult for new US LNG projects to progress toward Final Investment Decisions,\" analysts at energy consulting firm EBW Analytics told customers in a note on Tuesday, referring to Beijing's decision to impose retaliatory levies on U.S. energy imports. Trump over the weekend announced a 10% tariff on Chinese imports as part of a broad plan to improve the U.S. trade balance, triggering retaliation from Beijing which slapped a 15% tariff on U.S. LNG and coal, and a 10% tariff on U.S. oil. The U.S. is the world's largest exporter of LNG and China has been a major buyer of the super-chilled gas, importing nearly 6%, or about 4.3 million metric tonnes, of total U.S. LNG exports last year, according to LSEG data. Chinese state-owned companies have signed LNG supply deals for over 20 million metric tonnes per annum (MTPA) from both existing and future U.S. export terminals, according to Reuters calculations. The two largest U.S. LNG exporters, Venture Global LNG and Cheniere, have 14 million MTPA in agreed long-term contracts with Chinese companies, according to their public announcements. Venture Global declined to respond to requests for comment, while Cheniere and rival  Energy Transfer  (NYSE:ET), which has a long-term sales and purchase agreement with China, were not immediately available for comment. Freeport LNG, the third-largest U.S. LNG exporter, also declined to comment. There are eight LNG export terminals operating in the U.S., three under construction and almost 20 more at various stages of development. Companies are pushing ahead with projects for new or expanded LNG export capacity after the Trump administration in January lifted a moratorium on new LNG export permits, imposed by former President Joe Biden over concerns about the projects' environmental and economic impacts.  But Charlie Riedl, the Executive Director of the Center for LNG, a trade group representing many U.S. LNG exporters and developers, said China’s decision to impose tariffs injects uncertainty into the industry and weakens America’s competitive position in global energy markets. \"These tariffs on U.S. LNG directly undermine the Trump administration’s efforts to expand American energy exports and strengthen our geopolitical influence,\" Riedl said. A White House official told Reuters that Chinese tariffs on U.S. LNG could have limited economic impact, but said the risk is worthwhile. \"There is not a dollar value you can put on saving American lives from fentanyl deaths,\" the official said, reflecting U.S. concerns that China is a major source of the drug and chemicals used to make it. Trump wants to expand the export markets for LNG to other nations as well, creating less risk from any Chinese actions, the official said.  BIG CONTRACTS  LNG developers use long-term contracts or sales and purchase agreements to help secure funding for their projects from banks. They are a key element in moving projects from the development stage to a final investment decision. Venture Global, the most valuable U.S. LNG exporter with two plants operating in Louisiana and three more under development, has signed 9.5 MTPA in supply deals with Chinese companies so far, according to company filings.  Cheniere Energy (NYSE:LNG), the second-most valuable U.S. LNG company and currently the largest exporter, has more than 4.5 MTPA in long-term Chinese deals, according to its announcements. As part of the prospectus for its blockbuster initial public offering in January, Venture Global warned investors of its exposure to a possible trade war between the world's two largest economies. \"These factors could adversely affect our ability to market the remaining production capacity of our projects, which could have a material adverse effect on the viability of our projects and on our business,\" Venture Global told investors at the time. Its stock was down almost 5% in afternoon trading on Tuesday, while Cheniere was down less than 1%.   </div>",
            "link": "https://www.investing.com/news/stock-market-news/analysistrade-war-with-china-casts-dark-cloud-over-new-us-lng-projects-3848847",
            "pub_date": "2025-02-05 05:07:55",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3847235,
            "title": "Wall Street ends higher on US-China trade optimism, energy boost",
            "description": "<div> By Abigail Summerville and Sukriti Gupta (Reuters) - The three major stock indexes closed higher on Tuesday, aided by energy stocks, while investors saw reason for optimism for a trade breakthrough between the U.S. and China after President Donald Trump delayed tariffs for Canada and Mexico.  New 10% U.S. tariffs on Chinese imports took effect on Tuesday, which China countered with levies on U.S. goods. It was unclear when the country's leaders would talk and Trump said he was in no hurry. Energy stocks led the S&P gains, while utilities and consumer staples lost ground.  Trump had said over the weekend he would impose a 25% tariff on goods from Mexico and Canada, but agreed to a 30-day pause on Monday in return for border and crime concessions from both countries. \"The president was so quick to offer a 30-day stay of execution to Mexico and Canada, so you get the idea that maybe what he's really trying to do is embrace a quick declaration of victory which doesn’t change much from a trade perspective,\" said Sam Stovall, chief investment strategist at CFRA Research. \"Investors have been breathing a sigh of relief today and we’ll see if a month from now they can continue to breathe that sigh of relief.\"  Strong corporate earnings have also buoyed investor optimism. Of the 211 companies in the S&P 500 that have reported earnings for the fourth quarter, 76.8% reported above analyst expectations, according to an S&P earnings scorecard. Alphabet (NASDAQ:GOOGL) rose ahead of its quarterly results, which are due after markets close, while Nvidia (NASDAQ:NVDA) also advanced. Palantir (NASDAQ:PLTR) shares jumped after the data analytics company forecast first-quarter and annual revenue above Wall Street estimates. According to preliminary data, the S&P 500 gained 42.51 points, or 0.71%, to end at 6,037.08 points, while the Nasdaq Composite gained 259.19 points, or 1.34%, to 19,651.14. The Dow Jones Industrial Average rose 132.56 points, or 0.30%, to 44,554.47. Biotechnology firm Illumina (NASDAQ:ILMN) dropped, while PVH Corp (NYSE:PVH), the holding company for brands including Calvin Klein, slipped after China placed the companies on its \"unreliable entity list\".  Trump's delayed tariffs for Canada and Mexico helped the three major U.S. stock indexes pare some of the heavy losses suffered earlier on Monday and close trading well off session lows. Three Federal Reserve officials warned on Monday that trade tariffs carried inflation risks, with one arguing that uncertainty over the outlook for prices called for slower interest-rate cuts than otherwise. A Labor Department report showed U.S. job openings stood at 7.6 million in December, compared to an estimated 8 million, according to economists polled by Reuters. In earnings-driven moves, PepsiCo (NASDAQ:PEP) fell after it forecast annual profit below expectations and missed quarterly revenue estimates.   Estee Lauder  (NYSE:EL) plummeted after the cosmetics company posted another weak quarter amid demand weakness and announced job cuts.   Merck  (NSE:PROR) dropped after the drugmaker said it would pause shipments of Gardasil to China through at least mid-year, as continued weak demand for the HPV vaccine there is expected to hurt the company's 2025 revenues. PayPal (NASDAQ:PYPL) fell after the digital payments giant's operating margin shrank in the fourth quarter.  </div>",
            "link": "https://www.investing.com/news/stock-market-news/futures-tick-lower-as-china-responds-to-us-tariffs-3847235",
            "pub_date": "2025-02-05 05:08:11",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3848879,
            "title": "Google parent Alphabet misses quarterly revenue estimates",
            "description": "<div> (Reuters) -Alphabet missed Wall Street estimates for quarterly revenue on Tuesday, in a sign the Google parent was taking a hit from increased competition in the digital advertising market and a slowdown in its cloud computing business. The tech giant's shares were down 8% in extended trading. Alphabet (NASDAQ:GOOGL) has gained about 9% so far this year. Google's Cloud business posted a 30% rise in revenue to $11.96 billion in the fourth quarter, slowing down from the 35% increase in the September quarter. Analysts were expecting a rise of 32.3% to $12.16 billion, according to data compiled by LSEG. The soft cloud numbers come even as Google has built out AI features within its cloud computing platform. Larger cloud rival Microsoft (NASDAQ:MSFT) also reported weaker-than-expected growth in its Azure cloud platform last week. Revenue rose 12% to $96.47 billion in the fourth quarter, compared with the average analyst estimate of $96.56 billion, according to data compiled by LSEG.  The company reported a profit of $2.15 per share, beating estimates of $2.13 per share. </div>",
            "link": "https://www.investing.com/news/economy-news/google-parent-alphabet-misses-quarterly-revenue-estimates-3848879",
            "pub_date": "2025-02-05 05:12:00",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3848888,
            "title": "EA forecasts fourth-quarter bookings below estimates on weak gamer spending",
            "description": "<div> (Reuters) -Electronic Arts forecast fourth-quarter bookings below Wall Street expectations on Tuesday, as the videogame publisher grapples with a slowdown in spending at its popular soccer franchise.  It also announced a $1 billion share repurchase plan, which sent its shares up around 1% in extended trading.  EA expects fourth-quarter bookings between $1.44 billion and $1.59 billion, compared with estimates of $1.65 billion, as per data compiled by LSEG.  The downbeat projection comes a few weeks after the company slashed its annual bookings forecast citing weak in-game spending for \"FC 25\" and underperformance of its new Dragon Age title amid an uncertain economic environment marked by high inflation.  The unexpected move sparked fears about the trajectory of one of the company's most coveted titles, even as it experiences success with other sports games. However, CEO Andrew Wilson said the company is \"confident in a return to growth in FY26 and beyond,\" with multiple games under development including the next installment of \"Battlefield.\"  EA's sports portfolio has remained one of its strongest assets, especially its American football titles, which topped sales charts last year and are on track to exceed $1 billion in net bookings for this fiscal year, the company said. EA is largely dependent on in-game spending for its major sports titles, constantly updating them with new content to keep players engaged.  The company reported third-quarter bookings of $2.22 billion, missing expectations of $2.32 billion. It left its annual bookings forecast unchanged.  Diluted earnings per share for the third quarter was $1.11, compared with $1.07 in the previous year.  </div>",
            "link": "https://www.investing.com/news/stock-market-news/ea-forecasts-fourthquarter-bookings-below-estimates-on-weak-gamer-spending-3848888",
            "pub_date": "2025-02-05 05:12:37",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3848891,
            "title": "Western Union shares rise on solid Q4 results, upbeat outlook",
            "description": "<div>Investing.com-  Western Union  Co (NYSE:WU) reported fourth-quarter results that exceeded analyst expectations, driving shares up 2.5% in after-hours trading. The money transfer giant posted solid revenue growth and provided an optimistic outlook for 2025.<br>Western Union reported Q4 adjusted earnings per share of $0.40, missing analyst estimates of $0.43. However, revenue for the quarter came in at $1.1 billion, surpassing the consensus forecast of $1.03 billion. The company's revenue increased 1% YoY on both a reported and adjusted basis, excluding Iraq.<br>The revenue growth was primarily driven by the Consumer Services segment, which saw a 56% increase in GAAP revenue, or 23% on an adjusted basis. Branded Digital revenue also showed strength, growing 7% on a reported basis and 8% on an adjusted basis.<br>\"We concluded 2024 with a solid performance, marking our third consecutive quarter of positive adjusted revenue growth, excluding Iraq,\" said Devin McGranahan, President and CEO of Western Union.<br>Looking ahead, Western Union provided an upbeat outlook for fiscal year 2025. The company expects full-year EPS between $1.75 and $1.85, compared to the analyst consensus of $1.81. Revenue is projected to be in the range of $4.115 billion to $4.215 billion, in line with the consensus estimate of $4.18 billion.<br>The company's Board of Directors approved a quarterly dividend of $0.235 per share for the first quarter of 2025, payable on March 31, 2025.</div>",
            "link": "https://www.investing.com/news/stock-market-news/western-union-shares-rise-on-solid-q4-results-upbeat-outlook-3848891",
            "pub_date": "2025-02-05 05:12:46",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        }
    ]
}