{
    "data": [
        {
            "id": 2658101,
            "title": "2月5日现货黄金技术分析及复盘推演",
            "description": "<div><br>周三（2月5日）亚盘时段大幅上涨，黄金交投于2858美元附近，基本面上由于市场避险情绪持续升温，同时在美元指数回调的背景下，支撑金价多头向上。但美联储中期暂缓降息，叠加美国经济数据支撑之下，不利黄金形成趋势加速，目前是在避险情绪定价之中，等待回归基本面之后的方向选择，由于短期偏离值过大，日内切勿盲目追涨。图形上来看，日线级别大幅走高之后存在修正的需求，但需要注意的是目前依然在多头趋势之中，不宜左侧沽空，关注55日均线是否加速上行。日内等待修正之后的低吸机会，日线级别密集支撑区间2800美元附近，短期因加速走高之后已经没有套牢盘，不排除测试2900美元整数关的可能性。4小时级别上来看，目前属于趋势加速行为，缓涨急跌的背景下，短期维持多头运行，日内支撑2820美元附近回踩不破，则延续多头加速。本文由汇通财经超级赛亚人原创，版权所有。以上内容仅供参考，不做交易依据。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2658101",
            "pub_date": "2025-02-05 14:40:18",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658075,
            "title": "世界黄金协会：2024年黄金需求增长1%，经济不确定性将继续提供支撑",
            "description": "<div><br>世界黄金协会(WGC) 周三表示，随着投资增加，包括场外交易 (OTC) 在内的全球黄金需求在 2024 年增长了1%，达到创纪录的 4974.5吨，WGC补充称，各国央行在第四季加快了购买速度。随着投资者选择黄金来对冲全球风险，且美联储大幅降息，现货黄金价格去年上涨了 27%，为 2010 年以来的最大涨幅。而关税之后，受避险需求的推动，黄金价格周二再创历史新高。各国央行是黄金需求的主要来源，2024 年，央行的黄金购买量连续第三年超过了 1000 吨黄金，WGC的季度报告显示，波兰央行是最大买家。WGC是由全球黄金矿商组成的行业组织。基于已报告的购买量和未报告的购买量估计值，WGC估算在2024年最后一个季度，即特朗普赢得美国大选的季度，各国央行的黄金购买量同比增长了54%，达到 333 吨。去年黄金的投资需求成长25%，达到1,180吨的四年新高，主要原因是以实物支持的黄金交易所交易基金（ETF）的资金流出四年来首次枯竭。这显示对不同产品的需求发生了重大转变，金条的投资需求增加了 10%，而金币购买量则下降了31%。世界黄金协会高级市场分析师Louise Street表示：“到2025年，我们预计各国央行将继续占据主导地位，黄金ETF投资者也将加入竞争，尤其是当利率下降但仍不稳定时。地缘政治和宏观经济的不确定性应该是今年的主流主题，支持对黄金作为财富储存和对冲风险的需求。”图：世界黄金协会2025年黄金需求预测世界黄金协会称，不包括不透明场外交易的黄金总需求去年增长了 1%，至 4,553.7 吨，创下 2022 年以来的最高水准。作为实体需求最大的类别，黄金珠宝消费在 2024 年下降了 11%，而金矿产量则保持稳定，回收量增长 15%。世界黄金协会预计，由于价格高企，今年珠宝需求将持续承压，回收量将进一步上升。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2658075",
            "pub_date": "2025-02-05 14:20:29",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658074,
            "title": "贵金属公司：2025年黄金将表现良好，但白银价格将表现得更好",
            "description": "<div><br>虽然预计黄金今年的表现将良好，一家公司预计金价将达到每盎司3300美元，但也鼓励投资者注意其他金属。尽管黄金有望在2025年取得成功，但精品贵金属公司Auag基金的创始人埃里克·斯特兰德（Eric Strand）预计，白银将表现更好。斯特兰德（Strand）在最新的白银前景展望中说，他预计银将重新测试其2011年历史最高点，接近每盎司50美元。斯特兰德对白银的的看涨的时候，白银正好初步测试了32美元/盎司的支撑。与此同时，白银仍在努力摆脱黄金的阴影，金价接近每盎司2800美元上方的纪录高位。黄金/白银比率（GSR）已从一年高点回落，但仍高于88点。该比率的长期历史平均值在60点左右。斯特兰德说： “目前，金银比处于接近90：1的高度，使白银作为投资特别有吸引力。我们2025年的短期目标是金银比朝70：1迈进，然后逐渐达到50：1，然后在几年内，至30：1。 当金银比为70：1的时候，3000——3300美元的黄金价格将对应42——47美元的银价，这将等同于年收益率分别为 +45％和 +62％。斯特兰德（Strand）表示，由于其双重角色是货币和关键工业金属的双重作用，因此他今年看涨白银。在谈及白银的货币作用时，Strand表示，在以美国为首的各国政府继续赤字支出以支撑陷入困境的全球经济之际，白银是一种有吸引力的通胀对冲工具。“正如我们在《黄金展望》中所写的那样，特朗普领导下的美国希望不惜一切代价避免‘泡沫破裂’，以创造积极的‘繁荣’情绪。继续刺激经济的代价是货币通胀，”他在报告中表示，“通胀繁荣创造了包括白银在内的大宗商品价格飙升的环境。不仅仅是美国，全球的债务水平都创下了历史新高。系统中的货币供应量在没有任何实质性增长的情况下迅速增长，导致每个货币单位贬值，推高了白银等货币金属的价格。”考虑到白银的工业吸引力，Strand表示，对太阳能的需求将继续推动对白银的兴趣。此外，他指出，白银的独特性质——是导电和导热性能最好的金属——使其成为全球经济高科技发展和电气化的关键组成部分。与此同时，白银的供应并没有跟上永不满足的市场需求。“在经历了数年相对供不应求之后，我们正面临一个将对白银价格产生重大影响的局面。现货短缺可能引发价格飙升，银价可能在短期内翻倍。“此外，需求缺乏弹性，因为无论价格上涨，我们都不会减少白银的消费。这是因为白银具有不可替代的特性，而且每件产品所用的白银数量相对较少，这意味着价格飙升很少会对最终产品的成本产生重大影响。”北京时间14:10，现货白银现报32.27美元/盎司。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2658074",
            "pub_date": "2025-02-05 14:20:15",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658044,
            "title": "特朗普强力打击伊朗原油出口，华尔街银行上调油价预测",
            "description": "<div><br>随着美国总统特朗普激进的贸易和能源政策带来新的不确定性，石油市场正准备受到影响。最近几周，油价一直处于过山车状态，一个月前布油交易价格为76.30美元，随后飙升至82美元，周二又回落至75.95美元。但真正的风暴可能还在前面，因为白宫的目标是挤压伊朗的石油出口到零，并对从加拿大和墨西哥进口的石油征收25%的关税。华尔街银行调整油价预测华尔街的主要银行正在相应地调整他们的预期，但那是在周二打击伊朗之前。根据华尔街日报的一项调查（其中包括高盛、摩根大通和摩根士丹利的预测），目前预计2025年布油均价为每桶73.01美元，而WTI原油均价为68.96美元。这比以前的估计有所增加，但预期仍低于80美元。高盛指出，虽然特朗普的政策最初可能会收紧石油市场，但他对能源独立的更广泛推动可能会抑制长期价格。高盛的分析师表示：“美国政策风险强化了我们的观点，即我们对布油价格区间70- 85美元的预测短期偏上行，但中期偏下行，因为闲置产能高，而且广泛的关税可能损及需求。”伊朗因素：最大压力回归特朗普针对伊朗的最新举措可能会改变游戏规则。b他的政府正在恢复“最大压力”运动，旨在完全切断德黑兰的原油销售。如果成功，这将使全球市场每天减少130万桶原油。这不是特朗普第一次采取这种做法。2018年当他的政府逐步加大对伊朗的制裁力度时，油价飙升至每桶80美元以上。市场还记得，交易员们再次密切关注华盛顿是否坚持实施二级制裁，即惩罚继续购买伊朗原油的国家和公司。当然，石油交易员对这场游戏并不陌生。伊朗一直擅长通过船对船转运和向亚洲大国的中间商销售来规避制裁，但美国的严厉打击可能会改变这种局面，尤其是如果华盛顿真的积极行动的话。关税动荡：加拿大和墨西哥石油会成为目标吗？与此同时，特朗普的关税战让投资者感到紧张。他对加拿大和墨西哥进口商品征收的关税原定于上周末生效，预计将严重破坏北美能源流动，推高油价。加拿大每天向美国炼油厂供应近400万桶原油，使其成为美国最大的原油供应国。墨西哥贡献了另外每天50万桶。然而，在两国做出让步后，关税被暂停了，不过目前只暂停了一个月。在征收关税之前，问题是，石油会被列入关税清单吗？在征收关税之前，问题是，石油会被列入关税清单吗？如果是这样，这将严重影响炼油利润率，尤其是在严重依赖加拿大重质原油的中西部地区。加拿大外交部长Joly已经警告说，美国炼油商可能不得不转向委内瑞拉原油，鉴于特朗普孤立委内瑞拉的努力，这是一个具有讽刺意味的转折。最终，对加拿大石油征收的关税仅为10%，而不是人们担心的25%。高盛认为，决策者将尽其所能避免布油价格飙升至每桶85美元以上，因为这将推动美国汽油价格突破每加仑3.50美元的政治敏感关口。但如果加拿大和墨西哥的原油因关税而变得更加昂贵，炼油商将被迫去找其他地方，这可能会收紧市场，并推高燃料成本。未来的不确定性更多特朗普也暗示要对俄罗斯实施更严厉的制裁，可能针对的是其石油出口。俄罗斯仍然是全球市场的主要原油供应国。与此同时，特朗普政府此前曾表示允许雪佛龙继续在委内瑞拉开展有限的业务，但政策逆转可能会再次限制委内瑞拉石油进入美国，这将进一步收紧供应形势，特别是对于依赖重质原油的墨西哥湾沿岸炼油厂。美联储、美元和需求担忧除了地缘政治之外，美联储的利率立场也会对石油市场产生影响，这使得预测者更加难以准确地预测石油市场的走向。当美联储最近决定维稳利率时，即将降息的希望破灭了。利率走高通常会使美元走强，使石油对外国买家来说更加昂贵。如果利率居高不下，需求可能会受到打击。对亚洲大国经济的担忧也挥之不去，该国经济已显示出放缓的迹象，该国需求的任何持续疲软都可能限制油价涨幅。高盛指出，尽管美国的制裁和关税可能短期推高油价，但需求方面的风险可能会限制长期上涨空间。油价将何去何从？目前，石油市场处于相互冲突的力量之间。特朗普的能源和贸易政策带来了看涨的供应风险，而需求的不确定性、OPEC+的决定和强势美元则发挥平衡作用。如果美国对伊朗和俄罗斯实施严厉制裁，加上关税扰乱北美供应链，油价很可能再次突破80美元的关口。但如果OPEC+增产或经济担忧打压需求，油价可能仍会在许多分析师预期的每桶70- 85美元区间内波动。根据华尔街日报的调查，预计第一季度布油价格为75.33美元，WTI原油价格为71.22美元。调查显示，第二季度将分别降至74.02美元和70美元，第三季度将降至73.10美元和68.91美元。布伦特原油连续 来源：易汇通北京时间2月5日13:30 布伦特原油连续 报 75.77 美元/桶<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2658044",
            "pub_date": "2025-02-05 13:40:15",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658006,
            "title": "贸易战升级！人民币贬值压力大，中国央行加大支持",
            "description": "<div> 投资慧眼Insights - 由于中美贸易紧张局势不断升级，加大了人民币贬值压力，中国央行加大了对人民币的支持。2月5日，中国人民银行将人民币汇率中间价设定为1美元兑人民币7.1693元。人民币汇率中间价（每日参考汇率）是中国人民银行最常用的货币管理工具，它限制在岸人民币汇率上下浮动幅度在2%以内。自11月特朗普赢得美国总统大选以来，央行一直将人民币中间价维持在7.2以上的水平，以保护人民币免受美元升值的影响。此举表明，尽管中美之间最新的针锋相对的贸易措施给人民币带来压力，但当局不愿让人民币贬值。2月4日，美国政府对所有中国商品征收10%的关税。中国对从美国进口的部分产品征税，并对谷歌展开了反垄断法调查。一些分析师原本预计，中国人民银行将让人民币贬值，以提高中国出口产品的吸引力，并削弱美国关税的影响，但这一想法尚未实现。瑞穗银行首席亚洲外汇策略师Ken Cheung表示：“人民币汇率稳定支持的现状与避免中美紧张局势进一步升级的立场一致。中国表现出维护外汇稳定的立场，这可以抑制资本外流压力。”高盛集团预测，人民币中间价将逐渐走低至7.3，在岸人民币汇率将达到7.4至7.5的水平。澳大利亚国民银行则表示，除非与美国达成贸易协议，否则人民币跌向7.5只是时间问题。【图源：TradingView；近半年美元/在岸人民币（USD/CNY）走势】截至发稿，美元兑在岸人民币（USD/CNY）报7.2826，美元兑离岸人民币（USD/CNH）报7.2878。上个月，离岸人民币汇率接近历史低点，中国人民银行调整了资本管制措施。其在香港发行了创纪录数量的人民币票据，以挤压离岸市场的流动性，阻止看跌货币的押注。此外，它还暂停购买政府债券，以减缓当地收益率的下降，减轻人民币贬值压力。交易员们正拭目以待世界两大经济体领导人能否迅速达成贸易协议。特朗普周一表示，他将寻求与中国达成协议，谈判将很快举行。不过他周二又说，不急于与中国国家主席对话，将在适当的时候进行通话。“一个‘好的通话’会让美元兑人民币汇率走低，中间价可能就不那么重要了。”华侨银行策略师Christopher Wong表示，“目前，关键点在于局势是否会出现缓和，就像我们在墨西哥和加拿大看到的那样。”回顾历史，特朗普上任后的中美贸易紧张局势拖累人民币汇率十年来首次跌破1美元兑7元的心理关口。沪深300指数最初一年内下跌32%。原文链接</div>",
            "link": "https://cn.investing.com/news/forex-news/article-2658006",
            "pub_date": "2025-02-05 12:07:20",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657980,
            "title": "DeepSeek全球霸榜，引爆AI概念股！机构称中国迎科技「转型牛」",
            "description": "<div>英为财情Investing.com -周三（5日），港股三大指数集体调整，A股主要股指表现分化，上证指数午盘收跌，深成指、创业板指小幅上升。盘面上，热点集中于AI应用端以及机器人概念两大主线，DeepSeek概念集体大升，机器人概念反复活跃。<br>消息面上，DeepSeek的人工智能（AI）软件在全球140个市场中的移动应用下载量排行榜上位居榜首。DeepSeek近期的爆红，无疑加速了AI「设备端化」的趋势。国内华为云、阿里云、腾讯云、360数字安全、云轴科技等多个平台宣布上线DeepSeek大模型。目前，包括英伟达、微软、亚马逊在内的多家美国公司陆续采用DeepSeek-R1 模型。<br>国泰君安表示，应高度重视中国DeepSeek的突破，其创新标志着中国AI发展进入重要转折，其意义不仅仅在于拉近中美AI差异，更重要的是商业机会、社会资本与人心共识的凝聚，这是中国科技公司迎来重估与2025年科技「转型牛」主线的确立的基石。<br><br>如何发现被低估的股票？InvestingPro公允价值工具助你一臂之力。多维度估值模型，从现金流、营收、净利等数据对股票进行全方位估值。<br>此外，订阅InvestingPro，还将得到更多功能：<br>ProPicks AI：AI智能选股策略，战绩显赫。<br>股票筛选器：Pro版100+筛选条件，Pro+版超1000种指标，精准挖掘优质股票。<br>热门投资组合：沃伦·巴菲特、大空头和索罗斯（George Soros）投资组合，一键直达<br>点击此处进一步了解InvestingPro，领取超值优惠。<br></div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657980",
            "pub_date": "2025-02-05 12:04:12",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657970,
            "title": "联想(00992)发布DeepSeek一体机解决方案",
            "description": "<div> 智通财经APP获悉，2月5日，联想集团(00992)与沐曦股份联合发布基于DeepSeek大模型的一体机解决方案。该方案以“联想服务器/工作站+沐曦训推一体GPU+自主算法”为核心架构，配合联想AI <br>force智能体开发平台，推出智能体一体机与训推一体服务器双产品形态，率先实现从千亿参数大模型训练到场景化推理落地的全链条覆盖，为企业破解算力部署复杂、技术门槛高、安全可控难三大核心痛点提供了新路径。连日来，DeepSeek凭借其低成本、高性能的大模型研发成果引发全球广泛关注。该公司最新推出的R1模型已经比肩行业顶尖模型能力。在这一背景下，联想创新性推出两大产品：面向敏捷部署的DeepSeek智能体一体机采用ThinkStation PX工作站为载体，搭载沐曦曦思N260 <br>GPU。实测数据显示，在相同并发条件下，沐曦曦思N260 GPU在Qwen2.5-14B模型推理实测性能达到NVIDIA L20 GPU 的110%-130%, <br>可支持本地部署DeepSeek各种参数蒸馏模型推理。而面向更广泛场景的DeepSeek训推一体机，则基于联想问天WA5480 G3 <br>AI服务器，搭载8张曦云C500专业GPU，可为大模型训练和推理提供强大的算力支撑。基于联想ThinkStation PX的智能体一体机基于联想问天WA5480 G3 AI服务器的训推一体机软件生态的突破同样引人注目。联想AI <br>Force智能体开发平台通过“一体集成、私有化部署、简易运维”三大技术创新，重构企业级AI开发范式：在“一体集成”方面，平台深度融合DeepSeek等主流大模型库，提供预置多个行业知识图谱与标准化API接口，通过可视化拖拽界面，企业可将业务系统对接周期从数周缩短至小时级;“私有化部署”方案则确保数据安全与合规性，并具备高度定制化与再开发能力，支持与企业现有ERP、MES系统的无缝对接，并保留定制化开发接口;而“简易运维”特性使得用户开箱即用，大幅降低企业硬件采购与运维成本。联想AI Force智能体开发平台联想中国方案服务业务群“擎天”AI技术中心高级总监顾旭光强调，“联想提供智能化软硬一体平台，沐曦GPU提供硬件底座，DeepSeek模型构建智能内核，实现全链路硬件可信。在实际编程开发场景中，基于DeepSeek的代码生成功能实现35%及以上采纳率。”沐曦市场总经理吕剑飞对此补充道：“沐曦与联想将继续投入资源和研发力量，持续优化大模型的推理效率与训练性能，并为更多垂直行业场景提供定制化的应用模板。双方还计划与产业伙伴及开发者社区携手合作，推动更广泛、更深层次的落地。”</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657970",
            "pub_date": "2025-02-05 11:52:49",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657965,
            "title": "港股异动 | 宜搜科技(02550)放量大涨18% 近期发生多次存转仓异动 市场担忧公司难保港股通名单",
            "description": "<div> 智通财经APP获悉，宜搜科技(02550)盘中涨超18%，截至发稿，涨16.57%，报4.22港元，成交额1.54亿港元。值得注意的是，该股昨日全天成交额不足550万港元，今日出现明显放量迹象。公开资料显示，宜搜科技经营数字阅读平台服务、数字营销服务、网络游戏发行服务、其他数字内容服务等四条业务线。值得注意的是，宜搜科技近期发生多次存转仓异动。12月6日，该股发生存仓异动，存仓比例为17.64%，存入经纪商为中银国际证券；12月9日，再度发生转仓异动，存仓比例为5.98%，存入经纪商为老虎证券香港环球；12月11日及12日，该股均出现转仓异动，两日共转入港股通(沪)近14%比例股份。智通财经APP在《被2亿解禁“带崩”股价，两日跌四成的宜搜科技(02550)会不会打“保通”战？》中指出，在基本面表现不足的情况下，一定程度加大了宜搜主力资金接下来的护盘成本。待后续港股通开始施行“每日市值”新规，月底拉升的资本运作方式已然不适合。虽然目前宜搜科技的日平均流通市值仍能满足下一次的“保通”要求，但当前公司每日市值走势趋势却是离最低保通门槛越来越远。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657965",
            "pub_date": "2025-02-05 11:53:06",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657962,
            "title": "港股异动 | 汽车股今日普跌 车市竞争引发价格战担忧 小鹏汽车-W(09868)推五年0利息0首付购车政策",
            "description": "<div> 智通财经APP获悉，汽车股今日普跌，截至发稿，长城汽车(02333)跌3.49%，报12.16港元；理想汽车-W(02015)跌2.49%，报91.85港元；小鹏汽车-W(09868)跌1.07%，报65港元。消息面上，2月5日，小鹏汽车宣布推出行业唯一“五年0利息0首付”购车政策，至高贴息金额57000元。此前，蔚来汽车宣布，推出5年0息限时金融优惠。2025年2月1日至2月28日期间支付定金购车，还额外享多重购车优惠。值得注意的是，1月造车新势力销量排名突变，凭借平价车型小鹏MONA <br>M03，小鹏汽车1月销量反超理想汽车，成为新势力销量第一。乘联分会秘书长崔东树此前分析表示，新能源汽车规模呈现爆发式增长，单车批量大幅增大，单车成本明显下降，而且头部的竞争格局仍未稳定。因此，在这种高增长的市场中，2025年“价格战”仍将延续，并且将极其猛烈。交银国际预计，2025年新能源汽车渗透率有望进一步提升。但需谨慎2024年12月销量冲刺后车市进入销售淡季，车市竞争加剧引发价格战。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657962",
            "pub_date": "2025-02-05 11:53:17",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657935,
            "title": "港股异动 | 地平线机器人-B(09660)涨超5% 国内ADAS+AD渗透率持续提升 公司具备行业先发优势",
            "description": "<div> 智通财经APP获悉，地平线机器人-B(09660)涨超5%，截至发稿，涨5.39%，报4.89港元，成交额1.19亿港元。光大海外发布研报称，地平线机器人-W是领先的ADAS+AD解决方案供应商，于2024年10月登陆香港联交所上市。公司拥有“软硬结合”优势和行业先发优势，是国内领先的ADAS+AD解决方案供应商，具备一定的标的稀缺性和溢价空间。首次覆盖，给予公司“买入”评级。该行续指，欧盟、美国、日韩等多国/区域出台政策推动汽车智能化发展。另外，预计随着国内外L3相关责任认定的政策出台，L3级自动驾驶的渗透率将迎来向上拐点。根据公司招股说明书，预计2026年、2030年中国智能汽车销量分别达到2,040、2,980万台，ADAS+AD渗透率分别达81.2%、99.7%。2030年中国的高阶自动驾驶市场规模有望突破4,000亿元人民币。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657935",
            "pub_date": "2025-02-05 11:25:37",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}