{
    "data": [
        {
            "id": 3846605,
            "title": "US stock futures jump as Trump delays Canada, Mexico tariffs",
            "description": "<div>Investing.com- U.S. stock index futures rose sharply on Monday evening, with Wall Street set to rebound from recent losses after President Donald Trump delayed plans to impose trade tariffs on Canada and Mexico.<br>Futures surged after Wall Street ended above session lows on Monday, as investors were relieved by Trump agreeing to delay 25% trade tariffs against Canada and Mexico by 30 days. But Trump’s 10% duty on China is still set to take effect from Tuesday. <br>Investors also remained on edge over trade uncertainty under Trump, given that he has still expressed his intent to impose more trade duties, especially a 10% universal tariff.<br>S&P 500 Futures rose 0.6% to 6,058.25 points, while Nasdaq 100 Futures rose 0.8% to 21,570.75 points by 18:11 ET (23:11 GMT). Dow Jones Futures rose 0.4% to 44,760.0 points. <br>Trump delays Canada, Mexico tariffs by 30 days <br>Canadian President Justin Trudeau said on Monday that Trump had agreed to delay his planned tariffs against the country by 30 days, after a meeting between the two.<br>The announcement came just hours after Trump said tariffs against Mexico will be delayed by 30 days, following a “very friendly” call with Mexican President Claudia Sheinbaum.<br>Both countries agreed to Trump’s demands for tighter border controls. His recent tariff threats were driven chiefly by allegations that lax border controls in Canada and Mexico were facilitating the flow of illegal substances- specifically fentanyl- and undocumented immigrants into America. <br>But Trump’s 10% tariffs against China are still set to take effect from Tuesday. Beijing had largely opposed the duties and vowed retaliation.<br>Analysts warned that Trump’s tariffs- which will be paid by U.S. importers- could push up inflation and dampen economic growth in the coming months. Sticky inflation is also expected to give the Federal Reserve less impetus to cut interest rates. <br>Chicago Fed President Austan Goolsbee warned on Monday that uncertainty over Trump’s policies could further delay the central bank’s plans to cut interest rates. <br>Trump has still signaled his intent to impose higher tariffs against China, as well as a potential 10% duty on all U.S. imports. <br>Wall St ends above session lows; earnings in focus <br>Wall Street indexes had fallen sharply on Monday after Trump’s tariff threats, but ended above session lows after the tariffs appeared to be delayed. <br>U.S. stocks were still nursing losses from the prior week- where an extended rout in technology shares and growing signs of sticky inflation rattled risk appetite. <br>The S&P 500 fell 0.8% to 5,994.67 points, while the NASDAQ Composite fell 1.2% to 19,391.96 points. The Dow Jones Industrial Average fell 0.3% to 44,422.31 points.<br>Focus this week is squarely on the December quarter earnings season, with market heavyweights Alphabet Inc (NASDAQ:GOOGL) and Amazon.com Inc (NASDAQ:AMZN) set to report on Tuesday and Thursday, respectively. Prints from other majors including Advanced Micro Devices Inc (NASDAQ:AMD),  PayPal Holdings Inc  (NASDAQ:PYPL), Super Micro Computer Inc (NASDAQ:SMCI), Walt  Disney  Company (NYSE:DIS), and Qualcomm Incorporated (NASDAQ:QCOM) are also due in the coming days. <br>Beyond earnings, focus this week is also on key nonfarm payrolls data for January, due on Friday. The reading is likely to factor into expectations for interest rates.</div>",
            "link": "https://www.investing.com/news/stock-market-news/us-stock-futures-jump-as-trump-delays-canada-mexico-tariffs-3846605",
            "pub_date": "2025-02-04 07:56:23",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846550,
            "title": "Polaris Inc. credit outlook downgraded to negative at S&P due to weakened credit metrics",
            "description": "<div>Investing.com - Minnesota-based power sports vehicle manufacturer, Polaris (NYSE:PII) Inc., is anticipated to underperform previous revenue and EBITDA predictions for 2025. This is due to a decrease in planned off-road vehicle shipments, weak retail demand, and reduced margins. It is unlikely that the company will generate enough revenue and EBITDA in 2025 to keep leverage below the 3x downgrade threshold. This is due to a slump in purchases of discretionary leisure products, including power sports.Consequently, the rating outlook for Polaris has been revised to negative from stable at S&P Global, while the ‘BBB’ issuer credit rating and the ‘BBB’ issue-level rating on the company’s senior unsecured notes have been affirmed. The negative outlook is based on the expectation that S&P Global Ratings-adjusted debt to EBITDA will slightly exceed the 3x downgrade threshold in 2025. While Polaris is expected to use excess free cash flow to repay debt, future deleveraging will partly depend on a recovery in the power sports industry and stable macroeconomic conditions.In 2024, Polaris and the Powersports Industry faced a challenging retail environment, with year-over-year declines in total revenue of about 20%. North American powersports retail sales also fell by 8% in 2024 due to higher interest rates and a delayed replacement cycle. This trend is expected to continue through at least the first half of 2025. The company's 2025 guidance anticipates a decline in total revenue by a low single-digit percentage due to weak retail sales across the industry.Polaris' reduced revenue and profitability are expected to result in lower cash flows and weaker credit metrics than previously forecasted. In 2025, total revenue is expected to decrease in the low single-digit percent area. This is due to lower demand for recreational off-road vehicles, motorcycles, and snowmobiles, despite stable demand for utility vehicles and modest share growth in marine from new product launches.The company's EBITDA margin is expected to compress by about 170-200 basis points due to decreased shipping volumes and the reset of its profit-sharing program. These trends are likely to lead to an increase of leverage to the low-3x area in 2025.Polaris has a publicly stated net leverage target of 1x-2x, which supports eventual deleveraging and the ‘BBB’ rating. However, following lower-than-anticipated retail purchases of power sports products in 2024, Polaris ended the fiscal year with S&P Global Ratings-adjusted leverage of about 2.9x, above the high end of its stated policy range.Polaris' significant exposure to China for procurement of raw materials and to Mexico, where its largest factory is located, could lead to pressure on margins due to material tariffs. Although Polaris has the industry’s largest manufacturing footprint in the U.S., the relocation of production and procurement of materials in response to material tariffs could take some time.Despite these challenges, Polaris maintains a global leadership position in the power sports recreational market, reflecting successful innovation across its segments. The company's product portfolio provides good diversification, balancing the seasonal nature of some of its products.Polaris' history of successfully launching new products, spurred by its substantial investment in product innovation, is expected to position it well against competitors when the power sports industry recovers from its current downturn. The company's divestitures of unprofitable segments and plant efficiencies are expected to help improve margins once the power sports industry recovers.The negative outlook reflects the forecast for S&P Global Ratings-adjusted debt to EBITDA to increase above the 3x downgrade threshold through at least 2025. Any material deleveraging in 2026 is expected to be partly dependent on an increase in shipments spurred by a recovery in the power sports industry and stable macroeconomic conditions.The outlook could be revised to stable once Polaris can reduce leverage below the 3x net leverage downgrade threshold. An upgrade is viewed as unlikely, given Polaris' financial policy of targeting net debt to EBITDA in the 1x-2x range with the possibility of temporarily increasing its leverage to as high as 3x to fund growth through acquisitions.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.</div>",
            "link": "https://www.investing.com/news/stock-market-news/polaris-inc-credit-outlook-downgraded-to-negative-at-sp-due-to-weakened-credit-metrics-93CH-3846550",
            "pub_date": "2025-02-04 06:45:30",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846040,
            "title": "Ontario postpones threat to cancel Starlink deal after Canada tariffs reprieve",
            "description": "<div> By David Ljunggren OTTAWA (Reuters) -The Canadian province of Ontario on Monday said it was pausing a number of planned retaliatory measures against the United States, including the cancellation of a C$100 million ($68.12 million) contract with Elon Musk's Starlink. Premier Doug Ford (NYSE:F) made the announcement after U.S. President Donald Trump said he was postponing by 30 days a series of tariffs against imports from Canada. Earlier in the day, Ford had also said Ontario would ban U.S. companies from provincial contracts and order the province's liquor board to remove all American products from its shelves starting on Tuesday. \"We have some good news today. We have temporarily averted tariffs that would have severely damaged our economy, giving time for more negotiation and time for cooler heads to prevail,\" Ford said in a post on X. \"With the U.S. pausing tariffs, Ontario will also pause our retaliatory measures.\" Ontario is the most populous of the 10 provinces and Canada's industrial heartland. Under the terms of the deal, which Ontario signed last November, Starlink was to provide high-speed internet access to 15,000 eligible homes and businesses in more remote communities. Musk, a close Trump ally, is heading the U.S. President's drive to shrink the federal government. Musk had shrugged off Ford's threat, saying \"Oh well\" in a post on X. Trump had said he would impose a 25% tariff on virtually all Canadian imports except for oil, which faces a 10% surcharge. If prolonged, such measures would trigger a recession. The move generated widespread shock across Canada, which has traditionally prided itself on being a close U.S. ally and trading partner. Prime Minister Justin Trudeau on Saturday announced Canada would impose 25% tariffs on C$155 billion of U.S. goods in response to the U.S. measures. \"Make no mistake, Canada and Ontario continue to stare down the threat of tariffs ... so long as our trading relationship with our largest trading partner is up in the air, we will continue to see many potential projects frozen and projects that were already under way put at risk,\" said Ford.  </div>",
            "link": "https://www.investing.com/news/commodities-news/ontario-cancels-starlink-contract-in-latest-canadian-tariffs-protest-3846040",
            "pub_date": "2025-02-04 06:45:38",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846069,
            "title": "Fed officials see inflation risks from tariff surge",
            "description": "<div> By Michael S. Derby and Howard Schneider (Reuters) - The Trump administration's plan for trade tariffs come with inflation risks, two Federal Reserve officials warned on Monday, stopping short of saying how that affects their thinking on monetary policy in a climate of uncertainty.  \"The kind of broad-based tariffs that were announced over the weekend, one would expect to have an impact on prices,\" Federal Reserve Bank of Boston President Collins said in an interview with CNBC, adding that \"with broad-based tariffs, you actually would not only see increases in prices of final goods, but also a number of intermediate goods.\"  Collins, however, noted that there's not a lot of experience on how mega tariffs impact the economy in the modern age, which makes it hard for the Fed to know exactly how things will play out. She noted it is possible that the Fed could even shrug off a one time increase in inflation tied to the tariffs, although even that was uncertain.  Speaking separately, Atlanta Fed President Raphael Bostic warned his business contacts were planning to pass through any rising costs related to the tariffs.  \"The ultimate question about whether that is significantly inflationary depends on exactly how it plays out,\" as there are scenarios where the Fed may be able to shrug off these increases and ones where it might not be able to. \"To the extent that were to impact things like inflation expectations then you'd have to,\" Bostic told reporters after a speech.  Trump on Saturday slapped tariffs on the three largest U.S. trade partners, announcing a 25% duty on goods from Mexico and Canada and an additional 10% duty on imports from China. Canada retaliated with its own tariffs on a range of U.S. products.  On Monday, Trump said he was suspending the tariffs on Mexico for a month after President Claudia Sheinbaum agreed to send soldiers to the U.S.-Mexican border to curb drug trafficking. Later that same day, Trump also granted Canada at least a 30-day reprieve after that nation agreed to create a special czar to target the smuggling of fentanyl while ensuring permanent monitoring of the shared border.  In the fluid situation, economists noted that broadly speaking, the tariffs Trump has been pursuing will push up inflation and depress growth.  Analysts at the Peterson Institute for International Economics said Monday that the full suite of tariffs on the three nations, if implemented, will cost the typical American household an additional $1,200 a year in higher costs. Meanwhile, ING chief international economist James Knightley highlighted the uneven nature of who will bear the impact of tariffs, which are effectively tax increases on American citizens, as tariffs are paid by the citizens of importing nations.  \"Much of the cost increase caused by tariffs will be passed onto U.S. consumers,\" Knightley said, adding \"the burden will fall disproportionately on low-income households who spend more of their income on physical goods relative to higher income households.\" 'NO URGENCY'  The Federal Reserve, which cut interest rates by a full percentage point last year, held its policy rate steady last week, flagging uncertainty in the economic outlook. Fed Chair Jerome Powell said after the meeting that when it comes to tariffs, \"we need to let those policies be articulated before we can even begin to make a plausible assessment of what their implications for the economy will be.\"  Collins, who is a voting member of the Fed's rate-setting committee this year, told CNBC that Fed policy is well-positioned to deal with what lies ahead for the economy. She noted that \"it's really appropriate for policy to be patient, careful, and there's no urgency for making additional adjustments, especially given all of the uncertainty, even though, of course, we're still somewhat restrictive\" with the current stance of interest rates. Bostic also signaled he was ready to move to the sidelines for the time being. There is \"a ton of uncertainty in a ton of space,\" Bostic told a Rotary Club of Atlanta meeting, adding \"there are a lot of things I am going to wait and see about ... I'd be very satisfied to wait for a while\" with rates at their current levels.   Collins left the door open to further rate cuts, saying \"I certainly would see additional ... normalization, in terms of what the policy stance is,\" without providing a time frame. Even before the tariff announcement Wall Street had been reckoning it would be some time before the Fed found the space to cut rates again. Trump's tariffs, if implemented, may close the door to any further easing, although for now financial markets are still priced for some modest easing.  In her television interview, Collins said the ultimate policy response by the Fed to the impact of the tariffs is unclear, though she noted it might be possible for central bank officials to not react at all.  A permanent tariff would likely \"cause a rise in a price level,\" Collins said. \"That's a short-term impact on inflation. Unless there are additional impacts that, if expectations remained well-anchored, you'd expect the Federal Reserve would try to look through\" and leave monetary policy unchanged.  </div>",
            "link": "https://www.investing.com/news/economy-news/feds-collins-says-fed-can-be-patient-on-rates-amid-tariff-uncertainty-3846069",
            "pub_date": "2025-02-04 06:51:48",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846563,
            "title": "Fed's Goolsbee urges caution on rate cuts amid uncertainties",
            "description": "<div>Investing.com - Fed's Goolsbee has advised caution in the approach to cutting rates due to prevailing uncertainties, according to a recent Marketplace Radio interview. He expressed concerns about potential inflation and the difficulty in distinguishing whether rising prices are a sign of economic overheating or a one-time effect of tariffs.Goolsbee also underscored the need for thorough consideration if fiscal decisions impact prices or employment. He highlighted the strong growth and robust consumer base that the economy currently enjoys.The potential need to slow the pace of rate cuts amid uncertainty was also mentioned by Goolsbee. Furthermore, he shared that his concerns are rooted in discussions with business people, including those in the auto industry.Goolsbee's comments come as the Fed grapples with the best approach to navigate the uncertain economic landscape, with the potential impacts of inflation and tariff effects on prices being key considerations. His emphasis on caution and prudence underscores the complex decision-making process involved in adjusting rates.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.</div>",
            "link": "https://www.investing.com/news/stock-market-news/feds-goolsbee-urges-caution-on-rate-cuts-amid-uncertainties-93CH-3846563",
            "pub_date": "2025-02-04 06:54:28",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846141,
            "title": "Trump orders creation of US sovereign wealth fund, says it could buy TikTok",
            "description": "<div> By Trevor Hunnicutt and Pete Schroeder WASHINGTON (Reuters) -U.S. President Donald Trump signed an executive order on Monday ordering the creation of a sovereign wealth fund within the next year, saying it could potentially buy the short video app TikTok. If created, the sovereign wealth fund could place the U.S. alongside numerous other countries, particularly in the Middle East and Asia, that have launched similar funds as a way to make direct investments with government dollars. The text of the executive order was sparse on details, and simply directed the Treasury and Commerce Departments to submit a plan for such a fund within 90 days, including recommendations on \"funding mechanisms, investment strategies, fund structure, and a governance model.\"  Typically such funds rely on a country's budget surplus to make investments, but the U.S. operates at a deficit. Its creation also would likely require approval from Congress. \"We're going to create a lot of wealth for the fund,\" Trump told reporters. \"And I think it's about time that this country had a sovereign wealth fund.\" Trump had previously floated such a government investment vehicle as a presidential candidate, saying it could fund \"great national endeavors\" like infrastructure projects such as highways and airports, manufacturing, and medical research.  Administration officials did not say how the fund would operate or be financed, but Trump has previously said it could be funded by \"tariffs and other intelligent things.\"  Treasury Secretary Scott Bessent told reporters the fund would be set up within the next 12 months. \"We're going to monetize the asset side of the U.S. balance sheet for the American people,\" Bessent said. \"There'll be a combination of liquid assets, assets that we have in this country as we work to bring them out for the American people.\" One approach would be to convert the U.S. International Development Finance Corp (DFC) to function similar to a sovereign wealth fund, which the Trump administration reportedly considered in recent months, Bloomberg News reported. The DFC is a government agency that currently partners with private parties to finance projects in the developing world. Trump announced Friday he was nominating Benjamin Black to head that development agency. Black, a managing partner at investment firm Fortinbras Enterprises, is the son of Leon Black, the co-founder of asset management firm Apollo Global Management (NYSE:APO). The Biden administration also was considering establishing such a fund prior to Trump's election in November, according to The  New York Times  (NYSE:NYT) and Financial Times. But precisely how such a fund would be structured, and funded, remained unclear. Several experts said Congress would likely need to authorize new funding given the lack of an existing surplus to tap. The order directed officials to review any need for legislation. Clemence Landers, a former Treasury official who is now with the Center for Global Development, said there has been talk of repurposing the DFC but setting up such a fund would require Congress.  “Obviously you can't establish an institution by executive order and more to the point is you can't fund an institution by executive order,” she said. Investors said the news came as a surprise. \"Creating a sovereign wealth fund suggests that a country has savings that will go up and can be allocated to this,\" said Colin Graham, head of multi-asset strategies at Robeco in London. \"The economic rules of thumb don't add up.\"  There are over 90 such funds across the world managing over $8 trillion in assets, according to the International Forum of Sovereign Wealth Funds. Numerous U.S. states, including Alaska, Texas and New Mexico also have their own wealth funds, which help fund various priorities, including education and tax relief. They frequently rely on revenue raised by natural resources, like oil or land. In another surprise twist, Trump suggested the wealth fund could buy TikTok, whose fate has been up in the air since a law requiring its Chinese owner ByteDance to either sell it on national security grounds or face a ban took effect on Jan. 19.  Trump, after taking office on Jan. 20, signed an executive order seeking to delay by 75 days the enforcement of the law. Trump has said that he was in talks with multiple people over TikTok's purchase and would likely have a decision on the app's future in February. The popular app has about 170 million American users.  \"We're going to be doing something, perhaps with TikTok, and perhaps not,\" Trump said. \"If we make the right deal, we'll do it. Otherwise, we won't...we might put that in the sovereign wealth fund.\" </div>",
            "link": "https://www.investing.com/news/economy-news/trump-signs-executive-order-to-create-sovereign-wealth-fund-3846141",
            "pub_date": "2025-02-04 06:55:50",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846565,
            "title": "Buy this stock after DOGE-fueled selloff: Raymond James",
            "description": "<div>Raymond James analysts upgraded Booz Allen Hamilton (NYSE:BAH) to Outperform in a note Monday, citing a favorable risk-reward balance following a \"30% post-election decline\" linked to DOGE concerns. The firm set a price target of $150, arguing that \"fundamentals continue to track at a historically strong rate\" and that investor sentiment is shifting away from DOGE-related fears toward tariff concerns.The analysts see historical precedent supporting a rebound in BAH shares. \"In the year leading into sequestration, BAH was down ~13%, while once sequestration took effect, shares increased 28% over one year and had a 4-year CAGR of ~25% with no down years,\" said the firm. They believe that while DOGE presents challenges, the pullback in Booz Allen's stock is now nearing an inflection point, stating, \"We believe we are within ~10% of a bottom for Booz shares with upside >3x the risk.\"In valuation terms, they state the stock is now trading at a \"a 21% discount to its 5-year 1.1x average\" and at \"13.1x vs. 5-year average of 15.5x.\" The DOGE-driven decline is said to have led to a multiple compression of \"nearly 6-turns,\" significantly exceeding historical compression levels of 2.3x.Additionally, Raymond James states the company has a \"freshly minted $1B buyback\" in place, which analysts estimate will \"retire 6% of shares.\" This financial flexibility is expected to support the stock in the near term.Looking ahead, Raymond James forecasts backlog growth of \"about 10% y/y,\" with hiring picking up to support organic growth near 9% in FY26. The firm believes that Booz Allen's mix of business, strong backlog, and improving investor sentiment position it well for a recovery.</div>",
            "link": "https://www.investing.com/news/pro/buy-this-stock-after-dogefueled-selloff-raymond-james-432SI-3846565",
            "pub_date": "2025-02-04 07:01:01",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846559,
            "title": "Target is sued for defrauding shareholders about DEI",
            "description": "<div> By Jonathan Stempel (Reuters) -  Target  has been sued for allegedly concealing the risks of its diversity and social initiatives, leading to a backlash that caused customers to flee and the stock price of the Minneapolis-based retailer to plummet. In a proposed class action on Friday, shareholders led by the City of Riviera Beach Police Pension Fund in Florida said Target defrauded them into paying inflated prices for its stock and unknowingly supporting management's \"misuse of investor funds to serve political and social goals.\" The lawsuit said the retailer, CEO Brian Cornell and other officials failed to disclose the risk of consumer boycotts stemming from Target's Environmental, Social and Governance and Diversity, Equity and Inclusion initiatives. It also said Target concealed backlash from its May 2023 Pride Month campaign, which led the retailer to remove some LGBTQ-themed merchandise after in-store confrontations led some employees to fear for their safety. Target's share price fell 22% on Nov. 20, 2024, wiping out about $15.7 billion of market value, after it forecast disappointing profit and holiday sales. Shareholders said Target's underperformance stood \"in stark contrast\" to results at rival Walmart (NYSE:WMT), and reflected \"continued backlash from its campaigns.\" Target did not immediately respond on Monday to requests for comment. The lawsuit in the Fort Myers, Florida federal court seeks damages for Target shareholders from Aug. 26, 2022 to Nov. 19, 2024. It was filed after Target said on Jan. 24 it would end DEI initiatives this year, including a program to support Black-owned businesses that it adopted following the 2020 murder of George Floyd by a Minneapolis police officer. Target joined Walmart, Amazon.com (NASDAQ:AMZN) and some other prominent companies to scale back such initiatives, which have been attacked by many conservatives including U.S. President Donald Trump. The case is City of Riviera Beach Police Pension Fund v Target Corp (NYSE:TGT) et al, U.S. District Court, Middle District of Florida, No. 25-00085.  </div>",
            "link": "https://www.investing.com/news/stock-market-news/target-is-sued-for-defrauding-shareholders-about-dei-3846559",
            "pub_date": "2025-02-04 06:56:17",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846190,
            "title": "Trump warns China of higher tariffs ahead of talks",
            "description": "<div>Investing.com - President Donald Trump warned on Monday that the U.S. could hike tariffs on China beyond the 10% levy he imposed on Saturday. <br>Trump added that talks with China could get underway \"over the next 24 hours.\"<br>The news comes just as the president delayed tariffs on Mexico for a month following a successful call with Mexican President Claudia Sheinbaum, in which the latter agreed to send 10,000 Mexican troops to shore up the U.S.-Mexico border. <br>Trump described the 10% tariff on China announced on Saturday as an \"opening salvo,\" but markets are hoping for a positive outcome from the talks with Beijing to avoid another US-Sino trade war seen during the first Trump administration. </div>",
            "link": "https://www.investing.com/news/economy-news/trump-warns-china-of-higher-tariffs-ahead-of-talks-3846190",
            "pub_date": "2025-02-04 03:36:41",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846267,
            "title": "Palantir reports upbeat guidance after Q4 results top estimates; shares surge 20%",
            "description": "<div>Investing.com - Palantir Technologies reported Monday upbeat guidance after reporting fourth-quarter results that markedly topped Wall Street estimates as the data analytics company continued to win new business amid ongoing AI-led demand,.<br>Palantir Technologies Inc (NASDAQ:PLTR) jumped more than 22% in afterhours trading following the results.  <br>For the three months ended Dec. 31, Palantir reported Q4 adjusted earnings of $0.14 a share on revenue of $827.5 million, beating analysts estimates for adjusted EPS of $0.11 on revenue of $778.2M. <br> Total  (EPA:TTEF) revenue for the quarter rose 36% year-over-year, while U.S. revenue grew 52%. U.S. government revenue grew 45% year-over-year, while U.S. commercial revenue grew 64% year-over-year.<br>Customer count grew 43% year-over-year as the company closed 129 deals of at least $1 million, 58 deals of at least $5 million, and 32 deals of at least $10 million. <br>“Our business results continue to astound, demonstrating our deepening position at the center of the AI revolution. Our early insights surrounding the commoditization of large language models have evolved from theory to fact,” said Alexander C. Karp, Co-Founder and Chief Executive Officer of  Palantir Technologies Inc . <br>For 2025, the company is guiding revenue in the range of $3.741B to $3.757B, beating estimates of $3.53B.<br>For Q1, the company guided revenue between $858M to $862M, compared with analyst expectations for $799.4M. <br>(Yasin Ebrahim also contributed to this reporting)</div>",
            "link": "https://www.investing.com/news/stock-market-news/palantir-reports-upbeat-guidance-after-q4-results-top-estimates-shares-surge-3846267",
            "pub_date": "2025-02-04 06:32:12",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        }
    ]
}