{
    "data": [
        {
            "id": 2657793,
            "title": "黄金交易提醒：关税战提振避险买需，金价连续四个交易日刷新历史高点",
            "description": "<div><br>周三（2月5日）亚市早盘，现货黄金在历史高位附近窄幅震荡，目前交投于2841.37美元/盎司附近。金价周二再创历史新高至2845.30美元/盎司，为连续四个交易日刷新历史高点，收报2841.85美元/盎司，受投资者寻求避险资产推动，此前中国针对美国总统特朗普的关税措施采取了报复性关税措施。另外，美国12月职位空缺创14个月来最大降幅，也拖累美元和美债收益率下跌，给金价提供上涨动能。RJO Futures的高级市场策略师Bob Haberkorn说道，\"就像周一那样，传来了关税消息；现在，我认为这是比周二传出的任何其他事情和数据更主要的推动力，（不过）我认为它们都将被关税新闻盖过风头。\"Haberkorn 说：\"本周美元走强，但随着美元走低，这也肯定会对金价有所帮助。\"美元周二走低0.4%，收报107.99，因为黄金以美元计价，美元下跌支撑金价上涨。因美国总统特朗普的关税威胁被更多地解读为一种谈判策略而非最终目标，此前一天他暂停了计划对墨西哥和加拿大征收关税的行动。然而，新一届特朗普政府从周二凌晨开始对从中国进口的商品加征10%的关税，分析师表示，他们预计对关税发展的高度敏感性和波动性将持续存在。\"我们仍在关注对中国加征10%关税以及中国的反制行动，这将为市场重新增加一定的风险溢价，\"Monex USA外汇交易员Helen Given说。“我们将看看后续是否会有任何谈判，像之前墨西哥和加拿大的情况那样，关税紧张局势可能会有所缓和。但现在看来，与中国的贸易战又开始了。”北京周二对部分美国进口商品征收关税，对美国新一轮关税迅速采取反制行动，增加了世界两大经济体摊牌的风险。三菱日联金融高级汇市分析师Lee Hardman说，“北京的行动暗示，中国对特朗普最新关税措施的回应持谨慎态度，并未采取过于强硬的回击，同时为未来的谈判留有余地。”市场还在关注特朗普对欧盟的关税威胁。高盛分析师在一份研究报告中说：\"虽然对欧盟征收更广泛的全面关税的前景（现在）非常不确定，但只要关税方面的反复继续下去，长期的贸易不确定性环境本身就会对欧元造成压力。欧盟贸易负责人塞夫科维奇（Maros Sefcovic）周二表示，欧盟希望就美国总统特朗普计划征收的关税与美方迅速接触；欧盟执委会主席冯德莱恩(Ursula von der Leyen)则是预测与华盛顿的谈判将是艰难的。欧盟执委会副主席塞夫科维奇在欧盟部长级会议上表示，希望\"尽早接触\"，并正在等待特朗普对美国商务部长被提名人卢特尼克(Howard Lutnick)以及贸易代表被提名人格里尔(Jamieson Greer)的任命确认。塞夫科维奇对记者表示：\"我们已经准备好立即进行接触，希望藉由这种早期接触，避免采取会给世界最重要的贸易和投资关系带来许多干扰的措施。\"冯德莱恩表示，当务之急在于处理欧盟和美国利益交汇的领域，例如关键供应链和新兴技术，并称欧盟已准备好进行艰难的谈判。她在布鲁塞尔的演讲中表示，\"我们将以开放与务实的态度看待实现这一目标的方法。但我们同样会明确表示，我们将始终维护自身利益\"。白宫贸易顾问纳瓦罗(Peter Navarro)表示，欧洲在汽车增值税问题上与美国针锋相对，显示出谈判的艰困程度。欧盟国家对国内外所有汽车的销售都征收增值税。欧盟官员表示，与特朗普新政府的接触有限，并指出特朗普挑选的高级职位人选获得确认前无法进行对话。自特朗普就职以来，冯德莱恩和特朗普一直没有联系。特朗普已表示，欧盟是下一个目标。他曾多次抱怨美国与欧盟的货物贸易逆差。纳瓦罗认为此一数字为 3500 亿美元。塞夫科维奇表示，包括服务在内的逆差约为500亿欧元，或占欧盟与美国每年1.5万亿欧元贸易总额的3%左右，而欧美之间数以百万计的工作岗位都依赖于这种开放的贸易关系。塞夫科维奇表示：\"我们相信，通过富有建设性的接触和讨论，将能解决这个问题。\"经济数据方面，美国12月职位空缺创14个月来最大降幅，这也拖累美元和美债收益率，给金价提供上涨动能。但稳定的招聘和低裁员暗示就业市场并未突然放缓，美联储可能至少要到6月才会降息。美国劳工部周二公布的职位空缺及劳动力流动调查(JOLTS)显示，每个失业者对应1.1个职位空缺，低于11月的1.15个。美联储主席鲍威尔上周对记者称，“我们不需要急于调整我们的政策立场。“Brean Capital高级经济顾问Conrad DeQuadros表示，“美联储官员可能会将这份报告判断为暗示就业市场已从先前的过热状态降温，但相对于现有工人供应而言，就业需求依然稳固。”美国劳工统计局表示，截至12月最后一天，衡量劳动力需求的职位空缺减少55.6万个，至760万个。这是2023年10月以来的最大降幅。11月职位空缺数上修至815.6万个，前值为809.8万个。经济学家此前12月预计将有800万个职位空缺。职位空缺数较此前一年减少130万个，但仍高于2019年的平均水平。职位空缺率从11月的4.9%降至4.5%。员工数在10至49人的企业职位空缺降幅最大，其次是员工数为50至249人的企业。美国国债收益率周二在震荡交投中下滑，兼受到围绕美国政府贸易政策的持续不确定性的拖累，此前有关关税的诸多头条新闻不断涌现，而最终加拿大和墨西哥获得为期30天的关税暂缓执行。10年期美债收益率周二尾盘下跌2.8个基点，报4.515% ，周一曾跌至12月中旬以来的最低点。该收益率被市场视作无风险收益率，也是持有黄金的机会成本，收益率下降会支撑金价。LPL Financial首席固定收益策略师Lawrence Gillum表示：\"未来几个季度内，市场将不断在关税与威胁之间反复权衡——哪些是切实可行的政策，哪些只是虚张声势的恫吓，这种拉锯会持续上演。\"\"我仍然认为，10年期债券收益率今年晚些时候可能会跌破4%，但这实际上是以经济放缓为前提的，\"Gillum说：\"如果数据继续保持稳定，我们没有理由不在4.50%至5%之间交易。\"Truist Advisory Services 固定收益部董事总经理 Chip Hughey 说：\"尽管市场预期收益率将进一步下行，但政策缺乏明确性正令中长期投资者愈发趋向观望。\"与此同时，美国利率期货市场预计今年大约降息46个基点，即几乎两次降息，每次 25 个基点。根据伦敦证券交易所集团(LSEG)的计算，这一数字高于周一晚些时候的 41 个基点，首次降息可能发生在美联储 6 月或 7 月的政策会议上。投资者的焦点现在转向周三的 ADP 就业报告、周五的就业报告以及多位美联储官员的讲话。（现货黄金日线图，来源：易汇通）北京时间08:06，现货黄金现报2841.37美元/盎司。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2657793",
            "pub_date": "2025-02-05 08:20:15",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657758,
            "title": "2月5日财经早餐：避险资产推动，金价再创新高逼近2850，美国打压伊朗石油出口降至零",
            "description": "<div><br>周三（北京时间2月5日），现货黄金交投于2841.26附近，金价周二再创历史新高，受投资者寻求避险资产推动；美原油交投于72.72美元/桶附近，油价周二涨跌互现，受关税影响，且美国总统特朗普恢复了对伊朗的 \"最大压力\"行动，一位美国官员称，此举旨在将伊朗的石油出口降至零。道琼斯工业指数周二收盘上涨0.30%，至44,556.04点；标普500指数上涨0.72%，至6,037.88点；纳斯达克指数上涨1.35%，至19,654.02点。日内重点关注：中国1月财新服务业PMI、英国1月SPGI服务业PMI终值、美国1月ADP就业人数变动、美国12月贸易帐、美国1月ISM非制造业PMI、EIA数据，以及新年假期归来首日，受关税影响，市场消息面诸多，需要关注。股市美国三大股指周二收高，受能源股推动，在特朗普总统推迟对加拿大和墨西哥征收关税后，投资者看到了贸易局势感到乐观的理由。能源板块领涨，上涨 2.18%，公用事业板块和主要消费品板块跌幅居前。特朗普上周末表示，将对来自墨西哥和加拿大的商品征收25%的关税，但在周一同意缓期30天。CFRA Research首席投资策略师 Sam Stovall称：\"总统这么快就向墨西哥和加拿大提出了30天的缓期，所以你会觉得，也许他真正想要的是一个快速的胜利宣言，而从贸易角度来看，这并不会改变什么。投资者今天已经松了一口气，我们将看看一个月后他们还能不能继续这样。\"强劲的企业业绩也提振了投资者的乐观情绪。根据标普的业绩统计，在已公布第四季度盈利的211家标普500指数成分股公司中，76.8%的公司业绩超过了分析师的预期。数据分析公司Palantir的股价暴涨了24%，此前该公司预测第一季度和全年营收将超过华尔街的预期。与此同时，Alphabet在公布季度业绩前上涨了2.6%，但在收盘后公布的营收未达预期，部分原因是其云计算业务放缓。该股在盘后交易中急挫超过7%。三位美联储官员周一警告称，贸易关税带来了通胀风险，其中一位官员认为，价格前景的不确定性要求比预期更慢的降息速度。美国劳工部的一份报告显示，12月份美国的职位空缺为760万个，而路透访查的经济学家预计为800万个。在业绩驱动的走势中，百事可乐下跌了4.5%，此前该公司预测年度获利低于预期，且季度营收未达预期。雅诗兰黛暴跌16.1%，因这家化妆品公司在需求疲软的情况下公布了又一个疲软的季度，并宣布裁员。金市金价周二再创历史新高，受投资者寻求避险资产推动，现货金上涨1.1%，至每盎司2,844.56美元，盘初曾触及2,845.14美元的纪录高位。美国期金收高0.7%，报2,875.80美元。RJO Futures的高级市场策略师Bob Haberkorn说道，就像隔夜那样，传来了关税消息；现在，我认为这是比今天传出的任何其他事情和数据更主要的推动力，（不过）我认为它们都将被关税新闻盖过风头，本周美元走强，但随着美元走低，这也肯定会对金价有所帮助。投资者的焦点现在转向周三的 ADP 就业报告、周五的就业报告以及多位美联储官员的讲话。现货白银上涨2.5%，至每盎司32.33美元。铂金涨 0.4%，至 967.94 美元；钯金跌 1.3%，至 994 美元。油市两大指标原油周二涨跌互现，受关税影响，且美国总统特朗普恢复了对伊朗的 \"最大压力\"行动，一位美国官员称，此举旨在将伊朗的石油出口降至零。特朗普在会见以色列总理内塔尼亚胡之前签署了总统备忘录，命令美国财政部长对伊朗施加\"最大经济压力\"，包括制裁和执行机制。美国原油期货收跌0.63%，结算价报每桶72.70美元。布伦特原油期货收涨0.32%，结算价报 76.20 美元。Price Futures Group分析师Phil Flynn称：\"石油跌至交易区间下端附近是因为关税报复行动，随后回升的原因是对伊朗的'最大压力'政策。投资者正在等待美国石油协会(API)公布库存数据。汇市美元周二走低，因美国总统特朗普的关税威胁被更多地解读为一种谈判策略而非最终目标，此前一天他暂停了计划对墨西哥和加拿大征收关税的行动。外汇分析师表示，他们预计对关税发展的高度敏感性和波动性将持续存在。衡量美元兑一篮子六种主要货币加权值的美元指数下跌0.56%，报107.97，而加元走弱，墨西哥比索走强。欧元小幅上涨，华盛顿警告称，欧盟可能是下一个被征收贸易关税的地区，人们普遍预计这将推高美国的通胀，使美国利率在更长时间内保持在较高水平，从而支撑美元。澳元上涨0.5%，至0.626美元，远高于周一触及的低点0.6085美元，这是自2020年4月以来的最弱水平。欧元兑美元涨 0.37%，报 1.038 美元，市场参与者关注欧元/美元平价水平。几位分析师最近表示，美国关税将对欧元区产生通缩效应。高盛分析师在一份研究报告中说：\"虽然对欧盟征收更广泛的全面关税的前景（现在）非常不确定，但只要关税方面的反复继续下去，长期的贸易不确定性环境本身就会对欧元造成压力。加元兑美元下跌 0.81%，至 1.43 加元，稍早从周一触及的2003 年以来的新低1.4792 加元大幅反弹。墨西哥比索兑美元上涨 1.06%，至 20.546披索，周一跳涨超过 1.5%。美元兑日元上涨近 0.3%，报 154.290 日元 ，日元被视为避险货币，美元在近期上涨后吸引力下降。国际要闻特朗普将恢复对伊朗“最大施压” 称愿意会见伊朗领导人当地时间2月4日，美国总统特朗普签署了一项旨在恢复对伊朗“最大施压”政策的指令。特朗普表示，愿意会见伊朗领导人，并努力说服伊朗放弃发展核武器的努力。特朗普还表示，伊朗距离拥有核武器“太近了”，美国有权阻止伊朗向其他国家出售石油。（央视）美国卫生机构因特朗普下令删除健康数据而遭起诉当地时间2月4日，美国医生组织对美国人事管理办公室、疾病控制和预防中心、食品药品监督管理局和卫生与公众服务部提起诉讼，称这些机构删除数据“剥夺了”医生和研究人员“获取治疗患者所需信息的权限”，并造成了公共卫生紧急情况的“科学数据危险缺口”。（央视）   冯德莱恩：欧盟将做好与美国艰难谈判的准备欧盟委员会主席冯德莱恩4日在欧盟大使会议上表示，欧盟将做好在必要时与美国进行艰难谈判的准备，同时始终坚定维护自身利益。冯德莱恩表示，欧洲企业在美国雇佣了350万名员工，美国100万个就业岗位直接依赖于与欧洲的贸易。欧美双边年贸易总额达1.5万亿美元，彼此利益攸关。跨大西洋伙伴关系对双方都至关重要。国际原子能机构总干事视察乌变电站 称情况危急当地时间2月4日自乌克兰方面获悉，国际原子能机构总干事格罗西一行已视察了乌克兰9个对核电站运行至关重要的变电站，并评估称情况相当危急。此外有报道称，格罗西在当天早些时候视察了基辅州的变电站后表示，该变电站对核安全至关重要。他同时表示，变电站受到直接袭击以及停电都可能导致核事故。国际原子能机构此行将评估影响，并提供支持和帮助以防范核事故风险。美国12月职位空缺降至三个月低点 与劳动力市场逐步放缓相符美国12月职位空缺降至三个月低点，与劳动力市场逐步放缓相符。美国劳工统计局周二公布的职位空缺和劳动力流动调查(JOLTS)显示，职位空缺数从11月修正后的816万降至760万。这一数字低于几乎所有接受彭博调查的经济学家的预期。已有2万美国联邦雇员接受特朗普的“买断”裁员计划 数字或继续上升据报道，一位美国高级政府官员表示，大约有2万名联邦工作人员接受了特朗普政府上周提出的“买断”提议。这是一个相当大的数字，约占联邦雇员的1%，但仍远低于裁员5%至10%的目标。这一提议将持续到周四，意味着尽管工会和其他方面强烈反对，但接受“买断”计划的人数可能会上升。“我们预计会有更多人接受提议。如果你看到美国国际开发署正在发生的事情，你就会发现这只是拼图的一部分。”这位官员称。此前，白宫向联邦员工发出通知，要求员工在2月6日之前决定是全职回归办公室还是选择辞职。若选择辞职，则可获得8个月的全额工资和福利，同时在此期间免于面对面工作要求。强制要求员工返回办公室将导致5%-10%的联邦员工辞职，并预期这一政策能够每年节省高达1000亿美元的开支。特朗普政府推进关闭教育部当地时间2月4日，据美国有线电视新闻网报道，两位知情人士表示，美国特朗普政府已开始起草行政命令，以启动裁撤美国教育部的程序。消息人士称，该命令将指示教育部长制定一项计划，通过行政行动削减教育部。特朗普还将推动国会通过立法来关闭该部门。特朗普表示，他希望他挑选的教育部长琳达·麦克马洪“让自己失业”。 据悉，这是特朗普履行竞选承诺的最新举措。在竞选过程中，特朗普多次指出教育部是联邦政府越权的标志，特朗普主张让各州管理学校。（央视）国内要闻低空经济为经济发展添活力 2026年市场规模或超万亿2024年3月，低空经济首次写入政府工作报告，定位为新增长引擎。低空经济包括低空基础设施建设、低空航空器制造（飞行器制造）、低空运营服务、低空飞行保障为主的四大板块。从地上跑到天上飞，低空经济能有效激活立体空间，重塑交通、物流方式，大大提升服务效率。 随着低空商业化需求的增加、技术的日益成熟，在政策的助推下，低空经济在国内迅速崛起，发展潜力较大，有望成为经济发展的重要引擎。 赛迪顾问测算，2024年我国低空经济规模预计可达6702.5亿元，预计2025年将达到8591.7亿元，乐观预计到2026年突破万亿元。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2657758",
            "pub_date": "2025-02-05 07:40:09",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657751,
            "title": "智通港股通资金流向统计(T+2)|2月5日",
            "description": "<div> 智通财经APP数据显示，1月23日,盈富基金（02800）、恒生中国企业（02828）、腾讯控股（00700）南向资金净流入金额位列市场前三，分别净流入34.71 亿、12.08 亿、6.46 亿中芯国际（00981）、中国移动（00941）、美图公司（01357）南向资金净流出金额位列市场前三，分别净流出-9.19 亿、-2.71 亿、-1.95 亿在净流入比方面，康基医疗（09997）、现代牧业（01117）、中船防务（00317）以272.66%、265.60%、195.43%位列市场前三。在净流出比方面，金风科技（02208）、美图公司（01357）、青岛银行（03866）以-228.20%、-198.24%、-165.72%位列市场前三。前10大资金净流入榜<br>\t\t<br>\t\t\t<br>\t\t\t\t股票名称<br>\t\t\t\t净流入(元)↓<br>\t\t\t\t净流入比<br>\t\t\t\t收盘价<br>\t\t\t<br>\t\t\t盈富基金(02800)34.71 亿27.34%19.900（-0.35%）恒生中国企业(02828)12.08 亿22.56%73.360（-0.11%）腾讯控股(00700)6.46 亿7.95%381.200（-0.57%）工商银行 (SS:601398)(01398)5.45 亿22.70%5.110（+2.61%）美团-W(03690)3.08 亿7.93%151.100（-0.92%）中国银行 (SS:601988)(03988)2.54 亿21.60%3.960（+1.80%）优必选(09880)2.48 亿57.23%58.950（-0.92%）舜宇光学科技(02382)2.31 亿37.14%67.600（-3.22%）亚盛医药-B(06855)2.27 亿78.98%41.750（-5.11%）小米集团-W(01810)2.17 亿4.99%34.500（-2.27%）<br>\t\t<br>\t前10大资金净流出榜<br>\t\t<br>\t\t\t<br>\t\t\t\t股票名称<br>\t\t\t\t净流出(元)↓<br>\t\t\t\t净流出比<br>\t\t\t\t收盘价<br>\t\t\t<br>\t\t\t中芯国际 (SS:688981)(00981)-9.19 亿-8.95%39.050（-7.24%）中国移动 (HK:0941)(00941)-2.71 亿-20.45%74.850（-0.20%）美图公司(01357)-1.95 亿-198.24%3.080（-1.28%）华润啤酒(00291)-8464.28 万-21.05%23.000（-1.71%）理想汽车-W(02015)-6976.13 万-9.58%87.300（-3.75%）中国联通 (SS:600050)(00762)-6400.56 万-35.58%7.030（-1.13%）国泰君安(02611)-5855.42 万-66.18%10.700（+1.13%）猫眼娱乐(01896)-5159.73 万-97.52%8.050（+2.29%）波司登(03998)-5005.75 万-40.40%3.670（+1.10%）雅迪控股(01585)-4998.64 万-32.62%12.820（-1.84%）<br>\t\t<br>\t前10大净流入比榜<br>\t\t<br>\t\t\t<br>\t\t\t\t股票名称<br>\t\t\t\t净流入比↓<br>\t\t\t\t净流入(元)<br>\t\t\t\t收盘价<br>\t\t\t<br>\t\t\t康基医疗(09997)272.66%556.09 万6.070（-0.16%）现代牧业(01117)265.60%182.84 万0.870（-2.25%）中船防务(00317)195.43%3942.25 万9.970（+0.50%）瑞尔集团(06639)177.67%359.80 万2.300（-2.13%）医脉通(02192)176.75%157.11 万8.620（+0.58%）嘉里物流(00636)170.91%364.43 万6.680（-0.74%）深圳高速公路股份(00548)169.36%1386.93 万7.000（+0.14%）六福集团(00590)126.88%240.22 万14.080（-0.85%）中石化炼化工程(02386)95.08%1627.50 万6.250（+0.32%）晨鸣纸业(01812)86.91%180.41 万1.170（0.00%）<br>\t\t<br>\t前10大净流出比榜<br>\t\t<br>\t\t\t<br>\t\t\t\t股票名称<br>\t\t\t\t净流出比↓<br>\t\t\t\t净流出(元)<br>\t\t\t\t收盘价<br>\t\t\t<br>\t\t\t金风科技(02208)-228.20%-3981.95 万6.200（+0.81%）美图公司(01357)-198.24%-1.95 亿3.080（-1.28%）青岛银行(03866)-165.72%-289.95 万2.990（+0.34%）百果园集团(02411)-105.66%-728.84 万1.210（-1.63%）猫眼娱乐(01896)-97.52%-5159.73 万8.050（+2.29%）神州控股(00861)-92.22%-436.61 万2.990（+1.01%）白云山(00874)-89.87%-739.85 万17.280（0.00%）丽珠医药(01513)-75.00%-738.08 万25.950（+0.39%）中国交通建设(01800)-72.87%-4897.11 万5.080（+0.79%）环球医疗(02666)-69.43%-501.70 万4.820（0.00%）<br>\t\t<br>\t备注：上面表格港股通资金净流向数据为港股通流入资金之和，由于港交所是T+2日结算，此数据为延迟数据。<br>智通机器人根据港交所数据，经过人工智能运算后自动生成，并不保证数据100%准确。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657751",
            "pub_date": "2025-02-05 07:35:11",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657753,
            "title": "中泰证券2025年有色行业策略：重点推荐电解铝、金属新材料、黄金与电解铜",
            "description": "<div> 智通财经APP获悉，中泰证券发布研报称，回顾2024年，有色板块以24Q3为分水岭整体走出“倒V”走势。站在目前时间点，中泰证券认为“海外周期需求逆风”与“全球新能源/Ai结构性支撑”并存，2025年应聚焦挖掘产业趋势以及行业供给格局的变化，寻找最强“偏振点”：重点推荐电解铝、金属新材料、黄金与电解铜。中泰证券主要观点如下：回顾2024年，有色板块以24Q3为分水岭整体走出“倒V”走势。站在目前时间点，我们认为1）“海外周期需求逆风”与“全球新能源/Ai结构性支撑”并存，2）2025年应聚焦挖掘产业趋势以及行业供给格局的变化，寻找最强“偏振点”：重点推荐电解铝、金属新材料、黄金与电解铜：黄金：2010年至今，美国十年期国债的实际收益率在-1.19%-2.52%之间波动，当前十年期美债的真实收益率是2%左右，处于过去十年的高位区间，美元信用体系的重塑已经成为趋势，黄金结构性溢价仍可维持，随着实际利率周期性回落，目标金价将升至3000美元/盎司左右。电解铜：需求结构变化的重要性被忽视，房地产在大宗品种的消费占比持续被压缩，新能源和AI领域带动2025年铜需求保持韧性。我们预计2025年精铜产量为2691万吨，同比增速为3.4%，铜精矿紧张局面将有所缓解，但仍需关注矿山复产和炼厂减产等扰动因素。电解铝：电解铝供给国内产能几近天花板，海外产能则“投建成本高、建设周期长”，电解铝环节“类资源”属性日益凸显，供应增速仅为1%附近。而需求端，同样受益于泛新能源、电网建设以及包装消费的合力拉动将有效拉动电解铝需求达到2-3%。供不应求趋势不可逆，考虑到海外产能incentive <br>price，维持电解铝价格将达到2.3-2.5万元/吨的判断，电解铝环节盈利增厚将从再分配走向再扩张。金属新材料：新技术奇点出现，2025年仍需重视金属新材料领域的投资机会：1）AI新材料：AI已经成为新一代技术革命，英伟达GB200采用铜连接的方案，这将拉动高强高导铜合金材料的需求增长；2）人形机器人材料：2025年将是人形机器人量产的元年，稀土永磁是人形机器人动力传动装置——无框电机、空心杯电机的关键原材料，将开启第二成长曲线；3）新能源材料：光伏产业链降本诉求下，“铜代银”将成为行业发展趋势，光伏铜粉充分受益。风险提示：国内外宏观经济波动等带来的风险；国内宏观流动性监管政策变化带来的风险；新能源汽车行业政策波动，产销量不及预期风险；原材料产能释放超预期带来的价格回落等风险；需求端表现不及预期的风险；研究报告使用的公开资料可能存在信息滞后或更新不及时的风险；行业规模测算基于一定前提假设，存在不及预期风险等。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657753",
            "pub_date": "2025-02-05 07:35:59",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657754,
            "title": "港股概念追踪 | 2025春运已过半 出行人次再创历史新高 民航市场或迎正向催化(附概念股)",
            "description": "<div> 智通财经APP获悉，截至2月2日，2025蛇年春运过半，全社会跨区域人员流动量、民航、铁路、公路出行旅客均继续增长，再创下历史新高。据交通运输部数据，前20日全社会跨区域日均人员流动量24069万人次，较2024年同期+7.7%，较2019年同期+19.6%。华创证券认为，在去年高基数的情况下，今年民航春运实现了量的继续增长，价的跌幅有限，整体数据表现符合市场预期。未来随着国际航线继续恢复，国内需求逐步转暖，民航市场供需关系有望持续得到改善。据交通运输部预计，2025年春运期间全社会跨区域人员流动量将达到90亿人次左右、同比增长约7%，铁路、民航客运量有望分别突破5.1亿人次/同增5.5%+和9000万人次/同增7.8%+，均创历史新高。航班管家预测2025年春运民航旅客量同比增长10.9%，国内航线经济舱平均票价同比基本持平。春运前20日各出行方式统计数据显示：民航：前20日累计发送旅客0.45亿人次，日均客运量225.3万人次，较2024年同期+7.1%，较2019年同期+27.2%;初五2月2日单日客运量242.8万人次，创春运单日历史新高，较2024年同期增长1.38%，较2019年同比增长21.6%;返程高峰临近，预计旅客量将进一步攀升。铁路：前20日累计发送旅客2.5亿人次，日均客运量1228万人次，较2024年同期+6.6%，较2019年同期+32.4%。公路：前20日公路累计流动人员45.1亿，日均2.25亿，较2024年同期+7.8%，较2019年同期+19.5%;其中高速公路及普通国省道非营业性小客车日均出行量1.96亿，较2024年同期+6.8%，较2019年同期+40.1%;公路日均营业性客运量2927万人次，较2024年同期+14.5%，较2019年同期-39.9%。水路：前20日累计发送旅客1641万人次，日均客运量82万人次，较2024年同期+10.6%，较2019年同期-45.5%。民航市场看，2025年春运首周，民航日均客运量增速基本符合预期。预计2025年春运国内航线加班较为有限，多为顺应春运需求的航线结构性调整优化;国际航线受益于过去一年累计恢复效应以及春运加班，预计同比增幅显著。根据航班管家统计，春运前7天全国日均实际客运执飞航班同比增长6%，其中国内航班同比增长仅3%，国际航班同比增加超三成，日本线是主力增班方向。国泰君安发布研报称，中国航空业具超预期长逻辑，2024年行业整体扭亏，2025年供需恢复趋势确定，考虑票价市场化与机队增速显著放缓，预计将开启盈利中枢上行。春运需求旺盛有望催化需求乐观预期，预售策略积极有望催化收益管理持续积极改变预期，盈利表现有望催化盈利恢复与未来中枢上升预期。出行方向中，今年春节假期，出境旅行热度较高，跨国出行更倾向于高消费的国家。春运期间(腊月十五至正月初四)日均内地、港澳台、国际航班数分别为1.41万架次、368架次和1876架次，分别较2024年增加1.7%、9.3%和32.6%。从跨国出行的目的地来看，东亚的日、韩，东南亚的新、马、泰仍是最主要的海外出行目的地。从出行目的地的变化来看，泰国、缅甸等东南亚国家出行较2019年同比减少且降幅较大。出行增幅最大的目的地是欧洲的意大利、土耳其、西班牙，在主要出行目的地中，日本和新加坡、马来西亚增幅较高。这或反映当前出国旅行的居民消费或有升级，消费目的地更多元化、更多去往消费水平更高的国家。中信证券预计，2025年春节，预计出行消费量增确定性高，价格缺口仍在但呈现收敛。2025年全年配置，兼顾政策传导下的需求预期回升以及行业供给端改善的正向促进。相关概念股：中国国航(00753)：据中国国航官微，中国国航开通多条国内外航线，自2024年1月17日起，国航上海浦东-慕尼黑CA827/8航班将恢复运行，每周三班。于2023年12月29日开通北京-伊斯坦布尔航线，每周3班，三、五、日执飞。开航当日至2024年1月7日，往返800元起。中国东方航空股份(00670)：国泰君安维持中国东方航空股份2024年预测95亿元人民币，新增2025年预测105亿元人民币。中国航空需求韧性良好，航司补充飞机订单不改运力降速规划，国际增班将推动供需恢复，盈利中枢上升可期。2024年春运表现有望催化市场乐观预期。中国南方航空股份(01055)：南方航空公告，预计2024年亏损12.5-18.7亿元，较2023年实现减亏。期内，国内经济持续呈现回升向好态势，民航行业复苏步伐加快。此外，广州北京双枢纽建设是南航重大战略，长期影响巨大。南航作为北京大兴机场最大主基地航司，将受益时刻分配新政。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657754",
            "pub_date": "2025-02-05 07:36:19",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657756,
            "title": "【早报】中方对美采取多项反制措施；DeepSeek爆火出圈",
            "description": "<div> 今日无新股上市，无新股申购。宏观新闻1、国务院关税税则委员会2月4日发布公告称，经国务院批准，自2025年2月10日起，对原产于美国的部分进口商品加征关税。其中，对煤炭、液化天然气加征15%关税；对原油、农业机械、大排量汽车、皮卡加征10%关税。2、证监会主席吴清在最新一期出版的《求是》杂志撰文《奋力开创资本市场高质量发展新局面》。吴清指出，抓紧落地进一步全面深化资本市场改革总体实施方案，成熟一项、推出一项。吴清还指出，支持优质未盈利科技型企业发行上市，发展多元化股权融资，促进畅通私募股权、创业投资多元化退出渠道。吴清指出，快、准、狠打击违法违规，集中力量查办财务造假、“掏空”上市公司、严重操纵市场等恶性违法行为。3、美国总统特朗普2月1日签署行政令，对进口自中国的商品加征10%的关税。美国的这一最新贸易保护措施在国际社会和美国国内遭到广泛反对。白宫当天表示，对所有进口自中国的商品，美国将在现有关税基础上加征10%的关税。4、外交部发言人就美方宣布对中国输美产品加征10%关税答记者问。外交部表示，美方以芬太尼问题为由，对中国输美产品加征10％关税，中方对此强烈不满，坚决反对，将采取必要反制措施，坚定维护自身正当权益。5、商务部新闻发言人就中方在世贸组织起诉美加征关税措施答记者问。商务部表示，2月1日，美方宣布对中国有关产品加征10%关税，中方为捍卫自身合法权益，已将美征税措施诉至世贸组织争端解决机制。6、据商务部2月4日消息，为维护国家主权、安全和发展利益，根据《中华人民共和国对外贸易法》《中华人民共和国国家安全法》《中华人民共和国反外国制裁法》等有关法律，依据《不可靠实体清单规定》有关规定，不可靠实体清单工作机制决定将美国PVH集团、因美纳公司列入不可靠实体清单。7、中国1月财新制造业PMI为50.1，前值50.5，连续第四个月维持在荣枯线上。1月财新中国制造业PMI的各分项指数，涨跌互现。8、商务部新闻发言人就日本拟实施半导体等多项出口管制措施事答记者问。商务部表示，一段时间以来，个别国家泛化国家安全概念，滥用出口管制措施，对中国半导体等产业实施制裁打压。中方将保留采取措施的权利，坚决维护自身合法权益。行业新闻1、国家医保局近日会同财政部印发了《国家医保局办公室 财政部办公厅关于有序推进省内异地就医住院费用纳入按病种付费管理的通知》。其中提到，2025年底前，所有省份要将省内异地住院直接结算费用纳入就医地按病种付费管理，包括按病组付费和病种分值付费两种形式。2、1月27日，商务部等6部门办公厅发布《关于做好2025年家装厨卫“焕新”工作的通知》。通知明确，对消费者开展旧房装修、厨卫等局部改造、居家适老化改造所用物品和材料购置，各地可结合实际自主确定补贴品类、标准、限额和实施方式。补贴标准不高于剔除所有折扣和优惠后最终销售价格的15%。购买1级及以上能效或水效标准产品的，不高于20%；居家适老化改造产品补贴标准可适度提高，不高于30%。3、商务部新闻发言人就对钨等物项实施出口管制应询答记者问。商务部表示，对钨等相关物项实施出口管制是国际通行做法。出口符合相关规定的，将予以许可。4、2月3日是香港交易所蛇年开市首日，在港交所举办的开市仪式上，香港交易及结算所有限公司主席唐家成表示，种种迹象表明，国际投资者对香港市场重新产生了兴趣。5、阿里云、百度智能云2月3日发文宣布，正式接入DeepSeek-V3、DeepSeek-R1模型。加之华为云、腾讯云，目前国内四大云巨头都已正式支持DeepSeek。此前，海外的亚马逊AWS、微软Azure等云巨头也已官宣支持。6、由上海市经济信息化委、国网上海市电力公司联合主办的上海市虚拟电厂管理中心揭牌仪式系列活动1月27日上午圆满举行。上海市虚拟电厂管理中心的成立，将有效整合各方资源，进一步强化行业规范管理，推动上海市虚拟电厂朝着智能化、高效化、规模化应用方向大步迈进。7、春节档电影总票房、观影人次双双刷新影史纪录。据猫眼专业版数据，截至昨日19时30分，春节档（1月28日至2月4日）电影总票房达95.26亿元，连续6天单日大盘票房破12亿元。8、从多家航空公司了解到，从今日零时起，上调国内航线燃油附加费。调整后，成人旅客国内航线燃油附加费征收标准为800公里及以下航段，每人每航段收取20元；800公里以上航段，每人每航段收取40元。与调整前的标准相比，分别上调了10元和20元。9、从国家发展改革委获悉，最新统计核算结果显示，降低全社会物流成本取得积极成效。2024年，我国社会物流总费用与GDP的比率降至历年最低。2024年，我国社会物流总费用与GDP的比率为14.1%，比上年下降0.3个百分点，降至2006年正式建立统计以来的最低水平。公司新闻1、据国家市场监管总局消息，因谷歌公司涉嫌违反《中华人民共和国反垄断法》，市场监管总局依法对谷歌公司开展立案调查。2、万科A公告称，选举深铁集团董事长辛杰为公司董事会主席。郁亮因工作调整原因申请辞去公司董事会主席职务，祝九胜、朱旭辞去高管职务。同日，万科A公告，拟12.92亿元转让红树湾项目投资收益权。3、*ST人乐公告，公司股票可能被终止上市。4、实达集团公告，筹划收购数产名商51%股权。5、*ST迪威公告，公司股票可能被终止上市。6、赛力斯发布1月份产销快报，1月新能源汽车销量17906辆，同比下降51.39%。7、*ST贤丰公告，公司股票可能被终止上市。8、比亚迪股份公告，1月新能源汽车销量约30.05万辆，同比增长49.16%。9、中基健康公告，拟购买新业能化100%股权并募集配套资金，股票复牌。10、大立科技公告，2024年度预计亏损3.36亿元-3.96亿元，公司股票交易可能被实施退市风险警示。11、本钢板材公告，2024年度预计净利润亏损50.2亿元。12、安迪苏公告，预计2024年净利润12.04亿元，同比增加2208%。13、海能达公告，预计2024年净亏损32亿元-37亿元。14、华夏银行公告，董事长李民吉因个人原因辞职。15、毕得医药公告，拟取得维播投资控制权，股票2月5日复牌。环球市场1、美股三大指数集体收涨，纳指涨1.35%，标普500指数涨0.72%，道指涨0.3%。苹果、特斯拉、谷歌涨超2%。Palantir涨约24%，2024年Q4营收同比大增36%，2025年业绩指引远超预期。热门中概股多数上涨，纳斯达克中国金龙指数涨2.65%。拼多多、小鹏汽车涨超8%。欧洲主要股指多数收涨，德国DAX30指数涨0.47%。2、周二国际原油期货结算价涨跌不一。WTI 3月原油期货跌0.63%，布伦特4月原油期货涨0.31%。3、现货黄金续创新高，一度站上2845美元/盎司。投资机会参考1、DeepSeek新模型海外刷屏，机构称AI大模型的应用将逐步走向普惠据媒体报道，中国AI初创公司深度求索（DeepSeek）先后发布了DeepSeek-V3和DeepSeek-R1两款大模型，成本价格低廉，性能与OpenAI相当，让硅谷震惊，甚至引发了Meta内部的恐慌，工程师们开始连夜尝试复制DeepSeek的成果。中信证券研报指出，DeepSeek-V3的正式发版引起AI业内广泛高度关注，其在保证了模型能力的前提下，训练效率和推理速度大幅提升。DeepSeek新一代模型的发布意味着AI大模型的应用将逐步走向普惠，助力AI应用广泛落地。2、百度文库付费用户已达4000万位列全球第二，AI应用层有望迎来“百花齐放”AI产品榜官方发布“全球AI产品2024付费用户规模”榜单。数据显示，百度文库付费用户达4000万，位列国内第一、全球第二，仅次于微软Copilot。百度文库由此成为唯一商业化的中国AI应用。百度文库AIMAU已突破9000万，AIDAU年同比增长230%。同时，百度文库总付费率年同比增长60%，这一增长几乎完全由AI功能带动。国元证券称，随着大模型竞争格局的逐步清晰，行业进入到价值实现和落地阶段。模型层能力向上价格向下降低应用层创新门槛，AIAgent升级交互方式，应用层有望迎来百花齐放。C端应用方面，头部产品流量保持良好增长，C端商业化持续探索，期待杀手级产品落地，AI+搜索、AI+陪伴等赛道具备潜力。B端方面，企业投入预算加大，看好金融政务医疗等垂直赛道。3、AI硬件发展中的新浪潮，苹果也在发力这类产品在谷子经济带火“情绪价值“的当下，AI陪伴人形机器人也试图在“情绪价值”的消费市场中找到一片蓝海。相比AI玩具，记者了解到，AI陪伴人形机器人是更高阶版的AI落地场景。此前，苹果已发力桌面级陪伴机器人。从最早的智能音箱到聊天机器人，再到目前的“情绪价值”陪伴类人形机器人，AI对物理实体的陪伴进行了重塑和再造。一项调查数据显示，在C端下游市场上，针对儿童和青少年的陪伴，有29%的用户将人形机器人作为首选，其次学龄前儿童也容易给玩偶等非生命体赋予生命和人格，这使得人形机器人在C端的应用，成为AI硬件发展中的新浪潮。华金证券指出，陪伴型小机器人爆发，标志着智能陪伴时代的正式到来。4、丰田、京都大学开发全固态电池新技术，机构预计固态电池市场未来20年涨幅达300倍日本京都大学与丰田汽车等研究团队成功提升了 \" 全固态氟化物离子电池 \" 正极的体积当量容量，使其达到了锂离子电池的三倍以上。若这种电池投入使用，其体积能量密度预计将是当前锂离子电池的两倍多，研究人员计划在2035年后将其应用于电动汽车。天风证券孙潇雅认为，固态是锂电池的核心技术迭代，更是全球角逐龙头的新质生产力。日本市调机构富士经济(Fuji Keizai)公布调查报告指出，因xEV（电动汽车）用氧化物系产品需求增加，2024年全固态电池全球市场规模预估为1158亿日元（约合人民币54.19亿元），达2023年的4倍。自2025年后，xEV将采用硫化物系产品，全固态电池预估将扩大应用于无人机、医疗机器、后备电源等用途，2045年预估将扩大至8兆7065亿日元（约合人民币4073.51亿元），将达2023年的299.2倍水准。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657756",
            "pub_date": "2025-02-05 07:37:06",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657718,
            "title": "美联：香港1月整体物业注册量失守5000宗 创4个月新低",
            "description": "<div> 智通财经APP获悉，据土地注册处资料显示，香港1月整体物业(包括一手私楼、二手住宅、一手公营房屋、工商铺、纯车位及其他等)注册量合共录4938宗，较去年12月5510宗下跌约10.4%，并创4个月新低。鉴于签署买卖合约至递交到土地注册处注册登记需时，因此今年1月注册个案一般主要反映去年12月的市况。美联物业首席分析师刘嘉辉指出，1月有多个新盘推售，带动一手成交量连跌2个月后回升。1月一手成交量录约750多宗，月环比回升约1成；虽然如此，但上月底适逢农历新年假期关系，不少市民忙于筹备年货或外游过节，香港二手物业交投显著放慢，在此消彼长下，料整体物业注册量将持续低于5000宗水平，并预期在2月注册量反映出来。展望2月实际市况，美联指出，长假期完结后外游市民回港，将刺激购买力释放，料香港住宅成交量有望回升，最快3月份注册量才有望反映出来。据美联物业研究中心综合土地注册处资料显示，回顾1月各类物业注册量，住宅方面，在不包括一手公营房屋之下，1月一手私楼及二手住宅注册量合共录3850宗，较去年12月4412宗减少约12.7%；一手公营房屋方面，1月录383宗，月环比微跌约0.5%；非住宅物业方面，1月工厦、商厦、商铺、纯车位及其他等注册量合共录705宗，较去年12月亦下跌约1.1%。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657718",
            "pub_date": "2025-02-05 07:05:29",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657719,
            "title": "重卡1月销7万辆降28% 电动重卡增速放缓",
            "description": "<div> 智通财经APP获悉，根据第一商用车网初步掌握的数据，2025年1月份，我国重卡市场共计销售7万辆左右（批发口径，包含出口和新能源），环比12月下降17%，比上年同期的9.7万辆下滑28%。7万辆放在最近八年来看，高于2023年1月的销量，但低于其他年份的1月销量。客观来说，由于今年春节时间比较早，1月份的“开门红”没有达到上年同期的高度，但也为开春后2月份重卡销量的增长埋下了伏笔。第一商用车网分析认为，2025年1月重卡市场同比、环比下降，主要原因有两个方面。首先，1月份是春节月，比上年同期早。今年春节是8天长假，供应商、生产、营销、渠道都会放假，进而在一定程度上影响各重卡厂家“开门红”的表现。其次，2024年末行业没有“留余粮”。2023年底的时候，由于当年重卡市场复苏较快，各家车企目标完成情况都比较好，因此不少车企在当年年底“留了”很多批发销量到第二年一季度，以保证第二年的“开门红”，这就在客观上推动了2024年1月的销量高企。2024年，由于重卡市场整体下行（尽管有货车以旧换新政策的刺激），各大重卡企业基本都没有余力“把余粮留到来年”，而是全力以赴完成年底的销售任务，以确保2024年目标的达成或者接近完成。这一点从2024年12月重卡行业批发销量高达8.4万辆、同比增长达到62%也可以看出来。2024年底没有销量“结转”到2025年1月，而上年同期的2024年1月销量又被“结转”销量推的非常高——接近10万辆，因此，2025年1月行业销量出现同比较大下滑，在所难免；即便是备受关注的出口，也同比下降了两位数。2015-2025年我国重卡行业销量年度走势图（单位：万辆）1月份，电动重卡增速放缓，燃气车占比上升2025年1月份，行业批发销量出现同比、环比双双下降，国内终端销量也出现了一定程度的下滑。从终端需求来看，由于1月份是春节月，再加上去年货车以旧换新对市场的“透支”，因此，1月份重卡终端市场表现一般（略高于去年2月“春节月”的终端销量），同比降幅预计为16-20%。一方面，今年春节较早，春节所在的月份向来属于传统淡季，公路货运行业运输车辆减少、车主和司机节前回家过年是常态，因此，1月份终端购车曲线是逐日走低的，越临近春节就越低。另一方面，去年实施的货车以旧换新政策截止日是2024年12月31日，“过时不候”，这就导致2024年底出现了大量换购新车扎堆上牌的现象。新车在年底扎堆上牌，直接影响了2025年1月份的新车终端销量。从几个备受关注的细分领域来看，2025年1月，天然气重卡实销同比小幅下降，但市场占比进一步提高。今年1月份，LNG的零售价继续走低，北方LNG的平均售价不到5元/kg，各地的油气价差普遍在2元以上，这推动了当月天然气重卡市场占比的提升，预计该细分领域终端销量比上年同期小幅下降4%左右，月度渗透率从同期的19%提升至22%以上。新能源重卡作为2024年重卡市场的重要“扛旗者”，去年全年销量突破了8万辆，同比增长1.4倍，国内渗透率也创下新高。1月份，新能源重卡的终端销量增速明显放缓，同比增幅预计在60%左右（2024年新能源重卡几乎每个月都是翻倍式的增长），行业渗透率约21%。这样一来，天然气重卡和新能源重卡的国内合计占比一开年就达到43%左右，比上年同期提高了10个百分点以上，柴油车的市场空间无疑被大大压缩。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657719",
            "pub_date": "2025-02-05 07:05:45",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657720,
            "title": "恒指牛熊街货比(59:41)︱2月5日",
            "description": "<div> 智通财经APP获悉，截至2月5日，恒指最新的牛熊街货比例为59:41。中信证券牛熊证街货分布图中的数据显示，熊证街货重货区在21000-21099区间，该区间最新熊证数量为840张，较上一交易日增加695张；最多新增在亦在此区间。牛证街货重货区在20200-20299区间，该区间最新牛证数量为682张，较上一交易日增加682张；最多新增在亦在此区间。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657720",
            "pub_date": "2025-02-05 07:06:16",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657721,
            "title": "招商证券A股2025年2月观点及配置建议：春季攻势 AI领衔",
            "description": "<div> 智通财经APP获悉，招商证券发布研报称，展望2月，在业绩预告披露落地和春节效应落地后，市场迎来经典的“春季攻势”的时间窗口，由春节后资金回流，两会预期，业绩真空期共同推动。当前经济数据的稳定改善开始逐渐缓解对于基本面承压的过度担忧，同时两会可能会对2025年经济的稳定改善注入新的动力，AI技术应用加速落地带来的产业变革预期，正持续强化科技成长板块的配置价值。风格层面，预计节后避险情绪集中释放后，市场风险偏好将逐渐修复，交易重回活跃，A股风格在短暂的大盘价值后将转向小盘成长，偏科技偏主题类股票有望成为阶段性进攻的方向。招商证券主要观点如下：大势研判和核心逻辑：春季攻势，AI领衔。在业绩预告披露落地和春节效应落地后，市场迎来经典的“春季攻势”的时间窗口，这个时间窗口由春节后资金回流，两会预期，业绩真空期共同推动。目前来看，经济数据依然呈现平稳复苏的态势，虽然没有太强幅度和超预期，但是数据的稳定改善开始逐渐“抚平”对于经济数据承压的焦虑感。加上两会可能会对2025年经济的稳定改善注入新的动力，投资者信心在4月前的窗口期大概率呈现持续修复的态势。春节后，个人投资者将会重新活跃，融资余额会回流。而以Deepseek <br>AI大模型，宇树人形机器人为代表的中国科技产品在全世界受到关注，有望强化投资者对于本轮AI应用科技产品落地的信心。而对于海外投资者来说，在这个春节后可能会更加正视中国科技与美国相抗衡的能力，进而增强对中国科技股乃至于整个中国资产的信心。总体来看，今年2-3月，仍然是经典的做多A股的时间窗口。股票类型选择方向，偏主题类方向尤其是AI应用将会成为下一个阶段市场重点进攻的方向，消费电子、传媒互联网、软件等领域与大模型应用相关、人形机器人落地相关的领域值得重点关注。对于更加看重基本面的投资者来说，继续布局高质量和高FCF类股票，仍是2025年稳健获益的选择。风格与行业配置思路：风格层面，综合考虑春节效应后半场、当前国内政策积极维护资本市场稳定以及美国加征关税等因素，预计节后避险情绪集中释放后，市场风险偏好将逐渐修复，交易重回活跃，A股风格在短暂的大盘价值后将转向小盘成长，月度维度看好偏小盘、成长、主题的风格，对应指数选择中证1000。行业选择层面，考虑未来一两个月的角度，综合考虑前期表现、估值、交易活跃度、景气变化、政策和事件催化，建议重点关注有望受益于春节效应、业绩向好的领域，具体涉及汽车(汽车零部件)、机械(自动化设备、工程机械)、电子(消费电子、半导体)、通信、社会服务、非银等。流动性与资金供需：ETF有望继续贡献主力增量资金，同时融资资金有望回流。国内流动性来看，1月春节取现需求叠加税期到来，资金面波动较大，资金利率大幅抬升，春节之后有望得到缓解。海外方面，美联储1月议息会议如期暂停降息，但对市场的影响相对有限，目前预期最早6月开始降息。另外，春节假期期间美国加征关税落地，美元指数走高，增大人民币汇率波动，可能影响春节后市场短期风险偏好。股市资金供需方面，1月股票市场可跟踪资金供需紧平衡，资金供需规模均有所收窄，ETF逆势净申购成为1月主力增量资金。展望2025年2月，ETF有望继续贡献主力增量资金，同时融资资金回流也有望贡献增量。中观景气和行业推荐：业绩预告落地后，政策与主题投资催化。截至目前约有52.2%的A股企业披露了2024年年度业绩预告/快报/报告，业绩向好率约33.7%。12月工业企业盈利当月同比增速转正，结构上以高技术制造业为代表的工业新动能利润较快增长，“两新”政策带动效果持续显现。景气方面，1月份景气较高的领域主要集中在中游制造、消费服务和金融地产领域，其中资源品板块化工品价格多数上涨，中游制造领域汽车产销和机械销售延续回暖，消费服务板块家电销售持续复苏，金融地产中地产销售延续改善。展望2月份，年报业绩预告告一段落，市场的关注点逐渐聚焦到对两会政策的预期，以及产业趋势的进展。推荐重点关注年报业绩预告显示业绩有支撑的领域;两会政策预期加码方向，主要涉及消费、基建投资等领域;以及新产业趋势催化的领域。建议重点关注有望受益于春节效应、业绩向好的领域，具体涉及汽车(汽车零部件)、机械(自动化设备、工程机械)、电子(消费电子、半导体)、通信、社会服务、非银等。赛道及产业趋势投资：DeepSeek发布R1模型，性能对标GPT-o1正式版。1月20日晚，杭州深度求索人工智能基础技术研究有限公司发布了第一代推理模型DeepSeek-R1-Zero与Deepseek-R1。DeepSeek-R1-Zero是一款通过大规模强化学习(RL)训练的模型，没有监督微调(SFT)作为初步步骤，展示了卓越的推理能力。然而，它遇到了诸如可读性差和语言混合等挑战。为了解决这些问题并进一步增强推理性能，引入DeepSeek-R1。这是一款在RL之前结合了多阶段训练和冷启动数据的更高级推理模型。DeepSeek-R1在推理任务上实现了与OpenAI-o1-1217相当的性能。1月重要政策梳理：据不完全统计，1月重要政策约132个。具体来看，1)总量政策方面，1月货币政策主要围绕着稳汇率方面。同时“两新”接续政策密集发布，加力“两新”扩围。2)资本市场方面，主要聚焦在结构性货币政策工具以及推动中长期资金入市方面;3)产业政策方面，1月生物医药及新质生产力相关政策值得重点关注，其中，新质生产力政策主要集中在低空经济、脑机接口、人工智能。风险提示： 政策理解不全面，经济数据不及预期，海外政策超预期收紧。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657721",
            "pub_date": "2025-02-05 07:06:32",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}