{
    "data": [
        {
            "id": 2656563,
            "title": "索尼(SONY.US)与CBS发行权争夺升级 《命运之轮》和《危险边缘!》归属成焦点",
            "description": "<div> 智通财经APP获悉，在索尼集团(SONY.US)与派拉蒙环球(PARA.US)旗下哥伦比亚广播公司(CBS)之间的纠纷不断升级之际，索尼于2月3日通知CBS，将接管两档热门电视游戏节目《命运之轮》(Wheel <br>of <br>Fortune)和《危险边缘!》(Jeopardy!)的全球发行权。索尼在周一致CBS的信中表示，已承担原定于2月10日当周播出的节目播出任务，并已将相关节目交付给CBS。作为回应，CBS计划申请临时限制令以阻止索尼的这一举动。CBS在一份声明中强调：“根据发行协议，索尼无权终止协议，CBS仍然是该剧集的合法发行商。所有业务应照常进行。”此外，CBS还表示将立即向法院寻求救济，以维持现有安排。据了解，此次纠纷源于索尼对CBS履行长期发行合同的不满。索尼指控CBS在过去35年的分销协议中获利超过10亿美元，但在增加广告和许可收入方面表现不佳。索尼还指出，CBS在与澳大利亚和新西兰签订的许可协议中，期限超过了两年，获利超过360万美元，并拒绝放弃这些“不义之财”。此外，索尼将CBS的“惨淡表现”部分归咎于派拉蒙全球的裁员，称该公司在过去一年中解雇了2,800名员工。CBS对此予以反驳，称其合同明确规定永久拥有这些系列剧的发行权，并强烈驳斥索尼的指控，称其已尽最大努力发行这些节目，并遵守了协议规定的义务。此外，CBS还指出，索尼关于收回发行权的任何争论都将受到正在进行的司法程序的制约。据洛杉矶高等法院的起诉书显示，CBS多年来一直预期其授权收入将实现2%的同比增长，这一预测引发了索尼的“怀疑和担忧”。索尼指出，在参与ABC电视台部分谈判的首年，授权费用实现了17%的增长。此前已有媒体报道了这起诉讼。该案名为“索尼影视公司诉哥伦比亚广播公司(CBS Studios Inc.)案”，在加利福尼亚州高等法院洛杉矶县审理。总的来说，此次纠纷的背景是电视行业的转型，观众从传统广播和有线电视频道转向流媒体服务，如奈飞(NFLX.US)。这一转变挤压了传统媒体公司的利润，促使它们寻求削减成本。此外，索尼曾于去年提出以九位数的价格收购CBS的协议，但目前双方的纠纷仍在继续。索尼发言人表示，尽管双方曾尝试多种方式解决问题，但均无济于事。索尼对CBS的合同履行问题、裁员计划、外包广告销售以及未能与尼尔森达成协议等问题表示担忧。目前，索尼寻求的赔偿金额尚未确定。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656563",
            "pub_date": "2025-02-04 10:36:33",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656570,
            "title": "全球都在动荡的一个月，这些海外公司股价却大涨超20%",
            "description": "<div>英为财情Investing.com — 刚刚过去的一月跌宕起伏，大事件接连不断，一个月的经历堪比往常一年……<br>期间，美国科技巨头公布了财报，美国标普500和欧洲泛欧STOXX 600等多个市场屡创新高，DeepSeek新模型横空出世亦震惊世界，在华尔街掀起巨浪。2025年似乎不会太平，但巨浪之中机会也层出不穷。<br>InvestingPro会员在1月就成功发现了这些机会。每月仅需两杯咖啡钱，就能获得一份由AI精选的、有潜力跑赢大市的股票名单，例如一月份这些股票实现了靓丽的涨幅：<br>Builders FirstSource（NYSE:BLDR）：一月涨幅20.5%。<br>Iveco NV（BIT:IVG）（意大利）：一月涨幅27.5%。<br>莱茵金属（OTC:RNMBY）（ETR:RHMG）AG（德国）：一月涨幅21.54%。<br>蒂森克虏伯（ETR:TKAG）（德国）：一月涨幅23.31%。<br>Sendas Distribuidora（BVMF:ASAI3）（OTC:ASAIY）（巴西）：一月涨幅23.5%。<br>土耳其人民银行（IS:HALKB）（土耳其）：一月涨幅24.35%。<br>G2 Goldfields（TSX:GTWO）（加拿大）：一月涨幅29.9%。<br>SemCNS Co（KQ:252990）（韩国）：一月涨幅23.72%。<br>*这些并非回测结果，而是一月份实打实的战绩。<br>除了上述靓股，我们的多个AI策略也跑赢了大市，战绩如下：<br>超越标普：一月涨幅6.98%。<br>最佳价值股：一月涨幅6.71%。<br>意大利市场菁英：一月涨幅9.61%。<br>德国精选Alpha股：一月涨幅9.67%。<br>加拿大成长股：一月涨幅10.88%。<br>巴西廉价股：一月涨幅6.74%。<br>这些策略都成功穿越了一月的动荡。<br>接下来的二月，也不会风平浪静，英伟达（NVIDIA）（NASDAQ:NVDA）将公布公布财报，特朗普宣布对加拿大、墨西哥和中国加征关税。<br>面对动荡，让AI协助你穿越火线。2月AI精选股名单现已出炉。<br>现在订阅，每月两杯咖啡钱，借助科技的力量跑赢大市。<br>*已是InvestingPro会员了？点击这里查看ProPicks AI精选股。<br>我们的AI策略是如何跑赢大市的？AI有什么魔法？<br>AI当然没有魔法。<br>ProPicks AI之所以屡创佳绩，因其秉持直观、行业认可的基本面分析方法，融合大数据建模与股市历史数据的精髓。<br>全面快速比较市场上海量股票的财务和股价表现，在股海中精准发掘散落的明珠，从而提升投资收益，降低风险。<br>这就是ProPicks AI的独特之处，在股票大红大紫前，提前发掘可能被低估的宝藏股。<br>点击此处，立即订阅，解锁2月最新AI精选股，在风暴来临前抢先布局。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656570",
            "pub_date": "2025-02-04 10:35:54",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656494,
            "title": "随着美国开启贸易战 黄金的表现最为优异",
            "description": "<div><br>美国总统特朗普不断升级的贸易战正在对风险资产造成不良影响，黄金继续作为避险资产和全球替代货币发光发热。2月3日周一，现货黄金达到每盎司2380.39美元，再创历史新高。随着特朗普对墨西哥、加拿大和亚洲大国征收高额关税，黄金不仅跑赢了标准普尔500指数，而且还跑赢了DC。许多分析师预计，即便美元强劲涨幅使金价波动性加大，金价将保持强劲的上涨趋势。在周一的一份报告中，彭博咨询的高级大宗商品策略师Mike McGlone表示，随着“一切泡沫”开始破灭，黄金应该会得到良好的支撑，而标准普尔500指数仍处于严重负值区域。McGlone在他的报告中称：“相对于股市和DC，黄金可能正在获得动力，这对宏观经济不利。”McGlone补充称，在股市人气持续低迷之际，黄金比DC更能吸引新的避险资金。他说：“对于保守的价值储存来说，这可能是一个短期的迸发，但四年来黄金ETF的资金流出相对于DC历史上规模最大的ETF推出，来自创纪录股票的激烈竞争，以及美国的高利率可能表明，贵金属正在嗅探到一个顶峰。”McGlone指出，由于DC的表现不如黄金，它可能面临成败的关键时刻，这也可能对全球金融市场产生更广泛的影响。他说：“截至1月31日，金价同比上涨约37%，而标准普尔500指数同比上涨27%，这可能表明黄金正在考验美国这台伟大的财富创造机器的极限。失控的美国政府赤字支出提振了黄金和股市，但股市的回报可能已经开始递减。”现货黄金日线图 来源：易汇通北京时间2月4日9:57 现货黄金 报 2823.79 美元/盎司<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2656494",
            "pub_date": "2025-02-04 10:00:35",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656488,
            "title": "2月4日亚市更新支撑阻力：18品种支撑阻力(金银铂钯原油天然气铜及十大货币对)",
            "description": "<div><br>2月4日亚市更新的黄金、白银、铂金、钯金、原油、天然气、铜（商品）以及：美元指数、欧元、英镑、日元、瑞郎、澳元、加元、纽元(热门货币对)的支撑阻力位一览。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2656488",
            "pub_date": "2025-02-04 09:40:39",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656479,
            "title": "阿斯利康(AZN.US)重磅免疫疗法Imfinz有望在欧盟再获批准",
            "description": "<div> 智通财经APP获悉，阿斯利康公司(AZN.US)今日宣布，其重磅免疫疗法Imfinzi(durvalumab)已获得欧洲药品管理局(EMA)人用药品委员会(CHMP)积极意见，推荐在欧盟(EU)获批作为单药，用于治疗接受铂类放化疗(CRT)后病情未进展的成人局限期小细胞肺癌(LS-SCLC)。这一推荐是基于发表在《新英格兰医学杂志》上的3期临床试验ADRIATIC的结果。小细胞肺癌(SCLC)是一种高度侵袭性的肺癌。局限期小细胞肺癌即使在标准化疗和放疗初步应答良好后，通常也会迅速复发和进展。LS-SCLC的预后尤为不良，仅有15%–30%的患者在确诊五年后仍存活。荷兰阿姆斯特丹大学医学中心临床试验放疗教授，ADRIATIC试验主要研究员Suresh <br>Senan博士表示：“ADRIATIC是几十年来首个在局限期小细胞肺癌中显示出生存获益的3期试验，接受Imfinzi治疗的患者死亡风险降低了27%。”Imfinzi是一种人源化的单克隆抗体。通过与PD-L1的结合，阻断PD-L1与PD-1和CD80蛋白的结合，进而抑制肿瘤的免疫逃逸机制。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656479",
            "pub_date": "2025-02-04 09:36:15",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656470,
            "title": "恩智浦(NXPI.US)Q4财报喜忧参半：营收略超预期，但一季度展望逊于预期",
            "description": "<div> 智通财经APP获悉，芯片制造商恩智浦(NXPI.US)在2024年第四季度的财务表现呈现出一定的复杂性。该公司第四季度的营收为31.1亿美元，同比下降9.1%，但符合华尔街预期的31亿美元。其非GAAP每股收益达到3.18美元，超出分析师预期的3.13美元。此外，调整后的EBITDA为12.4亿美元，也高于分析师预期的12.2亿美元。然而，对于2025年第一季度的展望，恩智浦预计收入将在27.3亿至29.3亿美元之间，中间值28.3亿美元低于市场普遍预期的28.7亿美元。预计调整后的每股收益中间值为2.59美元，低于分析师预期的2.64美元。恩智浦总裁兼首席执行官Kurt <br>Sievers表示，尽管2024年市场环境充满挑战，但公司全年营收达到126.1亿美元，仅同比下降5%，第四季度营收为31.1亿美元，略高于预期区间的中点。公司通过稳健的执行力、稳定的毛利率和健康的自由现金流，成功实现了软着陆。据了解，恩智浦于2006年从荷兰电子巨头飞利浦分离出来，专注于汽车、工业制造、移动设备和通信基础设施芯片的设计与制造。而模拟芯片的需求与整体经济增长密切相关，因为它们是大多数电子产品和设备的核心组成部分。与数字芯片不同，模拟芯片的生产不需要昂贵的前沿技术，因此恩智浦倾向于自行生产大部分芯片。模拟产品周期对主要长期增长驱动因素的依赖性较小，通常为5-7年。从长期来看，恩智浦在过去五年的销售额复合年增长率仅为7.3%，低于行业平均水平。半导体行业具有周期性，长期投资者应准备好应对高增长期和随后的收入收缩期。尽管恩智浦过去一直保持增长，但短期表现对于半导体行业同样重要，因为技术创新的快速步伐(如摩尔定律)可能导致产品迅速过时。恩智浦在过去两年的收入每年下降2.3%，显示出一定的增长停滞。此外，库存周转天数(DIO)是衡量芯片制造商资本密集度和供需周期性的重要指标。本季度，恩智浦的DIO达到150天，比五年平均值高出38天，这表明库存水平已显著上升，可能暗示需求疲软。尽管如此，恩智浦在本季度的每股收益和息税折旧摊销前利润(EBITDA)超出了分析师预期，显示出一定的积极信号。总体而言，恩智浦本季度的表现喜忧参半，尽管部分指标超出预期，但未来增长仍面临挑战。截至发稿，恩智浦的股价在盘后交易中上涨2.1%，达到209美元。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656470",
            "pub_date": "2025-02-04 09:06:11",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656471,
            "title": "Palantir(PLTR.US)商业销售额狂增64%! DeepSeek神助攻之下，软件巨头们迎来黄金时代?",
            "description": "<div> 智通财经APP获悉，聚焦于“AI+数据分析”的美国数据软件巨头Palantir Technologies <br>Inc(PLTR.US)的股价在美股盘后交易中暴涨超24%，一举创下历史新高价位，核心逻辑在于该软件巨头公布的最新业绩数据，以及全年销售额预测超出华尔街分析师普遍预期，这得益于首席执行亚历克斯·卡普(Alex <br>Karp)所称的人工智能软件需求的“狂野式的内生性增长趋势”。对于全球顶级软件公司股价前景来说，更重要的逻辑在于，华尔街分析师以及顶级资管机构策略师们普遍预计，随着DeepSeek引领的“低成本算力新范式席卷全球”，AI训练与应用推理端AI成本愈发下行，同时全面驱动AI应用向全球各行各业加速渗透，Palantir、Salesforce、ServiceNow以及AppLovin等软件巨头们AI创收数据以及整体利润或将迎来指数级别增长，它们或将是DeepSeek全球爆火，以及“DeepSeek低算力成本冲击波”之下的最大赢家。这家总部位于丹佛的美国软件巨头美东时间周一在业绩展望报告中表示，2025年全年的整体销售额将达到约37.5亿美元，调整后的营业利润预计约为15.6亿美元。这两项核心业绩的预期均超华尔街预期，相比之下，华尔街分析师们平均预期的营收约为35.4亿美元，营业利润平均预期约为13.7亿美元。Palantir凭借其AI驱动的数据分析平台，不仅在国家安全领域占据主导地位，近期更是在美国商业市场展现出无比强大的需求端增长潜力。Palantir的AI软件生态已覆盖美国几乎所有军事部门，并扩展至乌克兰和以色列等盟友，随着商业AI软件需求的爆发式增长，Palantir正引领一场由AI软件，而不是由高性能AI芯片所全面主导的“人工智能革命”。Palantir最初以其与美国政府携手打造的“美国国家安全软件平台”而闻名全球，最近则因其独家的“人工智能软件平台”而备受关注。2024年，该公司股价飙升了340%，乃美股科技股中最强涨势，该软件巨头的股价可谓乘着投资者们对AI无比狂热的投资浪潮，并且越来越多的商业客户和政府客户开始使用Palantir的“AI+数据分析”软件生态平台。Palantir第四季度的销售额跃升36%，达到8.275亿美元，高于华尔街分析师们平均预期的7.759亿美元。剔除部分项目后的每股收益为0.14美元，高于分析师们预期的0.11美元。该软件巨头的股价在纽约收盘创下83.74美元的历史新高后，盘后交易中又大幅上涨了24%以上。随着该软件巨头与美国国防部的联系日益加深，对美国政府的销售额大幅增长了45%，达到3.43亿美元。截至12月31日的第四季度，Palantir美国市场商业类销售额大幅增长了64%，达到2.14亿美元。商业类业务的业绩展望方面，Palantir预计，2025年美国商业销售额将增长大约54%，达到10.8亿美元。Palantir CEO卡普在致股东的信中表示，Palantir正处于“一个全新的阶段”，并警告其他美国科技公司不要陷入所谓的“科技自满”，它们未能站出来为美国利益服务。“我们喜欢颠覆，”卡普在业绩电话会议中表示。“颠覆最终会暴露出那些行不通的东西，会有起有落。这是一场革命。有些人会被斩落。”在唐纳德·特朗普重新当选美国总统之后，华尔街机构投资者们对Palantir股票以及该公司加强美国国防和制造业的承诺表现出热情。Palantir首席技术官希亚姆·桑卡尔(Shyam <br>Sankar)在10月发布了他所谓的“美国工业基础复兴蓝图”，并多次在美国国会发表证词，表示该公司支持国防创新和采购改革。去年，Palantir向4000多名普通员工发放了每股17美元的所谓“股票增值权”，这一安排在第四季度股价超过70美元时生效，并导致一次性相关费用大约1.32亿美元。Palantir是什么来头?在人工智能领域有何重磅产品?Palantir由亿万富翁彼得·泰尔于2003年联合创立，该公司长期以来强调其与美国政府及其盟友的稳固合作关系。该公司所有软件产品被美国军方几乎所有重要分支机构长期使用，并且是参与该国军事人工智能项目开发的核心力量。这家总部位于丹佛的美国大数据软件巨头已经从为美国情报界提供独家服务，发展成为与美国及其盟国多家政府机构进行长期合作，以及与哥伦比亚广播公司(CBS)、通用磨坊公司、Aramark <br>Services、松下北美公司和康明斯公司等众多公司进行长期商业合作的美国最有影响力科技公司之一。Palantir最早因为在美国政府追捕击毙本·拉登行动中,为政府提供重要数据与情况分析支持而闻名全球;虽然Palantir对此从未给予正面承认，但媒体以及军事爱好者们普遍认为Palantir在这过程中扮演重要角色，Palantir因此一战成名。Palantir在2023年重磅推出Palantir人工智能平台(AIP)受到广泛关注，并已被全球超100个组织大规模使用，包括医疗保健和汽车行业。公司还在与300多家额外公司进行洽谈。AIP <br>平台的核心卖点不是 Palantir 自己去开发大语言模型(LLM)，更偏向于 AI <br>应用。这个平台还包括类似ChatGPT的AI助手，可以帮助企业对其大数据业务进行分析与决策，并且帮助客户以低技术门槛的方式高效率调用Palantir各平台的模块和功能。Palantir的生成式AI平台“AIP”与Palantir现有数据分析软件生态系统全面集成，客户可以通过简单问答的方式调用Palantir核心模块和功能，使企业组织能够有效地将生成式人工智能应用于数据分析，提高洞察力和运营效率。该平台支持一系列人工智能技术驱动的应用，从物料短缺自动化管理、物流和供应链优化到预测性维护和威胁检测等复杂算力场景。Palantir自2023年以来的股价狂飙式扩张，核心逻辑无疑在于该公司在人工智能应用领域不断扩大的影响力，以及市场对该公司独有的人工智能生态及其AI应用软件需求的大幅增加。Palantir最大规模的客户是美国政府，同时也从全球大型公司那里赚取巨额收益。华尔街知名机构Wedbush的分析师团队称赞Palantir是“人工智能行业的梅西”，Wedbush的分析师团队写道：“全面推出AI <br>LLM(人工智能大语言模型)，以及生成式人工智能的真正用例，将成为软件行业和AI领域关键参与者们的重要催化剂，市场焦点从半导体转向软件巨头，让他们从载入史册的第四次工业革命中大幅获益。”“现在，更广泛的软件领域加入人工智能投资盛宴的时机已经到来，因为我们相信AI用例正在呈现爆炸式增长。”据了解，Palantir的人工智能数据分析软件生态现已全面应用于美国所有军事部门，并且被乌克兰和以色列等美国盟友使用。Palantir最近还将其与美国陆军的一项合同扩大至2028年，整体金额高达6.19亿美元，并扩展了与美国特种作战司令部的AI领域合作规模。随着硅谷拥抱国防科技公司，Palantir扩大了与其他科技公司的合作范围。该公司加强了与武器制造商Anduril Industries <br>Inc.的现有合作关系，并与AI初创公司Anthropic建立了新的合作关系，将其大语言模型(即LLM)引入美国情报和国防行动。这些举措标志着Palantir高管所设想的由软件优先公司，而非传统国防科技公司所主导的“美国新国防生态系统的开端”。DeepSeek引领的“低算力成本风暴”席卷全球，软件巨头们或将是最大受益者!近期，来自中国DeepSeek的AI工程师团队所开创的DeepSeek <br>R1大模型可谓霸榜美国热搜，并且DeepSeek应用周一登顶苹果中国地区和美国地区应用商店免费APP下载排行榜，在美区下载榜上超越ChatGPT，堪称属于中国AI的“里程碑时刻”。DeepSeek团队证明，他们能够在没有世界最顶级的英伟达高性能AI <br>GPU提供强大AI算力的情况下，以极低成本加上性能普通的AI加速器训练出推理能力一流的突破式开源AI大模型。在不到600万美元的极低投入成本和2048块性能远低于H100与Blackwell的H800芯片条件下，DeepSeek团队打造出性能堪比OpenAI <br>o1的开源AI模型，相比之下Anthropic与OpenAI训练成本高达10亿美元，DeepSeek的推理输入与输出token定价相比于OpenAI定价则可谓“骨折级”促销。随着这股来自东方的“DeepSeek低算力成本风暴”席卷全球，投资者们开始强烈质疑美国科技巨头们对于人工智能堪称“非理性”的狂热AI烧钱计划是否合理，毕竟动辄千亿美元的支出，相比于DeepSeek仅仅百万美元级别成本令这些美国科技股投资者无比震惊的同时也无比愤怒。截至上周一美股收盘，由于投资者们担忧DeepSeek引领的“低成本AI大模型算力范式”推动科技巨头们在短中期内大幅削减AI <br>GPU订单，因此“AI芯片霸主”英伟达(NVDA.US)股价大跌近17%，收报118.42美元，单日的市值蒸发规模达到5890亿美元，为美国股市历史上最大规模市值损失，打破此前纪录。但是，世界各地的开发者都在试用DeepSeek的软件，并希望用它来构建各种AI工具，这可能会加快先进人工智能推理大模型的商业采用规模。因此，在DeepSeek冲击人工智能算力框架之际，关于DeepSeek的所引领的“低算力成本范式”将大举推动和催化生成式AI以及AI代理等AI应用软件快速落地的声音也愈发响亮。从微软、Meta以及阿斯麦等西方世界科技巨头们的回应来看，他们纷纷赞叹了DeepSeek的创新，但并未因此动摇大规模投资AI的决心。他们认为DeepSeek引领的新技术路线有望带来AI成本的整体下降态势，对于AI应用端来说，必然存在更多的机遇和规模大得多的AI应用与推理端算力需求。目前，亚马逊、英伟达以及微软已在云端算力平台上线部署DeepSeek-R1，支持用户访问DeepSeek-R1大模型。对于DeepSeek的出现，阿斯麦首席执行官傅恪礼(Christophe <br>Fouquet)在阿斯麦业绩会议上表示，DeepSeek的出现是好消息。“人工智能成本降低可能意味着AI应用范围大幅扩大。应用范围扩大意味着随着时间的推移推理端AI算力需求将增加，我们认为这是芯片需求增加的机会。”傅恪礼表示。随着DeepSeek引领的AI训练成本大幅下降，以及推理端Token成本骤减，AI代理以及生成式AI软件有望向各行各业加速渗透，这也是为何华尔街在纳斯达克100指数暴跌之际仍然无比看涨软件股。其中，AI代理极有可能是2030年前AI应用大趋势，AI代理的出现，意味着AI在2024年开始将从信息辅助工具演变为高度智能化的生产力工具。Salesforce是客户关系管理类云软件的老牌龙头，自今年以来持续加码布局AI应用软件，旗下AI应用软件产品加速渗透至各大企业端客户，并且该公司推出的“AI代理”Agentforce系列产品，已经在企业客户群体显示出旺盛需求。企业们对于提高效率和降低运营成本的迫切需求，在近期可谓极大力度推进AI代理的广泛应用。AI代理能够自动化重复性任务、基于无比强大的AI大模型实现大数据分析与汇总，并且提供实时的监控洞察报告以及在极短时间内对极端的复杂情况做出合适决策，从而提升企业经营效率。AI代理还能够高效率参与全球各领域大型项目从蓝图规划到落地的全阶段，大幅加快项目进度。根据调研机构MarketsandMarkets的最新预测报告，人工智能代理市场规模预计将从 <br>2024 年的仅仅 51 亿美元大幅扩张至 2030 年的大约 471 亿美元，期间复合年增长预期高达 44.8%。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656471",
            "pub_date": "2025-02-04 09:06:12",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656469,
            "title": "黄金交易提醒：美国对加墨两国的关税将推迟生效，美元从三周高位回落，金价再创历史新高",
            "description": "<div><br>周二（2月4日）亚市早盘，现货黄金窄幅震荡，目前交投于2815.74美元/盎司附近。金价周一先跌后涨，美国总统特朗普宣布对加拿大、中国和墨西哥征收关税，加剧了市场对通胀将影响经济增长的担忧，周一美元指数一度大涨逾1%，令金价跌至2772附近，但金价很快也受到避险买盘和逢低买盘支撑。另外，随着特朗普宣布推迟对加墨两国的加征关税，美元指数回吐涨幅，再度给金价提供冲高机会，周一金价最高触及2830.39美元/盎司，收报1814.38美元/盎司。High Ridge Futures 金属交易主管 David Meger 表示，尽管美元走强通常会对黄金市场产生抑制作用，但由于特朗普关税的不确定性带动了避险需求，黄金价格一直在上涨。特朗普从周二开始对加拿大和墨西哥的进口商品征收25% 的关税，并对中国商品征收 10% 的关税，这加剧了人们对贸易战可能导致全球经济增长放缓并引发通胀攀升的担忧。加拿大和墨西哥宣布采取报复措施，中国则表示将在世界贸易组织（WTO）对关税提出质疑，并采取反制措施，但并未透露细节。不过，特朗普周一宣布对墨西哥的关税将缓期一个月生效。当地时间2月3日下午，北京时间今天（2月4日）凌晨，加拿大总理特鲁多在与美国总统特朗普通话后表示，美国将暂停对加拿大加征关税至少30天。美国总统特朗普证实推迟对加拿大加征关税，美国总统特朗普表示，上周六宣布的关税将暂停30天，以观察是否能够达成与加拿大的最终经济协议。与此同时，摩根大通指出，股票市场的熊市蔓延可能在短期内拖累黄金，但破坏性关税继续助长黄金的中期牛市行情。美元指数周一下跌 0.1%，收报 108.42；早盘曾触及三周高点109.88。Bannockburn Global Forex首席市场策略师Marc Chandler说：\"对墨西哥的这一推迟，正说明关税只是一种交易工具。道明证券外汇和新兴市场策略主管Mark McCormick说：\"美方此举看似在重建霸权地位，继而迫使全球为其公共产品买单，这种做法绝非政府常规运作模式。\"关税消息公布后，市场降低了对美联储降息的预期，期货价格显示今年降息两次的可能性仅为50%。一些分析师表示，一旦关税实施，加拿大和墨西哥的经济将面临衰退风险，而如果关税启动，欧元区经济将面临进一步停滞。特朗普上周末表示，将对欧盟征收关税，但没有说明具体时间。欧盟领导人周一在布鲁塞尔举行的非正式峰会上表示，如果美国征收关税，欧洲将做好反击准备，但也呼吁理性和谈判。“市场正试图弄清关税将意味着什么：关税是否会刺激通胀，是否会导致经济增长放缓，是否会阻碍美联储降息？“Action Economics全球固定收益分析董事总经理Kim Rupert表示。\"人们不知道如何为如此多的不确定性定价。”美国总统特朗普表示，尽管英国在贸易方面“越界了”，但他认为英国或能够避免关税。谈到贸易失衡时，他补充说：“我认为这是可以解决的。”当被问及英国是否会面临关税时，特朗普周日（2月2日）告诉记者：“我们会看看事情如何发展。英国可能会面临关税，但欧盟肯定会面临关税，我可以告诉你这一点。英国过分了。我们拭目以待...但欧盟确实太过分了。英国确实过分了，但我认为这是可以解决的。但欧盟的所作所为简直是暴行。”经济数据方面，美国制造业在1月出现两年多来的首次增长，但复苏可能是短暂的，特朗普加征关税，可能进一步推高原材料价格并给供应链造成干扰。美国供应管理协会（ISM）公布的调查显示，1月制造业采购经理人指数(PMI)从12月的49.2升至50.9，为2022年9月以来最高，也是2022年10月以来PMI首次升至50以上，表明制造业增长。美联储多名官员警告称，特朗普政府目前推行的大规模关税会带来通胀风险，但他们并未说明在一个明显不确定的环境下，这将如何影响他们对货币政策的看法。\"周末宣布的全面关税，预期会对价格产生影响，\"波士顿联储主席柯林斯表示。她补充称，\"征收全面关税，实际上不仅会导致最终商品价格上涨，还会导致一些中间商品价格上涨。\"亚特兰大联储主席博斯蒂克警告称，他的企业联络人正计划转嫁与关税相关的任何成本上升。博斯蒂克还表示，关税和其他政策的高度不确定性使美联储难以预测经济将如何发展，因此对进一步降息采取谨慎态度是合适的。芝加哥联储主席古尔斯比表示，政策的不确定性，尤其是关税可能推高物价，为美联储放缓降息步伐提供了理由。本交易日还将出炉美国12月工厂订单月率和美国12月JOLTs职位空缺数据，投资者需要予以关注。另外，继续关注特朗普的动态消息。（现货黄金日线图，来源：易汇通）北京时间08:39，现货黄金现报2815.72美元/盎司。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2656469",
            "pub_date": "2025-02-04 09:00:17",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656467,
            "title": "CBOT持仓：玉米、大豆、小麦、豆油、豆粕净多头激增，市场情绪转向乐观？",
            "description": "<div><br>隔夜CBOT谷物市场在经历了波动后，最终以全面上涨收盘。市场情绪受到美国总统特朗普暂停对墨西哥和加拿大商品加征关税的消息提振，小麦、玉米和大豆期货均从早盘的低点反弹。与此同时，基金持仓数据显示，大宗商品基金在玉米、大豆、小麦、豆粕和豆油上的净多头头寸均有所增加，反映出市场对未来价格走势的乐观情绪。根据汇通财经观察，海外交易商估算的结果显示：2025年2月3日当日，大宗商品基金：增加CBOT玉米投机性净多头；增加CBOT大豆投机性净多头；增加CBOT小麦投机性净多头；增加CBOT豆粕投机性净多头；增加CBOT豆油投机性净多头。最近5个交易日，大宗商品基金：增加CBOT玉米投机性净多头；增加CBOT大豆投机性净多头；增加CBOT小麦投机性净多头；增加CBOT豆粕投机性净多头；增加CBOT豆油投机性净多头；最新30个交易日，大宗商品基金：增加CBOT玉米投机性净多头；增加CBOT大豆投机性净多头；增加CBOT小麦投机性净多头；增加CBOT豆粕投机性净多头；增加CBOT豆油投机性净多头。具体变动数据见图表。小麦：基差走弱，但期货价格反弹小麦市场在周一表现出明显的波动性。尽管美国墨西哥湾的硬红冬麦（HRW）基差走弱，反映出出口需求的疲软，但KCBT三月小麦期货价格仍从早盘的低点反弹，最终收于5.85-3/4美元/蒲式耳，接近上周创下的三个月高点5.90-3/4美元/蒲式耳。基差的走弱主要由于出口商需求放缓，而农民销售活动也有所减少，因种植者正在等待更多关于冬小麦作物生长前景的信息。从持仓数据来看，基金在2月3日增加了4500手小麦净多头头寸，显示出市场对小麦价格的看涨情绪。尽管短期内出口需求疲软，但市场对加拿大小麦进口放缓的预期以及特朗普关税言论的缓和，为小麦价格提供了支撑。未来，小麦市场的走势将取决于冬小麦的生长状况以及国际贸易局势的进一步发展。大豆：巴西产量创纪录，但期货价格反弹大豆市场在周一同样表现出强劲的反弹势头。尽管巴西2024/25年度大豆产量预计将达到创纪录的1.74亿吨，给市场带来了一定的压力，但CBOT三月大豆期货价格仍上涨16-1/4美分，收于10.58-1/4美元/蒲式耳。市场情绪的改善主要得益于特朗普暂停对墨西哥加征关税的消息，缓解了市场对贸易冲突的担忧。持仓数据显示，基金在2月3日增加了10000手大豆净多头头寸，连续五个交易日增持多头头寸。尽管巴西大豆产量的增加可能对全球供应造成压力，但市场对美国大豆出口需求的乐观情绪仍在支撑价格。未来，大豆市场的走势将取决于南美天气状况以及中美贸易关系的进展。玉米：基差小幅上涨，期货价格反弹玉米市场在周一也表现出强劲的反弹势头。尽管美国国内农民销售活动放缓，但CBOT三月玉米期货价格仍上涨6-3/4美分，收于4.88-3/4美元/蒲式耳。基差方面，墨西哥湾的玉米基差小幅上涨，反映出一定的买家兴趣。持仓数据显示，基金在2月3日增加了16500手玉米净多头头寸，显示出市场对玉米价格的看涨情绪。尽管短期内农民销售活动放缓，但市场对墨西哥玉米进口需求的乐观情绪以及特朗普关税言论的缓和，为玉米价格提供了支撑。未来，玉米市场的走势将取决于美国国内需求以及国际贸易局势的进一步发展。豆粕：国内供应充足，但出口市场走强豆粕市场在周一表现出分化走势。美国国内豆粕供应充足，导致中西部卡车市场的基差走弱，但墨西哥湾出口市场的基差则有所走强。CBOT三月豆粕期货价格上涨2.60美元，收于303.70美元/短吨。持仓数据显示，基金在2月3日增加了3500手豆粕净多头头寸，显示出市场对豆粕价格的看涨情绪。尽管国内供应充足，但出口市场的走强为豆粕价格提供了一定的支撑。未来，豆粕市场的走势将取决于美国国内压榨活动以及国际需求的变化。豆油：基金连续增持多头头寸豆油市场在周一表现出强劲的上涨势头。尽管特朗普关税言论引发了一定的市场担忧，但CBOT豆油期货价格仍表现出强劲的反弹势头。持仓数据显示，基金在2月3日增加了3000手豆油净多头头寸，连续五个交易日增持多头头寸。未来，豆油市场的走势将取决于国际植物油市场的供需状况以及原油价格的变化。如果原油价格继续上涨，豆油价格可能会受到进一步的支撑。未来趋势展望总体来看，CBOT谷物市场在短期内受到特朗普暂停关税言论的提振，表现出强劲的反弹势头。基金持仓数据显示，市场对玉米、大豆、小麦、豆粕和豆油的价格走势均持乐观态度。然而，未来市场的走势仍将受到多种因素的影响，包括国际贸易局势、南美天气状况以及美国国内需求的变化。短期内，市场可能会继续受到贸易消息的驱动，但中长期来看，基本面因素将成为决定价格走势的关键。投资者应密切关注美国农业部的作物报告以及国际贸易局势的进一步发展，以更好地把握市场机会。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2656467",
            "pub_date": "2025-02-04 08:40:16",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656458,
            "title": "原油交易提醒：供给端担忧加上增产影响，油价空头继续发力？",
            "description": "<div><br>周二（2月4日）美原油亚盘时段延续下跌，交投于72.44美元/附近，基本面上特朗普周二对墨西哥、加拿大和亚洲大国的商品全面征收关税。影响全球经济增长并重燃通胀的担忧情绪再起，巴克莱银行分析师Amarpreet Singh在一份报告中说\"对加拿大进口能源征收关税可能比对墨西哥进口能源征收关税对国内能源市场的破坏性更大，甚至可能对总统的主要目标之一降低能源成本产生反作用，\"。根据美国能源部的数据，加拿大和墨西哥合计占美国炼油厂加工成汽油和取暖油等燃料的石油供应的四分之一左右。美国制造业在1月份实现了两年多来的首次增长，但由于特朗普的关税政策，复苏可能是短暂的，这将有可能进一步提高原材料价格并阻塞供应链。波士顿联储银行总裁柯林斯(Susan Collins)周一表示，特朗普政府宣布的关税类型可能会推高通胀，同时指出目前存在很多不确定性，美联储也没有改变货币政策方向的紧迫性。OPEC+周一同意坚持从4月起逐步提高石油产量的政策，并将美国政府能源信息署(EIA)从其用于监测产量和供应协议遵守情况的信息来源中剔除。俄罗斯副总理诺瓦克周一表示，主要产油国联盟OPEC+联合部长监督委员会（JMMC）会议讨论了美国总统特朗普提高石油产量的呼吁。OPEC+与美国总统特朗普在2016-2020 年其首轮任期期间多次发生冲突，当时特朗普要求OPEC+提高产量，以弥补美国制裁导致的伊朗供应下降。OPEC+在一份声明中说：\"经过OPEC秘书处的全面分析，委员会用 Kpler、OilX 和 ESAI 取代了 Rystad Energy 和能源信息署 (EIA)。作为用于评估原油产量和减产协议遵守情况的次要信息来源的一部分。一位OPEC+消息人士称，剔除EIA 数据是因为该机构没有就所需信息进行沟通。OPEC+目前的减产规模为585万桶/日，相当于全球供应量的约5.7%，这是通过2022年以来达成的一系列减产协议累计而成的。12 月，OPEC+ 将其最新减产计划延长至 2025 年第一季度，将开始增产的计划推迟至 4 月。由于需求疲软和集团外供应增加，OPEC+多次推迟减产计划，此次延长是最近的一次。从 4 月开始，阿联酋将结束 220 万桶/日的减产行动（最新的减产计划）并开始增产，每月增产 13.8 万桶/日。增产将持续到 2026 年 9 月。根据OPEC+以往的惯例，预计将在 3 月初就4 月增产做出最终决定。技术层面上来看，美原油日线冲高回落之后继续下行，叠加市场风险偏好走低，形成共振下跌，目前已经尚未跌破72美元整数关支撑。观察是否有效，若继续下破，则油价面临重回空头区间的可能性。北京时间08：03，美原油现报72.43美元/桶。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2656458",
            "pub_date": "2025-02-04 08:20:17",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}