{
    "data": [
        {
            "id": 2657849,
            "title": "港股异动 | 黄金股普遍高开 避险情绪推动金价屡创新高 大行看高金价至3000美元",
            "description": "<div> 智通财经APP获悉，黄金股普遍高开，截至发稿，灵宝黄金(03330)涨2.7%，报4.95港元；山东黄金(01787)涨2.51%，报14.7港元；招金矿业(01818)涨1.87%，报13.1港元；紫金矿业(02899)涨0.92%，报15.44港元。消息面上，避险情绪推动国际金价大幅上涨。春节假期期间，伦敦现货黄金与纽约商品交易所（COMEX）黄金期货均刷新历史高位，2月5日，现货黄金一度上探2848.25美元，续刷历史新高。花旗认为，关税进一步升级将导致在6-12个月内看涨黄金，金价将升至每盎司3000美元。中金表示，展望2025年，金价或仍处牛市通道，2025年或有望突破3000美元/盎司，人民币金价或将较之美元金价实现更大涨幅。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657849",
            "pub_date": "2025-02-05 09:48:46",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657821,
            "title": "黄金又破纪录!关税战火点燃“避险王“行情，投行高呼3000美元不是梦",
            "description": "<div> 智通财经APP获悉，2月5日，黄金价格重新回升至历史新高，主要原因是市场避险情绪升温。在中国对美国征收关税以报复美国总统唐纳德·特朗普的关税政策后，投资者纷纷寻求避险资产。截至发稿，现货黄金上涨0.04%，至每盎司2,843.08美元，盘中早些时候触及2,845.14美元的历史高位。美国黄金期货收盘上涨0.7%，至2,875.80美元。德国商业银行分析师卡斯滕·弗里奇指出，特朗普反复无常的关税决定加剧了市场的不确定性，这有利于黄金作为避风港的吸引力。摩根大通数据显示，上周黄金市场出现净流出，但贸易关税的不确定性正在推动投资者重新进入避险资产。该银行表示，截至1月31日当周，贵金属未平仓合约下降4.6%，即113亿美元。RJO <br>Futures高级市场策略师鲍勃·哈伯科恩表示，关税消息是当前市场的主要驱动因素，而美元走势也对金价产生了影响。美元指数在2月5日下跌0.9%，使得黄金对其他货币持有者来说更加便宜，这在一定程度上推动了金价上涨。2月份近月Comex黄金收盘上涨0.7%，至2,853.30美元/盎司，再创历史结算新高。2月份近月白银收盘上涨1.5%，至32.888美元/盎司，为10月30日以来的最佳结算价。据了解，中国对美国进口产品征收关税的反制措施加剧了世界两大经济体之间的贸易战，尽管特朗普暂缓对墨西哥和加拿大征收关税。三位美联储官员警告称，特朗普政府的贸易关税计划伴随着通胀风险，其中一位官员认为，价格前景的不确定性要求降息速度比其他情况更慢。美国12月就业岗位空缺降至760万个，低于市场普遍预期的800万个，表明经济可能放缓。此外，传统上，黄金被视为对冲通胀和地缘政治不确定性的工具，但较高的利率会降低这种无收益资产的吸引力。不过，XS.com的拉尼娅·古莱表示，黄金的整体上涨趋势依然完好，任何回调都应被视为买入机会，因为支撑因素并未发生根本性改变。她还补充道，由于市场依然不确定，黄金可能仍将是投资者关注的焦点，既可作为对冲工具，也可作为投资机会。Kitco Metals高级市场分析师Jim <br>Wyckoff表示，鉴于现任美国政府的破坏性政策给市场带来了不确定性，再加上各大央行可能增加黄金购买量以分散对美元资产的持有，今年金价可能达到3,000美元。目前，投资者的注意力转向周三的ADP就业报告、周五的非农就业报告以及几位美联储官员的讲话。其他贵金属方面，现货白银上涨2.5%，至每盎司32.33美元。铂金上涨0.4%，至每盎司967.94美元，钯金下跌1.3%，至每盎司994美元。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657821",
            "pub_date": "2025-02-05 09:49:03",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657867,
            "title": "原油交易提醒：供给端担忧情绪再起，原油多头蓄势待发？",
            "description": "<div><br>周三（2月5日）美原油亚盘时段延续上涨，交投于72.88美元/桶附近，基本面上贸易冲突施压油价，使得短期波动率进一步放大。从API库存数据上来看，美国至 1 月 31 日当周 API 原油库存变化值录得 502.5 万桶是 2024 年 10 月 4 日当周以来最大增幅，此前一周增加 286.2 万桶。根据分析师估计，截至 1 月 31 日的一周内，原油库存增加了约 200 万桶。上周汽油库存增加了约 50 万桶，包括柴油和取暖油在内的馏分油库存减少了约 150 万桶。调查显示，炼厂产能利用率估计比前一周的 83.5%提高了 0.2 个百分点。这项调查是在美国石油协会(API)和美国能源信息署(EIA)发布库存报告之前进行的。EIA称，在截至1月24日的一周内，原油库存增加了350万桶，达到4.151亿桶，而分析师预期为增加320万桶。短期库存数据激增，施压油价，但并未能使得油价向下破位。特朗普再次施加\"最大压力\"，旨在遏制伊朗石油出口与核计划美国总统特朗普周二恢复了他对伊朗的\"最大压力\"行动，包括努力将伊朗的石油出口降至零，以阻止德黑兰获得核武器。在与以色列总理内塔尼亚胡会晤之前，特朗普签署了总统备忘录，重新实施在其第一个任期内美国对伊朗采取的强硬政策。在签署备忘录时，特朗普称其非常强硬，并表示他对是否采取这一行动感到纠结。他说，他对与伊朗达成协议持开放态度，并表示愿意与伊朗领导人会谈。\"对我来说，这很简单：伊朗不能拥有核武器，\"特朗普说。当被问及德黑兰距离核武器有多近时，特朗普说：\"他们太接近了\"。在纽约的伊朗驻联合国代表团没有立即回应置评请求。特朗普指责前总统拜登未能严格执行石油出口制裁，这让伊朗得以出售石油来资助核武器计划和中东地区的武装份子，从而使伊朗更加胆大妄为。特朗普的备忘录责令美国财长对伊朗施加\"最大经济压力\"，包括对违反现有制裁措施的行为实施的制裁和强制执行机制。备忘录还指示财政部和国务院实施一项旨在\"将伊朗石油出口降至零\"的行动。美国油价周二因特朗普计划签署备忘录的消息而缩窄跌幅，这抵消了中美关税战带来的一些疲软。ClearView Energy分析师Kevin Book说，特朗普政府可能会执行2024年的《停止藏匿伊朗石油法》（SHIP），以减少部分伊朗石油供应。特朗普还指示美国驻联合国大使与盟国合作，\"完成对伊朗的国际制裁和限制的恢复\"；根据2015年伊朗与主要大国达成的协议，这些制裁已被解除，以换取伊朗限制发展其核计划。在特朗普第一个任期内的2018年，美国退出了该协议，伊朗也开始背离其在该协议下的核承诺。技术层面上来看，美原油日线大幅走低之后波动率放大，但均线并未拐头向下，短期没有明确的方向，因价格跌破重要支撑之后反抽，等待二次回踩为主。日内重点留意昨日低点70.50美元附近，若支撑确认有效，则不排除多头再次向上发力的可能性。北京时间09：37，美原油现报72.81美元/桶。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2657867",
            "pub_date": "2025-02-05 09:40:18",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657835,
            "title": "2月5日亚市更新支撑阻力：18品种支撑阻力(金银铂钯原油天然气铜及十大货币对)",
            "description": "<div><br>2月5日亚市更新的黄金、白银、铂金、钯金、原油、天然气、铜（商品）以及：美元指数、欧元、英镑、日元、瑞郎、澳元、加元、纽元(热门货币对)的支撑阻力位一览。本交易日关注：①16:50 法国1月服务业和综合PMI终值；②16:55 德国1月服务业和综合PMI终值；③17:00 欧元区1月服务业和综合PMI终值； ④17:30 英国1月服务业和综合PMI终值； ⑤21:15 美国1月ADP就业人数；⑥21:30 美国12月贸易帐，加拿大12月贸易帐；⑦22:00 美国里士满联储主席巴尔金参加一场炉边谈话⑧22:45 美国1月SPGI服务业与综合PMI终值； ⑨3:00 美国1月ISM非制造业指数； ⑩23:30 美国能源信息署（EIA）发布政府版原油库存周报；?次日02:00 美国芝加哥联储主席Goolsbee（2025年FOMC票委）讲话。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2657835",
            "pub_date": "2025-02-05 09:20:18",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657782,
            "title": "美国经济强势+贸易避险“双引擎“撑腰 美元闪跌难撼多头信心",
            "description": "<div> 智通财经APP获悉，交易员们押注，鉴于美国经济相对强劲以及贸易战可能迫使投资者进入避险资产的背景下，美元2月5日的暴跌可能是短暂的。2月5日，彭博美元现货指数下跌0.7%，结束了此前连续六个交易日的上涨势头。该指数此前在本周初的亚洲交易中达到2022年以来的最高水平，当时投机者为定于2月1日生效的美国关税做好准备。然而，美国总统唐纳德·特朗普在2月4日决定推迟对墨西哥和加拿大征收关税，美元回吐涨幅，目前美元指数略低于上周收盘价。分析师观点尽管如此，市场观察人士大多认为此次下跌只是暂时的挫折。野村国际、布朗兄弟哈里曼和汇丰银行表示，无论特朗普的关税政策如何变化，做多美元都是一个强有力的理由。德国商业银行和瑞穗银行则认为，对贸易前景的持续担忧可能会支撑美元做多。德国商业银行和瑞穗银行的策略师认为，鉴于采取额外关税措施的风险，贸易问题将提振美元，而欧盟可能是下一个目标。德国商业银行高级外汇分析师Antje <br>Praefcke表示：“只要特朗普还在大舞台上炫耀自己的实力，谁会真的想做空美元呢?下一次冲击肯定会到来，而且很可能再次利好美元。”野村证券十国集团外汇现货交易主管安东尼·福斯特表示：“如果完全不讨论关税问题，做多美元仍然有充分的理由。”对于美元多头来说，关键在于美国经济继续跑赢其他经济体，这增强了市场对美联储将在年中左右之前放弃进一步降息、并且在年底前降息幅度将低于欧洲央行和英国央行的预期。汇丰银行策略师达拉格·马希尔指出：“如果我们从关税的喧嚣中退一步，你仍然会回到美国的故事中，而且在很大程度上，它一直是美国例外主义的故事之一。”尽管如此，彭博美元指数仍跌至当日最低水平，此前有报道称，美国12月份的职位空缺数量下降幅度超过预期，达到三个月来的最低水平，表明劳动力市场正在逐渐放缓。市场对特朗普关税政策的调整反应明显。特朗普同意将对加拿大和墨西哥征收25%关税的期限推迟一个月，市场对此感到些许宽慰。但全球贸易紧张局势依然存在，交易员们正在等待观察中国反击措施的效果，因为特朗普对中国的10%关税已于2月1日生效。在新兴货币市场，多数货币上涨，智利比索领涨，铜价也随之上涨。铜是智利最大的出口产品，也是全球经济增长的风向标。受美元下跌的推动，铜价在伦敦上涨，美元下跌使持有其他货币的买家更便宜。期权市场中衡量美元人气的指标仍接近七个月以来的最高水平。摩根大通策略师帕特里克·洛克等指出，到目前为止，他们还没有看到衍生品市场中美元多头仓位普遍平仓的证据。自美国总统大选以来，彭博社的美元指数已上涨约4%。交易员们纷纷押注美元将升值，因为他们猜测特朗普的政策可能会促进经济增长并重新引发通胀。根据美国商品期货交易委员会的最新数据，投机交易员持有约337亿美元的看涨头寸，接近2019年以来的最高水平。XTB Ltd.研究主管凯瑟琳·布鲁克斯表示：“与过去几个月一样，美元的上涨趋势仍然十分明显。美元的走势呈现多年周期，我们将继续观察这种走势。”</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657782",
            "pub_date": "2025-02-05 08:57:06",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657306,
            "title": "贵金属持续走强，现货金价涨破2840再创历史记录",
            "description": "<div> 财联社2月4日讯（编辑 赵昊）周二（2月4日）纽约时段，现货黄金明显走强冲破2840关口，刷新了前一日录得的历史记录。截至发稿，现货金价现报每盎司2844美元，日内涨幅超1%；美国黄金期货主连价格最高报每盎司2874美元，超越了前一日2872美元的新高。现货黄金价格日线图<br>与此同时，现货白银价格突破32美元关口，最高时报每盎司32.24美元，为2024年12月13日以来的最高水平，日内涨幅接近2%；美国白银期货主连价格也突破33美元。现货白银价格日线图<br>分析指出，黄金和白银走高除了避险需求外，美元的回落起到了主要作用。美元指数现报108.37，较前一日的高点109.88累计下跌了约150个点。RJO Futures高级市场策略师Bob Haberkorn称，“本周美元走势强劲，如今，美元下跌肯定有助于金价上涨。”前一日，美国总统特朗普先后决定推迟对加拿大和墨西哥加征关税，延缓期为30天。墨西哥和加拿大也各自宣布暂时放弃对美国的报复性措施。美国银行首席加拿大和墨西哥经济学家Carlos Capistran评论道，“关税将像薛定谔的猫一样，我们认为最终结果是重新谈判USMCA（《美墨加协议》），以达成USMCA 2.0。”Capistran认为，只有达成USMCA 2.0，才能证明北美的关税威胁真正结束。XP Investimentos策略师Marco Oviedo表示，“墨西哥的危机似乎已经避免，但肯定还没有完全脱离困境。威胁仍然存在。我们需要等待结果是否能按照约定在一个月内公布。”周一的时候，三位美联储官员警告称，特朗普政府的关税计划会带来通胀风险，其中一位官员认为，价格前景的不确定性正令降息速度变得慢一些。美国与加拿大紧张关系的缓和消除了石油市场短期风险，美国将继续从加拿大进口原油，这导致日内国际原油价格明显走低。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657306",
            "pub_date": "2025-02-05 08:57:29",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657725,
            "title": "特朗普贸易政策推动避险需求 黄金价格一飞冲天！",
            "description": "<div> 智通财经APP获悉，近期，投资者因关税问题而感到忧虑，但黄金市场却成为一个亮点。随着美国总统唐纳德·特朗普持续释放关税威胁，市场不确定性上升。截至目前，黄金价格已上涨近9%，接近每盎司2,900美元的历史新高，而2024年黄金价格已累计上涨近30%。与此同时，矿业股的表现更加强劲。VanEck黄金矿业ETF（GDX.US）今年以来已上涨18%。尽管经历了大幅上涨，投资者仍需谨慎对待市场风险。然而，如果金价继续走高，矿业股仍可能有进一步上涨空间，而这种情况的可能性正在增加。根据世界黄金协会的数据显示，波兰、土耳其、印度和中国等新兴市场国家的央行在2024年底大举购入黄金。世界黄金协会高级市场策略师Joe Cavatoni表示：“新兴市场央行坚定看好黄金，并且有能力进一步增持。从战略上看，他们将继续成为黄金的主要买家。”本轮金价上涨的核心因素仍是特朗普政府的贸易政策。值得注意的是，黄金价格的飙升与美元同步上涨，这在历史上并不常见。Kinesis Money市场分析师Frank Watson指出，通常情况下，美元走强会对以美元计价的黄金价格构成压力。然而，由于市场对美国贸易政策带来的经济和通胀影响感到不安，黄金的避险属性仍然强劲。换句话说，特朗普的贸易政策可能正在“盖过”美元走强对金价的抑制作用。不仅仅是黄金，白银价格也出现强势上涨。今年以来，白银价格已上涨约13%。实物贵金属经销商Allegiance Gold首席运营官Alex Ebkarian在接受采访时表示，市场的不确定性将继续推动黄金和白银价格攀升。他指出：“在高风险环境下，实物黄金和白银的吸引力更加强烈，因为它们消除了对手方风险，并提供了可靠的价值存储。”此外，摩根大通最近交付了价值约40亿美元的黄金期货，这被认为是针对潜在贸易中断的一种对冲策略。展望未来，State Street SPDR业务首席投资策略师Michael Arone预测，今年金价可能突破3,000美元大关。他表示：“地缘政治风险以及全球货币和财政政策的结构性转变将进一步提振黄金市场。”Arone认为，全球央行在2025年仍可能持续购入黄金，这将为金价提供支撑，并可能引发投资者对黄金的进一步追捧。对于矿业股而言，即使经历了一轮大涨，估值仍然相对合理。VanEck黄金矿业ETF目前的市盈率约为2025年预期收益的12倍，低于其过去五年平均15倍的估值。此外，该ETF目前的市盈率比标普500指数低约45%，远高于其通常20%的折价水平，这意味着矿业股在整体市场中仍具吸引力。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657725",
            "pub_date": "2025-02-05 08:57:56",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657049,
            "title": "A股春季躁动加速？投资主线有哪些？十大券商策略来了",
            "description": "<div> 财联社2月4日讯（编辑 笠晨）十大券商最新策略观点新鲜出炉，具体如下：中信建投：多重因素助推跨年行情迎接主升段 AI+仍是核心主线中信建投策略陈果团队最新研报指出，多重因素助推跨年行情迎接主升段。节前推动中长期资金入市、第二批保险资金长期股票投资试点等多项政策推出，信心重估牛逻辑未变。2024年年报业绩预告向好率创新低，但节前已披露完毕，对市场扰动基本结束。假期电影、旅游等消费数据超预期。蛇年首个交易日港股深V反弹，恒生科技指数翻红，港股与中概有率先企稳回升迹象。考虑1月波动后的市场位置，多重因素影响下跨年行情有望迎接主升段。Deepseek推动国内AI+信心重估，AI+仍是核心主线。Deepseek的突破进展是对AI+产业逻辑重大利好，其以更低的成本和更小的算力规模，实现了足以匹敌美国顶尖AI模型的效果，彻底颠覆了业内认为中国在AI竞赛中落后美国竞争对手许多年的固有认知，使得市场对中国科技竞争的信心进一步显著提升，或推动春节后国内AI+产业在全球范围内走出独立行情，国内AI数据、算力、算法、应用等各个环节均将有所表现。中信证券：AI提升风偏 春季躁动加速中信证券研报表示，展望2月，中国资产重估叙事在形成，春季躁动进入加速阶段，交易更加极致，港股的流动性改善空间边际上优于A股，行情重心更偏港股。首先，从A股大势层面来看，关税扰动落地后外部风险在4月前步入平静期，春季躁动时间窗口更加清晰，国产AI重估成为重要情绪催化，而国内宏观政策因素影响暂时淡化，产业信息和情绪的定价极为迅速，交易会更加极致。其次，从市场流动性层面来看，A股短期资金面增量相对有限，中长期资金入市进程和机制更值得关注，相较而言，港股的流动性改善空间更大，进攻属性增强，流动性的长期改善趋势将提升其战略配置地位。最后，从配置策略来看，风格上，预计市场将在春季躁动期间先演绎极致高波风格，后逐步向低波转换；板块上，建议重新重视非美出海逻辑在年报季的持续兑现；行业上，先看AI为代表的强势主题极致演绎，后转向红利+非美出海。华安证券：外部风险缓释提振市场 弹性成长和季节性基建正当时春节期间特朗普加征关税、美联储暂停降息、国内消费数据未加速修复等都在市场预期内，但随后特朗普宣布对加拿大和墨西哥加征关税暂停实施，或表明相关举措可能存在缓和余地，外部风险缓释有望对市场偏好形成提振。配置上，高弹性成长科技包括泛TMT、军工、机器人和强季节性效应的8大基建优势品种最佳，同时短中长期具备配置价值的银行保险也值得关注。海通证券：2025年A股春季行情仍可期海通证券认为，2025年A股春季行情仍可期。借鉴历史，A股春季行情年年有，驱动行情展开的因素主要是三个：政策催化、流动性宽松、基本面改善。而从当前市场环境来看：政策方面近期出台的《关于推动中长期资金入市工作的实施方案》是落实“稳住楼市股市”政策定调的又一重大举措，2月1日证监会主席吴清在《求是》杂志发布了题为《奋力开创资本市场高质量发展新局面》的署名文章，提出要不断开创资本市场高质量发展新局面；流动性方面近期人民币汇率有所回升，人民币对美元汇率从1/20的7.32降至1/27的7.25，汇率压力的边际缓释为货币政策打开空间；基本面方面，春节期间消费数据或望稳定增长，例如据CCTV4公众号援引交通运输部表示2025年春运首日至2月2日全社会跨区域人员流动量预计达到48亿人次，与2024年同期相比增长7.2%。因此综合政策、流动性，以及基本面看，2025年春季行情值得期待。行业机遇：重视硬科技，关注消费医药。在当前我国新旧动能转换背景下，科技板块顺应发展新质生产力的指引，同时产业周期仍处于向上通道，基本面趋势更好、确定性更强。细分领域中我们认为或可重点布局AI技术应用端的消费电子、人形机器人、自动驾驶等，此外还有受到财政的重点支持的数字基建、信创、半导体等。同时中高端制造方面，我国拥有产业集群、工程师红利和技术积累等供给优势、需求端内外需均有支撑，2025年景气有望延续。此外消费医药下跌时间长、低估低配，背后反映的是市场对消费板块投资机会的悲观预期。未来增量财政政策有望倾斜消费，中央经济工作会议将提振消费、扩大内需放在首位，政策发力背景下预期差较大。国泰君安：持股过节后 科技依然是先锋持股过节后，继续看好春节-两会股市窗口期，但指数高度不是重点，棋眼在科技成长。短期关税冲击可控，中长期资金入市托举长期基础，DeepSeek突破意味着商业机会、社会资本与人心共识的凝聚与2025科技主线的确立。行业比较：春季行情科技为要。推荐：1）国产AI模型突破，应用创新加速，看好传媒（游戏/出版/影视/数字媒体）/计算机（软件开发/IT服务），并扩围港股，优质互联网重估；2）科技制造景气回升，推荐汽车（摩托车）/电池/机械（机器人/工程机械）/军工；3）中长期资金入市方案公布，红利资产有望持续受益，结合股息率和经营稳定性，推荐银行/运营商/铁路公路，港股股息率优势更明显。信达证券：第二波上涨有望逐步启动目前处在上涨的早期，主要驱动力是春季前后资金活跃、美国贸易政策低于预期，春节假期，港股表现较强，季节性规律影响下大概率春节后1-2周股市可能偏强，而2月下旬需要验证春节后开工数据情况，这比季节性因素更重要。鉴于各行业的盈利兑现预期较低，信达证券预计牛市第二波上涨初期速度较慢。DeepSeek强化了AI产业链的长期逻辑，但也让AI产业链的利润兑现更加不确定，短期会增加成长股的波动，春节后，有可能风格和节前会有变化。节后1-2周市场可能会偏强。季节性来看，由于春节前后，居民的资产配置行为以及业绩的空窗期，春节前最后一周和节后前两周，股市整体胜率和赔率均不错。节后1-2周股市可能会偏强，2月下旬需要验证春节后开工数据情况。东吴证券：看好节后的“春季躁动”行情东吴证券看好节后的“春季躁动”行情。从季节效应看，2 月处于经济数据、业绩的真空期，同时新的政策预期开始逐步发酵，流动性改善、活跃资金兴起，带动市场风险偏好提升，是春季做多的黄金窗口期。今年“春季躁动”的特殊性在于，市场此前所担忧的海外经济政治不确定性或已阶段性落地，内部政策预期有望升温，降准可能性加大，财政政策的取向和力度<br>将成为市场关注的焦点。在流动性充裕及政策想象空间打开的背景下，节前偏弱的市场情绪为后续预期的再度修复提供了空间，行情有望“躁动”演绎，建议关注强产业趋势品种、外需板块估值修复的α机会，及内需政策催化的方向。民生证券：以沪深300为代表的权重股可能得到重估DeepSeek的出现表明美国对中国的AI压制并非牢不可破，当然这并不意味着公司层面的差距可以马上拉平，更重要的是，当AI不再稀缺，那人工智能以外的变化可能反而会开始重要起来。值得一提的是，当下中国部分领域基本面上也一直在呈现出底部有韧性的特征，如汽车、家电、工程机械的产销量与出口表现始终具备韧性，以旧换新政策驱动下社零2024年10月至12月连续三个月走平，而最新蛇年春节假期的出行、观影数据均创下同期新高等也表明着国内消费韧性仍在。与此同时，从最新业绩预告中也可以看到，部分细分环节的制造业龙头也在对外市场拓展与产能出清的过程中展现出优势。往后看国内基本面也同样有一些方向可以期待：节后的返工潮、“两新两重”政策的进一步丰富以及海外潜在的投资活动超预期，市场新的聚焦都可能出现：中国顺周期制造业和实物工作量周期的资产有所表现。美国金融化的两大逻辑正在迎来拐点。对于A股来说，仍然需要接受“特朗普波动”对全球风险资产的影响，但是其相对韧性将会更多体现。同时，中国基本面在底部的韧性特征需要定价，以沪深300为代表的权重股可能得到重估，推荐：1、全球制造业活动边际修复，叠加金融与安全属性驱动下的实物资产有望迎来顺风时刻（黄金、油、铜、铝、煤炭）；2、低估值的红利资产银行；3、如果未来国内经济活动因国内的“两新两重”和海外投资活动而如期回升。前期定价相对偏低的国内部分顺周期领域同样将有所表现：钢铁（特材），设备（运输设备、工程机械）、农用化工、化学制品等；4、消费领域：白电、旅游。华鑫证券：坚定看多 行情仍未结束开市后进入两会热身时间。如果说2024年是“牛熊转换”年，那么2025年将是牛市初期阶段，波段持仓是较为合理方式。建议节后如有调整建议积极加仓。2月18日、3月5日两周上行概率较大。当前仍能维持高市场交易量情况下，三大主流A股策略中，行业轮动策略有效性开始回暖；小盘择时策略等待春节后寻机加仓；红利风格择时策略在长期绝对收益获取上作为底仓配置。华西证券：A股开门红值得期待展望节后A股，华西证券认为A股开门红值得期待。其一，历史上春节后A股市场表现与长假期间港股市场走势相关性较强；其二，美国加征关税的不确定性已落地；其三，春节期间服务消费数据较高增长，且国产AI、人形机器人等方面主题催化较多。产业方面：1）DeepSeek-R1大模型引发全球投资者关注。1月26日，DeepSeek登顶苹果App Store和谷歌Play Store全球下载榜首；2）宇树科技人形机器人亮相春晚；3）阿里云发布通义千问旗舰版模型Qwen2.5-Max；4）OpenAI上线O3 Mini，推理模型首次免费。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657049",
            "pub_date": "2025-02-05 08:58:15",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657728,
            "title": "特朗普关税政策让美联储陷入两难局面：抗通胀还是保增长？",
            "description": "<div> 随着美国总统特朗普在贸易政策上的强硬立场，美联储正面临一个复杂的局面：究竟是采取措施遏制通胀，还是优先支持经济增长？特朗普政府试图将关税作为外交和经济政策的工具，但这给美联储的政策制定带来了微妙的平衡。智通财经APP获悉，许多经济学家认为，关税可能会推高物价，同时削弱国内生产总值的增速，关键问题在于影响的程度，以及美联储是否需要做出相应的政策调整。嘉信理财首席固定收益策略师Kathy Jones指出，关税可能带来价格冲击，但也可能被美元升值所抵消。然而，从长期来看，关税通常对经济增长不利。Jones表示：“这种组合让美联储陷入真正的困境。”当前，特朗普政府与中国、加拿大和墨西哥的贸易摩擦仍在持续。尽管对加拿大和墨西哥的关税计划已暂缓执行，谈判仍在进行，但与中国的贸易争端却不断升级，市场情绪因此变得紧张。在经济学界，关税通常被视为推高物价的因素，但历史数据并未提供明确的证据。例如，1930年的《斯姆特-霍利关税法》（Smoot-Hawley Tariff Act）不仅没有导致通胀，反而加剧了大萧条的通缩压力。特朗普在其首个总统任期内也曾实施关税政策。当时，美国通胀水平较低，美联储正在加息以寻找“中性”利率水平。然而，关税引发了制造业衰退，尽管这一影响并未蔓延至整个经济体系。但当前情况有所不同。特朗普提出的最新关税政策不再是针对特定商品，而是可能覆盖更广泛的商品类别，这可能会改变美联储的货币政策计算。嘉信理财预测，如果这些关税全面实施，GDP增速可能会减少1.2%，核心通胀率则可能上升0.7%，未来数月内可能超过3%。Jones认为，这种广泛的关税措施“既会对价格产生更大的影响，也会对经济增长带来更大的冲击。”她预测，美联储可能会因关税的不确定性而推迟降息，并在通胀上升的情况下保持观望，直到经济增长开始受到明显影响时才可能调整政策。“但美联储现在确实处于一个困难的境地，因为这是一枚双面硬币。”目前，市场普遍预计美联储将在未来几个月保持利率不变，并观察关税政策的实际影响，而非仅仅基于政策声明采取行动。此外，美联储还将评估2024年最后四个月累计降息1个百分点的效果。如果贸易摩擦有所缓解，或者关税对通胀的影响低于预期，美联储可能会重新关注其双重使命中的就业目标，而非专注于通胀问题。“目前，美联储的政策立场相对稳固，关税问题的反复不会直接改变这一立场，尤其是我们甚至还不知道这些政策最终会如何实施。”AllianceBernstein发达市场研究主管Eric Winograd表示。他预计，在未来几个月，关税的具体影响才会逐渐显现，美联储的政策调整也不会立即做出反应。Winograd认为，尽管关税可能导致部分商品价格短期上涨，但它们不会带来美联储通常关注的长期通胀压力。这一观点也与美联储官员的近期表态一致。美联储官员认为，只有在关税导致全面贸易战或对供需产生更深远的影响时，才会真正影响货币政策决策。波士顿联储主席苏珊·柯林斯在接受采访时表示：“政策如何演变存在很大的不确定性，在没有明确了解最终政策之前，我们无法精确预测其影响。”她强调，美联储的立场是“保持耐心、谨慎行动，目前没有紧迫性需要进一步调整政策。”市场仍然预计美联储将在6月会议上首次降息，随后可能在12月再降息25个基点。美联储上周维持联邦基金利率在4.25%-4.5%区间不变。Winograd表示，美联储今年仍有可能降息两到三次，但不会立即开始，而是要等待关税政策的影响进一步显现。他表示：“考虑到美国经济整体上对贸易摩擦的抗冲击能力，我不认为关税问题会大幅改变美联储的政策方向。市场对美联储的反应机制设想得过于机械化——认为一旦通胀上升，美联储就必须做出应对，而事实并非如此。”</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657728",
            "pub_date": "2025-02-05 08:58:47",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657793,
            "title": "黄金交易提醒：关税战提振避险买需，金价连续四个交易日刷新历史高点",
            "description": "<div><br>周三（2月5日）亚市早盘，现货黄金在历史高位附近窄幅震荡，目前交投于2841.37美元/盎司附近。金价周二再创历史新高至2845.30美元/盎司，为连续四个交易日刷新历史高点，收报2841.85美元/盎司，受投资者寻求避险资产推动，此前中国针对美国总统特朗普的关税措施采取了报复性关税措施。另外，美国12月职位空缺创14个月来最大降幅，也拖累美元和美债收益率下跌，给金价提供上涨动能。RJO Futures的高级市场策略师Bob Haberkorn说道，\"就像周一那样，传来了关税消息；现在，我认为这是比周二传出的任何其他事情和数据更主要的推动力，（不过）我认为它们都将被关税新闻盖过风头。\"Haberkorn 说：\"本周美元走强，但随着美元走低，这也肯定会对金价有所帮助。\"美元周二走低0.4%，收报107.99，因为黄金以美元计价，美元下跌支撑金价上涨。因美国总统特朗普的关税威胁被更多地解读为一种谈判策略而非最终目标，此前一天他暂停了计划对墨西哥和加拿大征收关税的行动。然而，新一届特朗普政府从周二凌晨开始对从中国进口的商品加征10%的关税，分析师表示，他们预计对关税发展的高度敏感性和波动性将持续存在。\"我们仍在关注对中国加征10%关税以及中国的反制行动，这将为市场重新增加一定的风险溢价，\"Monex USA外汇交易员Helen Given说。“我们将看看后续是否会有任何谈判，像之前墨西哥和加拿大的情况那样，关税紧张局势可能会有所缓和。但现在看来，与中国的贸易战又开始了。”北京周二对部分美国进口商品征收关税，对美国新一轮关税迅速采取反制行动，增加了世界两大经济体摊牌的风险。三菱日联金融高级汇市分析师Lee Hardman说，“北京的行动暗示，中国对特朗普最新关税措施的回应持谨慎态度，并未采取过于强硬的回击，同时为未来的谈判留有余地。”市场还在关注特朗普对欧盟的关税威胁。高盛分析师在一份研究报告中说：\"虽然对欧盟征收更广泛的全面关税的前景（现在）非常不确定，但只要关税方面的反复继续下去，长期的贸易不确定性环境本身就会对欧元造成压力。欧盟贸易负责人塞夫科维奇（Maros Sefcovic）周二表示，欧盟希望就美国总统特朗普计划征收的关税与美方迅速接触；欧盟执委会主席冯德莱恩(Ursula von der Leyen)则是预测与华盛顿的谈判将是艰难的。欧盟执委会副主席塞夫科维奇在欧盟部长级会议上表示，希望\"尽早接触\"，并正在等待特朗普对美国商务部长被提名人卢特尼克(Howard Lutnick)以及贸易代表被提名人格里尔(Jamieson Greer)的任命确认。塞夫科维奇对记者表示：\"我们已经准备好立即进行接触，希望藉由这种早期接触，避免采取会给世界最重要的贸易和投资关系带来许多干扰的措施。\"冯德莱恩表示，当务之急在于处理欧盟和美国利益交汇的领域，例如关键供应链和新兴技术，并称欧盟已准备好进行艰难的谈判。她在布鲁塞尔的演讲中表示，\"我们将以开放与务实的态度看待实现这一目标的方法。但我们同样会明确表示，我们将始终维护自身利益\"。白宫贸易顾问纳瓦罗(Peter Navarro)表示，欧洲在汽车增值税问题上与美国针锋相对，显示出谈判的艰困程度。欧盟国家对国内外所有汽车的销售都征收增值税。欧盟官员表示，与特朗普新政府的接触有限，并指出特朗普挑选的高级职位人选获得确认前无法进行对话。自特朗普就职以来，冯德莱恩和特朗普一直没有联系。特朗普已表示，欧盟是下一个目标。他曾多次抱怨美国与欧盟的货物贸易逆差。纳瓦罗认为此一数字为 3500 亿美元。塞夫科维奇表示，包括服务在内的逆差约为500亿欧元，或占欧盟与美国每年1.5万亿欧元贸易总额的3%左右，而欧美之间数以百万计的工作岗位都依赖于这种开放的贸易关系。塞夫科维奇表示：\"我们相信，通过富有建设性的接触和讨论，将能解决这个问题。\"经济数据方面，美国12月职位空缺创14个月来最大降幅，这也拖累美元和美债收益率，给金价提供上涨动能。但稳定的招聘和低裁员暗示就业市场并未突然放缓，美联储可能至少要到6月才会降息。美国劳工部周二公布的职位空缺及劳动力流动调查(JOLTS)显示，每个失业者对应1.1个职位空缺，低于11月的1.15个。美联储主席鲍威尔上周对记者称，“我们不需要急于调整我们的政策立场。“Brean Capital高级经济顾问Conrad DeQuadros表示，“美联储官员可能会将这份报告判断为暗示就业市场已从先前的过热状态降温，但相对于现有工人供应而言，就业需求依然稳固。”美国劳工统计局表示，截至12月最后一天，衡量劳动力需求的职位空缺减少55.6万个，至760万个。这是2023年10月以来的最大降幅。11月职位空缺数上修至815.6万个，前值为809.8万个。经济学家此前12月预计将有800万个职位空缺。职位空缺数较此前一年减少130万个，但仍高于2019年的平均水平。职位空缺率从11月的4.9%降至4.5%。员工数在10至49人的企业职位空缺降幅最大，其次是员工数为50至249人的企业。美国国债收益率周二在震荡交投中下滑，兼受到围绕美国政府贸易政策的持续不确定性的拖累，此前有关关税的诸多头条新闻不断涌现，而最终加拿大和墨西哥获得为期30天的关税暂缓执行。10年期美债收益率周二尾盘下跌2.8个基点，报4.515% ，周一曾跌至12月中旬以来的最低点。该收益率被市场视作无风险收益率，也是持有黄金的机会成本，收益率下降会支撑金价。LPL Financial首席固定收益策略师Lawrence Gillum表示：\"未来几个季度内，市场将不断在关税与威胁之间反复权衡——哪些是切实可行的政策，哪些只是虚张声势的恫吓，这种拉锯会持续上演。\"\"我仍然认为，10年期债券收益率今年晚些时候可能会跌破4%，但这实际上是以经济放缓为前提的，\"Gillum说：\"如果数据继续保持稳定，我们没有理由不在4.50%至5%之间交易。\"Truist Advisory Services 固定收益部董事总经理 Chip Hughey 说：\"尽管市场预期收益率将进一步下行，但政策缺乏明确性正令中长期投资者愈发趋向观望。\"与此同时，美国利率期货市场预计今年大约降息46个基点，即几乎两次降息，每次 25 个基点。根据伦敦证券交易所集团(LSEG)的计算，这一数字高于周一晚些时候的 41 个基点，首次降息可能发生在美联储 6 月或 7 月的政策会议上。投资者的焦点现在转向周三的 ADP 就业报告、周五的就业报告以及多位美联储官员的讲话。（现货黄金日线图，来源：易汇通）北京时间08:06，现货黄金现报2841.37美元/盎司。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2657793",
            "pub_date": "2025-02-05 08:20:15",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}