{
    "data": [
        {
            "id": 3847561,
            "title": "PepsiCo, PayPal, Estee Lauder fall premarket; Spotify, Palantir surge higher",
            "description": "<div>Investing.com - US stock futures edged lower Tuesday, as investors digested China’s retaliation with tariffs against the US as well as more corporate earnings.<br>Here are some of the biggest premarket US stock movers today:<br><br>PepsiCo (NASDAQ:PEP) stock fell 2% after the soft drinks giant reported tepid organic revenue growth as price hikes weighed on demand from cost-conscious U.S. shoppers.<br><br><br>Spotify (NYSE:SPOT) stock surged 8.3% after the music streaming company reported fourth-quarter 2024 results that exceeded revenue expectations while also providing upbeat guidance.<br><br><br>Palantir (NASDAQ:PLTR) stock soared 21% after the data analytics company forecast upbeat annual revenue fueled by strong demand for its software and data analytics services from businesses racing to adopt generative AI.<br><br><br>  Pfizer   (NYSE:PFE) stock rose 1.9% after the drugmaker beat fourth-quarter profit estimates, helped by strong sales of its heart disease drug and a smaller-than-feared drop in COVID vaccine sales.<br><br><br>PayPal (NASDAQ:PYPL) stock slumped 5.4% after the digital payments giant forecast full-year profit above estimates, fueled by a push to revive growth in branded products, improve pricing and sharpen cost-cutting efforts.<br><br><br>  Estee Lauder   (NYSE:EL) stock fell 7.2% after the cosmetic giant issued a fiscal third-quarter outlook that missed expectations, with the company citing weak retail sales trends in its Asia travel retail business.<br><br><br>  Merck   (NSE:PROR) stock fell 7.6% after the drugmaker said it will pause shipments of Gardasil to China through at least mid-year, as continued weak demand for the HPV vaccine there is expected to hurt 2025 revenue. This overshadowed a strong fourth-quarter profit on sales of cancer drug Keytruda.<br><br><br>Regeneron (NASDAQ:REGN) stock rose 2% after the biotechnological company reported fourth-quarter earnings and revenue that exceeded expectations, helped by growth at its flagship eye drug franchise.<br><br><br>Ferrari (NYSE:RACE) stock rose 3.5% after the luxury sports car manufacturer reported strong fourth-quarter earnings, with CEO Benedetto Vigna citing “a strong product mix and a growing demand for personalizations.”<br><br><br>Marathon Petroleum (NYSE:MPC) stock rose 1.4% after the refiner beat fourth-quarter profit estimates, as strength in its midstream and renewable diesel segment helped offset a slump in refining margins.<br><br></div>",
            "link": "https://www.investing.com/news/stock-market-news/pepsico-paypal-estee-lauder-fall-premarket-spotify-palantir-surge-higher-3847561",
            "pub_date": "2025-02-04 20:52:10",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846982,
            "title": "Futures wobble as China retaliates against U.S. tariffs - what's moving markets",
            "description": "<div>Investing.com - U.S. stock futures edged down on Tuesday as traders grappled with the possible consequences of fresh tit-for-tat tariffs between the U.S. and China. Beijing slapped import tariffs on certain U.S. commodity and industrial imports in retaliation to U.S. President Donald Trump's 10% levy on the country. However, Trump moved to delay tariffs on Mexico and Canada, in a potential sign that trade policy with his administration can still be up for negotiation. Against this backdrop and last week's stock market ructions caused by a low-cost artificial intelligence model from China's DeepSeek, Google-owner Alphabet (NASDAQ:GOOGL) is due to report its latest quarterly results.<br>1. Futures lower amid tariff uncertainty<br>U.S. stock futures were hovering below the flatline on Tuesday, as investors assessed the implications of tit-fot-tat tariffs between the U.S. and China.<br>By 03:47 ET (08:47 GMT), the S&P 500 futures contract had dipped by 22 points or 0.4%, Nasdaq 100 futures had shed 69 points or 0.3%, and Dow futures were down by 175 points or 0.4%.<br>The main indices on Wall Street all closed lower on Monday, but still pared back much of their earlier declines in a rollercoaster session. Fears over the impact of Trump's announced 25% tariffs on Mexico and Canada weighed on stocks at the start of trading, but the concerns were somewhat eased after the president said he had agreed to delay the levies on Mexico by one month.<br>Trump later temporarily suspended the tariffs on Canada for 30 days as well. Leaders from both Mexico and Canada agreed to boost security at their respective borders with the U.S. in response to calls from Trump to crack down on drug smuggling and illegal immigration.<br>However, a 10% surcharge on goods incoming from China took effect on Tuesday - sparking retaliatory measures from Beijing (more below).<br>2. China retaliates against Trump tariffs<br>China slapped import tariffs on certain U.S. commodity and industrial imports in retaliation to Trump's levies.<br>China’s finance ministry said it will impose a 15% tariff on coal and liquified natural gas imports from the U.S., and an additional 10% duty on crude oil, agricultural equipment and automobiles from February 10.<br>China’s commerce ministry also placed export controls on rare earths and exotic materials, of which the country is a top producer. The materials covered included tungsten, tellurium, ruthhenium, and molybdenum.<br>Separately, Beijing added Calvin Klein-owner PVH Corp (NYSE:PVH) and biotechnology firm Illumina (NASDAQ:ILMN) to its list of unreliable entities, and initiated an antitrust investigation into Alphabet-owned Google.<br>3. Oil slips<br>Oil prices fell sharply Tuesday as traders gauged the potential for severe disruption to global economic activity due to the tit-for-tat tariffs between the U.S. and China.<br>By 03:48 ET, the US crude futures (WTI) slipped 1.9% to $71.78 a barrel, while the Brent contract fell 1.2% to $75.05 a barrel.<br>Meanwhile, spot gold prices rose slightly in European trade, remaining in sight of a recent peak as safe haven demand for the yellow metal was underpinned by worries over a renewed U.S.-China trade war. Gold was also tracking some weakness in the dollar.<br>\"Despite the US coming to a deal with Canada and Mexico, [...] the uncertainty over trade and tariffs continues to buoy gold prices,\" analysts at ING said in a note to clients.<br>4. Bitcoin rebounds<br>Bitcoin and other major cryptocurrencies rebounded on Tuesday after Trump's decision to postpone the new tariffs on Canada and Mexico.<br>Bitcoin rose 3.0% to $98,221.8 by 03:50 ET. Following the announcement of the tariff delay, the price of the world's most popular digital asset edged above $100,000 on Monday evening.<br>Ethereum, the world's second-biggest cryptocurrency, also climbed.<br>Cryptocurrencies often react to macroeconomic uncertainties, with traders seeking liquidity during times of market stress. The 24/7 nature of crypto trading makes it a readily available asset class for such liquidity needs, especially during weekends when traditional markets are closed.<br>With the immediate threat of trade disruptions between the U.S. and its neighbors reduced, traders have resumed buying, helping stabilize the crypto market. But, despite the recent recovery, analysts have cautioned that the cryptocurrency market remains vulnerable to ongoing geopolitical developments.<br>5. Alphabet to report<br>The uptick in international trade tensions comes during a busy week for markets dotted with earnings from major tech companies.<br>On Tuesday, Google-parent Alphabet is due to report its latest quarterly returns after the closing bell.<br>Analysts will be paying close attention to the search giant's plans for spending on artificial intelligence, particularly after the emergence of an AI model from Chinese start-up DeepSeek last week.<br>DeepSeek said the model rivalled OpenAI's ChatGPT in performance despite using less-advanced data and costing only around $6 million to develop. Although doubts have been cast over the claims, DeepSeek's notoriety has raised questions around recent heavy expenditures on AI by some of Silicon Valley's biggest players, including Alphabet.</div>",
            "link": "https://www.investing.com/news/economy/futures-wobble-as-china-retaliates-against-us-tariffs--whats-moving-markets-3846982",
            "pub_date": "2025-02-04 16:53:03",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846982,
            "title": "Futures wobble as China retaliates against U.S. tariffs - what's moving markets",
            "description": "<div>Investing.com - U.S. stock futures edged down on Tuesday as traders grappled with the possible consequences of fresh tit-for-tat tariffs between the U.S. and China. Beijing slapped import tariffs on certain U.S. commodity and industrial imports in retaliation to U.S. President Donald Trump's 10% levy on the country. However, Trump moved to delay tariffs on Mexico and Canada, in a potential sign that trade policy with his administration can still be up for negotiation. Against this backdrop and last week's stock market ructions caused by a low-cost artificial intelligence model from China's DeepSeek, Google-owner Alphabet (NASDAQ:GOOGL) is due to report its latest quarterly results.<br>1. Futures lower amid tariff uncertainty<br>U.S. stock futures were hovering below the flatline on Tuesday, as investors assessed the implications of tit-fot-tat tariffs between the U.S. and China.<br>By 03:47 ET (08:47 GMT), the S&P 500 futures contract had dipped by 22 points or 0.4%, Nasdaq 100 futures had shed 69 points or 0.3%, and Dow futures were down by 175 points or 0.4%.<br>The main indices on Wall Street all closed lower on Monday, but still pared back much of their earlier declines in a rollercoaster session. Fears over the impact of Trump's announced 25% tariffs on Mexico and Canada weighed on stocks at the start of trading, but the concerns were somewhat eased after the president said he had agreed to delay the levies on Mexico by one month.<br>Trump later temporarily suspended the tariffs on Canada for 30 days as well. Leaders from both Mexico and Canada agreed to boost security at their respective borders with the U.S. in response to calls from Trump to crack down on drug smuggling and illegal immigration.<br>However, a 10% surcharge on goods incoming from China took effect on Tuesday - sparking retaliatory measures from Beijing (more below).<br>2. China retaliates against Trump tariffs<br>China slapped import tariffs on certain U.S. commodity and industrial imports in retaliation to Trump's levies.<br>China’s finance ministry said it will impose a 15% tariff on coal and liquified natural gas imports from the U.S., and an additional 10% duty on crude oil, agricultural equipment and automobiles from February 10.<br>China’s commerce ministry also placed export controls on rare earths and exotic materials, of which the country is a top producer. The materials covered included tungsten, tellurium, ruthhenium, and molybdenum.<br>Separately, Beijing added Calvin Klein-owner PVH Corp (NYSE:PVH) and biotechnology firm Illumina (NASDAQ:ILMN) to its list of unreliable entities, and initiated an antitrust investigation into Alphabet-owned Google.<br>3. Oil slips<br>Oil prices fell sharply Tuesday as traders gauged the potential for severe disruption to global economic activity due to the tit-for-tat tariffs between the U.S. and China.<br>By 03:48 ET, the US crude futures (WTI) slipped 1.9% to $71.78 a barrel, while the Brent contract fell 1.2% to $75.05 a barrel.<br>Meanwhile, spot gold prices rose slightly in European trade, remaining in sight of a recent peak as safe haven demand for the yellow metal was underpinned by worries over a renewed U.S.-China trade war. Gold was also tracking some weakness in the dollar.<br>\"Despite the US coming to a deal with Canada and Mexico, [...] the uncertainty over trade and tariffs continues to buoy gold prices,\" analysts at ING said in a note to clients.<br>4. Bitcoin rebounds<br>Bitcoin and other major cryptocurrencies rebounded on Tuesday after Trump's decision to postpone the new tariffs on Canada and Mexico.<br>Bitcoin rose 3.0% to $98,221.8 by 03:50 ET. Following the announcement of the tariff delay, the price of the world's most popular digital asset edged above $100,000 on Monday evening.<br>Ethereum, the world's second-biggest cryptocurrency, also climbed.<br>Cryptocurrencies often react to macroeconomic uncertainties, with traders seeking liquidity during times of market stress. The 24/7 nature of crypto trading makes it a readily available asset class for such liquidity needs, especially during weekends when traditional markets are closed.<br>With the immediate threat of trade disruptions between the U.S. and its neighbors reduced, traders have resumed buying, helping stabilize the crypto market. But, despite the recent recovery, analysts have cautioned that the cryptocurrency market remains vulnerable to ongoing geopolitical developments.<br>5. Alphabet to report<br>The uptick in international trade tensions comes during a busy week for markets dotted with earnings from major tech companies.<br>On Tuesday, Google-parent Alphabet is due to report its latest quarterly returns after the closing bell.<br>Analysts will be paying close attention to the search giant's plans for spending on artificial intelligence, particularly after the emergence of an AI model from Chinese start-up DeepSeek last week.<br>DeepSeek said the model rivalled OpenAI's ChatGPT in performance despite using less-advanced data and costing only around $6 million to develop. Although doubts have been cast over the claims, DeepSeek's notoriety has raised questions around recent heavy expenditures on AI by some of Silicon Valley's biggest players, including Alphabet.</div>",
            "link": "https://www.investing.com/news/economy-news/futures-wobble-as-china-retaliates-against-us-tariffs--whats-moving-markets-3846982",
            "pub_date": "2025-02-04 16:53:03",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846860,
            "title": "Japan's biggest lender MUFG's quarterly profit jumps by nearly a third",
            "description": "<div> TOKYO (Reuters) -Japan's largest lender Mitsubishi UFJ (NYSE:MUFG) Financial Group reported on Wednesday a 32% surge in quarterly net profit, powered by sales of cross-shareholdings and a bump in margins due to higher interest rates in Japan. Three rate hikes since March 2024 have widened domestic loan spreads, while the return of inflation has encouraged large Japanese corporations, which make up the bulk of MUFG's corporate clients, to take on loans for growth investments. Profit in the October-December period came in at 490.74 billion yen ($3.16 billion) versus 370.64 billion yen a year earlier, according to Reuters' calculations based on nine-month cumulative figures disclosed in a filing. MUFG has reached 99.9% of its annual profit guidance of 1.75 trillion yen in the first nine months of the financial year, and is narrowly trailing the 1.841 trillion yen average annual estimate of 14 analysts polled by LSEG. The lender, which owns about 23.5% of Wall Street bank  Morgan Stanley  (NYSE:MS), sold an additional 55 billion worth of its equity holdings over the October-December period, with a further 37 billion agreed to be sold before the end of March 2027.  ($1 = 155.2400 yen) </div>",
            "link": "https://www.investing.com/news/stock-market-news/japans-biggest-lender-mufg-posts-32-jump-in-thirdquarter-profit-3846860",
            "pub_date": "2025-02-04 15:52:31",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846823,
            "title": "Nintendo cuts Switch sales forecast ahead of successor device launch",
            "description": "<div> By Sam Nussey TOKYO (Reuters) -Japan's Nintendo cut its full-year sales  Switch  (NYSE:SWCH) forecast by 12% to 11 million units as the aging console loses momentum ahead of the launch of a successor device this year. Nintendo remains dependent on its console business even as it has opened stores and its roster of characters feature in theme parks and film.  \"While we think sales of hardware and software are solid for the eighth year, we did not achieve our plan,\" Nintendo President Shuntaro Furukawa told an earnings briefing.  Nintendo sold 9.54 million Switch units in the April-December period, bringing lifetime sales to 150.86 million units.  Last month Nintendo said it will release a successor to the hit home-portable Switch console this year with a Nintendo Direct event to air on April 2.  The Switch 2 appears to closely follow the design of its predecessor, which transformed Nintendo's fortunes after the underperformance of the Wii U.  The company lowered its operating profit forecast by 22.2% to 280 billion yen ($1.8 billion) for the financial year ending March.  In the April-December period, profit fell 46.7% to 247.6 billion yen.  ($1 = 155.2900 yen) </div>",
            "link": "https://www.investing.com/news/stock-market-news/nintendo-operating-profit-fell-467-in-the-nine-months-ended-dec-31-3846823",
            "pub_date": "2025-02-04 15:55:46",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846799,
            "title": "UBS trounces profit forecasts, $3 billion share buyback conditional on capital rules",
            "description": "<div> By Ariane Luthi ZURICH (Reuters) -UBS Group posted fourth-quarter profit that beat forecasts by a wide margin and said it would buy back up to $3 billion in shares this year if there were no major changes to bank capital rules in Switzerland in the near term. The country's largest lender, which has made progress in integrating former rival Credit Suisse, said it plans to repurchase $1 billion of shares in the first half of 2025 and up to $2 billion in the second half. To prevent a repeat of scandal-hit Credit Suisse's meltdown, Swiss authorities have pledged to draw up stricter banking regulations, at the centre of which are plans to make UBS hold more capital. But it is not yet clear how much that will be. UBS says existing capital requirements are appropriate and has warned the Swiss government that excessive demands could make the country's financial sector less competitive. The fourth quarter saw UBS post net profit attributable to shareholders of $770 million, marking its fourth consecutive quarter of profit. That was far more than an average estimate of $483 million in a company-provided poll, with UBS benefitting from lower-than-expected costs, robust revenues and a strong performance by its investment bank. \"We achieved all key integration milestones in 2024 and significantly reduced execution risk, while our capital position remained robust,\" UBS CEO Sergio Ermotti said in a statement. \"We are confident in our ability to substantially complete the integration by the end of 2026, achieve our financial targets, and fulfill our growth initiatives as we position UBS for a successful future,\" he added. UBS said it was on track to achieve planned cost savings, though it raised its forecast for integration-related expenses to $14 billion by the end of 2026, up from $13 billion.  Total  (EPA:TTEF) revenues climbed 7% to $11.6 billion year-on-year, narrowly beating the company-provided consensus forecast of $11.5 billion. The bank also said it would maintain its target common equity tier 1 capital (CET1) ratio of around 14%.  Analysts at Bank Vontobel lauded UBS for \"good cost management\" though Citi analysts noted overall cost saving and cost-income guidance through end-2026 remained unchanged and gave a neutral rating. \"On balance a decent set of results, but perhaps not as good as at first glance,\" the Citi analysts wrote. Net new assets attracted in global wealth management during the quarter amounted to $18 billion, missing a forecast of $21 billion from Zuercher Kantonalbank analysts. Investors have warmed to the 2023 Credit Suisse takeover, with UBS's shares rising by more than 80% since then. UBS Chief Executive Sergio Ermotti said last week the migrating of Credit Suisse clients to its IT system was going well, but that it would remain a major focal point for the next 12 months. </div>",
            "link": "https://www.investing.com/news/stock-market-news/ubs-quarterly-profit-smashes-expectations-3-billion-buyback-unveiled-3846799",
            "pub_date": "2025-02-04 15:56:06",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846576,
            "title": "U.S. crude prices down nearly 2% as levies on China take effect",
            "description": "<div> By Katya Golubkova, Trixie Yap (Reuters) -U.S. crude prices fell by nearly 2% on Tuesday as U.S. tariffs on China took effect, though President Donald Trump paused for a month a decision on steep levies on neighbours Canada and Mexico. U.S. West Texas Intermediate (WTI) crude declined $1.32, or 1.8%, to trade at $71.84 per barrel, while Brent futures fell 87 cents, or 1.2%, to $75.09 by 0617 GMT. U.S. tariffs of 10% on Chinese imports took effect at mid-day in Asian trade, spurring Beijing to retaliate with levies of 15% on U.S. coal and liquefied natural gas and 10% on crude oil starting from Feb. 10. \"China’s counter-tariffs on the US may be perceived as a sign of escalation and may reduce the likelihood of a temporary resolution akin to U.S. agreements with Mexico and Canada,\" IG market strategist Yeap Jun Rong said in an email.  \"As such, broader risk sentiments pare some optimism amid the changing dynamics, with oil prices extending losses further.\" He added, \"Market participants are back to price for potential downside risks to global growth in the event of further tit-for-tat measures from both the United States and China.\"  China's 2024 crude oil imports from the United States make up 1.7% of its total imports of crude, customs data show.  \"WTI flows to China will be impacted, as a 10% tariff ... will render WTI delivered to China very expensive against other alternative crude like Kazakhstan's CPC and Abu Dhabi's Murban,\" Sparta Commodities' senior analyst June Goh told Reuters. \"However, in the big scheme of things, this should not impact the price of WTI significantly as WTI can still flow to other regions easily,\" she added on messaging app WhatsApp.   Earlier, Canadian Prime Minister Justin Trudeau and Mexican President Claudia Sheinbaum said they had agreed to bolster border enforcement efforts in response to Trump's demand to crack down on immigration and drug smuggling.  That would pause for 30 days tariffs of 25%, with a 10% tariff on energy imports from Canada, that had been set to take effect on Tuesday.  On the demand side, investors will be looking out for weekly U.S. oil stockpile data for the week to Jan. 31. [EIA/S] Analysts polled by Reuters expected that crude inventories rose, while gasoline and distillate inventories probably fell. </div>",
            "link": "https://www.investing.com/news/commodities-news/wti-oil-prices-down-after-mexico-canada-say-trump-agrees-to-pause-tariffs-3846576",
            "pub_date": "2025-02-04 15:56:26",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846855,
            "title": "Diageo withdraws medium-term goals as tariffs cloud outlook",
            "description": "<div> (Reuters) -Diageo withdrew its medium-term organic sales growth target on Tuesday as the world's top spirits maker took steps to try and mitigate the impact of U.S. tariffs.  The maker of Johnnie Walker whisky and Guinness beer had previously forecast medium-term organic net sales growth of 5% to 7%. It said it had scrapped the forecast because macroeconomic and geopolitical uncertainty were hurting the pace of its recovery. CEO Debra Crew said tariffs in the U.S. announced over the weekend added to \"further complexity in our ability to provide updated forward guidance\". Over the weekend U.S. President Donald Trump imposed tariffs on China, Canada and Mexico, although on Monday he agreed a 30-day pause on the tariffs on Canada and Mexico. China hit back on Tuesday with tariffs of its own on some U.S. goods.   Diageo  (LON:DGE) said there were a number of possible actions it could take to help mitigate the impact of tariffs including pricing, inventory management, re-allocation of investments and supply chain optimisation.  \"We will ... continue to engage with the U.S. administration on the broader impact that this will have on ...consumers, employees, distributors, restaurants, bars and other retail outlets,\" Crew said in a statement.  The company said its tequila made in Mexico and exported into the United States would be the most hit by U.S. tariffs. It would also see a hit on its Canadian whisky that it exports to the U.S.  Diageo said its organic sales grew 1% in July-December 2024, beating a 0.4% increase expected by analysts in a company-compiled poll. Investors had expected new finance chief Nik Jhangiani, who took office in September, to row back the company's medium-term sales target given falling sales across the alcoholic beverages sector.  Consumers have remained cautious and the macroeconomic recovery is taking longer than expected, particularly in North America and China, Diageo said.  </div>",
            "link": "https://www.investing.com/news/stock-market-news/diageo-withdraws-mediumterm-sales-forecast-3846855",
            "pub_date": "2025-02-04 15:56:40",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846829,
            "title": "Spotify Q4 earnings preview: Here’s what analysts expect",
            "description": "<div>Investing.com- Spotify (NYSE:SPOT) Technologies is set to report its fourth-quarter earnings before the U.S. market opens on Tuesday, capping off a year of revenue stabilization and improving margins for the music streaming giant.The company is expected to post revenue of 4.14 billion euros for the three months to December 31, with earnings of 2.03 euros per share, according to Investing.com data. SPOT guided revenue of 4.1 billion euros.Analysts said that they were confident SPOT’s earnings will at least be in line with company guidance, while the company’s gross margin is expected at 31.8%. They expect monthly average users and premium subscribers at 665 million and 260 million, in line with SPOT’s forecasts. “We note that social charges and any FX headwinds in no way indicate any slowdown in the fundamentals of the business which we believe remain extremely strong,” analysts said. The firm reiterated its Buy rating on SPOT with a price objective of $515, representing a downside of 6% from SPOT’s Monday close. The investment bank noted that 2024 was a year of strong revenue growth and monetization for SPOT, with this momentum expected to spill over into the coming year. But while analysts do expect margin expansion to persist, it will likely grow at a slower pace than the prior year, amid continued investment in business expansion. The investment bank said SPOT is at an inflection point in profitability and free cash flow, amid improved penetration in current markets, future price increases, more pricing tiers, better advertising, and fresh business models. </div>",
            "link": "https://www.investing.com/news/pro/spotify-q4-earnings-preview-heres-what-analysts-expect-432SI-3846829",
            "pub_date": "2025-02-04 15:01:02",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846807,
            "title": "Gold prices steady near record high as US tariffs against China take effect",
            "description": "<div>Investing.com- Gold prices rose slightly in Asian trade on Tuesday, remaining in sight of a recent peak as safe haven demand for the yellow metal was underpinned by fears of a renewed U.S.-China trade war. <br>The yellow metal rose in overnight trade, tracking weakness in the dollar after U.S. President Donald Trump agreed to postpone plans to impose 25% tariffs on Canada and Mexico by 30 days.<br>But Trump gave no such forgiveness to China, with his 10% trade tariffs against Beijing having now come into effect from Tuesday. <br>China retaliated with tariffs on some goods and export controls on certain metals. China also added more U.S. firms to a list of unreliable entities and opened an antitrust investigation into Google (NASDAQ:GOOGL). <br>The dollar sharply curbed its recent losses after the China tariffs took effect, limiting upside in gold.<br>Spot gold rose marginally to $2,815.35 an ounce, while gold futures expiring in March fell 0.4% to $2,846.64 an ounce. But spot prices remained close to a record high of $2,831.70 an ounce hit last week.<br>Gold set for more haven demand as global trade war brews <br>Gold’s recent record high was driven chiefly by concerns over a renewed global trade war in face of Trump’s tariff agenda. <br>While his postponement of Canadian and Mexican tariffs offered some relief, China still represents a major portion of U.S. imports. The country is the third-largest U.S. trading partner, behind Mexico and Canada. <br>Import tariffs on China also stand to have a much greater impact on the global economy, given the country’s dominant role in international trade. <br>Gold upside limited as tariffs fuel rate jitters <br>Retaliatory measures from Beijing could also draw more ire from Trump, escalating the war. Trump had warned against any retaliation over his tariffs. <br>But while gold benefited from haven demand, bullion’s long-term outlook now appeared clouded by uncertainty over U.S. inflation and interest rates.<br>Analysts and Federal Reserve officials had warned that U.S. trade tariffs- which will be paid by local importers- stood to increase domestic inflation and underpin interest rates. The dollar surged on this notion, trading close to an over two-year high.<br>Gold’s gains were limited by this trend, while other precious metals retreated. Platinum futures fell 0.1% to $1,002.05 an ounce, while silver futures fell 0.5% to $32.350 an ounce. <br>Among industrial metals, copper futures on the London Metal Exchange rose 0.2% to $9,150.15 a ton, while April copper futures fell 0.1% to $4.3250 a pound.<br>Traders were now waiting to see whether China- the world’s biggest copper importer- would dole out more economic support to offset the impact of the U.S. trade tariffs. <br> </div>",
            "link": "https://www.investing.com/news/commodities-news/gold-prices-steady-near-record-high-as-us-tariffs-against-china-take-effect-3846807",
            "pub_date": "2025-02-04 14:12:30",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        }
    ]
}