{
    "data": [
        {
            "id": 2657077,
            "title": " 2月4日美元/瑞郎、美元/加元分析",
            "description": "<div><br>周二（2月4日）欧盘时段，美元指数小幅走高，盘中报108.59，涨幅0.16%。由于特朗普兑现了关税威胁，在上周六对加拿大、墨西哥等国征收关税，美元本周开盘走高。值得庆幸的是，各国再次坐到谈判桌前。在经过一些积极谈判之后，美国对墨西哥和加拿大的关税已经暂停30天，这带来了一些风险情绪，并打压了美元。美元/加元本周开盘出现巨大缺口，但最终抹去了一切，积极的谈判导致关税暂停。今天，川普预计就关税继续进行会谈，如果出现积极的消息将进一步削弱美元。美元/瑞郎（美元/瑞郎日图 来源：易汇通）瑞郎方面，目前没有发生重大改变。瑞士央行在上次政策会议上将利率下调了50个基点，使政策利率降至0.50%，并放弃了在未来几个季度进一步降息的言论。这表明瑞士央行可能会放慢宽松的步伐，这是市场已经预料到的，今年将降息25个基点左右。最近瑞士的CPI对央行来说没有太大变化，因为数据基本符合预期。日线图上，美元/瑞郎最终在主要趋势线附近反弹，并将涨势延伸至0.92关口，原因是特朗普的关税担忧提振了美元。利好的关税消息传出后，昨日空头蜂拥进场，现在他们的目标是回调至趋势线。另一方面，多头可能会继续依靠趋势线，为反弹至新高做准备。美元/加元（美元/加元日图 来源：易汇通）加元方面，焦点完全集中在与美国的潜在贸易战上，数据并不重要。尽管如此，加拿大最近的数据一直表明，如果不是特朗普的关税威胁，加元在大幅降息后可能会变得更强。日线图上，美元/加元本周以巨大的缺口开盘，并位于2020年高点上方。空头开始淡化这一举动，因为他们预计会达成某种协议，就像在哥伦比亚看到的那样，最终这就是在特朗普和特鲁多进行积极谈判后关税被推迟的情况。空头增加了看跌赌注，第一个目标位于1.43附近。这就是我们可以预期的多头介入的风险水平，在这一水平以下的位置，反弹到新的高点，更好的风险回报设置。北京时间19:55，美元/瑞郎报0.9095/97，跌幅0.05%。美元/加元报1.4429/31，涨幅0.04%。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2657077",
            "pub_date": "2025-02-04 20:20:15",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657003,
            "title": "黄金市场分析：避险情绪推动金价高位持稳，未来走势如何演绎？",
            "description": "<div><br>周二(2月4日)，现货黄金交投于2814.04美元/盎司，日内走势呈现横盘整理。尽管价格未出现显著波动，但黄金市场依然处于历史高位附近，显示出强劲的避险需求。近期，黄金价格在多重因素的推动下屡创新高，市场情绪复杂多变，投资者需密切关注基本面和技术面的变化。避险需求支撑金价高位运行近期，黄金价格的强势表现主要得益于避险情绪的升温。美国总统特朗普的关税言论再次引发市场担忧，尽管部分关税被推迟实施，但不确定性依然存在。推动投资者转向黄金等避险资产。知名机构分析师指出，尽管美元走强对黄金价格形成了一定压制，但贸易政策的不确定性仍为黄金提供了支撑。目前，市场对更广泛关税措施的预期正在升温，这可能进一步加剧市场波动，并推动黄金价格走高。此外，全球黄金ETF持仓量今年以来已增加超过59万盎司，达到8340万盎司，显示出投资者对避险资产的强烈需求。关键数据与事件影响市场情绪本周，市场将迎来一系列重要的美国经济数据，包括职位空缺、ADP就业报告以及非农就业数据。这些数据将为市场提供更多关于美国经济健康状况的线索，并可能影响美联储的货币政策预期。目前，CME FedWatch工具显示，市场预计美联储在3月19日的会议上维持利率不变的概率为86.5%，而降息25个基点的概率为13.5%。这一预期对黄金价格形成了一定的支撑，因为低利率环境通常有利于黄金等非收益资产的表现。此外，美联储官员的讲话也值得关注。亚特兰大联储主席博斯蒂克和旧金山联储主席戴利将于周二发表讲话，市场将从中寻找关于货币政策走向的线索。如果美联储官员释放出更为鸽派的信号，可能会进一步提振黄金价格。技术面：关键支撑与阻力位分析从技术面来看，黄金价格近期呈现出高位震荡的格局。周一，现货黄金价格一度触及2830.70美元的历史新高，但随后回落，显示出市场在历史高位附近的分歧。目前，黄金价格在2800美元附近获得支撑，这一水平不仅是重要的心理关口，也是短期多空双方争夺的关键区域。分析师指出，黄金价格的下一个关键阻力位位于2839美元和2864美元，这些水平可能成为短期内的上行目标。如果价格能够突破这些阻力位，可能会进一步上探2900美元甚至3000美元的心理关口。然而，如果价格跌破2800美元的支撑位，可能会引发短期回调，下一支撑位位于2790美元和2772美元。未来展望：黄金能否延续涨势？展望未来，黄金价格的走势将取决于多重因素的共同作用。首先，贸易政策的不确定性依然是市场关注的焦点。如果关税问题进一步升级，可能会继续推动避险需求，从而支撑黄金价格。其次，美国经济数据的表现将影响市场对美联储货币政策的预期，进而对黄金价格产生重要影响。从技术面来看，黄金价格在历史高位附近的表现将决定短期内的方向。如果价格能够站稳2800美元并突破关键阻力位，可能会开启新一轮上涨行情。然而，如果市场情绪发生变化，导致避险需求减弱，黄金价格可能会面临一定的回调压力。总体而言，黄金市场目前处于高位震荡阶段，投资者需密切关注基本面和技术面的变化，以把握未来的交易机会。在当前复杂多变的市场环境下，黄金作为避险资产的地位依然稳固，但其短期走势仍需谨慎对待。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2657003",
            "pub_date": "2025-02-04 19:40:17",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656761,
            "title": "任天堂(NTDOY.US)步入Switch换代前淡季：Q3利润和营收双双暴跌 下调全年业绩指引",
            "description": "<div> 智通财经APP获悉，在假日季期间遭遇利润和营收双双暴跌后，任天堂公司(NTDOY.US)下调了全年业绩指引。目前，游戏玩家们愈发期待其下一代游戏机的发布。任天堂目前预计，在截至明年3月的财年中，其营业利润将达到2800亿日元(合18亿美元)，较此前预期下调逾五分之一。该公司还预计将售出1100万台第一代Switch游戏机，低于此前预期的1250万台。在截至去年12月的第三财季里，利润和销售额均下降了约三分之一，营业利润为1261亿日元，低于分析师平均预期的1612亿日元。营收为4329亿日元，也未达到市场普遍预期。行业分析师Serkan <br>Toto表示：“很难从这些数据中看到任何积极因素。Switch曾经有过辉煌的表现，但现在确实是推出下一代产品的时候了。不过，我实在好奇他们在新机发布前的空档期会用什么软件来填补。”由于Switch 2游戏机即将发布，许多投资者淡然面对当前旧款Switch的销售淡季。此前，任天堂表示计划在今年晚些时候发布Switch <br>2游戏机，这推动其股价创下新高。该公司在1月透露了这款游戏机的消息，并计划在4月初全面公布其发布日期和价格。尽管任天堂的销售额大幅下滑，但市场对新一代主机将提振销售的预期，加之投资者将游戏行业公司视为日本动荡的芯片板块的避风港，支撑了该公司的股价。Switch问世已近八年，其软件销量超过13亿份，这款备受喜爱的混合型掌上游戏设备销量超过了1.5亿台。去年11月，总裁Shuntaro <br>Furukawa表示，Switch <br>2将向下兼容，这意味着它将能够运行当前平台的游戏。这一特性，加上任天堂丰富的内部游戏库，有望助力新设备迅速打开市场。Switch <br>2计划于今年上市，任天堂将在全球范围内举办实机体验活动，活动将持续至6月初。Switch曾凭借首发游戏《塞尔达传说：旷野之息》(The Legend of Zelda: Breath of the <br>Wild)在初期销售取得强劲表现。随后几年间，从《动物之森》(Animal <br>Crossing)到《喷射战士》(Splatoon)、《宝可梦》(Pokémon)、《超级马里奥》(Super <br>Mario)及另一款《塞尔达传说》游戏，主要系列作品的定期更新为销售注入了持续动力。市场对Switch <br>2将延续类似成功轨迹的预期，正帮助投资者度过当前的销售淡季。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656761",
            "pub_date": "2025-02-04 16:36:49",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656767,
            "title": "关税协议推动美元/加元回落，空头占据主导了吗？",
            "description": "<div><br>近期，加元经历了一次显著的反弹，主要受到加拿大与美国就避免贸易关税措施达成协议的影响。由于此协议，加元成功从多年来的最低点反弹，市场情绪随之回暖。加拿大与美国之间的贸易关系近期迎来了转机。美国和加拿大原计划于周二（2月4日）互相征收关税，但在达成协议后，这一计划被暂停。根据协议，加拿大同意加强其与美国的边界安全措施，以满足特朗普政府的要求。这一协议的达成让市场感到宽慰，尤其是在加拿大和墨西哥早些时候分别与美国达成协议后，市场对于加元的信心恢复，推动加元汇率走强。特朗普在宣布该协议时表示：“我对这一初步结果感到非常满意，周六宣布的关税将在30天内暂停，以查看是否能够与加拿大达成最终的经济协议。”市场对这一局势持积极态度，认为加拿大与美国之间的贸易紧张局势有望得到缓解，从而为加元带来了支撑。受此消息影响，美元/加元汇率在周一曾攀升至1.48，但随后下跌了2.50%，收盘时在1.4429附近。加元的反弹显示出市场对协议的乐观情绪，特别是在贸易争端缓解的情况下，加元逐渐恢复了对美元的部分失地。在多重因素的推动下，加元成功从多年来的低点反弹。而美元的走势则受到美联储政策的不确定性影响，导致其在对加元的竞争中稍显疲软。技术面分析师解读：在短期内，1.45和1.44这两个价格水平将是关键的技术支撑区。如果价格跌破这些支撑位，美元/加元可能会进一步下行。从更长远的技术角度来看，美元/加元仍然受到1.50关口的强阻力。若价格再次上涨并突破1.48和1.50的阻力区域，则可能会进一步上行，接近1.52甚至1.55。然而，短期内，由于加拿大与美国达成协议的影响，市场对加元的信心有所回升，美元/加元汇率可能难以突破这些阻力位。（美元/加元日线图，来源易汇通）对美元/加元来说，短期内的支撑位将位于1.44及1.45区域，若汇价跌破这些支撑位，可能会进一步下行至1.42或更低。而在阻力方面，1.48和1.50是目前主要的技术阻力水平，突破这些区域可能会开启更大幅度的上涨。在中期内，若汇价能有效突破这些技术阻力区，美元/加元将有可能重新回到1.52以上水平。总结从基本面来看，加拿大与美国的贸易协议为加元带来了积极影响，加元成功从多年低点反弹，推动了其汇率的回升。尽管如此，美元/加元仍面临一些技术性阻力，市场关注美元的走势以及美联储的货币政策。从技术面来看，美元/加元处于关键的技术支撑和阻力区，未来的走势将取决于能否突破这些技术水平。短期内，加元可能会继续维持在强势区间，若市场进一步确认加美协议的积极影响，可能会进一步推高加元。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2656767",
            "pub_date": "2025-02-04 16:40:15",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656696,
            "title": "实施稀土出口管制！相关概念拉升，中国稀土涨逾18%",
            "description": "<div> 2月4日，商务部、海关总署联合发布公告称，为维护国家安全和利益、履行防扩散等国际义务，经国务院批准，决定对钨、碲、铋、钼、铟相关物项实施出口管制。公告显示，出口经营者出口上述物项应当依照《中华人民共和国出口管制法》《中华人民共和国两用物项出口管制条例》的相关规定向国务院商务主管部门申请许可。本公告自发布之日起正式实施。《中华人民共和国两用物项出口管制清单》同步予以更新。受消息刺激，午后，中国稀土（00769.HK）股价大幅拉升，一度涨逾18.4%，截至发稿前，涨幅为11.84%。金力永磁（06680.HK）由跌转涨,截至发稿前小幅上扬0.98%。稀土是现代工业中不可或缺的重要元素，也是我国关键的战略资源。从需求端来看，稀土在家电、新能源汽车、储能、风电等领域应用广泛。中信证券研报曾指出，我国对于关键金属资源的出口管制有望提升其战略地位，对于维护国家安全和利益具有重要战略意义。该行认为不排除后续出口管制政策或将延续至钨、稀土等战略金属品种的可能性，建议关注相关金属的投资机会。银河证券此前亦指出，在可能面临新一轮贸易战的情况下，稀土作为我国优势金属，或将被市场预期成为政策上可选择的反制工具，迎来更多的政策支持。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656696",
            "pub_date": "2025-02-04 15:35:51",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656600,
            "title": "丰田汽车(TM.US)预计Q3利润连跌两季 全球竞争加剧撼动‘销冠’地位",
            "description": "<div> 智通财经APP获悉，日本丰田汽车(TM.US)预计在周三公布第三季度财报时，将连续第二个季度出现利润下降。此前，混合动力车的强劲销售推动了公司业绩的增长，但如今这一增长势头有所放缓。尽管销量和产量下降表明丰田汽车的增速略有放缓，但这家全球最畅销的汽车制造商仍可能实现超过90亿美元的季度营业利润。这主要得益于美国市场从传统汽油汽车向利润率较高的混合动力汽车的转变。根据伦敦证券交易所调查的9位分析师的平均预测，丰田汽车预计第三季度营业利润将同比下降16%，至1.419万亿日元(约合91亿美元)。这一利润下滑是继上一季度利润下降20%之后的预期表现，标志着丰田汽车不再像之前几个月那样，在混合动力汽车销量强劲和日元兑美元汇率下跌的推动下，实现创纪录的盈利。麦格理银行移动研究主管詹姆斯·洪(James <br>Hong)指出，销量和产量下降是上周多家日本汽车供应商公布的业绩中的“共同点”。他还表示，丰田近几个月的生产已恢复正常，管理层可能会为本财年的最后一个季度提供建设性的指导，但第三季度的业绩可能会略显疲软。丰田上周表示，预计到2024年，其全球集团汽车销量将达到1080万辆，这意味着其将连续第五年成为全球最畅销的汽车制造商。然而，第三季度期间，其同名品牌和雷克萨斯的全球销量与去年同期基本持平，降幅不到1%，而产量下降了4%。在全球范围内，丰田面临着激烈的竞争。在欧洲、南美、东南亚以及中国本土市场，比亚迪等中国品牌的崛起对丰田构成了挑战。中国作为全球最大的汽车市场，电动汽车需求依然强劲。此外，丰田在10月下旬克服了Grand Highlander和Lexus TX <br>SUV车型长达四个月的停产问题。分析师和投资者将特别关注丰田汽车本财年剩余时间(截至3月底)的前景，尤其是在北美市场的战略。值得一提的是，美国总统唐纳德·特朗普对墨西哥和大部分加拿大进口产品征收高额关税，但几天后又暂停征收，丰田将需要调整其北美业务的管理策略。未来，丰田的电气化计划以及如何提高混合动力汽车的销量也将成为关注焦点。上一季度，混合动力汽车占丰田汽车销量的43%。自去年3月股价达到顶峰以来，丰田股价已下跌25%，今年迄今累计下跌8%。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656600",
            "pub_date": "2025-02-04 11:36:35",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656601,
            "title": "AI应用需求加速扩张 赛富时(CRM.US)计划在裁员逾千人的同时招聘AI产品销售人员",
            "description": "<div> 智通财经APP获悉，据知情人士透露，专注于客户关系管理软件(CRM)领域的云软件巨头赛富时(CRM.US)在新财年开始之际进行裁员，但是该软件巨头在宣布裁员的同时也在招聘专业员工以销售最新的人工智能产品，凸显出赛富时AI应用软件，尤其是该公司新推出的AI代理产品的用户规模加速扩张，促使该公司将更多资源投入人工智能产品部门。这位不愿透露姓名的知情人士表示，超过1000个职位将受到影响，被裁员工将能够在内部申请其他职位。总部位于旧金山的赛富时代表拒绝置评。目前尚不清楚裁员主要集中在该公司的哪些部门。截至2024年1月的上一财年统计结束时，客户关系管理类云软件的老牌龙头赛富时(即Salesforce)拥有近73,000名员工。在2023年初的大规模裁员浪潮之后，科技公司已经更加习惯于定期裁员来提振利润以回报股东。今年以来，亚马逊、微软以及Facebook母公司Meta <br>Platforms Inc. 都已采取行动继续削减企业员工人数来提振公司利润。作为客户管理类软件的领先提供商，赛富时已开始大举招聘专注于公司新“AI代理产品”的专业销售人员。但在2023年受到激进维权投资者的压力后，公司也更加注重维持利润率。这家老牌软件巨头于10月正式推出为“Agentforce”的聚焦于AI代理的软件服务产品，随后推出更新迭代后功能更加强大的Agentforce <br>2.0这一全新AI代理产品。该公司最新推出的Agentforce是一个全新的人工智能软件综合平台，具备高度可定制属性，旨在提供高度可定制化的独立自主型AI代理，其AI推理能力以及自动化完成复杂且繁琐任务的能力远超Einstein <br>Copilot，能够连接企业数据并在销售、服务、市场营销等多个领域中轻松自动化执行各种任务。Agentforce允许用户创建完全自主的AI代理，这些代理能够独立执行复杂任务，且全程无需持续的人类干预。这些代理能够利用企业数据以及赛富时核心应用软件体系来进行决策，能够处理从简单到极度复杂的多类型任务。赛富时执行副总裁迈克·斯宾塞去年12月接受采访时表示，赛富时已签署与该公司AI代理产品——Agentforce相关的“大量”企业端交易。来自花旗的分析师泰勒·拉德克在近期发布的一份报告中，对于赛富时发展前景评论道：“赛富时的AI代理工具开始取代传统的客户关系管理软件(CRM)叙事逻辑。”“仅仅因为我们有一个热门的新产品，并不意味着我们在考虑扩展这项业务规模的同时会忽视我们在内部和外部做出的重要承诺，”该公司首席运营官布莱恩·米尔汉姆(Brian <br>Millham)在12月由巴克莱银行主办的活动上被问及公司利润焦点时表示。“我们正在审视整个公司，看看我们可以在哪里获得更高的业务经营效率?我们如何继续为我们正在做的工作不断提供燃料，以便在未来投资于规模扩张。”赛富时预计将在2月底左右公布2025财年的第四财季业绩与未来收益展望。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656601",
            "pub_date": "2025-02-04 11:36:37",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656606,
            "title": "特朗普赞同美联储保持利率稳定的决定",
            "description": "<div><br>美国总统特朗普同意美联储上周维持利率不变的决定，这是他之前要求央行“立即”放松货币政策的早期转变。特朗普周日在与记者交流时说，将关键借款水平维持在4.25%-4.5%的区间是美联储正确的举措。根据多篇报道，他在谈到这一决定时说：“我并不感到惊讶，在这个时候维持利率是正确的做法。”这一声明与特朗普在瑞士达沃斯世界经济论坛上发表的远程讲话形成鲜明对比。特朗普在1月23日的一次露面中表示，他将“要求立即降低利率”。美国总统对美联储没有直接权力，不过他可以提名主席和其他FOMC成员。现任美联储主席鲍威尔是特朗普提名的，也是总统经常批评的对象。市场预计美联储至少要到6月份才会降息。在上周三的会后新闻发布会上，鲍威尔一再声称，美联储不需要“急于”进一步降息。特朗普上周六表示，他将对三个美国最大的贸易伙伴征收激进的关税，此后美联储的决策可能变得更加复杂。经济学家担心，在通胀显示缓和迹象之际，关税将推高物价。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2656606",
            "pub_date": "2025-02-04 11:40:18",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656623,
            "title": "股票代码为“SIRI”的Sirius XM获巴菲特增持 “股神”信徒们会否跟随?",
            "description": "<div> 智通财经APP获悉，有着“股神”称号的和沃伦·巴菲特旗下伯克希尔哈撒韦公司(Berkshire <br>Hathaway)向美国证券交易委员会(SEC)报告了一系列关于Sirius XM(SIRI.US)的股票增持交易，最新SEC文件显示，伯克希尔哈撒韦公司斥资大约5400万美元增持Sirius <br>XM。有分析人士表示，“股神”巴菲特增持冷门公司Sirius XM的投资行为可能引发“股神信徒们”效仿该操作，进而在短期内推动股价呈反弹之势的Sirius XM股价大幅上涨。SiriusXM的股价在过去一个月内上涨了7.3%，虽然巴菲特2024年第二季度意外增持Sirius XM，并且后续也有断断续续增持，但是Sirius XM <br>2024年股价跌幅高达56%，大幅跑输标普500指数。此次SEC披露文件属于持股比例10%以上股东的交易披露。以下是SEC备案的详细信息：以下是更早时间段的Sirius XM内部人持股及变动情况。持股情况可能包括直接和间接持股：巴菲特领导下的伯克希尔哈撒韦此次增持 Sirius XM <br>股票，反映出其对该公司长期增长前景的信心。有市场观察人士表示，巴菲特作为长期价值投资者，其加仓行为往往被市场解读为该股仍具备长期投资价值。此外，伯克希尔的持仓比例高达35%，接近战略投资级别，这意味着未来该公司有更大可能进行深度业务经营参与，或推动更积极的管理层决策。从金融市场投资角度看，投资者们后续可能愈发关注Sirius XM <br>的财务基本面状况，包括营收增长及盈利空间，华尔街分析师们对流媒体和卫星广播行业的整体增长预期，特别是在竞争激烈的数字化音频领域，最重要的是关注伯克希尔哈撒韦后续的持股变动，是否会继续增持或进行其他资本运作。Sirius XM Holdings <br>Inc.是一家美国广播服务公司，主要通过卫星广播和网络广播的方式向北美地区(美国及加拿大)用户提供音频娱乐服务。其核心业务是基于订阅模式提供多样化的音频内容，包括音乐、体育、谈话、新闻、戏剧和其他娱乐节目。该公司由原本的两家卫星电台——Sirius卫星电台和XM卫星电台，于2008年合并而成，随后不断拓展业务版图，不仅与多家北美大型汽车制造商建立了深度合作，将卫星收音机内置于新款式车型中，还通过收购Pandora等流媒体音频服务平台，构建起覆盖传统卫星广播和数字流媒体的全方位音频娱乐生态。Sirius XM在北美车载娱乐市场中占有显著份额，该公司通过长期与汽车制造商建立合作关系，锁定了大量车载用户群体，其业务模式形成了较为稳固的现金流来源。稳定的自由现金流不仅保障了日常运营，还为未来的股东回报(比如股东分红以及股票回购)提供了坚实的基本面基础。Sirius XM凭借早期的技术积累和长期合作关系，形成了较高的行业壁垒，大部分新车均标配Sirius XM设备，这一“内嵌式”合作模式使得竞争对手难以短期内撼动其市场地位。尽管Sirius XM目前面临短期挑战(比如用户流失、竞争加剧以及流媒体转型压力)，但是从长远投资角度来看，Sirius XM极其稳定的订阅模式、持续的自由现金流以及行业内的独特地位，加之流媒体业务占比提升，都使其具备较高的长期投资吸引力。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656623",
            "pub_date": "2025-02-04 12:36:21",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656639,
            "title": "经济学家：关税或已关上今年美联储降息窗口",
            "description": "<div><br>经济学家表示，定于周二生效的关税可能意味着消费者今年不会从高借贷成本中得到缓解。特朗普总统上周六签署命令，对美国三个最大贸易伙伴征收关税。经济学家预计，如果实施并保持这种关税，将提高美国消费者的物价。经济学家表示，在通胀尚未回落到目标水平的时候，通胀的上行压力可能会迫使美联储在可预见的未来暂停降息行动。美联储的基准利率影响到消费者信用卡和其他类型债务的借贷成本。Capital Economics的首席北美经济学家Paul Ashworth上周六在特朗普签署关税命令后的一份报告中写道：“在这种情况下，美联储在未来12至18个月的任何时候恢复降息的窗口已经关闭。”经济学家们表示，当然，形势是多变的，几乎不可能做出精确的评估。例如，特朗普周一表示，他将暂停对墨西哥征收25%的关税一个月。波士顿联储主席Susan Collins周一表示：“政策如何展开存在很多不确定性。”摩根大通私人银行的高级市场经济学家Joe Seydl表示，如果对加拿大、亚洲大国和墨西哥征收长期关税，估计到2026年美国通胀将上升0.5至1个百分点。这些估计是对“核心”价格（剔除能源和食品成本）通过PCE来衡量的，而PCE是美联储首选的通胀指标。这一点很重要，因为美联储使用利率政策来控制通胀和劳动力市场。在其他条件相同的情况下，预计高通胀将使利率更久地保持在较高水平。Evercore ISI周二发布的一份报告显示，相对于不征收关税的基线，对加拿大、亚洲大国和墨西哥征收关税“将推高”PCE约0.7%，2025年第四季度将达到2.8%左右。Evercore的报告称：“这将消除美联储今年至少一次、甚至两次降息的可能性。”去年12月，美联储官员预测将在2025年降息两次。Capital Economics的副首席北美经济学家Stephen Brown在一封电子邮件中写道：“鉴于暂停一个月对墨西哥征收关税，这些关税是否会继续显然存在一些不确定性。如果继续，美联储不太可能再次降息。”虽然一些人认为关税可能会促使央行再次加息，但Brown认为这不太可能。他说，关税可能会拖累美国经济。Seydl表示，同样，摩根大通预计，到2026年拟议中的关税将降低美国GDP（衡量经济产出的指标）0.5至1个百分点。他说，这种经济拖累可能会超过关税的通胀影响，最终导致美联储降息。<br></div>",
            "link": "https://cn.investing.com/news/economy-news/article-2656639",
            "pub_date": "2025-02-04 14:00:23",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}