{
    "data": [
        {
            "id": 2658657,
            "title": "巴克莱谈特朗普时代的投资策略：“屏蔽杂音，保持冷静”",
            "description": "<div>英为财情Investing.com - 今年全球股市开局强劲，欧洲股市在经历去年的低迷后有所回暖。然而，巴克莱银行以Emmanuel Cau为首的策略师团队发出警告，市场依旧脆弱，尤其是特朗普的贸易和国内政策充满变数。<br>特朗普与哥伦比亚、墨西哥和加拿大等国签订国际贸易协议的方式，彰显了他的商人本性。但政策的频繁变动可能削弱投资者信心，影响决策过程。<br>尽管如此，巴克莱仍坚信，牛市的基本驱动力，如稳健的收益和增长导向的央行政策，大体上依然稳固。<br>“未来四年，投资者或将面临层出不穷的新闻冲击，但我们建议屏蔽杂音，保持冷静。”<br>巴克莱银行承认，关税对欧洲而言是一个重大的不确定性因素。但欧洲已经为高风险支付了溢价，并可能从人工智能和大科技领域的发展、稳定的经济数据以及欧洲央行（ECB）持续的政策宽松中受益。<br>其他潜在的积极因素还包括德国大选、乌克兰可能达成的停火协议以及法国预算不确定性的降低。<br>在美国，放松监管和减税等促进增长的政策可能会继续支撑市场。但巴克莱警告称，高估值和人工智能领域初露疲态的迹象表明，美国股市“已没有多少犯错的空间”。<br>因此，该公司重申了对欧洲和美国股市持市场权重的立场。<br>巴克莱还调整了其行业布局，鉴于消息风险增加以及某些行业的收益显著超额，公司降低了风险敞口。具体而言，巴克莱平仓了电信行业的低配头寸，并再次将汽车行业降级为低配。<br>展望未来，策略师预计2025年全球增长将适度放缓。尽管特朗普的政策对增长和通胀带来负面影响，但美国增长仍将保持强劲，得益于降息对消费者的支持、强劲的劳动力市场和通胀回落。<br>欧洲增长预计将在0.6%左右徘徊，可能受到欧洲央行进一步降息和欧元走弱的提振。<br>在估值方面，策略师指出，虽然当前的周期性调整市盈率（CAPE）比率预示未来回报较低，但欧洲股市尽管近期有所反弹，仍低于平均估值水平，与信贷和债券相比仍具吸引力。<br>“从地缘政治角度看，欧洲股市可能会继续保持高风险溢价。但随着周期延长和一些尾部风险消退，我们仍认为其估值有适度上调的潜力。”他们总结道。<br>----<br>财报季来袭，如何提高胜率？InvestingPro助你一臂之力，查询美股业绩预期、精确估值和历史股价波动，一应俱全！<br>业绩预期：从当前季度到未来多个季度，乃至今、明、后三年的全面预测，助你判断业绩好坏。<br>估值+历史股价波动：独家数据助你识破泡沫股，提前判断财报发布后的股价波动风险，做好应对准备！<br>点击这里深入了解InvestingPro，立即享受超值折扣！<br>编译：刘川</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2658657",
            "pub_date": "2025-02-05 19:56:24",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658618,
            "title": "美国邮政停收中国内地和中国香港包裹，对跨境电商影响多大",
            "description": "<div> 本文来源：时代财经美国邮政服务(USPS)当地时间周二（2月4日）晚间宣布，从2月4日起暂停接收从中国内地和中国香港寄出的包裹，直至另行通知。USPS的声明称，信件和平件不包括在暂停接收的范围内。对于暂停接收的原因和持续时间，USPS没有说明。2月5日，部分跨境电商平台的美区商家在接受媒体采访时表示，目前还没有实际的物流商停止收货发货。一位商家称其刚刚收到了物流公司“今日起正常揽收货物”的通知，在他看来，不用过于担心美国暂停接收中国包裹，中国供应链已经影响着美国人的日常生活。从时间线上来看，USPS此次举措是在特朗普政府于本月早些时候宣布对中国征收新关税后采取的。当地时间2月1日，美国总统特朗普签署行政令，对进口自中国的商品加征10%的关税，最新的关税政策已于2月4日起生效。此外，特朗普2月1日签署的行政令，还取消了美国对价值低于800美元的小额货物的“最低限度”关税豁免。USPS（United States Postal Service）‌，是美国最大的民用邮政机构之一，目前其主要竞争对手联邦快递（FedEx）和联合包裹（UPS）等主要国际快递公司目前尚未就如何应对新政策发布正式声明，仍在正常清关。有分析指出，USPS停收包裹更多为象征性举措，因美国约90%跨境包裹目前通过顺丰、UPS等私营物流商运输。根据美国海关与边境保护局的数据，在2024财年，约有13.6亿件货物通过“最低限度”关税豁免条款进入美国市场，远高于2020财年的6.37亿件。这其中有相当大一部分原因是，Shein和Temu等中国电商企业在美国的业务呈现出了爆炸式的增长。这些电商网站过去几年来受到美国消费者的普遍欢迎——Temu便已连续第二年跃居苹果美国下载量最大的免费应用榜首。而最新的改动也意味着，过去符合小额包裹“最低限度”关税豁免条款的来自中国的包裹，接下来需要缴纳更多的关税。根据美国众议院下属委员会在2023年发表的一份报告，Temu和Shein很可能占了“最低限度”关税豁免货物的近三分之一。在业内人士看来，此次USPS暂停包裹服务，预计将对Shein、Temu等为代表的跨境电商平台造成冲击。这些平台依赖中国直邮低成本优势，每周向美国市场投递数百万件商品。而亚马逊（Amazon）等部分平台的第三方卖家亦将受到影响。相比之下，传统零售商如Gap、Nike等公司，因其主要依靠批量进口并已纳入正式关税体系，受影响相对较小。晨星高级股票分析师Chelsey Tam表示，最低免税额的取消对USPS而言是一个“重大挑战”，因为他们需要重新调整如何执行新的关税规定。“2024年，每天有400万个最低免税额包裹，要检查所有包裹是非常困难的”。也有分析人士指出，USPS的这一限制措施可能不像过去那样产生重大影响，因为近年来许多公司已逐渐减少使用USPS进行国际运输，中国商家或可采取其他手段规避影响。2月5日，受上述利空影响，中国市场上电商股普遍承压。在港股上市的京东集团盘中跌幅一度超过5%，收盘下跌3.45%，阿里巴巴一度跌超2%，收盘下跌0.10%。此外，EDA集团控股(02505.HK)跌11.47%，报收2.47港元；DA集团是一家面向电商的一站式端到端供应链解决方案提供商。（时代财经黄宇昆综合自21世纪经济报道、中国基金报、财联社、第一财经）</div>",
            "link": "https://cn.investing.com/news/economy/article-2658618",
            "pub_date": "2025-02-05 19:37:05",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658629,
            "title": "多空对决！铜铝为何走出剪刀差？",
            "description": "<div><br>周三(2月5日)，伦敦金属交易所（LME）铜价小幅上涨，触及一周多以来的最高水平，而铝价则因原材料价格下跌引发的供应增加预期而回落。铜价受到美元走软的支撑，而铝价则因氧化铝价格大幅下跌而承压。整体来看，市场情绪在铜和铝之间呈现出分化态势。铜价小幅攀升，美元走软提供支撑LME三个月期铜价格在周三早盘上涨0.1%，至每吨9,160美元，盘中一度触及1月27日以来的最高水平9,204美元。铜价的上涨主要得益于美元指数的走弱。美元指数因日元大幅升值而承压，使得以美元计价的大宗商品对其他货币持有者来说更具吸引力。此外，上海期货交易所（SHFE）最活跃的铜合约在春节假期后的首个交易日下跌0.3%，至每吨75,290元人民币（约10,342.60美元），显示出国内市场在节后初期的谨慎情绪。尽管铜价近期有所回升，但市场对全球经济增长前景的担忧仍然存在。特别是近期特朗普的关税言论引发市场对贸易环境的担忧，可能对铜需求产生一定压制。不过，从短期来看，美元走软和全球供应链的逐步恢复仍为铜价提供了一定支撑。铝价回落，供应增加预期升温与铜价走势相反，LME三个月期铝价格下跌0.9%，至每吨2,613.50美元。铝价在1月20日曾触及两个多月以来的高点，主要受到氧化铝供应短缺和价格高企的推动。然而，随着氧化铝价格的大幅回落，市场对铝供应增加的预期升温，导致铝价承压。上海期货交易所的氧化铝价格今年以来已下跌三分之一，至每吨3,588元人民币，远低于去年创下的历史高点。Amalgamated Metal Trading研究主管Dan Smith表示，此前铝价的看涨情绪有些过度，随着氧化铝价格大幅下跌，生产商增产的动力显著增强。其他金属表现分化除铜和铝外，其他金属价格也呈现出分化走势。LME三个月期锌价格下跌1%，至每吨2,779.50美元；铅价上涨0.7%，至每吨1,984美元；镍价小幅上涨0.4%，至每吨15,335美元；锡价则上涨0.9%，至每吨30,530美元。这些金属的价格波动反映了市场对不同品种供需基本面的差异化预期。未来展望从短期来看，铜价可能继续受到美元走势和宏观经济情绪的驱动。如果美元进一步走软，铜价有望维持偏强震荡格局。然而，全球经济增长的不确定性以及特朗普关税言论可能对需求端构成压力，限制铜价的上涨空间。铝价方面，随着氧化铝价格回落和供应增加的预期升温，铝价短期内可能继续承压。如果供应端出现超预期增长，铝价可能进一步回调。总体而言，铜和铝市场的分化走势反映了当前市场对供需基本面和宏观经济环境的不同解读。投资者需密切关注美元走势、氧化铝价格变化以及全球贸易环境的最新动态，以更好地把握未来市场趋势。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2658629",
            "pub_date": "2025-02-05 19:40:35",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658627,
            "title": "纽元/美元分析：失业率飙升，新西兰联储料2月维持激进降息路径",
            "description": "<div><br>在2024年第四季度，新西兰失业率攀升至2020年末以来的最高水平，这增加了新西兰联储（RBNZ）在本月晚些时候连续第三次大幅降息的可能性。随着国内利率前景愈发确定，纽元/美元走势仍受离岸因素驱动，特别是风险偏好以及对中国市场的情绪。2024年第四季度，失业率达到5.1%，为2020年末以来的最高水平。加上未充分就业人员，劳动力未充分利用率从一年前的10.7%升至12.1%，突显劳动力市场日益疲软。就业人数减少了3.2万人，其中男性占降幅的85%。减少主要集中在贸易和机械相关岗位，男性全职就业人数大幅下降，而兼职岗位增加。劳动力参与率从三个月前的71.2%降至71%，部分缓解了失业率的上升。私营部门薪资增长放缓，本季度增长0.6%，过去一年增长3%。随着劳动力未充分利用率上升和就业人数下降，薪资压力正在消退，这强化了劳动力市场状况向宽松转变的趋势，也凸显出新西兰联储需要进一步提供货币政策支持。新西兰联储料再次大幅降息隔夜指数掉期（反映市场对新西兰未来现金利率的预期）显示，92%的可能性表明新西兰联储将于2月19日降息50个基点。这将是连续第三次大幅降息，使得现金利率较宽松周期开始前降低175个基点。过去，新西兰联储素有“制造意外”的名声，但随着该行在过去两次会议上按照市场定价降息，这种趋势最近已有所减弱。纽元/美元：受情绪驱动的“中国因素”博弈推动纽元/美元走势的并非新西兰的利率前景，风险偏好——尤其是对中国市场的风险偏好——正发挥着更大作用。例如，纽元/美元与美元/离岸人民币（USD/CNH）20日滚动相关性为-0.95，表明两者存在极强的反向关系。尽管程度有所不同，纽元与美国股指期货的正相关性也相对较强，特别是与罗素2000和标准普尔500等更具周期性的指数。相比之下，2025年初，美国和新西兰之间的短期和长期收益率利差并未显示出明显关系。纽元/美元逢低买入力量强劲（纽元/美元日图 来源：易汇通）尽管最近几周市场波动剧烈，但纽元/美元仍维持在已知技术水平内——如日线图所示——价格持续与11月中旬形成的下跌趋势相互作用。的确，价格多次突破趋势线，但看跌突破均未有效维持，收盘时价格又回升至趋势线上方。加上周一出现的看涨流星线（明显的见底信号），价格走势表明，近期底部可能已在2022年10月的低点0.5515附近形成。周二的看涨锤子线进一步强化了这一观点。动量指标给出温和的看涨信号，MACD指标走高，相对强弱指数RSI（14）本周早些时候突破了一个小的下跌趋势。因此，目前略微倾向于看涨。值得关注的上方阻力位包括50日移动平均线附近0.5700、1月24日高点0.5720以及0.5754。若跌破并收于2024年11月下跌趋势线下方，将消除看涨倾向。若持续跌破0.5515，则将彻底转为看跌。北京时间19:28，纽元/美元报0.5686/88，涨幅0.64%。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2658627",
            "pub_date": "2025-02-05 19:40:17",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658490,
            "title": "今日财经市场5件大事：谷歌、AMD挫7%和8%，黄金创历史新高",
            "description": "<div>英为财情Investing.com - 以下为2月5日（星期三）财经市场需要了解的5件大事：一、美国股指期货下跌，市场继续关注特朗普动向周三，华尔街股市期货下跌，投资者正在评估新一批企业财报以及中美会否展开贸易谈判。前一交易日，各大指数均收升，部分原因在于，美国总统唐纳德·特朗普决定推迟对墨西哥和加拿大加征关税，市场因此猜测他对中国的立场也可能灵活处理。另一方面，虽然美国周二已对中国商品加征10%的关税，惟贸易谈判仍有空间，进而提振了市场情绪。然而，双方何时会晤仍不清楚。特朗普表示，他并不急于举行会谈。荷兰国际集团（ING）分析师在致客户的报告中表示，「中美达成共识似乎是最有可能的情况，但我们感觉市场低估了贸易争端长期化的风险」。财报多数表现稳健也支撑了市场，在已公布财报的标普500指数211家公司中，超过四分之三的公司业绩好于预期。二、Alphabet大跌6.8%，公司计划大幅提高支出尽管如此，一些巨头的财报表现欠佳，包括谷歌母公司Alphabet。公司表示，计划今年投入750亿美元用于拓展其AI能力，远高于分析师预估的580亿美元资本支出。围绕Alphabet等科技巨头在AI方面巨额支出的担忧一直挥之不去，尤其是在上周中国初创公司DeepSeek（深度求索）推出低成本AI模型之后。DeepSeek称，其模型在性能上可与OpenAI的ChatGPT相媲美，但使用的芯片无需那么先进，成本也仅为ChatGPT的一小部分。这一说法虽然遭到了广泛质疑，但仍引发了人们对巨额AI支出必要性以及最终盈利能力的担忧。Alphabet公司首席执行官桑达尔·皮恰伊表示，谷歌的GeminiAI模型在效率上与DeepSeek相近。除了业绩令人失望外，Alphabet公司的核心云计算部门的表现也加剧了这种情绪。该部门第四季度营收增长30%，达到119.6亿美元，低于前一季度35%的增速。数据显示，分析师此前预计该部门营收将增长32.3%，达到121.6亿美元。盘前，Alphabet公司股价下跌6.8%。三、Snap升1.7%，业绩超预期Snapchat母公司Snap季度业绩超出预期，因数字广告支出趋于稳定而给出乐观指引，盘前公司股价升1.7%。公司季度每股收益为0.16美元，轻松击败分析师预期的亏损0.04美元。营收增长至15.6亿美元，略高于华尔街预期的15.5亿美元。首席执行官埃文·斯皮格尔表示：「[第四季度]活跃广告主数量增长了一倍多，我们对广告平台所做的改进提高了广告主的表现，并助力营收同比增长14%。」日活跃用户（DAU）是社交媒体公司的关键指标，该季度Snap的日活跃用户攀升至4.53亿，并预计第一季度日活跃用户将达到约4.59亿。四、AMD大跌8%，数据中心营收未达预期超威半导体公司（AMD）第四季度数据中心营收为39亿美元，低于市场普遍预期的41.5亿美元，盘前股价跌8%。数据中心部门的业绩对AMD至关重要，因为此部门业绩是衡量其处理器市场需求强度的重要指标，而这些处理器与竞争对手英伟达（Nasdaq: NVDA）的芯片存在竞争关系。首席执行官苏姿丰（Lisa Su）随后告诉分析师，AMD当前季度的数据中心销售额将比前一季度下降约7%。苏姿丰还拒绝给出AMD高端AI芯片的确切收入预测，只表示预计「未来几年」的销售额将达到「数百亿美元」。另一方面，减肥药Wegovy生产商诺和诺德（CSE: NOVOb；NYSE: NVO）预测其2025年的销售增长速度将低于2024年，表明公司在竞争激烈的减肥药市场正在失去优势。周三，芯片制造商高通（Nasdaq: QCOM）、媒体巨头华特迪士尼（NYSE: DIS）和网约车集团Uber（NYSE: UBER）将公布业绩。五、黄金触及历史新高周三亚洲时段，黄金价格创下历史新高，因市场对贸易局势的担忧阴魂不散，提振了对对黄金避险需求。特朗普总统提出美国可能「接管」加沙并重新安置巴勒斯坦人的建议，也激发了避险需求，此建议遭到了中东地区多个国家的严厉谴责。美元的走弱也对金价起到了推波助澜的作用。在特朗普推迟对墨西哥和加拿大征收关税后，美元抹去了本周的所有升幅。在油市方面，由于美国原油库存数据高于预期，以及贸易局势紧张，原油价格有所下滑。----财报季杀到，查询美股业绩预期、查估值、查过往财报发布后股价波动，InvestingPro一站搞定。业绩预期：不仅有当前季度的预测，还有日后多个季度，今年、明年、后年的预测。<br>估值+过往发榜后股价波动数据：避雷泡沫股，辅助判断财报发布后股价会否大幅波动。<br>点击此处进一步了解InvestingPro并领取折扣。编译：刘川</div>",
            "link": "https://cn.investing.com/news/economy/article-2658490",
            "pub_date": "2025-02-05 19:00:39",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658338,
            "title": "美元跌穿108关口，金价一路狂飙！全球央行暴买黄金千吨，需求创纪录新高",
            "description": "<div>英为财情Investing.com -周三，2月5日，美元指数近期持续走弱，跌穿108关口，为金价上升铺平道路。因贸易战忧虑刺激投资者寻求避险资产，金价延续创纪录的升势，XAU/USD刷新历史高位至2869.63美元。2025年2月5日，世界黄金协会（WGC）在其年度报告中发布了关于2024年全球黄金市场的全面分析。报告指出，由于各国央行的强劲购买力和投资需求的增长，全球黄金需求在2024年达到了创纪录的4974吨，超过了2023年的4899吨，其中包括场外交易（OTC）投资。各国央行继续以惊人的速度买入黄金， 购买量已经连续第三年超过1,000吨。2024年，全球黄金投资需求增长了25%，达到1180吨的四年高位。WGC高级市场策略师John Reade称，「需求方面最大的意外是各国央行去年购买了1000吨黄金。」他指出，购买黄金在央行之间非常广泛，「比我们年初估计的还要多。」Kitco Metals高级市场分析师Jim Wyckoff表示，鉴于现任美政府的破坏性导致市场不确定性，再加上各国央行可能增加黄金购买量，以分散对美元资产的持有，金价今年可能达到3000美元/盎司。<br>InvestingPro能做什麼？<br>查估值：避雷泡沫股，發現造低估的股票；<br>查財報預測：最長十年的業績預測；<br>基本面圖表：直觀查看營收、盈利增長趨勢。<br>查巴菲特持倉：各大投資人持倉數據。<br>一站式股票篩選、估值分析、基本面分析工具，協助你選好股、避差股，省時又省力。按此了解InvestingPro詳情。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2658338",
            "pub_date": "2025-02-05 17:29:33",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658315,
            "title": "美股异动｜谷歌A盘前跌超7% Q4谷歌云收入增速放缓 今年资本支出指引远超预期",
            "description": "<div> 格隆汇2月5日｜谷歌A(GOOGL.US)盘前跌7.22%，报191.47美元。消息面上，谷歌母公司Alphabet第四季度营收约964.69亿美元，同比增长11.8%，分析师预期965.73亿美元；每股收益为2.15美元，同比增长31.1%，分析师预期2.13美元。期内谷歌云业务收入119.55亿美元，同比增速从三季度的35%放缓至约30%，亦低于分析师预期的121.55亿美元。另外，谷歌预计2025年资本支出将高达750亿美元，意味着同比增加42.7%，远高于分析师预期的579亿美元。(格隆汇)</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2658315",
            "pub_date": "2025-02-05 17:23:19",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658265,
            "title": "芯片巨头高通Q1业绩创佳绩？小摩：受中国手机需求推动，业绩或超预期",
            "description": "<div>英为财情Investing.com -周三，2月5日，芯片制造商高通公司 (NASDAQ:QCOM)将于美股盘后公布2025年一季报。根据InvestingPro预测，高通一季度每股收益同比增加8%至2.97美元，营业收入同比增加9.7%至109.04亿美元。稍早前，三星宣布Galaxy S25 系列手机全系将采用骁龙 8 至尊版 for Galaxy 芯片，摩根大通分析师 Samik Chatterjee 预测，由于和三星的合作， 高通将获得 20 亿美元的收入增长。摩根大通分析师最新预计，受中国智慧手机OEM强劲增长趋势的推动，该公司将公布更高的业绩预期。<br>InvestingPro能做什麼？<br>查估值：避雷泡沫股，發現造低估的股票；<br>查財報預測：最長十年的業績預測；<br>基本面圖表：直觀查看營收、盈利增長趨勢。<br>查巴菲特持倉：各大投資人持倉數據。<br>一站式股票篩選、估值分析、基本面分析工具，協助你選好股、避差股，省時又省力。按此了解InvestingPro詳情。<br></div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2658265",
            "pub_date": "2025-02-05 16:59:49",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658266,
            "title": "白银市场分析：全球经济不确定性推动避险需求，白银价格三个月新高",
            "description": "<div><br>周三（2月5日），现货白银价格持续上涨，并突破三个月来的新高，交投于32.35美元/盎司，日内涨幅达到0.76%。此次涨幅反映了市场中风险规避情绪的升温，主要受全球贸易及经济不确定性加剧的影响。随着贸易关系进一步复杂化，以及美元在技术性回调中走弱，白银这一避险资产受到投资者青睐。美元技术性回调，白银吸引力增强除了全球贸易局势的紧张，美元的技术性回调也是白银价格上涨的一个重要因素。美元指数（DXY）在过去三天内持续下行，当前交易水平约为107.70，较此前的高点有所回落。美元走弱为以美元计价的白银提供了更多上涨空间，促使投资者对白银的需求进一步上升。此外，市场普遍预期美国非农就业数据（NFP）将对未来美联储的货币政策走向产生重要影响，进一步推动投资者避险情绪的提升。由于白银不支付利息，它的吸引力与主要央行的货币政策密切相关。美联储预计今年将实施两次降息，这一预期加大了对白银等贵金属的需求。主要央行的宽松政策推动白银价格上涨除了美元的回调，全球主要央行的货币政策走向也为白银价格提供了支撑。加拿大央行（BoC）已暂停量化紧缩政策，并加入瑞典央行（Riksbank）降息的行列。此外，欧洲央行（ECB）上周将存款便利利率下调了25个基点至2.75%。这些央行的宽松政策使得市场对无息的贵金属（如白银）产生了更多需求。随着市场对全球经济放缓的担忧加剧，尤其是在美国、欧洲等经济体的增长放缓之际，白银作为避险资产的需求仍可能持续增长。市场对于全球央行将采取更多宽松政策的预期，也增强了对白银的投资兴趣。未来展望：白银价格有望维持强势展望未来，白银价格可能会在全球经济和贸易不确定性加剧的背景下，继续保持强势。虽然短期内可能受到美国非农就业数据的影响，但从长远来看，全球贸易紧张局势、美元疲软以及全球央行的宽松货币政策，预计将继续支持白银价格的上涨。在技术面上，若白银价格持续维持在32美元上方，可能会继续挑战更高的阻力位，进一步推高价格。而若白银回调至32美元下方，支撑位可能会在30美元附近形成。然而，考虑到当前市场的风险偏好，短期内白银价格依然有较强的上行动能。总的来说，白银作为避险资产的吸引力仍然强劲，尤其是在全球经济不确定性和主要央行货币政策的共同作用下。投资者应密切关注全球贸易局势以及美国经济数据的变化，这些因素将在未来几个月对白银市场的走势产生重要影响。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2658266",
            "pub_date": "2025-02-05 17:00:20",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2658247,
            "title": "黄金需求2024年飙至历史巅峰 全球央行已连续三年狂囤千吨",
            "description": "<div> 财联社2月5日讯（编辑 赵昊）当地时间周三（2月5日），世界黄金协会（WGC）发布了2024年全年及四季度全球黄金需求趋势报告。报告显示，2024年第四季度包含场外交易（OTC）在内的黄金总需求同比增长1%至1,297.4吨，全年总需求也增长1%至4,974.5吨，分别创下了季度和年度的新高。来源：世界黄金协会<br>WGC写道，对黄金的需求在2024年创下新高，主要原因是央行和投资者推动市场走强。其中，各国央行继续以惊人的速度买入黄金，购买量已经连续第三年超过1,000吨。报告显示，中央银行在2024年的黄金需求达到1,044.6吨，其中波兰、印度和土耳其是最大的买家。WGC特别提到，在去年第四季度，央行需求急剧加速至332.9吨，同比增幅达到了54%。WGC高级市场策略师John Reade称，“需求方面最大的意外是各国央行去年购买了1000吨黄金。”他指出，购买黄金在央行之间非常广泛，“比我们年初估计的还要多。”另外，2024年全球对黄金的投资需求也达到四年来的最高水平，为1,179.5吨，较2023年增长25%。这主要得益于黄金ETF持仓基本不变，而前三年都出现了大量资金流出。回顾去年第四季度，全球最主要的风险之一就是美国四年一度的总统大选，最终誓言实施关税政策的唐纳德·特朗普胜选，美国新政府的不确定性给黄金买盘提供了支撑。发稿前不久，现货黄金价格升破2860关口，最高报每盎司2865.49美元，已连续第五个交易日刷新历史纪录，年初至今累涨超9%，而前一年已累涨逾27%。有分析曾提到，虽然零售和投资需求可能对金价上涨较为敏感，但央行们整体仍在追求外汇储备的多元化。因此，对这些央行来说，黄金价格并不是他们的主要考虑因素。WGC高级市场分析师Louise Street表示：“在2025年，我们预计各国央行将继续处于主导地位，ETF投资者将加入竞争。”她补充道，如果能看到利率降低，需求将更加火爆。Street称，“地缘政治和宏观经济的不确定性应该是今年盛行的主题，这有望支撑黄金作为财富储存和风险对冲的需求。”</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2658247",
            "pub_date": "2025-02-05 16:48:28",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}