{
    "data": [
        {
            "id": 3846729,
            "title": "KKR to raise Fuji Soft bid to 9,850 yen a share, above Bain's offer",
            "description": "<div> By Anton Bridge TOKYO (Reuters) -U.S. private equity firm KKR will raise its offer price for Japanese IT company Fuji Soft by more than 4% to take it above a rival offer from Bain Capital, it said on Tuesday. It is the latest salvo in a protracted bidding war that began in August last year, with KKR and Bain competing to buy Fuji Soft in tender offer bids worth as much as $2 billion. KKR raised its price to 9,850 yen ($63.44) per share from 9,451 yen per share, taking it above Bain's most recent offer of 9,600 yen ($61.82) per share. KKR currently has a 33.97% stake in Fuji Soft following the first stage of a two-part bid in which two activist investors - 3D Investment Partners and Farallon Capital - agreed to tender their shares to KKR. But KKR has failed to secure a majority due to Bain's higher offer and because Fuji Soft's share price has consistently traded above KKR's offer. KKR has repeatedly extended its tender offer period, with the latest due to end on Friday. Fuji Soft's shares were up 1.79% at 9,975 yen in early afternoon trade, above both tender offers. Bain, which is supported by Fuji Soft's founding family, has not launched its tender offer bid yet, having said that it would wait for KKR's bid to fail or be withdrawn.  Bain was not immediately available for comment on KKR's higher bid. Fuji Soft declined to comment. KKR initially offered 8,800 yen a share for Fuji Soft last August. Bain announced its bid, at 9,450 yen per share, the following month, prompting KKR to raise its offer to 9,451 yen a share. It had maintained its offer price despite Bain increasing its offer to 9,600 yen. ($1 = 155.2800 yen) </div>",
            "link": "https://www.investing.com/news/stock-market-news/kkr-to-raise-bid-price-for-fuji-soft-above-bains-offer-nikkei-reports-3846729",
            "pub_date": "2025-02-04 13:21:21",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846762,
            "title": "Egypt's non-oil private sector posts growth in January, PMI shows",
            "description": "<div> CAIRO (Reuters) - Egypt's non-oil private sector expanded in January, marking its best performance in over four years and its first growth since August as output and sales volumes increased, a business survey showed on Tuesday. S&P Global's headline Purchasing Managers' Index (PMI) rose to 50.7 in January from 48.1 in December, signalling a renewed improvement in the sector's health at the start of 2025. A PMI reading above 50.0 indicates growth, while below that level points to a contraction.  January's figure was the highest since November 2020, driven by a pick-up in domestic market conditions and a softening of cost pressures, which helped boost sales. However, uncertainty over the sustainability of this upturn weighed on business expectations and hiring. \"The ceasefire deal between Israel and Hamas likely added confidence to markets in January,\" said David Owen, Senior Economist at S&P Global Market Intelligence. \"That said, business expectations for the next 12 months remain subdued, showing that firms are still uncertain about economic stability over the longer term.\" The output sub-index climbed to 51.1 from 47.1 in December, while the new orders index rose to 51.3 from 46.4.  Despite the positive start to the year, firms remained cautious about future activity, with expectations slipping to a near historic low. Employment levels stabilised after two months of job cuts, but hiring was limited. The sub-index for expected future output fell to 52.8 from 53.8 in December.  Cost pressures eased to an eight-month low, with input prices rising at a slower pace. This allowed firms to raise output prices only slightly, marking the softest increase in four-and-a-half years.  While the construction sector saw a decrease in purchase costs, other sectors experienced slower inflation than in December.  </div>",
            "link": "https://www.investing.com/news/economic-indicators/egypts-nonoil-private-sector-posts-growth-in-january-pmi-shows-3846762",
            "pub_date": "2025-02-04 13:25:37",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846744,
            "title": "Barclays explains why you should own LVMH stock for 2025",
            "description": "<div>Investing.com-  Barclays  (LON:BARC) has raised its price target for LVMH, a leading luxury goods company, citing a stronger-than-expected rebound in sales and improved margin outlooks, according to a research note.The company in focus, LVMH, the parent firm of luxury brand Louis Vuitton, has seen a promising start to the year, with double-digit growth at LV in January, boosted by the Chinese New Year and the launch of the LV/Murakami collaboration, analysts at Barclays said.The firm maintained its \"Overweight\" rating, and raised the price target to 780 euros from 770 euros.Analysts noted that organic sales growth turned positive in the fourth quarter of 2024, increasing 1% after a 3% decline in Q3, suggesting a potential recovery in the luxury sector.Additionally, analysts see margin pressure easing, particularly in its Fashion & Leather Goods (FLG) division, which is expected to post 2% organic growth in Q1 2025, driven by strong demand for its flagship brand Louis Vuitton (LV).The Watches & Jewellery division also showed improvement, returning to 3% organic growth in Q4, with Tiffany’s double-digit January growth reinforcing expectations of a 4% increase in Q1 2025, analysts at Barclays said.While Barclays remains cautious on Wine & Spirits, which is expected to decline 5% in Q1, it anticipates continued growth in Perfumes & Cosmetics and Selective Retailing, led by Sephora.Analysts emphasized that LVMH’s strong U.S. exposure positions it well for a broader luxury market rebound in 2025.Barclays raised its FY25 earnings per share (EPS) forecast by 2% and now expects an EBIT margin of 23.6% for the year.</div>",
            "link": "https://www.investing.com/news/pro/barclays-explains-why-you-should-own-lvmh-stock-for-2025-432SI-3846744",
            "pub_date": "2025-02-04 13:01:02",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846774,
            "title": "Morning Bid: China tariffs on, but everything's negotiable",
            "description": "<div> A look at the day ahead in European and global markets from Tom Westbrook Markets have taken the one-month delay in tariffs on Canada and Mexico as a signal that everything's negotiable. Even for China. Canada's Justin Trudeau and Mexico's Claudia Sheinbaum got on the phone to Donald Trump on Monday and told him they had agreed to bolster border enforcement efforts. Sheinbaum won plaudits from political analysts for her approach and investors seemed to relax - sort of. Hong Kong shares touched a two-month high, led by electric vehicle makers, as investors turned more hopeful that China - hit by a 10% tariff - will end up cutting a deal. [MKTS/GLOB] The euro rebounded from a two-year low around $1.01 back to $1.03 in one of its biggest round-trips in recent years as fears of an imminent trade war seemed to subside.  Crypto traders bought the big dip in bitcoin and ether. Yet, the wild ride has left so many things unclear. As J.P. Morgan's Michael Feroli points out, it has increased policy uncertainty in a way that is hard to reverse.  European stock futures rose only 0.1% in Asia. Focus in the session may also fall on numerous results announcements spanning financials such as Amundi, UBS and BNP Paribas (OTC:BNPQY), as well as on businesses with exposure to tariffs such as Ferrari (NYSE:RACE), Infineon (OTC:IFNNY) and  Diageo  (LON:DGE). Google parent Alphabet (NASDAQ:GOOGL) reports earnings after market close in New York.  On China, Trump has said that tariffs \"are going to go substantially higher\" unless it stops \"sending us fentanyl\". China says it has already cracked down on the drug trade and that fentanyl - a synthetic drug that is 50 times stronger than heroin - is a problem for the U.S. to sort out. Trump's press secretary has said he will speak with Chinese President Xi Jinping in the next couple of days. The outcome of that conversation, as well as how Beijing handles its dollar exchange rate when Chinese markets return from a week-long holiday on Wednesday, will be in focus. Most expect the yuan's trading band fixing to be fairly steady. After Monday's rollercoaster, the offshore yuan - at around 7.31 per dollar - is still technically within the bounds of where the onshore trading band closed last week. [CNY/] It is not clear what sort of deal Europe could cut to avoid tariffs that Trump has threatened. Key developments that could influence markets on Tuesday: - Earnings: Amundi, BNP Paribas, Dassault Systemes, Diageo, Ferrari, Infineon Technologies, UBS, Alphabet   </div>",
            "link": "https://www.investing.com/news/economy-news/morning-bid-china-tariffs-on-but-everythings-negotiable-3846774",
            "pub_date": "2025-02-04 13:35:35",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846767,
            "title": "China's finance ministry announces tariffs to counter Trump trade moves",
            "description": "<div> BEIJING (Reuters) - China's finance ministry on Tuesday announced a package of tariffs on a range of U.S. products in an immediate response to a 10% tariff on Chinese imports announced by U.S. President Donald Trump that went into effect at 0501 GMT.  </div>",
            "link": "https://www.investing.com/news/economic-indicators/chinas-finance-ministry-announces-tariffs-to-counter-trump-trade-moves-3846767",
            "pub_date": "2025-02-04 13:30:43",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846667,
            "title": "Oil prices retreat as Trump delays tariffs on Canada, Mexico",
            "description": "<div>Investing.com- Oil prices declined in Asian trading on Tuesday, retreating from the previous session's surge, after U.S. President Donald Trump announced a one-month delay on newly imposed tariffs on imports from Canada and Mexico.<br>This decision alleviated immediate concerns over potential supply disruptions from two of the U.S.' primary oil suppliers.<br>At 20:21 ET (01:21 GMT), Brent Oil Futures fell 0.7% to $75.47 a barrel, and Crude Oil WTI Futures expiring in March dropped 1% to $71.70 a barrel.<br>Oil reverses track as Trump delays Canada, Mexico tariffs<br>Oil prices had surged at the start of the week after President Trump announced a 25% tariff on imports from Canada and Mexico, alongside a 10% levy on energy products from Canada and a 10% tariff on Chinese goods, effective February 4. <br>However, following discussions with Canadian and Mexican counterparts, Trump agreed to postpone the tariffs on Mexico and Canada by 30 days. <br>Attention remains on the implementation of tariffs on Chinese imports, which are still scheduled to take effect within hours. The evolving geopolitical landscape and its implications for global trade and oil supply will continue to influence price dynamics in the near term.<br>The US imports approximately 4 million barrels of Canadian oil and nearly 500,000 barrels of Mexican oil daily. The expected tariffs are expected to increase costs for U.S. refiners, especially those in the Midwest and Gulf Coast regions, potentially leading to higher fuel prices and potential production cuts.<br>OPEC+ still plans to raise production from April<br>Despite the tariff announcements, the Organization of the Petroleum Exporting Countries and its allies (OPEC+) have maintained their current oil production plans, resisting calls from Trump to lower prices.<br>This decision underscores the group's commitment to a gradual phase-out of production cuts, set to begin on April 1, contingent on low inventories and rising global demand.<br>The OPEC+ cartel has been cutting output by 5.85 million barrels per day, equal to about 5.7% of global supply, as agreed in a series of steps since 2022.<br>In December, OPEC+ extended its latest layer of cuts through the first quarter of 2025, pushing back a plan to begin raising output to April. The extension was the latest of several delays due to weak demand and rising supply outside the group. </div>",
            "link": "https://www.investing.com/news/commodities-news/oil-prices-retreat-as-trump-delays-tariffs-on-canada-mexico-3846667",
            "pub_date": "2025-02-04 09:36:47",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846772,
            "title": "US stock futures dip as China trade tariffs take effect, Beijing retaliates",
            "description": "<div>Investing.com- U.S. stock futures turned negative in Asian trade on Tuesday after President Donald Trump’s 10% trade tariffs against China took effect, while Beijing also announced a slew of retaliatory measures. <br>Trump’s 10% tariffs on China were set to take effect from 00:00 ET (05:00 GMT) on Tuesday, with the deadline passing without any word from the White House on relief. <br>Beijing seemingly retaliated with import tariffs on some U.S. goods, while setting export controls on tungsten-related materials, Bloomberg reported. Beijing also announced an antitrust probe into Google (NASDAQ:GOOGL), and added clothing firm PVH Corp (NYSE:PVH) and biotechnology firm Illumina (NASDAQ:ILMN) to a list of unreliable entities. <br>The retaliatory measures pointed to the start of a renewed trade war between the world’s biggest economies, with investors now bracing for further escalation, given Trump’s hawkish stance against Beijing. <br>S&P 500 Futures fell 0.3% to 6,001.50 points, while Nasdaq 100 Futures fell 0.5% to 21,291.25 points by 00:19 ET (05:19 GMT). Dow Jones Futures fell 0.3% to 44,436.0 points. <br>Mainland Chinese markets were closed for the Lunar New Year. Hong Kong's Hang Seng index was trading up 1.8% on gains in technology stocks.<br>Trump had on Monday postponed a proposed 25% import duty on Canada and Mexico by 30 days. But he offered no such forgiveness for China, and is only set to speak with President Xi Jinping later in the week. <br>Wall Street futures had initially traded positive on optimism over the postponement. Wall Street indexes also ended above Monday’s session lows on this trend.<br>But China accounts for a far greater portion of U.S. imports, with any retaliation from Beijing likely to further destabilize global trade.<br>Analysts and Federal Reserve officials have warned that increase U.S. tariffs, which will be borne by U.S. importers, are likely to factor into higher inflation and slower economic growth in the coming months- a scenario that bodes poorly for risk sentiment. <br>The Fed is also more likely to rethink any future interest rate cuts in the face of sticky tariff-linked inflation and uncertainty about Trump’s economic policies. </div>",
            "link": "https://www.investing.com/news/stock-market-news/us-stock-futures-dip-as-china-trade-tariffs-take-effect-beijing-retaliates-3846772",
            "pub_date": "2025-02-04 13:34:52",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846709,
            "title": "Asia stocks rebound on Trump tariff delays; Chinese levies still on tap",
            "description": "<div>Investing.com– Asian stocks bounced back on Tuesday after U.S. President Donald Trump postponed trade tariffs on Canada and Mexico, easing some market concerns, though caution persisted ahead of the impending tariffs on Chinese imports.<br>Regional equities recovered most of the ground after steep declines on Monday, which stemmed from Trump’s tariff announcement. <br>U.S. stock index futures were also higher in Asian trade after Wall Street ended lower on Monday.<br>Asia stocks jump as tariff delays ease immediate concerns<br>Trump had announced a 25% tariff on imports from Canada and Mexico, alongside a 10% levy on Chinese goods, effective February 4. <br>However, following discussions with Canadian and Mexican counterparts, Trump agreed to postpone the tariffs on Mexico and Canada by 30 days.<br>Asian stocks were higher as the postponement eased immediate trade war concerns and reduced the risk of supply chain disruptions. <br>Markets also view the delay as a potential window for further negotiations, reducing uncertainty in the short term.<br>Japan’s Nikkei 225 index jumped 1.5%, while TOPIX rose 1.4%.<br>South Korea’s KOSPI index climbed 1.8%, rebounding from its lowest level since early January.<br>Australia’s S&P/ASX 200 index gained 0.4%, while Philippine’s PSEi Composite jumped 2%.<br>Elsewhere, Futures for Nifty 50 indicated a marginal rise at open, while Thailand’s SET Index fell 0.8%, bucking the regional trend.<br>Chinese tariffs still on tap; Hong Kong stocks surge on AI optimism<br>Chinese markets were closed for the Lunar New Year holiday and will resume trade on Wednesday this week.<br>The implementation of U.S. tariffs on Chinese imports was still scheduled to take effect later in the day.<br>However, markets shrugged off most concerns about levies on China, in anticipation of future negotiations and local stimulus measures.<br>Additionally, with only the 10% tariff set to take effect, investors anticipate less severe economic fallout than initially feared.<br>This sentiment was reflected in Hong Kong stocks, with Hang Seng index jumping 3% on Monday.<br>Hong Kong-listed Chinese tech stocks surged on optimism around local artificial intelligence (AI) models like DeepSeek and Alibaba's (HK:9988) Qwen. <br>Semiconductor Manufacturing International Corp (HK:0981) (SMIC) shares led the gains with a 7.2% rise, while  Xiaomi  (HK:1810) and Alibaba stock rose 5%, each.</div>",
            "link": "https://www.investing.com/news/stock-market-news/asia-stocks-rebound-on-trump-tariff-delays-chinese-levies-still-on-tap-3846709",
            "pub_date": "2025-02-04 11:11:24",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846605,
            "title": "US stock futures jump as Trump delays Canada, Mexico tariffs",
            "description": "<div>Investing.com- U.S. stock index futures rose sharply on Monday evening, with Wall Street set to rebound from recent losses after President Donald Trump delayed plans to impose trade tariffs on Canada and Mexico.<br>Futures surged after Wall Street ended above session lows on Monday, as investors were relieved by Trump agreeing to delay 25% trade tariffs against Canada and Mexico by 30 days. But Trump’s 10% duty on China is still set to take effect from Tuesday. <br>Investors also remained on edge over trade uncertainty under Trump, given that he has still expressed his intent to impose more trade duties, especially a 10% universal tariff.<br>S&P 500 Futures rose 0.6% to 6,058.25 points, while Nasdaq 100 Futures rose 0.8% to 21,570.75 points by 18:11 ET (23:11 GMT). Dow Jones Futures rose 0.4% to 44,760.0 points. <br>Trump delays Canada, Mexico tariffs by 30 days <br>Canadian President Justin Trudeau said on Monday that Trump had agreed to delay his planned tariffs against the country by 30 days, after a meeting between the two.<br>The announcement came just hours after Trump said tariffs against Mexico will be delayed by 30 days, following a “very friendly” call with Mexican President Claudia Sheinbaum.<br>Both countries agreed to Trump’s demands for tighter border controls. His recent tariff threats were driven chiefly by allegations that lax border controls in Canada and Mexico were facilitating the flow of illegal substances- specifically fentanyl- and undocumented immigrants into America. <br>But Trump’s 10% tariffs against China are still set to take effect from Tuesday. Beijing had largely opposed the duties and vowed retaliation.<br>Analysts warned that Trump’s tariffs- which will be paid by U.S. importers- could push up inflation and dampen economic growth in the coming months. Sticky inflation is also expected to give the Federal Reserve less impetus to cut interest rates. <br>Chicago Fed President Austan Goolsbee warned on Monday that uncertainty over Trump’s policies could further delay the central bank’s plans to cut interest rates. <br>Trump has still signaled his intent to impose higher tariffs against China, as well as a potential 10% duty on all U.S. imports. <br>Wall St ends above session lows; earnings in focus <br>Wall Street indexes had fallen sharply on Monday after Trump’s tariff threats, but ended above session lows after the tariffs appeared to be delayed. <br>U.S. stocks were still nursing losses from the prior week- where an extended rout in technology shares and growing signs of sticky inflation rattled risk appetite. <br>The S&P 500 fell 0.8% to 5,994.67 points, while the NASDAQ Composite fell 1.2% to 19,391.96 points. The Dow Jones Industrial Average fell 0.3% to 44,422.31 points.<br>Focus this week is squarely on the December quarter earnings season, with market heavyweights Alphabet Inc (NASDAQ:GOOGL) and Amazon.com Inc (NASDAQ:AMZN) set to report on Tuesday and Thursday, respectively. Prints from other majors including Advanced Micro Devices Inc (NASDAQ:AMD),  PayPal Holdings Inc  (NASDAQ:PYPL), Super Micro Computer Inc (NASDAQ:SMCI), Walt  Disney  Company (NYSE:DIS), and Qualcomm Incorporated (NASDAQ:QCOM) are also due in the coming days. <br>Beyond earnings, focus this week is also on key nonfarm payrolls data for January, due on Friday. The reading is likely to factor into expectations for interest rates.</div>",
            "link": "https://www.investing.com/news/stock-market-news/us-stock-futures-jump-as-trump-delays-canada-mexico-tariffs-3846605",
            "pub_date": "2025-02-04 07:56:23",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 3846550,
            "title": "Polaris Inc. credit outlook downgraded to negative at S&P due to weakened credit metrics",
            "description": "<div>Investing.com - Minnesota-based power sports vehicle manufacturer, Polaris (NYSE:PII) Inc., is anticipated to underperform previous revenue and EBITDA predictions for 2025. This is due to a decrease in planned off-road vehicle shipments, weak retail demand, and reduced margins. It is unlikely that the company will generate enough revenue and EBITDA in 2025 to keep leverage below the 3x downgrade threshold. This is due to a slump in purchases of discretionary leisure products, including power sports.Consequently, the rating outlook for Polaris has been revised to negative from stable at S&P Global, while the ‘BBB’ issuer credit rating and the ‘BBB’ issue-level rating on the company’s senior unsecured notes have been affirmed. The negative outlook is based on the expectation that S&P Global Ratings-adjusted debt to EBITDA will slightly exceed the 3x downgrade threshold in 2025. While Polaris is expected to use excess free cash flow to repay debt, future deleveraging will partly depend on a recovery in the power sports industry and stable macroeconomic conditions.In 2024, Polaris and the Powersports Industry faced a challenging retail environment, with year-over-year declines in total revenue of about 20%. North American powersports retail sales also fell by 8% in 2024 due to higher interest rates and a delayed replacement cycle. This trend is expected to continue through at least the first half of 2025. The company's 2025 guidance anticipates a decline in total revenue by a low single-digit percentage due to weak retail sales across the industry.Polaris' reduced revenue and profitability are expected to result in lower cash flows and weaker credit metrics than previously forecasted. In 2025, total revenue is expected to decrease in the low single-digit percent area. This is due to lower demand for recreational off-road vehicles, motorcycles, and snowmobiles, despite stable demand for utility vehicles and modest share growth in marine from new product launches.The company's EBITDA margin is expected to compress by about 170-200 basis points due to decreased shipping volumes and the reset of its profit-sharing program. These trends are likely to lead to an increase of leverage to the low-3x area in 2025.Polaris has a publicly stated net leverage target of 1x-2x, which supports eventual deleveraging and the ‘BBB’ rating. However, following lower-than-anticipated retail purchases of power sports products in 2024, Polaris ended the fiscal year with S&P Global Ratings-adjusted leverage of about 2.9x, above the high end of its stated policy range.Polaris' significant exposure to China for procurement of raw materials and to Mexico, where its largest factory is located, could lead to pressure on margins due to material tariffs. Although Polaris has the industry’s largest manufacturing footprint in the U.S., the relocation of production and procurement of materials in response to material tariffs could take some time.Despite these challenges, Polaris maintains a global leadership position in the power sports recreational market, reflecting successful innovation across its segments. The company's product portfolio provides good diversification, balancing the seasonal nature of some of its products.Polaris' history of successfully launching new products, spurred by its substantial investment in product innovation, is expected to position it well against competitors when the power sports industry recovers from its current downturn. The company's divestitures of unprofitable segments and plant efficiencies are expected to help improve margins once the power sports industry recovers.The negative outlook reflects the forecast for S&P Global Ratings-adjusted debt to EBITDA to increase above the 3x downgrade threshold through at least 2025. Any material deleveraging in 2026 is expected to be partly dependent on an increase in shipments spurred by a recovery in the power sports industry and stable macroeconomic conditions.The outlook could be revised to stable once Polaris can reduce leverage below the 3x net leverage downgrade threshold. An upgrade is viewed as unlikely, given Polaris' financial policy of targeting net debt to EBITDA in the 1x-2x range with the possibility of temporarily increasing its leverage to as high as 3x to fund growth through acquisitions.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.</div>",
            "link": "https://www.investing.com/news/stock-market-news/polaris-inc-credit-outlook-downgraded-to-negative-at-sp-due-to-weakened-credit-metrics-93CH-3846550",
            "pub_date": "2025-02-04 06:45:30",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        }
    ]
}