{
    "data": [
        {
            "id": 2656696,
            "title": "实施稀土出口管制！相关概念拉升，中国稀土涨逾18%",
            "description": "<div> 2月4日，商务部、海关总署联合发布公告称，为维护国家安全和利益、履行防扩散等国际义务，经国务院批准，决定对钨、碲、铋、钼、铟相关物项实施出口管制。公告显示，出口经营者出口上述物项应当依照《中华人民共和国出口管制法》《中华人民共和国两用物项出口管制条例》的相关规定向国务院商务主管部门申请许可。本公告自发布之日起正式实施。《中华人民共和国两用物项出口管制清单》同步予以更新。受消息刺激，午后，中国稀土（00769.HK）股价大幅拉升，一度涨逾18.4%，截至发稿前，涨幅为11.84%。金力永磁（06680.HK）由跌转涨,截至发稿前小幅上扬0.98%。稀土是现代工业中不可或缺的重要元素，也是我国关键的战略资源。从需求端来看，稀土在家电、新能源汽车、储能、风电等领域应用广泛。中信证券研报曾指出，我国对于关键金属资源的出口管制有望提升其战略地位，对于维护国家安全和利益具有重要战略意义。该行认为不排除后续出口管制政策或将延续至钨、稀土等战略金属品种的可能性，建议关注相关金属的投资机会。银河证券此前亦指出，在可能面临新一轮贸易战的情况下，稀土作为我国优势金属，或将被市场预期成为政策上可选择的反制工具，迎来更多的政策支持。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656696",
            "pub_date": "2025-02-04 15:35:51",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656600,
            "title": "丰田汽车(TM.US)预计Q3利润连跌两季 全球竞争加剧撼动‘销冠’地位",
            "description": "<div> 智通财经APP获悉，日本丰田汽车(TM.US)预计在周三公布第三季度财报时，将连续第二个季度出现利润下降。此前，混合动力车的强劲销售推动了公司业绩的增长，但如今这一增长势头有所放缓。尽管销量和产量下降表明丰田汽车的增速略有放缓，但这家全球最畅销的汽车制造商仍可能实现超过90亿美元的季度营业利润。这主要得益于美国市场从传统汽油汽车向利润率较高的混合动力汽车的转变。根据伦敦证券交易所调查的9位分析师的平均预测，丰田汽车预计第三季度营业利润将同比下降16%，至1.419万亿日元(约合91亿美元)。这一利润下滑是继上一季度利润下降20%之后的预期表现，标志着丰田汽车不再像之前几个月那样，在混合动力汽车销量强劲和日元兑美元汇率下跌的推动下，实现创纪录的盈利。麦格理银行移动研究主管詹姆斯·洪(James <br>Hong)指出，销量和产量下降是上周多家日本汽车供应商公布的业绩中的“共同点”。他还表示，丰田近几个月的生产已恢复正常，管理层可能会为本财年的最后一个季度提供建设性的指导，但第三季度的业绩可能会略显疲软。丰田上周表示，预计到2024年，其全球集团汽车销量将达到1080万辆，这意味着其将连续第五年成为全球最畅销的汽车制造商。然而，第三季度期间，其同名品牌和雷克萨斯的全球销量与去年同期基本持平，降幅不到1%，而产量下降了4%。在全球范围内，丰田面临着激烈的竞争。在欧洲、南美、东南亚以及中国本土市场，比亚迪等中国品牌的崛起对丰田构成了挑战。中国作为全球最大的汽车市场，电动汽车需求依然强劲。此外，丰田在10月下旬克服了Grand Highlander和Lexus TX <br>SUV车型长达四个月的停产问题。分析师和投资者将特别关注丰田汽车本财年剩余时间(截至3月底)的前景，尤其是在北美市场的战略。值得一提的是，美国总统唐纳德·特朗普对墨西哥和大部分加拿大进口产品征收高额关税，但几天后又暂停征收，丰田将需要调整其北美业务的管理策略。未来，丰田的电气化计划以及如何提高混合动力汽车的销量也将成为关注焦点。上一季度，混合动力汽车占丰田汽车销量的43%。自去年3月股价达到顶峰以来，丰田股价已下跌25%，今年迄今累计下跌8%。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656600",
            "pub_date": "2025-02-04 11:36:35",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656601,
            "title": "AI应用需求加速扩张 赛富时(CRM.US)计划在裁员逾千人的同时招聘AI产品销售人员",
            "description": "<div> 智通财经APP获悉，据知情人士透露，专注于客户关系管理软件(CRM)领域的云软件巨头赛富时(CRM.US)在新财年开始之际进行裁员，但是该软件巨头在宣布裁员的同时也在招聘专业员工以销售最新的人工智能产品，凸显出赛富时AI应用软件，尤其是该公司新推出的AI代理产品的用户规模加速扩张，促使该公司将更多资源投入人工智能产品部门。这位不愿透露姓名的知情人士表示，超过1000个职位将受到影响，被裁员工将能够在内部申请其他职位。总部位于旧金山的赛富时代表拒绝置评。目前尚不清楚裁员主要集中在该公司的哪些部门。截至2024年1月的上一财年统计结束时，客户关系管理类云软件的老牌龙头赛富时(即Salesforce)拥有近73,000名员工。在2023年初的大规模裁员浪潮之后，科技公司已经更加习惯于定期裁员来提振利润以回报股东。今年以来，亚马逊、微软以及Facebook母公司Meta <br>Platforms Inc. 都已采取行动继续削减企业员工人数来提振公司利润。作为客户管理类软件的领先提供商，赛富时已开始大举招聘专注于公司新“AI代理产品”的专业销售人员。但在2023年受到激进维权投资者的压力后，公司也更加注重维持利润率。这家老牌软件巨头于10月正式推出为“Agentforce”的聚焦于AI代理的软件服务产品，随后推出更新迭代后功能更加强大的Agentforce <br>2.0这一全新AI代理产品。该公司最新推出的Agentforce是一个全新的人工智能软件综合平台，具备高度可定制属性，旨在提供高度可定制化的独立自主型AI代理，其AI推理能力以及自动化完成复杂且繁琐任务的能力远超Einstein <br>Copilot，能够连接企业数据并在销售、服务、市场营销等多个领域中轻松自动化执行各种任务。Agentforce允许用户创建完全自主的AI代理，这些代理能够独立执行复杂任务，且全程无需持续的人类干预。这些代理能够利用企业数据以及赛富时核心应用软件体系来进行决策，能够处理从简单到极度复杂的多类型任务。赛富时执行副总裁迈克·斯宾塞去年12月接受采访时表示，赛富时已签署与该公司AI代理产品——Agentforce相关的“大量”企业端交易。来自花旗的分析师泰勒·拉德克在近期发布的一份报告中，对于赛富时发展前景评论道：“赛富时的AI代理工具开始取代传统的客户关系管理软件(CRM)叙事逻辑。”“仅仅因为我们有一个热门的新产品，并不意味着我们在考虑扩展这项业务规模的同时会忽视我们在内部和外部做出的重要承诺，”该公司首席运营官布莱恩·米尔汉姆(Brian <br>Millham)在12月由巴克莱银行主办的活动上被问及公司利润焦点时表示。“我们正在审视整个公司，看看我们可以在哪里获得更高的业务经营效率?我们如何继续为我们正在做的工作不断提供燃料，以便在未来投资于规模扩张。”赛富时预计将在2月底左右公布2025财年的第四财季业绩与未来收益展望。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656601",
            "pub_date": "2025-02-04 11:36:37",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656606,
            "title": "特朗普赞同美联储保持利率稳定的决定",
            "description": "<div><br>美国总统特朗普同意美联储上周维持利率不变的决定，这是他之前要求央行“立即”放松货币政策的早期转变。特朗普周日在与记者交流时说，将关键借款水平维持在4.25%-4.5%的区间是美联储正确的举措。根据多篇报道，他在谈到这一决定时说：“我并不感到惊讶，在这个时候维持利率是正确的做法。”这一声明与特朗普在瑞士达沃斯世界经济论坛上发表的远程讲话形成鲜明对比。特朗普在1月23日的一次露面中表示，他将“要求立即降低利率”。美国总统对美联储没有直接权力，不过他可以提名主席和其他FOMC成员。现任美联储主席鲍威尔是特朗普提名的，也是总统经常批评的对象。市场预计美联储至少要到6月份才会降息。在上周三的会后新闻发布会上，鲍威尔一再声称，美联储不需要“急于”进一步降息。特朗普上周六表示，他将对三个美国最大的贸易伙伴征收激进的关税，此后美联储的决策可能变得更加复杂。经济学家担心，在通胀显示缓和迹象之际，关税将推高物价。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2656606",
            "pub_date": "2025-02-04 11:40:18",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656623,
            "title": "股票代码为“SIRI”的Sirius XM获巴菲特增持 “股神”信徒们会否跟随?",
            "description": "<div> 智通财经APP获悉，有着“股神”称号的和沃伦·巴菲特旗下伯克希尔哈撒韦公司(Berkshire <br>Hathaway)向美国证券交易委员会(SEC)报告了一系列关于Sirius XM(SIRI.US)的股票增持交易，最新SEC文件显示，伯克希尔哈撒韦公司斥资大约5400万美元增持Sirius <br>XM。有分析人士表示，“股神”巴菲特增持冷门公司Sirius XM的投资行为可能引发“股神信徒们”效仿该操作，进而在短期内推动股价呈反弹之势的Sirius XM股价大幅上涨。SiriusXM的股价在过去一个月内上涨了7.3%，虽然巴菲特2024年第二季度意外增持Sirius XM，并且后续也有断断续续增持，但是Sirius XM <br>2024年股价跌幅高达56%，大幅跑输标普500指数。此次SEC披露文件属于持股比例10%以上股东的交易披露。以下是SEC备案的详细信息：以下是更早时间段的Sirius XM内部人持股及变动情况。持股情况可能包括直接和间接持股：巴菲特领导下的伯克希尔哈撒韦此次增持 Sirius XM <br>股票，反映出其对该公司长期增长前景的信心。有市场观察人士表示，巴菲特作为长期价值投资者，其加仓行为往往被市场解读为该股仍具备长期投资价值。此外，伯克希尔的持仓比例高达35%，接近战略投资级别，这意味着未来该公司有更大可能进行深度业务经营参与，或推动更积极的管理层决策。从金融市场投资角度看，投资者们后续可能愈发关注Sirius XM <br>的财务基本面状况，包括营收增长及盈利空间，华尔街分析师们对流媒体和卫星广播行业的整体增长预期，特别是在竞争激烈的数字化音频领域，最重要的是关注伯克希尔哈撒韦后续的持股变动，是否会继续增持或进行其他资本运作。Sirius XM Holdings <br>Inc.是一家美国广播服务公司，主要通过卫星广播和网络广播的方式向北美地区(美国及加拿大)用户提供音频娱乐服务。其核心业务是基于订阅模式提供多样化的音频内容，包括音乐、体育、谈话、新闻、戏剧和其他娱乐节目。该公司由原本的两家卫星电台——Sirius卫星电台和XM卫星电台，于2008年合并而成，随后不断拓展业务版图，不仅与多家北美大型汽车制造商建立了深度合作，将卫星收音机内置于新款式车型中，还通过收购Pandora等流媒体音频服务平台，构建起覆盖传统卫星广播和数字流媒体的全方位音频娱乐生态。Sirius XM在北美车载娱乐市场中占有显著份额，该公司通过长期与汽车制造商建立合作关系，锁定了大量车载用户群体，其业务模式形成了较为稳固的现金流来源。稳定的自由现金流不仅保障了日常运营，还为未来的股东回报(比如股东分红以及股票回购)提供了坚实的基本面基础。Sirius XM凭借早期的技术积累和长期合作关系，形成了较高的行业壁垒，大部分新车均标配Sirius XM设备，这一“内嵌式”合作模式使得竞争对手难以短期内撼动其市场地位。尽管Sirius XM目前面临短期挑战(比如用户流失、竞争加剧以及流媒体转型压力)，但是从长远投资角度来看，Sirius XM极其稳定的订阅模式、持续的自由现金流以及行业内的独特地位，加之流媒体业务占比提升，都使其具备较高的长期投资吸引力。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656623",
            "pub_date": "2025-02-04 12:36:21",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656639,
            "title": "经济学家：关税或已关上今年美联储降息窗口",
            "description": "<div><br>经济学家表示，定于周二生效的关税可能意味着消费者今年不会从高借贷成本中得到缓解。特朗普总统上周六签署命令，对美国三个最大贸易伙伴征收关税。经济学家预计，如果实施并保持这种关税，将提高美国消费者的物价。经济学家表示，在通胀尚未回落到目标水平的时候，通胀的上行压力可能会迫使美联储在可预见的未来暂停降息行动。美联储的基准利率影响到消费者信用卡和其他类型债务的借贷成本。Capital Economics的首席北美经济学家Paul Ashworth上周六在特朗普签署关税命令后的一份报告中写道：“在这种情况下，美联储在未来12至18个月的任何时候恢复降息的窗口已经关闭。”经济学家们表示，当然，形势是多变的，几乎不可能做出精确的评估。例如，特朗普周一表示，他将暂停对墨西哥征收25%的关税一个月。波士顿联储主席Susan Collins周一表示：“政策如何展开存在很多不确定性。”摩根大通私人银行的高级市场经济学家Joe Seydl表示，如果对加拿大、亚洲大国和墨西哥征收长期关税，估计到2026年美国通胀将上升0.5至1个百分点。这些估计是对“核心”价格（剔除能源和食品成本）通过PCE来衡量的，而PCE是美联储首选的通胀指标。这一点很重要，因为美联储使用利率政策来控制通胀和劳动力市场。在其他条件相同的情况下，预计高通胀将使利率更久地保持在较高水平。Evercore ISI周二发布的一份报告显示，相对于不征收关税的基线，对加拿大、亚洲大国和墨西哥征收关税“将推高”PCE约0.7%，2025年第四季度将达到2.8%左右。Evercore的报告称：“这将消除美联储今年至少一次、甚至两次降息的可能性。”去年12月，美联储官员预测将在2025年降息两次。Capital Economics的副首席北美经济学家Stephen Brown在一封电子邮件中写道：“鉴于暂停一个月对墨西哥征收关税，这些关税是否会继续显然存在一些不确定性。如果继续，美联储不太可能再次降息。”虽然一些人认为关税可能会促使央行再次加息，但Brown认为这不太可能。他说，关税可能会拖累美国经济。Seydl表示，同样，摩根大通预计，到2026年拟议中的关税将降低美国GDP（衡量经济产出的指标）0.5至1个百分点。他说，这种经济拖累可能会超过关税的通胀影响，最终导致美联储降息。<br></div>",
            "link": "https://cn.investing.com/news/economy-news/article-2656639",
            "pub_date": "2025-02-04 14:00:23",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656667,
            "title": "东南亚网约车市场即将生变! 两大巨头Grab(GRAB.US)与GoTo加速合并谈判",
            "description": "<div> 智通财经APP获悉，东南亚网约车服务提供商Grab Holdings Ltd.(GRAB.US)与GoTo Group <br>正在加速合并谈判步伐，并且双方计划在今年达成最终合并协议，以结束在竞争异常激烈的东南亚互联网市场中的持续多年亏损。据知情人士透露，最近几周双方合并谈判步入高潮阶段，两家公司皆认为2025年是达成合并交易的有利时机。这两家多年来持续亏损的公司——同时也是整个东南亚市场最大规模的两家网约车线上叫车服务提供商，多年来断断续续地进行谈判，目标是通过合并以降低经营成本并且力争在拥有超过6.5亿消费者的地区减少竞争压力。来自新加坡的Grab——获得了来自美国网约车与配送服务领军者优步(Uber <br>Technologies)的支持，以及来自印尼的GoTo(其投资者包括软银集团)在近年来上市后都在追求盈利路径方面取得积极进展。但对斩获用户的竞争压力使得价格受到控制并挤压了营业利润，这也是为什么这两大巨头多年来持续亏损。在过去几年中，合并的障碍包括双方之间的分歧以及公司在印尼和新加坡等市场的主导地位可能引发的一系列反垄断问题。GoTo的发言人拒绝置评，而Grab的代表在媒体获得联系时没有立即发表评论。DealStreetAsia早些时候曾经报道了两家网约车公司今年达成协议的目标。整体而言，Grab与GoTo的合并谈判进程大幅加速，目标在2025年达成协议，以应对东南亚网约车市场的激烈竞争和持续亏损。尽管面临监管挑战和市场变化，两家大网约车巨头都希望通过整合提升竞争力并改善财务基本面状况。“DealStreetAsia报道的Grab与GoTo之间潜在合并谈判的进展，有效地巩固了这两家公司在行业竞争加剧中的市场领导地位，但该交易将面临严格的监管审查，因为这两家公司是东南亚许多关键市场中按需服务的顶级玩家。出租车运营商Trans-Cab正在进入新加坡网约车市场，此外，值得注意的是，Bolt、in-Drive和Lalamove <br>Ride等待外国进入者正在撼动这一领域，在印尼、马来西亚和泰国取得进展。”Bloomberg Intelligence分析师Nathan <br>Naidu表示。周二，GoTo的股价在雅加达证券交易所上涨了大约6.2%，使其今年的涨幅超过20%。Grab在纽约股市的股价在2025年迄今下跌了约4%。两家公司的总市值接近250亿美元，与东南亚一些最大规模上市公司的市值相当。在讨论合并的同时，两家公司各自达成了较小的交易以改善财务状况。Grab收购了马来西亚的一家连锁超市和新加坡的一家预订应用程序，而GoTo一年前同意以15亿美元的交易将其亏损的电子商务部门控制权交给字节跳动旗下的TikTok。与此同时，随着东南亚地区，尤其是最大市场之一印尼的Grab客户削减支出以应对高通胀和利率，两家公司的销售额增长率已从过去的三位数增长率大幅放缓。随着客户群的大幅扩张逐渐稳定下来，市场需求可能持续放缓，主要由于消费者们在高通胀以及美联储持续维系高基准利率的重大压力之下，在具有挑战性的宏观经济环境中往往不太热衷于叫车或送餐上门服务。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656667",
            "pub_date": "2025-02-04 14:36:40",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656681,
            "title": "OpenAI联手Kakao进军韩国社交AI新战场 ChatGPT全球吸金破5亿领跑应用市场",
            "description": "<div> 智通财经APP获悉，韩国IT巨头Kakao与美国人工智能研究公司OpenAI于2月4日宣布建立战略合作伙伴关系。此次合作将把ChatGPT及其他AI技术更深入地整合到韩国最大的社交媒体平台KakaoTalk中。OpenAI首席执行官Sam <br>Altman与Kakao首席执行官Shina <br>Chung在首尔共同宣布了这一合作，内容包括联合产品开发以及在KakaoTalk等服务中使用更多OpenAI技术。Altman表示，韩国是一个极其重要的市场，其应用范围非常广泛，从研究儿童癌症治疗方法到人工智能在教育领域的应用。此次合作不仅将提升Kakao的技术水平，还将为韩国市场带来更智能的服务。此外，Altman前一天在东京与软银公司达成协议，将在日本销售和推广人工智能工具和服务。他的亚洲之行将于周三延伸至印度，旨在扩大OpenAI的领先地位。此次合作是OpenAI在全球范围内技术货币化的重要一步。通过与Kakao和软银等本地科技领导者的合作，OpenAI正在加速其技术的商业化。Kakao作为韩国两大互联网公司之一，尽管过去几个月经历了动荡，但其创始人郑义和上任后稳定了局面。在她的领导下，Kakao在人工智能、机器人、游戏和数字医疗等领域进行了多项投资。此次合作也是Altman自2023年以来第三次访问韩国。他与SK集团董事长崔泰源以及SK海力士、SK电信和Krafton等公司的高管举行了会谈，商讨业务合作事宜。预计Altman还将于周二晚些时候与三星电子公司的高管会面。AI应用市场快速增长，ChatGPT表现突出值得一提的是，根据Appfigures的最新报告，自2023年5月作为移动应用程序发布以来，ChatGPT已获得5.29亿美元的收入，几乎是第二大收入者的四倍。市场研究人员发现，2024年人工智能应用支出将比上一年增长近四倍，达到14亿美元，并在今年最后一个季度加速增长。20亿美元的市场机会主要由美国消费者推动，他们贡献了迄今为止所有人工智能应用销售额的一半左右。此外，ChatGPT和DeepSeek等助手应用是迄今为止最受欢迎的AI应用类别。数据显示，过去两年，下载量最高的10款AI应用中有8款，收入排名前10的应用全部都是聊天机器人。自7月以来，ChatGPT每月的收入都超过了苹果(AAPPL.US)的iPhone <br>App Store和谷歌(GOOGL.US)的Android Play Store中所有其他顶级助手应用的总收入。尽管DeepSeek的出现可能会给ChatGPT的增长带来一些疑问，但Altman对此表示欢迎，认为“有一个新的竞争对手令人振奋”。他和其他行业领导者认为DeepSeek会吸引更多关注，并可能为整个AI领域带来更多用户。报告中其他值得注意的发现包括，ChatGPT的移动用户中有超过一半年龄在18至24岁之间，绝大多数AI用户为男性。2024年，各类AI应用的收入呈爆炸式增长，在所分析的12个细分市场中，平均增长率为862%。对于从OpenAI到微软(MSFT.US)和Meta Platforms <br>Inc.(META.US)等公司来说，将数千亿美元投资于人工智能基础设施货币化的挑战仍然是一个尚未解决的问题。尽管如此，智能手机用户至少表现出越来越大的意愿，愿意拿出现金来帮助支持这项工作并获得新软件。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656681",
            "pub_date": "2025-02-04 15:06:26",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656697,
            "title": "瑞银(UBS.US)Q4税前利润大增198% 重磅官宣30亿美元股票回购",
            "description": "<div> 智通财经APP获悉，总部位于瑞士的全球金融巨头瑞银集团(UBS Group <br>AG)周二公布最新业绩报告，该行2024年第四季度利润超出市场预期，在很大程度上帮助这家瑞士银行将今年的股票回购计划提高至30亿美元。随着与瑞信之间的庞大资产整合工作的顺利进展，瑞银首席执行官塞尔吉奥·埃尔莫蒂力争向瑞银的投资者们返还更多现金，因此加大力度回购并且计划提高派息。在强劲的业绩与现金回报规模提振之下，瑞银股价在美股夜盘一度暴涨超8%。财报数据显示，瑞银截至12月的三个月净利润为7.79亿美元，高于市场预期的4.86亿美元。其中，市场重点关注的瑞银投资银行业务的税前利润远超市场预期，达到4.79亿美元，大约是市场普遍预期的足足7倍，相比之下投行业务表现强劲的上一季度则为4.05亿美元，上年同期则为亏损1.9亿美元;而财富管理部门的净新增资产则未达预期。该国际金融巨头第四季度的主要财富管理部门的客户资金流入规模约为 177 亿美元，低于市场预期。该行曾表示，希望到 2025 年每年实现 1000 <br>亿美元的新资产。整体业绩方面，瑞银集团第四季度基本税前利润约为18亿美元，同比增长198%，净利润高达7.79亿美元，相比之下上年同期为净亏损2.78亿美元。瑞银表示，计划在今年上半年回购价值10亿美元的股票，并在下半年再回购大约20亿美元。这一数字较2024年有所增加，符合市场普遍预期，但该计划还需取决于目前瑞士金融监管机构正在起草的瑞士银行监管改革。此外，这家国际金融巨头还计划派发每股股息 <br>90 美分，高于上年同期的派息规模，并计划向投资者们返还更多现金，拟于今年将派息水平提高大约 10%。这家全球财富管理机构正在寻求为股东带来更大的回报，因为其2023年收购的前竞争对手——在2023年陷入流动性枯竭危机的瑞士信贷(Credit <br>Suisse)的收购整合工作目前进展顺利。然而，瑞士政府即将大幅提高金融机构的资本要求，这阻碍了瑞银对于未来资管与投行业务“雄心壮志般的蓝图规划”，瑞银首席执行官塞尔吉奥·埃尔默蒂(Sergio <br>Ermotti)警告称，监管机构的过度反应可能会损害瑞士在全球投资银行领域的市场竞争力。在业绩展望中，瑞银表示，投资者们在2024年底美国总统大选结果公布后表现出更积极主动的风险偏好，且“颇具建设性”的市场状况延续至今年第一季度。该行警告称，潜在的全球贸易战争、通胀和央行政策的不确定性增加可能导致未来金融市场波动大幅加剧。上个月，瑞银在其本土市场瑞士启动了一轮裁员，数百名位于瑞士的员工在最近几周收到了通知。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2656697",
            "pub_date": "2025-02-04 15:36:35",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2656700,
            "title": "震荡逾半月，美元/日元能否突破157，走出多头行情？",
            "description": "<div><br>在近期的外汇市场中，美元/日元表现出一定的波动性。尽管日元在美国总统特朗普推迟对加拿大和墨西哥征收关税的消息后有所回升，但日元对美元的贬值仍持续。基本面分析市场普遍认为日本央行可能进一步加息，这对日元提供了支撑。美联储可能进一步宽松货币政策，缩小日元与美元之间的利差，可能对日元有利，避免其过度贬值。与此同时，特朗普推迟对加拿大和墨西哥征税，缓解了全球贸易格局忧虑，削弱了日元的避险需求，导致其进一步走弱。此外，市场担心日本可能成为特朗普的下一个贸易目标，这加剧了对日元的负面情绪。美元的适度强势帮助美元/日元维持在155.00上方。尽管美元面临政策不确定性，但美国经济数据较强，使美元在全球市场中仍具吸引力，持续施加对日元的压力。技术面分析师解读：从技术面来看，美元/日元目前面临多个关键的技术水平。首先，美元/日元在156.00附近遭遇强劲的技术阻力，这一水平可能会限制汇价的进一步上涨。如果突破这一水平，接下来的技术阻力将位于156.25区域，即上周的高点。若价格突破156.25水平，可能会进一步上升至156.75区域。若突破157.00大关，汇价有可能会向158.00关口靠近（尽管在157.50附近会遇到一定的阻力）。（美元/日元日线图，来源易汇通）另一方面，若美元/日元汇率跌破155.00这一重要心理关口，可能会触发进一步的下行压力。下行的支撑位于154.65区域。若价格进一步下跌，154.30、154.00以及153.70将是下一个支撑区域，这一带包含了1月低点的区域，是潜在的强支撑位。若价格有效突破这些支撑区域，可能会加速下跌，汇价有可能会进一步走向153.00水平，随后触及152.60-152.55区域及152.30区域。152.30为100日均线所在区域，因此这一位置可能会成为汇价的强支撑区。当前美元/日元汇率的走势呈现出多头和空头之间的博弈。从当前的技术走势来看，若价格突破156.00和156.25水平，则可能会吸引更多的买盘，推动汇价向更高的水平发展。若价格突破155.00支撑位，空头将占据主导地位，美元/日元有可能加速向下行走，进一步接近153.00及152.30水平。总结从基本面来看，美元/日元汇率受多方面因素的影响。美联储宽松政策的预期及特朗普贸易政策的不确定性，正在影响美元与日元之间的利差，并对日元汇率形成压力。虽然日元受到部分支撑，但特朗普的贸易政策以及美元的适度强势依然推动美元/日元维持在相对高位。从技术面来看，美元/日元汇率面临强劲的阻力位与支撑位，未来的走势将取决于价格能否突破156.00及156.25的阻力区间，或是跌破155.00支撑区域。<br></div>",
            "link": "https://cn.investing.com/news/forex-news/article-2656700",
            "pub_date": "2025-02-04 15:40:13",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}