{
    "data": [
        {
            "id": 2657905,
            "title": "港股异动 | 航空股早盘普跌 高基数致航班量同比略降影响客流增速 节中裸票价同比下降",
            "description": "<div> 智通财经APP获悉，航空股早盘普跌，截至发稿，中国国航(00753)跌4.82%，报4.54港元；南方航空(01055)跌3.58%，报3.5港元；国泰航空(00293)跌2.11%，报10.22港元；东方航空(00670)跌1.22%，报2.43港元。消息面上，据交通运输部预计，2025年春运期间全社会跨区域人员流动量将达到90亿人次左右、同比增长约7%，铁路、民航客运量有望分别突破5.1亿人次/同增5.5%+和9000万人次/同增7.8%+，均创历史新高。西部证券指出，1月24日至2月3日，国内航司执行率（不含港澳台）和国际航司执行率较去年同期分别回落0.8和1.2个百分点。然而，交通运输部数据显示民航客运量同比增加5.5%。二者走势背离的原因可能是不同出行目的地之间的热度正在分化，热门出游目的地仍然是“强者恒强”。国泰君安指出，节中前四天客流同比增长4%，高基数致航班量同比略降影响客流增速。票价方面，估算节中裸票价同比下降，保障机队周转与客座率同比持平。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657905",
            "pub_date": "2025-02-05 10:36:59",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657928,
            "title": "日元汇率大涨！分析师预计年中将升破150，但特朗普关税压力仍存",
            "description": "<div> 投资慧眼Insights - 日本名义薪资创下近30年来最大升幅，这支持日本央行进一步加息。但特朗普关税政策将带来美元升值压力，或将抑制日元升值。 2月5日，日元汇率大涨，截至发稿，美元/日元（USD/JPY）跌0.53%，报153.50。消息面上，日本名义薪资创下近30年来最大升幅，这支持日本央行最近的加息决定，并为该央行进一步采取紧缩措施提供理由。【图源：TradingView；近3个月美元/日元（USD/JPY）走势】日本政府公布，12月份名义薪资同比上升4.8%，高于11月修正后的3.9%增幅，也超过经济学家普遍预期的3.7%，并创下1997年以来最大升幅。薪资强劲增长主要受到奖金大增6.8%的推动。另一个有利迹象是，尽管通胀加速，12月实际薪资连续第二个月上升。日本整体通胀率近三年来一直保持在2%以上，并在12月达到3.6%。【图源：tradingeconomics；近一年日本CPI同比】日本央行的目标是实现可持续的2%通胀水准，具体以整体CPI为衡量标准。日本央行行长植田和男明确表示，日本现在经历的是通胀，而不是通缩状态。在通胀和薪资增长达到预期的背景下，目前，市场普遍认为日本央行2025年内还有一次加息。未来日元汇率走势将如何？三井住友银行首席外汇策略师铃木浩史表示，在日美利率差逐渐收敛下，日元兑美元汇率将缓慢升值。 到6月末，日元汇率将升至1美元兑149日元，到12月末为145日元。不过，日元不断升值到1美元兑130日元的可能性很低。特朗普主张的提高关税等政策将带来美元升值压力，或将抑制日元升值。 原文链接</div>",
            "link": "https://cn.investing.com/news/forex-news/article-2657928",
            "pub_date": "2025-02-05 10:37:10",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657929,
            "title": "黄金世界的中心正在扩大，金价有望剑指3000美元，大量资金为何还在观望？",
            "description": "<div><br>Incrementum AG的管理合伙人Ronald-Peter Stoeferle表示，尽管美元走强，利率上升，但金价显示出显著的韧性，预示着攀升至每盎司3000美元的潜力。Stoeferle在利雅得举行的未来矿产论坛上发表讲话，强调了全球黄金市场的转变，新兴市场的需求日益受到推动。Stoeferle称：“黄金世界的中心不再是苏黎世、伦敦或纽约，它正在迈向迪拜、上海、孟买以及沙特。”他指出，迪拜目前占全球黄金贸易的25%，成为全球第二大黄金市场。Stoeferle注意到，在这些新兴市场，人们对黄金的态度有所不同，黄金被视为“稳健的货币”，而不仅仅是一种交易工具。这种文化喜好，类似于印度、土耳其和亚洲大国，导致对实物黄金的持续需求，即使在价格下跌时也是如此。他表示：“这些数字几乎是目前来自新兴市场实物需求的三分之二。”考虑到当前的经济环境，黄金的韧性尤其值得注意。Stoeferle指出，过去三个月美元指数上涨了4.8%。传统上，这些因素会对金价产生负面影响，但没有。他称：“这对金价来说就像一个可怕的场景，但金价仍然表现良好。”Stoeferle认为，黄金涨势只走了一半，还有大量资金正在观望，尤其是尚未参与涨势的西方金融投资者。他补充说：“每一次小幅下跌都被买入。”这增强了他对未来增长的信心。他还指出，根据他们的模型，金价今年将达到近3000美元。现货黄金日线图 来源：易汇通北京时间2月5日10:32 现货黄金 报 2849.54 美元/盎司<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2657929",
            "pub_date": "2025-02-05 10:40:16",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657897,
            "title": "春节后首日，A50大跳水跌超2%！人民币汇率短线直升",
            "description": "<div>英为财情Investing.com -周三（5日），春节假期后首日，富时中国A50指数期货短线大跳水跌超2.3%。 人民币汇率短线拉升，美元兑人民币日内跌0.09%，报7.1783。消息面上，2025年2月1日，美国政府宣布以芬太尼等问题为由对所有中国输美商品加征10%关税。美方单边加征关税的做法严重违反世界贸易组织规则。对此，根据《中华人民共和国关税法》、《中华人民共和国海关法》、《中华人民共和国对外贸易法》等法律法规和国际法基本原则，经国务院批准，自2025年2月10日起，对原产于美国的部分进口商品加征关税。渣打银行大中华及北亚首席经济学家丁爽表示，在具体工具的选择上，预计中国不会借助人民币大幅贬值来抵消关税上调的影响。货币政策的取向已经从稳健转为适度宽松，预计央行将通过多种工具向市场注入充裕流动性，以支持政府债券的发行，并择机下调政策利率以避免实际利率上升。<br>如何发现被低估的股票？InvestingPro公允价值工具助你一臂之力。多维度估值模型，从现金流、营收、净利等数据对股票进行全方位估值。<br>此外，订阅InvestingPro，还将得到更多功能：<br>ProPicks AI：AI智能选股策略，战绩显赫。<br>股票筛选器：Pro版100+筛选条件，Pro+版超1000种指标，精准挖掘优质股票。<br>热门投资组合：沃伦·巴菲特、大空头和索罗斯（George Soros）投资组合，一键直达<br>点击此处进一步了解InvestingPro，领取超值优惠。<br></div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657897",
            "pub_date": "2025-02-05 10:13:45",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657885,
            "title": "鹰派美联储与DeepSeek冲击波重塑美股“牛市叙事” “七巨头”告别领涨阵营?",
            "description": "<div> 智通财经APP获悉，华尔街顶级投资机构摩根士丹利旗下的财富管理业务部门近期发布的报告指出，美股基准指数——标普500指数(S&P <br>500)显现出疲态，并表示美联储暂停降息的“鹰派货币政策立场”，以及DeepSeek带来的”低成本AI冲击波“，正在改变美国股市的“牛市叙事逻辑”。大摩在这份最新发布的研究报告中表示，自2022年年末美股牛市启动以来，标普500指数已上涨约70%，但如今却不断显示出疲软迹象。大摩在报告中表示，除了技术面驱动因素以外，美股市场正面临两大根本性质的变化。其一是美联储在一系列降息举措后坚定选择按兵不动维系利率不变;其二是中国初创公司DeepSeek掀起的超低成本AI训练创新前景，这引发了上周包括英伟达(NVDA.US)在内的美股科技股剧烈抛售浪潮。大摩在报告中强调，综合来看，投资者们应重点关注美国股市“领导势力的轮换与切换趋势”，即随着美股牛市叙事被上述两大力量所撼动，美股市场的核心贡献力量后续有望从“美股七大科技巨头”股票转向价值股、周期股以及“非生成式AI类型”的长期业绩增长领域。占据标普500指数以及纳斯达克100指数高额权重的所谓“美股七大科技巨头”，即“Magnificent <br>Seven”，它们包括：苹果、微软、谷歌、特斯拉、英伟达、亚马逊以及Facebook母公司Meta <br>Platforms，它们乃标普500指数屡创新高的核心推动力。放眼整个美股，七大科技巨头自2023年以来乃领涨整个美股的最核心力量，它们凭借布局AI带来的无比强劲营收、坚如磐石的基本面、多年以来持续强劲的自由现金流储备以及不断扩张的股票回购规模，吸引全球范围的资金蜂拥而至。降息预期大降温，“七大科技巨头”步入回调轨迹大摩财富管理业务部门的首席投资官丽莎·莎莱特(Lisa <br>Shalett)在这份研究报告中写道：“尽管1月份美联储暂停降息已基本上被金融市场预期，但许多投资者仍希望美联储能表达出对货币宽松政策的预期路径。然而，美联储并未如市场期待的那样进行“鸽派”表态，投资者们现在需要承认，政策驱动的估值扩张已接近极限，市场驱动力将转向盈利实现，尤其是AI货币化路径。”莎莱特指出，此轮美股牛市的叙事一直围绕美国科技创新和“七大科技巨头”在AI领域的绝对主导地位，同时美联储持续降息的路径推动美国经济“软着陆”预期，维持了市场动能。她在报告中表示：“上周的DeepSeek冲击事件……强化了我们的观点，即市场牛市叙事正在转变，我们正在进入所谓的‘全面正常化’阶段(Great <br>Normalization)。我们认为，这一阶段将以利率和市场估值正常化为主导势力;盈利增长将重新成为股市的主要驱动力，同时标普500指数的市值集中度有望大幅下降，意味着七大科技巨头的趋势疲软。”莎莱特指出，随着投资者们对于本轮美联储终端利率的共识预期集中在3.75%-4.0%之间，股票市场估值扩张的上限也将受到严重限制。她表示，这是因为七大科技巨头等“市值领导者”所面临的中性利率水平和负面的股权风险溢价“必须被承认”。当前利率期货市场对于美联储2025年降息预期相比于去年下半年大幅降温，一些交易员甚至开始定价美联储2025年“不降息”。2024年12月公布的“点阵图”显示出的2025年降息预期从此前的四次预期大幅缩减至两次，并且2026年利率预期以及市场聚焦的“中性利率”预期均有所上调，迫使美债市场重新定价降息预期，同时愈发攀升的预算赤字预期推动“全球资产定价之锚”——即10年期美债收益率，带领各期限美债收益率骤然转向上行轨迹。在上周，由于投资者们担忧DeepSeek引领的“低成本AI大模型算力范式”推动科技巨头们在短中期内大幅削减AI <br>GPU订单，因此“AI芯片霸主”英伟达上周一股价大跌近17%，收报118.42美元，单日的市值蒸发规模达到5890亿美元，为美国股市历史上最大规模市值损失，打破此前纪录。随着这股来自东方的“DeepSeek低算力成本风暴”席卷全球，投资者们开始强烈质疑微软、谷歌等美国科技巨头们对于人工智能堪称“非理性”的狂热AI烧钱计划是否合理。毕竟动辄千亿美元的支出，相比于DeepSeek仅仅百万美元级别训练成本以及相比于OpenAI等美国AI领军者低得多的推理成本，令这些美国科技股投资者无比震惊的同时也无比愤怒，这也是为什么上周一纳斯达克100指数的总市值蒸发近1万亿美元。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657885",
            "pub_date": "2025-02-05 10:09:28",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657873,
            "title": "港股异动 | 猫眼娱乐(01896)早盘重挫逾13% 《唐探1900》表现符合预期 机构称24年收入或同比下滑12%",
            "description": "<div> 智通财经APP获悉，猫眼娱乐(01896)早盘重挫逾13%，截至发稿，跌9.97%，报7.77港元，成交额7115.63万港元。消息面上，据国家电影局统计，截至2月5日9:00，2025年春节档票房为95.10亿元，观影人次为1.87亿。据猫眼专业版数据，电影《唐探1900》上映8天， <br>总票房破23亿。据悉，《唐探1900》由万达主投，其他出品方包括猫眼娱乐、中国儒意等。国联证券指出，《唐探1900》表现符合预期，“唐探 IP”系列 4 <br>部影片总票房已超过100亿。建银国际此前表示，预期猫眼娱乐去年财报疲弱，预计去年总收入同比跌12%至42亿元人民币，网上票务收入同比跌14%至19.5亿元，比行业同比22%的跌幅较窄，主要受到收娱乐活动票务增长强劲。另预计娱乐内地收入同比跌11%至20.5亿元，主要因为数个主要项目的票房疲软拖累。该行认为，猫眼今年可受益于行业的复苏，这主要得益于更好的内容供应，由1月29日即将上映的贺岁片电影为起点。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657873",
            "pub_date": "2025-02-05 10:09:45",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657869,
            "title": "CBOT持仓：净多头增加，市场信心回升！谷物期货价格能否继续上涨？",
            "description": "<div><br>周三(2月5日)，CBOT谷物市场在经历了连续几日的波动后，隔夜整体呈现上涨趋势。大豆期货价格攀升至7月以来的最高水平，小麦期货也触及11月以来的高点，而玉米价格则维持在2023年10月以来的高位附近。市场情绪受到多重因素影响，包括关税言论的缓和、美元走软以及南美天气风险等。以下将分别从大豆、玉米、小麦、豆粕和豆油五个品种的持仓变动及市场情绪进行分析。根据汇通财经观察，海外交易商估算的结果显示：2025年2月4日当日，大宗商品基金：增加CBOT玉米投机性净多头；增加CBOT大豆投机性净多头；增加CBOT小麦投机性净多头；增加CBOT豆粕投机性净多头；增加CBOT豆油投机性净多头。最近5个交易日，大宗商品基金：增加CBOT玉米投机性净多头；增加CBOT大豆投机性净多头；增加CBOT小麦投机性净多头；增加CBOT豆粕投机性净多头；增加CBOT豆油投机性净多头；最新30个交易日，大宗商品基金：增加CBOT玉米投机性净多头；增加CBOT大豆投机性净多头；增加CBOT小麦投机性净多头；增加CBOT豆粕投机性净多头；增加CBOT豆油投机性净多头。具体变动数据见图表。大豆：关税担忧缓解推动价格上涨CBOT大豆期货在周二大幅上涨，主力合约收于10.75美元/蒲式耳，创下自2023年7月以来的最高水平。市场情绪主要受到美国暂停对墨西哥和加拿大加征关税的提振，进一步缓解了市场对贸易冲突的担忧。此外，美元走软也增强了美国大豆的出口竞争力。从持仓数据来看，大宗商品基金在2月4日增加了11500手大豆净多头头寸，连续五个交易日净多仓增加，显示出市场对大豆后市的乐观情绪。南美天气风险也为价格提供了支撑，阿根廷的干旱和巴西的过量降雨可能影响当地大豆产量，进而推高对美国大豆的需求。展望未来，大豆价格可能继续受到贸易谈判进展和南美天气的影响。玉米：需求回暖与天气风险支撑价格CBOT玉米期货在周二收于4.94-1/2美元/蒲式耳，接近2023年10月以来的高点。市场情绪受到美国暂停对墨西哥加征关税的提振，墨西哥是美国玉米的最大进口国。此外，美国农业部确认向韩国出口13.2万吨玉米，进一步增强了市场对出口需求的信心。持仓数据显示，大宗商品基金在2月4日增加了11000手玉米净多头头寸，连续五个交易日净多仓增加，表明市场对玉米后市的看涨情绪。南美天气风险也为玉米价格提供了支撑，阿根廷的干旱可能影响当地玉米产量。未来，玉米价格可能继续受到出口需求和天气因素的驱动。若美元进一步走软，玉米的出口竞争力将增强，价格有望维持强势。小麦：技术性买盘与美元走软推动上涨CBOT小麦期货在周二收于5.77美元/蒲式耳，创下自2023年11月以来的最高水平。市场情绪受到技术性买盘和美元走软的提振。此外，美国冬小麦产区的天气状况也引发关注，堪萨斯州的作物评级改善，但俄克拉荷马州、科罗拉多州和内布拉斯加州的土壤湿度下降，可能影响作物生长。持仓数据显示，大宗商品基金在2月4日增加了4000手小麦净多头头寸，连续五个交易日净多仓增加，显示出市场对小麦后市的乐观情绪。国际市场的需求也为价格提供了支撑，韩国和日本等国的采购活动活跃。展望未来，小麦价格可能继续受到天气和出口需求的驱动。若美元进一步走软，小麦的出口竞争力将增强，价格有望继续上行。豆粕：供应充足压制价格，但出口需求回暖CBOT豆粕期货在周二收于314.00美元/短吨，尽管美国国内供应充足压制了部分涨幅，但出口需求的回暖为价格提供了支撑。美国大豆压榨量在12月创下历史新高，导致豆粕供应充裕，但海湾地区的出口溢价走强，显示出国际需求的改善。持仓数据显示，大宗商品基金在2月4日增加了7500手豆粕净多头头寸，连续五个交易日净多仓增加，表明市场对豆粕后市的看涨情绪。南美天气风险也为价格提供了支撑，阿根廷的干旱可能影响当地豆粕产量。未来，豆粕价格可能继续受到供应和出口需求的博弈影响。若国际需求进一步回暖，价格有望上行。豆油：关税延迟提振市场情绪CBOT豆油期货在周二表现相对疲软，主要受到加拿大菜籽油竞争的压力。然而，美国暂停对加拿大加征关税的消息缓解了市场对贸易冲突的担忧，为豆油价格提供了一定支撑。持仓数据显示，大宗商品基金在2月4日增加了4000手豆油净多头头寸，连续五个交易日净多仓增加，显示出市场对豆油后市的乐观情绪。此外，美元走软也增强了豆油的出口竞争力。展望未来，豆油价格可能继续受到贸易政策和国际需求的驱动。若美元进一步走软，豆油的出口竞争力将增强，价格有望回升。总结与展望总体来看，CBOT谷物市场在近期表现出较强的上涨动力，主要受到关税言论缓和、美元走软以及南美天气风险的提振。从持仓数据来看，大宗商品基金在多个品种上增加了净多头头寸，显示出市场对后市的乐观情绪。未来，市场走势将继续受到贸易谈判进展、美元走势和天气因素的影响。若贸易紧张局势进一步缓和，美元走软，谷物价格有望继续上行。然而，投资者需密切关注南美天气变化以及国际需求的波动，这些因素可能对价格产生重要影响。<br></div>",
            "link": "https://cn.investing.com/news/commodities-news/article-2657869",
            "pub_date": "2025-02-05 10:00:19",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657855,
            "title": "股汇齐升！墨加关税暂缓后 新兴市场迎来大反攻",
            "description": "<div> 财联社2月5日讯（编辑 潇湘）由于周二（2月4日）交易员对美国总统特朗普的关税威胁将引发全面贸易战的担忧有所缓解，新兴市场股市和汇市双双走出了大反攻行情。行情数据显示，MSCI新兴市场股票指数周二上涨了1.7%，为去年10月以来的最大涨幅，而其对应的新兴市场货币指数也因美元大幅回落而创下一周多来的最大升势。彭博美元现货指数当日则下跌了0.7%，结束了连续六个交易日的上涨势头。新兴市场股市和汇市上涨的主要原因之一，显然是特朗普同意推迟对加拿大和墨西哥征收25%的贸易关税，以换取更为严格的边境管控措施。当地时间2月3日早些时候，特朗普与墨西哥总统辛鲍姆通话。两人在通话后都宣布，美国和墨西哥同意将加征关税的措施立即暂缓一个月执行，并继续进行谈判。随后不久，加拿大总理特鲁多也表示，美国总统特朗普决定将暂缓对加拿大产品加征关税，为期至少30天。加拿大方面也放弃了对美实施报复性关税。CFRA Research首席投资策略师Sam Stovall表示，“特朗普总统这么快就向墨西哥和加拿大提出了30天的关税暂缓期，所以你会觉得，也许他真正想要的是一个快速的胜利宣言，而从贸易角度来看，这并不会改变什么。”“投资者今天已经松了一口气，我们将看看一个月后他们还能不能继续这样，”Stovall称。从各主要新兴市场货币的走势看，智利比索是隔夜拉美地区升幅最大的货币，在该国最大出口商品铜价上涨的推动下，智利比索汇率跃升至了去年12月以来的最高水平。马来西亚林吉特和泰铢则在亚洲地区领涨，而离岸人民币兑美元在连续两个交易日大幅反弹后，也已基本收复了春节假期最初的失地。关税影响对中国市场的全面影响将在周三A股恢复交易后更加明朗。在美国市场上，周二美国三大股指同样集体上涨，延续了周一V型反转过山车行情后的复苏行情。强劲的企业业绩也提振了投资者的乐观情绪。根据业内的统计，在已公布第四季度业绩的211家标普500指数成分股公司中，76.8%公司的盈利表现超过了分析师的预期。随着加拿大和墨西哥获得为期30天的关税暂缓执行期，过去几个月在关税可能推高通胀的担忧下持续承压的美债价格，本周也出现了反弹。10年期美债收益率周二尾盘下跌2.8个基点，至4.515%，周一盘中曾跌至12月中旬以来的最低点。根据利率期货市场的最新定价，目前市场交易员预计美联储今年将大约降息46个基点——即几乎相当于两次降息，每次25个基点。根据LSEG的计算，这一降息幅度的定价略高于周一晚些时候的41个基点，美联储年内的首次降息可能发生在6月或7月的政策会议上。风险犹存当然，尽管特朗普同意将对加拿大和墨西哥征收关税的期限推迟一个月，但从长远来看，全球贸易紧张局势依然存在，不少外汇分析师表示，他们预计对关税发展的高度敏感性和波动性仍将持续存在。LPL Financial首席固定收益策略师Lawrence Gillum表示，“未来几个季度内，市场将不断在关税与威胁之间反复权衡——哪些是切实可行的政策，哪些只是虚张声势的恫吓，这种拉锯会持续上演。”杰富瑞全球外汇策略主管Brad Bechtel在一份报告中则写道，“市场眼下的假设似乎是，问题已经解决，我们都可以继续前进。但我们必须记住，这只是30天的暂停，特朗普就是特朗普，因此我预计火药味还远远没有结束。”“现在就坚定地宣称可以避免全面贸易战还为时过早。未来几周，新兴市场的货币可能会对特朗普总统及其贸易代表的任何言论都很敏感，”inTouch Capital Markets 高级分析师Piotr Matys也指出。德国商业银行和瑞穗银行的策略师则认为，鉴于采取额外关税措施的风险，贸易问题接下来可能仍将提振美元，而欧盟可能会成为特朗普的下一个目标。德国商业银行高级外汇分析师Antje Praefcke表示：“只要特朗普还在大舞台上炫耀自己的实力，谁会真的想做空美元呢？下一次冲击肯定会到来，而且很可能再次利好美元。”整体而言，一项期权市场上衡量美元人气的指标仍接近七个月以来的最高水平，而包括Patrick Locke在内的摩根大通策略师周二指出，到目前为止，他们还没有看到衍生品市场中美元多头仓位普遍平仓的证据。自去年美国总统大选以来，彭博美元指数已累计上涨了约4%。交易员们纷纷押注美元将升值，因为他们猜测特朗普的政策可能会促进经济增长并重新引发通胀。根据美国商品期货交易委员会(CFTC)的最新数据，投机商目前持有约337亿美元的美元看涨头寸，接近2019年以来的最高水平。XTB Ltd研究主管Kathleen Brooks表示：“与过去几个月一样，美元的上涨趋势仍然十分明显。美元的走势具有多年的周期性，我们将继续观察这种走势。”</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657855",
            "pub_date": "2025-02-05 09:49:58",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657849,
            "title": "港股异动 | 黄金股普遍高开 避险情绪推动金价屡创新高 大行看高金价至3000美元",
            "description": "<div> 智通财经APP获悉，黄金股普遍高开，截至发稿，灵宝黄金(03330)涨2.7%，报4.95港元；山东黄金(01787)涨2.51%，报14.7港元；招金矿业(01818)涨1.87%，报13.1港元；紫金矿业(02899)涨0.92%，报15.44港元。消息面上，避险情绪推动国际金价大幅上涨。春节假期期间，伦敦现货黄金与纽约商品交易所（COMEX）黄金期货均刷新历史高位，2月5日，现货黄金一度上探2848.25美元，续刷历史新高。花旗认为，关税进一步升级将导致在6-12个月内看涨黄金，金价将升至每盎司3000美元。中金表示，展望2025年，金价或仍处牛市通道，2025年或有望突破3000美元/盎司，人民币金价或将较之美元金价实现更大涨幅。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657849",
            "pub_date": "2025-02-05 09:48:46",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657821,
            "title": "黄金又破纪录!关税战火点燃“避险王“行情，投行高呼3000美元不是梦",
            "description": "<div> 智通财经APP获悉，2月5日，黄金价格重新回升至历史新高，主要原因是市场避险情绪升温。在中国对美国征收关税以报复美国总统唐纳德·特朗普的关税政策后，投资者纷纷寻求避险资产。截至发稿，现货黄金上涨0.04%，至每盎司2,843.08美元，盘中早些时候触及2,845.14美元的历史高位。美国黄金期货收盘上涨0.7%，至2,875.80美元。德国商业银行分析师卡斯滕·弗里奇指出，特朗普反复无常的关税决定加剧了市场的不确定性，这有利于黄金作为避风港的吸引力。摩根大通数据显示，上周黄金市场出现净流出，但贸易关税的不确定性正在推动投资者重新进入避险资产。该银行表示，截至1月31日当周，贵金属未平仓合约下降4.6%，即113亿美元。RJO <br>Futures高级市场策略师鲍勃·哈伯科恩表示，关税消息是当前市场的主要驱动因素，而美元走势也对金价产生了影响。美元指数在2月5日下跌0.9%，使得黄金对其他货币持有者来说更加便宜，这在一定程度上推动了金价上涨。2月份近月Comex黄金收盘上涨0.7%，至2,853.30美元/盎司，再创历史结算新高。2月份近月白银收盘上涨1.5%，至32.888美元/盎司，为10月30日以来的最佳结算价。据了解，中国对美国进口产品征收关税的反制措施加剧了世界两大经济体之间的贸易战，尽管特朗普暂缓对墨西哥和加拿大征收关税。三位美联储官员警告称，特朗普政府的贸易关税计划伴随着通胀风险，其中一位官员认为，价格前景的不确定性要求降息速度比其他情况更慢。美国12月就业岗位空缺降至760万个，低于市场普遍预期的800万个，表明经济可能放缓。此外，传统上，黄金被视为对冲通胀和地缘政治不确定性的工具，但较高的利率会降低这种无收益资产的吸引力。不过，XS.com的拉尼娅·古莱表示，黄金的整体上涨趋势依然完好，任何回调都应被视为买入机会，因为支撑因素并未发生根本性改变。她还补充道，由于市场依然不确定，黄金可能仍将是投资者关注的焦点，既可作为对冲工具，也可作为投资机会。Kitco Metals高级市场分析师Jim <br>Wyckoff表示，鉴于现任美国政府的破坏性政策给市场带来了不确定性，再加上各大央行可能增加黄金购买量以分散对美元资产的持有，今年金价可能达到3,000美元。目前，投资者的注意力转向周三的ADP就业报告、周五的非农就业报告以及几位美联储官员的讲话。其他贵金属方面，现货白银上涨2.5%，至每盎司32.33美元。铂金上涨0.4%，至每盎司967.94美元，钯金下跌1.3%，至每盎司994美元。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657821",
            "pub_date": "2025-02-05 09:49:03",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}