{
    "data": [
        {
            "id": 2657718,
            "title": "美联：香港1月整体物业注册量失守5000宗 创4个月新低",
            "description": "<div> 智通财经APP获悉，据土地注册处资料显示，香港1月整体物业(包括一手私楼、二手住宅、一手公营房屋、工商铺、纯车位及其他等)注册量合共录4938宗，较去年12月5510宗下跌约10.4%，并创4个月新低。鉴于签署买卖合约至递交到土地注册处注册登记需时，因此今年1月注册个案一般主要反映去年12月的市况。美联物业首席分析师刘嘉辉指出，1月有多个新盘推售，带动一手成交量连跌2个月后回升。1月一手成交量录约750多宗，月环比回升约1成；虽然如此，但上月底适逢农历新年假期关系，不少市民忙于筹备年货或外游过节，香港二手物业交投显著放慢，在此消彼长下，料整体物业注册量将持续低于5000宗水平，并预期在2月注册量反映出来。展望2月实际市况，美联指出，长假期完结后外游市民回港，将刺激购买力释放，料香港住宅成交量有望回升，最快3月份注册量才有望反映出来。据美联物业研究中心综合土地注册处资料显示，回顾1月各类物业注册量，住宅方面，在不包括一手公营房屋之下，1月一手私楼及二手住宅注册量合共录3850宗，较去年12月4412宗减少约12.7%；一手公营房屋方面，1月录383宗，月环比微跌约0.5%；非住宅物业方面，1月工厦、商厦、商铺、纯车位及其他等注册量合共录705宗，较去年12月亦下跌约1.1%。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657718",
            "pub_date": "2025-02-05 07:05:29",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657719,
            "title": "重卡1月销7万辆降28% 电动重卡增速放缓",
            "description": "<div> 智通财经APP获悉，根据第一商用车网初步掌握的数据，2025年1月份，我国重卡市场共计销售7万辆左右（批发口径，包含出口和新能源），环比12月下降17%，比上年同期的9.7万辆下滑28%。7万辆放在最近八年来看，高于2023年1月的销量，但低于其他年份的1月销量。客观来说，由于今年春节时间比较早，1月份的“开门红”没有达到上年同期的高度，但也为开春后2月份重卡销量的增长埋下了伏笔。第一商用车网分析认为，2025年1月重卡市场同比、环比下降，主要原因有两个方面。首先，1月份是春节月，比上年同期早。今年春节是8天长假，供应商、生产、营销、渠道都会放假，进而在一定程度上影响各重卡厂家“开门红”的表现。其次，2024年末行业没有“留余粮”。2023年底的时候，由于当年重卡市场复苏较快，各家车企目标完成情况都比较好，因此不少车企在当年年底“留了”很多批发销量到第二年一季度，以保证第二年的“开门红”，这就在客观上推动了2024年1月的销量高企。2024年，由于重卡市场整体下行（尽管有货车以旧换新政策的刺激），各大重卡企业基本都没有余力“把余粮留到来年”，而是全力以赴完成年底的销售任务，以确保2024年目标的达成或者接近完成。这一点从2024年12月重卡行业批发销量高达8.4万辆、同比增长达到62%也可以看出来。2024年底没有销量“结转”到2025年1月，而上年同期的2024年1月销量又被“结转”销量推的非常高——接近10万辆，因此，2025年1月行业销量出现同比较大下滑，在所难免；即便是备受关注的出口，也同比下降了两位数。2015-2025年我国重卡行业销量年度走势图（单位：万辆）1月份，电动重卡增速放缓，燃气车占比上升2025年1月份，行业批发销量出现同比、环比双双下降，国内终端销量也出现了一定程度的下滑。从终端需求来看，由于1月份是春节月，再加上去年货车以旧换新对市场的“透支”，因此，1月份重卡终端市场表现一般（略高于去年2月“春节月”的终端销量），同比降幅预计为16-20%。一方面，今年春节较早，春节所在的月份向来属于传统淡季，公路货运行业运输车辆减少、车主和司机节前回家过年是常态，因此，1月份终端购车曲线是逐日走低的，越临近春节就越低。另一方面，去年实施的货车以旧换新政策截止日是2024年12月31日，“过时不候”，这就导致2024年底出现了大量换购新车扎堆上牌的现象。新车在年底扎堆上牌，直接影响了2025年1月份的新车终端销量。从几个备受关注的细分领域来看，2025年1月，天然气重卡实销同比小幅下降，但市场占比进一步提高。今年1月份，LNG的零售价继续走低，北方LNG的平均售价不到5元/kg，各地的油气价差普遍在2元以上，这推动了当月天然气重卡市场占比的提升，预计该细分领域终端销量比上年同期小幅下降4%左右，月度渗透率从同期的19%提升至22%以上。新能源重卡作为2024年重卡市场的重要“扛旗者”，去年全年销量突破了8万辆，同比增长1.4倍，国内渗透率也创下新高。1月份，新能源重卡的终端销量增速明显放缓，同比增幅预计在60%左右（2024年新能源重卡几乎每个月都是翻倍式的增长），行业渗透率约21%。这样一来，天然气重卡和新能源重卡的国内合计占比一开年就达到43%左右，比上年同期提高了10个百分点以上，柴油车的市场空间无疑被大大压缩。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657719",
            "pub_date": "2025-02-05 07:05:45",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657720,
            "title": "恒指牛熊街货比(59:41)︱2月5日",
            "description": "<div> 智通财经APP获悉，截至2月5日，恒指最新的牛熊街货比例为59:41。中信证券牛熊证街货分布图中的数据显示，熊证街货重货区在21000-21099区间，该区间最新熊证数量为840张，较上一交易日增加695张；最多新增在亦在此区间。牛证街货重货区在20200-20299区间，该区间最新牛证数量为682张，较上一交易日增加682张；最多新增在亦在此区间。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657720",
            "pub_date": "2025-02-05 07:06:16",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657721,
            "title": "招商证券A股2025年2月观点及配置建议：春季攻势 AI领衔",
            "description": "<div> 智通财经APP获悉，招商证券发布研报称，展望2月，在业绩预告披露落地和春节效应落地后，市场迎来经典的“春季攻势”的时间窗口，由春节后资金回流，两会预期，业绩真空期共同推动。当前经济数据的稳定改善开始逐渐缓解对于基本面承压的过度担忧，同时两会可能会对2025年经济的稳定改善注入新的动力，AI技术应用加速落地带来的产业变革预期，正持续强化科技成长板块的配置价值。风格层面，预计节后避险情绪集中释放后，市场风险偏好将逐渐修复，交易重回活跃，A股风格在短暂的大盘价值后将转向小盘成长，偏科技偏主题类股票有望成为阶段性进攻的方向。招商证券主要观点如下：大势研判和核心逻辑：春季攻势，AI领衔。在业绩预告披露落地和春节效应落地后，市场迎来经典的“春季攻势”的时间窗口，这个时间窗口由春节后资金回流，两会预期，业绩真空期共同推动。目前来看，经济数据依然呈现平稳复苏的态势，虽然没有太强幅度和超预期，但是数据的稳定改善开始逐渐“抚平”对于经济数据承压的焦虑感。加上两会可能会对2025年经济的稳定改善注入新的动力，投资者信心在4月前的窗口期大概率呈现持续修复的态势。春节后，个人投资者将会重新活跃，融资余额会回流。而以Deepseek <br>AI大模型，宇树人形机器人为代表的中国科技产品在全世界受到关注，有望强化投资者对于本轮AI应用科技产品落地的信心。而对于海外投资者来说，在这个春节后可能会更加正视中国科技与美国相抗衡的能力，进而增强对中国科技股乃至于整个中国资产的信心。总体来看，今年2-3月，仍然是经典的做多A股的时间窗口。股票类型选择方向，偏主题类方向尤其是AI应用将会成为下一个阶段市场重点进攻的方向，消费电子、传媒互联网、软件等领域与大模型应用相关、人形机器人落地相关的领域值得重点关注。对于更加看重基本面的投资者来说，继续布局高质量和高FCF类股票，仍是2025年稳健获益的选择。风格与行业配置思路：风格层面，综合考虑春节效应后半场、当前国内政策积极维护资本市场稳定以及美国加征关税等因素，预计节后避险情绪集中释放后，市场风险偏好将逐渐修复，交易重回活跃，A股风格在短暂的大盘价值后将转向小盘成长，月度维度看好偏小盘、成长、主题的风格，对应指数选择中证1000。行业选择层面，考虑未来一两个月的角度，综合考虑前期表现、估值、交易活跃度、景气变化、政策和事件催化，建议重点关注有望受益于春节效应、业绩向好的领域，具体涉及汽车(汽车零部件)、机械(自动化设备、工程机械)、电子(消费电子、半导体)、通信、社会服务、非银等。流动性与资金供需：ETF有望继续贡献主力增量资金，同时融资资金有望回流。国内流动性来看，1月春节取现需求叠加税期到来，资金面波动较大，资金利率大幅抬升，春节之后有望得到缓解。海外方面，美联储1月议息会议如期暂停降息，但对市场的影响相对有限，目前预期最早6月开始降息。另外，春节假期期间美国加征关税落地，美元指数走高，增大人民币汇率波动，可能影响春节后市场短期风险偏好。股市资金供需方面，1月股票市场可跟踪资金供需紧平衡，资金供需规模均有所收窄，ETF逆势净申购成为1月主力增量资金。展望2025年2月，ETF有望继续贡献主力增量资金，同时融资资金回流也有望贡献增量。中观景气和行业推荐：业绩预告落地后，政策与主题投资催化。截至目前约有52.2%的A股企业披露了2024年年度业绩预告/快报/报告，业绩向好率约33.7%。12月工业企业盈利当月同比增速转正，结构上以高技术制造业为代表的工业新动能利润较快增长，“两新”政策带动效果持续显现。景气方面，1月份景气较高的领域主要集中在中游制造、消费服务和金融地产领域，其中资源品板块化工品价格多数上涨，中游制造领域汽车产销和机械销售延续回暖，消费服务板块家电销售持续复苏，金融地产中地产销售延续改善。展望2月份，年报业绩预告告一段落，市场的关注点逐渐聚焦到对两会政策的预期，以及产业趋势的进展。推荐重点关注年报业绩预告显示业绩有支撑的领域;两会政策预期加码方向，主要涉及消费、基建投资等领域;以及新产业趋势催化的领域。建议重点关注有望受益于春节效应、业绩向好的领域，具体涉及汽车(汽车零部件)、机械(自动化设备、工程机械)、电子(消费电子、半导体)、通信、社会服务、非银等。赛道及产业趋势投资：DeepSeek发布R1模型，性能对标GPT-o1正式版。1月20日晚，杭州深度求索人工智能基础技术研究有限公司发布了第一代推理模型DeepSeek-R1-Zero与Deepseek-R1。DeepSeek-R1-Zero是一款通过大规模强化学习(RL)训练的模型，没有监督微调(SFT)作为初步步骤，展示了卓越的推理能力。然而，它遇到了诸如可读性差和语言混合等挑战。为了解决这些问题并进一步增强推理性能，引入DeepSeek-R1。这是一款在RL之前结合了多阶段训练和冷启动数据的更高级推理模型。DeepSeek-R1在推理任务上实现了与OpenAI-o1-1217相当的性能。1月重要政策梳理：据不完全统计，1月重要政策约132个。具体来看，1)总量政策方面，1月货币政策主要围绕着稳汇率方面。同时“两新”接续政策密集发布，加力“两新”扩围。2)资本市场方面，主要聚焦在结构性货币政策工具以及推动中长期资金入市方面;3)产业政策方面，1月生物医药及新质生产力相关政策值得重点关注，其中，新质生产力政策主要集中在低空经济、脑机接口、人工智能。风险提示： 政策理解不全面，经济数据不及预期，海外政策超预期收紧。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657721",
            "pub_date": "2025-02-05 07:06:32",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657723,
            "title": "智通ADR统计 | 2月5日",
            "description": "<div> 智通财经APP获悉，周二美股三大指数悉数下跌，恒生指数ADR上涨，按比例计算，收报20868.62点，较香港收市上涨78.66点或0.38%。大型蓝筹股多数上涨，汇丰控股收报80.86港元，较香港收市涨1.01%；腾讯控股收报423.999港元，较香港收市涨0.76%。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657723",
            "pub_date": "2025-02-05 07:06:58",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657724,
            "title": "恒指夜期收盘(2.5)︱恒生指数夜期(2月)收报20971点 高水181点",
            "description": "<div> 智通财经APP获悉，截至2月5日，恒生指数夜期(2月)收报20971点，上升131点或0.629%，高水181点。未平仓合约总数为96211张，减少16089张；未平仓合约净数26875张，减少458张。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657724",
            "pub_date": "2025-02-05 07:07:11",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657725,
            "title": "特朗普贸易政策推动避险需求 黄金价格一飞冲天！",
            "description": "<div> 智通财经APP获悉，近期，投资者因关税问题而感到忧虑，但黄金市场却成为一个亮点。随着美国总统唐纳德·特朗普持续释放关税威胁，市场不确定性上升。截至目前，黄金价格已上涨近9%，接近每盎司2,900美元的历史新高，而2024年黄金价格已累计上涨近30%。与此同时，矿业股的表现更加强劲。VanEck黄金矿业ETF（GDX.US）今年以来已上涨18%。尽管经历了大幅上涨，投资者仍需谨慎对待市场风险。然而，如果金价继续走高，矿业股仍可能有进一步上涨空间，而这种情况的可能性正在增加。根据世界黄金协会的数据显示，波兰、土耳其、印度和中国等新兴市场国家的央行在2024年底大举购入黄金。世界黄金协会高级市场策略师Joe Cavatoni表示：“新兴市场央行坚定看好黄金，并且有能力进一步增持。从战略上看，他们将继续成为黄金的主要买家。”本轮金价上涨的核心因素仍是特朗普政府的贸易政策。值得注意的是，黄金价格的飙升与美元同步上涨，这在历史上并不常见。Kinesis Money市场分析师Frank Watson指出，通常情况下，美元走强会对以美元计价的黄金价格构成压力。然而，由于市场对美国贸易政策带来的经济和通胀影响感到不安，黄金的避险属性仍然强劲。换句话说，特朗普的贸易政策可能正在“盖过”美元走强对金价的抑制作用。不仅仅是黄金，白银价格也出现强势上涨。今年以来，白银价格已上涨约13%。实物贵金属经销商Allegiance Gold首席运营官Alex Ebkarian在接受采访时表示，市场的不确定性将继续推动黄金和白银价格攀升。他指出：“在高风险环境下，实物黄金和白银的吸引力更加强烈，因为它们消除了对手方风险，并提供了可靠的价值存储。”此外，摩根大通最近交付了价值约40亿美元的黄金期货，这被认为是针对潜在贸易中断的一种对冲策略。展望未来，State Street SPDR业务首席投资策略师Michael Arone预测，今年金价可能突破3,000美元大关。他表示：“地缘政治风险以及全球货币和财政政策的结构性转变将进一步提振黄金市场。”Arone认为，全球央行在2025年仍可能持续购入黄金，这将为金价提供支撑，并可能引发投资者对黄金的进一步追捧。对于矿业股而言，即使经历了一轮大涨，估值仍然相对合理。VanEck黄金矿业ETF目前的市盈率约为2025年预期收益的12倍，低于其过去五年平均15倍的估值。此外，该ETF目前的市盈率比标普500指数低约45%，远高于其通常20%的折价水平，这意味着矿业股在整体市场中仍具吸引力。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657725",
            "pub_date": "2025-02-05 07:07:26",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657728,
            "title": "特朗普关税政策让美联储陷入两难局面：抗通胀还是保增长？",
            "description": "<div> 随着美国总统特朗普在贸易政策上的强硬立场，美联储正面临一个复杂的局面：究竟是采取措施遏制通胀，还是优先支持经济增长？特朗普政府试图将关税作为外交和经济政策的工具，但这给美联储的政策制定带来了微妙的平衡。智通财经APP获悉，许多经济学家认为，关税可能会推高物价，同时削弱国内生产总值的增速，关键问题在于影响的程度，以及美联储是否需要做出相应的政策调整。嘉信理财首席固定收益策略师Kathy Jones指出，关税可能带来价格冲击，但也可能被美元升值所抵消。然而，从长期来看，关税通常对经济增长不利。Jones表示：“这种组合让美联储陷入真正的困境。”当前，特朗普政府与中国、加拿大和墨西哥的贸易摩擦仍在持续。尽管对加拿大和墨西哥的关税计划已暂缓执行，谈判仍在进行，但与中国的贸易争端却不断升级，市场情绪因此变得紧张。在经济学界，关税通常被视为推高物价的因素，但历史数据并未提供明确的证据。例如，1930年的《斯姆特-霍利关税法》（Smoot-Hawley Tariff Act）不仅没有导致通胀，反而加剧了大萧条的通缩压力。特朗普在其首个总统任期内也曾实施关税政策。当时，美国通胀水平较低，美联储正在加息以寻找“中性”利率水平。然而，关税引发了制造业衰退，尽管这一影响并未蔓延至整个经济体系。但当前情况有所不同。特朗普提出的最新关税政策不再是针对特定商品，而是可能覆盖更广泛的商品类别，这可能会改变美联储的货币政策计算。嘉信理财预测，如果这些关税全面实施，GDP增速可能会减少1.2%，核心通胀率则可能上升0.7%，未来数月内可能超过3%。Jones认为，这种广泛的关税措施“既会对价格产生更大的影响，也会对经济增长带来更大的冲击。”她预测，美联储可能会因关税的不确定性而推迟降息，并在通胀上升的情况下保持观望，直到经济增长开始受到明显影响时才可能调整政策。“但美联储现在确实处于一个困难的境地，因为这是一枚双面硬币。”目前，市场普遍预计美联储将在未来几个月保持利率不变，并观察关税政策的实际影响，而非仅仅基于政策声明采取行动。此外，美联储还将评估2024年最后四个月累计降息1个百分点的效果。如果贸易摩擦有所缓解，或者关税对通胀的影响低于预期，美联储可能会重新关注其双重使命中的就业目标，而非专注于通胀问题。“目前，美联储的政策立场相对稳固，关税问题的反复不会直接改变这一立场，尤其是我们甚至还不知道这些政策最终会如何实施。”AllianceBernstein发达市场研究主管Eric Winograd表示。他预计，在未来几个月，关税的具体影响才会逐渐显现，美联储的政策调整也不会立即做出反应。Winograd认为，尽管关税可能导致部分商品价格短期上涨，但它们不会带来美联储通常关注的长期通胀压力。这一观点也与美联储官员的近期表态一致。美联储官员认为，只有在关税导致全面贸易战或对供需产生更深远的影响时，才会真正影响货币政策决策。波士顿联储主席苏珊·柯林斯在接受采访时表示：“政策如何演变存在很大的不确定性，在没有明确了解最终政策之前，我们无法精确预测其影响。”她强调，美联储的立场是“保持耐心、谨慎行动，目前没有紧迫性需要进一步调整政策。”市场仍然预计美联储将在6月会议上首次降息，随后可能在12月再降息25个基点。美联储上周维持联邦基金利率在4.25%-4.5%区间不变。Winograd表示，美联储今年仍有可能降息两到三次，但不会立即开始，而是要等待关税政策的影响进一步显现。他表示：“考虑到美国经济整体上对贸易摩擦的抗冲击能力，我不认为关税问题会大幅改变美联储的政策方向。市场对美联储的反应机制设想得过于机械化——认为一旦通胀上升，美联储就必须做出应对，而事实并非如此。”</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657728",
            "pub_date": "2025-02-05 07:07:44",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657729,
            "title": "港股2月5日早报：美股走强热门中概股多数上涨 非美货币普涨",
            "description": "<div> 财联社2月5日讯（编辑 童古）今日港股早间要闻有：热点要闻【美国JOLTS职位空缺降至三个月低位】美国12月JOLTS职位空缺超预期降至三个月低位。该数据缓解了周五非农就业报告的上行风险，对美联储和市场都有帮助。【美元指数跌约1% 非美货币普涨】美元指数跌约1%失守108，非美货币普涨，澳元脱离近五年最低，加元从近二十二年新低反弹，墨西哥比索冲高回落，离岸人民币一度涨超350点并升破7.28元，比特币转跌下逼9.6万美元。【特朗普准备加大对伊朗制裁力度 国际油价V形反弹】国际油价在美股盘初大幅走低，美油最深跌3.4%一度失守71美元，今年首次跌破2024年收官水平，布油最深跌2.4%下逼74美元。随后特朗普表示准备加大对伊朗的制裁力度，旨在将其石油出口降至零。油价短线拉升。WTI 3月原油期货收跌0.63%，报72.70美元/桶。布伦特4月原油期货收涨0.31%，报76.20美元/桶。环球市场美股三大指数周二集体收涨，纳指涨1.35%，标普500指数涨0.72%，道指涨0.3%。大型科技股普涨，苹果、特斯拉、谷歌涨超2%，英伟达、奈飞、亚马逊涨超1%，Meta、微软小幅上涨。Palantir涨约24%，2024年Q4营收同比大增36%，2025年业绩指引远超预期。生物技术公司Illumina跌5.3%，该公司被中国商务部列入不可靠实体清单。热门中概股多数上涨，纳斯达克中国金龙指数涨2.65%。拼多多、小鹏汽车涨超8%，唯品会、富途控股涨超6%，百度、爱奇艺、理想汽车、贝壳涨超5%，满帮、阿里巴巴涨逾3%。港股三大指数周二集体大涨。截至收盘，恒生指数涨2.83%，报20789.96点；恒生国企指数涨3.51%，报7643.63点；恒生科技指数涨5.06%，报4977.38点。从个股表现来看，加密货币、半导体及汽车股领涨市场。南向资金南向资金因内地春节假期继续暂停交易。公司要闻胜狮货柜(00716)：预计2024年净利润不少于3000万美元(约合2.34亿港元)，同比增长约54.34%。励晶太平洋(00575)：发布盈警，预期年度股东应占亏损约400万美元至约500万美元，亏损同比大幅减少。龙资源(01712)：JOKISIVU钻探进一步发现优质样段。友邦保险(01299)：斥资3.33亿港元回购619.7万股，回购价格为每股52.88-54.55港元。重要数据21:15  美国1月ADP就业人数变动21:30  美国12月贸易帐23:00  美国1月ISM非制造业PMI23:30  美国截至1月31日当周EIA原油库存变动财经大事22:00  美国里奇蒙德联储主席巴尔金参加一场炉边谈话。沙特阿美在每月5日左右公布官方原油售价。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657729",
            "pub_date": "2025-02-05 07:08:29",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 2657731,
            "title": "黄金价格续创历史新高 阿航空难初步调查报告发布｜环球市场",
            "description": "<div> 隔夜股市美东时间周二，美股三大指数集体收涨，纳指涨1.35%，标普500指数涨0.72%，道指涨0.3%。热门中概股多数上涨，纳斯达克中国金龙指数涨2.65%。拼多多、小鹏汽车涨超8%，唯品会、富途控股涨超6%，百度、爱奇艺、理想汽车、贝壳涨超5%，满帮、阿里巴巴涨逾3%。欧洲主要股指多数收涨，德国DAX30指数涨0.36%，英国富时100指数跌0.15%，法国CAC40指数涨0.66%，欧洲斯托克50指数涨0.89%。商品市场COMEX黄金期货涨0.58%，报2873.8美元/盎司；COMEX白银期货涨1.12%，报32.875美元/盎司。国际原油期货结算价涨跌不一。WTI 3月原油期货收跌0.46美元，跌幅0.63%，报72.7美元/桶。布伦特4月原油期货收涨0.24美元，涨幅0.31%，报76.2美元/桶。市场消息【美国参议院委员会投票批准提名小肯尼迪出任卫生部长】美国参议院财政委员会当地时间2月4日以14票赞成、13票反对的结果批准提名小罗伯特·肯尼迪（Robert F. Kennedy Jr.）担任美国卫生与公众服务部（HHS）部长，并将该提名提交参议院进行最终确认投票。【摩根士丹利：不再预期美联储3月份降息 预计6月将会降息】摩根士丹利经济学家表示，已不再预期美联储3月份降息，现预计今年6月将有一次降息。特朗普政府征收关税的速度比我们预期的更快，这可能会意味着通胀回落会在较高的通胀水平上停滞，从而阻断近期任何降息的可能性。【阿航空难初步调查报告：机身损伤疑为外部物体所致 排除鸟击】阿塞拜疆交通部当地时间2月4日发布初步调查报告，确认阿塞拜疆航空公司客机在哈萨克斯坦阿克套坠毁事故与鸟类撞击及氧气瓶爆炸无关，机身损伤或由外部物体导致。【城堡据悉正在考虑发行投资级债券】肯·格里芬创立的对冲基金城堡投资正考虑发行投资级债券。上个月该公司发行了10亿美元债券。根据一位知情人士透露，Citadel Finance已请高盛、摩根大通和摩根士丹利周二安排与投资人的通话。这位知情人士补充说随后可能会发行优先无担保票据。由于细节尚未公开，知情人士要求匿名。城堡发言人不予置评。【摩根士丹利将2025年英伟达GB200出货量大幅下调】摩根士丹利在最新发布的报告中称，将2025年英伟达GB200出货量从此前的3万—3.5万大幅下调至2万—2.5万件，最差的情况出货量可能低于2万，可能导致GB200供应链的市场影响达300亿至350亿美元。摩根士丹利预测，云计算市场增长周期或持续至2025年上半年，随后第四季度同比增速可能降至个位数。【冯德莱恩：欧盟将做好与美国艰难谈判的准备】欧盟委员会主席冯德莱恩4日在欧盟大使会议上表示，欧盟将做好在必要时与美国进行艰难谈判的准备，同时始终坚定维护自身利益。冯德莱恩表示，欧洲企业在美国雇佣了350万名员工，美国100万个就业岗位直接依赖于与欧洲的贸易。欧美双边年贸易总额达1.5万亿美元，彼此利益攸关。跨大西洋伙伴关系对双方都至关重要。冯德莱恩说，欧盟将做好在必要时进行艰难谈判的准备，并尽可能找到解决方案。欧盟将以开放和务实的态度实现这一目标，但无论何时何地，欧盟都将坚定维护自身利益。【特朗普签署备忘录：阻止伊朗核武器计划并限制其石油销售】美国总统特朗普于周二签署总统备忘录，重新实施针对伊朗的严格政策，旨在阻止该国获得核武器并限制其石油出口。特朗普表示，如果伊朗进行报复并试图对其进行刺杀，伊朗将会被彻底摧毁。特朗普还表示，愿意与伊朗总统进行会谈，将与伊朗方面进行接触。【美国职位空缺创去年9月以来的最低水平】美国去年12月的职位空缺减少幅度超出预期，降至3个月低点，与劳动力市场逐渐放缓的趋势一致。美国劳工统计局周二公布的调查显示，美国12月JOLTs职位空缺从11月修正后的816万个降至760万个。这一数字低于经济学家的普遍预期。职位空缺减少是由专业和商业服务推动的，部分逆转了前两个月的激增。医疗保健和社会援助，以及金融和保险也出现了大幅下降。数据显示，在前两个月大幅增加之后，职位空缺又回到了下降趋势。这应该会继续抑制工资增长，并支持美联储关于就业市场不再是通胀压力来源的说法。</div>",
            "link": "https://cn.investing.com/news/stock-market-news/article-2657731",
            "pub_date": "2025-02-05 07:08:51",
            "source": "investing_cn",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}