{
    "data": [
        {
            "id": 4039383,
            "title": "US convenes Newark airport task force, fast-tracks telecom fix",
            "description": "<div> By David Shepardson WASHINGTON (Reuters) -The Trump administration said on Monday it was convening an emergency task force and fast-tracking urgent steps to prevent additional telecom outages at the facility overseeing Newark air traffic after three incidents have shaken public confidence. Acting Federal Aviation Administration head Chris Rocheleau said the agency was naming an emergency task force to help address telecom issues at the facility overseeing Newark Liberty Airport traffic that includes L3Harris Technologies (NYSE:LHX), Verizon (NYSE:VZ) and other technical experts. He pledged to be \"transparent about the progress that we are making.\" Officials said the FAA could experience other telecom failures. \"We could see other situations like this around the country because the system is old,\" Transportation Secretary Sean Duffy said at a press conference. Duffy said he expects testing will be completed in two weeks after the FAA installed fiber lines to replace copper wire to boost resiliency at the air traffic control center in Philadelphia that handles Newark flights and a successful software patch. \"We are going to fix Newark,\" Duffy said. \"Our redundant lines are now working.\" Duffy called the current system \"a lemon\" akin to a faulty used car and blamed former President Joe Biden and the prior transportation secretary, Pete Buttigieg, for not doing more to address telecom issues and not ensuring the reliability of telecommunications before it transferred control of Newark airspace to the Philadelphia facility last year. In response, a spokesperson for Buttigieg said: \"Secretary Duffy has a tough job. But he needs to spend more time doing what the American people are paying him to do — fix problems — and less time blaming others.\" STAFFING ISSUES The FAA relocated control of the Newark airspace to Philadelphia last year to address staffing and congested New York City area traffic. The FAA is about 3,500 air traffic controllers below targeted staffing levels. The FAA earlier said it will propose flight cuts at Newark, citing air traffic controller staffing, runway construction and equipment issues as it continued to delay flights on Monday. Low air traffic control staffing for Newark resulted in average delays of more than two hours late on Monday with more than 20% of all flights delayed and 87 canceled, according to data provider FlightAware. \"The airport clearly is unable to handle the current level of scheduled operations,\" the FAA said ahead of a two-day meeting starting on Wednesday with airlines to discuss flight cuts. The FAA is proposing an hourly arrival rate of no more than 28 flights and corresponding departure rate of 28 flights during construction on a runway at Newark. That limit would be in place until June 15, and on weekends from September through the end of the year. The FAA is separately proposing capping the scheduled rate of arrivals and departures at 34 each per hour through October 25 when construction is not ongoing. On Sunday, the FAA said a new telecommunications issue at the Philadelphia facility forced the agency to issue a 45-minute ground stop and slow flights in and out of Newark airport. On Friday, the Philadelphia facility suffered a 90-second radar and telecommunications outage, the second in two weeks after a serious outage on April 28. The latest incidents highlight the air traffic control network's aging infrastructure and come after Duffy last week proposed spending billions of dollars to fix it over the next three to four years. The FAA said last week it was taking immediate steps to address ongoing problems that have disrupted hundreds of flights, especially from United Airlines, the largest carrier at the airport. United has sharply cut flights and wants the FAA to impose new limitations on Newark flights to address ongoing delays. United on Monday sent emails to 3.7 million New York-area customers and passengers with upcoming Newark flights seeking to reassure them about safety. \"The truth is that all these flights in and out of (Newark) are absolutely safe,\" United CEO Scott Kirby (NYSE:KEX) said.  </div>",
            "link": "https://www.investing.com/news/stock-market-news/faa-proposing-newark-flights-cuts-saying-unable-to-handle-current-volume-4039383",
            "pub_date": "2025-05-13 10:18:06",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 4040447,
            "title": "Samsung launches slimmest smartphone as races against rival Apple",
            "description": "<div> By Heekyong Yang SEOUL (Reuters) -Samsung Electronics made public on Tuesday its slimmest flagship model to date, complete with enhanced artificial intelligence features, as it seeks to get ahead of rival Apple (NASDAQ:AAPL) in the premium market. The S25 Edge launch is designed to tap increasing demand, especially from consumers in their 20s and 30s, for more portable smartphones. \"The feedback was clear – users wanted something slimmer and easier to carry without sacrificing performance,\" said Samsung, which made structural changes to reduce the thickness of internal components, including the printed circuit board and thermal systems. Analysts said the launch was strategically timed to pre-empt Apple, which is expected to launch a thinner iPhone in the second half of this year.  \"By releasing the product a few months ahead, Samsung could inflict some impact on Apple and attract consumers looking for thinner smartphones. It appears to be a calculated decision to capture that segment of demand,\" Ryu Young-ho, a senior analyst at NH Investment & Securities, said.  The S25 Edge will go on sale in South Korea on May 23 and in the United States on May 30, Samsung said, adding it will roll it out to about 30 countries, including China and in Europe.  Starting at $1,099, the model has a 6.7-inch (170 mm) screen and a 5.8 millimetre-thick body, making it larger than the basic S25 model but only fractionally heavier. The S25 Edge has Samsung's latest built-in AI functions, including multimodal AI that allows users to interact with the device in real time through vision and voice, using the camera to ask questions.  Samsung did not disclose the production site for the new model.  At the launch event, Samsung dismissed concerns about potential performance and heat management issues with the device.   \"Some may worry that a thinner phone compromises performance or struggles with heat management,\" said Samsung Electronics (KS:005930) Executive Vice President Moon Sung-hoon.  \"We managed to engineer a thinner vapor chamber to fit the slim design, and we put everything into making that happen. We’re confident the S25 Edge can be used without concerns about overheating,\" said Moon.  Samsung became the world’s leading smartphone vendor in the first quarter of 2025, capturing 20% of the global market and narrowly surpassing Apple, which held a 19% share, data from Counterpoint Research showed. Samsung last month, however, said second-quarter shipments could be affected if tariff risks weaken demand. </div>",
            "link": "https://www.investing.com/news/stock-market-news/samsung-launches-slimmest-smartphone-as-races-against-rival-apple-4040447",
            "pub_date": "2025-05-13 10:21:36",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 4040534,
            "title": "Asian markets cheer as pause in US-China trade war boosts risk appetite",
            "description": "<div> By Ankur Banerjee and Rocky Swift TOKYO (Reuters) - Asian stocks joined the global rally and the U.S. dollar held on to most of its gains on Tuesday as investors heaved a sigh of relief after a temporary halt in the trade war between the U.S. and China eased worries of a global recession.  Japan's Nikkei soared 2%, touching its highest level since February 25, and tech-heavy Taiwan also rose 2%, while Chinese stocks inched higher in early trading.  That left the MSCI's broadest index of Asia-Pacific shares outside Japan at a six-month peak. The S&P 500 rose over 3% while Nasdaq soared 4.3% after the U.S. and China agreed to slash tariffs for at least 90 days. [.N] \"The real win here was the shift in tone from both the U.S. and China. Words like 'mutual respect' and 'dignity' mark a sharp departure from the recent confrontational rhetoric, and that’s what markets are cheering,\" said Charu Chanana, chief investment strategist at Saxo in Singapore.  The U.S. said it will cut tariffs imposed on Chinese imports to 30% from 145% while China said it would cut duties on U.S. imports to 10% from 125%, providing relief to the markets, although concerns linger that tariffs could hurt the global economy.  The U.S. dollar surged against the yen, euro and Swiss franc immediately after the agreement was announced but on Tuesday morning was slightly weaker, holding on to most of its gains. Some analysts highlighted the uncertainty caused by the tariffs that remain in place. \"A de-escalation was inevitable and I think it’s clear there won’t be much durable that comes out of these talks,\" said Christopher Hodge, chief U.S. economist at Natixis.  \"When all is said and done, tariffs will still be dramatically higher and will weigh on U.S. growth.\" Ratings agency Fitch estimated that the U.S. effective tariff rate is now 13.1%, a notable decline from 22.8% prior to the agreement but still at levels last seen in 1941 and much higher than the 2.3% it was at the end of 2024. U.S. INFLATION TEST  Investor focus will now switch to details of the agreement and what happens after 90 days but before that the spotlight will be on U.S. inflation data later on Tuesday. \"Should we be treated to another set of soft CPI figures, it could allow traders to refocus on Fed policy and the potential for cuts, and take some steam out of the dollar's rebound,\" said Matt Simpson, senior market analyst at City Index. The shift in U.S.-China trade relations has led traders to pare back bets of Federal Reserve rate cuts, inferring that policymakers are likely to be under less pressure to ease interest rates to boost growth. Traders are now pricing in 57 basis points of cuts this year, down from over 100 basis points during the height of tariff-induced anxiety in mid-April.  U.S. Treasury yields rose to a one-month high on Monday and were hovering near that level in early trading on Tuesday. The two-year yield was at 3.9873%, while the benchmark 10-year yield was last at 4.4512%. [US/] In cryptocurrencies, bitcoin eased 0.5% to $102,146 on Tuesday but remained above the key $100,000 level it breached last week.  Oil prices eased a bit on Tuesday after hitting a two-week high in the previous session on trade deal optimism, while gold prices were steady after dropping 2% on Monday as investors exited some of the safe havens. [O/R] [GOL/]  (Reporing by Ankur Banerjee and Rocky Swift in Tokyo; Editing by Muralikumar Anantharaman) </div>",
            "link": "https://www.investing.com/news/stock-market-news/asian-markets-cheer-as-pause-in-uschina-trade-war-boosts-risk-appetite-4040534",
            "pub_date": "2025-05-13 10:35:40",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 4039667,
            "title": "Hong Kong's CK Hutchison assures legal compliance in ports deal",
            "description": "<div> (Reuters) -Hong Kong's CK Hutchison said late on Monday that its closely monitored ports deal would strictly adhere to all required compliance standards and would never be executed illegally. \"This transaction would never be carried out under any illegal or non-compliant circumstances,\" the company said in a statement.  The Hong Kong-based conglomerate, controlled by tycoon Li Ka-shing, agreed in March to sell the majority of its $22.8 billion global ports business, including assets along the strategically significant Panama Canal, to a consortium led by BlackRock (NYSE:BLK). The deal has since drawn global criticism, including from U.S. President Donald Trump, who repeatedly expressed his desire to reclaim the Panama Canal and termed the deal a \"reclaiming\" of the waterway. Chinese state media have also condemned the proposed sale, saying it betrays China's interests.  Earlier in March, a pro-Beijing Hong Kong newspaper intensified the criticism by publishing comments from local politicians and Chinese lawyers who urged CK Hutchison to reconsider the deal and support the decision by Chinese regulators to review the transaction. CK Hutchison said it made the Monday statement due to continuous enquiries from shareholders and the media and it had originally planned to talk about the transaction at its annual shareholder meeting scheduled for May 22. \"Completion of the transaction will be conditional upon the satisfaction of conditions including legal and regulatory consents and approvals,\" the company has said in the March filing when it announced the deal. Shares of CK Hutchison fell 0.6% on Tuesday morning.  </div>",
            "link": "https://www.investing.com/news/stock-market-news/hong-kongs-ck-hutchison-assures-legal-compliance-in-ports-deal-4039667",
            "pub_date": "2025-05-13 10:36:00",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 4040520,
            "title": "Sixt earnings preview: 'Several moving parts' should be considered, says Deutsche Bank",
            "description": "<div>Deutsche Bank expects a mixed first-quarter report from Sixt SE, with analysts pointing to \"several moving parts\" ahead of the company’s May 13 earnings release.Analysts cited two key factors that will distort year-over-year comparisons. First, vehicle impairments were said to be significantly higher in the prior-year quarter, with roughly €20 million in charges, compared to \"single-digit €m impairments\" expected in Q1 2025. \"We think the net effect should be some €15m,\" analysts said.Second, the bank believes the timing of the Easter holiday will likely weigh on results. In 2024, Easter fell in late March and early April, placing part of the travel surge in Q1. However, this year’s holiday falls entirely in Q2, meaning Q1 will miss that seasonal boost. The impact, combined with the loss of a trading day due to the leap year, \"should result in some modest negative Easter effect.\"Deutsche Bank forecasts Sixt to report an earnings-before-tax (EBT) loss of €13 million, compared to a profit of €27.5 million in the year-ago period. While this represents a decline, analysts emphasized some underlying positives: \"lower depreciation and some positive volume effects,\" including an estimated 8% year-over-year fleet growth.Despite the near-term headwinds, Sixt ended 2024 on a strong note, with record revenue of €4 billion and EBITDA reaching €1.46 billion. In its 2024 report, Sixt projected revenue growth of 5% to 10% in 2025 and aims to maintain tight fleet planning to support an EBT margin near 10%.</div>",
            "link": "https://www.investing.com/news/pro/sixt-earnings-preview-several-moving-parts-should-be-considered-says-deutsche-bank-432SI-4040520",
            "pub_date": "2025-05-13 09:31:02",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 4040503,
            "title": "Japan's finance minister wants to discuss forex with Bessent at G7",
            "description": "<div> By Makiko Yamazaki TOKYO (Reuters) -Japanese Finance Minister Katsunobu Kato said on Tuesday that he would seek to meet U.S. Treasury Secretary Scott Bessent on the sidelines of the G7 meetings in Canada next week to discuss foreign exchange. \"I'm making preparations to attend the meetings of G7 finance leaders in Canada next week,\" Kato told a regular press conference, referring to the May 20-22 meetings of finance ministers and central bank governors from the Group of Seven economic powers. \"If circumstances allow, I'd like to use this opportunity to have a meeting with Treasury Secretary Scott Bessent and continue to discuss foreign exchange,\" he said. Japan and the United States have agreed to keep the thorny issue of currency rates separate from direct trade negotiations, setting aside the issues for talks between their finance ministers. At Tuesday's press conference, Kato said if the meeting with Bessent goes ahead, they could naturally discuss foreign exchange as part of Japan's tariff negotiations with the United States. Kato and Bessent last met on April 24 in Washington, where they agreed to continue \"constructive\" dialogue on currency policy, but did not discuss setting currency targets or a framework to control yen moves. U.S. President Donald Trump's focus on addressing the trade deficit and his past criticisms of Japan's weak yen have heightened market concerns that Tokyo will face pressure to strengthen the yen against the dollar. The dollar surged on Monday as the United States and China reached a deal to temporarily cut reciprocal tariffs, easing immediate concerns that a trade war between the world's two biggest economies could lead to a global recession. The risk-on mood weighed on safe-haven currencies such as the yen, with the dollar briefly hitting 148.64 yen, its highest since April 3. Asked about the U.S.-China deal, Kato said the government will closely monitor related developments, examine the impact thoroughly and act appropriately, while declining to comment on currency developments. </div>",
            "link": "https://www.investing.com/news/economy-news/japan-finance-minister-preparing-to-attend-g7-bessent-meeting-possible-4040503",
            "pub_date": "2025-05-13 10:36:18",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 4040529,
            "title": "Oil prices tick down from 2-week high after US-China tariff deal; US CPI on tap",
            "description": "<div>Investing.com- Oil prices edged lower in Asian trading on Tuesday after hitting a two-week high in the prior session on news of U.S.-China tariff reductions, as investors were cautious ahead of key U.S. inflation data due later in the day.<br>As of 22:05 ET (02:05 GMT), Brent Oil Futures expiring in June edged 0.3% lower to $64.76 per barrel, while West Texas Intermediate (WTI) crude futures also fell 0.3% to $61.36 per barrel.<br>Both contracts remained near their two-week high, reached on Monday, as the U.S. and China agreed to temporarily lower soaring tariffs placed on each other.<br>US-China trade deal supports oil prices<br>The U.S. will reduce its tariff on Beijing from 145% to 30%, while China will lower its retaliatory tariff from 125% to 10%, both for 90 days.<br>The announcement came via a joint statement following trade talks in Switzerland over the weekend.<br>As the world’s two largest economies move toward a more stable trade relationship, expectations of stronger industrial activity and consumer demand, especially in China, lifted sentiment around the demand outlook.<br>“However, while a thawing in trade tensions between China and the US is helpful, there’s still plenty of uncertainty over what happens in 90 days. This uncertainty could continue to generate headwinds for oil demand,” ING analysts said in a note.<br>For the day, investors awaited the U.S. consumer price index inflation data for April, due on Tuesday, to assess the impact of President Donald Trump's trade policies.<br>Markets assess demand outlook amid OPEC+ hike; Ind-Pak tensions<br>Despite easing trade tensions, oil prices dipped on Tuesday as investors remained worried about the demand outlook after plans from OPEC+ to increase oil output in May and June. <br>Trump is scheduled to visit Saudi Arabia, Qatar, and the UAE this week to address diplomatic concerns related to Gaza and Iran, while also seeking to advance business and trade agreements with the oil-rich nations.<br>“Though demand has been a key concern for the oil market, supply increases from OPEC+ mean that the oil market will be well supplied through the remainder of the year. How well supplied depends on whether OPEC+ sticks with the aggressive supply hikes we saw for May and June,” ING analysts said.<br>“Also, the forward curve suggests the market may become increasingly more comfortable with supply towards year-end,” they added.<br>Investors also closely monitored increased geopolitical tensions between India and Pakistan, after both sides agreed to a ceasefire over the weekend following the worst fighting in decades.</div>",
            "link": "https://www.investing.com/news/commodities-news/oil-prices-tick-down-from-2week-high-after-uschina-tariff-deal-us-cpi-on-tap-4040529",
            "pub_date": "2025-05-13 10:18:14",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 4040519,
            "title": "US-China tariff deescalation more bullish than expected, to boost stocks- Citi",
            "description": "<div>Investing.com- Citi analysts said on Monday that the recent trade tariff reductions between the U.S. and China were even more positive than expected, with Chinese stocks likely to clock strong gains on the move.<br>The deescalation now heralds a much smaller impact on China’s exports and gross domestic product, Citi said, and that further negotiations could bring even more reductions- especially a 20% levy linked to China’s alleged role in the fentanyl trade. <br>Citi reiterated its positive view on Hong Kong and Chinese equities following the deescalation, citing improving relations with the U.S. and inexpensive local valuations. <br>“The tariff reduction magnitudes were sharp and encouraging; we think the reductions were likely more than the market expected. This should inject positive sentiment into the HK/PRC equities,” Citi analysts wrote in a Monday note. <br>Washington and Beijing on Monday announced a deal under which they will sharply scale back trade tariffs against each other for the next 90 days. U.S. tariffs on China will fall to 30% from 145%, while Chinese tariffs on the U.S. will fall to 10% from 125%. <br>“Given the magnitude of China’s trade surplus with the US and rest-of-world, a dramatic reduction in US trade barriers should be favorable for the Chinese economy,” Citi analysts said. <br>Citi says the 20% tariffs linked to fentanyl were a “low-hanging fruit” for both sides, and that more cooperation from China was likely to remove the duty. <br>Still, Citi noted while the deescalation was positive for Chinese trade, it reduced the impetus for more urgent stimulus measures from Beijing. <br>Citi said the possibility of 1.5 trillion yuan ($210 billion) in additional fiscal stimulus had “significantly reduced,” while Chinese policymakers could further switch to a wait-and-see mode.<br>A swathe of weak Chinese economic readings in recent weeks furthered the need for urgent stimulus measures from Beijing, as the world’s second-largest economy grapples with prolonged disinflation.</div>",
            "link": "https://www.investing.com/news/stock-market-news/uschina-tariff-deescalation-more-bullish-than-expected-to-boost-stocks-citi-4040519",
            "pub_date": "2025-05-13 09:24:28",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 4040535,
            "title": "Asia stocks rise on US-China trade cheer; Chinese shares lag",
            "description": "<div>Investing.com- Most Asian stocks rose on Tuesday as investors cheered a sharp deescalation in the U.S.-China trade war, although Chinese markets lagged amid some profit-taking and speculation over a delay in more local stimulus. <br>Regional markets took a positive lead-in from Wall Street, which clocked stellar gains in overnight trade after Washington and Beijing slashed their respective trade tariffs against each other.<br>But investors were now holding out for an even bigger deescalation in the tariff exchange, given that both countries still maintained some trade tariffs against each other. U.S. stock index futures fell slightly in Asian trade, with S&P 500 Futures futures falling 0.3% after the S&P 500 rallied 3.3% on Monday. <br>Markets were also on edge ahead of key U.S. inflation data due later on Tuesday. <br>Asia stocks cheer US-China tariff deescalation <br>Japan’s Nikkei 225 and TOPIX indexes were the best performers in Asia, rallying 1.7% and 1.2%, respectively. <br>Singapore’s Straits Times index added 0.7%, while Australia’s ASX 200 rose 0.7% to its highest level since late-February, following data showing a mild improvement in consumer sentiment. <br>South Korea’s KOSPI added 0.4%, while markets across Southeast Asia also advanced. <br>U.S. and Chinese officials said on Monday that Washington will cut its trade tariffs on China to 30% from 145%, while Beijing will cut its tariffs on the U.S. to 10% from 125%. <br>The move marked a major deescalation in a bitter trade war between the world’s largest economies, and spurred hopes that the U.S. will reach trade deals with several other major economies. <br>Chinese shares lag amid profit-taking, stimulus doubts <br>But despite the trade deescalation, Chinese markets vastly lagged their regional peers, in part due to some profit-taking after a strong run-up in the past week. The mainland Shanghai Shenzhen CSI 300 and Shanghai Composite indexes rose about 0.2% each, while Hong Kong’sHang Seng index slid 1.3% from a one-month high. <br>Improving sentiment over a U.S.-China trade deescalation had driven strong gains in Chinese markets over the past week, limiting their upside after Monday’s move. <br>But analysts also flagged the potential for some delays in Beijing’s plans for more stimulus, especially in the face of fewer trade headwinds. Citi analysts said that lower trade tensions gave Beijing less impetus to unlock more stimulus, especially on the fiscal front.<br>The need for more Chinese stimulus was underscored by a swathe of weak purchasing managers index and inflation readings for April. Weak inflation data released over the weekend also dampened enthusiasm towards Chinese markets. <br>Indian stocks to cool after rallying on Pakistan ceasefire <br>Gift Nifty 50 Futures for India’s Nifty 50 index pointed to a slightly weak open on Tuesday, with local stocks set for some profit-taking after rallying nearly 4% in the prior session.<br>Gains in Indian markets were driven by optimism over a U.S.-brokered ceasefire with Pakistan, which appeared to be holding after a shaky start during the weekend. <br>The ceasefire marked a deescalation in some of the worst fighting between India and Pakistan in nearly three decades. <br>Indian consumer inflation data is due later in the day, and is expected to show further cooling in April. </div>",
            "link": "https://www.investing.com/news/stock-market-news/asia-stocks-rise-on-uschina-trade-cheer-chinese-shares-lag-4040535",
            "pub_date": "2025-05-13 10:42:12",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 4040444,
            "title": "US stock futures steady after Wall St surges on China trade deal; CPI in focus",
            "description": "<div>Investing.com- U.S. stock index futures steadied on Monday evening after the announcement of a U.S.-China trade deal sent Wall Street up sharply, with focus now on key upcoming inflation data for more economic cues. <br>S&P 500 Futures steadied at 5,865.25 points, while Nasdaq 100 Futures were flat at 20,942.0 points by 19:15 ET (23:15 GMT). Dow Jones Futures were flat at 42,508.0 points. <br>Wall Street gains cooled amid caution before key U.S. inflation data due later on Tuesday, given that the reading comes amid heightened fears over inflation remaining sticky for the coming months. <br>Wall St soars on US-China tariff relief <br>Futures steadied after Wall Street clocked stellar gains on Monday, as investors cheered a sharp deescalation in trade tensions between Washington and Beijing. <br>The U.S. will slash its 145% tariff rate on Beijing to 30%, while China will cut its retaliatory tariffs to 10% from 125%, both for a period of 90 days.<br>China also agreed to roll back non-tariff measures such as rare earth export controls. <br>The deal was announced in a rare joint statement by U.S. and Chinese officials, and came after high-level talks in Geneva, Switzerland, over the weekend. <br>The S&P 500 surged 3.3% to 5,844.17 points, while the NASDAQ Composite rose 4.4% to 18,708.34 points. The Dow Jones Industrial Average jumped 2.8% to 18,708.34 points.<br>Gains were broad-based, although major technology stocks rose sharply on hopes that major device makers such as Apple (NASDAQ:AAPL) will now face fewer trade-related disruptions. Artificial intelligence-linked stocks- such as hyperscalers Microsoft (NASDAQ:MSFT) and Google (NASDAQ:GOOGL), and chipmakers Nvidia (NASDAQ:NVDA) and Broadcom- were encouraged by a BofA note that said capital spending on AI infrastructure was likely to remain strong this year and the next. <br>CPI inflation awaited for insight on interest rates, economic growth <br>But despite optimism over the trade deal, markets were now seen turning cautious ahead of key consumer price index inflation data, which is due on Tuesday morning. <br>The print is expected to show headline and core CPI remained sticky in April and unchanged from the prior month, especially as Trump’s tariffs pushed up input costs for businesses. <br>While Monday’s trade deal does mark a deescalation, tariffs on China are still well above levels seen prior to April 2- a trend that could underpin U.S. inflation. <br>The inflation data is widely expected to factor into the Federal Reserve’s plans for interest rates, after the central bank recently signaled that it saw no near-term changes in rates. <br>Still, the Fed is widely expected to cut interest rates eventually this year. The CME Fedwatch tool shows investors pricing in a 36.3% chance for an end-July rate cut, and a 52.1% chance for a September cut. <br></div>",
            "link": "https://www.investing.com/news/stock-market-news/us-stock-futures-steady-after-wall-st-surges-on-china-trade-deal-cpi-in-focus-4040444",
            "pub_date": "2025-05-13 08:00:19",
            "source": "investing_us",
            "kind": 1,
            "language": "en"
        }
    ]
}