{
    "data": [
        {
            "title": "TotalEnergies posts drop in Q4 profit on weak oil demand French oil major TotalEnergies reported a 15% drop in fourth quarter earnings on Wednesday, closing out a year marked by low oil prices and weak fuel demand which were partially offset by higher electricity sales and liquefied natural gas (LNG) trading. Adjusted net income for the final three months of 2024 was $4.4 billion, versus $5.2 billion a year previously and slightly higher than the third quarter's $4.1 billion. The results beat an expected $4.2 billion, according to a Visible Alpha consensus of six analysts. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->PARIS (Reuters) - French oil major TotalEnergies reported a 15% drop in fourth quarter earnings on Wednesday, closing out a year marked by low oil prices and weak fuel demand which were partially offset by higher electricity sales and liquefied natural gas (LNG) trading.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Adjusted net income for the final three months of 2024 was $4.4 billion, versus $5.2 billion a year previously and slightly higher than the third quarter's $4.1 billion. The results beat an expected $4.2 billion, according to a Visible Alpha consensus of six analysts.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by America Hernandez in Paris; Editing by Jacqueline Wong)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/totalenergies-posts-drop-q4-profit-070721741.html",
            "pub_date": "2025-02-05 15:07:21",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese chip makers, cloud providers rush to embrace homegrown DeepSeek Chinese companies, from chip makers to cloud service providers, are rushing to support DeepSeek's artificial intelligence models, spurring analysts to hail a \"watershed moment\" for the industry.  Moore Threads and Hygon Information Technology, which makes AI chips and looks to compete with Nvidia, said on Monday their computing clusters and accelerators would be able to support DeepSeek's R1 and V3 models.  \"We pay tribute to DeepSeek,\" Moore Threads headlined its post on WeChat, adding that progress by the firm's models using domestically made graphic processing units (GPU) could \"set on fire\" China's AI industry. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Brenda Goh and Yuhan Lin<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->SHANGHAI (Reuters) - Chinese companies, from chip makers to cloud service providers, are rushing to support DeepSeek's artificial intelligence models, spurring analysts to hail a \"watershed moment\" for the industry.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Moore Threads and Hygon Information Technology, which makes AI chips and looks to compete with Nvidia, said on Monday their computing clusters and accelerators would be able to support DeepSeek's R1 and V3 models.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We pay tribute to DeepSeek,\" Moore Threads headlined its post on WeChat, adding that progress by the firm's models using domestically made graphic processing units (GPU) could \"set on fire\" China's AI industry.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->On Saturday, Huawei Technologies, which also has its own line of AI chips, said it was working with AI infrastructure start-up SiliconFlow to make DeepSeek's models available to customers on its Ascend cloud service.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Their performance was comparable to models run on global, high-end chips, it added.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The news that Huawei had integrated DeepSeek's models with its Ascend chips marked a \"watershed moment,\" Bernstein analysts said in a note on Sunday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"DeepSeek demonstrates that competitive large language models (LLM) can be deployed on China's 'good enough' chips, easing reliance on cutting-edge U.S. hardware\",\" they added, citing Ascend and planned chips from Cambricon and Hygon.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Alibaba, Baidu and Tencent's cloud arms have also said they have made DeepSeek's models accessible via their services.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Last month, DeepSeek launched a free AI assistant that it says uses less data at a fraction of the cost of existing services.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Within a few days, its app overtook U.S. rival ChatGPT in downloads from Apple's App Store, triggering a global selloff in tech shares.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Earlier the company earlier drew attention in global AI circles with a research paper in December that said the training of DeepSeek-V3 required less than $6 million worth of computing power from Nvidia's H800 chips, versus the billions of dollars spent by the likes of tech giants Meta and Microsoft.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China has welcomed its success, turning the startup based in the eastern city of Hangzhou, and the firm's founder, Liang Wenfeng, into pop culture celebrities.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Microsoft and Amazon's cloud services have also started offering DeepSeek's models but several countries such as Italy and the Netherlands have blocked, or are investigating, DeepSeek's AI app on concerns of privacy.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Brenda Goh and Lin Yuhan; Editing by Clarence Fernandez)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/chinese-chip-makers-cloud-providers-064334840.html",
            "pub_date": "2025-02-05 14:43:34",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China has delayed or redirected 600,000 tons of wheat imports, sources say China has delayed imports of up to 600,000 metric tons of mostly Australian wheat and offered some of these cargoes to other buyers as ample domestic supplies reduce demand in the world's top buyer of the grain, two trade sources with direct knowledge of the matter said.  China accounted for 6% of global wheat imports in the year to June 2024, according to U.S. Department of Agriculture data.  One of the sources, a Singapore-based trader at an international company that sells U.S. and Australian wheat into Asia, said he had direct knowledge of four shipments carrying around 240,000 metric tons, three from Australia and one from Canada, that Chinese buyers were trying to resell in Southeast Asia. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Naveen Thukral and Peter Hobson<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->SINGAPORE/CANBERRA (Reuters) - China has delayed imports of up to 600,000 metric tons of mostly Australian wheat and offered some of these cargoes to other buyers as ample domestic supplies reduce demand in the world's top buyer of the grain, two trade sources with direct knowledge of the matter said.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China accounted for 6% of global wheat imports in the year to June 2024, according to U.S. Department of Agriculture data. With its outsized role in the market, the country's lower intake may pressure benchmark Chicago wheat prices, which remain below $6 a bushel after falling to a four-year low of $5.14 in July. [GRA/]<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The country is well-stocked after plentiful corn and wheat harvests and to support local prices that have fallen as a result it does not want new wheat to arrive until as late as April, the sources said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->One of the sources, a Singapore-based trader at an international company that sells U.S. and Australian wheat into Asia, said he had direct knowledge of four shipments carrying around 240,000 metric tons, three from Australia and one from Canada, that Chinese buyers were trying to resell in Southeast Asia.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The trader said he had heard from other traders that around 10 ships in total from Australia and Canada were being delayed resold, each carrying around 60,000 tons of wheat.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"China has postponed the delivery time of several wheat cargoes that were to be shipped from Australia and Canada,\" he said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"There are ample supplies in the Chinese market and their local prices have fallen.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A source at a major grain trader in Australia said he had direct knowledge of two wheat shipments booked for delivery to China in February, one of which has been delayed to April.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"The other is sailing, but the buyer plans to divert a chunk (of the grain onboard) to Thailand.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China has delayed or redirected a total of eight to 10 Australian shipments that were booked for delivery in January or February and has booked no shipments for March, he said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"China just doesn't want anything showing up until April,\" he said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Early last year, Chinese wheat importers cancelled or postponed about 1 million metric tons of Australian wheat cargoes as growing world stockpiles dragged down prices.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Still, in the first three months of 2024, China imported 1.7 million tons of wheat from Australia, down from 2.5 million tons in the same period a year earlier, and 923,000 tons from Canada, up from 783,000 tons a year earlier, according to Chinese trade data accessed using Trade Data Monitor.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Australia begins each year with freshly harvested wheat and has been China's main first-quarter supplier in recent years.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China's state-run COFCO, which is the importer of most of these delayed or redirected cargoes, is paying the costs of delaying shipments, including charges to hold back grain, and will take any gain or loss from reselling grain, the source in Australia said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->COFCO did not immediately reply to an email from Reuters requesting comment.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"China wants to protect its farmers. After a good corn crop, they have more than enough corn for feed. So now all of a sudden the wheat they were importing for feed and flour has been wound back to just flour,\" the trader in Australia said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China's state stockpiler Sinograin said on Monday it plans to add new stockpiling sites in northeast China to expand purchases of domestic corn harvested in 2024.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Peter Hobson and Naveen Thukral; additional reporting by Mei Mei Cho in Beijing; Editing by Christian Schmollinger)<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/china-delayed-redirected-600-000-062758804.html",
            "pub_date": "2025-02-05 14:27:58",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold demand up 1% in 2024, to remain supported by economic uncertainty, World Gold Council says Global gold demand including over-the-counter (OTC) trading rose by 1% to a record high of 4,974.5 metric tons in 2024 as investment increased, the World Gold Council (WGC) said on Wednesday, adding that central banks sped up buying in the fourth quarter. Spot gold prices rose by 27% last year, the most since 2010, as investors chose the metal to hedge against global risks and as the U.S. Federal Reserve slashed interest rates. Prices hit another all-time high on Tuesday, driven by safe-haven demand after China retaliated with tariffs on the United States in response to President Donald Trump's trade levies. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Polina Devitt<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->LONDON (Reuters) - Global gold demand including over-the-counter (OTC) trading rose by 1% to a record high of 4,974.5 metric tons in 2024 as investment increased, the World Gold Council (WGC) said on Wednesday, adding that central banks sped up buying in the fourth quarter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Spot gold prices rose by 27% last year, the most since 2010, as investors chose the metal to hedge against global risks and as the U.S. Federal Reserve slashed interest rates. Prices hit another all-time high on Tuesday, driven by safe-haven demand after China retaliated with tariffs on the United States in response to President Donald Trump's trade levies. [GOL/]<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Central banks, a major source of gold demand, bought more than 1,000 tons of the metal for the third year in a row in 2024. The National Bank of Poland was the largest such buyer, adding 90 tons to its reserves, the WGC, an industry body whose members are global gold miners, said in a quarterly report.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In the final quarter of 2024, when Trump won the U.S. election, buying by central banks accelerated by 54% year on year to 333 tons, the WGC calculated, based on reported purchases and an estimate of unreported buying.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Last year's investment demand for gold rose 25% to a four-year high of 1,180 tons, mainly because outflows from physically-backed gold exchange-traded funds (ETFs) dried up for the first time in four years.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Indicating a major shift in appetite for different products, investment demand for bars rose 10%, while coin buying fell 31%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"In 2025, we expect central banks to remain in the driving seat and gold ETF investors to join the fray, especially if we see lower, albeit volatile interest rates,\" WGC senior markets analyst Louise Street, said.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Geopolitical and macroeconomic uncertainty should be prevalent themes this year, supporting demand for gold as a store of wealth and hedge against risk.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Total gold demand, excluding opaque OTC trading, rose 1% to 4,553.7 tons last year, the highest since 2022, the WGC said. It estimates that OTC demand fell 7% due to a slump in the final quarter of the year as profit-taking offset persistent demand from high-net-worth investors.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Gold jewellery consumption, the biggest category of physical demand, fell 11% in 2024, while mine production was steady and recycling rose 15%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The WGC expects jewellery demand to remain under pressure and recycling to rise further this year due to high prices.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Gold supply and demand by WGC*:<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->2023 2024 Q4'23 Q3'24 Q4'24 Q4'24<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->change<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->y/y<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(%)<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->SUPPLY<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Mine production 3,644.1 3,661.2 955.4 943.3 953.6 0<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Net producer hedging 67.4 -56.8 19.9 -13.9 -15.0 -<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Total mine supply 3,711.4 3,604.5 975.2 929.4 938.6 -4<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Recycled gold 1,234.4 1,370.0 311.2 325.4 358.8 15<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Total supply 4,945.9 4,974.5 1,286.5 1,254.7 1,297.4 1<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->DEMAND<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Jewellery fabrication: 2,191.0 2,003.5 583.6 541.4 516.5 -12<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->- Jewellery consumption 2,110.6 1,877.1 620.9 459.4 547.1 -12<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->- Jewellery inventory 80.4 126.4 -37.3 82.0 -30.6<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Technology: 305.2 326.1 82.2 82.3 83.7 2<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->- Electronics 248.7 270.6 67.6 68.5 69.6 3<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->- Other Industrial 47.1 46.5 12.3 11.6 11.9 -4<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->- Dentistry 9.4 8.9 2.3 2.2 2.2 -6<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Investment: 945.5 1,179.5 259.8 364.8 344.0 32<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->- Total bar &amp; coin demand: 1,189.8 1,186.3 315.2 270.1 325.4 3<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->of which bars 781.7 860.0 223.1 198.3 236.2 6<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->of which official coins 293.5 201.0 60.3 32.1 53.4 -11<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->of which medals 114.6 125.2 31.9 39.7 35.8 12<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->- ETFs/similar products -244.2 -6.8 -55.4 94.7 18.6 -<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Central banks, other inst. 1,050.8 1,044.6 216.8 194.2 332.9 54<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->GOLD DEMAND 4,492.5 4,553.7 1,142.4 1,182.7 1,277.1 12<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->OTC and other 453.4 420.7 144.1 72.0 20.3 -86<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->TOTAL DEMAND 4,945.9 4,974.5 1,286.5 1,254.7 1,297.4 1<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->LBMA gold price ($/oz) 1,940.5 2,386.2 1,971.5 2,663.4 35<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->*Source: Metals Focus, Refinitiv GFMS, ICE Benchmark Administration, World Gold Council.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Polina Devitt; Editing by Kirsten Donovan)<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/gold-demand-1-2024-remain-061818326.html",
            "pub_date": "2025-02-05 14:18:18",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "250,000 pensioners hit with four-figure ‘retirement tax’ bills A quarter of a million retirees are paying over £1,000 of income tax on their state pension, figures show. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 602px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 602; --img-max-width: 960px;\"><img alt=\"Rachel Reeves\" class=\"yf-g633g8 loader\" height=\"602\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Rachel Reeves has committed to keeping the threshold at which people start paying income tax frozen until 2027-28 - Oli Scarff/AFP<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A quarter of a million retirees are paying over £1,000 of income tax on their state pension, figures show.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Current government policy means rising state pensions are on track to collide with frozen income tax thresholds – leaving <a class=\"link\" data-ylk=\"slk:millions more retirees liable for tax bills;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/tax/income/ten-million-pensioners-hit-income-tax/\" rel=\"nofollow noopener\" target=\"_blank\">millions more retirees liable for tax bills</a> in the next decade.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Former prime minister, Rishi Sunak, dubbed the phenomenon “Labour’s retirement tax”.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But Telegraph analysis shows around 249,000 retirees are already paying at least £1,000 of tax on their state pension income alone, while 10,700 pay over £2,000.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The six individuals with the highest state pension payments of between £43,680 and £44,200 a year pay over £6,200 in income tax.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Telegraph analysed figures from the Department for Work and Pensions (DWP) up to May 2024, which is the most recently available data.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Rachel Reeves has committed to keeping the threshold at which people start paying income tax frozen at £12,570 until 2027-28.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:A “full” new state pension;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/pensions/state-pensions/triple-lock-state-pension-increase/\" rel=\"nofollow noopener\" target=\"_blank\">A “full” new state pension</a> pays £11,502 a year. However, Britain’s complex pension system means some over 2.6 million people already receive a state pension above the “personal allowance” limit.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most pensioners draw some retirement income from private pensions on top of the state pension, meaning their total income tax bill is likely to be even higher.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Income tax thresholds;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/tax/income/uk-income-tax-bands-rates-explained-202425/\" rel=\"nofollow noopener\" target=\"_blank\">Income tax thresholds</a> were frozen until at least 2027-28 under the Tories. This deep-freeze helped to push an extra 2.5 million pensioners into the tax net during the party’s 14 years in power. The Chancellor said she would maintain the freeze in her October Budget.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Meanwhile, <a class=\"link\" data-ylk=\"slk:the state pension “triple lock”;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/pensions/how-avoid-state-pension-tax-trap/\" rel=\"nofollow noopener\" target=\"_blank\">the state pension “triple lock”</a> ensures that payments rise each year by the highest of inflation, average earnings or 2.5pc.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Rising payments and frozen thresholds mean the “full” new state pension is on course to exceed the personal allowance within the next three years.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Tories had promised in their election manifesto to avoid the issue via its <a class=\"link\" data-ylk=\"slk:“triple lock plus”;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/tax/income/how-the-triple-lock-plus-would-affect-your-pension/\" rel=\"nofollow noopener\" target=\"_blank\">“triple lock plus”</a> policy whereby pensioners’ tax-free allowance would rise in-line with growing state pensions.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->At the time, Labour said the plans were not “credible”.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sir Steve Webb, a former pensions minister, now a partner at pension consultants LCP, said: “With tax thresholds frozen year after year alongside state pension rises totalling over 20pc in the last three years, a rapidly increasing number of pensioners are being dragged into the tax net and those who pay tax are having to pay more and more tax each year”.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The state pension is paid to nearly 13 million retirees, around 4.2 million of whom are on the new state pension, introduced in 2016.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The rest receive the old state pension,;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/pensions/hidden-state-pension-shortfall-punishing-retirees/\" rel=\"nofollow noopener\" target=\"_blank\">The rest receive the old state pension,</a> the “basic” element of which is currently £8,798 a year – nearly £3,000 less than the new state pension.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But once additional entitlements are taken into account, the old system can be far more lucrative than the new.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Those earning higher state pension payments will be drawing money from an additional earnings-related pension, <a class=\"link\" data-ylk=\"slk:commonly known as Serps,;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/pensions/state-pensions/serps-pension/\" rel=\"nofollow noopener\" target=\"_blank\">commonly known as Serps,</a> for a maximum of £11,356 a year.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Delaying the start date for drawing the old state pension raises the starting amount by a further 10.4pc for each year deferred. By deferring for 13 years, a pensioner could push their annual income to over £45,000.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Treasury was approached for comment.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/customer/subscribe/01doysa/\" rel=\"nofollow noopener\" target=\"_blank\"><b>Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.</b></a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/250-000-pensioners-hit-four-060000402.html",
            "pub_date": "2025-02-05 14:00:00",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Equinor Q4 profit slightly beats expections Equinor on Wednesday posted slightly higher-than-expected profits for the final quarter of 2024. The Norwegian oil and gas producer's adjusted earnings before tax for October-December fell to $7.90 billion from $8.56 billion a year earlier, beating the $7.71 billion predicted in a poll of 24 analysts compiled by Equinor. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->OSLO (Reuters) - Equinor on Wednesday posted slightly higher-than-expected profits for the final quarter of 2024.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Norwegian oil and gas producer's adjusted earnings before tax for October-December fell to $7.90 billion from $8.56 billion a year earlier, beating the $7.71 billion predicted in a poll of 24 analysts compiled by Equinor.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Nerijus Adomaitis and Nora Buli, editing by Terje Solsvik)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/equinor-q4-profit-slightly-beats-055308045.html",
            "pub_date": "2025-02-05 13:53:08",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xiaomi founder sets 10,000 sales target for luxury version of flagship EV The luxury version of Xiaomi's flagship electric vehicle, the SU7 Ultra, will be launched at the end of February, with a sales target of 10,000 units for this year, founder Lei Jun said on his Red Note account on Wednesday. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->BEIJING (Reuters) - The luxury version of Xiaomi's flagship electric vehicle, the SU7 Ultra, will be launched at the end of February, with a sales target of 10,000 units for this year, founder Lei Jun said on his Red Note account on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Qiaoyi Li and Brenda Goh; Editing by Jacqueline Wong)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/xiaomi-founder-sets-10-000-054547859.html",
            "pub_date": "2025-02-05 13:45:47",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan's SKY Perfect JSAT to invest $230 million in observation satellites Japan's SKY Perfect JSAT will invest about $230 million to build a constellation of low-Earth orbit satellites using U.S. company Planet Labs' Pelican satellite, the company said on Wednesday. JSAT will enter the Earth observation satellite business through the investment that will be carried out by its American subsidiary, the company said. Shares in JSAT, the biggest broadcast and communication satellite operator in Asia, rose as much as 9% after the announcement. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->TOKYO (Reuters) - Japan's SKY Perfect JSAT will invest about $230 million to build a constellation of low-Earth orbit satellites using U.S. company Planet Labs' Pelican satellite, the company said on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->JSAT will enter the Earth observation satellite business through the investment that will be carried out by its American subsidiary, the company said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Shares in JSAT, the biggest broadcast and communication satellite operator in Asia, rose as much as 9% after the announcement.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Kantaro Komiya; Editing by Himani Sarkar)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/japans-sky-perfect-jsat-invest-053533451.html",
            "pub_date": "2025-02-05 13:35:33",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "What to know about home insurance coverage after a major natural disaster It’s one thing to fix your home after something basic has gone wrong, but it’s a different beast to rebuild and recover after a major natural disaster has destroyed multiple properties on your street, in your neighborhood or across the region.  Insurance is meant to cover what you lost, but that can mean two very different things.  If you do nothing else, check your policy now to see if you have “replacement cost value” coverage. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->SEATTLE (AP) — It’s one thing to fix your home after something basic has gone wrong, but it’s a different beast to rebuild and recover after a major natural disaster has destroyed multiple properties on your street, in your neighborhood or across the region.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Don’t wait until you’re in crisis mode to figure out what to expect. It's important to understand your benefits and rights when it comes to home insurance in the event of a widespread emergency.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->What kind of coverage matters<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Insurance is meant to cover what you lost, but that can mean two very different things.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->If you do nothing else, check your policy now to see if you have “replacement cost value” coverage. That’s the comprehensive standard, which will grant you the amount of money needed to get a new replacement of what you lost in case of a major disaster like a wildfire.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->If you have “actual cash value” coverage, that means the dollar limits listed are only intended to cover the value of what you lost, which factors in depreciation at the time of the event.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Amy Bach of the consumer advocacy group United Policyholders says the two are apples and oranges in terms of payouts. She describes it this way: “Actual cash value is the Craigslist price. It’s not the replacement cost price.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Advanced payments in the early days<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->From finding a new place to live to buying yourself clothes and toiletries, it’s expensive to survive the immediate aftermath of an emergency, so get familiar with any state laws regulating insurance companies on advanced payments.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->For example, California, which has some of the strongest consumer protections in the nation, requires insurers to quickly pay out up to $250,000, or the equivalent of 30% of the policy’s dwelling coverage limit, when a state of emergency has been declared and the home is known to be a total loss. This is considered an advanced payment, which doesn’t require the homeowner to first itemize all their destroyed belongings or wait for an adjuster to access the site of the property.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->If you aren’t able to connect with your insurer, look for emergency response centers in your community, which should provide state and federal troubleshooters to assist. They may also have information on what other aid, grants and subsidies are available to you in conjunction with or separate from your insurance benefits. Local businesses may also be there to offer freebies such as furniture or clothing.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Think about the rebuilding timeline<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->You will likely be displaced for months, or even years depending on how widespread the disaster was. For major wildfires, cleaning up the toxic burned site can take just as long as the entire new construction effort.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->And during that time, you must continue to pay the mortgage on a property you can't occupy.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Property insurance generally refers to the cost of living while displaced as “loss of use” coverage, which is also sometimes known as “additional living expense” or “fair rental value.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Check this line item to ask yourself if you would have enough to get by paying for both your mortgage and a temporary rental.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/know-home-insurance-coverage-major-053217427.html",
            "pub_date": "2025-02-05 13:32:17",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Futures Fall, Asian Stocks Trim Gains on China: Markets Wrap (Bloomberg) -- Asian equities trimmed their gains after Chinese shares opened lower as caution prevailed among investors with trade tensions rising between the world’s two largest economies.Most Read from BloombergState Farm Seeks Emergency California Rate Hike After FiresNew York’s First ‘Passive House’ School Is a Model of Downtown DensityNYC’s Newest Transit Leader Builds a Worker-Driven StrategyTransportation Memos Favor Places With Higher Birth and Marriage RatesWhen French Communists Went ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Bloomberg) -- Asian equities trimmed their gains after Chinese shares opened lower as caution prevailed among investors with trade tensions rising between the world’s two largest economies.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:State Farm Seeks Emergency California Rate Hike After Fires;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-03/state-farm-seeks-emergency-california-rate-hike-after-la-fires?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">State Farm Seeks Emergency California Rate Hike After Fires</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:New York’s First ‘Passive House’ School Is a Model of Downtown Density;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-02/brooklyn-gets-nyc-s-first-passive-house-certified-school-building?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">New York’s First ‘Passive House’ School Is a Model of Downtown Density</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:NYC’s Newest Transit Leader Builds a Worker-Driven Strategy;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-04/nyc-fare-evasion-drops-as-new-transit-president-takes-helm?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">NYC’s Newest Transit Leader Builds a Worker-Driven Strategy</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Transportation Memos Favor Places With Higher Birth and Marriage Rates;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/department-of-transportation-memos-tie-funding-to-birth-rate-marriage-policy?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Transportation Memos Favor Places With Higher Birth and Marriage Rates</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:When French Communists Went on a Brutalist Building Boom;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-01/new-book-explores-brutalist-architecture-of-france-s-communist-party?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">When French Communists Went on a Brutalist Building Boom</a><!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Hong Kong equities fell while a gauge of Asian shares gave up some of its advance as China’s market reopened Wednesday after Lunar New Year holidays. Contracts for US and European equities lower after Google’s parent Alphabet Inc. and Advanced Micro Devices Inc. tumbled in extended trading. The yen gained against the dollar and gold rose to a record high on haven demand.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Investors are reducing risk as uncertainty remains high with Beijing’s swift retaliation to the US’s 10% tariff on imports from China. The first volleys in the latest US-China trade war made clear that Xi Jinping is taking a more cautious approach than during Donald Trump’s first term.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Trade relations between the US and China remain a risk, though if the 10% US tariff and China’s response measures were to be postponed, it will good for the market,” said Kenny Wen, head of investment strategy at KGI Asia Ltd. “On the other hand, the disputes may escalate again.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Amid rising trade tensions, the US Postal Service said it was temporarily suspending inbound international packages from China and Hong Kong Posts. While it’s not clear what prompted the move, it comes after Trump revoked a “de minimis” rule for China, which previously allowed small packages under $800 to enter the US duty-free.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“There’s a more macro risk to the market now as all these seem to be an escalation of the trade war between the US and China,” said Nick Twidale, chief analyst at AT Global Markets.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump told reporters there’s no rush to talk to Xi and he’ll speak to the Chinese president at the appropriate time.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“The delay in US-China trade negotiations may drive some near term volatility for China markets,” said Marvin Chen, an analyst at Bloomberg Intelligence. “But Trump has shown that negotiations are possible.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->While China’s tit-for-tat response to US were seen by some investors as a measured response to avoid a full-blown standoff, others are concerned that the weaker-than-expected manufacturing activity data and yuan’s depreciation could weigh on Chinese stocks.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China’s services activity unexpectedly slowed while extending its monthslong growth streak, a private survey showed, as one of the country’s busiest spending seasons around the Lunar New Year supported demand.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China continued to support the yuan by setting the daily reference rate for the currency at a level stronger than 7.2 per dollar as a trade war with the US added to depreciation pressure on the yuan.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Elsewhere, Japanese stocks reversed some losses, as shares of Toyota Motor Corp. extended gains after raising its annual operating profit outlook even though quarterly income fell short of estimates due to a downturn in global sales and production. The yen appreciated on expectations that Bank of Japan will continue with rate hikes, following strong domestic wage data and government comments on inflation.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In commodities, oil edged lower as concerns that the trade war would hurt global growth outweighed the announcement of reinforced sanctions on Iran. Bullion reached an all-time peak above $2,854 an ounce.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Key events this week:<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Eurozone HCOB Services PMI, PPI, Wednesday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->US trade, Wednesday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Fed’s Austan Goolsbee, Tom Barkin, Michelle Bowman, Philip Jefferson speak, Wednesday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Eurozone retail sales, Thursday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->UK rate decision, Thursday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->US initial jobless claims, Thursday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Fed’s Christopher Waller, Lorie Logan speak, Thursday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Amazon earnings, Thursday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->US nonfarm payrolls, unemployment, University of Michigan consumer sentiment, Friday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Fed’s Michelle Bowman, Adriana Kugler speak, Friday<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Some of the main moves in markets:<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Stocks<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->S&amp;P 500 futures fell 0.4% as of 1:47 p.m. Tokyo time<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Japan’s Topix rose 0.1%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Australia’s S&amp;P/ASX 200 rose 0.6%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Hong Kong’s Hang Seng fell 0.7%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Shanghai Composite fell 0.4%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Euro Stoxx 50 futures fell 0.5%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Nasdaq 100 futures fell 0.5%<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Currencies<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Bloomberg Dollar Spot Index was little changed<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The euro was little changed at $1.0378<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Japanese yen rose 0.7% to 153.27 per dollar<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The offshore yuan was little changed at 7.2906 per dollar<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Australian dollar was little changed at $0.6248<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Cryptocurrencies<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Bitcoin rose 1.8% to $98,267.07<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ether rose 3.5% to $2,732.3<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Bonds<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The yield on 10-year Treasuries was little changed at 4.50%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Australia’s 10-year yield declined seven basis points to 4.35%<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Commodities<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->West Texas Intermediate crude fell 0.4% to $72.41 a barrel<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Spot gold rose 0.5% to $2,857.59 an ounce<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This story was produced with the assistance of Bloomberg Automation.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->--With assistance from Toby Alder and Ruth Carson.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg Businessweek<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Amazon and SpaceX Want In on India’s Satellite Internet Market;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/musk-ambani-want-to-sell-millions-of-indians-satellite-internet?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Amazon and SpaceX Want In on India’s Satellite Internet Market</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Elon Musk Inside the Treasury Department Payment System;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-02/elon-musk-gets-inside-treasury-department-payment-system?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Elon Musk Inside the Treasury Department Payment System</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Inside Elon Musk’s Attack on the US Government;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/podcast-inside-elon-musk-s-attack-on-the-us-government?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Inside Elon Musk’s Attack on the US Government</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The NFL’s Flawed DEI Program Still Beats What Most Companies Are Doing;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/nfl-s-rooney-rule-is-a-dei-program-that-beats-what-most-companies-are-doing?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The NFL’s Flawed DEI Program Still Beats What Most Companies Are Doing</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The Internet Almost Killed Barnes &amp; Noble, Then Saved It;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-30/barnes-noble-sales-are-growing-again-thanks-to-booktok-buzz?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The Internet Almost Killed Barnes &amp; Noble, Then Saved It</a><!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->©2025 Bloomberg L.P.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/asian-stocks-track-us-higher-224408875.html",
            "pub_date": "2025-02-05 13:07:30",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        }
    ]
}