{
    "data": [
        {
            "title": "Toyota raises full-year profit outlook by 9% Toyota Motor raised its full-year operating profit forecast by 9% on Wednesday, in a sign of confidence in its ability to ride out any potential U.S. tariffs. The world's biggest-selling automaker raised its profit forecast for the current year through March 2025 to 4.7 trillion yen ($30.7 billion) versus 4.3 trillion yen expected previously. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->TOKYO (Reuters) - Toyota Motor raised its full-year operating profit forecast by 9% on Wednesday, in a sign of confidence in its ability to ride out any potential U.S. tariffs.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The world's biggest-selling automaker raised its profit forecast for the current year through March 2025 to 4.7 trillion yen ($30.7 billion) versus 4.3 trillion yen expected previously.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Daniel Leussink; Editing by Christopher Cushing)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/toyota-raises-full-profit-outlook-044049467.html",
            "pub_date": "2025-02-05 12:40:49",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Adani, Tata Profit Misses Add to Alarm Over India Stocks Outlook (Bloomberg) -- A deepening slowdown in corporate earnings is fueling fresh concern over India’s $4.1 trillion stock market, and threatening to undermine Prime Minister Narendra Modi’s latest efforts to revive growth.Most Read from BloombergState Farm Seeks Emergency California Rate Hike After FiresNew York’s First ‘Passive House’ School Is a Model of Downtown DensityNYC’s Newest Transit Leader Builds a Worker-Driven StrategyTransportation Memos Favor Places With Higher Birth and Marriage RatesWh ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Bloomberg) -- A deepening slowdown in corporate earnings is fueling fresh concern over India’s $4.1 trillion stock market, and threatening to undermine Prime Minister Narendra Modi’s latest efforts to revive growth.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:State Farm Seeks Emergency California Rate Hike After Fires;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-03/state-farm-seeks-emergency-california-rate-hike-after-la-fires?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">State Farm Seeks Emergency California Rate Hike After Fires</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:New York’s First ‘Passive House’ School Is a Model of Downtown Density;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-02/brooklyn-gets-nyc-s-first-passive-house-certified-school-building?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">New York’s First ‘Passive House’ School Is a Model of Downtown Density</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:NYC’s Newest Transit Leader Builds a Worker-Driven Strategy;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-04/nyc-fare-evasion-drops-as-new-transit-president-takes-helm?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">NYC’s Newest Transit Leader Builds a Worker-Driven Strategy</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Transportation Memos Favor Places With Higher Birth and Marriage Rates;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/department-of-transportation-memos-tie-funding-to-birth-rate-marriage-policy?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Transportation Memos Favor Places With Higher Birth and Marriage Rates</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:When French Communists Went on a Brutalist Building Boom;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-01/new-book-explores-brutalist-architecture-of-france-s-communist-party?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">When French Communists Went on a Brutalist Building Boom</a><!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Citigroup Inc. and HSBC Holdings Plc are among banks that have cut profit forecasts as the latest earnings from some of India’s top firms, including Adani Enterprises Ltd. and Tata Motors Ltd., trailed estimates. Local brokerage JM Financial Ltd. expects the benchmark NSE Nifty 50 Index’s earnings to grow less than 5% this fiscal year, the slowest pace since the pandemic. Some strategists say even that forecast may be too optimistic.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->To make matters worse, the global backdrop is becoming more challenging as US President Donald Trump’s tariff policies spur uncertainty and raise the odds of further dollar strengthening. Some strategists are skeptical that the record $11.5 billion in tax cuts announced by Modi’s government last week will be enough to counter these headwinds and help earnings recover.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“There is room for downward revisions as we don’t think there is going to be a V-shaped recovery in earnings,” Rajat Agarwal, an Asia strategist at Societe Generale Pvt., said by phone. “Tax cuts are not a big positive for the earnings recovery, as consumption has a lower multiplier effect on the economy than capex.”<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->At the heart of the issue is India’s economic slowdown. The global growth champion is stumbling after a pandemic-era consumption boom slowed and inflation spiked. The government has lowered its growth projection for the fiscal year to the weakest since the pandemic.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->JM Financial expects profits for the three months ended December to be up just 4.4% year-on-year, making it a third straight quarter of single-digit growth. Out of the 39 Nifty 50 companies that have posted results so far, earnings for 19 have missed estimates, data compiled by Bloomberg show.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->And markets are punishing weak results. Tata Motors, the Indian parent of luxury sport utility vehicles Jaguar Land Rover, saw its shares plunge more than 7% after it reported a 22% drop in net income, missing expectations. Maruti Suzuki India Ltd., the biggest carmaker, also saw its stock drop after profit missed estimates, hurt by higher input costs mainly due to the rupee’s slide against the US dollar.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Shares of Adani Enterprises, the flagship firm of the ports-to-power Adani conglomerate, dropped more than 5% intraday on Jan. 30 after it reported a 97% plunge in quarterly profit, weighed down by its coal trading unit and a foreign-exchange loss.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The dismal earnings picture comes at a difficult time for Indian stocks, which are struggling to find catalysts to stem a selloff that has erased over $600 billion from the market value of companies on the MSCI India Index since a peak in late September.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Global funds have pulled more $20 billion on a net basis during this period. They were sellers for 22 straight days through on Feb. 3, making it a record streak for daily withdrawals in data compiled by Bloomberg.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->India’s equity downturn comes after a yearslong rally that saw the Nifty 50 gauge cap a ninth straight annual gain in 2024, making the market a favorite among global investors.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The momentum faltered after Modi’s party shifted its focus toward welfare projects after an unexpected loss of its parliamentary majority in June. The pivot has slowed investment-driven growth, the key driver behind the market’s over 200% surge since the pandemic, and put pressure on corporate profits.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->There are expectations that as the positive impact of tax cuts flows through the economy, consumer firms — which account for about 18% of the main index — will support profitability. JM Financial estimates that Nifty 50 earnings can rebound to 18% in the next fiscal year, driven by greater urban spending, recovery in rural demand and the ongoing expenditure on infrastructure.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->For now though, corporates remain concerned about weak demand. Mentions of the word “slowdown” in earnings calls of companies in the Nifty 500 — the broadest gauge in India — hit the highest level since the pandemic, according to data compiled by Bloomberg.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Consumption is returning as key investment theme but it would be too early to say it alone can revive earnings growth,” said Mohit Khanna, a fund manager at Purnartha Investment Advisers Pvt. While the tax savings may spur spending “it is a little difficult to assess what would be the quantum of earnings growth,” he said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg Businessweek<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Amazon and SpaceX Want In on India’s Satellite Internet Market;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/musk-ambani-want-to-sell-millions-of-indians-satellite-internet?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Amazon and SpaceX Want In on India’s Satellite Internet Market</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Elon Musk Inside the Treasury Department Payment System;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-02/elon-musk-gets-inside-treasury-department-payment-system?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Elon Musk Inside the Treasury Department Payment System</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Inside Elon Musk’s Attack on the US Government;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/podcast-inside-elon-musk-s-attack-on-the-us-government?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Inside Elon Musk’s Attack on the US Government</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The NFL’s Flawed DEI Program Still Beats What Most Companies Are Doing;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/nfl-s-rooney-rule-is-a-dei-program-that-beats-what-most-companies-are-doing?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The NFL’s Flawed DEI Program Still Beats What Most Companies Are Doing</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The Internet Almost Killed Barnes &amp; Noble, Then Saved It;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-30/barnes-noble-sales-are-growing-again-thanks-to-booktok-buzz?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The Internet Almost Killed Barnes &amp; Noble, Then Saved It</a><!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->©2025 Bloomberg L.P.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/adani-tata-profit-misses-add-041748332.html",
            "pub_date": "2025-02-05 12:17:48",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BlackRock plans to hire 1,200 people in India, Bloomberg News reports Blackrock plans to hire nearly 1,200 people to expand two support hubs in India and build out its artificial intelligence (AI) capabilities in the country, Bloomberg News reported on Tuesday citing people familiar with the matter. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - Blackrock plans to hire nearly 1,200 people to expand two support hubs in India and build out its artificial intelligence (AI) capabilities in the country, Bloomberg News reported on Tuesday citing people familiar with the matter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Pretish M J in Bengaluru; Editing by Savio D'Souza)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/blackrock-plans-hire-1-200-041158190.html",
            "pub_date": "2025-02-05 12:11:58",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shares of China tungsten producers rally on Beijing's latest export curbs Soon after fresh U.S. tariffs on Chinese goods took effect on Tuesday, China said it would restrict exports of five critical minerals — tungsten, indium, bismuth, tellurium, and molybdenum — used in defence, clean energy and other industries to \"safeguard national security interests.\"  Xiamen Tungsten, China Tungsten and High-tech Materials and Chongyi Zhangyuan Tungsten climbed over 3%,while CMOC jumped by over 1% as of 0206 GMT.  In past cases where China has imposed export curbs on other critical minerals, as in August 2023, prices jumped to the signal the metals newfound importance. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Amy Lv and Lewis Jackson<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->BEIJING (Reuters) - Shares of major Chinese tungsten producers rallied on Wednesday as markets reacted to Beijing's latest critical mineral export controls on the first day of trading after the week-long Lunar New Year holiday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Soon after fresh U.S. tariffs on Chinese goods took effect on Tuesday, China said it would restrict exports of five critical minerals — tungsten, indium, bismuth, tellurium, and molybdenum — used in defence, clean energy and other industries to \"safeguard national security interests.\"<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Xiamen Tungsten, China Tungsten and High-tech Materials and Chongyi Zhangyuan Tungsten climbed over 3%,while CMOC jumped by over 1% as of 0206 GMT.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In past cases where China has imposed export curbs on other critical minerals, as in August 2023, prices jumped to the signal the metals newfound importance. Some Chinese exporters will also be able to take advantage of the expected rally in prices overseas once they secure export licenses.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Tungsten is an ultra-hard metal, in terms of strength outdone only by diamonds, and is primarily used in the production of goods including artillery shells, armour plating and cutting tools.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China produced over 80% of global tungsten supply in 2023, according to data from the United States Geological Survey (USGS).<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->While tungsten resources exist outside China, analysts and traders say certain specialised tungsten products used by the aerospace and defence industries have few non-Chinese alternatives.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"The export controls on APT and tungsten carbide could be the worst affected as there are few alternatives for tungsten in aerospace and defence applications,\" said Sian Morris, non-ferrous metals analyst at information provider Argus. APT is a compound used in production of various tungsten products.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Russia was previously a major supplier of tungsten products, but China has grown its share of the global tungsten market since the start of Russia's war in Ukraine.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Amy Lv and Lewis Jackson; Editing by Kim Coghill)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/shares-china-tungsten-producers-rally-034338855.html",
            "pub_date": "2025-02-05 11:43:38",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Citi appoints Ashu Khullar as co-head of global asset managers, memo shows Citigroup has appointed Ashu Khullar to partner with Anthony Diamandakis to serve together as co-heads of global asset managers, according to an internal memo seen by Reuters on Wednesday.  Khullar, who is moving from his current role as India subcontinent sub-cluster & banking head, will be replaced by K. Balasubramanian, the memo showed.  \"Ashu will move to London and lead our effort to expand Citi's relationship with sponsors across EMEA and Asia,\" the memo said. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->SINGAPORE (Reuters) - Citigroup has appointed Ashu Khullar to partner with Anthony Diamandakis to serve together as co-heads of global asset managers, according to an internal memo seen by Reuters on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Khullar, who is moving from his current role as India subcontinent sub-cluster &amp; banking head, will be replaced by K. Balasubramanian, the memo showed.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Ashu will move to London and lead our effort to expand Citi's relationship with sponsors across EMEA and Asia,\" the memo said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Balasubramanian's appointment is subject to regulatory approval from the Reserve Bank of India, according to the memo.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Yantoultra Ngui; Editing by Rashmi Aich)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/citi-appoints-ashu-khullar-co-033916181.html",
            "pub_date": "2025-02-05 11:39:16",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stock market today: Asia shares trade mostly lower as as investors weigh impact of US-China tariffs Asian shares were mostly lower Wednesday as markets mulled the impact of tariffs being imposed by the United States and China.  The Hang Seng dropped 0.6% to 20,659.41, while the Shanghai Composite lost 0.3% to 3,239.74.  Trump may be more likely to keep tariffs on China longer, as he did in his first presidential term, to separate the United States more from its geopolitical rival. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->TOKYO (AP) — Asian shares were mostly lower Wednesday as markets mulled the impact of tariffs being imposed by the United States and China.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Japan's benchmark Nikkei 225 slipped 0.2% in early trading to 38,727.19. Australia's S&amp;P/ASX 200 rose 0.5% to 8,417.10. The Hang Seng dropped 0.6% to 20,659.41, while the Shanghai Composite lost 0.3% to 3,239.74. South Korea’s Kospi jumped 1.1% to 2,508.58, as investors found bargains after the recent price dips and found optimism from the overnight Wall Street rally.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Some analysts see tariffs on China as separate from Trump’s moves against other trading partners. Trump may be more likely to keep tariffs on China longer, as he did in his first presidential term, to separate the United States more from its geopolitical rival.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump is pressing ahead with a 10% tariff on U.S. companies importing things from China. And <a class=\"link\" data-ylk=\"slk:China retaliated on Tuesday;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/china-tariffs-us-trump-150fab3a44ec055845e47c82bde544c2\" rel=\"nofollow noopener\" target=\"_blank\">China retaliated on Tuesday </a> by announcing its own tariffs on some U.S. products and an <a class=\"link\" data-ylk=\"slk:antitrust investigation into Google;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/google-china-antitrust-investigation-tariffs-ab02b906733666cb0d348d2b416b7fa5\" rel=\"nofollow noopener\" target=\"_blank\">antitrust investigation into Google</a>.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China's 15% tariff on U.S. coal and liquefied natural gas products, as well as a 10% tariff on crude oil, agricultural machinery and large-engine cars imported from the United States won’t take effect until Monday. That leaves time for negotiations between Trump and Chinese President Xi Jinping.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Trade tensions haven’t exploded yet, but they’re simmering dangerously close to a full boil, and anyone brushing them off does so at their own risk,” said Stephen Innes, managing partner at SPI Asset Management.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->On Wall Street, calm returned, as tech stocks led U.S. indexes higher following a strong profit report from Palantir Technologies, a darling benefiting from the artificial-intelligence boom.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The S&amp;P 500 rose 0.7% a day after <a class=\"link\" data-ylk=\"slk:swinging sharply;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/stock-market-trump-tariffs-5f365936ea9bdf45a0460556f3a5f4e8\" rel=\"nofollow noopener\" target=\"_blank\">swinging sharply </a> on worries that President <a class=\"link\" data-ylk=\"slk:Donald Trump’s tariffs;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/trumps-tariffs-canada-mexico-china-taxes-910cf9a18fce654597a30dbaaa8d1576\" rel=\"nofollow noopener\" target=\"_blank\">Donald Trump’s tariffs </a> could spark a <a class=\"link\" data-ylk=\"slk:trade war;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/eu-us-ukraine-defense-trump-greenland-tariffs-c3e454c8f0959d273c2b6dd5941395e3\" rel=\"nofollow noopener\" target=\"_blank\">trade war </a> that would hurt <a class=\"link\" data-ylk=\"slk:economies;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/canada-trump-tariffs-e0af3e973a2d7848c2baaa6fb8021c27\" rel=\"nofollow noopener\" target=\"_blank\">economies</a> around the world, <a class=\"link\" data-ylk=\"slk:including the United States;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/trump-tariffs-canada-mexico-china-trade-surplus-3010e6368545e2976feb5ac6b41e528e\" rel=\"nofollow noopener\" target=\"_blank\">including the United States</a>.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Dow Jones Industrial Average added 134 points, or 0.3%, and the Nasdaq composite climbed 1.4%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump on Monday agreed to <a class=\"link\" data-ylk=\"slk:delay his taxes on U.S. imports of Canadian and Mexican products;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/trump-tariffs-canada-mexico-china-sheinbaum-trudeau-017efa8c3343b8d2a9444f7e65356ae9\" rel=\"nofollow noopener\" target=\"_blank\">delay his taxes on U.S. imports of Canadian and Mexican products </a> for a month. That bolstered Wall Street’s longstanding hopes that Trump’s tough talk on tariffs may be just that, talk. The hope is that Trump sees tariffs as a stick he can use in negotiations with trading partners rather than as a long-term policy.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->That hope is built in part on traders’ belief that Trump would likely be turned off by the damage Wall Street would take if a worst-case, long-term trade war were to occur. Trump has pointed in the past to the stock market as a real-time measure of his performance.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But a trade war is still possible, and some analysts say more swings may be coming because Trump’s threats should be taken both seriously and literally.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Investors have suggested the equity market is the US administration’s scorecard and any policy changes that hurt risk assets will be quickly dialed back,” Bank of America strategists led by Mark Cabana wrote in a BofA Global Research report. “We advise caution.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The stock price of Google’s parent company, Alphabet, rose 2.5% even with China’s antitrust investigation.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Pharmaceutical giant Merck tumbled 9.1% despite beating sales and profit forecasts for the latest quarter. It gave a forecast for upcoming revenue that fell short of analysts’ expectations, due partly to a pause in shipments of one of its <a class=\"link\" data-ylk=\"slk:top-selling products to China;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/merck-sales-forecast-gardasil-china-d95287118545d8620ebc8034cecd0d1e\" rel=\"nofollow noopener\" target=\"_blank\">top-selling products to China</a>.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->All told, the S&amp;P 500 rose 43.31 points to 6,037.88. The Dow Jones Industrial Average added 134.13 to 44,556.04, and the Nasdaq composite gained 262.06 to 19,654.02.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In the bond market, Treasury yields eased after a report indicated the U.S. job market may be adding less upward pressure on inflation. U.S. employers <a class=\"link\" data-ylk=\"slk:advertised fewer job openings;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/employment-economy-tariffs-43771c4d10fae5f05ed0e097e7c587a5\" rel=\"nofollow noopener\" target=\"_blank\">advertised fewer job openings</a> at the end of December than economists expected, suggesting a slowing but still healthy job market.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The yield on the 10-year Treasury fell to 4.51% from 4.56% late Monday. The two-year yield, which moves more closely with expectations for what the Federal Reserve will do with short-term interest rates, eased to 4.21% from 4.25%<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In energy trading, benchmark U.S. crude fell 20 cents to $72.50 a barrel. Brent crude, the international standard, declined 31 cents to $75.89 a barrel.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In currency trading, the U.S. dollar slipped to 153.41 Japanese yen from 154.30 yen. The euro cost $1.0386, inching up from $1.0382.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/stock-market-today-asia-shares-032819006.html",
            "pub_date": "2025-02-05 11:28:19",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US and international oil producers are pushing back on the Trump administration's plan to pump more crude Neither OPEC nor US shale firms appear willing to increase oil supply, despite President Trump's pledge to bring down energy prices. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"oil rig\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Oil pumps work at sunset on Wednesday, Sept. 11, 2013, in the desert oil fields of Sakhir, Bahrain.<span class=\"copyright\">AP/Hasan Jamali</span><!-- HTML_TAG_END --> </figcaption> </figure> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->President Trump wants to increase drilling to lower oil prices, but producers are hesitant.<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sources told The Wall Street Journal that US producers aren't looking to boost production.<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->OPEC+ also won't deliver on the White House's request for more oil.<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->President Donald Trump's pledge to lower prices at the pump is getting tested by US and international energy producers alike.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Though the administration has committed to sweeping away regulation of the oil and gas industry, that might not be enough incentive for producers to \"drill, baby, drill.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->While the Trump mantra defined the president's energy platform during his <span>campaign, it glosses over the fact that US shale firms are already pumping </span><a class=\"link\" data-ylk=\"slk:historic amounts of oil;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.businessinsider.com/us-oil-production-boom-crude-supply-wti-price-goldman-sachs-2024-7?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\"><span>historic amounts of oil</span></a><span>. At this point, a boost to drilling and a surge in oil supply could threaten</span> profitability.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sources told <a class=\"link\" data-ylk=\"slk:The Wall Street Journal;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.wsj.com/business/energy-oil/trump-oil-drilling-saudi-arabia-71c095ff?mod=finance_lead_pos5\" rel=\"nofollow noopener\" target=\"_blank\">The Wall Street Journal</a> that White House advisers recognize this and don't expect the US shale industry to increase output. Corporate leaders have hinted as much in recent <a class=\"link\" data-ylk=\"slk:earnings commentary;elm:context_link;itc:0;sec:content-canvas\" href=\"https://markets.businessinsider.com/news/commodities/oil-prices-trump-production-brent-crude-drilling-exxon-chevron-energy-2025-1?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">earnings commentary</a>, cautioning not to expect a major drilling ramp-up.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"As crude prices come down, we expect the industry revenues to go down and profits to go down,\" ExxonMobile CEO Darren Woods said last week. While Trump wants to vastly expand drilling, industry giants are more concerned about navigating a mounting supply glut in the global market, which has pressured prices down worldwide.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->According to the Kansas City Federal Reserve, <a class=\"link\" data-ylk=\"slk:WTI oil;elm:context_link;itc:0;sec:content-canvas\" href=\"https://markets.businessinsider.com/commodities/oil-price?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">WTI oil</a> prices would need to <a class=\"link\" data-ylk=\"slk:average $84 per barrel;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.kansascityfed.org/surveys/energy-survey/tenth-district-energy-activity-fell-at-a-steady-pace/\" rel=\"nofollow noopener\" target=\"_blank\">average $84 per barrel</a> for domestic firms to significantly boost drilling. That's about 15% above current prices.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->If Trump is dedicated to lowering energy prices, his advisers expect that outside help is needed. The president's best bet is the Organization of the Petroleum Exporting Countries, the cartel of foreign oil producers led by Saudi Arabia. The president appears to realize this, <a class=\"link\" data-ylk=\"slk:calling on OPEC;elm:context_link;itc:0;sec:content-canvas\" href=\"https://markets.businessinsider.com/news/commodities/trump-opec-saudi-global-oil-prices-2025-supply-production-1?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">calling on OPEC</a> to help lower prices last month in his address to the World Economic Forum.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->However, sources told the Journal that Saudi officials have signaled to the Trump team that the country's producers are unwilling to boost supply.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->After all, OPEC members have voluntarily held back output in the past two years to increase market prices. Many of these countries depend on oil profits and have been scarred by the market's slide. Although the quotas were set to expire in previous months, the cartel has delayed the production revival three times.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In a review meeting on Monday, the OPEC+ coalition confirmed plans to increase output in April, keeping supply in check for the rest of this quarter. The cartel will rollback production curbs gradually, bringing online <a class=\"link\" data-ylk=\"slk:2.1 million barrels;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-03/opec-sticks-to-supply-plan-even-as-trump-seeks-oil-price-cut\" rel=\"nofollow noopener\" target=\"_blank\">2.1 million barrels</a> by late 2026.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->According to one former US official who spoke with the Journal, a price war between Trump and Saudi Arabia is likely.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Read the original article on <a class=\"link\" data-ylk=\"slk:Business Insider;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.businessinsider.com/trump-oil-energy-drilling-plan-opec-industry-production-wti-brent-2025-2\" rel=\"nofollow noopener\" target=\"_blank\">Business Insider</a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/us-international-oil-producers-pushing-023243680.html",
            "pub_date": "2025-02-05 10:32:43",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil little changed as market shrugs off China tariffs but Iran pressure supports Oil prices were little changed on Wednesday after volatile trading in the previous session as investors shrugged off the impact of China's tariffs on U.S. energy imports though President Donald Trump's renewed push to eliminate Iranian crude exports provided some support.  Brent crude futures were down 18 cents, or 0.24%, at $76.02 a barrel by 0210 GMT.  Oil on Tuesday traded in a wide range, with WTI falling at one point by 3%, its lowest since Dec. 31, after China announced tariffs on U.S. imports of oil, liquefied natural gas and coal in retaliation to U.S. levies on Chinese exports. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Laila Kearney<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - Oil prices were little changed on Wednesday after volatile trading in the previous session as investors shrugged off the impact of China's tariffs on U.S. energy imports though President Donald Trump's renewed push to eliminate Iranian crude exports provided some support.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Brent crude futures were down 18 cents, or 0.24%, at $76.02 a barrel by 0210 GMT. U.S. West Texas Intermediate crude (WTI) lost 9 cents, or 0.12%, to $72.61.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Oil on Tuesday traded in a wide range, with WTI falling at one point by 3%, its lowest since Dec. 31, after China announced tariffs on U.S. imports of oil, liquefied natural gas and coal in retaliation to U.S. levies on Chinese exports.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Prices rebounded, however, after Trump restored the \"maximum pressure\" campaign on Iran to curtail its nuclear programme he enacted in his first term that cut Iranian crude exports to zero.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The impact of China's retaliatory tariffs on energy prices will be limited \"given that neither global supply nor demand of these commodities are changed by China's tariffs,\" analysts at Goldman Sachs said in a note on Tuesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Both countries will be able to find alternative markets, the note said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->While Trump said he was open to a deal with Iran and expressed a willingness to talk to the Iranian leader when he signed the presidential memorandum re-imposing Washington's tough policy on Iran, the plan could impact about 1.5 million barrels per day of oil that the country exports, analysts at ANZ said on Wednesday, citing shiptracking data.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Prices were also pressured by rising crude and fuel stockpiles in the U.S., the world's biggest oil consumer.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Crude stocks rose by 5.03 million barrels in the week ended Jan. 31, according to market sources, citing American Petroleum Institute figures.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Gasoline inventories rose by 5.43 million barrels, and distillate stocks fell by 6.98 million barrels, the API reported, according to the sources.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Official U.S. government oil inventory data is due to be released on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Laila Kearney; Editing by Christian Schmollinger)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/oil-little-changed-market-shrugs-022702126.html",
            "pub_date": "2025-02-05 10:27:02",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's services activity grows at slower pace, Caixin PMI shows China's services activity expanded at a slower pace in January, with the Lunar New Year holidays worsening employment, but business sentiment improved, a private sector survey showed on Wednesday.  The Caixin/S&P Global services purchasing managers' index (PMI), slipped to 51.0 from 52.2 in December, but remained above the 50-mark that separates expansion from contraction on a monthly basis.  That echoes the official PMI, which showed services activity weakened to 50.3 from 52.0. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->BEIJING (Reuters) - China's services activity expanded at a slower pace in January, with the Lunar New Year holidays worsening employment, but business sentiment improved, a private sector survey showed on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Caixin/S&amp;P Global services purchasing managers' index (PMI), slipped to 51.0 from 52.2 in December, but remained above the 50-mark that separates expansion from contraction on a monthly basis.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->That echoes the official PMI, which showed services activity weakened to 50.3 from 52.0.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Caixin survey showed that new business growth eased to a four-month low, while employment fell to the weakest since April 2024.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The fall in January's employment sub-index was partly due to the earlier-than-usual Lunar New Year holiday this year, as some restaurants shut down temporarily and sent workers back home for the more than one week-long celebrations.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The level of unfinished work fell for the first time in six months due to slower new business growth and better working efficiency.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Business sentiment rose from December, but some firms expressed concerns over rising competition and uncertainties pertaining to the outlook for international trade.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->U.S. President Donald Trump on Saturday ordered 10% tariffs on goods from China. That prompted Beijing to swiftly respond on Tuesday with its own levies on some U.S. imports.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"The new duties will nearly double the effective tariff rate on Chinese imports (to the U.S.), but Chinese policymakers have ample scope to mitigate the damage to economic growth,\" said Gavekal Dragonomics's Thomas Gatley in a note on Monday.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Julian Evans-Pritchard, head of China economics at Capital Economics, said that there could be a silver lining for China, with Trump's willingness to undermine U.S. alliances likely to leave China in a stronger geopolitical position.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Caixin/S&amp;P Global Composite PMI, which combines the manufacturing and services PMIs, fell to 51.1 in January from 51.4 the month prior.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The pace of growth softened to the lowest in four months, as quicker manufacturing output growth failed to counter a softening pace of growth in services activity.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China is struggling with a prolonged property crisis that has curbed investment and dented confidence though policymakers have pledged to prioritise domestic consumption in this year's policies.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The country's movie box office took in record revenue during the Lunar New Year holiday, as sequels to popular Chinese hits drew theatregoers. Some local governments issued cinema vouchers as part of a campaign to revive consumption.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Ellen Zhang and Ryan Woo; Editing by Jacqueline Wong)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/chinas-services-activity-grows-slower-015538614.html",
            "pub_date": "2025-02-05 09:55:38",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ONE, LX Pantos in Boxlinks venture for US domestic intermodal Liner operator Ocean Network Express and LX Pantos are partnering on Boxlinks for U.S. domestic intermodal logistics. The post ONE, LX Pantos in Boxlinks venture for US domestic intermodal appeared first on FreightWaves. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"(Photo: Jim Allen/FreightWaves)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->(Photo: Jim Allen/FreightWaves)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Liner operator Ocean Network Express (ONE) and South Korean forwarder LX Pantos announced a joint venture, Boxlinks, a new player offering end-to-end U.S. domestic intermodal transportation services.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The joint venture will manage ONE’s inland-to-coastal domestic transport needs through a Domestic Reposition Program (DRP).<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“By leveraging empty containers for intermodal operations, Boxlinks aims to create new revenue streams while improving operational efficiency,” LX Pantos said in a release. “This initiative is designed to optimize empty container repositioning and unlock additional value-added transportation opportunities, ensuring a mutually beneficial business model.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“As the world’s largest consumer market, the U.S. heavily relies on imports for containerized cargo movement. A significant portion of containers transported inland from major ports — such as Los Angeles (West Coast), Savannah, and New York (East Coast) — often return empty due to limited export cargo.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Boxlinks has secured direct agreements with Union Pacific (NYSE: <a class=\"link\" data-ylk=\"slk:UNP;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/UNP/\">UNP</a>), Norfolk Southern (NYSE: <a class=\"link\" data-ylk=\"slk:NSC;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/NSC/\">NSC</a>) and BNSF, Pantos said, creating a rail network connecting key logistics hubs at competitive freight rates.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Headquartered in Singapore, ONE is an ocean carrier alliance comprising Kawasaki Kisen Kaisha (K-Line), Mitsui O.S.K. Lines (MOL) and Nippon Yusen Kaisha (NYK), all of Japan.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->LX Pantos is one of the world’s largest sea forwarders, posting revenue of $47 billion in 2023.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The companies said that since 2023 they have closely collaborated to develop a strategy for approaching the U.S. market. The companies quoted data from the Intermodal Association of North America valuing the U.S. intermodal market at $54 billion annually, with a projected compound annual growth rate of 10.9% through 2030.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“This strategic partnership will leverage the combined strengths of ONE and LX Pantos to provide end-to-end domestic intermodal transportation services, utilizing both companies’ partnerships with major rail carriers and trucking companies to provide efficient and timely delivery of cargo in the United States,” ONE said in its release.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Lee Yong-Ho, CEO of LX Pantos, said: “This joint venture will serve as a strategic foothold for our penetration into the United States, the world’s largest logistics market. We are committed to advancing our end-to-end logistics services by integrating international shipping with inland rail services, further strengthening our market position.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The railroads did not immediately return messages seeking further details. The trucking companies were not identified.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Through Boxlinks, we are transforming how we deliver value in the United States. We will build a more resilient and agile inland network that will benefit our customers in the domestic market,” said Hiroki Tsujii, global chief officer — head of product and network at ONE, in the release.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em>Find more articles by Stuart Chirls<a class=\"link\" data-ylk=\"slk: here.;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.freightwaves.com/news/author/stuartchirls\" rel=\"nofollow noopener\" target=\"_blank\"> <strong>here</strong>.</a></em><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong><em>Related coverage:</em></strong><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em><a class=\"link\" data-ylk=\"slk:CMA CGM sets peak surcharges for Northern Europe-US containers;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.freightwaves.com/news/cma-cgm-sets-peak-surcharges-for-north-europe-u-s-containers\" rel=\"nofollow noopener\" target=\"_blank\">CMA CGM sets peak surcharges for Northern Europe-US containers</a></em><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em><a class=\"link\" data-ylk=\"slk:ILA sets wage review as longshore contract nears ratification vote;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.freightwaves.com/news/ila-sets-wage-review-as-longshore-contract-nears-ratification-vote\" rel=\"nofollow noopener\" target=\"_blank\">ILA sets wage review as longshore contract nears ratification vote</a></em><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em><a class=\"link\" data-ylk=\"slk:What shippers should know about ocean carrier alliance changes in 2025;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.freightwaves.com/news/what-shippers-should-know-about-ocean-carrier-alliance-changes-in-2025\" rel=\"nofollow noopener\" target=\"_blank\">What shippers should know about ocean carrier alliance changes in 2025</a></em><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The post <a class=\"link\" data-ylk=\"slk:ONE, LX Pantos in Boxlinks venture for US domestic intermodal;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.freightwaves.com/news/one-lx-pantos-in-boxlinks-venture-for-us-domestic-intermodal\" rel=\"nofollow noopener\" target=\"_blank\">ONE, LX Pantos in Boxlinks venture for US domestic intermodal</a> appeared first on <a class=\"link\" data-ylk=\"slk:FreightWaves;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.freightwaves.com\" rel=\"nofollow noopener\" target=\"_blank\">FreightWaves</a>.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/one-lx-pantos-boxlinks-venture-012245256.html",
            "pub_date": "2025-02-05 09:22:45",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        }
    ]
}