{
    "data": [
        {
            "title": "Wall Street pushes out end of Fed balance sheet wind-down, minutes show",
            "description": "<div class=\"body yf-1ir6o1g\"> <div class=\"atoms-wrapper\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->By Michael S. Derby<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->NEW YORK (Reuters) -Financial market participants have pushed out yet again the end date for the effort to shrink the size of the Federal Reserve's large balance sheet, the minutes of the U.S. central bank's June 17-18 policy meeting showed on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The drawdown of the Fed's stock of bonds is now expected to stop in February when the balance sheet stands at $6.2 trillion, big banks and money funds told the U.S. central bank ahead of last month's policy meeting, the minutes noted. That represents a small shift from what survey respondents said ahead of the Fed's policy meeting in early May, when they eyed a January end date, and $6.125 trillion in total holdings.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The Fed has been shrinking the size of its balance sheet since the summer of 2022 in an effort referred to as quantitative tightening, or QT. The central bank has allowed set amounts of bonds it bought during the COVID-19 pandemic to mature and not be replaced, in an effort that so far has taken the overall stock of cash and bonds it holds from a record $9 trillion to the current level of $6.7 trillion.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The Fed more than doubled its bond holdings to stabilize markets and then provide stimulus to the economy beyond what could be delivered by near-zero short-term rates. The QT program has been aimed at removing excess levels of liquidity from the market as part of a broader monetary policy normalization, but there's been ongoing uncertainty when that process could end, and at what level of holdings the Fed would be able to rest at.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->For some time, market participants have expected the Fed to stop QT this year. But earlier in 2025 the Fed slowed QT in order to reduce the risk of market disruptions while the Treasury Department took action to deal with government financing needs during wrangling over the government's official borrowing limit and its broader budget needs.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Much of that uncertainty was resolved last week with the passage of a Trump administration budget bill that lifted the borrowing cap, which will allow the Treasury to sell more debt. Increased debt sales will cut into the reserve levels the Fed has been trying to shrink with QT.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The reserves now stand at around $3.3 trillion, a level that's been steady for some time. The minutes released on Wednesday said market participants told the Fed they see reserves dipping to $2.9 trillion due to QT. Respondents also said the Fed's reverse repo facility, which held $227 billion on Wednesday, should move to a \"low\" level.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->(Reporting by Michael S. Derby; Editing by Mark Porter and Paul Simao)<!-- HTML_TAG_END --></p> </div>  </div>",
            "link": "https://finance.yahoo.com/news/wall-street-pushes-end-fed-192418432.html",
            "pub_date": "2025-07-10 03:24:18",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Huawei eyes data center investments in Brazil, says executive",
            "description": "<div class=\"body yf-1ir6o1g\"> <div class=\"atoms-wrapper\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->RIO DE JANEIRO (Reuters) -Chinese tech giant Huawei is interested in investing in Brazil's data center market but is waiting for a local government bill to finalize its strategy for the country, an executive told Reuters on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Citing Huawei's international experience in the data center sector, the executive emphasized that the advancement of artificial intelligence requires government incentives and support.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"We want the government to implement these incentives, which are good for the country, and the time is now. In the next two to three years,\" said Atilio Rulli, the company's vice president of public relations for Latin America and the Caribbean.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->(Reporting by Rodrigo Viga Gaier; Writing by Isabel Teles; Editing by Natalia Siniawski)<!-- HTML_TAG_END --></p> </div>  </div>",
            "link": "https://finance.yahoo.com/news/huawei-eyes-data-center-investments-191645609.html",
            "pub_date": "2025-07-10 03:16:45",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Will The Fed Lower Interest Rates In July? Policymakers Are Split, FOMC Minutes Show",
            "description": "<div class=\"body yf-1ir6o1g\"> <div class=\"atoms-wrapper\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-1gfnohs loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-1gfnohs\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"Al Drago / Bloomberg via Getty Images The newly published meeting minutes highlighted a divide already evident from the public speeches of Fed officials.\" class=\"yf-1gfnohs loader\" height=\"640\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START --><p>Al Drago / Bloomberg via Getty Images</p> The newly published meeting minutes highlighted a divide already evident from the public speeches of Fed officials.<!-- HTML_TAG_END --> </figcaption> </figure> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Key Takeaways<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Federal Reserve policymakers are split on whether to cut interest rates in July, minutes of the Federal Open Market Committee's June meeting showed.<br/><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"A couple\" members of the 12-vote committee said they were open to a July cut, while most said they expected to cut rates at some point this year.<br/><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"Some\" members said it was likely the fed would not change its key interest rate at all in 2025.<br/><!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1090901\"><!-- HTML_TAG_START --><br/><!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Will the Federal Reserve bring Christmas in July for borrowers? That depends on which of two factions prevails when the central bank's policy committee meets at the end of the month.<br/><br/>The minutes of the Federal Open Market Committee's June meeting, released Wednesday, show growing disagreement over whether the Fed should adjust its influential fed funds rate at its July 30 meeting.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->On one side are those who believe inflation is tame enough to justify cutting rates, and on the other are members who are more worried that tariffs could drive up prices for consumers, potentially dealing a setback to the Fed's mission to drive inflation down to its goal of a 2% annual rate.<br/><br/>The newly published meeting minutes highlighted a divide <a class=\"link\" data-ylk=\"slk:already evident from Fed officials' public speeches;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.investopedia.com/fed-officials-are-split-on-whether-to-cut-interest-rates-in-july-11762068\" rel=\"nofollow noopener\" target=\"_blank\">already evident from Fed officials' public speeches</a>. The officials are split about how they expect the economy to respond to President Donald Trump's <a class=\"link\" data-ylk=\"slk:ongoing and sometimes unpredictable;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.investopedia.com/trump-s-latest-tariff-turnabout-deepens-confusion-about-trade-policy-11768584\" rel=\"nofollow noopener\" target=\"_blank\">ongoing and sometimes unpredictable</a> campaign of cranking up import taxes on numerous products and trading partners.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The <a class=\"link\" data-ylk=\"slk:federal funds rate;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.investopedia.com/terms/f/federalfundsrate.asp\" rel=\"nofollow noopener\" target=\"_blank\">federal funds rate</a> influences borrowing costs on all kinds of loans, and bringing it down could boost the economy, but possibly at the risk of reigniting the high inflation that has plagued U.S. consumers since the late days of the pandemic.<br/><br/>Fed officials have also said they're concerned about the possibility of tariffs dragging down the economy and hurting the job market. Congress has <a class=\"link\" data-ylk=\"slk:tasked the Fed;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.investopedia.com/articles/investing/100715/breaking-down-federal-reserves-dual-mandate.asp\" rel=\"nofollow noopener\" target=\"_blank\">tasked the Fed</a> with keeping employment high and fighting inflation.<br/><!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->To Cut Or Not To Cut?<!-- HTML_TAG_END --></h2> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Some fed officials were more concerned about possible tariff-driven inflation than others, according to the minutes.<br/><br/>\"Most participants assessed that some reduction in the target range for the federal funds rate this year would likely be appropriate, noting that upward pressure on inflation from tariffs may be temporary or modest,\" the minutes said. \"A couple of participants noted that, if the data evolve in line with their expectations, they would be open to considering a reduction in the target range for the policy rate as soon as at the next meeting.\"<br/><br/>But with inflation still running hotter than the Fed would like, some FOMC members stayed more hawkish.<br/><!-- HTML_TAG_END --></p> </div> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-1epmntv\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span></button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"Some participants saw the most likely appropriate path of monetary policy as involving no reductions in the target range for the federal funds rate this year, noting that recent inflation readings had continued to exceed the Committee’s 2% goal.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Consumer prices as measured by \"core PCE\" (the Fed's preferred inflation benchmark) increased <a class=\"link\" data-ylk=\"slk:2.7% over 12 months when last measured in May.;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.investopedia.com/the-fed-s-preferred-inflation-gauge-was-slightly-higher-than-expected-in-may-11762428\" rel=\"nofollow noopener\" target=\"_blank\">2.7% over 12 months when last measured in May.</a> The measure was headed in the wrong direction, moving away from the Fed's 2% goal. Meanwhile, the job market has <a class=\"link\" data-ylk=\"slk:stayed resilient,;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.investopedia.com/job-growth-in-june-blows-by-expectations-unemployment-surprisingly-declines-11766017\" rel=\"nofollow noopener\" target=\"_blank\">stayed resilient,</a> according to official reports on payrolls, potentially buying more time for the Fed to keep rates steady and see what happens.<br/><br/>With only \"a couple\" of the committee's 12 voting members favoring a July cut, financial markets continued to price in the likelihood the Fed won't cut rates at least until September, according to the CME Group's FedWatch tool. The tool forecasts rate movements based on fed funds futures trading data.<br/><br/>\"The FOMC is comfortable remaining in wait-and-see mode,\" Jeffrey Roach, Chief Economist for LPL Financial, wrote in a commentary. \"Despite headwinds, the economy continues to trudge along, giving policymakers time to assess the projected impact from tariffs. Ever since last week’s payroll release, markets do not expect the FOMC will cut rates later this month.\"<br/><!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Read the original article on <a class=\"link\" data-ylk=\"slk:Investopedia;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.investopedia.com/will-the-fed-lower-interest-rates-in-july-policymakers-are-split-fomc-minutes-show-11769229\" rel=\"nofollow noopener\" target=\"_blank\">Investopedia</a><!-- HTML_TAG_END --></p> </div>  </div>",
            "link": "https://finance.yahoo.com/news/fed-lower-interest-rates-july-190734874.html",
            "pub_date": "2025-07-10 03:07:34",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Snack Wrap redux: How McD's is refreshing its menu to lure back customers",
            "description": "<div class=\"body yf-1ir6o1g\"> <div class=\"atoms-wrapper\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->McDonald's is reviving fan favorites, spicing up its menu and emphasizing low-cost items to bring inflation-weary customers back to the Golden Arches.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The world's largest restaurant chain recently announced it was bringing back the popular Snack Wrap, which makes its return to McD's outlets on July 10, along with a new, limited-time Spicy Egg McMuffin sandwich, which debuted on July 8. The refreshed menu comes as the company <span class=\"link\"><a class=\"link\" data-ylk=\"slk:looks to boost sales;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.cbsnews.com/news/mcdonalds-tariffs-hurting-sales/?ftag=YHF4eb9d17\" rel=\"nofollow noopener\" target=\"_blank\">looks to boost sales</a></span> as budget-conscious consumers pull back on spending.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Same-store sales at McDonald's outlets in the U.S. <span class=\"link\"><a class=\"link\" data-ylk=\"slk:declined 3.6% in the first quarter,;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.cbsnews.com/news/mcdonalds-tariffs-hurting-sales/?ftag=YHF4eb9d17\" rel=\"nofollow noopener\" target=\"_blank\">declined 3.6% in the first quarter,</a></span> the biggest drop since the COVID-19 pandemic closed stores nationwide. At the same time, traffic among low-income customers was down \"nearly double digits,\" CEO Chris Kempczinski said on the company's May earnings call, reflecting a customer base that the company acknowledged is still feeling the effects of inflation.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->McDonald's isn't the first fast-food chain to use promotions to drive business, but it has long been among the most adept at tweaking its menu and pricing, while its scale makes it a bellwether for customer tastes. In January, for example, it introduced <span class=\"link\"><a class=\"link\" data-ylk=\"slk:the McValue;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.cbsnews.com/news/mcdonalds-mcvalue-menu/?ftag=YHF4eb9d17\" rel=\"nofollow noopener\" target=\"_blank\">the McValue</a></span> menu, which includes the <a class=\"link\" data-ylk=\"slk:$5 meal deal;elm:context_link;itc:0;sec:content-canvas\" href=\"https://corporate.mcdonalds.com/corpmcd/our-stories/article/mcdonalds-kicks-off-summer-ofvalue-across-the-us.html?ftag=YHF4eb9d17\" rel=\"nofollow noopener\" target=\"_blank\">$5 meal deal</a>, along with a \"buy one, add one for $1\" deal, as the company leaned into affordable offerings.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->McDonald's is reacting to a number of economic and competitive pressures, said Matthew Todd, a director at S&amp;P Global Ratings. Chief among them is continuing to deliver value to low-income consumers in a time of economic uncertainty.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"This isn't anything new, but I think it's a continuation of this pursuit of regaining the consumers' trust,\" Todd said.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Sara Senatore, a research analyst at the Bank of America, told CBS MoneyWatch that McDonald's move to expand its affordable offerings is an attempt to \"stay relevant\" with low-income consumers, who are \"under much greater pressure than other cohorts.\"<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Other fast-food chains and restaurants also have seen weaker sales as consumers battered by higher prices and the general cost of living look to save cash. For McDonald's, which has over 13,500 <a class=\"link\" data-ylk=\"slk:locations;elm:context_link;itc:0;sec:content-canvas\" href=\"https://corporate.mcdonalds.com/corpmcd/franchising-overview.html?ftag=YHF4eb9d17\" rel=\"nofollow noopener\" target=\"_blank\">locations</a> nationwide, the difference now is it's not outperforming competitors as much as it once was, Senatore said.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"Their same-store sales versus their direct competitors have been much more similar than different,\" she said. \"Whereas, if you look at its long-term history, McDonald's has historically outpaced their competitors.\"<!-- HTML_TAG_END --></p> </div> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-1epmntv\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span></button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->McDonald's did not respond to CBS MoneyWatch's request for comment on the strategy behind its menu changes.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Return of the Snack Wrap<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Perhaps the most highly anticipated new menu item is the <a class=\"link\" data-ylk=\"slk:Snack Wrap;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.cbsnews.com/news/mcdonalds-snack-wrap-returns-july-2025/?ftag=YHF4eb9d17\" rel=\"nofollow noopener\" target=\"_blank\">Snack Wrap</a>, which is returning to McDonald's establishments nationwide on this week after a nine-year hiatus. The wrap, which consists of a white-flour tortilla filled with chicken, shredded lettuce and cheese, was nixed in 2016, sparking a social media campaign by fans lobbying for its return.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"Given that they're looking for sales drivers, it makes sense that they would go to their archives, if you will,\" Senatore said.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The revived Snack Wrap will come in two flavors — Ranch and Spicy — and will be priced at $2.99, <a class=\"link\" data-ylk=\"slk:according;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.axios.com/2025/07/08/mcdonalds-snack-wrap-spicy-mcmuffin?ftag=YHF4eb9d17\" rel=\"nofollow noopener\" target=\"_blank\">according</a> to a McDonald's spokesperson. The main protein will consist of chicken strips — easier to prepare, and thus less labor-intensive, than the type of chicken McD's previously used in the wrap, which required more cutting, Senatore explained.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Reviving the Snack Wrap is a strategic decision on McDonald's part given the item's cult following. Customers went so far ast to start a Change.org petition garnering more than 19,000 signatures urging McDonald's to bring back the Snack Wrap.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"Bringing back a product that customers really want to have come back, you typically have higher rate of success,\" Senatore said.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->McDonald's is also introducing a new take on its classic Egg McMuffin, with a trio of limited-time breakfast sandwiches featuring spicy pepper sauce. The new items coincide with the 50th anniversary of the Egg McMuffin, a McDonald's staple that consists of egg, cheese and Canadian bacon on an English muffin.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"Limited-time offerings are always something in the toolkit for quick service restaurants to drive traffic,\" Todd said.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Other menu tweaks include a new home for the Daily Double, one of McDonald's burger offerings. The Daily Double will now be part of the the McValue deal, where it will be bundled with fries, Chicken McNuggets, and a small soft drink for $6 or $7, depending on the location.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->McDonald's has also upped its chicken offerings. In May, the chain launched a new item called McCrispy Strips nationwide, the first time since 2021 McDonald's debuted a new permanent menu item in the U.S, according to a company <a class=\"link\" data-ylk=\"slk:statement;elm:context_link;itc:0;sec:content-canvas\" href=\"https://corporate.mcdonalds.com/corpmcd/our-stories/article/mcdonalds-takes-dipping-tothe-nextlevel-brand-new-mccrispy-stripsand-creamy-chili-dip.html?ftag=YHF4eb9d17\" rel=\"nofollow noopener\" target=\"_blank\">statement</a>.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Todd said McDonald's and other industry players are emphasizing chicken meals given its popularity and that it is significantly cheaper than beef, which <span class=\"link\"><a class=\"link\" data-ylk=\"slk:rose to record prices in May;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.cbsnews.com/news/beef-prices-record-highs-drought/?ftag=YHF4eb9d17\" rel=\"nofollow noopener\" target=\"_blank\">rose to record prices in May</a></span>.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"We've been seeing tons of chicken offerings, and just chicken... in general being very successful,\" he said.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Sneak peek: Who Killed Aileen Seiden in Room 15?;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.cbsnews.com/video/sneak-peek-who-killed-aileen-seiden-in-room-15/\" rel=\"nofollow noopener\" target=\"_blank\">Sneak peek: Who Killed Aileen Seiden in Room 15?</a><!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Everything we know so far about the deadly Texas floods;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.cbsnews.com/video/everything-we-know-so-far-about-the-deadly-texas-floods/\" rel=\"nofollow noopener\" target=\"_blank\">Everything we know so far about the deadly Texas floods</a><!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Justice Department sues California over transgender athletes;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.cbsnews.com/video/justice-department-sues-california-over-transgender-athletes/\" rel=\"nofollow noopener\" target=\"_blank\">Justice Department sues California over transgender athletes</a><!-- HTML_TAG_END --></p> </div>  </div>",
            "link": "https://finance.yahoo.com/news/snack-wrap-redux-mcds-refreshing-162834197.html",
            "pub_date": "2025-07-10 03:00:24",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Microsoft racks up over $500 million in AI savings while slashing jobs, Bloomberg News reports",
            "description": "<div class=\"body yf-1ir6o1g\"> <div class=\"atoms-wrapper\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->(Reuters) -Microsoft saved more than $500 million in its call centers alone last year by using artificial intelligence, Bloomberg News reported on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The tech giant last week announced plans to lay off nearly 4% of its workforce as it looks to rein in costs amid hefty investments in AI infrastructure. In May, the company had announced layoffs affecting around 6,000 workers.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->AI tools were helping improve productivity in segments from sales and customer service to software engineering and the company has begun using AI to handle interactions with smaller customers, Microsoft's Chief Commercial Officer Judson Althoff said during a presentation this week, according to the Bloomberg News report.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The nascent effort was already generating tens of millions of dollars, the report said, citing a person familiar with his comments.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->AI generated 35% of the code for new products, accelerating launch times, Althoff said, according to the report.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Microsoft did not immediately respond to a Reuters request for comment.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The Windows maker has earmarked $80 billion in capital spending this fiscal year, with most of it aimed at expanding data centers to ease capacity bottlenecks for artificial-intelligence services.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Big tech companies have been spending heavily on AI as they view the new technology as a major growth engine, while slashing costs elsewhere to safeguard profits.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->(Reporting by Juby Babu in Mexico City)<!-- HTML_TAG_END --></p> </div>  </div>",
            "link": "https://finance.yahoo.com/news/microsoft-racks-over-500-million-184531782.html",
            "pub_date": "2025-07-10 02:45:31",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Customers seeking deals gave Amazon's Prime Day and competing sales a solid start",
            "description": "<div class=\"body yf-1ir6o1g\"> <div class=\"atoms-wrapper\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->NEW YORK (AP) — The first day of <a class=\"link\" data-ylk=\"slk:Amazon's Prime Day event;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/amazon-prime-day-sales-july-8-9054c1cd3cb38b3bb30bc8269759c967\" rel=\"nofollow noopener\" target=\"_blank\">Amazon's Prime Day event</a> and competing retail sales that kicked off on Tuesday drove solid <a class=\"link\" data-ylk=\"slk:online spending;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/cyber-monday-sales-online-holiday-shopping-59d13c2e184cc10b17c3f0bdd7573323\" rel=\"nofollow noopener\" target=\"_blank\">online spending</a> compared to a year earlier, according to two data sources.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Adobe Digital Insights, which tracks visits to <a class=\"link\" data-ylk=\"slk:e-commerce sites;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/hub/e-commerce\" rel=\"nofollow noopener\" target=\"_blank\">e-commerce sites</a>, reported that U.S. consumers spent $7.9 billion at online stores on Tuesday, a 9.9% increase from the comparable day last year.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Retailers offered discounts in the range of 9% to 23%, on par with July 2024 sales events, Adobe said.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Shoppers appeared especially eager to <a class=\"link\" data-ylk=\"slk:take advantage of deals;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/amazon-prime-sales-tiktok-walmart-target-c6528ad3dd10750b9dfb1274a7ad349a\" rel=\"nofollow noopener\" target=\"_blank\">take advantage of deals</a> on appliances, electronics and home improvement products, the data company said. Online sales of appliances were 135% higher than last month's daily average, according to Adobe's data.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Back-to-school;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/hub/back-to-school\" rel=\"nofollow noopener\" target=\"_blank\">Back-to-school</a> items also were popular. Spending increased threefold on school supplies like backpacks, lunchboxes and stationery, and was two times higher for college dorm fixtures like mattresses, mini refrigerators and microwave over, Adobe said.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Amazon doubled the length of Prime Day to four days this year. <a class=\"link\" data-ylk=\"slk:Walmart;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/walmart-earnings-tariff-consumers-inflation-773f7de5081c40a98c98fbb293fa5f96\" rel=\"nofollow noopener\" target=\"_blank\">Walmart</a> also added two more days to its summer deals event, which started Tuesday as well.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Retail analysts are evaluating this week's sales for clues on whether President Donald Trump's trade policy and unpredictable <a class=\"link\" data-ylk=\"slk:tariffs;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/hub/tariffs\" rel=\"nofollow noopener\" target=\"_blank\">tariffs</a> affect prices and <a class=\"link\" data-ylk=\"slk:consumer behavior;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/inflation-economy-spending-a79d36a04c4ce1e264bc86098e4f5583\" rel=\"nofollow noopener\" target=\"_blank\">consumer behavior</a>.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Adobe noted that strong deals drove many shoppers to “trade up” to higher-ticket items. Across all categories the company tracks, the share of the most expensive goods increased by 20%, compared to average levels year to date.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->According to consumer data company Numerator, the average Prime Day order on Tuesday cost $58.37. However, the average household cost amounted to more than $106 as of 4 p.m. Eastern time because 42% of households participating in Prime Day placed more than two orders, the company said.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Numerator tracks U.S. retail prices through sales receipts, online account activity and other information from a panel of 200,000 shoppers.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Physical stores in the U.S. may see spillover traffic from online sales events this week as budget-minded customers comparison shop in search of the lowest prices, according to R.J. Hottovy, head of analytical research at Placer.ai. The location data company tracks people’s movements based on cellphone usage.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->“We do still have a price-sensitive consumer that is actively monitoring price hikes and anything related to tariffs,” Hottovy said.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Despite ongoing economic concerns, Adobe said it expected online sales to spur a record $23.8 billion in spending from July 8 to July 11, which would represent 28.4% growth year over year.<!-- HTML_TAG_END --></p> </div> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-1epmntv\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span></button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Adobe’s numbers are not adjusted for inflation. However, the company said new demand, not rising prices, largely accounts for growing sales figures so far this year.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Seattle-based Amazon does not disclose how much it earns during Prime Day but said it would share some results from the four-day event on Saturday<!-- HTML_TAG_END --></p> </div>  </div>",
            "link": "https://finance.yahoo.com/news/customers-seeking-deals-gave-amazons-184021818.html",
            "pub_date": "2025-07-10 02:40:21",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US extends deadline for fentanyl sanctions on three Mexican financial institutions",
            "description": "<div class=\"body yf-1ir6o1g\"> <div class=\"atoms-wrapper\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->MEXICO CITY (Reuters) -The U.S. Treasury said on Wednesday it had extended a deadline to September 4 for a prohibition on certain transactions involving three Mexican financial institutions hit by sanctions last month over alleged money laundering linked to fentanyl trafficking.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The actions apply to Mexico's CiBanco, Intercam Banco and Vector Casa de Bolsa, which the Treasury said were identified as \"primary money laundering concerns.\"<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"This decision is the result of dialogue and collaboration between the Mexican government and U.S. financial authorities,\" Mexico's finance ministry said in a statement following the announcement.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Mexico had previously balked at the sanctions, arguing that they were unilaterally applied by the U.S. without providing Mexico with any evidence to back up the money laundering claims.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Since the sanctions were announced, Mexico temporarily took over the three financial firms to protect creditors and depositors.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->(Reporting by Ana Isabel Martinez and Kylie Madry; editing by Stephen Eisenhammer and Natalia Siniawski)<!-- HTML_TAG_END --></p> </div>  </div>",
            "link": "https://finance.yahoo.com/news/us-extends-deadline-fentanyl-sanctions-183144541.html",
            "pub_date": "2025-07-10 02:31:44",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump's tariffs roiled the copper market — here's what analysts think happens next",
            "description": "<div class=\"body yf-1ir6o1g\"> <div class=\"atoms-wrapper\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->President Trump's threat to impose 50% tariffs on copper (<a class=\"link\" data-i13n=\"cpos:1;pos:1\" data-ylk=\"slk:HG=F;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/HG%3DF/history/\">HG=F</a>) roiled the market, with futures for the industrial metal stepping back from record highs Wednesday as industry insiders digested the potential impact.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"It's a crapshoot right now,\" American Pacific Mining (<a class=\"link\" data-i13n=\"cpos:2;pos:1\" data-ylk=\"slk:USGDF;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/USGDF/\">USGDF</a>) co-founder Eric Saderholm said. \"He's trying to get people to the [negotiating] table to a deal, but he's throwing the markets into a big tizzy right now because the price is artificially high.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->On Wednesday, copper futures fell 3% after rising over $5.60 per pound in the prior session.<!-- HTML_TAG_END --></p> <div class=\"loader default false tw-h-96 tw-mb-6 yf-1ym4pkb\" data-testid=\"skeleton-loader\"></div> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Copper imports have surged to record levels as importers rush to get ahead of the proposed tariffs. JPMorgan analysts said<a class=\"link\" data-i13n=\"cpos:3;pos:1\" data-ylk=\"slk:the US has brought in nearly a year's worth of copper;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.reuters.com/business/goldman-sachs-raises-baseline-tariff-forecast-us-copper-imports-50-2025-07-09/\" rel=\"nofollow noopener\" target=\"_blank\"> the US has brought in nearly a year's worth of copper</a> from abroad over the past six months. The rush follows a February executive order that designated copper a critical national security material, prompting a Commerce Department investigation into whether imports threaten domestic supply chains.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"The surging demand for US copper ahead of the looming tariffs has pushed domestic prices to a 25% premium over copper trading on the London Metal Exchange (LME),\" Adam Turnquist, chief technical strategist at LPL Financial, wrote in a note Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><em>Read more: </em><a class=\"link yahoo-link\" data-i13n=\"cpos:4;pos:1\" data-ylk=\"slk:The latest news and updates on Trump's tariffs;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/news/live/trump-tariffs-live-updates-the-latest-news-as-the-president-seeks-to-reshape-us-trade-policy-191201706.html\"><em>The latest news and updates on Trump's tariffs</em></a><!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"Furthermore, LME copper inventories have been significantly depleted, raising concerns about a global supply shortage outside the US,\" he added.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->In the short term, analysts expect imports to keep rising.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"Given the increased risk of a 50% tariff, we expect a further acceleration in shipments into the U.S. in the coming weeks,\" Goldman Sachs analysts said in a note Wednesday morning.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The analysts noted that while <a class=\"link yahoo-link\" data-i13n=\"cpos:5;pos:1\" data-ylk=\"slk:Trump's comment;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/news/trump-unveils-a-50-tariff-on-copper-and-threatens-to-impose-200-duties-on-pharmaceuticals-181231693.html?fr=sycsrp_catchall\">Trump's comment</a> on copper tariffs during a wide-ranging Cabinet meeting appeared improvised, the short timeline to implementation increases the likelihood that the full 50% rate will be enacted.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"Accordingly, we revise our baseline expectation to a 50% tariff on U.S. copper imports, up from 25% previously. That said, this higher rate may ultimately serve as a negotiating anchor, followed by exemptions or concessions,\" Goldman Sachs analysts said.<!-- HTML_TAG_END --></p> <div class=\"loader default false tw-h-96 tw-mb-6 yf-1ym4pkb\" data-testid=\"skeleton-loader\"></div> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Industry experts say the US currently imports about 50% of the copper it needs for use across an array of industries, from construction to autos to data centers.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The United States' need for copper imports stems from a lack of necessary facilities to process and recycle enough of the metal domestically to meet demand. Saderholm said the US needs to invest in more infrastructure to produce more copper internally.<!-- HTML_TAG_END --></p> </div> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-1epmntv\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span></button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"The issue lies in the fact that we have three operating copper smelters in the entire country, which is pretty undersized for what we need,\" he said, noting China has roughly five times that amount.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Smelters require years of permitting and billions in capital, with typical buildouts taking 10 to 15 years. If tariffs are short-lived, analysts question whether that level of investment will materialize.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-1gfnohs loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-1gfnohs\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"Trump directed the Commerce Department to open an investigation into potential tariffs for copper imports earlier this year. (Photo by Alex Wong/Getty Images)\" class=\"yf-1gfnohs loader\" height=\"640\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Trump directed the Commerce Department to open an investigation into potential tariffs for copper imports earlier this year. (Alex Wong/Getty Images)<!-- HTML_TAG_END --> <span class=\"caption-separator yf-8xybrv\" data-svelte-h=\"svelte-nxhdlu\">·</span> <span>Alex Wong via Getty Images</span></figcaption> </figure> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><em>Ines Ferre is a senior business reporter for Yahoo Finance. Follow her on X at </em><a class=\"link\" data-i13n=\"cpos:6;pos:1\" data-ylk=\"slk:@ines_ferre;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://twitter.com/ines_ferre\" rel=\"nofollow noopener\" target=\"_blank\"><em>@ines_ferre</em></a><em>.</em><!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:7;pos:1\" data-ylk=\"slk:Click here for in-depth analysis of the latest stock market news and events moving stock prices;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/topic/stock-market-news/\"><strong>Click here for in-depth analysis of the latest stock market news and events moving stock prices</strong></a><!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:8;pos:1\" data-ylk=\"slk:Read the latest financial and business news from Yahoo Finance;cpos:8;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/news/\"><strong>Read the latest financial and business news from Yahoo Finance</strong></a><!-- HTML_TAG_END --></p> </div>  </div>",
            "link": "https://finance.yahoo.com/news/trumps-tariffs-roiled-the-copper-market--heres-what-analysts-think-happens-next-183134393.html",
            "pub_date": "2025-07-10 02:31:34",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Achtung! Germany's Mercedes, Porsche stung by Trump's auto tariffs",
            "description": "<div class=\"body yf-1ir6o1g\"> <div class=\"atoms-wrapper\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->German luxury stalwarts Mercedes-Benz (<a class=\"link\" data-i13n=\"cpos:1;pos:1\" data-ylk=\"slk:MBGAF;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/MBGAF\">MBGAF</a>) and Porsche (<a class=\"link\" data-i13n=\"cpos:2;pos:1\" data-ylk=\"slk:P911.DE;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/P911.DE\">P911.DE</a>) usually count on the US for a sizable portion of their sales — approximately 25% for both automakers. But those days could be over, at least for the time being.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Earlier this week, <a class=\"link\" data-i13n=\"cpos:3;pos:1\" data-ylk=\"slk:Mercedes reported;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://media.mercedes-benz.com/article/fa619730-0e40-4937-a817-d82f70d961a5\" rel=\"nofollow noopener\" target=\"_blank\">Mercedes reported</a> second quarter global car sales fell 9% to 453,700 units, with US sales down 12% compared to a year ago.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->\"Deliveries to dealerships were carefully calibrated to navigate new global tariff policies, impacting sales of Mercedes-Benz Cars in the U.S. and China in particular,\" Mercedes said in a statement. The Trump administration implemented 25% auto sector tariffs on all imports starting in early April.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Interestingly, sales in Germany and Europe at large climbed 7% and 1%, respectively, with \"rest of world,\" encompassing regions like the Middle East, Africa, and South America, jumping 24%.<!-- HTML_TAG_END --></p> <div class=\"loader default false tw-h-96 tw-mb-6 yf-1ym4pkb\" data-testid=\"skeleton-loader\"></div> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->The company's crosstown Stuttgart rival, Porsche, also reported sliding sales, with global deliveries down 6% to 146,391 units.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Porsche noted that US sales actually climbed 10% in the quarter, but there was a big caveat: \"The increase is mainly due to higher product availability in the market and the price protection offered in the first half of the year due to increased import tariffs,\" Porsche said in a statement.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Essentially, Porsche is admitting that it relied on pre-tariff inventory to boost sales and subsequently ate into its profit margins by price-protecting its customers — at least for now.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><em>Read more: </em><a class=\"link yahoo-link\" data-i13n=\"cpos:4;pos:1\" data-ylk=\"slk:How to find the best luxury car insurance;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/personal-finance/insurance/article/luxury-car-insurance-185353907.html\"><em>How to find the best luxury car insurance</em></a><!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Porsche is in a uniquely troubling situation as its production is all done in Germany and EU countries like Slovenia. Mercedes's exposure is not as acute, as the automaker has a major factory in Tuscaloosa, Ala., where the automaker makes its SUVs and some EVs.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->As for Porsche, company CEO Oliver Blume (who is also CEO of Volkswagen Group) said Porsche will likely <a class=\"link yahoo-link\" data-i13n=\"cpos:5;pos:1\" data-ylk=\"slk:pass tariff costs;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/news/porsche-stock-slides-on-profit-forecast-company-may-pass-tariff-costs-on-to-customers-190420420.html\">pass tariff costs</a> on to its customers, but he did not say when. Mercedes said this spring that it would price-protect and <a class=\"link\" data-i13n=\"cpos:6;pos:1\" data-ylk='slk:absorb \"some\" tariff costs;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas' href=\"https://www.mercedesbenzofdenver.com/tariff-faqs.htm\" rel=\"nofollow noopener\" target=\"_blank\">absorb \"some\" tariff costs</a> for 2025 models, at least for now. One way automakers can maintain current pricing but pass on tariff costs to buyers is by, for example, eliminating certain incentives.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-1gfnohs loader\" style=\"--max-height: 642px;\"> <div class=\"image-wrapper yf-1gfnohs\" style=\"--aspect-ratio: 960 / 642; --img-max-width: 960px;\"><img alt=\"12 March 2024, Saxony, Leipzig: Oliver Blume, Chairman of the Executive Board of Porsche, speaks during the company&amp;#39;s annual press conference at the Leipzig plant. The sports and off-road vehicle manufacturer Porsche published its business figures for the past year on the same day. Photo: Jan Woitas/dpa (Photo by Jan Woitas/picture alliance via Getty Images)\" class=\"yf-1gfnohs loader\" height=\"642\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Passing the cost of tariffs onto consumers? Oliver Blume, chair of the executive board of Porsche. (Jan Woitas/picture alliance via Getty Images)<!-- HTML_TAG_END --> <span class=\"caption-separator yf-8xybrv\" data-svelte-h=\"svelte-nxhdlu\">·</span> <span>picture alliance via Getty Images</span></figcaption> </figure> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Spokespeople for Mercedes and Porsche did not immediately respond when reached for comment on US pricing.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Germany's auto sector represents a <a class=\"link\" data-i13n=\"cpos:7;pos:1\" data-ylk=\"slk:big portion of the country's economy;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.motorfinanceonline.com/features/germanys-auto-sector-faces-structural-shifts-as-sales-decline/\" rel=\"nofollow noopener\" target=\"_blank\">big portion of the country's economy</a>, and Germany as a whole is one of the key cogs in the EU's total industrial production. That's why the EU is feverishly negotiating with US negotiators to strike a deal. <a class=\"link\" data-i13n=\"cpos:8;pos:1\" data-ylk=\"slk:Politico;cpos:8;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.politico.eu/article/us-eu-tariff-deal-donald-trump-trade-agreement/\" rel=\"nofollow noopener\" target=\"_blank\">Politico</a> reported that the US offered the EU a 10% tariff deal — similar to the one struck with the UK — though major caveats remain.<!-- HTML_TAG_END --></p> </div> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-1epmntv\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span></button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Time is of the essence for the EU to strike a deal for the German luxury brands because pre-tariff inventory is likely exhausted, and eating into shrinking profit margins can only last so long.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->And it's not just Germany's luxury names that are suffering — its biggest automaker is hurting too.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Germany's Volkswagen, the world's No. 2 automaker by volume, also reported global sales climbed 1.2% in Q2 but <a class=\"link\" data-i13n=\"cpos:9;pos:1\" data-ylk=\"slk:dropped 29% in the US;cpos:9;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://media.vw.com/releases/1874\" rel=\"nofollow noopener\" target=\"_blank\">dropped 29% in the US</a> compared to a year ago.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><em>Pras Subramanian is the lead auto reporter for Yahoo Finance. You can follow him on</em><a class=\"link\" data-i13n=\"cpos:10;pos:1\" data-ylk=\"slk:X;cpos:10;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://twitter.com/Pras_S\" rel=\"nofollow noopener\" target=\"_blank\"><em> X</em></a><em> and on</em><a class=\"link\" data-i13n=\"cpos:11;pos:1\" data-ylk=\"slk:Instagram;cpos:11;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.instagram.com/pras_s/\" rel=\"nofollow noopener\" target=\"_blank\"><em> Instagram</em></a><em>.</em><!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:12;pos:1\" data-ylk=\"slk:Click here for the latest stock market news and in-depth analysis, including events that move stocks;cpos:12;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/topic/stock-market-news/\"><strong>Click here for the latest stock market news and in-depth analysis, including events that move stocks</strong></a><!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:13;pos:1\" data-ylk=\"slk:Read the latest financial and business news from Yahoo Finance;cpos:13;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/news/\"><strong>Read the latest financial and business news from Yahoo Finance</strong></a><!-- HTML_TAG_END --></p> </div>  </div>",
            "link": "https://finance.yahoo.com/news/achtung-germanys-mercedes-porsche-stung-by-trumps-auto-tariffs-181748357.html",
            "pub_date": "2025-07-10 02:17:48",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Factbox-Trump's tariffs: What's in effect and what could be in store?",
            "description": "<div class=\"body yf-1ir6o1g\"> <div class=\"atoms-wrapper\"> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->WASHINGTON (Reuters) -U.S. President Donald Trump has launched a global trade war with an array of tariffs that target individual products and countries.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Trump has set a baseline tariff of 10% on all imports to the United States, as well as additional duties on certain products or countries.<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Here is a list of targeted tariffs he has implemented or threatened to put in place.<!-- HTML_TAG_END --></p>  <p class=\"yf-1090901\"><!-- HTML_TAG_START -->PRODUCT TARIFFS IN EFFECT<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Steel and aluminum - 50%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Autos and auto parts - 25%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->PRODUCT TARIFFS - THREATENED<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Copper - 50%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Pharmaceuticals - up to 200%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Semiconductors - 25% or higher<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Movies - 100%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Timber and lumber<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Critical minerals<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Aircraft, engines and parts<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->COUNTRY TARIFFS IN EFFECT<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Canada - 10% on energy products, 25% for other products not covered by the U.S.-Canada-Mexico Agreement<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Mexico - 25% for products not covered by USMCA<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->China - 30%, with additional tariffs on some products<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->United Kingdom - 10%, with some auto and metal imports exempt from higher global rates<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Vietnam - 20% for some products, 40% on transshipments from third countries<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->COUNTRY TARIFFS THREATENED TO TAKE EFFECT AUGUST 1<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Algeria 30%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Bangladesh 35%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Bosnia and Herzegovina 30%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Brunei 25%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Cambodia 36%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Indonesia 32%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Iraq 30%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Japan 25%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Kazakhstan 25%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Laos 40%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Libya 30%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Malaysia 25%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Moldova 25%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Myanmar 40%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Philippines 20%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Serbia 35%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Sri Lanka 30%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->South Africa 30%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->South Korea 25%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Thailand 36%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->Tunisia 25%<!-- HTML_TAG_END --></p> <p class=\"yf-1090901\"><!-- HTML_TAG_START -->(Reporting by Andy Sullivan; Editing by Cynthia Osterman)<!-- HTML_TAG_END --></p> </div>  </div>",
            "link": "https://finance.yahoo.com/news/factbox-trumps-tariffs-whats-effect-180558917.html",
            "pub_date": "2025-07-10 02:05:58",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        }
    ]
}