{
    "data": [
        {
            "title": "Instant View: China announces tit-for-tat tariffs as US levies come into effect Trump's additional 10% tariff across all Chinese imports into the U.S. came into effect at 12:01 a.m. ET on Tuesday (0501 GMT).  On Monday, Trump suspended his threat of 25% tariffs on Mexico and Canada at the last minute, agreeing to a 30-day pause in return for concessions on border and crime enforcement with the two neighbouring countries. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - Beijing immediately responded to new U.S. tariffs on Tuesday, renewing a trade war between the world's top two economies as President Donald Trump sought to punish China for not halting the flow of illicit drugs.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump's additional 10% tariff across all Chinese imports into the U.S. came into effect at 12:01 a.m. ET on Tuesday (0501 GMT).<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->On Monday, Trump suspended his threat of 25% tariffs on Mexico and Canada at the last minute, agreeing to a 30-day pause in return for concessions on border and crime enforcement with the two neighbouring countries.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->COMMENTS:<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->JEFF NG, HEAD OF ASIA MACRO STRATEGY, SMBC, SINGAPORE<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"The situation is still very fluid. I'm anticipating heightened uncertainty, dollar strength and USDCNH above 7.40.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->KENNY NG, STRATEGIST, CHINA EVERBRIGHT SECURITIES INTERNATIONAL, HONG KONG<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"China announced an increase in tariffs on some imported goods from the United States, raising market concerns about a worsening trade war between China and the U.S., leading to a significant narrowing of gains in Hong Kong stocks.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"In the short term, China and the U.S. will engage in consultations, and the related uncertainties may continue to trouble the market. However, as this factor gradually becomes clearer, I believe the investment market is likely to emerge from the shadow of the China-U.S. trade conflict.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"I expect Hong Kong stocks to continue to trend upward with volatility, potentially testing the resistance range of 21,000 to 21,300 within the month.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->GARY NG, SENIOR ECONOMIST, NATIXIS, HONG KONG<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Unlike Canada and Mexico, it is clearly harder for the U.S. and China to agree on what Trump demands economically and politically. The previous market optimism on a quick deal still looks uncertain. Even if the two countries can agree on some issues, it is possible to see tariffs being used as a recurrent tool, which can be a key source of market volatility this year. At the same time, China has opted for a more targeted approach in tariffs, export control, and market access restriction, basically flexing its muscles as one of the biggest markets and producers.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Vidya Ranganathan and Ankur Banerjee; Editing by Jacqueline Wong)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/instant-view-china-announces-tit-054747192.html",
            "pub_date": "2025-02-04 13:47:47",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Analysis-Europe's AI bulls pin hopes on 'Jevons Paradox' after DeepSeek rout Artificial intelligence bulls in Europe are dusting off a 160-year-old economic theory to explain why the boom in the sector's stocks may have further to run, despite the emergence of China's cheap AI model DeepSeek.  At the heart of the selloff was U.S. advanced chipmaker and AI poster-child Nvidia, which lost 17% of its value, or close to $600 billion, in the largest one-day drop in market capitalisation for any company on record.  Since then, tech stocks have rebounded, with European markets hitting new highs, and a 19th century economic theory is suddenly on everyone's lips: the Jevons Paradox. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Lucy Raitano<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->LONDON (Reuters) - Artificial intelligence bulls in Europe are dusting off a 160-year-old economic theory to explain why the boom in the sector's stocks may have further to run, despite the emergence of China's cheap AI model DeepSeek.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Tech stocks worldwide plunged on Jan. 27 after the launch of DeepSeek - apparently costing a fraction of rival AI models and requiring less sophisticated chips - raised questions over the West's huge investments in chipmakers and data centres.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->At the heart of the selloff was U.S. advanced chipmaker and AI poster-child Nvidia, which lost 17% of its value, or close to $600 billion, in the largest one-day drop in market capitalisation for any company on record.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Since then, tech stocks have rebounded, with European markets hitting new highs, and a 19th century economic theory is suddenly on everyone's lips: the Jevons Paradox.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Named after English economist William Stanley Jevons, it posits that when a resource becomes more efficient to use, demand can increase - rather than decrease - as the price to use the resource drops.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"I hadn’t discussed it until Monday (last week), and then suddenly it’s everywhere,\" said Helen Jewell, Chief Investment Officer at BlackRock Fundamental Equities, EMEA.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"This paradox highlights one of the uncertainties at the moment,\" said Jewell, flagging that a key question for European stock-pickers is whether data centres and their suppliers will be less in demand.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"One of the big question marks from (last) Monday’s news is how much energy is going to be needed for the AI revolution?\"<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The selloff hit direct and indirect AI plays alike. Dutch semiconductor equipment maker ASML, and sector peers ASMI and BE Semi all fell 7%-12% on Jan. 27, before recouping losses later in the week, as did Siemens Energy, which provides hardware for AI infrastructure.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Jevons Paradox strikes again!\" Microsoft chief executive Satya Nadella said in a post on X.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"As AI gets more efficient and accessible, we will see its use skyrocket, turning it into a commodity we just can't get enough of.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->THE NEW BUZZWORD<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->On Friday, Tomasz Godziek, portfolio manager of the Tech Disruptors fund at J. Safra Sarasin Sustainable Asset Management, said lower AI costs could exemplify the Jevons Paradox.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Ultimately, this could fuel a new wave of AI investment, creating fresh opportunities, particularly in software and inference technologies,\" Godziek said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Portfolio managers at Thematics Asset Management, an affiliate of Natixis IM, cited Jevons Paradox as one reason they believe demand for AI chips may remain healthy.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Mark Hawtin, head of the Liontrust global equities team, also said his investment thesis on AI was reinforced by the news on Jan. 27, flagging the paradox.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Everyone has become an expert on Jevons Paradox,\" said Aviva Investors portfolio manager Kunal Kothari, who manages a UK equity income fund with around 2 billion pounds ($2.5 billion) in assets.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"The falling cost of improved productivity through GenAI will likely benefit companies in the UK market generally, as they will predominantly be consumers of these technologies,\" he added, pointing to data and software names like RELX, LSEG, Experian and Sage as likely beneficiaries.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->DATA CENTRE NEEDS IN FOCUS<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The need for data centres and the vast amounts of power required to run them has driven a lot of AI investing in Europe already, given that there aren't any homegrown rivals to the likes of Nvidia, whose shares have rocketed by about 200% in under two years.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"There is an implicit assumption that the adoption and usage of AI would require increasingly more chips, and more data centre capacity and power consumption,\" said Kasper Elmgreen, CIO of fixed income and equities at Nordea Asset Management.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"What DeepSeek has done is to question what is required from that route and what can be delivered by making much better software.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Not everyone is convinced of the new rationale, including Jordan Rochester, head of FICC strategy at Mizuho EMEA.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Whilst many Nvidia optimists pointed to Jevons Paradox to help them sleep better at night ... it was less convincing in the short term after what has been a meteoric rise in Nvidia shares,\" he wrote in a note.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->($1 = 0.8122 pounds)<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Lucy Raitano. Editing by Amanda Cooper and Mark Potter)<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/analysis-europes-ai-bulls-pin-053838384.html",
            "pub_date": "2025-02-04 13:38:38",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's finance ministry announces tariffs to counter Trump trade moves China's finance ministry on Tuesday announced a package of tariffs on a range of U.S. products in an immediate response to a 10% tariff on Chinese imports announced by U.S. President Donald Trump that went into effect at 0501 GMT. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->BEIJING (Reuters) - China's finance ministry on Tuesday announced a package of tariffs on a range of U.S. products in an immediate response to a 10% tariff on Chinese imports announced by U.S. President Donald Trump that went into effect at 0501 GMT.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Beijing newsroom; Writing by Greg Torode; Editing by Christian Schmollinger)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/chinas-finance-ministry-announces-tariffs-052845300.html",
            "pub_date": "2025-02-04 13:28:45",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump 10% Tariffs on China Set to Take Effect as Deadline Passes (Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergNew York’s First ‘Passive House’ School Is a Model of Downtown DensityState Farm Seeks Emergency California Rate Hike After LA FiresWhen French Communists Went on a Brutalist Building BoomTrump Paves the Way to Deputize Local Police on ImmigrationHow the 2025 Catholic Jubilee Is Reshaping RomeThe US has imposed a 10% tariff on all Chinese goods, firing the opening shot of a fresh trad ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:New York’s First ‘Passive House’ School Is a Model of Downtown Density;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-02/brooklyn-gets-nyc-s-first-passive-house-certified-school-building?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">New York’s First ‘Passive House’ School Is a Model of Downtown Density</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:State Farm Seeks Emergency California Rate Hike After LA Fires;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-03/state-farm-seeks-emergency-california-rate-hike-after-la-fires?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">State Farm Seeks Emergency California Rate Hike After LA Fires</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:When French Communists Went on a Brutalist Building Boom;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-01/new-book-explores-brutalist-architecture-of-france-s-communist-party?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">When French Communists Went on a Brutalist Building Boom</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Trump Paves the Way to Deputize Local Police on Immigration;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-30/texas-florida-prep-for-local-police-collaboration-with-ice-on-immigration?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Trump Paves the Way to Deputize Local Police on Immigration</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:How the 2025 Catholic Jubilee Is Reshaping Rome;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-30/rome-s-jubilee-brings-a-wave-of-public-space-and-traffic-projects?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">How the 2025 Catholic Jubilee Is Reshaping Rome</a><!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The US has imposed a 10% tariff on all Chinese goods, firing the opening shot of a fresh trade war with Beijing even as President Donald Trump plans to hold talks with his counterpart Xi Jinping.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A midnight deadline in the US for the duties to go into effect passed on Tuesday, hours after Trump reached separate agreements with the leaders of Canada and Mexico to delay 25% duties for a month. In an executive order on Saturday, Trump called on China’s Communist Party to stop criminal organizations facilitating the flow of illicit drugs.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The failure to reach a compromise or stall the implementation of the tariffs raises the threat of a spiraling escalation that could decimate US trade with a Chinese economy heavily reliant on exports. Bloomberg Economics had estimated the US average tariff rate would go up by 1.4 percentage points should the duties on China go into effect.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“If we can’t make a deal with China, then the tariffs will be very, very substantial,” Trump said earlier.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China’s reaction to Trump’s initial tariff announcement — coming in the middle of a weeklong Lunar New Year holiday — was relatively muted. The Commerce Ministry issued a statement expressing strong “dissatisfaction” and vowed unspecified “corresponding countermeasures,” while saying China would file a complaint at the World Trade Organization.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Economists at Nomura Holdings Inc. estimate the US increase in China duties alone makes it the biggest single tariff hike that Trump has enacted in either of his presidential terms.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump agreed to last-minute delays with Mexico and Canada in return for tougher measures against migration and drug trafficking at the border. For Beijing, a deal for splitting ownership of China-owned app TikTok would likely also be on the agenda of any leaders’ call.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg Businessweek<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Elon Musk Inside the Treasury Department Payment System;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-02/elon-musk-gets-inside-treasury-department-payment-system?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Elon Musk Inside the Treasury Department Payment System</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The Internet Almost Killed Barnes &amp; Noble, Then Saved It;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-30/barnes-noble-sales-are-growing-again-thanks-to-booktok-buzz?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The Internet Almost Killed Barnes &amp; Noble, Then Saved It</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Indy Pass, the Anti-Vail Seasonal Ski Ticket, Is Gaining Fans;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-01-29/indy-pass-the-alternative-to-vail-seasonal-ski-ticket-is-gaining-fans?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Indy Pass, the Anti-Vail Seasonal Ski Ticket, Is Gaining Fans</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:What America’s Tech Billionaires Really Bought When They Backed Donald Trump;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-01-27/what-tech-billionaires-want-from-trump-s-presidency?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">What America’s Tech Billionaires Really Bought When They Backed Donald Trump</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Musk Pitches New Narrative as Tesla Sales Fall;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-28/podcast-musk-pitches-new-narrative-as-tesla-sales-fall?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Musk Pitches New Narrative as Tesla Sales Fall</a><!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->©2025 Bloomberg L.P.<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/trump-10-tariffs-china-set-050149669.html",
            "pub_date": "2025-02-04 13:01:49",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Maker of Scotland’s ‘other’ national drink is beating expectations The latest trading update from AG Barr reads well. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 600px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 600; --img-max-width: 960px;\"><img alt=\"Bottles of Irn-Bru drink, produced by drinks manufacturer A.G. Barr, are displayed in a supermarket in London\" class=\"yf-g633g8 loader\" height=\"600\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Bottles of Irn-Bru drink, produced by drinks manufacturer A.G. Barr, are displayed in a supermarket in London<!-- HTML_TAG_END --> </figcaption> </figure> <blockquote class=\"neo-blockquote yf-1ba2ufg\"><p class=\"yf-1ba2ufg\"><!-- HTML_TAG_START --><em>Questor is The Telegraph’s stockpicking column, helping you decode the markets and offering insights on where to invest.</em><!-- HTML_TAG_END --></p> </blockquote> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The latest trading update from AG Barr reads well.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->For the year to January 2025, sales are up, profit margins are expanding faster than analysts expected and cash flow remains strong, even as the Scottish company continues to invest in capacity and its supply chains.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company looks poised to make record profits in the year to January 2025 and follow up with a further advance in 2026 as those investments in the business start to pay off – and such a picture merits further support, even as the shares trade close to their five-year highs.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The key to the investment case for AG Barr;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/investing/stocks-shares/ag-barr-irn-bru-maker-share-tips/\" rel=\"nofollow noopener\" target=\"_blank\">The key to the investment case for AG Barr</a> remains its efforts to rebuild profit margins after a torrid series of challenges and cost pressures over the past five years. It is therefore pleasing to see Euan Sutherland, its chief executive, report that the FTSE 250 index member’s operating margin rose to 13.5pc in the year to January, exceeding analysts’ consensus forecast of 13.2pc and last year’s 12.3pc mark.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The return on sales is still below 2018’s peak of 17.1pc but the plan is that profit margins will expand as sales increase and cost efficiencies are realised from the integration of the Boost acquisition and a switch in sales channels.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->All other things being equal, improved profits should boost cash flow and that will bolster AG Barr’s already healthy balance sheet, which carries a net cash pile of more than £60m, with a pension surplus for good measure.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Such solid finances permit AG Barr to invest in and protect its competitive position in the face of multiple challenges and also reward shareholders for their support with dividends. Analysts expect a 10pc increase in the total dividend to 16.5p for the year to January 2025, with a further 12pc advance to 18.3p in the coming year.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Those figures equate to forecast forward dividend yields of 2.7pc and 3.0pc, respectively.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->They may not catch the eye of income-seekers, given that 10-year gilts yield 4.6pc. But over the past decade, AG Barr has still paid out 108p a share in dividends – despite Covid and lockdowns – and the next two years alone offer the prospect of a nearly 35p a share in additional payments.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Dunbartonshire-based company may therefore merit further patient support from investors. The shares do not look like an outright bargain on 18 times earnings for fiscal 2025 – but 14 times for 2026 looks more enticing, if analysts’ profit forecasts prove accurate, given the earnings momentum, margin profile, cash flow and rock-solid balance sheet.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Questor says: buy</strong><br/><strong>Ticker: BAG</strong><br/><strong>Share price: 618p</strong><!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Update: Hargreaves Services<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Relying on government policy to translate smoothly into investment portfolio profits is rarely wise, given the scope for delays, poor execution and political U-turns. But if any company neatly taps into the themes currently championed by the Labour administration it may just be Hargreaves Services.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Durham-headquartered company is an expert in long-term infrastructure projects and the regeneration of brownfield land for commercial or residential property development, and its latest interim results suggest it is capitalising on these skills.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->First-half sales, profits and dividends were all up. Management stated that revenues for the full year to May 2025 looked set to exceed forecasts, thanks to strong demand in services, where framework contracts on projects such as the <a class=\"link\" data-ylk=\"slk:Lower Thames Crossing project;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/news/2024/01/15/thames-crossing-plan-uk-biggest-planning-application/\" rel=\"nofollow noopener\" target=\"_blank\">Lower Thames Crossing project</a> and the Sizewell C nuclear power plant underpin much of the activity.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A delay in the completion of a residential land sale near Edinburgh means annual profits will match consensus forecasts, but excellent visibility from the services arm and a return to the black at a German joint venture in raw materials and recycling – HRMS – helped management to increase the interim dividend by nearly 3pc to 18.5p a share.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The only slight concern is valuation. The shares trade at a 10-year high and above the first-half <a class=\"link\" data-ylk=\"slk:net asset value (Nav);elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/investing/stocks-shares/book-value-what-is-how-calculate-it/\" rel=\"nofollow noopener\" target=\"_blank\">net asset value (Nav)</a> per share figure of 580p, after a lengthy period of trading at a hefty discount. Growth in Nav has stalled a little but higher interest rates will have had a role to play there. Lower borrowing costs and further increases in profitability could help Nav resume its growth trajectory.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Moreover, if Hargreaves Services repeats the interim dividend at the final stage, that would give a total distribution for the year to May 2025 of 37p a share. That equates to a dividend yield of 5.6pc, so investors can wait patiently for Hargreaves Services to optimise returns from its multi-year infrastructure deals and land bank.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Questor says: hold</strong><br/><strong>Ticker: HSP:AIM</strong><br/><strong>Share price: 624p</strong><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em>Read the latest Questor column on </em><a class=\"link\" data-ylk=\"slk:telegraph.co.uk;elm:context_link;itc:0;sec:content-canvas\" href=\"http://telegraph.co.uk/\" rel=\"nofollow noopener\" target=\"_blank\"><em>telegraph.co.uk</em></a><em> every weekday at 5am. Read Questor’s </em><a class=\"link\" data-ylk=\"slk:rules of investment;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/investing/stocks-shares/questor-follow-rules-investing-avoid-hit-next-conviviality/\" rel=\"nofollow noopener\" target=\"_blank\"><em>rules of investment</em></a><em> before you follow our tips.</em><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/customer/subscribe/01doysa/\" rel=\"nofollow noopener\" target=\"_blank\"><b>Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.</b></a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/maker-scotland-other-national-drink-050000275.html",
            "pub_date": "2025-02-04 13:00:00",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Accel backs Indian AI startup building 'ChatGPT for presentations' Presentations.ai, an Indian startup that uses AI to help companies quickly generate presentation decks, has raised $3 million in a seed round led by Accel to scale its software that has emerged from beta after amassing millions of users. Presentations are ubiquitous throughout a business journey — whether a large corporation or a startup — to acquire new customers, update investors, and communicate milestones internally. Yet, businesses still struggle, spending hours cracking compelling presenta ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Presentations.ai;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.presentations.ai/\" rel=\"nofollow noopener\" target=\"_blank\">Presentations.ai</a>, an Indian startup that uses AI to help companies quickly generate presentation decks, has raised $3 million in a seed round led by Accel to scale its software that has emerged from beta after amassing millions of users.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Presentations are ubiquitous throughout a business journey — whether a large corporation or a startup — to acquire new customers, update investors, and communicate milestones internally. Yet, businesses still struggle, spending hours cracking compelling presentations, which is even more critical when targeting clients or investors.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"People struggle to take the first draft of a presentation,\" said Sumanth Raghavendra, co-founder and CEO of Presenations.ai, in an exclusive interview.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Bengaluru-based startup has made that easier with its AI-powered platform, used by over 5 million people worldwide since its public beta launch in 2023, according to the company. \"We want to be the ChatGPT for presentation. Think about making a presentation using AI, using that same construct that ChatGPT operates under,\" Raghavendra told TechCrunch.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt='&lt;span class=\"wp-element-caption__text\"&gt;Presentations.ai team, with Sumanth Raghavendra on the far right in the second row (in a green shirt)&lt;/span&gt;&lt;span class=\"wp-block-image__credits\"&gt;&lt;strong&gt;Image Credits:&lt;/strong&gt;Presentations.ai&lt;/span&gt;' class=\"yf-g633g8 loader\" height=\"640\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START --><span class=\"wp-element-caption__text\">Presentations.ai team, with Sumanth Raghavendra on the far right in the second row (in a green shirt)</span><span class=\"wp-block-image__credits\"><strong>Image Credits:</strong>Presentations.ai</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Founded in 2019, Presentations.ai saw ChatGPT's emergence in late 2022 as the moment to come out of stealth and start onboarding new users. The startup amassed a million users within three months of its public beta and is currently making \"millions of dollars\" in profit, Raghavendra said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Before Presentations.ai, Raghvendra founded Deck App Technologies, which developed an app to help people create business content using smartphones. However, he noted that the earlier venture had a \"limited degree of success\" as mobile devices did not become an instrument to create content other than videos.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Over the years, Raghvendra said that his team had created IPs around building presentations that helped Presentations.ai to emerge as a competitive player even in the crowded space where both <a class=\"link\" data-ylk=\"slk:startups;elm:context_link;itc:0;sec:content-canvas\" href=\"https://techcrunch.com/2022/04/20/prezent-ai-secures-20m-to-gamify-deck-presentations/\">startups</a> and even <a class=\"link\" data-ylk=\"slk:big tech companies;elm:context_link;itc:0;sec:content-canvas\" href=\"https://techcrunch.com/2019/09/25/microsoft-launches-its-ai-presentation-coach-for-powerpoint/\">big tech companies</a> like Google and Microsoft are trying to ease presentation-building using generative AI.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Because we have been doing this for so many years, I'm fairly confident that we are far ahead of anybody else, and the proof of the pudding for us is that a lot of users who come in pay us to use our software. They have typically tried other competitors, including whatever Google or Microsoft has,\" Raghvendra asserted.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->After gaining initial traction, the startup transitioned from a completely free experience for beta testers into a freemium offering in early 2024. Since then, Raghvendra told TechCrunch it has \"tens of thousands\" of paying users who pay for its service, starting at an annual price of $200 per user in the U.S., with different tiers and localized pricing across markets.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The startup utilizes \"frontier\" LLMs along with its own small language models created for specific tasks, such as deciding which chart best fits a particular topic. It also uses text-to-image models Flux and Stable Diffusion to help users quickly generate images to be used in the presentations with prompts.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Presentations.ai provides tools including theme palettes and presentation styles to generate decks based on user preferences. It also offers features including an AI-powered design assistant to create presentations based on different ideas, sharing and real-time sync, and multilingual support.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Similarly, the startup provides brand templates to match the style of users' particular brands. It also lets people export their presentations to a PowerPoint file for further editing or as a PDF.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Presentations.ai specifically includes \"guardrails\" to assure enterprise customers it has a high bar against the competition. These guardrails, Raghvendra said, are built using the data pipelines the startup has built over time to restrict hallucination, the colloquial term of AI-generated inaccurate or misleading content. The platform also lets enterprises restrict access to sensitive data they do not want to be shared with other users, such as the financial information with the CFO that the front-line staff should not access.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The startup also allows hosting a private instance of the software. Additionally, it provides organization-wide licenses to let employees collaborate on a particular presentation.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Raghvendra told TechCrunch the startup plans to use the seed funding to launch a dedicated presentation agent to create presentations within any application. It also plans to have an enterprise sales team.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->So far, Raghvendra said the startup has spent \"zero\" on its marketing. Also, since it owns IPs, the executive said its AI patent costs are relatively lower and have higher profitability margins than other startups enabling presentations using AI.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The startup gets 20% of its revenues from the U.S. followed by India. It also counts the U.K., Germany, Australia, Canada, and the Middle East among its key markets.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The seed round included participation from learned Indian entrepreneurs including Paytm's Vijay Shekhar Sharma, CRED's Kunal Shah, Freshworks founder Girish Mathrubhootham, and RedBus' Phanindra Sama, among others.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This article originally appeared on TechCrunch at https://techcrunch.com/2025/02/03/accel-backs-indian-ai-startup-building-chatgpt-for-presentations/<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/accel-backs-indian-ai-startup-040017559.html",
            "pub_date": "2025-02-04 12:00:17",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KKR to raise bid price for Fuji Soft, above Bain's offer, Nikkei reports U.S. private equity fund KKR will raise its tender offer price for Fuji Soft shares to 9,850 yen per share from 9,451 yen, above Bain Capital's rival offer of 9,600 yen, the Nikkei business daily reported on Tuesday. KKR will announce the latest change as early as on Tuesday afternoon, Nikkei said. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->TOKYO (Reuters) - U.S. private equity fund KKR will raise its tender offer price for Fuji Soft shares to 9,850 yen per share from 9,451 yen, above Bain Capital's rival offer of 9,600 yen, the Nikkei business daily reported on Tuesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->KKR will announce the latest change as early as on Tuesday afternoon, Nikkei said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Kantaro Komiya; Editing by Chang-Ran Kim)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/kkr-raise-bid-price-fuji-035919480.html",
            "pub_date": "2025-02-04 11:59:19",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stock market today: Asian shares climb as Trump postpones Mexico and Canada tariffs for a month Asian shares climbed Tuesday after President Donald Trump said tariffs on Mexico and Canada would be delayed for a month.  The White House also said Trump would speak with Chinese President Xi Jinping, sparking hopes that a deal could be reached that could avert a broader trade war.  Trump last week imposed 10% tariffs on Chinese goods that is expected to go into effect Tuesday. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->HONG KONG (AP) — Asian shares climbed Tuesday after <a class=\"link\" data-ylk=\"slk:President Donald Trump;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/trump-tariffs-canada-mexico-china-sheinbaum-trudeau-017efa8c3343b8d2a9444f7e65356ae9\" rel=\"nofollow noopener\" target=\"_blank\">President Donald Trump</a> said tariffs on Mexico and Canada would be delayed for a month.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Stocks across Asia were up Tuesday. The Hang Seng Index in Hong Kong grew 2.10% to 20,642.58. Japan’s benchmark Nikkei 225 was up 1.61% to 39,140.41, while South Korea’s Kospi grew 1.63% to 2,493.99. Australia’s S&amp;P/ASX 200 rose 0.13% to 8,390.20.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The White House also said Trump would speak with Chinese President Xi Jinping, sparking hopes that a deal could be reached that could avert a broader trade war. Trump last week imposed 10% tariffs on Chinese goods that is expected to go into effect Tuesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Canada announced that it had reached a deal with the U.S. for a one-month reprieve only after U.S. markets had closed.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Analysts said that markets Tuesday were driven by the postponement of tariffs on countries like Canada and Mexico.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“The sharp pullback in the US dollar, along with tariff relief hopes, are likely to see markets retain their gains, barring any unexpected souring in US-China talks ahead,” said Yeap Jun Rong, market strategist at IG in a note.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Yeap said that the postponement of the tariffs provides immediate relief for risk sentiments and “underscores President Trump’s willingness to negotiate, potentially with tariff moves as bargaining chips rather than firm policy decisions.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The S&amp;P 500 fell 0.8% Monday, while the Dow Jones Industrial Average lost 122 points, or 0.3%, and the Nasdaq composite sank 1.2%. U.S. stocks had pared losses after Mexico said it had a monthlong reprieve from tariffs imposed by Trump.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In energy trading, benchmark U.S. crude declined $0.77 to $72.39 a barrel. Brent crude, the international standard, lost 36 cents to $75.60 a barrel.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In currency trading, the U.S. dollar edged up 155.13 Japanese yen from 154.75. The euro cost $1.0317, down from $1.0345.<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/stock-market-today-asian-shares-035522323.html",
            "pub_date": "2025-02-04 11:55:22",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "From JPMorgan to BlackRock: The 15 financial firms that file the most H-1B immigrant work visas President Trump's immigration crackdown is raising questions about visa programs for skilled workers. See which financial firms file the most H-1Bs. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"The aluminum industry is asking Donald Trump to make tariff exceptions for Canada.\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Donald Trump signing a document in the Oval Office.<span class=\"copyright\">Bloomberg/Bloomberg via Getty Images</span><!-- HTML_TAG_END --> </figcaption> </figure> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Financial firms seek to hire thousands of skilled foreign workers through H-1B visas each year.<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->President Trump's immigration crackdown is raising questions about the future of such visas.<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->See which financial firms file for the most H-1B visas, according to publicly available data.<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->As President Donald Trump follows through on his campaign promises to crack down on immigration, questions remain about what might happen to skilled workers who come to the US on H-1B visas.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump targeted the H-1B visa program in his first term when he signed the \"Buy American, Hire American\" executive order to rein in potential abuses. Ahead of the second term, however, he told the New York Post that he \"always liked the visas,\" which US companies use to hire foreign workers with specialized skills, often in science and technology.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"I've been a believer in H-1B,\" he told The Post in December. \"I have used it many times. It's a great program.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Still, the future of the program remains very much up in the air: Last week two Republican senators <a class=\"link\" data-ylk=\"slk:introduced a joint resolution;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.kennedy.senate.gov/public/2025/1/kennedy-leads-resolution-to-reverse-biden-dhs-rule-automatically-extending-immigrant-work-permits\" rel=\"nofollow noopener\" target=\"_blank\">introduced a joint resolution</a> to strike down a Biden-era rule allowing such visas to be automatically extended for 540 days, instead of 180 days.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->As such, Business Insider has run the numbers to find out which US financial services companies stand to be most impacted if these visas are tamped down again. BI used data from the Department of Labor and US Citizenship and Immigration data to analyze which financial giants file the most H-1B requests. The data runs through the 2024 government fiscal year (the fourth quarter of 2023 through the third quarter of 2024) and is collected from applications submitted by businesses that wish to sponsor a skilled worker's visa.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We found that some of the largest banks, credit card companies, and asset managers are among the most active sponsors of these visas, including JPMorgan and BlackRock. While many of the filings seek tech and software workers, some firms have used them to hire investment bankers or investment professionals.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Of course, not all filings lead to a foreign-worker hire and some filings may actually be for the same hire as firms will refile to reflect amendments or to extend an existing visa. Still, the publicly available data provides a good indication of the H-1B visa demand among major companies.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The firms listed either did not respond to a request for comment or declined to comment on the record.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Check out which financial firms are sponsoring the most H-1B visas, including the types of roles they are seeking to fill:<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->1. JPMorgan Chase<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"A close-up of JPMorgan Chase CEO Jamie Dimon speaks at The Institute Of International Finance annual membership meeting.\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Jamie Dimon, the CEO of JPMorgan Chase, is skeptical about cryptocurrencies, specifically Bitcoin.<span class=\"copyright\">Kevin Dietsch/Getty Images</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>1,990<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>317,233 as of the end of 2024<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>More than 1,500 filings are for workers with \"software\" in their title. The firm also hired for roles like a vice president of investment banking, an executive director of liquidity risk management, and a managing director of client fraud prevention<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->2. Fidelity<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 720px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 720; --img-max-width: 960px;\"><img alt=\"Fidelity Investments\" class=\"yf-g633g8 loader\" height=\"720\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START --><span class=\"copyright\">Getty Images</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>1,839<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>More than 76,000 per a January press release<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>More than 40% of filings contain the word software in their job title, and many other filings are related to tech as well, such as a director-level AI employee. The company also filed for a director of quantitative analysis and even some accounting roles through the program.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->3. Goldman Sachs<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 613px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 613; --img-max-width: 960px;\"><img alt=\"A bald man in a suit smiles\" class=\"yf-g633g8 loader\" height=\"613\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->David Solomon<span class=\"copyright\">Michael Kovac</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>1,443<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>46,500<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>Slightly more than a quarter of Goldman's filings are for roles that contain the word software. The company has also hired some divisional COO and CFOs through the program, as well as managing directors in areas like banking and financial crime control.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->4. Citi<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 651px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 651; --img-max-width: 960px;\"><img alt=\"A woman strandsstands next to a wall\" class=\"yf-g633g8 loader\" height=\"651\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->CEO Jane Fraser<span class=\"copyright\">Courtesy of Citi</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>1,058<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>239,000<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>Many of the filings are for tech roles, like software engineering, application development, and information technology roles. Other filings include a regulatory risk group manager and even a trader.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->5. Capital One<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"Capital One sign\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START --><span class=\"copyright\">J. David Ake, Getty Images</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>758<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>51,987 at the end of 2023<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>Most of Capital One's filings are for tech roles, as well as adjacent roles like a quantitative analysis manager and a range of data science roles.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->6. Morgan Stanley<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"Morgan Stanley\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START --><span class=\"copyright\">Michael M. Santiago/Getty Images</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>642<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>More than 80,000 per its website<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>Morgan Stanley does not include job title information in their filings, only the level of seniority. The filings range from the associate level all the way up to managing director.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->7. Barclays<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 699px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 699; --img-max-width: 960px;\"><img alt=\"barclays trader new york stock exchange\" class=\"yf-g633g8 loader\" height=\"699\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->A Barclays trader works on the floor of the New York Stock Exchange, July 3, 2012.<span class=\"copyright\">REUTERS/Brendan McDermid</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>609<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>Approximately 85,000 per its corporate website<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>Most of Barclay's filings are for tech roles, but the company has also hired for director roles in global markets, equity derivatives structuring and for a credit desk quant role.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->8. Visa<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader small\" style=\"\"> <div class=\"image-wrapper yf-g633g8 small\" style=\"--img-width: 382px; --img-height: 287px;\"><img alt=\"Visa\" class=\"yf-g633g8 loader\" height=\"287\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"382\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START --><span class=\"copyright\">BI Intelligence</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>587<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>31,600 as of a December 4, 2024 report<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filngs: </strong>The vast majority of filings are for tech roles, like a senior machine learning engineer and a wide variety of software engineers. Other filings include a senior M&amp;A manager and a senior finance manager.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->9. American Express<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 576px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 800 / 576; --img-max-width: 800px;\"><img alt=\"American Express and American Express corporate cards are pictured in Encinitas, California October 17, 2011.  REUTERS/Mike Blake \" class=\"yf-g633g8 loader\" height=\"576\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"800\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->American Express and American Express corporate cards are pictured in Encinitas<span class=\"copyright\">Thomson Reuters</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>575<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>74,000 per a 2024 press release<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>Nearly a third of AmEx's filings are for manager roles, the vast majority of those are in tech and data science portions of the business. The company has also filed for director roles in investment management and marketing analytics through the program.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->10. Bank of America<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 635px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 635; --img-max-width: 960px;\"><img alt=\"brian moynihan\" class=\"yf-g633g8 loader\" height=\"635\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Brian Moynihan<span class=\"copyright\">REUTERS / Bobby Yip</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>500<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>213,193 as of the end of last year<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>Similar to others on the list, most of Bank of America's H-1B filings are for tech roles, but the company has also hired a credit senior officer at a director role, and an associate general counsel and VP who works with financial derivatives.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->11. Wells Fargo<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 636px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 636; --img-max-width: 960px;\"><img alt=\"A woman walks in front of the Wells Fargo building in San Francisco\" class=\"yf-g633g8 loader\" height=\"636\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Wells Fargo in San Francisco<span class=\"copyright\">Justin Sullivan/Getty Images</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>453<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>220,167 employees as of the end of Q3 2024<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>Nearly 300 of Wells Fargo's filings are for roles with software in the title, but the firm had also filed for roles like a construction management director and a lead securities trader.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->12. Mastercard<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"The Mastercard logo on a New York Stock Exchange screen.\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START --><span class=\"copyright\">Michael M. Santiago/Getty Images</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>447<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>33,400 employees at the end of 2023 per an annual report<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>Mastercard has made 220 H-1B filings for roles with software in the title, while another 64 include product in the name. Other filings include roles like a vice president of marketing, strategy, and operations, and a commercial counsel role.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->13. Charles Schwab<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 819px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 819; --img-max-width: 960px;\"><img alt=\"Charles Schwab, the founder and chairman of Charles Schwab.\" class=\"yf-g633g8 loader\" height=\"819\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Charles Schwab, the founder and chairman of Charles Schwab.<span class=\"copyright\">REUTERS/Jim Young</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>429<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>32,100 employees as of the end of the third quarter of last year<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filing: </strong>More than 80% of roles have software in the name, though the company has also filed for director roles in business strategy, market risk management and treasury capital markets.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->14. BlackRock<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"Larry Fink, Chairman and CEO of BlackRock, gesturing and speaking during an interview with CNBC on the floor of the New York Stock Exchange (NYSE) in New York City, U.S., April 14, 2023.\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->BlackRock CEO Larry Fink<span class=\"copyright\">Brendan McDermid/Reuters</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>354<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>more than 20,000 globally<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filings: </strong>The vast majority of BlackRock's H-1B filings only note the role level. Some specific roles were highlighted, like an external relationship management associate and a sustainable investing associate.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->15. UBS<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"UBS\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START --><span class=\"copyright\">Fabrice Coffrini/AFP/Getty Images</span><!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total certified H-1B filings: </strong>294<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Total employees worldwide: </strong>109,396 as of end of third quarter last year<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Types of filing: </strong>UBS has filed for a range of tech roles as well as direct business roles, such as an alternative investments strategy director and director of investment banking.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Read the original article on <a class=\"link\" data-ylk=\"slk:Business Insider;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.businessinsider.com/financial-companies-sponsor-h1b-visas-jpmorgan-goldman-sachs-blackrock-trump-2025-1\" rel=\"nofollow noopener\" target=\"_blank\">Business Insider</a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/jpmorgan-blackrock-15-financial-firms-035326812.html",
            "pub_date": "2025-02-04 11:53:26",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold Rises Toward Record as Tariff Confusion Aids Haven Demand (Bloomberg) -- Gold rose toward a record high as President Donald Trump’s tariff threats and subsequent delays boosted uncertainty and supported haven demand.Most Read from BloombergNew York’s First ‘Passive House’ School Is a Model of Downtown DensityWhen French Communists Went on a Brutalist Building BoomState Farm Seeks Emergency California Rate Hike After LA FiresTrump Paves the Way to Deputize Local Police on ImmigrationHow the 2025 Catholic Jubilee Is Reshaping RomeBullion reached an all-t ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Bloomberg) -- Gold rose toward a record high as President Donald Trump’s tariff threats and subsequent delays boosted uncertainty and supported haven demand.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:New York’s First ‘Passive House’ School Is a Model of Downtown Density;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-02/brooklyn-gets-nyc-s-first-passive-house-certified-school-building?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">New York’s First ‘Passive House’ School Is a Model of Downtown Density</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:When French Communists Went on a Brutalist Building Boom;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-01/new-book-explores-brutalist-architecture-of-france-s-communist-party?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">When French Communists Went on a Brutalist Building Boom</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:State Farm Seeks Emergency California Rate Hike After LA Fires;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-03/state-farm-seeks-emergency-california-rate-hike-after-la-fires?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">State Farm Seeks Emergency California Rate Hike After LA Fires</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Trump Paves the Way to Deputize Local Police on Immigration;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-30/texas-florida-prep-for-local-police-collaboration-with-ice-on-immigration?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Trump Paves the Way to Deputize Local Police on Immigration</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:How the 2025 Catholic Jubilee Is Reshaping Rome;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-30/rome-s-jubilee-brings-a-wave-of-public-space-and-traffic-projects?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">How the 2025 Catholic Jubilee Is Reshaping Rome</a><!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Bullion reached an all-time peak above $2,830 an ounce on Monday before paring gains to close up 0.6% after Trump said he would pause levies of 25% against Canada and Mexico by a month. The abrupt about-face saw a gauge of the dollar retreat from the highest level in more than two years, making the precious metal cheaper for most buyers.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->There’s still plenty of uneasiness in markets about what lies ahead, burnishing gold’s appeal as a store of value in a hard-to-predict environment. Washington is set to impose a 10% tariff against Chinese imports from Tuesday in the US, although Trump said he would speak to Beijing regarding the proposed duties.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Among the biggest questions are how resilient the US economy would be to a trade war — if it materializes — as well as the ripple-on effects for monetary policy if tariffs reignite inflation. The Federal Reserve paused rate cuts last month, adopting a “wait-and-see” approach with regards to the new administration’s policies.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Spot gold rose 0.3% to $2,822.44 an ounce as of 11:26 a.m. in Singapore. The Bloomberg Dollar Spot Index dipped 0.2% after rising 1.1% over the previous six sessions. Silver was steady, while platinum and palladium advanced.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trade war fears had jolted precious metals markets even before the shenanigans over the last few days. US prices of gold and silver have surged above international benchmarks in recent weeks, causing dealers and traders to rush huge volumes of the metals into the US before any tariffs are imposed. The chaos has also led to a spike in lease rates for gold and silver — the return that holders of bullion in London’s vaults can get by loaning metal out on a short-term basis.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg Businessweek<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Elon Musk Inside the Treasury Department Payment System;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-02/elon-musk-gets-inside-treasury-department-payment-system?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Elon Musk Inside the Treasury Department Payment System</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The Internet Almost Killed Barnes &amp; Noble, Then Saved It;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-30/barnes-noble-sales-are-growing-again-thanks-to-booktok-buzz?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The Internet Almost Killed Barnes &amp; Noble, Then Saved It</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Indy Pass, the Anti-Vail Seasonal Ski Ticket, Is Gaining Fans;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-01-29/indy-pass-the-alternative-to-vail-seasonal-ski-ticket-is-gaining-fans?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Indy Pass, the Anti-Vail Seasonal Ski Ticket, Is Gaining Fans</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:What America’s Tech Billionaires Really Bought When They Backed Donald Trump;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-01-27/what-tech-billionaires-want-from-trump-s-presidency?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">What America’s Tech Billionaires Really Bought When They Backed Donald Trump</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Musk Pitches New Narrative as Tesla Sales Fall;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-28/podcast-musk-pitches-new-narrative-as-tesla-sales-fall?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Musk Pitches New Narrative as Tesla Sales Fall</a><!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->©2025 Bloomberg L.P.<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/gold-holds-near-record-high-001514122.html",
            "pub_date": "2025-02-04 11:29:27",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        }
    ]
}