{
    "data": [
        {
            "title": "Chipotle CFO: No price hikes in the near future while we watch the impact of tariffs on food Chipotle is trying to keep its prices steady amid tariff uncertainties. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Chipotle (<a class=\"link\" data-i13n=\"cpos:1;pos:1\" data-ylk=\"slk:CMG;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/CMG\">CMG</a>) lovers can still add guac to their burritos without busting their wallets.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->CFO Adam Rymer told Yahoo Finance that the company is keeping a \"close eye\" on the fluid tariff situation. The <a class=\"link yahoo-link\" data-i13n=\"cpos:2;pos:1\" data-ylk=\"slk:Trump administration announced a 25% tariff;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/news/live/live-trump-in-tariff-tit-for-tat-with-china-duties-on-canada-mexico-paused-for-one-month-191201535.html\">Trump administration announced a 25% tariff</a> on Mexican and Canadian imports, set to take effect in about a month's time, and an additional 10% tariff on Chinese goods that went into effect Tuesday.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We don't necessarily want to act quickly with price,\" he said, emphasizing there won't be price increases in the near future. \"We're going to be very patient when it comes to this to get an idea if these are going to be permanent or if they're not going to be enacted at all.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"As the tariffs come in, we're able to absorb these costs for a very long period of time,\" Rymer added. If the tariffs turn out to be a \"permanent\" hit to the business, Chipotle would increase prices to offset the effect but not to grow its margins. The tariffs are estimated to have an ongoing 60 basis points impact on its cost of sales if they were to go into effect.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em>Read more: </em><a class=\"link yahoo-link\" data-i13n=\"cpos:3;pos:1\" data-ylk=\"slk:What are tariffs, and how do they affect you?;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/personal-finance/taxes/article/what-is-a-tariff-194059448.html\"><em>What are tariffs, and how do they affect you?</em></a><!-- HTML_TAG_END --></p> <div class=\"loader yf-ksr8kw\" style=\"height: 480px\"></div> <div class=\"flourish-container yf-ksr8kw\" data-src=\"visualisation/21445759\" data-testid=\"flourish-container\"></div> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Only 2% of Chipotle's cost of sales come from Mexico, \"which includes avocados, tomatoes, limes, and peppers.\" The company used to import 90% of its avocados from Mexico, but now it imports half from Mexico, and the other half from Colombia, Peru, and the Dominican Republic, William Blair analyst Sharon Zackfia wrote in a note.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Still, Zackfia noted that potential risks to the stock include the \"outsized exposure to avocado costs.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It sources less than 0.5% of its cost of sales from Canada and China.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We're not completely dependent on one region ... we'll continue to make sure that we're diversified, but it's not something that we could switch very quickly. But we've done that over time, and we'll continue to do that over time,\" Rymer said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->If tariffs don't go into effect, food margins for 2025 should improve compared to the prior year, per a Bank of America client note. In 2024, Chipotle had to contend with rising avocado prices and investing in portion sizes.<!-- HTML_TAG_END --></p> <div class=\"loader yf-ksr8kw\" style=\"height: 480px\"></div> <div class=\"flourish-container yf-ksr8kw\" data-src=\"visualisation/12667455\" data-testid=\"flourish-container\"></div> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->On Tuesday, Chipotle <a class=\"link yahoo-link\" data-i13n=\"cpos:4;pos:1\" data-ylk=\"slk:reported fourth quarter;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/news/chipotle-q4-earnings-largely-meet-wall-street-estimates-shares-drop-on-conservative-guidance-230540834.html\">reported fourth quarter</a> and full-year results that were largely in line with analyst estimates. However, it issued a conservative 2025 guidance of same-store sales growth in the low- to mid-single-digit range.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->For Q4 and fiscal 2024, Chipotle reported same-store sales growth of 5.4% and 7.4%, respectively.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Value will remain a key strategy. The company took market share from quick-service players in 2024, with a \"30% discount on average\" to its peers' food, CEO Scott Boatwright told investors on an earnings call Tuesday. The company raised prices in December by 2%.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We're very careful with when we take a price increase because we really want to maintain that value proposition that we have amongst our peers and in the industry,\" Rymer said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In a note to clients, BTIG analyst Peter Saleh said if the company doesn't enact any additional price hikes, \"2025 same-store sales would benefit by 200 basis points from the current price taken in December 2024.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->—<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em>Brooke DiPalma is a senior reporter for Yahoo Finance. Follow her on Twitter at @</em><a class=\"link\" data-i13n=\"cpos:5;pos:1\" data-ylk=\"slk:BrookeDiPalma;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://twitter.com/BrookeDiPalma\" rel=\"nofollow noopener\" target=\"_blank\"><em>BrookeDiPalma</em></a><em> or email her at bdipalma@yahoofinance.com.</em><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:6;pos:1\" data-ylk=\"slk:Click here for all of the latest retail stock news and events to better inform your investing strategy;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/topic/stock-market-news/\"><strong>Click here for all of the latest retail stock news and events to better inform your investing strategy</strong></a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/chipotle-cfo-no-price-hikes-in-the-near-future-while-we-watch-the-impact-of-tariffs-on-food-155526433.html",
            "pub_date": "2025-02-05 23:55:26",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump tariff threats hang over Italian fashion industry as a luxury slowdown hits The head of Italy's fashion chamber said he has appealed to its government to protect the country's second-largest industry from possible tariffs from the Trump administration.  “If Trump penalizes the second industry in Italy, it is a pretty hostile declaration.”  Fashion generates 5% of Italy's GDP, or 75 billion euros ($78 billion), through the production and sale of textiles, apparel and footwear, and with 1.2 million employees, according to a study by the state development bank CDP released in December. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->MILAN (AP) — The head of Italy's fashion chamber said he has appealed to its government to protect the country's second-largest industry from <a class=\"link\" data-ylk=\"slk:possible tariffs;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/eu-us-ukraine-defense-trump-greenland-tariffs-c3e454c8f0959d273c2b6dd5941395e3\" rel=\"nofollow noopener\" target=\"_blank\">possible tariffs</a> from the Trump administration.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“We hope they don’t arrive,’’ Italian National Fashion Chamber President Carlo Capasa said Wednesday during the presentation of the calendar for the next Milan Fashion Week later this month. “If Trump penalizes the second industry in Italy, it is a pretty hostile declaration.”<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Fashion generates 5% of Italy's GDP, or 75 billion euros ($78 billion), through the production and sale of textiles, apparel and footwear, and with 1.2 million employees, according to a study by the state development bank CDP released in December.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The threat of tariffs;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/trump-tariffs-trade-inflation-mexico-china-canada-5e0cad1ba2d9ec086ddf8999b0807dff\" rel=\"nofollow noopener\" target=\"_blank\">The threat of tariffs</a> from U.S. President Donald Trump is creating uncertainty in the industry as it experiences a <a class=\"link\" data-ylk=\"slk:global contraction;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/luxury-sales-italy-trump-9806296c09548829bb71803aee572aff\" rel=\"nofollow noopener\" target=\"_blank\">global contraction</a> that shrank global sales in 2024 by 5%, dropping to 96 billion euros from 110 billion euros in 2023, according to figures released by the fashion chamber. Beyond textiles, apparel and footwear, the figures also include jewelry, eyewear and leather goods.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->While Trump has threatened to impose tariffs on European imports to the United States, he has not made clear plans.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Italy exported 4.6 billion euros worth of luxury fashion to the United States during the first 10 months of last year, including apparel, footwear, leather goods, jewelry and eyewear. It is the third market following France and Germany, with 7.6 billion euros and 4.7 billion euros in sales of Italian luxury fashion, respectively, during the same period.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Exports in the same period were up 2.5% to 91 billion euros, according to the fashion chamber data.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Despite the drop in global sales, the industry is still topping the results before the COVID-19 pandemic, with sales of 90 billion euros in 2019.<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/trump-tariff-threats-hang-over-154453179.html",
            "pub_date": "2025-02-05 23:44:53",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amazon's cloud business faces crucial test after rivals Microsoft, Google stumble The pressure is on Amazon.com to deliver on lofty expectations for cloud computing in its fourth-quarter results on Thursday, after Microsoft and Google's lackluster reports jolted investor faith in Big Tech's billion-dollar investments in AI.  Shares of major tech companies surged in the past two years on the belief that massive datacenter needs for artificial-intelligence technologies would power investment for years.  Still, Amazon may be better positioned than rivals to capitalize on cheaper AI, analysts say, due to its massive cloud business and lower exposure to costly large-language models that power apps like ChatGPT. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Deborah Mary Sophia<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - The pressure is on Amazon.com to deliver on lofty expectations for cloud computing in its fourth-quarter results on Thursday, after Microsoft and Google's lackluster reports jolted investor faith in Big Tech's billion-dollar investments in AI.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Shares of major tech companies surged in the past two years on the belief that massive datacenter needs for artificial-intelligence technologies would power investment for years.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But that was before Chinese startup DeepSeek said it had achieved AI breakthroughs at a fraction of the cost, precipitating a selloff in technology stocks that some say was overdue.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Still, Amazon may be better positioned than rivals to capitalize on cheaper AI, analysts say, due to its massive cloud business and lower exposure to costly large-language models that power apps like ChatGPT.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Amazon Web Services, the world's largest cloud services provider, is expected to post its strongest revenue increase in eight quarters at 19.3%, according to data compiled by LSEG.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But Microsoft and Meta were both forced to defend their AI spending plans last week, and shares of Google-parent Alphabet slumped 8% on Wednesday after it said it would be spending more on capex than analysts anticipated.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Microsoft and Google results have put even more of a microscope on Amazon's cloud growth,\" said Dave Wagner, portfolio manager at Aptus Capital Advisors, which holds shares in all three technology companies.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"But if Amazon can crush it on their cloud numbers, the market's going to absolutely love that report.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company was the first big cloud provider to embrace DeepSeek's AI models last month and has said its capital spending, mostly on AI, would be more than the $75 billion it estimated for 2024.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Slowing growth at Microsoft Azure and Google Cloud, the second- and third-biggest cloud players, has sparked some caution from analysts about AWS' performance.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Microsoft said it was capacity constrained, Google said it was capacity constrained. More than likely, Amazon is going to say it may have been capacity constrained as well and that's why its growth rate isn't quite up to what the market may have expected,\" said Bob O'Donnell, chief analyst at TECHnalysis Research.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Some analysts see the weakness at rivals as a sign that Amazon may have caught up in the AI race through efforts including doubling its investment in Anthropic and offering a wide selection of AI models on its cloud platform.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We actually believe that AWS is regaining share. It had been growing a lot slower than Microsoft Azure and Google Cloud for a period of time, but we believe that as Amazon has caught up on its AI offering, it may have less of a deceleration than Azure and Google Cloud,\" D.A. Davidson analyst Gil Luria said.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company has maintained a higher valuation than some of its rivals, with a current forward price-to-earnings ratio of nearly 39. Microsoft's forward P/E is 29 and Alphabet's 22.4, according to LSEG data.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->RETAIL STRENGTH<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The e-commerce giant's results are also likely to benefit from a healthy holiday shopping season, after rival retailers such as Target and a slew of apparel companies issued rosy forecasts over the past month.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Amazon's North American sales for the fourth quarter are projected to rise 9% year-on-year. After a slowdown in online sales growth earlier this year, analysts say Amazon is primed for a rebound in the retail business, which has influenced its post-earnings share movements over the past two quarters.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Data from Adobe Analytics showed U.S. shoppers splurged online between November and December 2024, spending more than $240 billion, drawn by deep discounts on everything from TVs to toys.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The holiday spending growth rate of 8.7% almost doubled from the 4.9% recorded in 2023, the data showed.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Amazon has also tried to improve delivery times and expanded product merchandise, including its focus on grocery, pharmacy and fashion - moves analysts say will help propel growth.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Most indications are that it was a good quarter. There was a good holiday season for the consumer and so there's plenty of reason to believe Amazon will have done well in that side of the business,\" Luria said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Deborah Sophia in Bengaluru; Editing by Pooja Desai)<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/amazons-cloud-business-faces-crucial-153627874.html",
            "pub_date": "2025-02-05 23:36:27",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Australia's Macquarie to wind down US debt capital markets arm, Bloomberg reports Bloomberg said the move would impact roughly 80 jobs, with some of the affected employees transitioning to new roles, while others leaving the company.  The change was communicated during a town hall meeting, the sources added, with Macquarie planning to sell positions it amassed through U.S. debt capital markets activities over the next two years.  Macquarie, Australia's largest asset manager, generates revenue through infrastructure ownership, commodity trading in sectors like oil and gas, managing capital raisings for other companies, and offering home loans in its domestic market. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - Australia's Macquarie is set to shutter its U.S. debt capital markets arm, as it plans to focus its resources on private credit, Bloomberg News reported on Wednesday, citing unnamed sources with knowledge of the matter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Bloomberg said the move would impact roughly 80 jobs, with some of the affected employees transitioning to new roles, while others leaving the company.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The change was communicated during a town hall meeting, the sources added, with Macquarie planning to sell positions it amassed through U.S. debt capital markets activities over the next two years.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company, in an emailed response to Reuters, said it is aware of the reports and has \"nothing to add\".<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Macquarie, Australia's largest asset manager, generates revenue through infrastructure ownership, commodity trading in sectors like oil and gas, managing capital raisings for other companies, and offering home loans in its domestic market.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Shivangi Lahiri in Bengaluru, Additional reporting by Roshan Thomas; Editing by Vijay Kishore)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/australias-macquarie-wind-down-us-151438286.html",
            "pub_date": "2025-02-05 23:14:38",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Polestar's CEO: 'Serious' tariff obstacles will limit product choice Polestar CEO Michael Lohscheller talks tariffs, building in the US, and the company's new profit plan in an interview with Yahoo Finance. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The automakers may have been <a class=\"link yahoo-link\" data-i13n=\"cpos:1;pos:1\" data-ylk=\"slk:granted a tariff reprieve;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/news/live/live-trump-in-tariff-tit-for-tat-with-china-duties-on-canada-mexico-paused-for-one-month-191201535.html\">granted a tariff reprieve</a> for the moment with Canada and Mexico duties delayed until March, but the writing is already on the wall. Polestar (<a class=\"link\" data-i13n=\"cpos:2;pos:1\" data-ylk=\"slk:PSNY;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/PSNY\">PSNY</a>), an upstart electric vehicle company owned by China's Geely, is already feeling the pain.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump and his economic team <a class=\"link yahoo-link\" data-i13n=\"cpos:3;pos:1\" data-ylk=\"slk:levied 10% tariffs;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/news/xi-careful-reply-trump-tariffs-120154217.html\">levied 10% tariffs</a> on goods coming from China, and while only a few cars come from the People's Republic destined for the US, the tariffs will affect many components and raw materials like steel used to assemble these cars. And this comes on top of the <a class=\"link yahoo-link\" data-i13n=\"cpos:4;pos:1\" data-ylk=\"slk:100% tariff President Biden levied on EVs;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/news/why-bidens-tariffs-on-chinese-evs-will-have-little-immediate-impact-on-the-us-auto-market-140135630.html\">100% tariff President Biden levied on EVs</a>.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The EV tariff hit pure-play EV maker Polestar hard. The company assembles its popular Polestar 2 at its factory in Chengdu, but a 100% tariff means it's no longer available stateside, Polestar CEO Michael Lohscheller said in an interview with Yahoo Finance.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Lohscheller, Polestar’s CEO since October of this year after succeeding longtime chief executive Thomas Ingenlath, nonetheless feels Polestar is in good shape — largely because of its wide manufacturing footprint.<!-- HTML_TAG_END --></p> <div class=\"tickerAtomContainer yf-b1zhrc\" data-originalrange=\"ytd\" data-testid=\"ticker-atom-container\"><section class=\"container yf-1j8z23g hidden\" data-testid=\"article-quote-header\"><div class=\"top yf-1j8z23g\"><span class=\"exchange yf-wk4yba\"> <span aria-hidden=\"true\" data-svelte-h=\"svelte-jnvkjn\">•</span> <span>USD</span> </span> <div class=\"left yf-1j8z23g wrap\"> <section class=\"container yf-xxbei9\"><h1 class=\"yf-xxbei9\"> (PSNY)</h1> </section> <div class=\"buttons yf-1j8z23g\"><div class=\"menuContainer tw-pt-[3px] tw-pb-[2px] yf-9a5vow\" style=\"                    \"><button aria-controls=\"menu-4\" aria-haspopup=\"true\" aria-label=\"Follow\" class=\"secondary-btn fin-size-x-small menuBtn rounded yf-15mk0m\" data-testid=\"add-to-following\" data-ylk=\"elmt:ticker;itc:1;cid:PSNY;elm:intent-follow;sec:article-chart-following;slk:menu-open;ticker:PSNY\" dialogalignleftvalue=\"0\"> <div aria-hidden=\"true\" class=\"icon fin-icon primary-icn sz-medium yf-4e31vg\"><!-- HTML_TAG_START --><svg viewbox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m22 9.24-7.19-.62L12 2 9.19 8.63 2 9.24l5.46 4.73L5.82 21 12 17.27 18.18 21l-1.63-7.03zM12 15.4l-3.76 2.27 1-4.28-3.32-2.88 4.38-.38L12 6.1l1.71 4.04 4.38.38-3.32 2.88 1 4.28z\"></path></svg><!-- HTML_TAG_END --></div> <span class=\"following-btn yf-1y5dpc7\">Follow</span> </button> <div aria-hidden=\"\" class=\"dialog-container yf-9a5vow\" id=\"menu-4\"></div> </div> <dialog class=\"no-bb yf-kanefs modal\" role=\"alertdialog\"> </dialog> <a class=\"none-link fin-size-small yf-1xqzjha\" data-testid=\"article-quote-link-button\" data-ylk=\"elm:qte;elmt:link;itc:0;sec:content-embed;slk:PSNY\" href=\"/quote/PSNY/\" target=\"_blank\"><button class=\"primary-btn fin-size-x-small rounded yf-15mk0m\" data-ylk=\"elm:qte;sec:article-chart-toolbar;slk:View%20Quote%20Details\"> View Quote Details </button> </a></div></div></div> </section> </div> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"The way we see it, it's very important that we manufacture locally here in the US,” Lohscheller said. “We have a good business model. We produce locally here in the US. We are just accelerating the start of the Polestar 3 — more cars to come in terms of Polestar 4 and 5. So that's how we position ourselves in this very important market, the United States.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Polestar currently builds its Polestar 3 SUV at its plant in South Carolina, which it shares with Volvo, also owned by Geely. Building in the US, of course, means no tariffs, and localized production means cheaper assembly and transport costs.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em>Read more: </em><a class=\"link yahoo-link\" data-i13n=\"cpos:5;pos:1\" data-ylk=\"slk:What are tariffs, and how do they affect you?;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/personal-finance/taxes/article/what-is-a-tariff-194059448.html\"><em>What are tariffs, and how do they affect you?</em></a><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->While localized production immunizes the company from Trump’s tariffs, not all cars can be built here.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Obviously, the tariff is something that we take very serious, and it's something which could then potentially be some headwinds,” he said.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"The start of Polestar 3 production from the company&amp;#39;s facility in Ridgeville, South Carolina. (credit: Polestar)\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->The start of Polestar 3 production from the company's facility in Ridgeville, South Carolina. (credit: Polestar)<!-- HTML_TAG_END --> <span class=\"caption-separator yf-8xybrv\" data-svelte-h=\"svelte-nxhdlu\">·</span> <span>Polestar</span></figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The upcoming Polestar 4 sports SUV will be built in South Korea, with whom the US has a strong free trade agreement. The Polestar 5 sports sedan will be built in Europe, however, which might make it susceptible to new levies.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Despite the complex manufacturing footprint, costs associated with developing new models, and somewhat uneven EV demand story here in the US and elsewhere, Polestar is still forecasting a good year.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“So obviously on a global basis, we have the Polestar 2, 3, and 4 [EVs], and with those products, we target a growth rate on the revenue side of 30 to 35%, and also target positive EBITDA for 2025. And that is obviously a big improvement for us because now we have a broader portfolio,” Lohscheller said. “And that helps us with all the efficiencies we were talking about, to target this level of profitability already in 2025.”<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 411px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 411; --img-max-width: 960px;\"><img alt=\"The Polestar 5 prototype sedan (credit: Polestar)\" class=\"yf-g633g8 loader\" height=\"411\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->The Polestar 5 prototype sedan (credit: Polestar)<!-- HTML_TAG_END --> <span class=\"caption-separator yf-8xybrv\" data-svelte-h=\"svelte-nxhdlu\">·</span> <span>Polestar</span></figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Polestar’s <a class=\"link\" data-i13n=\"cpos:6;pos:1\" data-ylk=\"slk:new business plan;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://investors.polestar.com/news-releases/news-release-details/polestar-targets-profitability-2025-polestar-7-will-be-premium\" rel=\"nofollow noopener\" target=\"_blank\">new business plan</a> sees that profitability metric being hit later this year, which would be a huge milestone for the company. It previously achieved profitability, but that was due to an accounting change and not because of auto operations.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking ahead, the other big addition revealed in Polestar’s updated business plan is the upcoming release of the Polestar 7, which would be a cheaper, compact SUV.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“The compact SUV segment is a big segment; it's actually on a global basis, the fastest growing segment, therefore important also for Polestar as a profit pool, and I think is an important addition to our portfolio.” Lohscheller said of the Polestar 7. “We can position the Polestar brand even broader and the segment is good.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Expect to see the Polestar 7 in showrooms in 2027, with a price tag in the mid-$40,000 range, likely competitive with sister brand Volvo’s EX-30 compact EV SUV.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em>Pras Subramanian is a reporter for Yahoo Finance. You can follow him on</em><a class=\"link\" data-i13n=\"cpos:7;pos:1\" data-ylk=\"slk:Twitter;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://twitter.com/Pras_S\" rel=\"nofollow noopener\" target=\"_blank\"><em> Twitter</em></a><em> and on</em><a class=\"link\" data-i13n=\"cpos:8;pos:1\" data-ylk=\"slk:Instagram;cpos:8;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.instagram.com/pras_s/\" rel=\"nofollow noopener\" target=\"_blank\"><em> Instagram</em></a><em>.</em><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:9;pos:1\" data-ylk=\"slk:For the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here;cpos:9;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/topic/earnings\"><strong>For the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here</strong></a><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:10;pos:1\" data-ylk=\"slk:Read the latest financial and business news from Yahoo Finance;cpos:10;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/news/\"><strong>Read the latest financial and business news from Yahoo Finance</strong></a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/polestars-ceo-serious-tariff-obstacles-will-limit-product-choice-151430233.html",
            "pub_date": "2025-02-05 23:14:33",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US services sector cools in January; price pressures abate Economists polled by Reuters had forecast the services PMI edging up to 54.3.  A PMI reading above 50 indicates growth in the services sector, which accounts for more than two-thirds of the economy.  The ISM associates a PMI reading above 49 over time with expansion in the overall economy. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->WASHINGTON (Reuters) - U.S. services sector activity unexpectedly slowed in January amid cooling demand, helping to curb price growth.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Institute for Supply Management (ISM) said on Wednesday its nonmanufacturing purchasing managers index (PMI) slipped to 52.8 last month from 54.0 in December. Economists polled by Reuters had forecast the services PMI edging up to 54.3.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A PMI reading above 50 indicates growth in the services sector, which accounts for more than two-thirds of the economy. The ISM associates a PMI reading above 49 over time with expansion in the overall economy. Domestic demand was strong in the fourth quarter, fueled by robust consumer spending.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The ISM survey's new orders measure fell to 51.3 from 54.4 in December. That helped to pull down its gauge of prices paid for services inputs to 60.4 from 64.4 in December, which was the highest reading since February 2023.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->That is a hopeful sign after progress bringing inflation down to the Federal Reserve's 2% target stalled in recent months. The outlook for inflation is, however, uncertain as President Donald Trump's administration pursues tariffs against the United States' trade partners and mass deportations, actions that economists have warned would raise prices for Americans.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump on Monday suspended a 25% tariff on Canadian and Mexican imports until next month. An additional 10% levy on Chinese goods went into effect on Tuesday.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The U.S. central bank left its benchmark overnight interest rate unchanged in the 4.25%-4.50% range last week. The policy rate has been reduced by 100 basis points since September when the U.S. central bank started its policy easing cycle.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Fed hiked the policy rate by 5.25 percentage points in 2022 and 2023 to tame inflation.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The survey's measure of services employment increased to 52.3 last month from 51.3 in December. It has not been a good predictor of services payrolls in the government's closely watched employment report, which is scheduled to be released on Friday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Nonfarm payrolls likely increased by 170,000 jobs in January after surging 256,000 in December, a Reuters survey showed. The unemployment rate is forecast unchanged at 4.1%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Lucia Mutikani; Editing by Chizu Nomiyama)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/us-services-sector-cools-january-150437960.html",
            "pub_date": "2025-02-05 23:04:37",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla sees German car sales plunge in January Tesla sold almost 60% fewer cars in Germany in January than in the year-earlier period, as the U.S. electric vehicle maker faces a test of popularity amid headline-grabbing political involvement by its billionaire CEO Elon Musk.  German road traffic agency KBA's website on Wednesday showed the number of newly registered Tesla cars fell 59.5% to 1,277 in January, while the overall German market was down just 2.8% at slightly more than 207,000 vehicles during the month.  The overall segment of battery-electric vehicles, where Tesla is competing, however, gained popularity in January, with sales up 53.5% at almost 34,500 vehicles across all brands. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->FRANKFURT (Reuters) - Tesla sold almost 60% fewer cars in Germany in January than in the year-earlier period, as the U.S. electric vehicle maker faces a test of popularity amid headline-grabbing political involvement by its billionaire CEO Elon Musk.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->German road traffic agency KBA's website on Wednesday showed the number of newly registered Tesla cars fell 59.5% to 1,277 in January, while the overall German market was down just 2.8% at slightly more than 207,000 vehicles during the month.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The overall segment of battery-electric vehicles, where Tesla is competing, however, gained popularity in January, with sales up 53.5% at almost 34,500 vehicles across all brands.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->KBA did not give reasons for the developments in car sales.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Car registration data in Sweden and Norway earlier this week also showed that Tesla lost market share there in January.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A total of 405 new Teslas were registered in Sweden last month, down 44% from January 2024, while registrations in Norway fell to 689, a decline of 38% over the same period, despite soaring overall demand for cars in the two countries.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In addition to his strong backing for U.S. President Donald Trump, Musk has also voiced polarising opinions on politics in Europe and beyond, drawing criticism from European capitals, including Norway's prime minister and Germany's chancellor.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Musk, who also runs the X social media platform, has dismissed criticism against him as an affront to democracy and free speech.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Ludwig Burger, Editing by Miranda Murray)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/tesla-sees-german-car-sales-144208503.html",
            "pub_date": "2025-02-05 22:42:08",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toyota stock climbs on guidance boost, new China EV unit Toyota shares are climbing higher on the back of upbeat guidance, and the Japanese giant’s plans to set up a wholly-owned EV unit in China. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Toyota (<a class=\"link\" data-i13n=\"cpos:1;pos:1\" data-ylk=\"slk:TM;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/TM/\">TM</a>) stock is climbing higher on the back of upbeat guidance and the Japanese giant’s plans to set up a wholly-owned EV unit in China.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Toyota, the world’s largest automaker, reported fiscal third quarter revenue of ¥12.391 trillion ($80.95 billion), up 2.9% to despite lower vehicle sales. Net profit came in at ¥2.193 trillion ($14.21 billion), up 62% from a year earlier and topping estimates of around ¥1.175 trillion as compiled by Bloomberg.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Due to \"strengthening earnings power” and “product competitiveness\" among other things, Toyota said it now sees full year fiscal 2025 profit of ¥4.7 trillion ($31 billion), up from its prior outlook of ¥4.3 trillion. Per Bloomberg, the street was expecting ¥4.8 trillion.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Toyota ADR shares trading in New York climbed 2% in early trade.<!-- HTML_TAG_END --></p> <div class=\"tickerAtomContainer yf-b1zhrc\" data-originalrange=\"ytd\" data-testid=\"ticker-atom-container\"><section class=\"container yf-1j8z23g hidden\" data-testid=\"article-quote-header\"><div class=\"top yf-1j8z23g\"><span class=\"exchange yf-wk4yba\"> <span aria-hidden=\"true\" data-svelte-h=\"svelte-jnvkjn\">•</span> <span>USD</span> </span> <div class=\"left yf-1j8z23g wrap\"> <section class=\"container yf-xxbei9\"><h1 class=\"yf-xxbei9\"> (TM)</h1> </section> <div class=\"buttons yf-1j8z23g\"><div class=\"menuContainer tw-pt-[3px] tw-pb-[2px] yf-9a5vow\" style=\"                    \"><button aria-controls=\"menu-61\" aria-haspopup=\"true\" aria-label=\"Follow\" class=\"secondary-btn fin-size-x-small menuBtn rounded yf-15mk0m\" data-testid=\"add-to-following\" data-ylk=\"elmt:ticker;itc:1;cid:TM;elm:intent-follow;sec:article-chart-following;slk:menu-open;ticker:TM\" dialogalignleftvalue=\"0\"> <div aria-hidden=\"true\" class=\"icon fin-icon primary-icn sz-medium yf-4e31vg\"><!-- HTML_TAG_START --><svg viewbox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m22 9.24-7.19-.62L12 2 9.19 8.63 2 9.24l5.46 4.73L5.82 21 12 17.27 18.18 21l-1.63-7.03zM12 15.4l-3.76 2.27 1-4.28-3.32-2.88 4.38-.38L12 6.1l1.71 4.04 4.38.38-3.32 2.88 1 4.28z\"></path></svg><!-- HTML_TAG_END --></div> <span class=\"following-btn yf-1y5dpc7\">Follow</span> </button> <div aria-hidden=\"\" class=\"dialog-container yf-9a5vow\" id=\"menu-61\"></div> </div> <dialog class=\"no-bb yf-kanefs modal\" role=\"alertdialog\"> </dialog> <a class=\"none-link fin-size-small yf-1xqzjha\" data-testid=\"article-quote-link-button\" data-ylk=\"elm:qte;elmt:link;itc:0;sec:content-embed;slk:TM\" href=\"/quote/TM/\" target=\"_blank\"><button class=\"primary-btn fin-size-x-small rounded yf-15mk0m\" data-ylk=\"elm:qte;sec:article-chart-toolbar;slk:View%20Quote%20Details\"> View Quote Details </button> </a></div></div></div> </section> </div> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In its presentation, Toyota did not mention the effect of possible tariffs from the Trump administration on its results. Though Toyota makes a number of vehicles in the US, it does make it midsize pickup, the Tacoma, in Mexico.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Toyota, the world’s largest automaker, reported total retail vehicle sales of 2.922 million, down around 1.5% from a year ago.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Toyota’s plans for China include establishing a wholly-owned company for the development and production of Lexus EVs, as well as batteries in Shanghai. Production is expected to start in 2027, with an annual production capacity of 100,000 EVs.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"DETROIT, MICHIGAN - SEPTEMBER 13: The 2024 Toyota Tacoma truck is shown at the 2023 North American International Detroit Auto Show on September 13, 2023 in Detroit, Michigan. The show, which features 35 brands and an indoor EV track, opens to the public on September 16 and continues through September 24. (Photo by Bill Pugliano/Getty Images)\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->DETROIT, MICHIGAN - SEPTEMBER 13: The 2024 Toyota Tacoma truck is shown at the 2023 North American International Detroit Auto Show on September 13, 2023 in Detroit, Michigan. The show, which features 35 brands and an indoor EV track, opens to the public on September 16 and continues through September 24. (Photo by Bill Pugliano/Getty Images)<!-- HTML_TAG_END --> <span class=\"caption-separator yf-8xybrv\" data-svelte-h=\"svelte-nxhdlu\">·</span> <span>Bill Pugliano via Getty Images</span></figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Local Chinese members will take the lead in planning and developing BEVs that match the unique needs of Chinese customers,” Toyota CFO Yoichi Miyazaki said in a statement. China is the world’s largest EV market, which <a class=\"link\" data-i13n=\"cpos:2;pos:1\" data-ylk=\"slk:saw 40% sales growth;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/china-autos-evs-exports-3f5860634a1d146446dd0dd9e78c2abb\" rel=\"nofollow noopener\" target=\"_blank\">saw 40% sales growth</a> in 2024 alone.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Toyota’s upcoming Lexus EV plant is only the second wholly foreign-owned auto factory in China - the other is Tesla’s Giga Shanghai. Toyota’s other operations in China are joint ventures with local automakers.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sticking with EVs, Toyota said it has opened its $14 billion US battery plant in North Carolina. The Toyota Battery Manufacturing North Carolina (TBMNC) is the company’s first in-house battery factory outside Japan, and will produce batteries for its hybrid and fully-electric vehicles sold in the US. The plant will eventually hire 5,000 new workers, with the first battery packs shipping in April.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Toyota’s plan to localize production of its EVs with both China and the US insulate the company from trade related restrictions such as tariffs, and keep production costs lower. The question is, at least in the US, will demand for EVs continue to grow with incentives <a class=\"link yahoo-link\" data-i13n=\"cpos:3;pos:1\" data-ylk=\"slk:like tax credits at risk;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/news/not-trivial-ev-sales-could-drop-nearly-30-if-trump-repeals-tax-credit-194135070.html\">like tax credits at risk</a>.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em>Pras Subramanian is a reporter for Yahoo Finance. You can follow him on</em><a class=\"link\" data-i13n=\"cpos:4;pos:1\" data-ylk=\"slk:Twitter;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://twitter.com/Pras_S\" rel=\"nofollow noopener\" target=\"_blank\"><em> Twitter</em></a><em> and on</em><a class=\"link\" data-i13n=\"cpos:5;pos:1\" data-ylk=\"slk:Instagram;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.instagram.com/pras_s/\" rel=\"nofollow noopener\" target=\"_blank\"><em> Instagram</em></a><em>.</em><!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:6;pos:1\" data-ylk=\"slk:For the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/topic/earnings\"><strong>For the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here</strong></a><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:7;pos:1\" data-ylk=\"slk:Read the latest financial and business news from Yahoo Finance;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/news/\"><strong>Read the latest financial and business news from Yahoo Finance</strong></a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/toyota-stock-climbs-on-guidance-boost-new-china-ev-unit-143322657.html",
            "pub_date": "2025-02-05 22:33:55",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ukraine says it has potential to buy, store LNG from US Ukraine and other European nations have the potential to buy and store liquefied natural gas (LNG) from the United States in Ukraine and this could strengthen Europe's energy security as gas transits from Russia end, its foreign minister said on Wednesday.  Ukraine, which was invaded by Moscow three years ago, was once a major pipeline transit route for Russian gas until the beginning of this year, when the transit deal between the two countries expired.  \"We see a huge potential, especially after the termination of the transit of Russian gas through the territory of Ukraine, in the possibility of purchasing LNG gas from the United States of America,\" Foreign Minister Andrii Sybiha said at a joint press conference with his British counterpart David Lammy. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->KYIV (Reuters) - Ukraine and other European nations have the potential to buy and store liquefied natural gas (LNG) from the United States in Ukraine and this could strengthen Europe's energy security as gas transits from Russia end, its foreign minister said on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ukraine, which was invaded by Moscow three years ago, was once a major pipeline transit route for Russian gas until the beginning of this year, when the transit deal between the two countries expired.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It also has large underground gas storages, particularly in the west of the country.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We see a huge potential, especially after the termination of the transit of Russian gas through the territory of Ukraine, in the possibility of purchasing LNG gas from the United States of America,\" Foreign Minister Andrii Sybiha said at a joint press conference with his British counterpart David Lammy.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In response to a Reuters question after the event, a ministry spokesperson clarified this meant that Ukraine could buy U.S. LNG and store it, as well as storing LNG belonging to other European countries.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"You know that Ukraine has extremely powerful underground gas storage facilities, and here, too, we have common ground for mutually beneficial cooperation, while strengthening Europe's energy security,\" Sybiha said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sybiha also invited U.S. businesses to participate in reconstruction and help Ukraine rebuild after the damage and devastation caused by nearly three years of war.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The minister was answering a question about U.S. President Donald Trump's recently expressed interest in Ukraine supplying the U.S. with its deposits of critical minerals.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kyiv proposed in its Victory Plan presented last year to sign an agreement with the U.S., EU and other allies that would allow for joint investments and use of Ukraine's natural resources, which it says are worth trillions of dollars.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"It is also an element of guaranteeing the presence of big business in Ukraine, big interests, the interests of our closest allies - the United States of America - in the development of such fields and their protection,\" Sybiha said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Max Hunder, writing by Olena Harmash, Editing by Bernadette Baum and Angus MacSwan)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/ukraine-says-potential-buy-store-142151941.html",
            "pub_date": "2025-02-05 22:21:51",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Disney CFO: Netflix had a big quarter, but don't discount Disney+ Disney CFO Hugh Johnston is still hopeful Disney+ returns to growth this year. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Disney (<a class=\"link\" data-i13n=\"cpos:1;pos:1\" data-ylk=\"slk:DIS;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/DIS\">DIS</a>) thinks it could get back to growth in its important streaming business this year.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->That hope continues as Netflix's (<a class=\"link\" data-i13n=\"cpos:2;pos:1\" data-ylk=\"slk:NFLX;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/NFLX\">NFLX</a>) dominance strengthens.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Netflix obviously had a big quarter in terms of content, both with some of the sports activities and some distribution deals they had done outside the US. But from our perspective, we're managing the business in a way where we're trying to grow subs and we're trying to improve margins at the same time, and we're very much on track,\" Disney CFO <a class=\"link yahoo-link\" data-i13n=\"cpos:3;pos:1\" data-ylk=\"slk:Hugh Johnston;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/video/disney-cfo-earnings-beat-magic-150452621.html\">Hugh Johnston</a> told me on Yahoo Finance moments after the company's better than expected earnings on Wednesday.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Disney+ notched 125 million subscribers in the most recent quarter, down 0.7 million from the preceding quarter. The figure fell well short of analyst estimates of 148.7 million.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By comparison, <a class=\"link yahoo-link\" data-i13n=\"cpos:4;pos:1\" data-ylk=\"slk:Netflix shocked investors;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/video/trumps-ai-plans-netflix-earnings-192023283.html\">Netflix shocked investors</a> several weeks ago by adding a whopping 19 million subscribers in the quarter. The company was boosted by its initial foray into live sports via events such as the Tyson vs. Paul boxing match.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Added Johnston, \"We do expect a combination of more and better content [for Disney+] as we get toward the latter part of the year. The ESPN+ flagship will be an option, that will be a part of Disney+. In addition to that, paid sharing is certainly going to be a driver.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Disney shares fell slightly in pre-market trading as investors balanced the streaming letdown versus better than expected profits.<!-- HTML_TAG_END --></p> <div class=\"tickerAtomContainer yf-b1zhrc\" data-originalrange=\"1y\" data-testid=\"ticker-atom-container\"><section class=\"container yf-1j8z23g hidden\" data-testid=\"article-quote-header\"><div class=\"top yf-1j8z23g\"><span class=\"exchange yf-wk4yba\"> <span aria-hidden=\"true\" data-svelte-h=\"svelte-jnvkjn\">•</span> <span>USD</span> </span> <div class=\"left yf-1j8z23g wrap\"> <section class=\"container yf-xxbei9\"><h1 class=\"yf-xxbei9\"> (DIS)</h1> </section> <div class=\"buttons yf-1j8z23g\"><div class=\"menuContainer tw-pt-[3px] tw-pb-[2px] yf-9a5vow\" style=\"                    \"><button aria-controls=\"menu-68\" aria-haspopup=\"true\" aria-label=\"Follow\" class=\"secondary-btn fin-size-x-small menuBtn rounded yf-15mk0m\" data-testid=\"add-to-following\" data-ylk=\"elmt:ticker;itc:1;cid:DIS;elm:intent-follow;sec:article-chart-following;slk:menu-open;ticker:DIS\" dialogalignleftvalue=\"0\"> <div aria-hidden=\"true\" class=\"icon fin-icon primary-icn sz-medium yf-4e31vg\"><!-- HTML_TAG_START --><svg viewbox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m22 9.24-7.19-.62L12 2 9.19 8.63 2 9.24l5.46 4.73L5.82 21 12 17.27 18.18 21l-1.63-7.03zM12 15.4l-3.76 2.27 1-4.28-3.32-2.88 4.38-.38L12 6.1l1.71 4.04 4.38.38-3.32 2.88 1 4.28z\"></path></svg><!-- HTML_TAG_END --></div> <span class=\"following-btn yf-1y5dpc7\">Follow</span> </button> <div aria-hidden=\"\" class=\"dialog-container yf-9a5vow\" id=\"menu-68\"></div> </div> <dialog class=\"no-bb yf-kanefs modal\" role=\"alertdialog\"> </dialog> <a class=\"none-link fin-size-small yf-1xqzjha\" data-testid=\"article-quote-link-button\" data-ylk=\"elm:qte;elmt:link;itc:0;sec:content-embed;slk:DIS\" href=\"/quote/DIS/\" target=\"_blank\"><button class=\"primary-btn fin-size-x-small rounded yf-15mk0m\" data-ylk=\"elm:qte;sec:article-chart-toolbar;slk:View%20Quote%20Details\"> View Quote Details </button> </a></div></div></div> </section> </div> <h2 class=\"header-scroll yf-gn6wdt\" id=\"earnings-rundown\"><!-- HTML_TAG_START -->Earnings rundown<!-- HTML_TAG_END --></h2> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Net sales:</strong> $24.7 billion, +5% year over year, vs. $24.57 billion estimate<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Entertainment revenue:</strong> $10.87 billion, +8.9% year over year, vs. $11 billion estimate<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Direct to consumer revenue:</strong> $5.78 billion, +15% year over year, vs. $5.82 billion estimate<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Sports revenue:</strong> $4.85 billion, +0.3% year over year, vs. $4.7 billion estimate<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Experiences revenue:</strong> $9.42 billion, +3.1% year over year, vs. $9.3 billion estimate<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Disney+ total subscribers:</strong> 124.6 million vs. 148.7 million estimate<!-- HTML_TAG_END --></p> </li> </ul> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EPS:</strong> $1.76, up 44% year over year, vs. $1.42 estimate<!-- HTML_TAG_END --></p> </li> </ul> <h2 class=\"header-scroll yf-gn6wdt\" id=\"earnings-analysis\"><!-- HTML_TAG_START -->Earnings analysis<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->There was a lot to like in Disney's quarter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company's aggressive cost cutting under CEO Bob Iger is yielding much improved profitability. That showed up in the quarter in a few areas.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The direct to consumer business pulled in $298 million in operating profits in the quarter versus a $138 million loss last year. And the entertainment segment's 95% operating profit improvement was fueled by strong box office response to the likes of Mufasa and tight cost controls.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"I think we're doing a nice job of eliminating unnecessary cost and at the same time investing back in the business in all of the right ways,\" Johnston said.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company reiterating its fiscal year 2025 high-single digit percentage EPS growth outlook is a signal that management thinks it could continue to drive margin improvement.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But the ongoing pressure in the linear TV business as people switch to streaming platforms and the Disney+ sluggishness could weigh on investor minds (and the bullish analyst community) in the near-term.<!-- HTML_TAG_END --></p> <div class=\"loader yf-ksr8kw\" style=\"height: 480px\"></div> <div class=\"flourish-container yf-ksr8kw\" data-src=\"story/2877124\" data-testid=\"flourish-container\"></div> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Linear network sales and operating profits declined 7% and 11%, respectively in the most recent quarter. Total Disney+ subs grew 1% sequentially, while Hulu subs only increased 3%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Given the still large (if slightly diminished) contribution the experiences division provides to Disney’s total earnings, the sustainability of recent growth is one of the key questions facing investors,\" said MoffettNathanson analysts said in a recent client note.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:5;pos:1\" data-ylk=\"slk:Brian Sozzi;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.yahoo.com/author/brian-sozzi/\"><em>Brian Sozzi</em></a><em> is Yahoo Finance's Executive Editor. Follow Sozzi on X </em><a class=\"link\" data-i13n=\"cpos:6;pos:1\" data-ylk=\"slk:@BrianSozzi;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://twitter.com/BrianSozzi\" rel=\"nofollow noopener\" target=\"_blank\"><em>@BrianSozzi</em></a><em>, </em><a class=\"link\" data-i13n=\"cpos:7;pos:1\" data-ylk=\"slk:Instagram;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.instagram.com/briansozzi/\" rel=\"nofollow noopener\" target=\"_blank\"><em>Instagram</em></a><em> and on </em><a class=\"link\" data-i13n=\"cpos:8;pos:1\" data-ylk=\"slk:LinkedIn;cpos:8;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.linkedin.com/in/briansozzi/\" rel=\"nofollow noopener\" target=\"_blank\"><em>LinkedIn</em></a><em>. Tips on stories? Email brian.sozzi@yahoofinance.com.</em><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:9;pos:1\" data-ylk=\"slk:Click here for the latest stock market news and in-depth analysis, including events that move stocks;cpos:9;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/topic/stock-market-news/\"><strong>Click here for the latest stock market news and in-depth analysis, including events that move stocks</strong></a><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:10;pos:1\" data-ylk=\"slk:Read the latest financial and business news from Yahoo Finance;cpos:10;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/news/\"><strong>Read the latest financial and business news from Yahoo Finance</strong></a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/disney-cfo-netflix-had-a-big-quarter-but-dont-discount-disney-141659156.html",
            "pub_date": "2025-02-05 22:16:59",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        }
    ]
}