{
    "data": [
        {
            "title": "Diageo withdraws medium-term sales forecast Diageo, the world's top spirits maker, withdrew its medium-term organic sales growth target on Tuesday, citing macroeconomic and geopolitical uncertainty hurting the pace of its recovery. The maker of Johnnie Walker whisky and Guinness beer had earlier forecast medium-term organic net sales growth of 5% to 7%. CEO Debra Crew said tariffs in the U.S. announced over the weekend added to \"further complexity in our ability to provide updated forward guidance\". ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - Diageo, the world's top spirits maker, withdrew its medium-term organic sales growth target on Tuesday, citing macroeconomic and geopolitical uncertainty hurting the pace of its recovery.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The maker of Johnnie Walker whisky and Guinness beer had earlier forecast medium-term organic net sales growth of 5% to 7%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->CEO Debra Crew said tariffs in the U.S. announced over the weekend added to \"further complexity in our ability to provide updated forward guidance\".<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Diageo's organic sales grew 1% in the first-half, beating a 0.4% growth expected by analysts in a company-compiled poll.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Yadarisa Shabong in Bengaluru; Editing by Varun H K)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/diageo-withdraws-medium-term-sales-070829931.html",
            "pub_date": "2025-02-04 15:08:29",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Panasonic's battery unit Q3 operating profit rises 39% from a year earlier Japan's Panasonic Holdings said on Thursday the third-quarter operating profit of its energy unit, which supplies batteries to Tesla, rose 39% from a year earlier on improved profitability at its U.S. plant and stronger sales of energy storage systems.  Operating income for the key segment increased to 42 billion yen ($270.46 million) as the better profitability at its U.S. plant helped offset an overall decline in sales in its in-vehicle business, it said in presentation materials. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->TOKYO (Reuters) - Japan's Panasonic Holdings said on Thursday the third-quarter operating profit of its energy unit, which supplies batteries to Tesla, rose 39% from a year earlier on improved profitability at its U.S. plant and stronger sales of energy storage systems.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Operating income for the key segment increased to 42 billion yen ($270.46 million) as the better profitability at its U.S. plant helped offset an overall decline in sales in its in-vehicle business, it said in presentation materials.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->($1 = 155.2900 yen)<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Daniel Leussink; Editing by Christian Schmollinger)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/panasonics-battery-unit-q3-operating-065215182.html",
            "pub_date": "2025-02-04 14:52:15",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dassault Systemes signs strategic partnership with Volkswagen French software group Dassault Systemes on Tuesday announced a long-term partnership with Volkswagen to accelerate the German carmaker's transition towards software defined vehicles. Dassault's flagship software platform 3DEXPERIENCE was selected by Volkswagen as its main engineering and manufacturing platform, the French company said. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - French software group Dassault Systemes on Tuesday announced a long-term partnership with Volkswagen to accelerate the German carmaker's transition towards software defined vehicles.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Dassault's flagship software platform 3DEXPERIENCE was selected by Volkswagen as its main engineering and manufacturing platform, the French company said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Anna Peverieri and Johan Bodinier in Gdansk; Editing by Milla Nissi)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/dassault-systemes-signs-strategic-partnership-064812445.html",
            "pub_date": "2025-02-04 14:48:12",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nintendo operating profit fell 46.7% in the nine months ended Dec 31 Nintendo on Tuesday reported operating profit in the April-December period fell 46.7% from a year earlier. Profit was 247.6 billion yen ($1.59 billion). That compared with profit of 464 billion yen in the same period a year earlier. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->TOKYO (Reuters) - Nintendo on Tuesday reported operating profit in the April-December period fell 46.7% from a year earlier.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Profit was 247.6 billion yen ($1.59 billion). That compared with profit of 464 billion yen in the same period a year earlier.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->($1 = 155.3700 yen)<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Sam Nussey; Editing by Christian Schmollinger)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/nintendo-operating-profit-fell-46-063927958.html",
            "pub_date": "2025-02-04 14:39:27",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Publicis forecasts slower 2025, remains confident on outperformance Publicis, the world's largest advertising group by market capitalization, announced on Tuesday it expects organic growth of 4% to 5% in 2025, a slight slowdown compared to the robust performance in 2024 that exceeded expectations, propelled by its data-driven targeted marketing.  Publicis reported net revenues of 13.97 billion euros ($14.35 billion) for 2024, representing an organic growth of 5.8% versus its 5.5% guidance.  The last quarter of the year witnessed growth acceleration to 6.3%. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Leo Marchandon<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - Publicis, the world's largest advertising group by market capitalization, announced on Tuesday it expects organic growth of 4% to 5% in 2025, a slight slowdown compared to the robust performance in 2024 that exceeded expectations, propelled by its data-driven targeted marketing.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The French group, which dethroned British rival WPP as the world's largest ad group by revenue in December, expressed confidence in outperforming the market again in 2025.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Publicis reported net revenues of 13.97 billion euros ($14.35 billion) for 2024, representing an organic growth of 5.8% versus its 5.5% guidance. The last quarter of the year witnessed growth acceleration to 6.3%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Publicis' strong showing comes at a time of significant shifts in the advertising landscape. The industry, traditionally a reflection of broader corporate health, is set to consolidate from the \"Big Four\" to the \"Big Three\" following the planned merger of Omnicom and Interpublic, forming a combined entity with over $25 billion in revenue.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We will continue to differentiate ourselves with acquisitions in data, technology and artificial intelligence that will enable us to continue to outperform in terms of growth\", CEO Arthur Sadoun said in a call.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This year, an additional 100 million euros will be invested in AI, specifically to develop the CoreAI entity, as part of a total budget of 300 million euros announced a year ago.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"You have to be agnostic about the partners you work with. You have to work with Gemini, you have to work with OpenAI, you have to work with DeepSeek, you have to be able to build your own models\", Sadoun said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Publicis, in its tech-driven transformation that has outpaced competitors, revealed plans to allocate between 800-900 million euros for targeted acquisitions in 2025, focusing on technology, digital media, and proprietary data.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company highlighted that its strategic acquisitions, particularly Sapient and Epsilon, have contributed 40% to its growth since 2020.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"In short, we believe we are better prepared, we have the assets. We have invested 12 billion euros (over 10 years) to leverage artificial intelligence\", Sadoun said in a call.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->For 2025, the group projects its operating margin to remain slightly above 18% and anticipates free cash flow between 1.9 and 2.0 billion euros. It proposed a dividend of 3.60 euros per share, a 5.9% hike from the previous year.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->($1 = 0.9734 euros)<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Leo Marchandon, Editing by Nick Zieminski)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/publicis-forecasts-slower-2025-remains-063320507.html",
            "pub_date": "2025-02-04 14:33:20",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amundi posts in-line Q4 inflows on risk-averse products Amundi, Europe's biggest fund manager, posted in-line quarterly inflows on Tuesday, as demand for risk-averse products remained strong over the last three months of the year.  Net inflows in the fourth quarter were 20.5 billion euros, bringing total assets under management (AUM) to a record 2.24 trillion euros ($2.30 trillion) at the end of December, up 10% from a year earlier.  Demand for safe investments such as medium and long-term assets through exchange-traded funds and exchange-traded commodities brought 10.5 billion euros of net inflows, bringing total ETF AUM to 268 billion euros at the end of December, up 30% from a year earlier. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->PARIS (Reuters) - Amundi, Europe's biggest fund manager, posted in-line quarterly inflows on Tuesday, as demand for risk-averse products remained strong over the last three months of the year.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Net inflows in the fourth quarter were 20.5 billion euros, bringing total assets under management (AUM) to a record 2.24 trillion euros ($2.30 trillion) at the end of December, up 10% from a year earlier.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Demand for safe investments such as medium and long-term assets through exchange-traded funds and exchange-traded commodities brought 10.5 billion euros of net inflows, bringing total ETF AUM to 268 billion euros at the end of December, up 30% from a year earlier.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In a call with reporters, Amundi Chief Executive Valerie Baudson signaled the group was still open to acquisitions, as the industry reignited a race to size after BNP Paribas, France's biggest bank, announced a 5.1 billion-euro acquisition of AXA's asset management arm.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We are still a potential market consolidator,\" she said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Amundi was among the rival bidders for AXA IM, people with knowledge of the matter have told Reuters. French bank BPCE and Italian insurer Generali announced the tie-up of their respective asset management activities two weeks ago.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Amundi's fourth-quarter adjusted net income was 377 million euros, up 20.5% and beating the 348-million euro analyst average estimate.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Adjusted net revenues over the period were up by close to 15% from a year earlier to 924 million euros. Amundi said it will propose a dividend of 4.25 euros per share at its shareholder meeting in May.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"The very beginning of 2025 confirms a very good sales dynamic, and we're confident about 2025 given all the partnerships and discussions we have with our customers,\" Baudson told reporters.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The group said it had achieved its main targets under its 2025 strategic plan a year in advance, including its goals around cost income and average annual net income growth.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Bertrand de Meyer and Mathieu Rosemain; Editing by Sam Holmes)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/amundi-posts-line-q4-inflows-061821686.html",
            "pub_date": "2025-02-04 14:18:21",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investors seek answers on Novo Nordisk's next-gen obesity drug CagriSema Novo Nordisk is under pressure from investors for more information about its next-generation obesity drug candidate CagriSema amid a lack of clarity over trial results that hammered its shares in December.  Novo believes CagriSema could be more powerful than its blockbuster weight-loss injection Wegovy, but investors are worried whether it will be good enough to retake the lead from rival Eli Lilly in the competitive obesity drug market.  In its December read-out, Novo said the most common adverse events in the trial were gastrointestinal and the vast majority were mild to moderate and diminished over time, consistent with CagriSema's broader class of GLP-1 receptor agonist drugs. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Maggie Fick and Robin Respaut<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->LONDON/SAN FRANCISCO (Reuters) - Novo Nordisk is under pressure from investors for more information about its next-generation obesity drug candidate CagriSema amid a lack of clarity over trial results that hammered its shares in December.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Novo believes CagriSema could be more powerful than its blockbuster weight-loss injection Wegovy, but investors are worried whether it will be good enough to retake the lead from rival Eli Lilly in the competitive obesity drug market.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In interviews with Reuters, five patients who participated in the trial that reported in December - or are part of a separate late-stage study - said the weekly injection helped them shed pounds quickly, but that they encountered what they characterised as significant side-effects including nausea, constipation and fatigue.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In its December read-out, Novo said the most common adverse events in the trial were gastrointestinal and the vast majority were mild to moderate and diminished over time, consistent with CagriSema's broader class of GLP-1 receptor agonist drugs.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Novo declined to comment for this story as it is in the regulatory quiet period ahead of quarterly results on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->While anecdotal, the interviews with the five patients shed some light on the experiences of those taking CagriSema and could hint at answers to questions sparked by the data about potential side-effects and the dosing regimen.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Weaker than expected data from the trial was a blow to Novo's ambitions to find a more powerful competitor to Lilly's Zepbound, also known as Mounjaro.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->CagriSema combines semaglutide, the active ingredient in Wegovy that mimics gut hormone GLP-1, with a separate molecule called cagrilintide that mimics pancreatic hormone amylin.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->One participant in the trial that reported in December said she repeatedly fainted during her first six months on CagriSema. Over the 68-week trial, she lost 29% of her body weight.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"I guess it's quite normal to feel awful when you lose 30 to 40 kilograms in the span of six months,\" said Jane, who asked to be identified by her middle name to protect her anonymity.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->After reaching the highest dose, she stopped losing weight as rapidly. \"I got used to it (the medicine). I felt better,\" she said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In December, Novo said people who adhered to the CagriSema treatment plan achieved overall weight loss of 22.7% after 68 weeks, with 40.4% losing 25% or more.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->That was lower than the 25% across-the-board weight loss it expected. The disappointment wiped as much as $125 billion off Novo's value on the day.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Novo also said only 57.3% of patients reached the highest dose of the medicine, but didn't explain why. Was it because patients suffered side-effects or because they lost weight on lower doses? Both could explain why they didn't progress to the highest dose.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Some investors and analysts were also surprised the trial used a \"flexible\" protocol, permitting patients to change their dose strength instead of adhering to a schedule.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->They said this could be a factor in the low take-up of the highest dose. Novo has said it will start a new trial by June.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->IN THE DARK<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In interviews with Reuters, more than a dozen investors and analysts called for more clarity about factors they say are weighing on Novo's shares. They hope to get more information at Wednesday's quarterly results.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But Novo may be limited in what it can say as it prepares to release full data and trial protocol at a scientific conference later this year, expected to be the American Diabetes Association meeting in June.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Lukas Leu, fund manager at healthcare-focused Bellevue Asset Management in Switzerland, which holds Novo shares, said he was disappointed Novo did not disclose the flexible dosing earlier or explain its reasons for doing so.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Novo's prior major semaglutide trials permitted participants to stay on lower doses if they experienced \"unacceptable side-effects\".<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In the STEP trial, which studied semaglutide for weight loss, 89.6% of patients completing the trial were receiving the highest dose.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"With CagriSema, people are assuming the worst – on efficacy the drug is not better than Lilly's tirzepatide, on tolerability that it is worse, and that it is harder to manufacture,\" said Barclays analyst Emily Field, referring to the active ingredient in Lilly's Zepbound/Mounjaro.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We don't necessarily agree with all those viewpoints, but given lack of additional commentary from the company, I understand why people are taking such a negative approach.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->'LIFE CHANGING'<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Reuters interviewed two people who participated in the CagriSema trial that reported in December, called REDEFINE-1, and three in an ongoing Phase III trial, called REDEFINE-4, which is testing CagriSema against Zepbound/Mounjaro.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->REDEFINE-1 patients did not know until after the trial ended which drug they received. REDEFINE-4 patients know which drug they are getting.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Michelle Rivera, who lives in Dallas, Texas, said she struggled to eat after she began taking CagriSema in the REDEFINE-4 trial.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Literally nothing was appetising,\" said Rivera, who has lost about 22% of her weight.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Rivera has taken CagriSema for a year and has six months left on the trial. Her appetite slowly returned after about six months on the drug. But she still eats much smaller portions, prioritising protein, water and fibre to fight constipation.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Her trial investigators were receptive to participants not increasing their dose if side-effects bothered them, she said. She kept to the recommended schedule and reached the maximum dose after about six months.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Another participant in the ongoing trial, Leigh, who asked to be identified by her middle name, said nausea, fatigue and brain fog she experiences in the 24 hours after her weekly CagriSema injection are so bad that she sometimes can't leave bed.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->She has, however, kept to the recommended dosing protocol in the hope of losing more weight. After a year on CagriSema, she has lost about 18% of her weight. The medicine is \"life changing\", she said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But when she finishes the trial this summer, she wants to explore whether a maintenance dose of a GLP-1 medicine would help her sustain weight loss without such intense side-effects.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"What I'm dealing with now, it's not sustainable,\" she said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Maggie Fick in London and Robin Respaut in San Francisco. Editing by Josephine Mason and Mark Potter)<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/investors-seek-answers-novo-nordisks-061007042.html",
            "pub_date": "2025-02-04 14:10:07",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Citi sticks to hybrid working, bucks return-to-office trend, FT reports Fraser promised to continue the hybrid work schedule on a quarterly call with the bank's managing directors in mid-January, the newspaper reported, citing people familiar with the matter.  Last month, U.S. President Donald Trump ordered federal workers to return to the office five days a week, reversing a trend that took off in the early stages of the COVID-19 pandemic.  Fraser believes Citi's more flexible in-office work requirements give it a competitive advantage, the Financial Times reported. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - Citigroup CEO Jane Fraser has informed top executives that the bank will continue to allow most employees to work remotely at least two days a week, Financial Times reported on Tuesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Fraser promised to continue the hybrid work schedule on a quarterly call with the bank's managing directors in mid-January, the newspaper reported, citing people familiar with the matter.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Last month, U.S. President Donald Trump ordered federal workers to return to the office five days a week, reversing a trend that took off in the early stages of the COVID-19 pandemic.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Major financial companies have been aggressive in enforcing return-to-office.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->CEOs of the biggest U.S. banks including JPMorgan, Goldman Sachs and Morgan Stanley have been strong advocates of working from the office, saying it fosters better learning, innovation and culture.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->JPMorgan Chase asked its employees who are on hybrid work schedules to return to the office five days a week starting in March, Reuters reported last month.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Fraser believes Citi's more flexible in-office work requirements give it a competitive advantage, the Financial Times reported.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Citigroup did not immediately respond to a Reuters request for comment.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Pretish M J in Bengaluru; Editing by Mrigank Dhaniwala)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/citi-sticks-hybrid-working-bucks-060548585.html",
            "pub_date": "2025-02-04 14:05:48",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UBS quarterly profit smashes expectations, $3 billion buyback unveiled UBS Group, Switzerland's largest bank, on Tuesday posted net income of $770 million for the fourth quarter of 2024, trouncing forecasts.  The lender also announced a share buyback program of up to $3 billion for this year, higher than the $2.2 billion analysts at Vontobel expected.  The bank also specified that the share repurchase amounts  were subject to \"the absence of material and immediate changes to the current capital regime in Switzerland.\" ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Ariane Luthi<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->ZURICH (Reuters) - UBS Group, Switzerland's largest bank, on Tuesday posted net income of $770 million for the fourth quarter of 2024, trouncing forecasts.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The net profit attributable to shareholders compared with an average estimate of $483 million in a company-provided poll of analysts.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The lender also announced a share buyback program of up to $3 billion for this year, higher than the $2.2 billion analysts at Vontobel expected.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->UBS said it planned to repurchase $1 billion of shares in the first half of 2025 and up to $2 billion in the second half while maintaining its target common equity tier 1 capital (CET1) ratio of around 14%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The bank also specified that the share repurchase amounts were subject to \"the absence of material and immediate changes to the current capital regime in Switzerland.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The results mark the fourth consecutive quarter of profit as UBS integrates Credit Suisse after acquiring its former rival in 2023.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Total revenues climbed 7% to $11.6 billion year-on-year, narrowly beating the company-provided consensus forecast of $11.5 billion.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Net new assets attracted in global wealth management during the quarter amounted to $18 billion, missing the $21 billion Zuercher Kantonalbank analysts had forecast.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->UBS is awaiting more clarity on plans to draw up stricter banking regulations in Switzerland following the collapse of Credit Suisse, which unravelled after a series of scandals.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->At the centre of the overhaul are plans to make UBS hold more capital to prevent a repeat of the Credit Suisse meltdown, but they have yet to make clear how much that will be.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->UBS says existing capital requirements are appropriate, and has warned the Swiss government that excessive demands could make the country's financial sector less competitive.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Investors have warmed to the Credit Suisse takeover, with UBS's shares rising by more than 80% since then.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->UBS Chief Executive Sergio Ermotti said last week that the migrating of Credit Suisse clients to its IT system was going well, but that it would remain a major focal point for the next 12 months.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Ariane Luthi; Editing by Dave Graham and Edwina Gibbs)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/ubs-quarterly-profit-smashes-expectations-060158547.html",
            "pub_date": "2025-02-04 14:01:58",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China puts PVH Corp, Illumina on its unreliable entity list China's Commerce Ministry said on Tuesday that it had put PVH Corp and Illumina on its unreliable entity list after the two companies took what it called \"discriminatory measures against Chinese enterprises\" and \"damaged\" legitimate rights and interests of Chinese companies. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->HONG KONG (Reuters) - China's Commerce Ministry said on Tuesday that it had put PVH Corp and Illumina on its unreliable entity list after the two companies took what it called \"discriminatory measures against Chinese enterprises\" and \"damaged\" legitimate rights and interests of Chinese companies.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Farah Master and the Beijing newsroom)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/china-puts-pvh-corp-illumina-055733293.html",
            "pub_date": "2025-02-04 13:57:33",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        }
    ]
}