{
    "data": [
        {
            "title": "Trump’s China tariffs are shutting the big loophole that make Shein and Temu so cheap When President Trump pushed ahead with a 10% tariff on all Chinese merchandise, he also closed the century-old de minimis exemption, which allows packages worth under $800 to be shipped into the country duty-free. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Some of the biggest losers from Donald Trump’s first new round of tariffs may have turned out to be cheap fashion fans.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->On Monday, the president doubled back on his threats to impose a 25% tax on imports from Mexico and Canada, agreeing to postpone the new levies for at least a month after winning some light concessions on border security from the two countries. However, Trump pushed ahead with a 10% tariff on all Chinese merchandise.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->As part of that move, the White House also announced that it would close the century-old de minimis exemption, which allows packages worth under $800 to be shipped into the country duty-free. That rule has allowed for the massive growth of Chinese discount retailers such as Shein and Temu, which ship everything from designer knockoff dresses to gaming monitors at rock-bottom prices directly to consumers from overseas warehouses, one tax-free bundle at a time.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->That rapid expansion was propelled by 2016 legislation, which increased the value limit of<em> </em>de minimis parcels to $800 from $200. The number of packages entering the country that way surged from 139 million in 2015 to more than 1.36 billion in 2024, <a class=\"link\" data-i13n=\"cpos:1;pos:1\" data-ylk=\"slk:according to U.S. Customs and Border Protection;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.cbp.gov/newsroom/national-media-release/cbp-proposes-new-rule-strengthen-enforcement-and-limit-duty\" rel=\"nofollow noopener\" target=\"_blank\">according to U.S. Customs and Border Protection</a>, and now account for 90% of all shipments into the US.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The increase has drawn frustration from American manufacturers and retailers, who’ve argued that the<em> </em>de minimis rule offers an unfair loophole that Chinese competitors have been able to exploit. Amazon (<a class=\"link\" data-i13n=\"cpos:2;pos:1\" data-ylk=\"slk:AMZN;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/quote/AMZN\">AMZN</a>), meanwhile, has recently tried to keep up with its insurgent competitors by building its own <a class=\"link\" data-i13n=\"cpos:3;pos:1\" data-ylk=\"slk:direct-from-China;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.marketplace.org/2024/06/28/amazon-launches-discount-section-china-temu-shein/\" rel=\"nofollow noopener\" target=\"_blank\">direct-from-China</a> marketplace — a “Temu clone” that earned <a class=\"link\" data-i13n=\"cpos:4;pos:1\" data-ylk=\"slk:some mixed reviews;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://nymag.com/intelligencer/article/amazon-haul-temu-competitor.html\" rel=\"nofollow noopener\" target=\"_blank\">some mixed reviews</a>.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The de minimis rule has also come under <a class=\"link\" data-i13n=\"cpos:5;pos:1\" data-ylk=\"slk:intense bipartisan scrutiny;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.reuters.com/investigates/special-report/drugs-fentanyl-shipping/\" rel=\"nofollow noopener\" target=\"_blank\">intense bipartisan scrutiny</a> in recent years for aiding drug traffickers, who’ve exploited it to move small packages containing the precursor chemicals used in the production of fentanyl undetected across borders. The sheer crush of packages arriving daily by the plane load has made it impossible to <a class=\"link\" data-i13n=\"cpos:6;pos:1\" data-ylk=\"slk:carefully inspect;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.reuters.com/investigates/special-report/drugs-fentanyl-shipping/\" rel=\"nofollow noopener\" target=\"_blank\">carefully inspect</a> most of them, allowing mass quantities of narcotics ingredients to make their way to cartels.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Biden administration <a class=\"link\" data-i13n=\"cpos:7;pos:1\" data-ylk=\"slk:proposed changes;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.cbp.gov/newsroom/national-media-release/cbp-proposes-new-rule-strengthen-enforcement-and-limit-duty\" rel=\"nofollow noopener\" target=\"_blank\">proposed changes</a> to <a class=\"link\" data-i13n=\"cpos:8;pos:1\" data-ylk=\"slk:significantly narrow;cpos:8;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.wiley.law/alert-Biden-Administration-Announces-Changes-to-De-Minimis-Trade-Exemptions-to-Address-Unfair-and-Unsafe-Imports-into-the-United-States\" rel=\"nofollow noopener\" target=\"_blank\">significantly narrow</a> the de minimis exception last year, predicting <a class=\"link\" data-i13n=\"cpos:9;pos:1\" data-ylk=\"slk:they would make;cpos:9;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.kelleydrye.com/viewpoints/blogs/trade-and-manufacturing-monitor/new-actions-announced-by-the-biden-harris-administration-may-signal-changes-to-de-minimis-exemption\" rel=\"nofollow noopener\" target=\"_blank\">they would make</a> about 40% of US imports and about 70% of clothing and textiles from China ineligible. But Trump’s new tariff rules will close it entirely for Chinese goods.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump’s approach “is more across the board, saying if it’s a product of China, it’s no longer de minimis,” said Andrew McAllister, a partner with Holland &amp; Knight. “It’s much more black and white.”<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em>Read more: </em><a class=\"link yahoo-link\" data-i13n=\"cpos:10;pos:1\" data-ylk=\"slk:What are tariffs, and how do they affect you?;cpos:10;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/personal-finance/taxes/article/what-is-a-tariff-194059448.html\"><em>What are tariffs, and how do they affect you?</em></a><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The change is also potentially a big blow to online bargain hunters looking to inexpensively upgrade their wardrobe. Chinese packages will be subject to a 10% tariff and potentially other duties applying to specific types of merchandise. Perhaps more importantly, shippers will also face new administrative fees that are paid to both US authorities and logistics companies that handle the customs process, which can average over $20 a package, according to a <a class=\"link\" data-i13n=\"cpos:11;pos:1\" data-ylk=\"slk:recent paper;cpos:11;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.nber.org/system/files/working_papers/w32607/w32607.pdf\" rel=\"nofollow noopener\" target=\"_blank\">recent paper</a> by economists at Yale and UCLA.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->That study found that ending the de minimis exemption would end up costing consumers about $11.4 billion via the new fees and tariffs, with the heaviest burden falling on poorer and minority households, which tend to purchase more goods directly from China.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Whether Trump’s new tariffs are entirely legal is not yet clear. The White House claims it has the authority to implement them under the International Emergency Economic Powers Act, a broad law from the Carter era that gives the president power to regulate international trade in order to deal with national emergencies. However, the statute has never been used to put tariffs in place, and some question whether the move will ultimately fly before the courts.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Given the financial stakes, especially for major e-commerce players, McAllister predicted some companies would likely file suit to overturn the tariffs. “We are going to see litigation, absolutely,” said McAllister.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em>Jordan Weissmann is a senior reporter at Yahoo Finance.</em><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:12;pos:1\" data-ylk=\"slk:Click here for the latest personal finance news to help you with investing, paying off debt, buying a home, retirement, and more;cpos:12;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/topic/personal-finance\"><strong>Click here for the latest personal finance news to help you with investing, paying off debt, buying a home, retirement, and more</strong></a><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:13;pos:1\" data-ylk=\"slk:Read the latest financial and business news from Yahoo;cpos:13;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/news/\"><strong>Read the latest financial and business news from Yahoo </strong></a><a class=\"link\" data-i13n=\"cpos:14;pos:1\" data-ylk=\"slk:Finance;cpos:14;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/news/\"><strong>Finance</strong></a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/trumps-china-tariffs-are-shutting-the-big-loophole-that-make-shein-and-temu-so-cheap-234229735.html",
            "pub_date": "2025-02-05 07:42:29",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enphase forecasts first-quarter revenue above expectations, shares rise The solar energy company forecast first-quarter revenue to be in the range of $340 million to $380 million, compared to analysts' expectations of $338.5 million, according to data compiled by LSEG.  The company said the forecast included shipments of 150 to 170 megawatt hours of IQ Batteries, which are used to store excess solar energy for later use, as well as about $50 million of safe harbor revenue, which is any sales made to customers who plan to install the inventory over more than one year.  In the U.S., Enphase's biggest market, revenue rose 6% sequentially due to higher microinverter sales in the quarter. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - Solar inverter maker Enphase Energy forecast first-quarter revenue above Wall Street expectations on Tuesday, after robust demand helped it post a better-than-expected fourth-quarter operating profit, sending its shares up about 6% after the bell.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The solar energy company forecast first-quarter revenue to be in the range of $340 million to $380 million, compared to analysts' expectations of $338.5 million, according to data compiled by LSEG.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company said the forecast included shipments of 150 to 170 megawatt hours of IQ Batteries, which are used to store excess solar energy for later use, as well as about $50 million of safe harbor revenue, which is any sales made to customers who plan to install the inventory over more than one year.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Stock up in after-market, but this (inclusion of 'safe harbor' revenue in Q1 guide) may be frowned upon as the Street fully digests it,\" GLJ Research LLC analyst Gordon L. Johnson said in a note.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In the U.S., Enphase's biggest market, revenue rose 6% sequentially due to higher microinverter sales in the quarter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Fremont, California-based company's adjusted net operating income came in at $120.4 million for the quarter ending Dec. 31, ahead of analysts' average estimate of $100.4 million, according to data compiled by LSEG.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Mrinalika Roy in Bengaluru; Editing by Alan Barona)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/enphase-forecasts-first-quarter-revenue-233520325.html",
            "pub_date": "2025-02-05 07:35:20",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Delaware Supreme Court eases path for some companies to leave state The Delaware Supreme Court on Tuesday issued a decision involving TripAdvisor that could make it easier for some companies to move out of the state, which is the corporate home for about two-thirds of the Fortune 500.  In a 5-0 decision, the court said a trial judge erred by making it too easy for TripAdvisor shareholders to hold controlling shareholder Greg Maffei liable for damages, should the online travel advice company's proposed move to Nevada benefit him at their expense.  Delaware's business-friendly laws have long made the state a favored home for companies, but some prominent business people have been packing up. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Jonathan Stempel<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - The Delaware Supreme Court on Tuesday issued a decision involving TripAdvisor that could make it easier for some companies to move out of the state, which is the corporate home for about two-thirds of the Fortune 500.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In a 5-0 decision, the court said a trial judge erred by making it too easy for TripAdvisor shareholders to hold controlling shareholder Greg Maffei liable for damages, should the online travel advice company's proposed move to Nevada benefit him at their expense.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Delaware's business-friendly laws have long made the state a favored home for companies, but some prominent business people have been packing up.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Elon Musk reincorporated Tesla in Texas after a Delaware judge struck down as \"unfathomable\" his $56 billion pay package, while billionaire William Ackman plans to move his management company's corporate base to Nevada.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Mark Zuckerberg meanwhile is mulling whether to move his company, Facebook parent Meta Platforms, to Texas from Delaware, the Wall Street Journal reported last week.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In the TripAdvisor case, shareholders Dennis Palkon and Herbert Williamson complained that a move to Nevada would reduce the company's value because the market values Nevada companies lower than Delaware companies.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->They also said a move would reduce the litigation exposure of Maffei, who chairs TripAdvisor's parent Liberty TripAdvisor, and other directors - providing them a so-called non-ratable benefit - because Nevada offers greater protections to corporate officers and boards than Delaware offers.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Last February, Vice Chancellor Travis Laster of the Delaware Chancery Court said TripAdvisor could reincorporate in Nevada but the move would be reviewed under Delaware's onerous \"entire fairness\" standard, potentially leading to a damages award.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But in Tuesday's decision, Supreme Court Justice Karen Valihura said the more lenient \"business judgment\" standard of review should apply because the objecting shareholders offered mere speculation about future liabilities.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Delaware policy has long recognized the values of flexibility and private ordering,\" she wrote. \"Declining to second-guess directors' decisions to redomesticate where there are no well-pled allegations of a material, non-ratable benefit flowing to the directors or controllers furthers this important policy.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Lawyers for Palkon and Williamson did not immediately respond to requests for comment. Matthew Close, a lawyer for Maffei, said he was pleased with the decision.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Musk, the world's richest person, is asking the Delaware Supreme Court to restore his Tesla pay package.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The case is Maffei et al v Palkon et al, Delaware Supreme Court, No. 125, 2024.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Jonathan Stempel in New York; Editing by Matthew Lewis)<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/delaware-supreme-court-eases-path-230701872.html",
            "pub_date": "2025-02-05 07:07:01",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Higher egg prices and more tariffs: What betting markets see for inflation and trade policy Betting markets got attention in 2024 for accurately predicting Trump's election win. Now bettors are predicting the path of inflation and trade policy. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"Donald Trump\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START --><span class=\"copyright\">Brandon Bell/Getty Images; iStock; Rebecca Zisser/BI</span><!-- HTML_TAG_END --> </figcaption> </figure> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Betting markets expect the Trump administration to unleash more tariffs in the coming months.<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The EU is likely the next region to face US protectionism, Polymarket bettors speculate.<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Inflation expectations have ticked higher amid tariff announcements on the US's top trading partners.<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Trump administration's <a class=\"link\" data-ylk=\"slk:tariff clash;elm:context_link;itc:0;sec:content-canvas\" href=\"https://markets.businessinsider.com/news/stocks/stock-market-today-trump-tariffs-sell-off-crypto-mexico-canada-2025-2?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">tariff clash</a> with some of America's closest trading partners has sent jitters across <a class=\"link\" data-ylk=\"slk:financial markets;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.businessinsider.com/trump-tariff-impact-stock-market-crypto-ethereum-oil-dollar-autos-2025-2?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">financial markets</a>, with investors wondering what's next as the potential for a wider trade war looms.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->For a clue, they might want to look at the betting markets.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Betting sites like Polymarket and Kalshi gained attention during the 2024 election when they <a class=\"link\" data-ylk=\"slk:accurately predicted Donald Trump's win;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.businessinsider.com/polymarket-whale-banked-85-million-profit-trump-president-election-win-2024-11?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">accurately predicted Donald Trump's win</a> even as polling averages indicated a dead heat. Since then, bettors have used these sites to wager on everything from pop culture to the weather.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This week, after the president announced double-digit tariffs on Mexico, Canada, and China, speculators on Polymarket and Kalshi have been betting that the president's protectionist streak won't end there.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Though Trump said as much on the campaign trail, the White House has offered few specifics on what to expect from a broader trade spat.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->If Polymarket speculators are correct, the European Union will be the next target. A <a class=\"link\" data-ylk=\"slk:bet on the site;elm:context_link;itc:0;sec:content-canvas\" href=\"https://polymarket.com/event/which-countries-will-trump-tariff-in-first-100-days?tid=1738611490413\" rel=\"nofollow noopener\" target=\"_blank\">bet on the site</a> that has seen about $173,000 of trading volume says there's an 83% chance the EU will face tariffs by April 29, within the window of Trump's first 100 days in office.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The president hinted at this outcome over the weekend, telling reporters that tariffs on the 27-country bloc could happen \"pretty soon.\" Europe's <a class=\"link\" data-ylk=\"slk:Stoxx 600;elm:context_link;itc:0;sec:content-canvas\" href=\"https://markets.businessinsider.com/index/stoxx_europe_600?utm_medium=ingest&amp;utm_medium=referral&amp;utm_source=markets&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">Stoxx 600</a> tumbled <a class=\"link\" data-ylk=\"slk:1.3% on his remarks;elm:context_link;itc:0;sec:content-canvas\" href=\"https://markets.businessinsider.com/news/stocks/markets-stocks-trump-trade-tariffs-sp500-djia-nasdaq-usd-2025-2?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">1.3% on his remarks</a> on Monday before recovering moderately.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A separate Polymarket <a class=\"link\" data-ylk=\"slk:bet;elm:context_link;itc:0;sec:content-canvas\" href=\"https://polymarket.com/event/how-large-will-trump-eu-tariffs-be?tid=1738612243160\" rel=\"nofollow noopener\" target=\"_blank\">bet</a> signals strong chances that EU tariffs will range from 10% to 20%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Otherwise, the bettors are forecasting a 36% probability that tariffs are coming for Panama, likely the result of rising friction over the Panama Canal. The Trump administration has called for the canal to be returned to US control, alleging Chinese influence and <a class=\"link\" data-ylk=\"slk:unfair treatment of US vessels;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.businessinsider.com/panama-canal-trump-no-exceptions-us-commercial-ships-fees-china-2025-1?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">unfair treatment of US vessels</a>.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->On Monday, Secretary of State Marco Rubio called on Panama to curb China's presence or face US action. What this could look like is unclear.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Bets on Kalshi signal bettors on the site see similar outcomes, though one bet shows a higher chance of tariffs on Colombia and South Korea.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Meanwhile, <span>bettors on Polymarket see</span> some chance that Taiwan and Colombia will get caught in Trump's trade disputes, though speculators see this as fairly unlikely, with chances at 38% and 20%. Some bettors think Denmark, which has clashed with Trump over Greenland's ownership, could also be a target.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Meanwhile, bettors aren't so sure that the current tariffs will last. Those on Polymarket see a <a class=\"link\" data-ylk=\"slk:64% chance;elm:context_link;itc:0;sec:content-canvas\" href=\"https://polymarket.com/event/will-trump-remove-blanket-tariff-on-canada-before-may?tid=1738616613498\" rel=\"nofollow noopener\" target=\"_blank\">64% chance</a> that the Trump administration will nix Canadian duties by May.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The president has framed the protectionist policy as a negotiating tool and delayed tariffs on both Mexico and Canada after reaching <a class=\"link\" data-ylk=\"slk:concessionary agreements;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.businessinsider.com/trump-canada-mexico-trade-tariff-pauses-china-retaliation-border-fentanyl-2025-2?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">concessionary agreements</a> with the two governments.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Betting markets are also eyeing a bellwether for inflation that became a rallying cry for politicians and voters in the last election — egg prices.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->If the bets are accurate, they're going up.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Speculators on Polymarket believe the price of a dozen <a class=\"link\" data-ylk=\"slk:eggs will keep rising;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.businessinsider.com/egg-prices-expensive-avian-bird-flu-changing-tastes-cage-free-2025-1?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">eggs will keep rising</a>, with the highest probability assigned to a range of $5.50 to $5.75 a dozen in February. According to data from <a class=\"link\" data-ylk=\"slk:the Federal Reserve Bank of St. Louis;elm:context_link;itc:0;sec:content-canvas\" href=\"https://fred.stlouisfed.org/series/APU0000708111\" rel=\"nofollow noopener\" target=\"_blank\">the Federal Reserve Bank of St. Louis</a>, the US city average for a dozen eggs was $4.14 in December.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->There are also bets that the consumer prices broadly will keep edging up this year.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It's a <a class=\"link\" data-ylk=\"slk:warning economists have been voicing;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.businessinsider.com/trump-tariffs-canada-mexico-trade-economy-krugman-summers-hanke-reich-2025-2?utm_medium=referral&amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\">warning economists have been voicing</a> since before Trump's election and a trend speculators are picking up on. On the same weekend that tariffs were announced, the outlook on Kalshi for inflation based on the consumer price index <a class=\"link\" data-ylk=\"slk:ticked up sharply;elm:context_link;itc:0;sec:content-canvas\" href=\"https://kalshi.com/markets/kxacpi/us-annual-inflation\" rel=\"nofollow noopener\" target=\"_blank\">ticked up sharply</a>. The highest chances for the 2025 inflation rate are now being assigned to a range of 2.6% to 3%, with 21% of bettors seeing consumer prices in that range by the end of the year.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Read the original article on <a class=\"link\" data-ylk=\"slk:Business Insider;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.businessinsider.com/trump-trade-tariffs-canada-mexico-eu-inflation-egg-prices-polymarket-2025-2\" rel=\"nofollow noopener\" target=\"_blank\">Business Insider</a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/higher-egg-prices-more-tariffs-222418306.html",
            "pub_date": "2025-02-05 07:05:16",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Prudential Financial quarterly profit rises on strength in investment management Markets have rallied as the Federal Reserve's rate cut injected confidence among investors on the economy avoiding a recession.  The sentiment was further boosted by business-friendly policies and deregulation to be implemented by new U.S. President Donald Trump.  Newark, New Jersey-based Prudential's PGIM, its global investment management business, said adjusted operating income rose to $259 million in the quarter from $172 million a year ago, driven by higher asset management fees. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - Prudential Financial reported a rise in fourth-quarter adjusted profit on Tuesday, as growth in the global investment management business offset weakness in the United States.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Markets have rallied as the Federal Reserve's rate cut injected confidence among investors on the economy avoiding a recession. The sentiment was further boosted by business-friendly policies and deregulation to be implemented by new U.S. President Donald Trump.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Newark, New Jersey-based Prudential's PGIM, its global investment management business, said adjusted operating income rose to $259 million in the quarter from $172 million a year ago, driven by higher asset management fees.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->However, the company's U.S. businesses, which consists of its retirement strategies, group insurance and individual life businesses, saw a near 11% decline in its adjusted operating income.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Assets under management climbed to $1.51 trillion in the fourth quarter, from $1.45 trillion a year ago.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company's after-tax adjusted operating income came in at $1.07 billion, or $2.96 per common share, in the three months ended Dec. 31, compared with $926 million, or $2.54 per share, a year earlier.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Prakhar Srivastava and Jaiveer Shekhawat in Bengaluru; Editing by Maju Samuel)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/prudential-financial-quarterly-profit-rises-225645178.html",
            "pub_date": "2025-02-05 06:56:45",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walmart to cut hundreds of roles, shut office in North Carolina, Fox News says Walmart is eliminating hundreds of roles and closing one of its North Carolina offices as it moves to relocate employees to its main hubs in California and Arkansas, Fox News reported on Tuesday, citing an internal memo.  The company is also asking office-based employees in Hoboken, New Jersey and some of its smaller offices to relocate to its newly opened headquarters in Bentonville, Arkansas and its office in Sunnyvale, California, the report said.  Walmart was not immediately available to comment. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->NEW YORK (Reuters) - Walmart is eliminating hundreds of roles and closing one of its North Carolina offices as it moves to relocate employees to its main hubs in California and Arkansas, Fox News reported on Tuesday, citing an internal memo.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company is also asking office-based employees in Hoboken, New Jersey and some of its smaller offices to relocate to its newly opened headquarters in Bentonville, Arkansas and its office in Sunnyvale, California, the report said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Walmart was not immediately available to comment.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Siddharth Cavale in New York)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/walmart-cut-hundreds-roles-shut-225112774.html",
            "pub_date": "2025-02-05 06:51:12",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kentucky lawmakers send bill to cut the state's income tax to the governor. He supports it. Kentucky lawmakers completed their work Tuesday to reduce the state’s individual income tax rate, delivering on a top Republican priority on just the fifth day of this year's session.  It continues a downward trend in the personal income tax rate since the GOP gained full control of the legislature in 2017.  Sen. Cassie Chambers Armstrong, one of three Senate Democrats voting against the bill, said the results would be lopsided, with wealthy Kentuckians benefiting disproportionately from the tax cut. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->FRANKFORT, Ky. (AP) — Kentucky lawmakers completed their work Tuesday to reduce the state’s individual income tax rate, delivering on a top Republican priority on just the fifth day of this year's session.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Final passage came on a 34-3 Senate vote to lower the tax to 3.5% from 4% at the start of 2026. The bill goes to Democratic Gov. Andy Beshear, who has said he supports the tax cut. It continues a downward trend in the personal income tax rate since the GOP gained full control of the legislature in 2017.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“It’s been said that there are only two things in life that are certain -– it’s death and taxes,\" Republican Sen. Chris McDaniel said during the debate Tuesday. \"We’ve added another thing that’s fairly certain — which is the General Assembly is going to do everything in its power, and frequently with success, to lower your taxes. And that’s what House Bill 1 is all about.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Supporters say the lower tax rate will promote long-term economic growth and population gains in the Bluegrass State by enabling people to keep more of the money they earn.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sen. Cassie Chambers Armstrong, one of three Senate Democrats voting against the bill, said the results would be lopsided, with wealthy Kentuckians benefiting disproportionately from the tax cut.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Democratic lawmaker said she values putting money back in Kentuckians' pockets, pointing to options she said would help struggling families most in need of tax relief. She touted a refundable child tax credit for low-income families and a sales tax exemption for diapers — proposals she is pushing.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->That brought a quick response from Republican Sen. Michael Nemes, who touted the relief for Kentuckians provided in the income tax cut. “They earned it,” he said. \"It’s their money, not ours.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The latest income tax cut is expected to save taxpayers another $718 million annually, supporters said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->House budget committee Chairman Jason Petrie said last month that there’s a “tremendous amount of room to keep the budget balanced” with the lower individual income tax rate in 2026.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The measure won united support from Senate Republicans, while Democrats were divided on the issue.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sen. David Yates, among the Democrats backing the bill, said it “feels safe” to lower the income tax in the current economic climate but added that the state should maintain a diverse tax structure. If the personal income tax keeps dropping until being eliminated, other taxes will increase, he said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Because you have to have taxes in order to run a system of government,” Yates said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Cutting the state's personal income tax has been a recurring priority for Republican lawmakers.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Since the passage of a tax overhaul in 2022, the individual income tax in Kentucky has gradually been reduced by increments of a half-percentage point, conditioned on meeting benchmarks to ensure revenues are sufficient to meet state spending needs. <a class=\"link\" data-ylk=\"slk:State officials announced last year;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/tax-cut-kentucky-dbe6c0fef7e5e4b3e8dddca281ffed4e\" rel=\"nofollow noopener\" target=\"_blank\">State officials announced last year</a> that the state had met the financial conditions needed to set in motion another cut in the tax rate for 2026.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->As part of the tax overhaul three years ago, the state sales tax was extended to apply to more services. Critics say lower-income families were hurt the most by putting sales tax on more services.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The House <a class=\"link\" data-ylk=\"slk:overwhelmingly passed;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/kentucky-legislature-individual-income-tax-021294d5f1d6e3d55de64e9fa489d463\" rel=\"nofollow noopener\" target=\"_blank\">overwhelmingly passed</a> the latest income tax cut on the third day of this year's 30-day session in early January. Lawmakers met four days last month before heading home for the rest of January, which is customary in 30-day sessions in odd-numbered years.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Senate took up the bill Tuesday, the first day that lawmakers reconvened since the January break. Republicans have supermajorities in both chambers, and the importance of the tax cut was reflected in it being designated as HB1, signifying its top-priority status.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->With the latest personal income tax cut headed to the governor's desk, the next question will be when the rate will be reduced again and by how much.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Several Senate Republicans said Tuesday that the latest cut is another step toward what they hope is the ultimate result — eliminating the individual income tax.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->GOP Sen. Gex Williams raised the prospect of making deeper incremental cuts in the income tax in future years, perhaps by three-quarters of a percent or a full 1%. Williams said he hopes that begins in the 60-day legislative session in 2026, when lawmakers will craft the state's next two-year budget.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“I am looking forward to this next session, that we will be able to strive for a greater than one-half percent cut,” Williams said.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/kentucky-lawmakers-send-bill-cut-223117575.html",
            "pub_date": "2025-02-05 06:31:17",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kimball Electronics (NASDAQ:KE) Misses Q4 Sales Targets Global electronics contract manufacturer Kimball Electronics (NYSE:KE) missed Wall Street’s revenue expectations in Q4 CY2024, with sales falling 15.2% year on year to $357.4 million. The company’s full-year revenue guidance of $1.42 billion at the midpoint came in 4.4% below analysts’ estimates. Its non-GAAP profit of $0.29 per share was 28.9% above analysts’ consensus estimates. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"KE Cover Image\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Kimball Electronics (NASDAQ:KE) Misses Q4 Sales Targets<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Global electronics contract manufacturer Kimball Electronics (NYSE:KE) missed Wall Street’s revenue expectations in Q4 CY2024, with sales falling 15.2% year on year to $357.4 million. The company’s full-year revenue guidance of $1.42 billion at the midpoint came in 4.4% below analysts’ estimates. Its non-GAAP profit of $0.29 per share was 28.9% above analysts’ consensus estimates.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is now the time to buy Kimball Electronics? <a class=\"link\" data-ylk=\"slk:Find out in our full research report;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/ke?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=top&amp;utm_article=Dlh2b24PYQ%3D%3D&amp;utm_ticker=KE\" rel=\"nofollow noopener\" target=\"_blank\">Find out in our full research report</a>.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Kimball Electronics (KE) Q4 CY2024 Highlights:<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue:</strong> $357.4 million vs analyst estimates of $360.1 million (15.2% year-on-year decline, 0.7% miss)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EPS:</strong> $0.29 vs analyst estimates of $0.23 (28.9% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company <strong>dropped its revenue guidance for the full year</strong> to $1.42 billion at the midpoint from $1.49 billion, a 4.7% decrease<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Operating Margin:</strong> 2.3%, down from 4.1% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Market Capitalization:</strong> $432.7 million<!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Commenting on today’s announcement, Richard D. Phillips, Chief Executive Officer, stated, “The results for the second quarter were in line with expectations as we continue to navigate a sustained period of declining customer demand, while focusing on what is controllable. For the fourth consecutive quarter, cash flow generated from operating activities was positive, inventory levels were reduced, and debt was paid down, with borrowings nearly 40% lower than a year ago. Our improved balance sheet provides ample liquidity to weather our current challenges, along with the necessary dry powder to opportunistically and meaningfully invest in growing the business.”<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Company Overview<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Founded in 1961, Kimball Electronics (NYSE:KE) is a global contract manufacturer specializing in electronics and manufacturing solutions for automotive, medical, and industrial markets.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Electrical Systems<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Like many equipment and component manufacturers, electrical systems companies are buoyed by secular trends such as connectivity and industrial automation. More specific pockets of strong demand include Internet of Things (IoT) connectivity and the 5G telecom upgrade cycle, which can benefit companies whose cables and conduits fit those needs. But like the broader industrials sector, these companies are also at the whim of economic cycles. Interest rates, for example, can greatly impact projects that drive demand for these products.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Sales Growth<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A company’s long-term performance is an indicator of its overall quality. While any business can experience short-term success, top-performing ones enjoy sustained growth for years. Regrettably, Kimball Electronics’s sales grew at a tepid 4.8% compounded annual growth rate over the last five years. This was below our standard for the industrials sector and is a rough starting point for our analysis.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Kimball Electronics Quarterly Revenue\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Kimball Electronics Quarterly Revenue<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We at StockStory place the most emphasis on long-term growth, but within industrials, a half-decade historical view may miss cycles, industry trends, or a company capitalizing on catalysts such as a new contract win or a successful product line. Kimball Electronics’s recent history shows its demand slowed as its revenue was flat over the last two years.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Kimball Electronics Year-On-Year Revenue Growth\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Kimball Electronics Year-On-Year Revenue Growth<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This quarter, Kimball Electronics missed Wall Street’s estimates and reported a rather uninspiring 15.2% year-on-year revenue decline, generating $357.4 million of revenue.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking ahead, sell-side analysts expect revenue to decline by 5.6% over the next 12 months, a deceleration versus the last two years. This projection is underwhelming and implies its products and services will see some demand headwinds.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Unless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) stock benefiting from the rise of AI. <a class=\"link\" data-ylk=\"slk:Click here to access our free report one of our favorites growth stories;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stock-pick-l/c7d6b86b-76fe-4aaf-86c6-563940fef8d6?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=SP_2&amp;utm_article=Dlh2b24PYQ%3D%3D&amp;utm_ticker=KE\" rel=\"nofollow noopener\" target=\"_blank\">Click here to access our free report one of our favorites growth stories</a>.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Adjusted Operating Margin<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Operating margin is an important measure of profitability as it shows the portion of revenue left after accounting for all core expenses – everything from the cost of goods sold to advertising and wages. It’s also useful for comparing profitability across companies with different levels of debt and tax rates because it excludes interest and taxes.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kimball Electronics was profitable over the last five years but held back by its large cost base. Its average operating margin of 4.4% was weak for an industrials business. This result isn’t too surprising given its low gross margin as a starting point.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking at the trend in its profitability, Kimball Electronics’s operating margin might have seen some fluctuations but has generally stayed the same over the last five years, which doesn’t help its cause.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Kimball Electronics Trailing 12-Month Operating Margin (GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Kimball Electronics Trailing 12-Month Operating Margin (GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Kimball Electronics generated an operating profit margin of 2.3%, down 1.8 percentage points year on year. Since Kimball Electronics’s operating margin decreased more than its gross margin, we can assume it was recently less efficient because expenses such as marketing, R&amp;D, and administrative overhead increased.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Earnings Per Share<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We track the long-term change in earnings per share (EPS) for the same reason as long-term revenue growth. Compared to revenue, however, EPS highlights whether a company’s growth is profitable.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kimball Electronics’s full-year EPS dropped 49.2%, or 10.5% annually, over the last four years. We tend to steer our readers away from companies with falling revenue and EPS, where diminishing earnings could imply changing secular trends and preferences. If the tide turns unexpectedly, Kimball Electronics’s low margin of safety could leave its stock price susceptible to large downswings.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Kimball Electronics Trailing 12-Month EPS (Non-GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Kimball Electronics Trailing 12-Month EPS (Non-GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Like with revenue, we analyze EPS over a more recent period because it can provide insight into an emerging theme or development for the business.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sadly for Kimball Electronics, its EPS declined by 18.1% annually over the last two years while its revenue was flat. This tells us the company struggled to adjust to choppy demand.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We can take a deeper look into Kimball Electronics’s earnings to better understand the drivers of its performance. Kimball Electronics’s operating margin has declined by 2 percentage points over the last two years. This was the most relevant factor (aside from the revenue impact) behind its lower earnings; taxes and interest expenses can also affect EPS but don’t tell us as much about a company’s fundamentals.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Kimball Electronics reported EPS at $0.29, down from $0.33 in the same quarter last year. Despite falling year on year, this print easily cleared analysts’ estimates. Over the next 12 months, Wall Street expects Kimball Electronics’s full-year EPS of $1.18 to grow 32.6%.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Key Takeaways from Kimball Electronics’s Q4 Results<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kimball Electronics's revenue in the quarter missed. Adding to the bad news was the company's lowering of its full-year revenue and operating margin guidance, which fell short of Wall Street’s estimates. Overall, this was a softer quarter. The stock traded down 4.5% to $17.06 immediately after reporting.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The latest quarter from Kimball Electronics’s wasn’t that good. One earnings report doesn’t define a company’s quality, though, so let’s explore whether the stock is a buy at the current price. We think that the latest quarter is just one piece of the longer-term business quality puzzle. Quality, when combined with valuation, can help determine if the stock is a buy. <a class=\"link\" data-ylk=\"slk:We cover that in our actionable full research report which you can read here, it’s free;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/ke?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=end1&amp;utm_article=Dlh2b24PYQ%3D%3D&amp;utm_ticker=KE\" rel=\"nofollow noopener\" target=\"_blank\">We cover that in our actionable full research report which you can read here, it’s free</a>.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/kimball-electronics-nasdaq-ke-misses-222233933.html",
            "pub_date": "2025-02-05 06:22:33",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Columbia Sportswear (NASDAQ:COLM) Beats Q4 Sales Targets But Stock Drops Outerwear manufacturer Columbia Sportswear (NASDAQ:COLM) beat Wall Street’s revenue expectations in Q4 CY2024, with sales up 3.5% year on year to $1.10 billion. On the other hand, next quarter’s revenue guidance of $756.5 million was less impressive, coming in 5.3% below analysts’ estimates. Its GAAP profit of $1.80 per share was 7.3% below analysts’ consensus estimates. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"COLM Cover Image\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Columbia Sportswear (NASDAQ:COLM) Beats Q4 Sales Targets But Stock Drops<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Outerwear manufacturer Columbia Sportswear (NASDAQ:COLM) beat Wall Street’s revenue expectations in Q4 CY2024, with sales up 3.5% year on year to $1.10 billion. On the other hand, next quarter’s revenue guidance of $756.5 million was less impressive, coming in 5.3% below analysts’ estimates. Its GAAP profit of $1.80 per share was 7.3% below analysts’ consensus estimates.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is now the time to buy Columbia Sportswear? <a class=\"link\" data-ylk=\"slk:Find out in our full research report;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/colm?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=top&amp;utm_article=Dlh2b2gBYA%3D%3D&amp;utm_ticker=COLM\" rel=\"nofollow noopener\" target=\"_blank\">Find out in our full research report</a>.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Columbia Sportswear (COLM) Q4 CY2024 Highlights:<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue:</strong> $1.10 billion vs analyst estimates of $1.08 billion (3.5% year-on-year growth, 1.4% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>EPS (GAAP):</strong> $1.80 vs analyst expectations of $1.94 (7.3% miss)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EBITDA:</strong> $175.9 million vs analyst estimates of $177 million (16% margin, 0.6% miss)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Management’s <strong>revenue guidance</strong> for the upcoming financial <strong>year 2025</strong> is $3.44 billion at the midpoint, missing analyst estimates by 1.4% and implying 2% growth (vs -4.1% in FY2024)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>EPS (GAAP) guidance for the upcoming financial year 2025</strong> is $3.98 at the midpoint, missing analyst estimates by 8%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Operating Margin:</strong> 12.5%, up from 10.7% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Free Cash Flow Margin:</strong> 55.6%, down from 56.7% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Market Capitalization:</strong> $4.87 billion<!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Chairman, President and Chief Executive Officer Tim Boyle commented, “I’m encouraged that sales returned to growth in the fourth quarter, and we expect continued growth in 2025, across most brands and regions. During the year we made substantial progress on our inventory reduction efforts, achieved cost savings through our Profit Improvement Program, and returned meaningful cash to shareholders through share buybacks and dividends. We also laid the foundation for Columbia’s ACCELERATE Growth Strategy, which will come to life in the seasons ahead.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Company Overview<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Originally founded as a hat store in 1938, Columbia Sportswear (NASDAQ:COLM) is a manufacturer of outerwear, sportswear, and footwear designed for outdoor enthusiasts.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Apparel and Accessories<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Thanks to social media and the internet, not only are styles changing more frequently today than in decades past but also consumers are shifting the way they buy their goods, favoring omnichannel and e-commerce experiences. Some apparel and accessories companies have made concerted efforts to adapt while those who are slower to move may fall behind.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Sales Growth<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Reviewing a company’s long-term sales performance reveals insights into its quality. Any business can have short-term success, but a top-tier one grows for years. Regrettably, Columbia Sportswear’s sales grew at a weak 2.1% compounded annual growth rate over the last five years. This fell short of our benchmarks and is a poor baseline for our analysis.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Columbia Sportswear Quarterly Revenue\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Columbia Sportswear Quarterly Revenue<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We at StockStory place the most emphasis on long-term growth, but within consumer discretionary, a stretched historical view may miss a company riding a successful new product or trend. Columbia Sportswear’s history shows it grew in the past but relinquished its gains over the last two years, as its revenue fell by 1.4% annually.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Columbia Sportswear Year-On-Year Revenue Growth\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Columbia Sportswear Year-On-Year Revenue Growth<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This quarter, Columbia Sportswear reported modest year-on-year revenue growth of 3.5% but beat Wall Street’s estimates by 1.4%. Company management is currently guiding for a 1.8% year-on-year decline in sales next quarter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking further ahead, sell-side analysts expect revenue to grow 3.6% over the next 12 months. While this projection suggests its newer products and services will fuel better top-line performance, it is still below average for the sector.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Here at StockStory, we certainly understand the potential of thematic investing. Diverse winners from Microsoft (MSFT) to Alphabet (GOOG), Coca-Cola (KO) to Monster Beverage (MNST) could all have been identified as promising growth stories with a megatrend driving the growth. So, in that spirit, we’ve identified <a class=\"link\" data-ylk=\"slk:a relatively under-the-radar profitable growth stock benefiting from the rise of AI, available to you FREE via this link;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stock-pick-l/c7d6b86b-76fe-4aaf-86c6-563940fef8d6?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=SP_6&amp;utm_article=Dlh2b2gBYA%3D%3D&amp;utm_ticker=COLM\" rel=\"nofollow noopener\" target=\"_blank\">a relatively under-the-radar profitable growth stock benefiting from the rise of AI, available to you FREE via this link</a>.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Cash Is King<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Free cash flow isn't a prominently featured metric in company financials and earnings releases, but we think it's telling because it accounts for all operating and capital expenses, making it tough to manipulate. Cash is king.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Columbia Sportswear has shown impressive cash profitability, giving it the option to reinvest or return capital to investors. The company’s free cash flow margin averaged 15.6% over the last two years, better than the broader consumer discretionary sector. The divergence from its underwhelming operating margin stems from the add-back of non-cash charges like depreciation and stock-based compensation. GAAP operating profit expenses these line items, but free cash flow does not.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Columbia Sportswear Trailing 12-Month Free Cash Flow Margin\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Columbia Sportswear Trailing 12-Month Free Cash Flow Margin<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Columbia Sportswear’s free cash flow clocked in at $609.4 million in Q4, equivalent to a 55.6% margin. The company’s cash profitability regressed as it was 1.1 percentage points lower than in the same quarter last year, but it’s still above its two-year average. We wouldn’t read too much into this quarter’s decline because investment needs can be seasonal, leading to short-term swings. Long-term trends are more important.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Over the next year, analysts predict Columbia Sportswear’s cash conversion will fall. Their consensus estimates imply its free cash flow margin of 14.6% for the last 12 months will decrease to 6.1%.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Key Takeaways from Columbia Sportswear’s Q4 Results<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It was good to see Columbia Sportswear narrowly top analysts’ revenue expectations this quarter. On the other hand, its full-year EPS guidance missed and its EPS fell short of Wall Street’s estimates. Overall, this was a weaker quarter. The stock traded down 7.6% to $79.37 immediately following the results.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Columbia Sportswear’s latest earnings report disappointed. One quarter doesn’t define a company’s quality, so let’s explore whether the stock is a buy at the current price. The latest quarter does matter, but not nearly as much as longer-term fundamentals and valuation, when deciding if the stock is a buy. <a class=\"link\" data-ylk=\"slk:We cover that in our actionable full research report which you can read here, it’s free;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/colm?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=end1&amp;utm_article=Dlh2b2gBYA%3D%3D&amp;utm_ticker=COLM\" rel=\"nofollow noopener\" target=\"_blank\">We cover that in our actionable full research report which you can read here, it’s free</a>.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/columbia-sportswear-nasdaq-colm-beats-221521670.html",
            "pub_date": "2025-02-05 06:15:21",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enphase (NASDAQ:ENPH) Beats Q4 Sales Targets, Stock Soars Home energy technology company Enphase (NASDAQ:ENPH) reported revenue ahead of Wall Street’s expectations in Q4 CY2024, with sales up 26.5% year on year to $382.7 million. On top of that, next quarter’s revenue guidance ($360 million at the midpoint) was surprisingly good and 6.4% above what analysts were expecting. Its non-GAAP profit of $0.94 per share was 24.7% above analysts’ consensus estimates. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"ENPH Cover Image\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase (NASDAQ:ENPH) Beats Q4 Sales Targets, Stock Soars<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Home energy technology company Enphase (NASDAQ:ENPH) reported revenue ahead of Wall Street’s expectations in Q4 CY2024, with sales up 26.5% year on year to $382.7 million. On top of that, next quarter’s revenue guidance ($360 million at the midpoint) was surprisingly good and 6.4% above what analysts were expecting. Its non-GAAP profit of $0.94 per share was 24.7% above analysts’ consensus estimates.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is now the time to buy Enphase? <a class=\"link\" data-ylk=\"slk:Find out in our full research report;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/enph?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=top&amp;utm_article=Dlh2b2gHZQ%3D%3D&amp;utm_ticker=ENPH\" rel=\"nofollow noopener\" target=\"_blank\">Find out in our full research report</a>.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Enphase (ENPH) Q4 CY2024 Highlights:<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue:</strong> $382.7 million vs analyst estimates of $376.8 million (26.5% year-on-year growth, 1.6% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EPS:</strong> $0.94 vs analyst estimates of $0.75 (24.7% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EBITDA:</strong> $127.3 million vs analyst estimates of $121.8 million (33.3% margin, 4.5% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue Guidance for Q1 CY2025</strong> is $360 million at the midpoint, above analyst estimates of $338.4 million<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Operating Margin:</strong> 14.3%, up from -11.9% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Free Cash Flow Margin:</strong> 41.6%, up from 5.1% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Sales Volumes</strong> rose 26% year on year (-67.3% in the same quarter last year)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Market Capitalization:</strong> $8.63 billion<!-- HTML_TAG_END --></p> </li> </ul> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Company Overview<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The first company to successfully commercialize the solar micro-inverter, Enphase (NASDAQ:ENPH) manufactures software-driven home energy products.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Renewable Energy<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Renewable energy companies are buoyed by the secular trend of green energy that is upending traditional power generation. Those who innovate and evolve with this dynamic market can win share while those who continue to rely on legacy technologies can see diminishing demand, which includes headwinds from increasing regulation against “dirty” energy. Additionally, these companies are at the whim of economic cycles, as interest rates can impact the willingness to invest in renewable energy projects.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Sales Growth<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Examining a company’s long-term performance can provide clues about its quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Over the last five years, Enphase grew its sales at an incredible 16.3% compounded annual growth rate. Its growth beat the average industrials company and shows its offerings resonate with customers.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Enphase Quarterly Revenue\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase Quarterly Revenue<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We at StockStory place the most emphasis on long-term growth, but within industrials, a half-decade historical view may miss cycles, industry trends, or a company capitalizing on catalysts such as a new contract win or a successful product line. Enphase’s recent history marks a sharp pivot from its five-year trend as its revenue has shown annualized declines of 24.5% over the last two years.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Enphase Year-On-Year Revenue Growth\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase Year-On-Year Revenue Growth<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We can better understand the company’s revenue dynamics by analyzing its units sold, which reached 2.01 million in the latest quarter. Over the last two years, Enphase’s units sold averaged 15.8% year-on-year declines. Because this number is better than its revenue growth, we can see the company’s average selling price decreased.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Enphase Units Sold\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase Units Sold<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This quarter, Enphase reported robust year-on-year revenue growth of 26.5%, and its $382.7 million of revenue topped Wall Street estimates by 1.6%. Company management is currently guiding for a 36.7% year-on-year increase in sales next quarter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking further ahead, sell-side analysts expect revenue to grow 21.8% over the next 12 months, an improvement versus the last two years. This projection is eye-popping and suggests its newer products and services will fuel better top-line performance.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Here at StockStory, we certainly understand the potential of thematic investing. Diverse winners from Microsoft (MSFT) to Alphabet (GOOG), Coca-Cola (KO) to Monster Beverage (MNST) could all have been identified as promising growth stories with a megatrend driving the growth. So, in that spirit, we’ve identified <a class=\"link\" data-ylk=\"slk:a relatively under-the-radar profitable growth stock benefiting from the rise of AI, available to you FREE via this link;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stock-pick-l/c7d6b86b-76fe-4aaf-86c6-563940fef8d6?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=SP_6&amp;utm_article=Dlh2b2gHZQ%3D%3D&amp;utm_ticker=ENPH\" rel=\"nofollow noopener\" target=\"_blank\">a relatively under-the-radar profitable growth stock benefiting from the rise of AI, available to you FREE via this link</a>.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Adjusted Operating Margin<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Enphase has been an efficient company over the last five years. It was one of the more profitable businesses in the industrials sector, boasting an average operating margin of 15.6%. This result isn’t surprising as its high gross margin gives it a favorable starting point.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Analyzing the trend in its profitability, Enphase’s operating margin decreased by 23.3 percentage points over the last five years. Even though its historical margin is high, shareholders will want to see Enphase become more profitable in the future.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Enphase Trailing 12-Month Operating Margin (GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase Trailing 12-Month Operating Margin (GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Enphase generated an operating profit margin of 14.3%, up 26.2 percentage points year on year. The increase was solid, and since its operating margin rose more than its gross margin, we can infer it was recently more efficient with expenses such as marketing, R&amp;D, and administrative overhead.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Earnings Per Share<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Revenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Enphase’s EPS grew at an astounding 20% compounded annual growth rate over the last five years, higher than its 16.3% annualized revenue growth. However, we take this with a grain of salt because its operating margin didn’t expand and it didn’t repurchase its shares, meaning the delta came from reduced interest expenses or taxes.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Enphase Trailing 12-Month EPS (Non-GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase Trailing 12-Month EPS (Non-GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Like with revenue, we analyze EPS over a shorter period to see if we are missing a change in the business.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Enphase’s two-year annual EPS declines of 28.4% were bad and lower than its two-year revenue performance.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Enphase reported EPS at $0.94, up from $0.54 in the same quarter last year. This print easily cleared analysts’ estimates, and shareholders should be content with the results. Over the next 12 months, Wall Street expects Enphase’s full-year EPS of $2.37 to grow 50.3%.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Key Takeaways from Enphase’s Q4 Results<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We enjoyed seeing Enphase exceed analysts’ EPS expectations this quarter. We were also glad its revenue guidance for next quarter came in higher than Wall Street’s estimates. On the other hand, its sales volume slightly missed. Overall, we think this was a decent quarter with some key metrics above expectations. The stock traded up 6% to $70.24 immediately after reporting.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Indeed, Enphase had a rock-solid quarterly earnings result, but is this stock a good investment here? When making that decision, it’s important to consider its valuation, business qualities, as well as what has happened in the latest quarter. <a class=\"link\" data-ylk=\"slk:We cover that in our actionable full research report which you can read here, it’s free;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/enph?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=end1&amp;utm_article=Dlh2b2gHZQ%3D%3D&amp;utm_ticker=ENPH\" rel=\"nofollow noopener\" target=\"_blank\">We cover that in our actionable full research report which you can read here, it’s free</a>.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/enphase-nasdaq-enph-beats-q4-221447947.html",
            "pub_date": "2025-02-05 06:14:47",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        }
    ]
}