{
    "data": [
        {
            "title": "Factbox-What are Ukraine's rare earths and why does Trump want them? U.S. President Donald Trump said on Monday he wanted Ukraine to supply the country with rare earths in return for financially supporting Kyiv's war effort against Russia.  The remark appears to overlap with part of a war strategy, known as the \"victory plan\", that President Volodymyr Zelenskiy presented to Kyiv's allies, including Donald Trump, last autumn.  Among other things, the plan proposes reaching agreements with foreign partners to provide joint access to Ukraine's  strategically valuable resources. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->KYIV (Reuters) - U.S. President Donald Trump said on Monday he wanted Ukraine to supply the country with rare earths in return for financially supporting Kyiv's war effort against Russia.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The remark appears to overlap with part of a war strategy, known as the \"victory plan\", that President Volodymyr Zelenskiy presented to Kyiv's allies, including Donald Trump, last autumn.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Among other things, the plan proposes reaching agreements with foreign partners to provide joint access to Ukraine's strategically valuable resources.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It was not immediately clear if Trump was referring to all types of critical minerals or just to rare earths. He said the United States was looking to do a deal with Ukraine for \"their rare earths and other things.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Rare earths are a group of 17 metals used to make magnets that turn power into motion for electric vehicles, cell phones, missile systems and other electronics. There are no known substitutes.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China, with whom Trump has threatened a trade war, is the world's largest producer of rare earths and many other critical minerals.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump has also expressed interest in making Greenland, an autonomous territory of Denmark which also sits on large rare earth deposits, a part of the U.S. since his reelection.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The U.S. Geological Survey considers 50 minerals to be critical, including several types of rare earths, nickel and lithium.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ukraine has deposits of 22 of the 34 minerals identified by the European Union as critical, according to economy ministry data. This includes industrial and construction materials, ferroalloy, precious and non-ferrous metals and some rare earth elements. Ukraine also has significant reserves of coal; however, most of them are now under the control of Russia in occupied territory.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Following is an overview of Ukraine's natural resources that could be of interest to the U.S. and other partners.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->WHAT ARE UKRAINE'S RARE EARTHS AND WHAT ARE THEY USED FOR?<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Known as the bread basket of Europe, Ukraine also boasts vast mineral resources.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Some of those critical raw materials are essential for industries such as defence, high-tech appliances, aerospace and green energy.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->According to the Institute of Geology, Ukraine possesses rare earth elements such as lanthanum and cerium, used in TVs and lighting, neodymium, used in wind turbines and EV batteries, as well as erbium and yttrium, whose applications range from nuclear power to lasers. The European Union-funded research also indicates that Ukraine has scandium reserves. Detailed data on reserves are classified.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Mining analysts and economists said that Ukraine does not have any commercially operating rare earth mines.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->According to the World Economic Forum, Ukraine is a key potential supplier of materials including titanium, lithium, beryllium, manganese, gallium, uranium, zirconium, graphite, apatite, fluorite and nickel.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Ukrainian State Geological Service said the country holds the largest titanium reserves in Europe, or about 7% of the world's reserves and has one of Europe's largest confirmed lithium reserves estimated at 500,000 metric tons - vital for batteries, ceramics, and glass. Titanium reserves are mostly located in central Ukraine, while lithium is in the centre, east and southeast of the country.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ukraine's reserves of graphite, a key component in electric vehicle batteries and nuclear reactors, represent 20% of global resources. The deposits are in the centre and west of the country.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->WHICH UKRAINIAN RESOURCES ARE UNDER KYIV'S CONTROL?<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The war has caused widespread damage across Ukraine and Russia now controls around a fifth of the country's territory.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The bulk of Ukraine’s coal deposits, which powered Ukraine’s steel industry before the war, are concentrated in the east and have been lost.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->About 40% of Ukraine's metal resources are now under Russian occupation, according to estimates by Ukrainian think-tanks We Build Ukraine and the National Institute of Strategic Studies, citing data up to the first half of 2024. They provided no detailed breakdown.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Since then, Russian troops have continued to advance steadily in the eastern Donetsk region. In January, Ukraine closed its only coking coal mine outside the region's city of Pokrovsk, which Moscow's forces are trying to capture.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Russia has occupied at least two Ukrainian lithium deposits during the war - one in Donetsk and another in the Zaporizhzhia region in the southeast. Kyiv still controls lithium deposits in the central Kyrovohrad region.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->WHAT ARE THE OPPORTUNITIES AND CHALLENGES FOR MINING IN UKRAINE?<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Oleksiy Sobolev, first deputy economy minister, said in January the government was working on deals with Western allies, including the United States, Britain, France and Italy on projects related to exploiting critical materials. The government estimates the total sector's investment potential at about $12-15 billion by 2033.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The State Geological Service said the government was preparing about 100 sites to be jointly licensed and developed but provided no further details.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Although Ukraine has a highly qualified and relatively inexpensive labour force and developed infrastructure, investors highlight a number of barriers to investment, including inefficient and complex regulatory processes, as well as difficulty accessing geological data and obtaining land plots.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Such projects would take years to develop and require considerable up-front investment, they said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Olena Harmash, Editing by Louise Heavens)<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/factbox-ukraines-rare-earths-why-130917752.html",
            "pub_date": "2025-02-05 21:09:17",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Reynolds (NASDAQ:REYN) Beats Q4 Sales Targets Household products company Reynolds (NASDAQ:REYN) reported Q4 CY2024 results beating Wall Street’s revenue expectations, with sales up 1.4% year on year to $1.02 billion. Its non-GAAP profit of $0.65 per share was 12.5% above analysts’ consensus estimates. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"REYN Cover Image\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Reynolds (NASDAQ:REYN) Beats Q4 Sales Targets<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Household products company Reynolds (NASDAQ:REYN) reported Q4 CY2024 results beating Wall Street’s revenue expectations , with sales up 1.4% year on year to $1.02 billion. Its non-GAAP profit of $0.65 per share was 12.5% above analysts’ consensus estimates.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is now the time to buy Reynolds? <a class=\"link\" data-ylk=\"slk:Find out in our full research report;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/reyn?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=top&amp;utm_article=DllwaGwFZA%3D%3D&amp;utm_ticker=REYN\" rel=\"nofollow noopener\" target=\"_blank\">Find out in our full research report</a>.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Reynolds (REYN) Q4 CY2024 Highlights:<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue:</strong> $1.02 billion vs analyst estimates of $971 million (1.4% year-on-year growth, 5.2% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EPS:</strong> $0.65 vs analyst estimates of $0.58 (12.5% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EBITDA:</strong> $213 million vs analyst estimates of $214.4 million (20.9% margin, 0.6% miss)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EPS guidance for the upcoming financial year 2025</strong> is $1.65 at the midpoint, missing analyst estimates by 6.6%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>EBITDA guidance for the upcoming financial year 2025</strong> is $680 million at the midpoint, below analyst estimates of $702.7 million<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Operating Margin:</strong> 17.6%, down from 20.5% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Free Cash Flow Margin:</strong> 13.8%, down from 19.3% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Organic Revenue</strong> rose 1% year on year (-8% in the same quarter last year)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Sales Volumes</strong> rose 2% year on year (-7% in the same quarter last year)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Market Capitalization:</strong> $5.84 billion<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Our retail volume accelerated in the fourth quarter, and we have the team, business model and resources to drive strong growth, further margin expansion and consistently attractive shareholder returns,” said Scott Huckins, President and Chief Executive Officer.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Company Overview<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Best known for its aluminum foil, Reynolds (NASDAQ:REYN) is a household products company whose products focus on food storage, cooking, and waste.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Household Products<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Household products stocks are generally stable investments, as many of the industry's products are essential for a comfortable and functional living space. Recently, there's been a growing emphasis on eco-friendly and sustainable offerings, reflecting the evolving consumer preferences for environmentally conscious options. These trends can be double-edged swords that benefit companies who innovate quickly to take advantage of them and hurt companies that don't invest enough to meet consumers where they want to be with regards to trends.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Sales Growth<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A company’s long-term performance is an indicator of its overall quality. While any business can experience short-term success, top-performing ones enjoy sustained growth for years.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->With $3.69 billion in revenue over the past 12 months, Reynolds carries some recognizable products but is a mid-sized consumer staples company. Its size could bring disadvantages compared to larger competitors benefiting from better brand awareness and economies of scale.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->As you can see below, Reynolds’s 1.3% annualized revenue growth over the last three years was weak as consumers bought less of its products. We’ll explore what this means in the \"Volume Growth\" section.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Reynolds Quarterly Revenue\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Reynolds Quarterly Revenue<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This quarter, Reynolds reported modest year-on-year revenue growth of 1.4% but beat Wall Street’s estimates by 5.2%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking ahead, sell-side analysts expect revenue to remain flat over the next 12 months. This projection doesn't excite us and implies its newer products will not catalyze better top-line performance yet.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Today’s young investors likely haven’t read the timeless lessons in Gorilla Game: Picking Winners In High Technology because it was written more than 20 years ago when Microsoft and Apple were first establishing their supremacy. But if we apply the same principles, then enterprise software stocks leveraging their own generative AI capabilities may well be the Gorillas of the future. So, in that spirit, we are excited to present our Special Free Report on <a class=\"link\" data-ylk=\"slk:a profitable, fast-growing enterprise software stock that is already riding the automation wave and looking to catch the generative AI next;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stock-pick-l/9b432064-0e9d-4b23-ac83-dbaef0f84b4e?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=SP_5&amp;utm_article=DllwaGwFZA%3D%3D&amp;utm_ticker=REYN\" rel=\"nofollow noopener\" target=\"_blank\">a profitable, fast-growing enterprise software stock that is already riding the automation wave and looking to catch the generative AI next</a>.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Volume Growth<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Revenue growth can be broken down into changes in price and volume (the number of units sold). While both are important, volume is the lifeblood of a successful staples business as there’s a ceiling to what consumers will pay for everyday goods; they can always trade down to non-branded products if the branded versions are too expensive.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->To analyze whether Reynolds generated its growth (or lack thereof) from changes in price or volume, we can compare its volume growth to its organic revenue growth, which excludes non-fundamental impacts on company financials like mergers and currency fluctuations.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Over the last two years, Reynolds’s average quarterly volumes have shrunk by 1.7%. This isn’t ideal for a consumer staples company, where demand is typically stable. In the context of its 1.6% average organic sales declines, we can see that most of the company’s losses have come from fewer customers purchasing its products.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Reynolds Year-On-Year Volume Growth\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Reynolds Year-On-Year Volume Growth<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Reynolds’s Q4 2024, sales volumes jumped 2% year on year. This result was a well-appreciated turnaround from its historical levels, showing the company is heading in the right direction.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Key Takeaways from Reynolds’s Q4 Results<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Reynolds beat analysts’ organic revenue expectations this quarter, leading to a revenue beat. On the other hand, both its EPS and EBITDA guidance for the upcoming year fell short of Wall Street’s estimates. This outlook is weighing on shares. The stock traded down 3.1% to $27 immediately after reporting.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is Reynolds an attractive investment opportunity right now? The latest quarter does matter, but not nearly as much as longer-term fundamentals and valuation, when deciding if the stock is a buy. <a class=\"link\" data-ylk=\"slk:We cover that in our actionable full research report which you can read here, it’s free;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/reyn?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=end1&amp;utm_article=DllwaGwFZA%3D%3D&amp;utm_ticker=REYN\" rel=\"nofollow noopener\" target=\"_blank\">We cover that in our actionable full research report which you can read here, it’s free</a>.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/reynolds-nasdaq-reyn-beats-q4-125844909.html",
            "pub_date": "2025-02-05 20:58:44",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US futures knocked by Alphabet earnings; gold strikes record U.S. stock futures fell on Wednesday after disappointing earnings from Alphabet, while the dollar took a dive against the yen, which rallied sharply after Japanese wage data upped the chances of another rate hike.  Investors shrugged off comments from President Donald Trump that the U.S. would like to take over the war-ravaged Gaza Strip and develop it economically.  S&P 500 futures fell 0.5% and Nasdaq futures lost 0.9%. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Wayne Cole and Amanda Cooper<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->SYDNEY/LONDON (Reuters) - U.S. stock futures fell on Wednesday after disappointing earnings from Alphabet, while the dollar took a dive against the yen, which rallied sharply after Japanese wage data upped the chances of another rate hike.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Investors shrugged off comments from President Donald Trump that the U.S. would like to take over the war-ravaged Gaza Strip and develop it economically.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The suggestion came out of the blue and underlined the risk of more policy uncertainty and market volatility ahead. Gold hit another record high, driven mostly by a weaker dollar.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->S&amp;P 500 futures fell 0.5% and Nasdaq futures lost 0.9%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Trump’s comments on Gaza and potential U.S. military occupation are not being taken seriously by investors. There may be ramifications in bringing about a broader peace settlement, and comments like these also possibly lessen the importance ascribed to other pronouncements - comments like tariffs being an obvious area,\" said Paul Donovan, chief economist at UBS Global Wealth Management.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Volatility across markets has run high in the last few trading days since Trump announced he would slap tariffs on Canada and Mexico, only to backpedal within hours and agree to a one-month delay.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Some sense of calm returned by Wednesday, leaving investors to focus on more micro-led events such as company earnings, where Google parent Alphabet missed forecasts as it ramped up spending on capex. Its shares fell 7% in premarket trading, suggesting a heavy fall at the opening bell later.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Other stocks in focus were Walt Disney, which rose 0.8%, while those in ride-hailing app Uber dropped 4%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Europe, activity was dominated by a heavy day for earnings, where shares in Novo Nordisk, the most valuable company in the region, rose 1.6% after beating fourth-quarter expectations, which helped lift the STOXX 600 by 0.1% on the day.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The delays to tariffs have eased concern about how much scope the Federal Reserve might have to cut interest rates this year, pushing Treasury yields lower, although with China and Europe still in Trump's sights, the mood was cautious.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"The period of doubt - during which worries about 'tariff risk' prevails in the market - is not over yet,\" Thierry Wizman, global FX and rates strategist at Macquarie, said in a note.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Traders may revisit those doubts in 30 days, as Trump tries to extract more concessions from Mexico and Canada, and then the EU.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->DOLLAR SOFTENS<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Yields on two-year Treasuries eased 2 basis points on the day to below 4.2%, which in turn took some sheen off the dollar. The U.S. currency is relatively flat so far this year against a basket of major currencies, having risen 7% in 2024.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Chinese markets returned from a week-long break for the Lunar New Year holidays. China has, so far, made a relatively restrained response to Trump's additional 10% in tariffs, announcing levies that cover just $14 billion of U.S. exports.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Beijing set a firm fix for its yuan, countering concerns that it might allow the currency to slide to offset the impact of tariffs on its exports.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Elsewhere in Asia, the Japanese yen strengthened sharply against a range of currencies, after upbeat data on wages supported expectations of further tightening by the Bank of Japan this year.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The dollar fell 1% against the yen to 152.785, while the euro was down 0.6% at 159.09.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Against the dollar, the euro rose 0.3% to $1.041, having pulled off a two-year trough of $1.0125 at the start of the week. The dollar also fell 0.2% against the Canadian dollar to C$1.4293, below this week's 22-year high at C$1.4792.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In commodities, gold hit a fresh all-time high at $2,877 an ounce, buoyed in part by the pullback in the dollar and Treasury yields.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Oil prices were weighed down by China's tariffs on imports of U.S. oil, which offset a potential boost from reports Trump had restored his \"maximum pressure\" campaign on Iran in a bid to drive Iranian oil exports to zero. [O/R]<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Brent crude futures fell 1.2% to $75.29 a barrel, while U.S. crude fell 1.2% to $71.84.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Additional reporting by Wayne Cole in Sydney and Vidya Ranganathan in Singapore; editing by Lincoln Feast, Sam Holmes, Christina Fincher and Mark Heinrich)<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/us-futures-knocked-alphabet-earnings-125521871.html",
            "pub_date": "2025-02-05 20:55:21",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "European data centre space shortage expected in 2025 as AI booms European data centres will expand capacity by 22% this year and yet struggle to meet demand, raising the risk Europe will be left be further behind in the race for artificial intelligence (AI), industry analysts told a conference on Wednesday.  That is unlikely to relieve Europe's pressing issues of electric grid congestion and a shortage of suitable sites for new centres.  Large software companies, such as Google and Amazon, plan to press ahead with plans for \"hyperscale\" data centres, and European corporations also need more AI-linked space. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Toby Sterling<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->AMSTERDAM - European data centres will expand capacity by 22% this year and yet struggle to meet demand, raising the risk Europe will be left be further behind in the race for artificial intelligence (AI), industry analysts told a conference on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China's DeepSeek delivered a shock to markets last week by raising the prospect of more energy-efficient AI models.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->That is unlikely to relieve Europe's pressing issues of electric grid congestion and a shortage of suitable sites for new centres.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Large software companies, such as Google and Amazon, plan to press ahead with plans for \"hyperscale\" data centres, and European corporations also need more AI-linked space.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Providers can't build supply fast enough to keep up with demand,\" Kevin Restivo, director of data centre research at consultancy CBRE, said in his keynote address at the Kickstart Europe conference.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Space shortages are most acute in the traditional big European data centre hubs of Frankfurt, London, Amsterdam, Paris and Dublin, where electric grid constraints are limiting capacity growth.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->As a result, secondary markets are booming around Europe. Milan, Warsaw and Berlin are expanding the fastest in 2025, but firms are increasingly looking outside cities.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->CBRE forecasts capacity coming online this year - measured in the data centre business by the amount of electricity needed to power it - will be around 9.1 gigawatts, with hyperscalers taking up more than a third.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->CBRE estimates the average price across Europe to build \"colocation\" space, or space rented by big companies, inside a data centre at 12 million euros ($12.50 million) per megawatt.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->That implies Europe's industry is expanding by more than 100 billion euros this year, but that pales beside ongoing U.S. investments, notably the \"Stargate\" initiative for Oracle, Microsoft and OpenAI to spend $500 billion over the next four years.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"Europe risks falling into technological dependency, watching as AI leadership consolidates between the U.S. and China,\" Stijn Grove, managing director of the Dutch Data Center Association, said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->($1 = 0.9602 euros)<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Toby Sterling; editing by Barbara Lewis)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/european-data-centre-space-shortage-125207382.html",
            "pub_date": "2025-02-05 20:52:07",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assa Abloy to hike prices if US implements tariffs on Canada and Mexico, CEO says Sweden's Assa Abloy plans to raise its prices if U.S. President Donald Trump moves ahead with the tariffs on Canada and Mexico, the CEO of the world's biggest lockmaker said on Wednesday.  Trump on Monday paused his threat of 25% tariffs on Mexico and Canada for 30 days, while his additional 10% tariff across all Chinese imports into the U.S. came into effect on Tuesday. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Elviira Luoma<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - Sweden's Assa Abloy plans to raise its prices if U.S. President Donald Trump moves ahead with the tariffs on Canada and Mexico, the CEO of the world's biggest lockmaker said on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump on Monday paused his threat of 25% tariffs on Mexico and Canada for 30 days, while his additional 10% tariff across all Chinese imports into the U.S. came into effect on Tuesday.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The rival to Allegion and Stanley Black &amp; Decker is increasing its inventory in the U.S., CEO Nico Delvaux told Reuters, and added that if the paused duties were carried out, it would seek to compensate for them also through higher prices.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We are the market leader for most of the things we do in the U.S.,\" Delvaux said. \"Therefore we also have to play the role of being the first one to come with price increases and we are confident that our colleagues in the market ... will follow those price increases.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Assa Abloy, whose products range from security doors to electronic and mechanical locks under brands such as Yale, also said on Wednesday that very weak demand in China continued to weigh on its Asia Pacific business in the fourth quarter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company, which has been suffering for many quarters due to China's weak real estate market, said organic sales in the Asia Pacific segment fell 11% in the quarter, while they were little changed on a group level.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->However, Assa Abloy sees very good momentum in its main markets — North America, Europe and Oceania — where commercial activity remains at a very high level, Delvaux said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->On a reported basis, the company's sales grew by 7% in the fourth quarter, boosted by recent acquisitions. It made eight acquisitions in the final quarter and 26 overall during 2024.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Quarterly operating profit, excluding items affecting comparability, rose 14% to 6.53 billion Swedish crowns ($595.4 million) in the quarter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company's shares were down 1.7% by 1235 GMT.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->($1 = 10.9683 Swedish crowns)<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Elviira Luoma in Gdansk, editing by Milla Nissi)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/assa-abloy-hike-prices-us-124528663.html",
            "pub_date": "2025-02-05 20:45:28",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "‘I’ve worked in the RAF and NHS and own four businesses – should I quit Britain to cut my tax bill?’ Dr Kevin O’Sullivan, 72, has had a colourful career. After a stint in the Royal Air Force in his 20s, he trained as an obstetric surgeon and worked briefly for the NHS, leaving because he “didn’t want to live inside a political football”. Following this, he worked as a medical director for several insurance and pharmaceutical companies. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 601px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 601; --img-max-width: 960px;\"><img alt=\"Dr Kevin O&amp;#39;Sullivan and Teresa O&amp;#39;Sullivan\" class=\"yf-g633g8 loader\" height=\"601\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Former surgeon Dr Kevin O’Sullivan, pictured with his wife Teresa, has ploughed his cash into business ventures<!-- HTML_TAG_END --> </figcaption> </figure> <blockquote class=\"neo-blockquote yf-1ba2ufg\"><p class=\"yf-1ba2ufg\"><!-- HTML_TAG_START --><em>Receive personalised tips on how to improve your financial situation, for free. </em><a class=\"link\" data-ylk=\"slk:Here’s how to apply or use the form below;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/money-makeover/would-like-telegraph-money-makeover-how-apply-2022/\" rel=\"nofollow noopener\" target=\"_blank\"><em>Here’s how to apply or use the form below</em></a>.<!-- HTML_TAG_END --></p> </blockquote> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Dr Kevin O’Sullivan, 72, has had a colourful career. After a stint in the Royal Air Force in his 20s, he trained as an obstetric surgeon and worked briefly for the NHS, leaving because he “didn’t want to live inside a political football”. Following this, he worked as a medical director for several insurance and pharmaceutical companies.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The ex-serviceman has also had widespread success as an entrepreneur, having founded or purchased four businesses across as many sectors: a care home, a hotel, a recruitment company and two Cash Converters branches as a franchisee.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Dr O’Sullivan says: “I didn’t go into business to make money, I just wanted to do things right. The businesses are successful because we want to give the customers the best service possible – there’s no magic recipe behind it.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The serial entrepreneur spends several months of each year outside the country; he is currently holidaying in Gran Canaria. But <a class=\"link\" data-ylk=\"slk:changes to inheritance tax business relief;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/tax/inheritance/family-businesses-labour-inheritance-tax-greatest-threat/\" rel=\"nofollow noopener\" target=\"_blank\">changes to inheritance tax business relief</a> – and the threat of further tax rises under the current Government – are prompting him to consider making this move more permanent.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Dr O’Sullivan has three step-children in their 40s, along with several grandchildren, and wants to minimise what the taxman can take when it comes to leaving them his estate.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->He says: “I’m practising being a tax exile – I’m not sure I’ve got it right yet.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“I have sought to avoid personal wealth over the years, being averse to paying the taxes I would have to pay if I took it out of my businesses. My wealth is therefore built into them. This, together with an adventurous attitude to life, explains the number of somewhat diverse businesses I’ve accumulated.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“As I got older, I started to see this as a good inheritance tax mitigation strategy – until the October Budget introduced an inheritance tax of 20pc on business assets, along with 40pc on pension pots.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Given the <a class=\"link\" data-ylk=\"slk:changes to inheritance tax on business assets;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/tax/inheritance/worthless-family-businesses-could-face-1m-tax-bill/\" rel=\"nofollow noopener\" target=\"_blank\">changes to inheritance tax on business assets</a> and pension pots and the end of the concept of domicile, should I just liquidate everything, leave the country and disappear over the horizon to Dubai, Malta, Portugal or even the US (where the inheritance tax threshold starts at $10m), never to darken a UK doorstep again?”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Dr O’Sullivan joined thousands of other retirement savers in <a class=\"link\" data-ylk=\"slk:taking his tax-free pension lump sum;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/pensions/withdrew-tax-free-pension-budget-put-back/\" rel=\"nofollow noopener\" target=\"_blank\">taking his tax-free pension lump sum</a> ahead of the Budget in October, which he used to clear his mortgage. Currently, his income is primarily sourced from dividends from his businesses.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->He has £710,000 left in his self-invested personal pension (Sipp) after taking his 25pc tax-free lump sum, and says the amount in it is falling fast. He also owns property worth £750,000 in Cornwall and Plymouth, and has £140,000 in a stocks and shares Isa – though it has suffered negative growth in recent years – along with £50,000 in a Venture Capital Trust (VCT). These typically invest in small businesses, offering a lower tax rate and the potential of stronger returns in exchange for heightened risk.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Dr O’Sullivan adds: “I now have a significant element of income that supported my mortgage payments without a corresponding mortgage. It could be Christmas every month!<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“In recent years, I have kept my income just below £100,000 a year so as not to sacrifice my personal allowance. The dividends [started to decline when] I started receiving my state pension, along with a very small NHS pension from my very short time as an NHS doctor.”<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Natasha Percy-Baxter, of PercyBaxter Wealth Management, a St James’s Place partner practice<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It sounds like a lot of decisions are being made for tax reasons, or in expectation of possible changes such as the recent Budget. But what Dr O’Sullivan is missing is a clear underlying plan or strategy based on his specific goals, circumstances and timeline.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->For the top goal of wealth preservation, there is a Sipp not listed as a source of current income. Firstly, saying it is “falling fast” suggests that it is not invested correctly. Providing Dr O’Sullivan has not started taking an income and only removed the tax-free cash, it’s possible to <a class=\"link\" data-ylk=\"slk:make pension contributions;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/pensions/private-pensions/how-to-make-pension-contributions-to-lower-your-tax-bill/\" rel=\"nofollow noopener\" target=\"_blank\">make pension contributions</a> of up to £60,000 a year from his companies. This would tick three boxes: strengthen the goal of providing future income of £100k or more, reduce annual corporation tax and allow him to take money out of the businesses tax-free – win-win! But this only works until the age of 75, so Dr O’Sullivan will want to make the most of this tax benefit now.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It is great that Dr O’Sullivan is aware of the <a class=\"link\" data-ylk=\"slk:60pc tax trap between £100,000 and £125,140;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/tax/income/labour-60pc-tax-trap-fast-becoming-new-normal/\" rel=\"nofollow noopener\" target=\"_blank\">60pc tax trap between £100,000 and £125,140</a>, where you lose the personal allowance and are therefore exposed to income tax of 20pc on top of 40pc, and so has planned his income around this. It goes without saying, but I hope that as a higher rate taxpayer he has also claimed the additional 20pc from the Government for any personal pension payments.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Regarding the Isa he has stopped paying into, he says this has had negative growth so I would question the <a class=\"link\" data-ylk=\"slk:asset allocation of his investments;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/investing/isas/investment-isa-stocks-shares-what-banking-eligibility/\" rel=\"nofollow noopener\" target=\"_blank\">asset allocation of his investments</a>. As mentioned, one key benefit of an Isa is that there is no tax on any growth within the wrapper. There is also no tax on withdrawals, so if Dr O’Sullivan maximises his £20,000 annual allowance this could help with his goal of tax-free income in future years.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->He is invested in a VCT, in which he benefits from initial and ongoing tax reliefs, such as 30pc income tax relief and tax-free dividends after five years. It may also be worth investing in <a class=\"link\" data-ylk=\"slk:enterprise investment schemes;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/investing/stocks-shares/eis-enterprise-investment-scheme/\" rel=\"nofollow noopener\" target=\"_blank\">enterprise investment schemes</a> (EIS). These products help with capital gains tax and the allowable investment amount is much higher at £1m (or £2m for knowledge-intensive companies) vs £200,000 for a VCT.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It is also worth exploring using the <a class=\"link\" data-ylk=\"slk:gift allowance in relation to inheritance tax;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/tax/inheritance/inheritance-tax-gifts-surplus-income-unlimited-gifting/\" rel=\"nofollow noopener\" target=\"_blank\">gift allowance in relation to inheritance tax</a>. This could take various forms, such as using the annual £3,000 gift allowance or contributing into Junior Isas (£9,000 a year for each child) and junior pensions (£3,600 a year each, gross) for grandchildren – a lovely way of passing funds on to future generations. It is also worth considering trusts such as a Discounted Gift Plan or a Loan Plan.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->I understand it can feel like the only solution to all the UK taxes is to move abroad, but with the correct planning in place, there is a way for Dr O’Sullivan to achieve his goals whilst minimising his tax liabilities.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Felix Milton, financial adviser, Philip J Milton &amp; Co<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Dr O’Sullivan has been very successful throughout his career, and the business assets he has accumulated prove it. By his own admission, Dr O’Sullivan has a lower amount in personal assets than would perhaps be expected for someone with the level of wealth he has, owing to a desire to avoid paying personal taxes on any withdrawals from the companies.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Dr O’Sullivan has noted that the easiest way for him to avoid large taxes on his wealth would be to sell everything and emigrate completely to a lower tax jurisdiction, where he wouldn’t be at risk of UK inheritance tax.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This, of course, would leave him with a rather large capital gains tax bill to pay – though this could be mitigated to some extent if Dr O’Sullivan invested the proceeds into enterprise investment schemes and seed enterprise investment schemes.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The former allows you to defer any gain and the latter allows you to benefit from reinvestment relief, meaning that some of the gain would be treated as <a class=\"link\" data-ylk=\"slk:exempt from capital gains tax;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/money/tax/capital-gains/capital-gains-tax-how-to-cut-your-bill/\" rel=\"nofollow noopener\" target=\"_blank\">exempt from capital gains tax</a>. He would also be able to benefit from large income tax reliefs from making these investments, though there are limits to what he could invest in any one year.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->He could also explore the option of giving as gifts some of his assets now to the beneficiaries of his estate. Providing he lives for seven years, these assets will be exempted from future inheritance tax. However, he may still have capital gains tax to pay on some of the disposals, unless he can claim gift hold-over relief, which allows you to not pay capital gains tax on the assets and instead the person you give them to pays on their disposal.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/customer/subscribe/01doysa/\" rel=\"nofollow noopener\" target=\"_blank\"><b>Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.</b></a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/ve-worked-raf-nhs-own-124142020.html",
            "pub_date": "2025-02-05 20:41:42",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Honda Stock Jumps as Merger With Nissan Reportedly Nears Collapse Honda Motor's U.S.-listed shares are rising in premarket trading following reports that the Japanese automaker’s plans to merge with ailing domestic rival Nissan are in jeopardy.﻿﻿ ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"Kiyoshi Ota / Bloomberg / Getty Images Nissan CEO Makoto Uchida (left), Honda CEO Toshihiro Mibe (center), and Mitsubishi CEO Takao Kato (right) discuss the planned merger of Nissan and Honda at a press conference on Dec. 23, 2024\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START --><p>Kiyoshi Ota / Bloomberg / Getty Images</p> Nissan CEO Makoto Uchida (left), Honda CEO Toshihiro Mibe (center), and Mitsubishi CEO Takao Kato (right) discuss the planned merger of Nissan and Honda at a press conference on Dec. 23, 2024<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><br/><!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->KEY TAKEAWAYS<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Honda Motor's U.S.-listed shares are rising around 6% in premarket trading following reports that the Japanese automaker’s plans to merge with ailing domestic rival Nissan are in jeopardy.<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->According to the <em>Financial Times</em>, which cited people familiar with the matter, Honda unexpectedly came in with a new structure that would have made Nissan a fully owned subsidiary.<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A deal would have helped cut costs and help the automaker compete globally at a time when Chinese rivals are expanding their market share for electric vehicles.<!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><br/><br/><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Honda Motor's (<span>HMC</span>) U.S.-listed shares are rising about 6% in premarket trading following reports that the Japanese automaker’s <a class=\"link\" data-ylk=\"slk:plans;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.investopedia.com/honda-stock-surges-as-automaker-plans-to-merge-with-nissan-in-2026-8765668\" rel=\"nofollow noopener\" target=\"_blank\">plans</a> to merge with ailing domestic rival Nissan are in jeopardy.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->According to the <em>Financial Times</em>, which cited three people familiar with the matter, Honda unexpectedly came in with a new structure that would have made Nissan a fully owned subsidiary, a departure from the original “merger of equals” idea the two had initially planned.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A Nissan spokesperson told <em>Investopedia</em> that the <em>FT</em> article \"is not based on information announced by Nissan. We aim to finalize our direction by mid-February and will announce it at that time.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Honda could not be reached for comment Wednesday morning.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The two Japanese automakers announced plans to combine in December in a tie-up that would have created the world’s third-largest automaker, if Mitsubishi Motors is included, according to <em>The Wall Street Journal</em>. Nissan is the largest shareholder in Mitsubishi, the report said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A deal would have <a class=\"link\" data-ylk=\"slk:helped cut;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.investopedia.com/moodys-gives-thumbs-up-to-possible-honda-nissan-merger-8766274\" rel=\"nofollow noopener\" target=\"_blank\">helped cut</a> costs and help the automaker compete globally at a time when Chinese rivals are expanding their market share for electric vehicles.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Nissan, Honda, and Mitsubishi have a <a class=\"link\" data-ylk=\"slk:history of collaborating.;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.investopedia.com/honda-nissan-plan-to-start-merger-talks-report-nikkei-mitsubishi-8763039#citation-9\" rel=\"nofollow noopener\" target=\"_blank\">history of collaborating.</a> Honda and Nissan first said early last year that they would work together in parts of the EV business, and noted in August that Mitsubishi was joining the effort.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Honda shares are down almost 18% in the past year through Tuesday.<br/><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Read the original article on <a class=\"link\" data-ylk=\"slk:Investopedia;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.investopedia.com/honda-stock-jumps-as-merger-with-nissan-reportedly-nears-collapse-8786156\" rel=\"nofollow noopener\" target=\"_blank\">Investopedia</a><!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/honda-stock-jumps-merger-nissan-123512531.html",
            "pub_date": "2025-02-05 20:35:12",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Uber’s (NYSE:UBER) Q4 Sales Top Estimates Ride sharing and on demand delivery service Uber (NYSE: UBER) reported Q4 CY2024 results beating Wall Street’s revenue expectations, with sales up 20.4% year on year to $11.96 billion. Its GAAP profit of $3.21 per share was significantly above analysts’ consensus estimates. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"UBER Cover Image\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Uber’s (NYSE:UBER) Q4 Sales Top Estimates<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ride sharing and on demand delivery service Uber (NYSE: UBER) reported Q4 CY2024 results beating Wall Street’s revenue expectations , with sales up 20.4% year on year to $11.96 billion. Its GAAP profit of $3.21 per share was significantly above analysts’ consensus estimates.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is now the time to buy Uber? <a class=\"link\" data-ylk=\"slk:Find out in our full research report;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nyse/uber?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=top&amp;utm_article=DllwaGsEZA%3D%3D&amp;utm_ticker=UBER\" rel=\"nofollow noopener\" target=\"_blank\">Find out in our full research report</a>.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Uber (UBER) Q4 CY2024 Highlights:<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue:</strong> $11.96 billion vs analyst estimates of $11.76 billion (20.4% year-on-year growth, 1.7% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>EPS (GAAP):</strong> $3.21 vs analyst estimates of $0.48 (significant beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EBITDA:</strong> $1.84 billion vs analyst estimates of $1.85 billion (15.4% margin, in line)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Q1 20215 Guidance:</strong> Gross Bookings of $42.75 billion at the midpoint (miss vs. expectations of $43.3 billion)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Operating Margin:</strong> 6.4%, in line with the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Free Cash Flow Margin:</strong> 14.3%, down from 18.9% in the previous quarter<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Monthly Active Platform Consumers:</strong> 171 million, up 21 million year on year (beat vs. expectations of ~168 million)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Market Capitalization:</strong> $146.9 billion<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Uber ended 2024 with our strongest quarter ever, as growth accelerated across MAPCs, trips, and Gross Bookings,” said Dara Khosrowshahi, CEO.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Company Overview<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Born out of a winter night thought: \"What if you could request a ride from your phone?\" Uber (NYSE: UBER) operates a global network of on demand services, most prominently ride hailing and food delivery, and freight.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Gig Economy<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The iPhone changed the world, ushering in the era of the “always-on” internet and “on-demand” services - anything someone could want is just a few taps away. Likewise, the gig economy sprang up in a similar fashion, with a proliferation of tech-enabled freelance labor marketplaces, which work hand and hand with many on demand services. Individuals can now work on demand too. What began with tech-enabled platforms that aggregated riders and drivers has expanded over the past decade to include food delivery, groceries, and now even a plumber or graphic designer are all just a few taps away.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Sales Growth<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A company’s long-term performance is an indicator of its overall quality. While any business can experience short-term success, top-performing ones enjoy sustained growth for years. Thankfully, Uber’s 36.1% annualized revenue growth over the last three years was incredible. Its growth surpassed the average consumer internet company and shows its offerings resonate with customers, a great starting point for our analysis.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Uber Quarterly Revenue\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Uber Quarterly Revenue<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This quarter, Uber reported robust year-on-year revenue growth of 20.4%, and its $11.96 billion of revenue topped Wall Street estimates by 1.7%.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking ahead, sell-side analysts expect revenue to grow 15% over the next 12 months, a deceleration versus the last three years. We still think its growth trajectory is attractive given its scale and implies the market sees success for its products and services.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Software is eating the world and there is virtually no industry left that has been untouched by it. That drives increasing demand for tools helping software developers do their jobs, whether it be monitoring critical cloud infrastructure, integrating audio and video functionality, or ensuring smooth content streaming. <a class=\"link\" data-ylk=\"slk:Click here to access a free report on our 3 favorite stocks to play this generational megatrend;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stock-pick-l/dc779648-e1d9-4724-9fda-d834b02ee54c?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=SP_7&amp;utm_article=DllwaGsEZA%3D%3D&amp;utm_ticker=UBER\" rel=\"nofollow noopener\" target=\"_blank\">Click here to access a free report on our 3 favorite stocks to play this generational megatrend</a>.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Monthly Active Platform Consumers<!-- HTML_TAG_END --></h2> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->User Growth<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->As a gig economy marketplace, Uber generates revenue growth by expanding the number of services on its platform (e.g. rides, deliveries, freelance jobs) and raising the commission fee from each service provided.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Over the last two years, Uber’s monthly active platform consumers, a key performance metric for the company, increased by 13.8% annually to 171 million in the latest quarter. This growth rate is among the fastest of any consumer internet business and indicates its offerings have significant traction.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Uber Monthly Active Platform Consumers\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Uber Monthly Active Platform Consumers<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Uber added 21 million monthly active platform consumers, leading to 14% year-on-year growth. The quarterly print isn’t too different from its two-year result, suggesting its new initiatives aren’t accelerating user growth just yet.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Revenue Per User<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Average revenue per user (ARPU) is a critical metric to track for gig economy businesses like Uber because it measures how much the company earns in transaction fees from each user. This number also informs us about Uber’s take rate, which represents its pricing leverage over the ecosystem, or \"cut\" from each transaction.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Uber’s ARPU growth has been mediocre over the last two years, averaging 3.4%. This isn’t great, but the increase in monthly active platform consumers is more relevant for assessing long-term business potential. We’ll monitor the situation closely; if Uber tries boosting ARPU by taking a more aggressive approach to monetization, it’s unclear whether users can continue growing at the current pace.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Uber ARPU\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Uber ARPU<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This quarter, Uber’s ARPU clocked in at $69.94. It grew by 5.6% year on year, slower than its user growth.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Key Takeaways from Uber’s Q4 Results<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It was great to see Uber increase its number of users this quarter, beating expectations. This led to revenue outperformance. On the other hand, gross booking guidance for next quarter missed, and this is weighing on shares. The stock traded down 4% to $66.95 immediately following the results.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is Uber an attractive investment opportunity at the current price? We think that the latest quarter is just one piece of the longer-term business quality puzzle. Quality, when combined with valuation, can help determine if the stock is a buy. <a class=\"link\" data-ylk=\"slk:We cover that in our actionable full research report which you can read here, it’s free;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nyse/uber?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=end1&amp;utm_article=DllwaGsEZA%3D%3D&amp;utm_ticker=UBER\" rel=\"nofollow noopener\" target=\"_blank\">We cover that in our actionable full research report which you can read here, it’s free</a>.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/uber-nyse-uber-q4-sales-121002262.html",
            "pub_date": "2025-02-05 20:10:02",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Uber’s Fourth-Quarter Earnings Miss Overshadows Bookings Growth (Bloomberg) -- Uber Technologies Inc. reported weaker-than-expected fourth-quarter earnings and operating income, overshadowing steady bookings growth. Shares declined in premarket trading on Wednesday.Most Read from BloombergState Farm Seeks Emergency California Rate Hike After FiresNYC’s Newest Transit Leader Builds a Worker-Driven StrategyNew York’s First ‘Passive House’ School Is a Model of Downtown DensityTransportation Memos Favor Places With Higher Birth and Marriage RatesWhen French Comm ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Bloomberg) -- Uber Technologies Inc. reported weaker-than-expected fourth-quarter earnings and operating income, overshadowing steady bookings growth. Shares declined in premarket trading on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:State Farm Seeks Emergency California Rate Hike After Fires;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-03/state-farm-seeks-emergency-california-rate-hike-after-la-fires?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">State Farm Seeks Emergency California Rate Hike After Fires</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:NYC’s Newest Transit Leader Builds a Worker-Driven Strategy;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-04/nyc-fare-evasion-drops-as-new-transit-president-takes-helm?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">NYC’s Newest Transit Leader Builds a Worker-Driven Strategy</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:New York’s First ‘Passive House’ School Is a Model of Downtown Density;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-02/brooklyn-gets-nyc-s-first-passive-house-certified-school-building?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">New York’s First ‘Passive House’ School Is a Model of Downtown Density</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Transportation Memos Favor Places With Higher Birth and Marriage Rates;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/department-of-transportation-memos-tie-funding-to-birth-rate-marriage-policy?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Transportation Memos Favor Places With Higher Birth and Marriage Rates</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:When French Communists Went on a Brutalist Building Boom;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-01/new-book-explores-brutalist-architecture-of-france-s-communist-party?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">When French Communists Went on a Brutalist Building Boom</a><!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Adjusted earnings before interest, taxes, depreciation and amortization were $1.84 billion, just shy of the $1.85 billion that Wall Street was projecting, Uber said in a statement on Wednesday. Income from operations for the fourth-quarter was $770 million, well below the average estimate of $1.2 billion. “Discrete legal and regulatory related matters” offset income gains from a “strong operating performance,” Chief Executive Officer Dara Khosrowshahi said in a prepared statement.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Gross bookings, which includes ride hails, delivery orders and driver and merchant earnings but not tips, grew 18% to $44.2 billion in the last three months of 2024. For the current quarter, it forecast bookings of $42 billion to $43.5 billion. Bloomberg’s data included one analyst estimate for gross bookings for the fourth and first quarters.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In prepared remarks, Chief Financial Officer Prashanth Mahendra-Rajah cited continued currency headwinds, as well as impact from the recent Los Angeles fires and “extreme weather in January.”<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Shares of Uber fell 3% during premarket trading after the results were announced.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Uber’s US flagship rideshare business, which accounts for more than half of its profitability, has lately been weighed down by rising insurance prices. Executives have blamed these expenses for slowing demand ride demand, saying it’s had to pass higher costs on to consumers in certain markets such as New Jersey, Southern California and parts of Florida.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Khosrowshahi has since publicly vowed to push for insurance and tort reform to address the issue. The company has gone on the offensive in New York, filing a racketeering lawsuit against a group of law firms, doctors and clinics it claims staged fake car accidents to take advantage of insurance policies.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In his prepared statement, Khosrowshahi said the company has made “significant progress in slowing insurance price increases through a combination of tech innovation and strong policy work.” Yet the company will continue to pass on those rising costs to consumers and expects UberX prices in the US to be “up marginally” in 2025.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Diversifying Revenue<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Meanwhile, Uber has been pushing into new growth areas across its global mobility and delivery businesses. It has launched more affordable options such as shuttle rides in New York and pooled rides at airports.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company is also working on a $2.99-a-month pass feature to let commuters secure prices for frequent rides ahead of time, Bloomberg reported last month. This subscription offering would represent a potential new revenue source if Uber decides to move forward with the plan. Additionally, the firm has begun selling data labeling services to other businesses by leaning on its gig-worker platform, Bloomberg reported last year.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Uber continues to partner with other brands to boost user growth. Last month, it announced an exclusive, multiyear deal with Delta Air Lines Inc., ending rival Lyft Inc.’s prior deal with the air carrier that allowed riders to earn miles on ground trips. Separately, the Uber Eats unit recently struck a partnership with Home Depot Inc., allowing customers to arrange deliveries for things beyond just restaurant orders.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Autonomous vehicles have also been an increasing area of focus for Uber, which inked more than a dozen manufacturer partnerships and has invested in multiple self-driving technology companies. Earlier Wednesday, the rideshare giant announced it has opened a waitlist for customers in Austin to indicate interest in Waymo rides ahead of an expected launch in March. The company will also be the sole app offering Waymo rides in Atlanta this summer. The tie-up is part of a longer-term vision to become the go-to platform for automakers to monetize their self-driving vehicles.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Even as we see AV technology advancing, we expect AV commercialization will take significantly longer,” Khosrowshahi said in the prepared statement, citing the need for an operator to balance a consistent safety record, on-the-ground logistics and managing a high-utilization marketplace. “Given the scale of the Uber platform, and human drivers’ ability to dynamically fulfill demand spikes—and take a break during demand troughs—partnering with Uber allows AV players to move much faster than they could on their own.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg Businessweek<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Amazon and SpaceX Want In on India’s Satellite Internet Market;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/musk-ambani-want-to-sell-millions-of-indians-satellite-internet?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Amazon and SpaceX Want In on India’s Satellite Internet Market</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Elon Musk Inside the Treasury Department Payment System;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-02/elon-musk-gets-inside-treasury-department-payment-system?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Elon Musk Inside the Treasury Department Payment System</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Inside Elon Musk’s Attack on the US Government;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/podcast-inside-elon-musk-s-attack-on-the-us-government?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Inside Elon Musk’s Attack on the US Government</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The NFL’s Flawed DEI Program Still Beats What Most Companies Are Doing;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/nfl-s-rooney-rule-is-a-dei-program-that-beats-what-most-companies-are-doing?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The NFL’s Flawed DEI Program Still Beats What Most Companies Are Doing</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The Internet Almost Killed Barnes &amp; Noble, Then Saved It;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-30/barnes-noble-sales-are-growing-again-thanks-to-booktok-buzz?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The Internet Almost Killed Barnes &amp; Noble, Then Saved It</a><!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->©2025 Bloomberg L.P.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/uber-fourth-quarter-earnings-miss-120636304.html",
            "pub_date": "2025-02-05 20:06:36",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New York Times forecasts quarterly subscription revenue below estimates New York Times forecast first-quarter subscription revenue growth below Wall Street estimates on Wednesday, signaling growing competition for attracting new subscribers. The company expects subscription revenue growth of 7% to 10%, compared with analysts' average estimate of 9.9%, according to data compiled by Visible Alpha. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - New York Times forecast first-quarter subscription revenue growth below Wall Street estimates on Wednesday, signaling growing competition for attracting new subscribers.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company expects subscription revenue growth of 7% to 10%, compared with analysts' average estimate of 9.9%, according to data compiled by Visible Alpha.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Jaspreet Singh in Bengaluru; Editing by Pooja Desai)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/york-times-forecasts-quarterly-subscription-121423943.html",
            "pub_date": "2025-02-05 20:14:23",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        }
    ]
}