{
    "data": [
        {
            "title": "Walmart to cut hundreds of roles, shut office in North Carolina, Fox News says Walmart is eliminating hundreds of roles and closing one of its North Carolina offices as it moves to relocate employees to its main hubs in California and Arkansas, Fox News reported on Tuesday, citing an internal memo.  The company is also asking office-based employees in Hoboken, New Jersey and some of its smaller offices to relocate to its newly opened headquarters in Bentonville, Arkansas and its office in Sunnyvale, California, the report said.  Walmart was not immediately available to comment. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->NEW YORK (Reuters) - Walmart is eliminating hundreds of roles and closing one of its North Carolina offices as it moves to relocate employees to its main hubs in California and Arkansas, Fox News reported on Tuesday, citing an internal memo.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company is also asking office-based employees in Hoboken, New Jersey and some of its smaller offices to relocate to its newly opened headquarters in Bentonville, Arkansas and its office in Sunnyvale, California, the report said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Walmart was not immediately available to comment.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Siddharth Cavale in New York)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/walmart-cut-hundreds-roles-shut-225112774.html",
            "pub_date": "2025-02-05 06:51:12",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kentucky lawmakers send bill to cut the state's income tax to the governor. He supports it. Kentucky lawmakers completed their work Tuesday to reduce the state’s individual income tax rate, delivering on a top Republican priority on just the fifth day of this year's session.  It continues a downward trend in the personal income tax rate since the GOP gained full control of the legislature in 2017.  Sen. Cassie Chambers Armstrong, one of three Senate Democrats voting against the bill, said the results would be lopsided, with wealthy Kentuckians benefiting disproportionately from the tax cut. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->FRANKFORT, Ky. (AP) — Kentucky lawmakers completed their work Tuesday to reduce the state’s individual income tax rate, delivering on a top Republican priority on just the fifth day of this year's session.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Final passage came on a 34-3 Senate vote to lower the tax to 3.5% from 4% at the start of 2026. The bill goes to Democratic Gov. Andy Beshear, who has said he supports the tax cut. It continues a downward trend in the personal income tax rate since the GOP gained full control of the legislature in 2017.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“It’s been said that there are only two things in life that are certain -– it’s death and taxes,\" Republican Sen. Chris McDaniel said during the debate Tuesday. \"We’ve added another thing that’s fairly certain — which is the General Assembly is going to do everything in its power, and frequently with success, to lower your taxes. And that’s what House Bill 1 is all about.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Supporters say the lower tax rate will promote long-term economic growth and population gains in the Bluegrass State by enabling people to keep more of the money they earn.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sen. Cassie Chambers Armstrong, one of three Senate Democrats voting against the bill, said the results would be lopsided, with wealthy Kentuckians benefiting disproportionately from the tax cut.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Democratic lawmaker said she values putting money back in Kentuckians' pockets, pointing to options she said would help struggling families most in need of tax relief. She touted a refundable child tax credit for low-income families and a sales tax exemption for diapers — proposals she is pushing.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->That brought a quick response from Republican Sen. Michael Nemes, who touted the relief for Kentuckians provided in the income tax cut. “They earned it,” he said. \"It’s their money, not ours.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The latest income tax cut is expected to save taxpayers another $718 million annually, supporters said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->House budget committee Chairman Jason Petrie said last month that there’s a “tremendous amount of room to keep the budget balanced” with the lower individual income tax rate in 2026.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The measure won united support from Senate Republicans, while Democrats were divided on the issue.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sen. David Yates, among the Democrats backing the bill, said it “feels safe” to lower the income tax in the current economic climate but added that the state should maintain a diverse tax structure. If the personal income tax keeps dropping until being eliminated, other taxes will increase, he said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Because you have to have taxes in order to run a system of government,” Yates said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Cutting the state's personal income tax has been a recurring priority for Republican lawmakers.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Since the passage of a tax overhaul in 2022, the individual income tax in Kentucky has gradually been reduced by increments of a half-percentage point, conditioned on meeting benchmarks to ensure revenues are sufficient to meet state spending needs. <a class=\"link\" data-ylk=\"slk:State officials announced last year;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/tax-cut-kentucky-dbe6c0fef7e5e4b3e8dddca281ffed4e\" rel=\"nofollow noopener\" target=\"_blank\">State officials announced last year</a> that the state had met the financial conditions needed to set in motion another cut in the tax rate for 2026.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->As part of the tax overhaul three years ago, the state sales tax was extended to apply to more services. Critics say lower-income families were hurt the most by putting sales tax on more services.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The House <a class=\"link\" data-ylk=\"slk:overwhelmingly passed;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/kentucky-legislature-individual-income-tax-021294d5f1d6e3d55de64e9fa489d463\" rel=\"nofollow noopener\" target=\"_blank\">overwhelmingly passed</a> the latest income tax cut on the third day of this year's 30-day session in early January. Lawmakers met four days last month before heading home for the rest of January, which is customary in 30-day sessions in odd-numbered years.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Senate took up the bill Tuesday, the first day that lawmakers reconvened since the January break. Republicans have supermajorities in both chambers, and the importance of the tax cut was reflected in it being designated as HB1, signifying its top-priority status.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->With the latest personal income tax cut headed to the governor's desk, the next question will be when the rate will be reduced again and by how much.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Several Senate Republicans said Tuesday that the latest cut is another step toward what they hope is the ultimate result — eliminating the individual income tax.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->GOP Sen. Gex Williams raised the prospect of making deeper incremental cuts in the income tax in future years, perhaps by three-quarters of a percent or a full 1%. Williams said he hopes that begins in the 60-day legislative session in 2026, when lawmakers will craft the state's next two-year budget.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“I am looking forward to this next session, that we will be able to strive for a greater than one-half percent cut,” Williams said.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/kentucky-lawmakers-send-bill-cut-223117575.html",
            "pub_date": "2025-02-05 06:31:17",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kimball Electronics (NASDAQ:KE) Misses Q4 Sales Targets Global electronics contract manufacturer Kimball Electronics (NYSE:KE) missed Wall Street’s revenue expectations in Q4 CY2024, with sales falling 15.2% year on year to $357.4 million. The company’s full-year revenue guidance of $1.42 billion at the midpoint came in 4.4% below analysts’ estimates. Its non-GAAP profit of $0.29 per share was 28.9% above analysts’ consensus estimates. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"KE Cover Image\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Kimball Electronics (NASDAQ:KE) Misses Q4 Sales Targets<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Global electronics contract manufacturer Kimball Electronics (NYSE:KE) missed Wall Street’s revenue expectations in Q4 CY2024, with sales falling 15.2% year on year to $357.4 million. The company’s full-year revenue guidance of $1.42 billion at the midpoint came in 4.4% below analysts’ estimates. Its non-GAAP profit of $0.29 per share was 28.9% above analysts’ consensus estimates.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is now the time to buy Kimball Electronics? <a class=\"link\" data-ylk=\"slk:Find out in our full research report;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/ke?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=top&amp;utm_article=Dlh2b24PYQ%3D%3D&amp;utm_ticker=KE\" rel=\"nofollow noopener\" target=\"_blank\">Find out in our full research report</a>.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Kimball Electronics (KE) Q4 CY2024 Highlights:<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue:</strong> $357.4 million vs analyst estimates of $360.1 million (15.2% year-on-year decline, 0.7% miss)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EPS:</strong> $0.29 vs analyst estimates of $0.23 (28.9% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The company <strong>dropped its revenue guidance for the full year</strong> to $1.42 billion at the midpoint from $1.49 billion, a 4.7% decrease<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Operating Margin:</strong> 2.3%, down from 4.1% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Market Capitalization:</strong> $432.7 million<!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Commenting on today’s announcement, Richard D. Phillips, Chief Executive Officer, stated, “The results for the second quarter were in line with expectations as we continue to navigate a sustained period of declining customer demand, while focusing on what is controllable. For the fourth consecutive quarter, cash flow generated from operating activities was positive, inventory levels were reduced, and debt was paid down, with borrowings nearly 40% lower than a year ago. Our improved balance sheet provides ample liquidity to weather our current challenges, along with the necessary dry powder to opportunistically and meaningfully invest in growing the business.”<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Company Overview<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Founded in 1961, Kimball Electronics (NYSE:KE) is a global contract manufacturer specializing in electronics and manufacturing solutions for automotive, medical, and industrial markets.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Electrical Systems<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Like many equipment and component manufacturers, electrical systems companies are buoyed by secular trends such as connectivity and industrial automation. More specific pockets of strong demand include Internet of Things (IoT) connectivity and the 5G telecom upgrade cycle, which can benefit companies whose cables and conduits fit those needs. But like the broader industrials sector, these companies are also at the whim of economic cycles. Interest rates, for example, can greatly impact projects that drive demand for these products.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Sales Growth<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A company’s long-term performance is an indicator of its overall quality. While any business can experience short-term success, top-performing ones enjoy sustained growth for years. Regrettably, Kimball Electronics’s sales grew at a tepid 4.8% compounded annual growth rate over the last five years. This was below our standard for the industrials sector and is a rough starting point for our analysis.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Kimball Electronics Quarterly Revenue\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Kimball Electronics Quarterly Revenue<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We at StockStory place the most emphasis on long-term growth, but within industrials, a half-decade historical view may miss cycles, industry trends, or a company capitalizing on catalysts such as a new contract win or a successful product line. Kimball Electronics’s recent history shows its demand slowed as its revenue was flat over the last two years.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Kimball Electronics Year-On-Year Revenue Growth\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Kimball Electronics Year-On-Year Revenue Growth<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This quarter, Kimball Electronics missed Wall Street’s estimates and reported a rather uninspiring 15.2% year-on-year revenue decline, generating $357.4 million of revenue.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking ahead, sell-side analysts expect revenue to decline by 5.6% over the next 12 months, a deceleration versus the last two years. This projection is underwhelming and implies its products and services will see some demand headwinds.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Unless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) stock benefiting from the rise of AI. <a class=\"link\" data-ylk=\"slk:Click here to access our free report one of our favorites growth stories;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stock-pick-l/c7d6b86b-76fe-4aaf-86c6-563940fef8d6?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=SP_2&amp;utm_article=Dlh2b24PYQ%3D%3D&amp;utm_ticker=KE\" rel=\"nofollow noopener\" target=\"_blank\">Click here to access our free report one of our favorites growth stories</a>.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Adjusted Operating Margin<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Operating margin is an important measure of profitability as it shows the portion of revenue left after accounting for all core expenses – everything from the cost of goods sold to advertising and wages. It’s also useful for comparing profitability across companies with different levels of debt and tax rates because it excludes interest and taxes.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kimball Electronics was profitable over the last five years but held back by its large cost base. Its average operating margin of 4.4% was weak for an industrials business. This result isn’t too surprising given its low gross margin as a starting point.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking at the trend in its profitability, Kimball Electronics’s operating margin might have seen some fluctuations but has generally stayed the same over the last five years, which doesn’t help its cause.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Kimball Electronics Trailing 12-Month Operating Margin (GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Kimball Electronics Trailing 12-Month Operating Margin (GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Kimball Electronics generated an operating profit margin of 2.3%, down 1.8 percentage points year on year. Since Kimball Electronics’s operating margin decreased more than its gross margin, we can assume it was recently less efficient because expenses such as marketing, R&amp;D, and administrative overhead increased.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Earnings Per Share<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We track the long-term change in earnings per share (EPS) for the same reason as long-term revenue growth. Compared to revenue, however, EPS highlights whether a company’s growth is profitable.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kimball Electronics’s full-year EPS dropped 49.2%, or 10.5% annually, over the last four years. We tend to steer our readers away from companies with falling revenue and EPS, where diminishing earnings could imply changing secular trends and preferences. If the tide turns unexpectedly, Kimball Electronics’s low margin of safety could leave its stock price susceptible to large downswings.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Kimball Electronics Trailing 12-Month EPS (Non-GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Kimball Electronics Trailing 12-Month EPS (Non-GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Like with revenue, we analyze EPS over a more recent period because it can provide insight into an emerging theme or development for the business.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sadly for Kimball Electronics, its EPS declined by 18.1% annually over the last two years while its revenue was flat. This tells us the company struggled to adjust to choppy demand.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We can take a deeper look into Kimball Electronics’s earnings to better understand the drivers of its performance. Kimball Electronics’s operating margin has declined by 2 percentage points over the last two years. This was the most relevant factor (aside from the revenue impact) behind its lower earnings; taxes and interest expenses can also affect EPS but don’t tell us as much about a company’s fundamentals.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Kimball Electronics reported EPS at $0.29, down from $0.33 in the same quarter last year. Despite falling year on year, this print easily cleared analysts’ estimates. Over the next 12 months, Wall Street expects Kimball Electronics’s full-year EPS of $1.18 to grow 32.6%.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Key Takeaways from Kimball Electronics’s Q4 Results<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kimball Electronics's revenue in the quarter missed. Adding to the bad news was the company's lowering of its full-year revenue and operating margin guidance, which fell short of Wall Street’s estimates. Overall, this was a softer quarter. The stock traded down 4.5% to $17.06 immediately after reporting.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The latest quarter from Kimball Electronics’s wasn’t that good. One earnings report doesn’t define a company’s quality, though, so let’s explore whether the stock is a buy at the current price. We think that the latest quarter is just one piece of the longer-term business quality puzzle. Quality, when combined with valuation, can help determine if the stock is a buy. <a class=\"link\" data-ylk=\"slk:We cover that in our actionable full research report which you can read here, it’s free;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/ke?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=end1&amp;utm_article=Dlh2b24PYQ%3D%3D&amp;utm_ticker=KE\" rel=\"nofollow noopener\" target=\"_blank\">We cover that in our actionable full research report which you can read here, it’s free</a>.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/kimball-electronics-nasdaq-ke-misses-222233933.html",
            "pub_date": "2025-02-05 06:22:33",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Columbia Sportswear (NASDAQ:COLM) Beats Q4 Sales Targets But Stock Drops Outerwear manufacturer Columbia Sportswear (NASDAQ:COLM) beat Wall Street’s revenue expectations in Q4 CY2024, with sales up 3.5% year on year to $1.10 billion. On the other hand, next quarter’s revenue guidance of $756.5 million was less impressive, coming in 5.3% below analysts’ estimates. Its GAAP profit of $1.80 per share was 7.3% below analysts’ consensus estimates. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"COLM Cover Image\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Columbia Sportswear (NASDAQ:COLM) Beats Q4 Sales Targets But Stock Drops<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Outerwear manufacturer Columbia Sportswear (NASDAQ:COLM) beat Wall Street’s revenue expectations in Q4 CY2024, with sales up 3.5% year on year to $1.10 billion. On the other hand, next quarter’s revenue guidance of $756.5 million was less impressive, coming in 5.3% below analysts’ estimates. Its GAAP profit of $1.80 per share was 7.3% below analysts’ consensus estimates.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is now the time to buy Columbia Sportswear? <a class=\"link\" data-ylk=\"slk:Find out in our full research report;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/colm?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=top&amp;utm_article=Dlh2b2gBYA%3D%3D&amp;utm_ticker=COLM\" rel=\"nofollow noopener\" target=\"_blank\">Find out in our full research report</a>.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Columbia Sportswear (COLM) Q4 CY2024 Highlights:<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue:</strong> $1.10 billion vs analyst estimates of $1.08 billion (3.5% year-on-year growth, 1.4% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>EPS (GAAP):</strong> $1.80 vs analyst expectations of $1.94 (7.3% miss)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EBITDA:</strong> $175.9 million vs analyst estimates of $177 million (16% margin, 0.6% miss)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Management’s <strong>revenue guidance</strong> for the upcoming financial <strong>year 2025</strong> is $3.44 billion at the midpoint, missing analyst estimates by 1.4% and implying 2% growth (vs -4.1% in FY2024)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>EPS (GAAP) guidance for the upcoming financial year 2025</strong> is $3.98 at the midpoint, missing analyst estimates by 8%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Operating Margin:</strong> 12.5%, up from 10.7% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Free Cash Flow Margin:</strong> 55.6%, down from 56.7% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Market Capitalization:</strong> $4.87 billion<!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Chairman, President and Chief Executive Officer Tim Boyle commented, “I’m encouraged that sales returned to growth in the fourth quarter, and we expect continued growth in 2025, across most brands and regions. During the year we made substantial progress on our inventory reduction efforts, achieved cost savings through our Profit Improvement Program, and returned meaningful cash to shareholders through share buybacks and dividends. We also laid the foundation for Columbia’s ACCELERATE Growth Strategy, which will come to life in the seasons ahead.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Company Overview<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Originally founded as a hat store in 1938, Columbia Sportswear (NASDAQ:COLM) is a manufacturer of outerwear, sportswear, and footwear designed for outdoor enthusiasts.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Apparel and Accessories<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Thanks to social media and the internet, not only are styles changing more frequently today than in decades past but also consumers are shifting the way they buy their goods, favoring omnichannel and e-commerce experiences. Some apparel and accessories companies have made concerted efforts to adapt while those who are slower to move may fall behind.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Sales Growth<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Reviewing a company’s long-term sales performance reveals insights into its quality. Any business can have short-term success, but a top-tier one grows for years. Regrettably, Columbia Sportswear’s sales grew at a weak 2.1% compounded annual growth rate over the last five years. This fell short of our benchmarks and is a poor baseline for our analysis.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Columbia Sportswear Quarterly Revenue\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Columbia Sportswear Quarterly Revenue<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We at StockStory place the most emphasis on long-term growth, but within consumer discretionary, a stretched historical view may miss a company riding a successful new product or trend. Columbia Sportswear’s history shows it grew in the past but relinquished its gains over the last two years, as its revenue fell by 1.4% annually.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Columbia Sportswear Year-On-Year Revenue Growth\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Columbia Sportswear Year-On-Year Revenue Growth<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This quarter, Columbia Sportswear reported modest year-on-year revenue growth of 3.5% but beat Wall Street’s estimates by 1.4%. Company management is currently guiding for a 1.8% year-on-year decline in sales next quarter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking further ahead, sell-side analysts expect revenue to grow 3.6% over the next 12 months. While this projection suggests its newer products and services will fuel better top-line performance, it is still below average for the sector.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Here at StockStory, we certainly understand the potential of thematic investing. Diverse winners from Microsoft (MSFT) to Alphabet (GOOG), Coca-Cola (KO) to Monster Beverage (MNST) could all have been identified as promising growth stories with a megatrend driving the growth. So, in that spirit, we’ve identified <a class=\"link\" data-ylk=\"slk:a relatively under-the-radar profitable growth stock benefiting from the rise of AI, available to you FREE via this link;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stock-pick-l/c7d6b86b-76fe-4aaf-86c6-563940fef8d6?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=SP_6&amp;utm_article=Dlh2b2gBYA%3D%3D&amp;utm_ticker=COLM\" rel=\"nofollow noopener\" target=\"_blank\">a relatively under-the-radar profitable growth stock benefiting from the rise of AI, available to you FREE via this link</a>.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Cash Is King<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Free cash flow isn't a prominently featured metric in company financials and earnings releases, but we think it's telling because it accounts for all operating and capital expenses, making it tough to manipulate. Cash is king.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Columbia Sportswear has shown impressive cash profitability, giving it the option to reinvest or return capital to investors. The company’s free cash flow margin averaged 15.6% over the last two years, better than the broader consumer discretionary sector. The divergence from its underwhelming operating margin stems from the add-back of non-cash charges like depreciation and stock-based compensation. GAAP operating profit expenses these line items, but free cash flow does not.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Columbia Sportswear Trailing 12-Month Free Cash Flow Margin\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Columbia Sportswear Trailing 12-Month Free Cash Flow Margin<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Columbia Sportswear’s free cash flow clocked in at $609.4 million in Q4, equivalent to a 55.6% margin. The company’s cash profitability regressed as it was 1.1 percentage points lower than in the same quarter last year, but it’s still above its two-year average. We wouldn’t read too much into this quarter’s decline because investment needs can be seasonal, leading to short-term swings. Long-term trends are more important.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Over the next year, analysts predict Columbia Sportswear’s cash conversion will fall. Their consensus estimates imply its free cash flow margin of 14.6% for the last 12 months will decrease to 6.1%.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Key Takeaways from Columbia Sportswear’s Q4 Results<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It was good to see Columbia Sportswear narrowly top analysts’ revenue expectations this quarter. On the other hand, its full-year EPS guidance missed and its EPS fell short of Wall Street’s estimates. Overall, this was a weaker quarter. The stock traded down 7.6% to $79.37 immediately following the results.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Columbia Sportswear’s latest earnings report disappointed. One quarter doesn’t define a company’s quality, so let’s explore whether the stock is a buy at the current price. The latest quarter does matter, but not nearly as much as longer-term fundamentals and valuation, when deciding if the stock is a buy. <a class=\"link\" data-ylk=\"slk:We cover that in our actionable full research report which you can read here, it’s free;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/colm?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=end1&amp;utm_article=Dlh2b2gBYA%3D%3D&amp;utm_ticker=COLM\" rel=\"nofollow noopener\" target=\"_blank\">We cover that in our actionable full research report which you can read here, it’s free</a>.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/columbia-sportswear-nasdaq-colm-beats-221521670.html",
            "pub_date": "2025-02-05 06:15:21",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enphase (NASDAQ:ENPH) Beats Q4 Sales Targets, Stock Soars Home energy technology company Enphase (NASDAQ:ENPH) reported revenue ahead of Wall Street’s expectations in Q4 CY2024, with sales up 26.5% year on year to $382.7 million. On top of that, next quarter’s revenue guidance ($360 million at the midpoint) was surprisingly good and 6.4% above what analysts were expecting. Its non-GAAP profit of $0.94 per share was 24.7% above analysts’ consensus estimates. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"ENPH Cover Image\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase (NASDAQ:ENPH) Beats Q4 Sales Targets, Stock Soars<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Home energy technology company Enphase (NASDAQ:ENPH) reported revenue ahead of Wall Street’s expectations in Q4 CY2024, with sales up 26.5% year on year to $382.7 million. On top of that, next quarter’s revenue guidance ($360 million at the midpoint) was surprisingly good and 6.4% above what analysts were expecting. Its non-GAAP profit of $0.94 per share was 24.7% above analysts’ consensus estimates.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is now the time to buy Enphase? <a class=\"link\" data-ylk=\"slk:Find out in our full research report;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/enph?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=top&amp;utm_article=Dlh2b2gHZQ%3D%3D&amp;utm_ticker=ENPH\" rel=\"nofollow noopener\" target=\"_blank\">Find out in our full research report</a>.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Enphase (ENPH) Q4 CY2024 Highlights:<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue:</strong> $382.7 million vs analyst estimates of $376.8 million (26.5% year-on-year growth, 1.6% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EPS:</strong> $0.94 vs analyst estimates of $0.75 (24.7% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EBITDA:</strong> $127.3 million vs analyst estimates of $121.8 million (33.3% margin, 4.5% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue Guidance for Q1 CY2025</strong> is $360 million at the midpoint, above analyst estimates of $338.4 million<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Operating Margin:</strong> 14.3%, up from -11.9% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Free Cash Flow Margin:</strong> 41.6%, up from 5.1% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Sales Volumes</strong> rose 26% year on year (-67.3% in the same quarter last year)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Market Capitalization:</strong> $8.63 billion<!-- HTML_TAG_END --></p> </li> </ul> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Company Overview<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The first company to successfully commercialize the solar micro-inverter, Enphase (NASDAQ:ENPH) manufactures software-driven home energy products.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Renewable Energy<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Renewable energy companies are buoyed by the secular trend of green energy that is upending traditional power generation. Those who innovate and evolve with this dynamic market can win share while those who continue to rely on legacy technologies can see diminishing demand, which includes headwinds from increasing regulation against “dirty” energy. Additionally, these companies are at the whim of economic cycles, as interest rates can impact the willingness to invest in renewable energy projects.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Sales Growth<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Examining a company’s long-term performance can provide clues about its quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Over the last five years, Enphase grew its sales at an incredible 16.3% compounded annual growth rate. Its growth beat the average industrials company and shows its offerings resonate with customers.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Enphase Quarterly Revenue\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase Quarterly Revenue<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We at StockStory place the most emphasis on long-term growth, but within industrials, a half-decade historical view may miss cycles, industry trends, or a company capitalizing on catalysts such as a new contract win or a successful product line. Enphase’s recent history marks a sharp pivot from its five-year trend as its revenue has shown annualized declines of 24.5% over the last two years.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Enphase Year-On-Year Revenue Growth\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase Year-On-Year Revenue Growth<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We can better understand the company’s revenue dynamics by analyzing its units sold, which reached 2.01 million in the latest quarter. Over the last two years, Enphase’s units sold averaged 15.8% year-on-year declines. Because this number is better than its revenue growth, we can see the company’s average selling price decreased.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Enphase Units Sold\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase Units Sold<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This quarter, Enphase reported robust year-on-year revenue growth of 26.5%, and its $382.7 million of revenue topped Wall Street estimates by 1.6%. Company management is currently guiding for a 36.7% year-on-year increase in sales next quarter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking further ahead, sell-side analysts expect revenue to grow 21.8% over the next 12 months, an improvement versus the last two years. This projection is eye-popping and suggests its newer products and services will fuel better top-line performance.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Here at StockStory, we certainly understand the potential of thematic investing. Diverse winners from Microsoft (MSFT) to Alphabet (GOOG), Coca-Cola (KO) to Monster Beverage (MNST) could all have been identified as promising growth stories with a megatrend driving the growth. So, in that spirit, we’ve identified <a class=\"link\" data-ylk=\"slk:a relatively under-the-radar profitable growth stock benefiting from the rise of AI, available to you FREE via this link;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stock-pick-l/c7d6b86b-76fe-4aaf-86c6-563940fef8d6?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=SP_6&amp;utm_article=Dlh2b2gHZQ%3D%3D&amp;utm_ticker=ENPH\" rel=\"nofollow noopener\" target=\"_blank\">a relatively under-the-radar profitable growth stock benefiting from the rise of AI, available to you FREE via this link</a>.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Adjusted Operating Margin<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Enphase has been an efficient company over the last five years. It was one of the more profitable businesses in the industrials sector, boasting an average operating margin of 15.6%. This result isn’t surprising as its high gross margin gives it a favorable starting point.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Analyzing the trend in its profitability, Enphase’s operating margin decreased by 23.3 percentage points over the last five years. Even though its historical margin is high, shareholders will want to see Enphase become more profitable in the future.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Enphase Trailing 12-Month Operating Margin (GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase Trailing 12-Month Operating Margin (GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Enphase generated an operating profit margin of 14.3%, up 26.2 percentage points year on year. The increase was solid, and since its operating margin rose more than its gross margin, we can infer it was recently more efficient with expenses such as marketing, R&amp;D, and administrative overhead.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Earnings Per Share<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Revenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Enphase’s EPS grew at an astounding 20% compounded annual growth rate over the last five years, higher than its 16.3% annualized revenue growth. However, we take this with a grain of salt because its operating margin didn’t expand and it didn’t repurchase its shares, meaning the delta came from reduced interest expenses or taxes.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Enphase Trailing 12-Month EPS (Non-GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Enphase Trailing 12-Month EPS (Non-GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Like with revenue, we analyze EPS over a shorter period to see if we are missing a change in the business.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Enphase’s two-year annual EPS declines of 28.4% were bad and lower than its two-year revenue performance.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Enphase reported EPS at $0.94, up from $0.54 in the same quarter last year. This print easily cleared analysts’ estimates, and shareholders should be content with the results. Over the next 12 months, Wall Street expects Enphase’s full-year EPS of $2.37 to grow 50.3%.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Key Takeaways from Enphase’s Q4 Results<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We enjoyed seeing Enphase exceed analysts’ EPS expectations this quarter. We were also glad its revenue guidance for next quarter came in higher than Wall Street’s estimates. On the other hand, its sales volume slightly missed. Overall, we think this was a decent quarter with some key metrics above expectations. The stock traded up 6% to $70.24 immediately after reporting.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Indeed, Enphase had a rock-solid quarterly earnings result, but is this stock a good investment here? When making that decision, it’s important to consider its valuation, business qualities, as well as what has happened in the latest quarter. <a class=\"link\" data-ylk=\"slk:We cover that in our actionable full research report which you can read here, it’s free;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nasdaq/enph?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=end1&amp;utm_article=Dlh2b2gHZQ%3D%3D&amp;utm_ticker=ENPH\" rel=\"nofollow noopener\" target=\"_blank\">We cover that in our actionable full research report which you can read here, it’s free</a>.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/enphase-nasdaq-enph-beats-q4-221447947.html",
            "pub_date": "2025-02-05 06:14:47",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Carlisle (NYSE:CSL) Reports Sales Below Analyst Estimates In Q4 Earnings Building envelope solutions provider Carlisle Companies (NYSE:CSL) missed Wall Street’s revenue expectations in Q4 CY2024, with sales flat year on year at $1.12 billion. Its non-GAAP profit of $4.47 per share was 1.1% above analysts’ consensus estimates. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"CSL Cover Image\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Carlisle (NYSE:CSL) Reports Sales Below Analyst Estimates In Q4 Earnings<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Building envelope solutions provider Carlisle Companies (NYSE:CSL) missed Wall Street’s revenue expectations in Q4 CY2024, with sales flat year on year at $1.12 billion. Its non-GAAP profit of $4.47 per share was 1.1% above analysts’ consensus estimates.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is now the time to buy Carlisle? <a class=\"link\" data-ylk=\"slk:Find out in our full research report;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nyse/csl?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=top&amp;utm_article=Dlh2bm0Cbg%3D%3D&amp;utm_ticker=CSL\" rel=\"nofollow noopener\" target=\"_blank\">Find out in our full research report</a>.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Carlisle (CSL) Q4 CY2024 Highlights:<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue:</strong> $1.12 billion vs analyst estimates of $1.15 billion (flat year on year, 2.5% miss)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EPS:</strong> $4.47 vs analyst estimates of $4.42 (1.1% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EBITDA:</strong> $281.7 million vs analyst estimates of $291.4 million (25.1% margin, 3.3% miss)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>2025 outlook includes MSD revenue growth and ~50 bps of adj. EBITDA margin expansion (in line)</strong><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Operating Margin:</strong> 19.9%, down from 22.5% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Free Cash Flow Margin:</strong> 29.7%, down from 31.1% in the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Organic Revenue</strong> fell 3.5% year on year (-2.3% in the same quarter last year)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Market Capitalization:</strong> $17.24 billion<!-- HTML_TAG_END --></p> </li> </ul> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Company Overview<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Originally founded as Carlisle Tire and Rubber Company, Carlisle Companies (NYSE:CSL) is a multi-industry product manufacturer focusing on construction materials and weatherproofing technologies.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Building Materials<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Traditionally, building materials companies have built competitive advantages with economies of scale, brand recognition, and strong relationships with builders and contractors. More recently, advances to address labor availability and job site productivity have spurred innovation. Additionally, companies in the space that can produce more energy-efficient materials have opportunities to take share. However, these companies are at the whim of construction volumes, which tend to be cyclical and can be impacted heavily by economic factors such as interest rates. Additionally, the costs of raw materials can be driven by a myriad of worldwide factors and greatly influence the profitability of building materials companies.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Sales Growth<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Examining a company’s long-term performance can provide clues about its quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Unfortunately, Carlisle struggled to consistently increase demand as its $5.00 billion of sales for the trailing 12 months was close to its revenue five years ago. This was below our standards and is a rough starting point for our analysis.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Carlisle Quarterly Revenue\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Carlisle Quarterly Revenue<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Long-term growth is the most important, but within industrials, a half-decade historical view may miss new industry trends or demand cycles. Carlisle’s recent history shows its demand has stayed suppressed as its revenue has declined by 4.2% annually over the last two years.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Carlisle Year-On-Year Revenue Growth\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Carlisle Year-On-Year Revenue Growth<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We can better understand the company’s sales dynamics by analyzing its organic revenue, which strips out one-time events like acquisitions and currency fluctuations that don’t accurately reflect its fundamentals. Over the last two years, Carlisle’s organic revenue averaged 2.8% year-on-year declines. Because this number aligns with its normal revenue growth, we can see the company’s core operations (not acquisitions and divestitures) drove most of its results.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Carlisle Organic Revenue Growth\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Carlisle Organic Revenue Growth<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This quarter, Carlisle missed Wall Street’s estimates and reported a rather uninspiring 0.4% year-on-year revenue decline, generating $1.12 billion of revenue.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking ahead, sell-side analysts expect revenue to grow 6.1% over the next 12 months. While this projection indicates its newer products and services will catalyze better top-line performance, it is still below the sector average.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Unless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) stock benefiting from the rise of AI. <a class=\"link\" data-ylk=\"slk:Click here to access our free report one of our favorites growth stories;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stock-pick-l/c7d6b86b-76fe-4aaf-86c6-563940fef8d6?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=SP_2&amp;utm_article=Dlh2bm0Cbg%3D%3D&amp;utm_ticker=CSL\" rel=\"nofollow noopener\" target=\"_blank\">Click here to access our free report one of our favorites growth stories</a>.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Adjusted Operating Margin<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Operating margin is a key measure of profitability. Think of it as net income - the bottom line - excluding the impact of taxes and interest on debt, which are less connected to business fundamentals.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Carlisle has been a well-oiled machine over the last five years. It demonstrated elite profitability for an industrials business, boasting an average operating margin of 18.2%. This result isn’t too surprising as its gross margin gives it a favorable starting point.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Analyzing the trend in its profitability, Carlisle’s operating margin rose by 11.5 percentage points over the last five years, showing its efficiency has meaningfully improved.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Carlisle Trailing 12-Month Operating Margin (GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Carlisle Trailing 12-Month Operating Margin (GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Carlisle generated an operating profit margin of 19.9%, down 2.5 percentage points year on year. Since Carlisle’s operating margin decreased more than its gross margin, we can assume it was recently less efficient because expenses such as marketing, R&amp;D, and administrative overhead increased.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Earnings Per Share<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We track the long-term change in earnings per share (EPS) for the same reason as long-term revenue growth. Compared to revenue, however, EPS highlights whether a company’s growth is profitable.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Carlisle’s EPS grew at a spectacular 16.2% compounded annual growth rate over the last five years, higher than its flat revenue. This tells us management responded to softer demand by adapting its cost structure.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Carlisle Trailing 12-Month EPS (Non-GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Carlisle Trailing 12-Month EPS (Non-GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We can take a deeper look into Carlisle’s earnings quality to better understand the drivers of its performance. As we mentioned earlier, Carlisle’s operating margin declined this quarter but expanded by 11.5 percentage points over the last five years. Its share count also shrank by 20.5%, and these factors together are positive signs for shareholders because improving profitability and share buybacks turbocharge EPS growth relative to revenue growth.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Carlisle Diluted Shares Outstanding\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Carlisle Diluted Shares Outstanding<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Like with revenue, we analyze EPS over a more recent period because it can provide insight into an emerging theme or development for the business.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->For Carlisle, its two-year annual EPS growth of 5.3% was lower than its five-year trend. We hope its growth can accelerate in the future.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Carlisle reported EPS at $4.47, up from $4.18 in the same quarter last year. This print beat analysts’ estimates by 1.1%. Over the next 12 months, Wall Street expects Carlisle’s full-year EPS of $20.23 to grow 12.4%.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Key Takeaways from Carlisle’s Q4 Results<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Revenue missed, but EPS beat by a small amount. 2025 guidance calling for mid-single-digit percentage revenue growth and 50 bps (half a percent) of EBITDA margin expansion compared to 2024 was roughly in line with expectations. Overall, there were any resounding positives in these results. The stock traded down 1.9% to $369 immediately following the results.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Carlisle underperformed this quarter, but does that create an opportunity to invest right now? If you’re making that decision, you should consider the bigger picture of valuation, business qualities, as well as the latest earnings. <a class=\"link\" data-ylk=\"slk:We cover that in our actionable full research report which you can read here, it’s free;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nyse/csl?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=end1&amp;utm_article=Dlh2bm0Cbg%3D%3D&amp;utm_ticker=CSL\" rel=\"nofollow noopener\" target=\"_blank\">We cover that in our actionable full research report which you can read here, it’s free</a>.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/carlisle-nyse-csl-reports-sales-215918023.html",
            "pub_date": "2025-02-05 05:59:18",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nissan and Honda may call off merger talks, Asahi says Japanese automakers Honda and Nissan may call off merger talks, the Asahi newspaper reported on Wednesday, with the boards of both manufacturers to meet separately in the near future to discuss next steps. The newspaper cited multiple sources in its report. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->TOKYO (Reuters) - Japanese automakers Honda and Nissan may call off merger talks, the Asahi newspaper reported on Wednesday, with the boards of both manufacturers to meet separately in the near future to discuss next steps.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The newspaper cited multiple sources in its report.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by David Dolan; Editing by Chris Reese)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/nissan-honda-may-call-off-220622122.html",
            "pub_date": "2025-02-05 06:06:22",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Veralto’s (NYSE:VLTO) Q4 Earnings Results: Revenue In Line With Expectations Water analytics and treatment company Veralto (NYSE:VLTO) met Wall Street’s revenue expectations in Q4 CY2024, with sales up 4.4% year on year to $1.35 billion. Its non-GAAP profit of $0.95 per share was 6.5% above analysts’ consensus estimates. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 480px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 480; --img-max-width: 960px;\"><img alt=\"VLTO Cover Image\" class=\"yf-g633g8 loader\" height=\"480\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Veralto’s (NYSE:VLTO) Q4 Earnings Results: Revenue In Line With Expectations<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Water analytics and treatment company Veralto (NYSE:VLTO) met Wall Street’s revenue expectations in Q4 CY2024, with sales up 4.4% year on year to $1.35 billion. Its non-GAAP profit of $0.95 per share was 6.5% above analysts’ consensus estimates.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Is now the time to buy Veralto? <a class=\"link\" data-ylk=\"slk:Find out in our full research report;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nyse/vlto?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=top&amp;utm_article=Dlh2bm4FYw%3D%3D&amp;utm_ticker=VLTO\" rel=\"nofollow noopener\" target=\"_blank\">Find out in our full research report</a>.<!-- HTML_TAG_END --></p> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Veralto (VLTO) Q4 CY2024 Highlights:<!-- HTML_TAG_END --></h3> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Revenue:</strong> $1.35 billion vs analyst estimates of $1.35 billion (4.4% year-on-year growth, in line)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EPS:</strong> $0.95 vs analyst estimates of $0.89 (6.5% beat)<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Adjusted EPS guidance for the upcoming financial year 2025</strong> is $3.65 at the midpoint, missing analyst estimates by 1.6%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Operating Margin:</strong> 22.9%, in line with the same quarter last year<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><strong>Market Capitalization:</strong> $25.02 billion<!-- HTML_TAG_END --></p> </li> </ul> <h3 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Company Overview<!-- HTML_TAG_END --></h3> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Spun off from Danaher in 2023, Veralto (NYSE:VLTO) provides water analytics and treatment solutions.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Air and Water Services<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Many air and water services are statutorily mandated or non-discretionary. This means recurring revenues are often earned through contracts, making for more predictable top-line trends. Additionally, there has been an increasing focus on emissions and water conservation over the last decade, driving innovation in the sector and demand for new services. On the other hand, air and water services companies are at the whim of economic cycles. Interest rates, for example, can greatly impact manufacturing or industrial processes that drive incremental demand for these companies’ offerings.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Sales Growth<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A company’s long-term sales performance signals its overall quality. Even a bad business can shine for one or two quarters, but a top-tier one grows for years. Regrettably, Veralto’s sales grew at a sluggish 3.4% compounded annual growth rate over the last three years. This was below our standard for the industrials sector and is a tough starting point for our analysis.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Veralto Quarterly Revenue\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Veralto Quarterly Revenue<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Long-term growth is the most important, but within industrials, a stretched historical view may miss new industry trends or demand cycles. Veralto’s annualized revenue growth of 3.3% over the last two years aligns with its three-year trend, suggesting its demand was consistently weak.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Veralto Year-On-Year Revenue Growth\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Veralto Year-On-Year Revenue Growth<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Veralto also breaks out the revenue for its most important segments, Water Quality and Product Quality, which are 60.3% and 39.7% of revenue. Over the last two years, Veralto’s Water Quality revenue (measurement and analysis equipment) averaged 3.7% year-on-year growth while its Product Quality revenue (marking and coding for packages) averaged 5.5% growth.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This quarter, Veralto grew its revenue by 4.4% year on year, and its $1.35 billion of revenue was in line with Wall Street’s estimates.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking ahead, sell-side analysts expect revenue to grow 5% over the next 12 months. While this projection indicates its newer products and services will catalyze better top-line performance, it is still below average for the sector.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Unless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) stock benefiting from the rise of AI. <a class=\"link\" data-ylk=\"slk:Click here to access our free report one of our favorites growth stories;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stock-pick-l/c7d6b86b-76fe-4aaf-86c6-563940fef8d6?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=SP_2&amp;utm_article=Dlh2bm4FYw%3D%3D&amp;utm_ticker=VLTO\" rel=\"nofollow noopener\" target=\"_blank\">Click here to access our free report one of our favorites growth stories</a>.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Adjusted Operating Margin<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Operating margin is a key measure of profitability. Think of it as net income - the bottom line - excluding the impact of taxes and interest on debt, which are less connected to business fundamentals.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Veralto has been a well-oiled machine over the last four years. It demonstrated elite profitability for an industrials business, boasting an average operating margin of 22.8%. This result isn’t surprising as its high gross margin gives it a favorable starting point.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Looking at the trend in its profitability, Veralto’s operating margin rose by 1.1 percentage points over the last four years, showing its efficiency has improved.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Veralto Trailing 12-Month Operating Margin (GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Veralto Trailing 12-Month Operating Margin (GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Veralto generated an operating profit margin of 22.9%, in line with the same quarter last year. This indicates the company’s cost structure has recently been stable.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Earnings Per Share<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->We track the change in earnings per share (EPS) for the same reason as long-term revenue growth. Compared to revenue, however, EPS highlights whether a company’s growth is profitable.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 540px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 540; --img-max-width: 960px;\"><img alt=\"Veralto Trailing 12-Month EPS (Non-GAAP)\" class=\"yf-g633g8 loader\" height=\"540\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Veralto Trailing 12-Month EPS (Non-GAAP)<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Veralto’s EPS grew at a decent 8.9% compounded annual growth rate over the last two years, higher than its 3.3% annualized revenue growth. However, this alone doesn’t tell us much about its business quality because its operating margin didn’t expand during this time.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In Q4, Veralto reported EPS at $0.95, up from $0.87 in the same quarter last year. This print beat analysts’ estimates by 6.5%. Over the next 12 months, Wall Street expects Veralto’s full-year EPS of $3.54 to grow 4.7%.<!-- HTML_TAG_END --></p> <h2 class=\"header-scroll yf-gn6wdt\"><!-- HTML_TAG_START -->Key Takeaways from Veralto’s Q4 Results<!-- HTML_TAG_END --></h2> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It was encouraging to see Veralto beat analysts’ EPS expectations this quarter despite in line revenue. On the other hand, its full-year EPS guidance missed and its EPS guidance for next quarter fell slightly short of Wall Street’s estimates. Overall, this quarter was mixed. The stock traded up 1.6% to $102.65 immediately after reporting.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Big picture, is Veralto a buy here and now? We think that the latest quarter is just one piece of the longer-term business quality puzzle. Quality, when combined with valuation, can help determine if the stock is a buy. <a class=\"link\" data-ylk=\"slk:We cover that in our actionable full research report which you can read here, it’s free;elm:context_link;itc:0;sec:content-canvas\" href=\"https://stockstory.org/stocks/nyse/vlto?utm_source=earningsArticle&amp;utm_medium=yahoo&amp;utm_campaign=end1&amp;utm_article=Dlh2bm4FYw%3D%3D&amp;utm_ticker=VLTO\" rel=\"nofollow noopener\" target=\"_blank\">We cover that in our actionable full research report which you can read here, it’s free</a>.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/veralto-nyse-vlto-q4-earnings-214609835.html",
            "pub_date": "2025-02-05 05:46:09",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lawmakers plan to move first on stablecoins as they push new crypto legislation following Trump win Republican lawmakers said Tuesday they are moving full-tilt to help President Donald Trump fulfill what the crypto world most unanimously wants from the new administration: clear regulation for the digital asset industry. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Republican lawmakers said Tuesday they are moving full-tilt to help President Donald Trump fulfill what crypto world most unanimously wants from the new administration: clear regulation for the digital asset industry.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We have a bicameral project for both a stablecoins bill and a regulatory framework that will bring clarity to digital assets in United States,\" House Financial Services Committee Chairman French Hill (R-Ark.) told reporters during a press conference where they were joined by Trump's AI and crypto czar David Sacks.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Hill spoke alongside Senate Banking Committee Chairman Tim Scott (R-S.C.), Senate Agriculture Committee Chairman John Boozman (R-Ark.) as well as House Agriculture Committee Chairman G.T. Thompson (R-P.A.).<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"UNITED STATES - SEPTEMBER 18: Rep. French Hill, R-Ark., leaves the Capitol Hill Club after a meeting of the House Republican Conference on Wednesday, September 18, 2024. (Tom Williams/CQ-Roll Call, Inc via Getty Images)\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->UNITED STATES - SEPTEMBER 18: Rep. French Hill, R-Ark., leaves the Capitol Hill Club after a meeting of the House Republican Conference on Wednesday, September 18, 2024. (Tom Williams/CQ-Roll Call, Inc via Getty Images)<!-- HTML_TAG_END --> <span class=\"caption-separator yf-8xybrv\" data-svelte-h=\"svelte-nxhdlu\">·</span> <span>Tom Williams via Getty Images</span></figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Lawmakers are set to move first with a bill on stablecoins and then tackle a more comprehensive bill on market structure for crypto.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Earlier Tuesday Senators Bill Hagerty (R-TN), Kirsten Gillibrand (D-NY), Cynthia Lummis (R-WY) and Scott introduced the U.S. Stablecoins (GENIUS) Act — a bill designed to set a clearer framework for the use of stablecoins as payments.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"My goal is to be as aggressive as possible, to achieve an objective of having bills through the Senate in a hundred days,\" Scott told reporters.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Scott said that Republicans have been working with Democrats already and that the bill is moving quickly. He is \"pleasantly surprised\" that members from both parties on the committee as well as Senator GIllibrand are \"anxious to have a win in this digital space.\"<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"Sen. Tim Scott, R-S.C., speaks following the Senate Republican policy luncheon at the Capitol, Tuesday, Feb. 4, 2025, in Washington. (AP Photo/Rod Lamkey, Jr.)\" class=\"yf-g633g8 loader\" height=\"640\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Sen. Tim Scott, R-S.C., speaks following the Senate Republican policy luncheon at the Capitol, Tuesday, Feb. 4, 2025, in Washington. (AP Photo/Rod Lamkey, Jr.)<!-- HTML_TAG_END --> <span class=\"caption-separator yf-8xybrv\" data-svelte-h=\"svelte-nxhdlu\">·</span> <span>ASSOCIATED PRESS</span></figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Last year while campaigning, President Trump said he would make the US the \"crypto capital of the planet.\" He also made a number of specific promises.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->As part of the crypto-focused executive order the President signed in January, he ordered for the formation of a presidential group on digital assets led by Sacks.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A core aim of the new working group is to coordinate clearer regulation for the sector.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Some of Trump’s promises to the crypto world, like prohibiting the US government from creating a central bank digital currency (CBDC), have been easy to deliver.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Other promises and regulatory developments for the crypto world might take more time. Major questions still remain around whether the Trump administration will deliver a \"national digital asset stockpile,\" which Sacks' group has also been directed to evaluate.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We're still in the very early stages of this, but that's one of the first things we're going to look at is the feasibility of a bitcoin reserve,\" Sacks said, responding to a question from Yahoo Finance on Tuesday.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 640px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 640; --img-max-width: 960px;\"><img alt=\"WASHINGTON, DC - JANUARY 23: David Sacks, U.S. President Donald Trump&amp;#39;s \" class=\"yf-g633g8 loader\" height=\"640\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->WASHINGTON, DC - JANUARY 23: David Sacks, U.S. President Donald Trump's \"AI and Crypto Czar\", speaks to President Trump as he signs a series of executive orders in the Oval Office of the White House on January 23, 2025 in Washington, DC. Trump signed a range of executive orders pertaining to issues including crypto currency, Artificial Intelligence, and clemency for anti-abortion activists. (Photo by Anna Moneymaker/Getty Images)<!-- HTML_TAG_END --> <span class=\"caption-separator yf-8xybrv\" data-svelte-h=\"svelte-nxhdlu\">·</span> <span>Anna Moneymaker via Getty Images</span></figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In January, the Securities and Exchange Commission formed a new crypto task force led by SEC Commissioner Hester Pierce.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In a statement released Tuesday afternoon, Pierce asked that investors “be patient,” cautioning against expectations for quick improvements.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“It took us a long time to get into this mess, and it is going to take us some time to get out of it,” Pierce said in a statement.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><em>David Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.</em><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:1;pos:1\" data-ylk=\"slk:Click here for in-depth analysis of the latest stock market news and events moving stock prices;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/topic/stock-market-news/\"><strong>Click here for in-depth analysis of the latest stock market news and events moving stock prices</strong></a><strong>.</strong><!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-i13n=\"cpos:2;pos:1\" data-ylk=\"slk:Read the latest financial and business news from Yahoo Finance;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\" href=\"https://finance.yahoo.com/news/\"><strong>Read the latest financial and business news from Yahoo Finance</strong></a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/lawmakers-plan-to-move-first-on-stablecoins-as-they-push-new-crypto-legislation-following-trump-win-215138380.html",
            "pub_date": "2025-02-05 05:51:38",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China retaliatory measures to have limited impact on energy prices, Goldman says Minutes after U.S. President Donald Trump's 10% tariff on Chinese goods kicked in at 12:01 a.m. ET (0501 GMT), China's finance ministry said it would impose levies of 15% for U.S. coal and LNG and 10% for crude oil, farm equipment and some autos.  \"We believe near term implications to commodity markets will be limited given that neither global supply nor demand of these commodities are changed by China's tariffs,\" Goldman Sachs said in a note. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - Goldman Sachs on Tuesday said it expects Beijing's retaliatory tariffs in response to new U.S. restrictions against Chinese goods to have only limited impact on energy prices.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Minutes after U.S. President Donald Trump's 10% tariff on Chinese goods kicked in at 12:01 a.m. ET (0501 GMT), China's finance ministry said it would impose levies of 15% for U.S. coal and LNG and 10% for crude oil, farm equipment and some autos.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"We believe near term implications to commodity markets will be limited given that neither global supply nor demand of these commodities are changed by China's tariffs,\" Goldman Sachs said in a note.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Impacted U.S. volumes are likely to easily find alternative buying markets, while China replaces impacted import volumes with alternative suppliers, Goldman said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->U.S. liquefied natural gas (LNG) exports are likely to increase, while incremental supply from other Atlantic basin suppliers might head to Asia, Goldman said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"In coal, we expect U.S. volumes to be redirected to Japan and Korea, which will likely release local Pacific basin supplies to go to China instead,\" analysts at Goldman Sachs said, adding China crude oil imports from the U.S. are small enough that can be easily reallocated.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Impact to commodity freight rates will also likely be limited given the United States is one of China's farthest away trading partners, it said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->However, Goldman said the most significant impact from China's retaliatory measures to commodity markets is potential pause in new long-term LNG contract negotiations between China buyers and U.S. LNG export facilities.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Oil prices diverged at settlement on Tuesday amid tariff drama between Washington and Beijing. [O/R]<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Brijesh Patel in Bengaluru; Editing by Chris Reese and Marguerita Choy)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/china-retaliatory-measures-limited-impact-214410953.html",
            "pub_date": "2025-02-05 05:44:10",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        }
    ]
}