{
    "data": [
        {
            "title": "OpenAI's Altman to stop in Abu Dhabi for MGX fundraising talks, sources say OpenAI CEO Sam Altman plans to visit the United Arab Emirates this week to discuss raising funds with Abu Dhabi investment group MGX, two sources with knowledge of the matter said.  Altman's Abu Dhabi stop comes at a key moment for the ChatGPT maker as established U.S. firms face a new challenge from cheaper Chinese alternative DeepSeek.  The talks with Abu Dhabi's MGX will follow a whirlwind tour of Asia by Altman, during which a partnership with Japan's SoftBank for AI services was announced on Monday. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Federico Maccioni and Krystal Hu<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->DUBAI/NEW YORK (Reuters) - OpenAI CEO Sam Altman plans to visit the United Arab Emirates this week to discuss raising funds with Abu Dhabi investment group MGX, two sources with knowledge of the matter said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Altman's Abu Dhabi stop comes at a key moment for the ChatGPT maker as established U.S. firms face a new challenge from cheaper Chinese alternative DeepSeek.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The talks with Abu Dhabi's MGX will follow a whirlwind tour of Asia by Altman, during which a partnership with Japan's SoftBank for AI services was announced on Monday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The UAE, a wealthy oil producer and longtime security partner of the U.S., is in a race to become an AI leader amid rising competition from neighbouring Qatar and Saudi Arabia.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->MGX took part in a $6.6 billion OpenAI funding round which closed in October. It was not immediately available for comment.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->SoftBank is in talks to lead a funding round of up to $40 billion in OpenAI at a valuation of $300 billion, including the new funds, in what could be a record single funding round for a private company, sources have said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->U.S. President Donald Trump last month unveiled a joint venture dubbed Stargate involving three principal equity backers OpenAI, SoftBank, and Oracle, in which MGX is also participating.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Stargate partners have promised to spend $100 billion to build the servers providing computing muscle for AI, ramping up to $500 billion over four years.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Altman visited India on Wednesday, where he met IT Minister Ashwini Vaishnaw and discussed the country's plan for creating a low-cost AI ecosystem.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Altman's OpenAI, which is part-owned by Microsoft, released ChatGPT in late 2022 and reached over 300 million weekly active users two years later. But China's DeepSeek emergence this month showed companies a cheaper alternative to access AI technology at a fraction of the cost.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->AI was top of the agenda when UAE President Sheikh Mohamed bin Zayed Al Nahyan visited Washington in December.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The UAE is pouring billions of dollars into AI and officials believe the bet will give it global clout by making the Gulf state a key economic actor long after oil demand has dried up.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But there have been U.S. concerns over its warm relationship with China on fears that U.S. technology could be shared with Beijing.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Abu Dhabi's AI push is led by the state-backed G42 and MGX, in which the $330 billion wealth fund Mubadala is a partner.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Federico Maccioni in Dubai and Krystal Hu in New York; Editing by Alexander Smith)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/openais-altman-stop-abu-dhabi-100644234.html",
            "pub_date": "2025-02-05 18:06:44",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Exclusive-India accuses Kia of evading taxes of $155 million in VW-like dispute India has accused South Korea's Kia of evading taxes of $155 million by misclassifying component imports but the carmaker has denied wrongdoing, the latest fight by a foreign automaker with New Delhi over tariffs, according to a document and two sources.  Kia competes with Hyundai and Maruti Suzuki in the world's third-largest auto market, where it has a share of 6% of roughly 4 million units a year, and its Kia Seltos and Sonet SUVs are among the top sellers.  For example, Tesla has publicly complained about high taxes on imported EVs and Volkswagen last week sued over a demand for a record $1.4 billion in back taxes that it called \"impossibly enormous\". ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->By Nikunj Ohri, Aditya Kalra and Aditi Shah<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->NEW DELHI (Reuters) - India has accused South Korea's Kia of evading taxes of $155 million by misclassifying component imports but the carmaker has denied wrongdoing, the latest fight by a foreign automaker with New Delhi over tariffs, according to a document and two sources.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kia competes with Hyundai and Maruti Suzuki in the world's third-largest auto market, where it has a share of 6% of roughly 4 million units a year, and its Kia Seltos and Sonet SUVs are among the top sellers.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Foreign companies in India face headaches from high taxes and long-drawn-out investigations.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->For example, Tesla has publicly complained about high taxes on imported EVs and Volkswagen last week sued over a demand for a record $1.4 billion in back taxes that it called \"impossibly enormous\".<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Tax officers sent a confidential notice to Kia's Indian unit in April 2024, flagging alleged tax evasion of 13.5 billion rupees, according to a government notice Reuters is reporting for the first time.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The offence centred on incorrect declaration of imports of components for the assembly of the carmaker's luxury Carnival minivan, the notice showed.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In a statement to Reuters, Kia India said it made \"a detailed response, supported by comprehensive evidence and documentation to substantiate\" its stand and the authorities were still reviewing the matter.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kia India is committed to complying with all regulations and has \"consistently cooperated with\" authorities, it added.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->India's finance ministry and customs officials did not respond to Reuters queries.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In its 432-page notice, the government said tax authorities found Kia's Carnival \"car model was being imported in parts or components in separate lots\" via different ports, with the \"intent to discharge lesser customs duty\".<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kia devised the strategy to ensure the imports \"could not (be) detected by customs,\" it added in the notice, issued by a customs commissioner in the southern city of Chennai.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Two sources said Kia's case was similar to that of Volkswagen, accused of evading a higher tax of 30% to 35% applicable on parts imported in \"completely knocked down\" or CKD form in a single shipment, instead shipping separate parts over days, making them eligible for a tax rate of just 10% to 15%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->During the investigation, Kia's website showed the Carnival model sold in India as being in \"CKD\" form, with retail sales of 9,887 units between 2020 and 2022, the tax notice said.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Volkswagen investigation spanned 14 car models from the Skoda Kodiaq to the Audi A3 and the Volkswagen Tiguan.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In contrast, Kia's case concerns only the Carnival model, a seven-seater priced around $73,500, which is among its most expensive cars in India.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->KIA COULD FACE $310 MLN PAYOUT<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Indian tax rules could require Kia to pay up to $310 million if it loses the dispute, or roughly double the amount evaded, due to penalty and interest.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The latest available corporate filings in India show Kia's domestic annual sales of $4.45 billion in fiscal 2022/23 were its highest ever, up 53% on the year, for net profit of $243 million.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Last week, India slashed import duties on fully-built high-end motorcycles to 30%, in a move widely seen as looking to placate U.S. President Donald Trump, who has in the past called India a \"tariff king\".<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But fully-assembled imported cars still attract a levy of more than 100%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kia has deposited 2.78 billion rupees ($32 million) \"under protest\" as it continues to fight the Indian tax notice, which is still proceeding, said a government source who declined to be named as the matter is private.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In 2022, authorities searched Kia offices and a factory in the southern state of Andhra Pradesh and took statements from India executives, some of whom the document identifies as Chief Procurement Officer Lee Sang Hwa, and Chief Finance Officer Kiho Yoo.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->During the investigation, Kia executives \"changed their stance and have made efforts to mislead,\" the tax notice stated, referring to statements on imports, manufacturing and taxation.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Kia was accused of importing more than 90% of the parts for Carnival, constituting a car in CKD form, which attracts higher tax, it added.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->India's head of indirect taxes, Sanjay Kumar Agarwal, told Reuters the law was clear and some automakers were flouting it by not paying applicable CKD duties.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"If they are on the wrong side, then the department will have to issue a notice,\" he said in an interview on Tuesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Nikunj Ohri, Aditya Kalra and Aditi Shah; Additional reporting by Munsif Vengattil; Editing by Clarence Fernandez)<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/exclusive-india-accuses-kia-evading-100020691.html",
            "pub_date": "2025-02-05 18:00:20",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TotalEnergies CEO says Europe should negotiate with US for free trade of LNG TotalEnergies CEO Patrick Pouyanne said on Wednesday that European countries should negotiate to obtain a free trade guarantee on liquefied natural gas (LNG) from the United States.  The comments come as U.S. President Donald Trump imposed sweeping tariffs on Chinese imports, which led to Beijing imposing a 15% levy on U.S. LNG and 10% on U.S. crude oil in retaliation on Tuesday. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->PARIS (Reuters) - TotalEnergies CEO Patrick Pouyanne said on Wednesday that European countries should negotiate to obtain a free trade guarantee on liquefied natural gas (LNG) from the United States.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The comments come as U.S. President Donald Trump imposed sweeping tariffs on Chinese imports, which led to Beijing imposing a 15% levy on U.S. LNG and 10% on U.S. crude oil in retaliation on Tuesday.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Speaking to reporters after the company announced fourth quarter earnings, Pouyanne added that LNG export capacity in the United States should practically double in coming years.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"But what happens if all of a sudden the U.S. decides they must export less than they've done historically? ... We must not pass from a so-called over-dependence on Russia to an over-dependence on another country, even if it's an ally,\" Pouyanne said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"There are two types of countries: those with free trade agreements that the Americans have signed and under which they cannot suspend exports, and then countries without free-trade agreements, like Europe.\"<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"I think it would be good for Europeans to ask the Americans in the negotiations that are to come, for a sort of free-trade guarantee on LNG,\" he said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Benjamin Mallet; Writing by Dominique Patton; Editing by Louise Heavens and Emelia Sithole-Matarise)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/totalenergies-ceo-says-europe-negotiate-092502193.html",
            "pub_date": "2025-02-05 17:25:02",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China mulling probe into Apple's app store fees, practices, Bloomberg News reports The development comes a day after China announced a wide range of measures targeting U.S. businesses including Google, farm equipment makers and the owner of fashion brand Calvin Klein, minutes after new U.S. tariffs on Chinese goods took effect.  The country's State Administration for Market Regulation is reviewing Apple's policies, including its up to 30% commission on in-app purchases and restrictions on external payment services and app stores, the report said. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reuters) - China's antitrust regulator is preparing for a possible investigation into Apple's policies and app store fees, Bloomberg News reported on Wednesday, citing people familiar with the matter.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The development comes a day after China announced a wide range of measures targeting U.S. businesses including Google, farm equipment makers and the owner of fashion brand Calvin Klein, minutes after new U.S. tariffs on Chinese goods took effect.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The country's State Administration for Market Regulation is reviewing Apple's policies, including its up to 30% commission on in-app purchases and restrictions on external payment services and app stores, the report said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Chinese regulators have been in discussions with Apple executives and app developers since last year, as per the report.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Apple and China's antitrust watchdog did not immediately respond to Reuters' request for comment.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->China's State Administration for Market Regulation on Tuesday said Google was suspected of violating the country's anti-monopoly law and that an investigation was initiated in accordance with the law.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Separately, China's Commerce Ministry said it had put PVH Corp, the holding company for brands including Calvin Klein and Tommy Hilfiger, and U.S. biotechnology firm Illumina on its \"unreliable entity\" list.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Surbhi Misra in Bengaluru; Editing by Varun H K and Mrigank Dhaniwala)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/china-mulling-probe-apples-app-091927638.html",
            "pub_date": "2025-02-05 17:19:27",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Meet Trump’s ‘other’ tech sidekick preparing to shape the future of America Four of the world’s five richest men had prime seats at Donald Trump’s inauguration. ",
            "description": "<div class=\"body yf-tsvcyu\"> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 599px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 599; --img-max-width: 960px;\"><img alt=\"larry ellison\" class=\"yf-g633g8 loader\" height=\"599\" loading=\"eager\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->Larry Ellison has been described as ‘one of the most serious players in the world’ by Donald Trump - Andrew Harnik/Getty Images North America<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Four of the world’s five richest men had <a class=\"link\" data-ylk=\"slk:prime seats at Donald Trump’s inauguration;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/us/politics/2025/01/20/donald-trump-inauguration-in-pictures/\" rel=\"nofollow noopener\" target=\"_blank\">prime seats at Donald Trump’s inauguration</a>.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Silicon Valley tycoons Elon Musk, Jeff Bezos and Mark Zuckerberg sat shoulder to shoulder at the event while Bernard Arnault, the French fashion magnate, was nearby, behind Barack Obama.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The missing man was Larry Ellison. The 80-year-old, who rounds out the top five wealth list, was notably absent from the pageantry of the inauguration as the world’s cameras were trained on Washington DC.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But the founder of the database giant Oracle has been a regular presence by Trump’s side.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ellison, whose $194bn (£156bn) net worth makes him the world’s fourth-richest person on Bloomberg’s Billionaires Index, was inside the White House the day after the inauguration as Trump announced a <a class=\"link\" data-ylk=\"slk:$500bn investment in artificial intelligence data centres;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/business/2025/01/23/america-stargate-project-effort-make-humanity-obselete/\" rel=\"nofollow noopener\" target=\"_blank\">$500bn investment in artificial intelligence data centres</a>.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->On Monday, he sat next to Rupert Murdoch to witness the president announcing a sovereign US wealth fund. “Larry is one of the most serious players anywhere in the world,” Trump said.<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 600px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 600; --img-max-width: 960px;\"><img alt=\"Rupert Murdoch and Oracle CTO Larry Ellison listen as U.S. President Donald Trump speaks to reporters in the Oval Office\" class=\"yf-g633g8 loader\" height=\"600\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->On Monday, Ellison sat next to Rupert Murdoch to witness the president announcing a sovereign US wealth fund - Anna Moneymaker/Getty Images<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ellison, who was also a fixture at Mar-a-Lago as the incoming president put together his plans, may be the tech billionaire with the second-most influence in the White House, behind Trump’s more visible ally Musk.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->As with Oracle itself, Ellison is not a household name outside of Silicon Valley. He rarely gives interviews and has only tweeted twice, despite having invested $1bn in Musk’s takeover of X.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“You won’t find people to talk to for this,” one associate said, when approached for an interview. “He doesn’t like to be in the public eye.”<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Still, once you become aware of Ellison you start seeing him everywhere. He stands to have a central role in Trump’s approach to artificial intelligence (AI), America’s media landscape and the fate of TikTok.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->While, unlike Musk, he has no formal role in the new administration, he has regularly sat in on meetings with the president’s advisers.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ellison belongs to a different generation of Silicon Valley tycoons than today’s most recognisable names. As with Bill Gates and Steve Jobs, Ellison made his mark as a technology entrepreneur in the 1970s.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->During an early job at the electronics company Ampex, he worked on a database project for the CIA that involved linking different types of computer records together in what became known as Oracle.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ellison and two co-workers quit to turn the idea into a business and, after incorporating it as the less-catchy Software Development Laboratories, he later renamed the company after the CIA project.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In the rapidly computerising corporate world, powered by Microsoft computers and Intel microchips, Oracle provided the databases that allowed these machines to access and record information.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The concept proved a winning one. The explosion of data in recent decades and the need to store and process it, combined with a series of ambitious acquisitions, has made Oracle a $480bn company. Ellison’s 41pc stake is valued at $195bn.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->While he may not have courted the limelight, Ellison has <a class=\"link\" data-ylk=\"slk:pursued a series of flamboyant endeavours;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/business/2024/12/20/blair-ally-buys-london-office-fugitive-hong-kong-tycoon/\" rel=\"nofollow noopener\" target=\"_blank\">pursued a series of flamboyant endeavours</a> that have drawn attention to him.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A licenced pilot, he once picked a fight with the US government because he was not allowed to fly an imported Russian fighter jet, claiming “it’s considered a firearm”.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In 1998, he skippered the winning yacht on the Sydney to Hobart yacht race (Murdoch’s eldest son, Lachlan, was part of the crew). In 2012, he paid $300m to acquire 98pc of Hawaii’s sixth largest island.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ellison has been married five times, recently wedding 33-year-old Jolin Zhu. News of the nuptials emerged when the University of Michigan, where Zhu studied, thanked Ellison for his help signing a star quarterback.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:As with much of Silicon Valley;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/business/2024/11/10/trumps-triumph-turbocharge-americas-left-tech-giants/\" rel=\"nofollow noopener\" target=\"_blank\">As with much of Silicon Valley</a>, Ellison has become increasingly active in politics in recent years – and has been on his own Trumpian conversion. Ellison was a prominent Bill Clinton backer but later supported Republican candidates. He grew closer to Trump during the Republican’s first term and allowed his California estate to be used for a fundraiser in 2020.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The fundraiser led to protests from Oracle staff but his support became more controversial when it was reported that Ellison had taken part in a Trump phone call discussing attempts to overturn the 2020 election result.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ellison later backed Tim Scott, a short-lived challenger to Trump for the Republican nomination and, according to reports, sought to have the senator installed as Trump’s running mate.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Although he was unsuccessful, Ellison has remained ingratiated with Trump’s team, a dynamic bolstered by a strong relationship with Musk. Ellison is believed to be Tesla’s second-largest individual shareholder after Musk and sat on the company’s board until 2022.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The same year, he spontaneously <a class=\"link\" data-ylk=\"slk:agreed to back Musk’s takeover of Twitter;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/business/2022/05/05/elon-musk-raises-7bn-twitter-takeover/\" rel=\"nofollow noopener\" target=\"_blank\">agreed to back Musk’s takeover of Twitter</a> (after Musk asked “what dollar size” Ellison might put up, the Oracle founder casually texted back “a billion ... or whatever you recommend” before Musk pushed for $2bn).<!-- HTML_TAG_END --></p> <figure class=\"yf-8xybrv\"><div class=\"image-container yf-g633g8 loader\" style=\"--max-height: 603px;\"> <div class=\"image-wrapper yf-g633g8\" style=\"--aspect-ratio: 960 / 603; --img-max-width: 960px;\"><img alt=\"While Elon Musk attracts a great deal of attention, he&amp;#39;s not the only tech billionaire with a lot to gain from Trump&amp;#39;s presidency\" class=\"yf-g633g8 loader\" height=\"603\" loading=\"lazy\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" width=\"960\"/></div></div> <figcaption class=\"yf-8xybrv\"><!-- HTML_TAG_START -->While Elon Musk attracts a great deal of attention, he’s not the only tech billionaire with a lot to gain from Trump’s presidency - Mike Segar/REUTERS<!-- HTML_TAG_END --> </figcaption> </figure> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ellison’s political alliances have appeared more practical than driven by ideology. He has a close relationship with Sir Tony Blair, and has outlined plans to <a class=\"link\" data-ylk=\"slk:donate hundreds of millions of dollars to the former prime minister’s global institute;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/business/2024/05/01/larry-ellison-oracle-backs-tony-blair-1bn-bet-on-britain/\" rel=\"nofollow noopener\" target=\"_blank\">donate hundreds of millions of dollars to the former prime minister’s global institute</a>, something of a hit to the billionaire’s Maga credentials.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Sceptics have suggested that Sir Tony’s interests in AI and digital health records might align with Oracle’s, although improving medicine has long been an Ellison mission. He has also funded a $1bn Institute of Technology in Oxford to commercialise scientific research.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Closeness to the White House might have other advantages. <a class=\"link\" data-ylk=\"slk:According to the New York Post;elm:context_link;itc:0;sec:content-canvas\" href=\"https://nypost.com/2025/01/22/business/larry-ellisons-backing-of-trumps-500b-ai-project-could-help-save-paramount-merger-sources/\" rel=\"nofollow noopener\" target=\"_blank\">According to the New York Post</a>, the billionaire’s support for Stargate, a $500bn AI project championed by Trump, might help push through an $8bn takeover of Hollywood studio Paramount by Skydance, a company run by Ellison’s son, David.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The bigger prize, however, might be TikTok. Oracle is reportedly in discussions about a bid to take over the video app’s US operations as its Chinese owner ByteDance comes under pressure to sell the company. Oracle already runs the data centre where TikTok’s US data is firewalled and it was in talks to buy the company’s US operations five years ago.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“I’d like Larry to buy it,” Trump said last month.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Musk may attract a great deal of attention but the other tech billionaire in the room may have just as much to gain from the new Trump era.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.telegraph.co.uk/customer/subscribe/01doysa/\" rel=\"nofollow noopener\" target=\"_blank\"><b>Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.</b></a><!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/meet-trump-other-tech-sidekick-090000116.html",
            "pub_date": "2025-02-05 17:00:00",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Stock Futures Fall After Alphabet, AMD Earnings: Markets Wrap (Bloomberg) -- US equity futures dropped along with stocks in Europe as investors navigate the trade war and a busy slate of earnings from some of the world’s biggest companies. Most Read from BloombergState Farm Seeks Emergency California Rate Hike After FiresNew York’s First ‘Passive House’ School Is a Model of Downtown DensityNYC’s Newest Transit Leader Builds a Worker-Driven StrategyTransportation Memos Favor Places With Higher Birth and Marriage RatesWhen French Communists Went on a Brutali ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Bloomberg) -- US equity futures dropped along with stocks in Europe as investors navigate the trade war and a busy slate of earnings from some of the world’s biggest companies.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:State Farm Seeks Emergency California Rate Hike After Fires;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-03/state-farm-seeks-emergency-california-rate-hike-after-la-fires?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">State Farm Seeks Emergency California Rate Hike After Fires</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:New York’s First ‘Passive House’ School Is a Model of Downtown Density;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-02/brooklyn-gets-nyc-s-first-passive-house-certified-school-building?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">New York’s First ‘Passive House’ School Is a Model of Downtown Density</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:NYC’s Newest Transit Leader Builds a Worker-Driven Strategy;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-04/nyc-fare-evasion-drops-as-new-transit-president-takes-helm?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">NYC’s Newest Transit Leader Builds a Worker-Driven Strategy</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Transportation Memos Favor Places With Higher Birth and Marriage Rates;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/department-of-transportation-memos-tie-funding-to-birth-rate-marriage-policy?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Transportation Memos Favor Places With Higher Birth and Marriage Rates</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:When French Communists Went on a Brutalist Building Boom;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-01/new-book-explores-brutalist-architecture-of-france-s-communist-party?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">When French Communists Went on a Brutalist Building Boom</a><!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Futures on the Nasdaq 100 were down 0.7% after Google parent Alphabet Inc. and Advanced Micro Devices Inc. tumbled in after-hours trading. Contracts on the S&amp;P 500 fell 0.4%. The Stoxx Europe 600 was little changed, with declines for technology shares offsetting gains in health care after upbeat guidance from the region’s biggest listed company, Novo Nordisk A/S.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The yen gained against the greenback and gold rose to a record high on haven demand. The 10-year Treasury yield dipped and an index of dollar strength extended losses, after US job openings fell in December by more than forecast to a three-month low.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->While the first volleys in the latest US-China trade war made clear that Xi Jinping is taking a more cautious approach than during Donald Trump’s first term, tariff risks remain at the forefront. Disappointing results from Alphabet and AMD also heightened unease about the outlook for megacap tech companies that have driven the S&amp;P 500’s gains. Amazon.com Inc. is scheduled to report on Thursday.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“It remains tough for anyone to have a particularly high degree of conviction when operating in such an uncertain environment,” said Michael Brown, senior research strategist at Pepperstone Group Ltd. “I still favor adopting a more cautious stance in the short run, as uncertainty remains elevated, and participants chew through this week’s remaining risk events, including earnings from Amazon, and Friday’s US jobs report.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Alphabet posted fourth-quarter revenue that missed analysts’ expectations after growth in its cloud business slowed, raising concern from investors about the billions the company is spending on artificial intelligence. Chip maker AMD gave a disappointing outlook for its data center business, an area where it’s struggling to catch up with AI computing leader Nvidia Corp.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Investors are expecting 9% to 22% per annum growth in earnings for the Mag-7 for the next five years, so the expectations bar is high, and any disappointment in earnings are likely to be met with a sharp selloff,” said Jim Reid, head of European and US credit strategy at at Deutsche Bank AG.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Traders are turning to the US ISM services data later today for more clues on the Federal Reserve’s rate path. Activity in the services sector likely grew more slowly in January amid winter storms across much of the country and wildfires on the West Coast. High-frequency payroll data suggest hiring activity was relatively steady on a seasonally adjusted basis, according to Bloomberg Economics.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Among individual movers in Europe, Spanish lender Banco Santander SA surged after reporting record profit and announcing at €10 billion buyback. Drugmaker GSK Plc. jumped after boosting its sales forecast.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->A gauge of Asian shares rose for a second straight day while equities fell in China, which reopened Wednesday after Lunar New Year holidays.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Amid rising trade tensions, the US Postal Service said it was temporarily suspending inbound international packages from China and Hong Kong. While it’s not clear what prompted the move, it comes after Trump revoked a “de minimis” rule for China, which previously allowed small packages under $800 to enter the US duty-free.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Trade relations between the US and China remain a risk, though if the 10% US tariff and China’s response measures were to be postponed, it will be good for the market,” said Kenny Wen, head of investment strategy at KGI Asia Ltd. “On the other hand, the disputes may escalate again.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Trump told reporters there’s no rush to talk to Xi and he’ll speak to the Chinese president at the appropriate time.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In commodities, oil edged lower as concerns that the trade war would hurt global growth outweighed the announcement of reinforced sanctions on Iran.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Key events this week:<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Eurozone HCOB Services PMI, PPI, Wednesday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->US trade, Wednesday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Fed’s Austan Goolsbee, Tom Barkin, Michelle Bowman, Philip Jefferson speak, Wednesday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Eurozone retail sales, Thursday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->UK rate decision, Thursday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->US initial jobless claims, Thursday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Fed’s Christopher Waller, Lorie Logan speak, Thursday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Amazon earnings, Thursday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->US nonfarm payrolls, unemployment, University of Michigan consumer sentiment, Friday<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Fed’s Michelle Bowman, Adriana Kugler speak, Friday<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Some of the main moves in markets:<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Stocks<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Stoxx Europe 600 was little changed as of 8:28 a.m. London time<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->S&amp;P 500 futures fell 0.4%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Nasdaq 100 futures fell 0.7%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Futures on the Dow Jones Industrial Average fell 0.1%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The MSCI Asia Pacific Index rose 0.7%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The MSCI Emerging Markets Index rose 0.4%<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Currencies<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Bloomberg Dollar Spot Index fell 0.1%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The euro rose 0.2% to $1.0397<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The Japanese yen rose 0.6% to 153.36 per dollar<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The offshore yuan rose 0.2% to 7.2748 per dollar<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The British pound rose 0.1% to $1.2496<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Cryptocurrencies<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Bitcoin rose 1.3% to $97,766.32<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Ether rose 4.5% to $2,760.07<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Bonds<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The yield on 10-year Treasuries declined two basis points to 4.49%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Germany’s 10-year yield declined three basis points to 2.37%<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Britain’s 10-year yield declined four basis points to 4.48%<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Commodities<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Brent crude fell 0.3% to $75.95 a barrel<!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Spot gold rose 0.8% to $2,865.88 an ounce<!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This story was produced with the assistance of Bloomberg Automation.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->--With assistance from Toby Alder, Ruth Carson, John Cheng and Michael Msika.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg Businessweek<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Amazon and SpaceX Want In on India’s Satellite Internet Market;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/musk-ambani-want-to-sell-millions-of-indians-satellite-internet?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Amazon and SpaceX Want In on India’s Satellite Internet Market</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Elon Musk Inside the Treasury Department Payment System;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-02/elon-musk-gets-inside-treasury-department-payment-system?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Elon Musk Inside the Treasury Department Payment System</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Inside Elon Musk’s Attack on the US Government;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/podcast-inside-elon-musk-s-attack-on-the-us-government?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Inside Elon Musk’s Attack on the US Government</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The NFL’s Flawed DEI Program Still Beats What Most Companies Are Doing;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/nfl-s-rooney-rule-is-a-dei-program-that-beats-what-most-companies-are-doing?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The NFL’s Flawed DEI Program Still Beats What Most Companies Are Doing</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The Internet Almost Killed Barnes &amp; Noble, Then Saved It;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-30/barnes-noble-sales-are-growing-again-thanks-to-booktok-buzz?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The Internet Almost Killed Barnes &amp; Noble, Then Saved It</a><!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->©2025 Bloomberg L.P.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/asian-stocks-track-us-higher-224408875.html",
            "pub_date": "2025-02-05 16:31:13",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "USPS has suspended parcels from Hong Kong and China. Here's what it means for Shein and Temu Americans are likely to pay more for products from popular Chinese e-commerce platforms like Shein and Temu as the U.S. Postal Service said it would stop accepting parcels from China and Hong Kong.  The move was announced Tuesday, coming after the U.S. imposed an additional 10% tariff on Chinese goods and ended a customs exception that allowed small value parcels to enter the U.S. without paying tax.  Canada and Mexico managed to negotiate a month-long reprieve from 25% tariffs threatened by U.S. President Donald Trump. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->HONG KONG (AP) — Americans are likely to pay more for products from popular Chinese e-commerce platforms like Shein and Temu as the U.S. Postal Service said it would stop accepting parcels from China and Hong Kong.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The move was announced Tuesday, coming after the U.S. imposed an additional 10% tariff on Chinese goods and <a class=\"link\" data-ylk=\"slk:ended a customs exception;elm:context_link;itc:0;sec:content-canvas\" href=\"https://apnews.com/article/china-tariffs-trump-shein-temu-023aaee8f043605e62a614eaa5134f62\" rel=\"nofollow noopener\" target=\"_blank\">ended a customs exception</a> that allowed small value parcels to enter the U.S. without paying tax. Canada and Mexico managed to negotiate a month-long reprieve from 25% tariffs threatened by U.S. President Donald Trump.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It will likely impact online shopping destinations like Shein and Temu, popular with younger shoppers in the U.S. for cheap clothing and other products, usually shipped directly from China.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Cheap, direct postal service helps these companies keep costs low, as did the “de minimis” exemption that previously allowed shipments to go tax-free if their value is under $800.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The temporary suspension by USPS is likely to delay shipments and could mean higher prices in the long term.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->What exactly did the USPS announce?<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The U.S. Postal Service said in a notice that it would temporarily stop accepting inbound parcels from the China and Hong Kong Posts until further notice.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Letters and flats — mail that measures up to 15 inches (38 centimeters) long or 3/4 inches (1.9 centimeters) thick — are not affected.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Why did it happen?<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The USPS did not state a reason in a brief announcement, but the suspension came after Trump closed the “de minimis” customs exemption this week that allowed shoppers and importers to avoid duties on packages worth below $800.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The exemption was removed as part of an executive order to levy a 10% tariff on Chinese goods.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->U.S. Customs and Border Protection previously stated that it processes an average of over four million “de minimis” imports each week.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->What is the impact and who is most affected?<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Consumers and companies alike will no longer be able to send parcels to the U.S. from Hong Kong or China.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->This move is likely to impact Chinese e-commerce firms like Shein and Temu, although Shein is likely to be more affected, according to Jacob Cooke, CEO of e-commerce marketing agency WPIC Marketing + Technologies.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Both companies have significant market share in the U.S.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Compared to Temu, Shein relies more heavily on USPS for direct-to-consumer shipping from China, and without this channel, it will have to rely more on private carriers,” said Cooke.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“That will increase logistics costs, which along with the recent scrapping of the de minimis exemption for most products from China, could erode its price advantage.”<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Cooke said Temu operates on a semi-consignment model and often ships bulk orders to the U.S. before fulfilling orders domestically.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Temu’s model of sourcing low-cost goods should also enable the platform to absorb higher logistics costs and remain price competitive,” he said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Shein and Temu did not immediately comment.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Chinese Foreign Ministry spokesperson Lin Jian said China would take “necessary measures” to protect its companies, and urged the U.S. to “stop politicizing economic and trade issues and using them as a tool, and to stop unreasonably suppressing Chinese companies.”<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->What are possible ways for companies to work around the issue?<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->It is unclear how long the USPS suspension will last, but the effort to crack down on the de minimis excemption seems like a longer-term shift in policy, Cooke said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Shein and Temu will simply need to rely more on private carriers as a workaround to the USPS suspension,” he said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->In the long term, Shein could accelerate its warehouse expansion in the U.S., while Temu can double down on its semi-consignment model. By shipping in bulk to the U.S. and fulfilling orders domestically, logistics cost can be reduced, Cooke said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Shipping in bulk to the U.S. and fulfilling domestically can reduce logistics costs, but for Shein, this poses a longer-term disruption to their business model which has depended on rapidly developing new SKUs and shipping them directly to consumers,” Cooke said.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/usps-suspended-parcels-hong-kong-082952826.html",
            "pub_date": "2025-02-05 16:29:52",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK-focused funds hit hard as investors pull cash from stocks, Calastone says British investors yanked a net 640 million pounds ($799 million) from equity funds in January, ending a long run of inflows, as UK-focused funds suffered their sixth-biggest monthly net withdrawals on record, funds network Calastone said on Wednesday. After a wave of bullish sentiment in late 2024 when investors poured money into equity, bond and mixed asset funds, Calastone said UK investors started 2025 \"in a more pessimistic mood.\" UK-focused funds lost 1.07 billion pounds of cash, despite British shares hitting record highs, Calastone said. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->LONDON (Reuters) - British investors yanked a net 640 million pounds ($799 million) from equity funds in January, ending a long run of inflows, as UK-focused funds suffered their sixth-biggest monthly net withdrawals on record, funds network Calastone said on Wednesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->After a wave of bullish sentiment in late 2024 when investors poured money into equity, bond and mixed asset funds, Calastone said UK investors started 2025 \"in a more pessimistic mood.\"<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->UK-focused funds lost 1.07 billion pounds of cash, despite British shares hitting record highs, Calastone said. European and Asian funds also suffered net outflows, with North American stocks enjoying 576 million pounds of net new money, the data showed.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"The UK stock market reached all-time highs in January, but investors merely took this as an opportunity to get out while the going was good,\" Edward Glyn, head of global markets at Calastone, said in a statement.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“Apparently nothing can dent the enthusiasm for U.S. stocks, however. Even the DeepSeek AI shock that happened late in the month spurred appetite rather than fear,\" Glyn added, noting that a day after the DeepSeek-induced selloff, North American equity funds notched their best day of the month for net inflows.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Fixed income funds saw a sharp drop in inflows as government bond yields jumped before calm returned to the market later in January, Calastone said.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->($1 = 0.8015 pounds)<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Tommy Reggiori Wilkes; Editing by Rod Nickel)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/uk-focused-funds-hit-hard-080624883.html",
            "pub_date": "2025-02-05 16:06:24",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese firms control around 75% of Indonesian nickel capacity, report finds Chinese firms control about 75% of Indonesia's nickel refining capacity, raising concern over supply chain control and environmental risks, Washington-based global security nonprofit C4ADS has said in a report.  According to the report, Indonesia's 8 million metric ton refining capacity was distributed across 33 companies, but ownership tracing showed shareholder overlap, and ultimately Chinese companies controlled about three-quarters of smelting capacity as of 2023.  \"As Indonesia aims to use the nickel industry for economic growth, this substantial foreign influence could limit its ability to control and shape the industry for its benefit,\" said the report, released on Tuesday. ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->JAKARTA (Reuters) - Chinese firms control about 75% of Indonesia's nickel refining capacity, raising concern over supply chain control and environmental risks, Washington-based global security nonprofit C4ADS has said in a report.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->According to the report, Indonesia's 8 million metric ton refining capacity was distributed across 33 companies, but ownership tracing showed shareholder overlap, and ultimately Chinese companies controlled about three-quarters of smelting capacity as of 2023.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->\"As Indonesia aims to use the nickel industry for economic growth, this substantial foreign influence could limit its ability to control and shape the industry for its benefit,\" said the report, released on Tuesday.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The reliance on Chinese-controlled nickel production also places U.S. and European automakers at a competitive disadvantage in the global EV market amid increasingly restrictive policies against trade with China, the report said. Nickel is a key battery component.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Indonesia's mining ministry did not immediately comment.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->An Indonesian official said last year that Chinese companies were approaching Indonesian and South Korean firms for potential partnerships to reduce their stakes in smelters and make their product more accessible to the U.S. market.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->President Prabowo Subianto formed a task force to develop the downstream mineral industry with domestic financing to \"gradually reduce perception that foreigners got the most benefits,\" Mining Minister Bahlil Lahadalia said last month.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The C4ADS report found that two Chinese companies, Tsingshan Holding Group and Jiangsu Delong Nickel Industry Co Ltd, accounted for more than 70% of Indonesia's refining capacity as of 2023.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The two were among the earliest investors when Indonesia started a push for domestic processing of nickel ore - a move that has made it the world's dominant producer.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Last year, a court in Central Sulawesi sentenced two workers at Indonesia Tsingshan Stainless Steel to seven months jail for negligence that led to a fire and deaths at a Tsingshan facility in December 2023. In early 2023, two workers were killed in clashes at the PT Gunbuster Nickel Industry smelter in North Morowali owned by Jiangsu Delong Nickel Industry.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Tsingshan's unit Eternal Tsingshan and Jiangsu Delong's joint-venture Obsidian Stainless Steel did not immediately respond to requests for comment. Jiangsu Delong could not immediately be reached for comment.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Tsingshan has been selling stakes in some of its smelters, including an October deal with Indonesian state miner Aneka Tambang for 30% of PT Jiu Long Metal Industry.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Reporting by Fransiska Nangoy; Additional reporting by Beijing newsroom; Editing by Tony Munroe and Gerry Doyle)<!-- HTML_TAG_END --></p>  </div>",
            "link": "https://finance.yahoo.com/news/chinese-firms-control-around-75-080101802.html",
            "pub_date": "2025-02-05 16:01:01",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Korea’s Top Listing in Years Flops in Debut as IPO Fever Cools (Bloomberg) -- South Korea’s biggest new listing in more than two years got off to weak start as LG CNS Co. fell on its Seoul trading debut after a 1.2 trillion won ($821 million) initial public offering.Most Read from BloombergState Farm Seeks Emergency California Rate Hike After FiresNew York’s First ‘Passive House’ School Is a Model of Downtown DensityNYC’s Newest Transit Leader Builds a Worker-Driven StrategyTransportation Memos Favor Places With Higher Birth and Marriage RatesWhen French Co ",
            "description": "<div class=\"body yf-tsvcyu\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Bloomberg) -- South Korea’s biggest new listing in more than two years got off to weak start as LG CNS Co. fell on its Seoul trading debut after a 1.2 trillion won ($821 million) initial public offering.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:State Farm Seeks Emergency California Rate Hike After Fires;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-03/state-farm-seeks-emergency-california-rate-hike-after-la-fires?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">State Farm Seeks Emergency California Rate Hike After Fires</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:New York’s First ‘Passive House’ School Is a Model of Downtown Density;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-02/brooklyn-gets-nyc-s-first-passive-house-certified-school-building?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">New York’s First ‘Passive House’ School Is a Model of Downtown Density</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:NYC’s Newest Transit Leader Builds a Worker-Driven Strategy;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-04/nyc-fare-evasion-drops-as-new-transit-president-takes-helm?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">NYC’s Newest Transit Leader Builds a Worker-Driven Strategy</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Transportation Memos Favor Places With Higher Birth and Marriage Rates;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/department-of-transportation-memos-tie-funding-to-birth-rate-marriage-policy?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Transportation Memos Favor Places With Higher Birth and Marriage Rates</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:When French Communists Went on a Brutalist Building Boom;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/features/2025-02-01/new-book-explores-brutalist-architecture-of-france-s-communist-party?utm_campaign=bn&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">When French Communists Went on a Brutalist Building Boom</a><!-- HTML_TAG_END --></p> </li> </ul>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Shares of the diversified technology-services unit of LG Group sank as much as 11.3% on the main Kospi market on Wednesday before ending down 9.9% at 55,800 won. That’s a contrast to the IPO, when the stock was priced at 61,900 won each, the top of the marketed range, after it was snapped up by local investors. The broader Kospi index rose 1.1%.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The debut indicates investors are becoming increasingly skeptical about IPOs being a surefire way to make money in Seoul. Though first-day pops have been common for Korean listings, the overwhelming majority of them have soured in the past three months and are now below their IPO prices, according to data compiled by Bloomberg.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->“IPO stocks have been bad lately,” said Kim Dojoon, chief executive and investment officer at Seoul-based Zian Investment Management. “We probably need some traffic control as the IPO market has gotten a little overheated.”<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Out of the 35 companies that went public in Korea in the past three months, only about a quarter of them are trading above their IPO price, according to data compiled by Bloomberg.<!-- HTML_TAG_END --></p>  <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->SK Innovation’s lubricant’s unit SK Enmove aims to list in June or July, Maeil Business Newspaper reported Wednesday. To encourage long-term investment, South Korean authorities announced plans to reform the IPO market last month.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Read: Korea Targets Investors Who Spoil Trading Debuts: ECM Watch<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Some investors expected that the LG unit, which competes with the likes of Samsung SDS Co., could be supported by a recovery in Korean stocks. The market slumped in December amid political turmoil but rebounded in January as stability returned. The recovery helped LG and a private equity fund of Macquarie Group Ltd., which bought a 35% stake in LG CNS in 2020, to price the shares at the top of the offered range during the IPO.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->The demand during the IPO, Korea’s largest since that of affiliate LG Energy Solution Ltd. in 2022, may have been driven by the hope that the company could be a beneficiary of the artificial intelligence boom. Though many of LG CNS’s operations are established businesses such as helping set up back-end software services for companies, its executives have pledged to develop futuristic robotics technology and generative AI, launching a new team to lead the firm’s AI and cloud businesses to serve enterprise clients.<!-- HTML_TAG_END --></p> <div class=\"readmore yf-103i3cu\"><button aria-label=\"Story Continues\" class=\"secondary-btn fin-size-large readmore-button rounded yf-15mk0m\" data-ylk=\"elm:readmore;itc:1;sec:content-canvas;slk:Story%20Continues\" title=\"Story Continues\"> <span>Story Continues</span> </button> </div> <div class=\"read-more-wrapper\" data-testid=\"read-more\" style=\"display: none\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->But to Park Jinho, head of equity investment at NH-Amundi Asset Management Co., LG CNS did not look particularly cheap, given that shares of rival Samsung SDS Co. slumped 25% last year. He also blamed a lack of liquidity in the Korean market for LG CNS’s lackluster debut.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->--With assistance from Dave Sebastian.<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->(Updates with closing level in paragraph 2, adds potential listing of SK Enmove in 6)<!-- HTML_TAG_END --></p> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->Most Read from Bloomberg Businessweek<!-- HTML_TAG_END --></p> <ul class=\"yf-1woyvo2\"><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Amazon and SpaceX Want In on India’s Satellite Internet Market;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/musk-ambani-want-to-sell-millions-of-indians-satellite-internet?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Amazon and SpaceX Want In on India’s Satellite Internet Market</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Elon Musk Inside the Treasury Department Payment System;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-02/elon-musk-gets-inside-treasury-department-payment-system?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Elon Musk Inside the Treasury Department Payment System</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:Inside Elon Musk’s Attack on the US Government;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/podcast-inside-elon-musk-s-attack-on-the-us-government?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">Inside Elon Musk’s Attack on the US Government</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The NFL’s Flawed DEI Program Still Beats What Most Companies Are Doing;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-02-04/nfl-s-rooney-rule-is-a-dei-program-that-beats-what-most-companies-are-doing?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The NFL’s Flawed DEI Program Still Beats What Most Companies Are Doing</a><!-- HTML_TAG_END --></p> </li><li class=\"yf-1woyvo2\"> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START --><a class=\"link\" data-ylk=\"slk:The Internet Almost Killed Barnes &amp; Noble, Then Saved It;elm:context_link;itc:0;sec:content-canvas\" href=\"https://www.bloomberg.com/news/articles/2025-01-30/barnes-noble-sales-are-growing-again-thanks-to-booktok-buzz?utm_campaign=bw&amp;utm_medium=distro&amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\">The Internet Almost Killed Barnes &amp; Noble, Then Saved It</a><!-- HTML_TAG_END --></p> </li> </ul> <p class=\"yf-1pe5jgt\"><!-- HTML_TAG_START -->©2025 Bloomberg L.P.<!-- HTML_TAG_END --></p></div>  </div>",
            "link": "https://finance.yahoo.com/news/korea-top-listing-years-flops-043527662.html",
            "pub_date": "2025-02-05 15:30:27",
            "source": "yahoo_finance_us",
            "kind": 1,
            "language": "en"
        }
    ]
}