{
    "data": [
        {
            "title": "China’s BYD Overtakes Tesla to Become World’s Top Pure EV Seller in 2025",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/01/108139798438597.jpg\" id=\"news-body\"><p>(Yicai) Jan. 5 -- Chinese new energy vehicle giant BYD outpaced its US rival Tesla in global all-electric vehicle sales for the first time last year to become the world’s biggest vendor of pure EVs. In terms of overall NEV shipments, which includes plug-in hybrids, BYD has now ranked first for four straight years.</p><p>BYD’s sales of pure electric cars soared 28 percent last year from the year before to 2.3 million vehicles, the Shenzhen-based automaker said on Jan. 2.</p><p>By contrast, Tesla’s shipments, which were reported on the same day, tumbled 8.6 percent to 1.6 million vehicles in the Austin-based firm’s second consecutive year of declines. The drop has also widened substantially from the 1.1 percent slide logged the previous year.</p><p>BYD’s plug-in hybrid sales slumped 8 percent to 2.3 million units, bringing its overall NEV deliveries in 2025 to 4.6 million units, a year-on-year jump of 8 percent, it added.</p><p>BYD, which started out in 1995 as a manufacturer of lithium batteries, has grown into one of China’s leading makers of electric cars and power batteries. The company stopped producing gasoline-powered autos altogether in 2022 and that same year, its NEV sales surpassed Tesla’s for the first time, earning the top spot globally. In 2024, BYD overtook SAIC Motor to become China’s biggest automaker by sales.</p><p>Rapid expansion overseas has been a key driver of BYD’s growth. In 2025, its sales of passenger cars and pickups abroad surged 145 percent from the year before to one million units, according to company data. The firm’s global footprint has expanded to 110 countries and regions.</p><p>In response to growing uncertainty in international trade, BYD is accelerating the localization of production abroad. Since 2024, the company has built plants in Thailand, Uzbekistan and Brazil. Its first European factory, located in Hungary, is set to be completed and to start production later this year.</p><p>Editor: Kim Taylor</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinas-byd-overtakes-tesla-to-become-worlds-top-pure-ev-seller-in-2025",
            "pub_date": "2026-02-27 15:55:58",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Leapmotor Leads as 11 Chinese Automakers Set 2026 Sales Growth Targets",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/01/109382497658565.jpg\" id=\"news-body\"><p>(Yicai) Jan. 19 -- Eleven Chinese automakers have announced their sales targets for 2026 since the start of the year, with electric vehicle startup Leapmotor Technology setting the most aggressive growth goal of 68 percent, even as analysts forecast more modest marketwide growth.</p><p>The Hangzhou-based carmaker aims to sell one million vehicles this year, according to an announcement by its founder and Chairman Zhu Jiangming. Leapmotor posted year-on-year sales growth of 103 percent last year, delivering 596,555 vehicles and surpassing its annual target of 500,000 units.</p><figure class=\"image\"><img src=\"https://imgcn.yicaiglobal.com/src/image/2026/01/109395318521541.png\"/></figure><p>Among other electric vehicle startups, Xpeng is targeting sales of 550,000 to 600,000 units this year, implying growth of 28 percent to 40 percent from last year’s around 429,450 vehicles. Nio has set a sales growth target of 40 percent to 50 percent, after delivering almost 326,030 vehicles last year.</p><p>In its third year in the auto industry, tech giant Xiaomi aims to sell 550,000 vehicles this year. Xiaomi Auto recorded a three-fold jump in sales last year to nearly 411,840 units, entering the top 10 new energy vehicle manufacturers in China by sales volume for the first time.</p><p>Seres Group, which has partnered with Huawei Technologies to develop the premium electric vehicle brand Aito, is targeting sales of 500,000 units this year, representing growth of about 6 percent from last year.</p><p><strong>Ambitious Traditional Carmakers</strong></p><p>Among traditional automakers, Great Wall Motor has set the most ambitious target, aiming to boost sales by 36 percent to 1.8 million units.</p><p>Moreover, Changan Automobile and BAIC Group, which received the first batch of L3-level autonomous driving road permits from Chinese authorities at the end of last year, are targeting sales growth of 13 percent and 26 percent, respectively, to reach 3.3 million units and 2.2 million units.</p><p>Dongfeng Motor Group aims to increase sales by 31 percent to 3.3 million units this year, while Chery Automobile is targeting 14 percent growth to 3.2 million units. Geely Auto plans to lift sales by 8 percent to 3.5 million units, and FAW Group has set a growth target of 7 percent, also aiming for 3.5 million units.</p><p><strong>Cautious Analyst Outlook</strong></p><p>Despite automakers’ expansion ambitions, industry associations and research institutions have issued more cautious forecasts. China has ended a 12-year NEV purchase tax exemption and replaced it with a 5 percent tax rate, while subsidies for vehicle trade-ins have also been reduced from last year.</p><p>The China Association of Automobile Manufacturers expects total vehicle sales in China to rise 1 percent this year to 34.8 million units. Although this would mark the sixth consecutive year of growth since 2021, the increase would be the slowest in nearly six years.</p><p>Gong Min, head of China auto industry research at UBS Securities, said the Chinese auto market is likely to see low single-digit declines in wholesale sales and mid single-digit declines in retail sales. New energy vehicle sales, however, are expected to grow by 8 percent against the broader market trend.</p><p>Editors: Dou Shicong, Emmi Laine</p></div>",
            "link": "https://www.yicaiglobal.com/news/leapmotor-leads-as-11-chinese-automakers-set-2026-sales-growth-targets",
            "pub_date": "2026-02-27 15:55:58",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Spring Festival Gala Highlights China's Tech Ambitions via Robotics Showcase",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112019028348613.jpg\" id=\"news-body\"><p>(Yicai) Feb.18 -- The Year of the Horse's Spring Festival Gala, the world's most-watched television event, has delivered a powerful statement: China's technological spotlight has decisively shifted to robotics.</p><p>The 2026 gala's Feb.16 night live broadcast augmented its traditional repertoire of song, dance and comedy skits with a high-stakes national showcase for cutting-edge humanoid robots, a vivid symbol of the country's rapid momentum toward a tech-driven future.</p><p>Leading the charge was Unitree Robotics, located in Hangzhou in east China, a returning performer that commanded attention last night. Moving beyond the somewhat stiff dance routines of 2025, its new robots took center stage in a martial arts spectacle, wielding swords and nunchucks alongside human masters from a renowned kung-fu school.</p><p>These robots executed complex maneuvers like drunken boxing, backward obstacle avoidance and backflips, underscoring a leap from demonstrating basic mobility to mastering intricate, culturally rich physical artistry.</p><p>The 2026 gala stunts, supported by AI algorithms and 3D LiDAR, included multiple world firsts: a continuous parkour-style table vaulting sequence, catapulted aerial flips reaching a maximum height exceeding 3 meters, single-leg consecutive aerial flips followed by a two-step wall-run into a backflip, airflare rotation at 7.5 revolutions, and clustered rapid repositioning achieving arbitrary movement speeds of up to 4 meters per second, according to Unitree Robotics.</p><p>\"Unitree should get a robot Olympics going. It would be entertaining, and draw a lot of good attention to how capable humanoid robots are getting,\" Owen Lewis, a science enthusiast, commented on social media platform X in response to the show.</p><p>Another Chinese robotics startup MagicLab, seizing the coveted opening act, set the tone with its human-like machines performing a groundbreaking \"Thomas 360 degree.\" Later, six units synchronized seamlessly with pop stars for a musical number.</p><p>While others showcased physical prowess, Beijing-based Galbot demonstrated its aptitude for performing everyday tasks, from delicately cracking walnuts, picking up glass shards and retrieving items from shelves to folding clothes and skewering sausages for grilling.</p><p>The Galbot robot handled each task with dexterous, natural human-like movements. This capacity for autonomous decision-making and hand-eye coordination signaled that Chinese-designed robotics is moving beyond mere showmanship, instead pointing and shifting toward vast practical applications.</p><p>The most poignant moment of the gala was delivered by Noetix Robotics. Its robots starred in a comedy skit, a throwback to one 30 years ago, when an actress played a whimsical, clumsy robot. This time, she performed alongside authentic humanoids, including a stunningly accurate bionic replica of herself, created in just 30 days.</p><p>The show's classic comedy-of-errors narrative probed a deeper question amid the AI technology wave: human-robot relations. It ultimately affirmed the irreplaceable value of human warmth and connection, suggesting that advanced robotics, rather than replacing humanity, should enhance and reflect our own qualities.</p><p>Noetix's robot, notably, finished second in last year's robot half-marathon in China's capital, following Tien Kung from Beijing.</p><p>This robotics invasion of the gala marks a pivotal cultural and commercial moment. For decades, the event's advertising chronicled China's economic shifts, from bicycles and liquor to home appliances and internet services.</p><p>Now, robots and AI have made inroads into this prime symbolic space, representing the new engine of \"new quality productive forces.\" The performances translated technical jargon like \"embodied AI\" into a visceral, national experience.</p><p>More Chinese robotics firms also took to regional gala stages this year, including the likes of AgiBot, UniX AI and EngineAI, making technology an inescapable part of Chinese New Year celebrations nationwide.</p><p>Last week, AgiBot also staged a global live gala, showcasing a diverse lineup ranging from synchronized dances and comedic skits to magic acts and traditional martial arts.</p><p>A recent industry report revealed that Chinese robotics firms had emerged as the largest producers of humanoid robots worldwide in 2025. AgiBot achieved an annual shipment volume of over 5,100 units, securing a 39-percent share of the global humanoid robot market, followed by two more Chinese tech firms, namely Unitree and UBTECH.</p><p>The year 2026 marks a critical turning point for the robotics industry, with it moving from simply \"handling many tasks with limited proficiency\" to truly \"accomplishing tasks with high performance and achieving practical application,\" said Luo Jianlan, chief scientist at AgiBot.</p><p>China has a clear national strategy in its quest to become a global robotics powerhouse, and the country has drawn attention and admiration from abroad thanks to its robust industrial ecosystems, fast iteration cycles and large-scale deployment capacity, said Dominic Gorecky, co-founder and director of Swiss Smart Factory.</p></div>",
            "link": "https://www.yicaiglobal.com/news/spring-festival-gala-highlights-chinas-tech-ambitions-via-robotics-showcase",
            "pub_date": "2026-02-27 15:55:58",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese Scientists Develop New AI Model to Interpret Varying Stellar Data",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112810714473157.jpg\" id=\"news-body\"><p>(Yicai) Feb. 27 -- A Chinese research team has developed an artificial intelligence model that can interpret stellar spectral data from different telescopes, highlighting the great potential of the technology in astronomical research.</p><p>Scientists from the Chinese Academy of Sciences' National Astronomical Observatories, the University of Chinese Academy of Sciences, and other institutions introduced concepts similar to large language models into astronomy and applied a contrastive learning method to make the SpecCLIP model, which is capable of learning and establishing intrinsic connections autonomously between spectral data from different sources, according to a study published in The Astrophysical Journal on Feb. 11.</p><p>Stellar spectra contain unique information about stars, including their temperature, chemical composition, and surface gravity. By analyzing these, astronomers can trace the evolutionary history of the Milky Way from its beginning.</p><p>The model can predict stellar atmospheric parameters and elemental abundances, perform spectral-similarity searches, and even help identify peculiar celestial objects, the researchers said, noting that it has already been applied in multiple cutting-edge exploration missions, such as searching for planets similar to Earth.</p><p>Researchers face a significant challenge due to different survey projects, such as China's Large Sky Area Multi-Object Fiber Spectroscopic Telescope and Europe's Global Astrometric Interferometer for Astrophysics, also known as the Gaia satellite, acquiring spectral data via varying methods, resolutions, and wavelength ranges. The datasets are like stories told in different dialects, making them difficult to combine for large-scale analysis.</p><p>The SpecCLIP model acts as a translator that can convert LAMOST's low-resolution spectra and Gaia's high-precision spectra into a universal language, allowing scientists to perform joint analyses with ease, enabling data alignment and transformation across different instruments and survey projects.</p><p>Editor: Martin Kadiev</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinese-scientists-develop-new-ai-model-to-interpret-varying-stellar-data",
            "pub_date": "2026-02-27 15:55:57",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shein Cuts 932 Metric Tons of Waste as China Operations Gain Global Standards",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112749004427973.jpg\" id=\"news-body\"><p>(Yicai) Feb. 26 -- E-commerce giant Shein has strengthened environmental and workplace management across its directly operated facilities in China, advancing its EvoluShein sustainability roadmap through expanded certifications and waste reduction initiatives.</p><p>The efforts form part of the cross-border e-commerce platform's wider push to enhance governance processes and operational capabilities at its supervised facilities, building on investments in its logistics and innovation network. These include warehouse modernization, fulfillment process optimization, and the development of the Shein Center of Innovation for Garment Manufacturing (CIGM) to improve production efficiency and consistency, according to the Singapore-headquartered firm's recent press release.</p><p>A central measure has been the adoption of management systems aligned with the standards set by the International Organization for Standardization (ISO). In 2025, six Shein-operated logistics parks in China obtained ISO 14001 (involving environmental management systems) and ISO 45001 (occupational health and safety management systems) certifications following audits by Swiss testing company SGS. The certifications confirm that the facilities have established internationally recognized systems supporting regular risk assessments, operational reviews, emergency preparedness, and employee training, with ongoing audits to ensure continuous improvement.</p><p>Shein has also expanded waste and resource management programs. In 2025, eight additional Shein-managed facilities received Zero Waste to Landfill Management System certification from TÜV Rheinland, bringing the total to 15 -- including the CIGM -- while seven previously certified facilities renewed their credentials. The certification assesses waste management procedures and outcomes. Following the latest approvals, all self-operated warehouses in China and nearly half of the company’s managed facilities in the country meet the standard. Shein is also exploring source reduction measures in warehouse operations, including packaging optimization.</p><p>At its fulfillment centers, the company has implemented measures to reduce single-use consumables, such as introducing reusable burlap bags, narrowing adhesive tape width, modifying carton thickness, adopting reusable straps and pallets, and reducing packaging bags per order. These steps have reduced or avoided about 932 metric tons of waste while maintaining operational safety and product protection.</p><p>In addition, Shein is advancing its Water, Sanitation, and Hygiene (WASH) commitments under its water stewardship framework. In 2024, the company released a water stewardship policy to guide water management across its facilities and value chain partners. In 2025, WASH assessments using the United Nations-supported WASH4Work framework were completed at 28 self-operated warehouses and the CIGM, expanding coverage to 29 global sites. The results confirmed that all Shein-operated facilities meet WASH4Work standards.</p><p>Editor: Emmi Laine</p></div>",
            "link": "https://www.yicaiglobal.com/news/shein-cuts-932-metric-tons-of-waste-as-china-operations-gain-global-standards",
            "pub_date": "2026-02-27 15:55:57",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's Biggest Garment, Light Industrial Products Trade Fair to Include More Booths, Overseas Exhibitors This Year",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112819325630149.jpg\" id=\"news-body\"><p>(Yicai) Feb. 27 -- The East China Fair, the largest import and export trade fair for textiles, apparel, and light industrial products in the country that will open in Shanghai on March 1, will see the number of booths, exhibitors, and overseas exhibitors all exceed last year's levels.</p><p>The four-day East China Fair, also seen as a barometer of the country's foreign trade situation, will include 5,291 booths and 3,325 domestic and foreign firms, with 375 overseas exhibitors from 14 countries and regions, You Yongsheng, director of the Shanghai Municipal Commission of Commerce's foreign trade development department, said at a press conference yesterday. It will likely attract more than 46,000 domestic and foreign professional buyers, You added.</p><p>The fair will have clothing and accessories, textile fabrics, household goods, and decorative gifts professional sub-exhibition areas, as well as cross-border e-commerce and overseas exhibition professional exhibition areas, You pointed out, adding that it will cover an area of 115,000 square meters.</p><p>To boost the rate of closed deals, the East China Fair will continue last year's practice and set up a dedicated procurement matching zone and hold special matchmaking sessions for clothing and accessories, textile fabrics, household goods, and decorative gifts targeting Europe, the Americas, Japan, South Korea, and Southeast Asia, You noted. The initiative provides a platform to connect domestic buyers and international companies, facilitating the import of high-quality products and achieving the goal of \"exporting domestic and importing foreign goods,\" You said.</p><p>Editors: Tang Shihua, Martin Kadiev</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinas-biggest-garment-light-industrial-products-trade-fair-to-include-more-booths-overseas-exhibitors-this-year",
            "pub_date": "2026-02-27 15:55:56",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aito Dethrones Leapmotor as China's Best-Selling NEV Startup in January",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/110611641556677.jpg\" id=\"news-body\"><p>(Yicai) Feb. 2 -- Aito, the electric vehicle brand co-developed by Chinese carmaker Seres Group and tech giant Huawei Technologies, has surpassed Leapmotor Technology to become the best-selling new energy vehicle startup in China last month.</p><p>Aito's deliveries surged 83 percent to 40,016 units in January from a year earlier, Seres announced yesterday. Leapmotor, which sold the most EVs among NEV startups in China last year, slipped to third position, with deliveries up 27 percent to 32,059 units in the period.</p><p>In fact, Xiaomi Auto also overtook Leapmotor last month, having delivered over 39,000 electric vehicles.</p><p>Shanghai-based Nio saw its deliveries nearly double to 27,182 units in January from a year earlier, driven by strong sales of its new ES8, which was released in the second half of last year.</p><p>Meanwhile, both Li Auto and Xpeng Motors experienced declines in deliveries in the period, with the former down 8 percent to 27,668 units, and the latter down 34 percent to 20,011 units.</p><p>On a monthly basis, sales of NEV startups generally declined in January. Leapmotor and Xpeng reported drops of 47 percent, and Nio experienced a 44 percent fall. Sales of Li Auto plunged 37 percent, and those of Aito and Xiaomi Auto shrank 31 percent and 22 percent, respectively.</p><p>Due to the tendency of Chinese carmakers to engage in aggressive promotional activities at the end of the year to boost sales and achieve their annual delivery targets, the market typically experiences a cooling adjustment in January.</p><p>Moreover, China has abolished the 12-year policy of exempting NEVs from purchase taxes from Jan. 1, replacing it with a 5 percent tax based on the vehicle's selling price, which has led to an increase in consumers' purchasing costs this month.</p><p>China's retail sales of passenger cars totaled 679,000 units between Jan. 1 and 18, down 28 percent from a year earlier and 37 percent from a month earlier, according to data from the China Passenger Car Association. Among them, NEV sales reached 312,000 units, down 16 percent and 52 percent, respectively, in the period.</p><p>Editors: Dou Shicong, Futura Costaglione</p></div>",
            "link": "https://www.yicaiglobal.com/news/aito-dethrones-leapmotor-as-chinas-best-selling-nev-startup-in-january",
            "pub_date": "2026-02-27 15:46:46",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nio Forecasts First-Ever Operating Profit, Boosting US and Hong Kong Shares",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/110972439967429.jpg\" id=\"news-body\"><p>(Yicai) Feb. 6 -- Chinese electric vehicle startup Nio said it expects to achieve its first-ever operating profit in the fourth quarter of last year, lifting its share prices in both the US and Hong Kong markets.</p><p>Nio [HKG: 9866] closed 7 percent elevated at HKD39.10 (USD5) in Hong Kong today, while its US-listed shares [NASDAQ: NIO] ended the day 5.9 percent higher at USD4.70 yesterday.</p><p>According to a preliminary assessment, Nio expects to record an adjusted operating profit of USD100 million to USD172 million in the fourth quarter, excluding stock-based compensation expenses, the Shanghai-based EV maker announced yesterday. This compares with an adjusted operating loss of CNY5.5 billion (USD792.5 million) in the same period a year earlier.</p><p>Under generally accepted accounting principles, the company is expected to have recorded an operating profit of about USD29 million to USD100 million for the quarter, it added.</p><p>Founded in 2014, Nio has long been criticized for persistent losses. The company’s net loss widened 8 percent year on year to CNY22.4 billion (USD3.2 billion) in 2024. In the first three quarters of last year, net losses reached CNY15.7 billion, up 1 percent from a year earlier.</p><p>Against this backdrop, founder and Chief Executive Officer Li Bin said at an internal meeting in October last year that Nio must achieve profitability by the fourth quarter of 2025, warning that failure to do so would pose serious challenges to the company’s long-term development.</p><p>The expected profit in the quarter ended in December 2025 was mainly driven by sustained growth in fourth-quarter sales volume, improved vehicle margins from a favorable product mix, and the company’s ongoing cost-cutting measures and efficiency improvements, according to the announcement.</p><p>Nio launched the third-generation ES8, a large all-electric sport utility vehicle, in September last year and delivered 40,000 units within 100 days. Supported by the strong performance of this model, fourth-quarter deliveries jumped 72 percent year on year to almost 124,810 vehicles, setting a new quarterly record.</p><p>In January this year, Nio delivered more than 27,180 vehicles, up 96 percent from a year earlier but down 44 percent from December, according to the latest data.</p><p>Editors: Dou Shicong, Emmi Laine</p></div>",
            "link": "https://www.yicaiglobal.com/news/nio-forecasts-first-ever-operating-profit-boosting-us-and-hong-kong-shares",
            "pub_date": "2026-02-27 15:46:45",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese Researchers Create Advanced Transistor With Ultralow Power Consumption",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/111940026163909.jpg\" id=\"news-body\"><p>(Yicai) Feb. 17 -- A team of Chinese researchers has developed the world's smallest ferroelectric transistor with ultralow power consumption, offering new insights into progress in the semiconductor industry, according to a study published recently in the journal Science Advances.</p><p>In advanced semiconductor manufacturing processes, the operating voltage of logic chips has been reduced to 0.7 volts to achieve high energy efficiency. However, mainstream non-volatile memory, such as NAND flash, previously required 5 volts or higher to complete write operations.</p><p>This mismatch lead to the integration of complex circuits for voltage step-up or step-down to enable collaboration between logic and memory units. Such integration resulted in additional power consumption, wasted space, and data transfer bottlenecks between logic and memory.</p><p>In typical AI chips, 60 to 90 percent of total power consumption is used for data transfer rather than computation. This has become one of the core constraints limiting improvements in AI computing power and energy efficiency.</p><p>The team from Peking University led by Qiu Chenguang, a senior researcher, and Peng Lianmao, an academician of the Chinese Academy of Sciences, has developed nano-gate ferroelectric transistors with an ultralow operation voltage of 0.6 volts, successfully shrinking the physical size of the gate to 1 nanometer.</p><p>Reviewers of Science Advances note that these nano-gate ferroelectric transistor devices exhibit excellent memory performance, for the first time achieving voltage compatibility between ferroelectric memory devices and logic transistors. The physical mechanism behind this technology holds significant implications for the development of the memory sector.</p><p>Qiu said their findings resolve the challenge of voltage incompatibility between memory and logic. Data can now be transferred between memory and computing units at the same low voltage with zero barriers and ultra-low power consumption for high-speed interaction.</p><p>He added that the principle underlying this technology is universal and can be applied to mainstream ferroelectric materials. It can also be mass-produced using standard industrial processes, demonstrating strong industrial compatibility.</p><p>Notably, this technology is expected to be used in large model inference, edge intelligence, wearable devices, and Internet of Things terminals in the future.</p><p>Editor: Dou Shicong</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinese-researchers-create-advanced-transistor-with-ultralow-power-consumption",
            "pub_date": "2026-02-27 15:46:45",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's First 7S Humanoid Robot Store Showcases Industry Ambitions",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112020362526405.jpg\" id=\"news-body\"><p>(Yicai) Feb.18 -- At 10 a.m. sharp, two 1.3-meter-tall humanoid robots in a storefront in Wuhan, capital city of central China's Hubei Province, sprang to life, twisting and turning in perfect sync to a rhythmic beat. The conclusion of their dance coincided with the country's first-ever 7S humanoid robot store officially opening for its daily business.</p><p>Much like the automotive 4S shops, this novel concept aims to be a one-stop hub. But instead of cars, it focuses on humanoid robots. The 7S model builds on the traditional automobile 4S concept, namely sales, service, spare parts and surveys, by adding solution, show and school functions, thereby covering the entire industrial chain from components and whole machines to scenario-based applications.</p><p>Since opening in November 2025, this store in Wuhan, run by Hubei Humanoid Robot Innovation Center, has become a landmark of a shopping mall in the Wuhan East Lake High-Tech Development Zone, also known as the Optics Valley of China, a tech hub in Hubei.</p><p>China's humanoid robot industry saw significant growth throughout 2025, backed by national and local government mid-to-long-term plans targeting it as a strategic sector. The 7S store represents a pioneering step in exploring viable commercial models and market acceptance for this transformative technology.</p><p>\"In nearly two months, we've received approximately 18,000 visits, becoming a popular tech destination in Wuhan for both locals and tourists,\" said store manager Hu Longdan.</p><p>\"Cumulative revenue has reached almost CNY615,000 (about USD88,600). Humanoid robots are very popular for rentals, having served 10 plus commercial events, while experience projects featuring robot dogs and robot soccer have become major attractions for the youth,\" Hu noted.</p><p>Inside the bustling store, robots of various sizes and shapes demonstrate their capabilities: some play soccer, others serve as retail assistants, while another group plays musical instruments.</p><p>\"We have 17 different models of humanoid robots here, priced from CNY149 to CNY700,000. They can be deployed in over 10 scenarios including industrial manufacturing, cultural tourism guidance, elderly care and special operations,\" said Hu.</p><p>China has intensified its efforts to foster future industries like embodied AI, as outlined in the proposals for the formulation of the country's 15th Five-Year Plan (2026-2030). The goal is to cultivate new economic growth engines through technological innovation and market exploration.</p><p>The 7S store in Wuhan is part of a national wave of robot-themed retail experiments to promote real-life application of humanoid robots, a key phase for the development of the industry. A think tank report forecasts that by 2045, China will have over 100 million humanoid robots deployed across industries, creating a total market value of approximately CNY10 trillion.</p><p>In July last year, a robot 6S store, said to be the world's first, opened in Shenzhen, a tech hub in south China. A month later, Beijing's Robot Mall, a 4,000-square-meter robot 4S showroom, debuted during a robot consumption festival, featuring more than 50 products spanning medical, industrial and companion robotics.</p><p>The Wuhan store, notably, features a schooling function, addressing the \"last mile\" of skill development, thus standing out when compared to its peers.</p><p>This means the Wuhan store is not just a sales venue but also a \"hands-on experience center\" offering interactive engagement and skills enhancement. Staff members highlight that the store provides robotics operator training, maintenance technician certification and introductory courses for teenagers.</p><p>In addition, corporate engineers can acquire practical skills in operating and maintaining humanoid robots on-site, while middle school students can learn programming and logic through hands-on activities.</p><p>\"We've held 20 sessions, including eight instances of operator training, 12 youth courses and two teacher training events, involving over 1,000 participants,\" said Hu.</p><p>About 65 percent of the trainees are youths, primarily students building foundational skills. Professionals, like engineers and teachers, accounting for 35 percent, seek operational and maintenance expertise. Over 50 professionals, meanwhile, have gained basic robot operation skills via the store programs, Hu revealed.</p><p>The store exemplifies the region's integrated supply chain.</p><p>A key attraction near the store entrance is Yuan You, meaning Far Traveler in English, which is a wheel-footed robot standing 158 cm tall and weighing 72 kg.</p><p>\"It can walk 1.5 meters per second,\" Hu said. \"It's a Hubei native and has been 'working' for nine months at a hospital in the city of Xianning in Hubei, providing guidance, explanations and even moxibustion therapy services.\"</p><p>Yuan Chao, general manager of Wuhan HandX Innovation Technology Co., Ltd, developer of Yuan You, noted that a team from the prestigious Wuhan University had provided both solutions for sensors and AI technology for this robot, while Hubei's local industrial chain supplied over 80 percent of the hardware.</p><p>\"Hubei has roughly 20 core humanoid robot supply chain enterprises and nearly a thousand related firms, allowing us to procure key components like the 'brain,' 'skeleton' and 'electronic skin,'\" Yuan added.</p><p>The first Yuan You was born in April 2025 after just six months of R&amp;D and is now in mass production, with four automated lines capable of producing 1,500 units annually.</p><p>Ensuring these robots are not just produced, but are also capable of performing effectively, is crucial. In June 2025, Hubei established a school for humanoids, known as the Hubei Humanoid Robot Innovation Center. There, newly-born robots are trained by data collectors.</p><p>\"We provide 23 high-fidelity simulation scenarios and over 10 temporary ones, capable of training hundreds of robots simultaneously, collecting more than a million real-machine data points annually,\" said Liu Chuanhou, chief operating officer of the center.</p><p>\"This data, after review, labeling and cleaning, is used for large-model training, enabling continuous robot evolution,\" Liu explained.</p><p>To propel robots from training to real-world value creation, Wuhan has released a three-year action plan and supportive policies, encouraging the development of diverse application scenarios.</p><p>Dong Danhong, director of the Wuhan Municipal Science and Technology Bureau, noted that the focus is on unlocking scenarios in hazardous/special operations, manufacturing activities like in the automotive sector, and public services such as elderly care and education.</p><p>Positioning the store as a national window for humanoid robotics, Hu said the 7S store is aiming to secure more than 100,000 visits in 2026, while hosting over 50 training sessions for more than 3,000 participants, thereby nurturing both youth interest and professional talent.</p><p>\"What humanoid robots can do today is still limited, but in the future, they will surely enter millions of households and serve numerous industries, becoming important members of our lives,\" Hu concluded.</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinas-first-7s-humanoid-robot-store-showcases-industry-ambitions",
            "pub_date": "2026-02-27 15:46:45",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese Lithium Miners Say Impact of Zimbabwe's Sudden Export Ban Will Be Minimal as Shares Slide",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112729262080709.jpg\" id=\"news-body\"><p>(Yicai) Feb. 26 -- Shares of several listed Chinese firms with lithium mining operations in Zimbabwe fell after Africa's top lithium producer abruptly halted all exports of the metal’s ore and concentrate a year earlier than planned, though the miners said the development would have limited impact on their businesses.</p><p>A spokesperson for Yahua Industrial Group told reporters today that the Sichuan province-based miner has already shipped out its lithium concentrate from Zimbabwe, and so it does not expect the Zimbabwean government’s sudden export halt to affect near-term production. Yahua’s shares [SHE: 002497] sank 8.8 percent to close at CNY26.44 (USD3.86) each in Shenzhen.</p><p>Zimbabwe’s mines ministry said yesterday that only entities with valid mining titles and approved processing plants will be authorized to export minerals. Agents and third-party traders will not be permitted to export on behalf of title holders, and applicants must include a provincial mining office recommendation letter certifying processing capacity, regulatory compliance, and the mineral composition of the consignment, it added.</p><p>Yahua’s spokesperson noted that traders and agents without local mining licences or processing qualifications are now ineligible to make exports, but stressed that the company can still apply for export permits if it provides supplementary documentation, something the firm has already begun to address.</p><p>All Chinese exports of lithium concentrate from Zimbabwe are on hold pending policy clarification, a spokesperson for Sinomine Resource Group said, adding that the Beijing-headquartered miner has virtually no locally processed lithium products in Zimbabwe and is considering options to extend its supply chain. No plans were ready for disclosure, the person said.</p><p>Sinomine’s stock [SHE: 002738] ended the day 4.8 percent lower at CNY87.59.</p><p>Zimbabwe’s lithium exports \"ban\" is essentially aimed at curbing unauthorised exports, a spokesperson for Huayou Cobalt told the media. The Zhejiang province-based firm’s license was issued by the mines ministry, and the full extent of any impact is still being assessed, the person said. Huayou Cobalt [SHA: 603799] fell 0.8 percent to finish at CNY76.88 in Shanghai.</p><p>Chinese miners have made substantial investments in Zimbabwe’s lithium sector. Bikita, fully owned by Sinomine, is one of Africa’s largest operational lithium mines, with an annual production capacity of about 600,000 tons of concentrate.</p><p>Chengxin Lithium Group has a majority stake in the Sabi Star mine, which produces roughly 300,000 tons of concentrate a year. Huayou Cobalt controls the Arcadia project, an integrated mining-and-processing operation that includes a 50,000-ton-per-year lithium sulfate facility. Yahua, meanwhile, has an interest in the Kamativi mine, which can produce 350,000 tons of concentrate annually.</p><p>Chengxin’s stock [SHE: 002240] gave up 6.5 percent to end at CNY42.26, while Zijin Mining Group [SHA: 601899] -- one of China’s biggest miners -- lost 0.7 percent, closing at CNY39.37.</p><p>The export halt is intended to force leading miners to build local processing plants and create more value domestically, Citic Securities said in a research note. Until new lithium-salt smelting capacity comes online, the brokerage said, the government may still allow limited export windows for large, compliant miners while excluding unlicensed traders and artisanal miners, which will raise export thresholds, boost the industry’s concentration, and benefit Chinese miners already in Zimbabwe.</p><p>Before the ban is lifted, China’s short-term supply of lithium carbonate is likely to tighten and lithium prices could surge, Citic Securities noted. </p><p>A number of Chinese lithium miners without exposure to Zimbabwe rallied. Jinyuan EP [SHE: 000546] surged by its 10 percent daily trading limit to CNY6.83 (USD1), Jiangxi Special Electric Motor [SHE: 002176] added 1.9 percent to CNY10.68, Yongshan Lithium [SHA: 603399] rose 0.9 percent to CNY11.82, [SHE: 001203] and Youngy [SHE: 002192] climbed 3.8 percent to CNY41.34 and CNY58.38, respectively. Yongxing Special Materials Technology [SHE: 002756] gained 3.5 percent to CNY59.</p><p>In recent years, countries rich in lithium, cobalt, nickel, tin, and other strategic minerals have tightened their control, Citic Securities noted, pointing to tin-mining restrictions in Myanmar, cobalt export curbs in the Democratic Republic of the Congo, and sharp reductions in nickel-ore quotas in Indonesia.</p><p>Amid a broader wave of resource nationalism and intensifying competition between the United States and China over control of critical minerals, further abrupt policy shifts by producer nations are likely, raising the risk of renewed supply disruptions, the brokerage said.</p><p>China imported about 7.75 million tons of lithium concentrate last year, up more than 39 percent from the previous year, mainly from Australia, Zimbabwe, and Nigeria, according to customs data.</p><p>Editor: Martin Kadiev</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinese-miners-say-impact-of-zimbabwes-sudden-lithium-exports-ban-will-be-minimal",
            "pub_date": "2026-02-27 15:46:44",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GAC Honda Slashes Price of Limited Number of Accord e:PHEVs by USD14,618",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112740047498949.jpg\" id=\"news-body\"><p>(Yicai) Feb. 26 -- GAC Honda, a joint venture between China’s GAC Group and Japan’s Honda Motor, is cutting CNY100,000 (USD14,618) off the price of a limited number of Accord e:PHEV models, marking the first wave of post-Lunar New Year price reductions in China’s auto market.</p><p>The discount is to celebrate the 50th anniversary of the Accord and is aimed at returning customers, the Guangzhou-based firm said. After the discount, which is the biggest price cut for this model since its launch, the Accord e:PHEV will be reduced to CNY138,800 (USD 20,288) from an official guide price of CNY 238,800. However, GAC Honda stressed that the offer is limited to just 1,000 vehicles.</p><p>Times have changed. Back in the heyday of gasoline-powered cars, buyers often had to pay extra just to get their hands on an Accord. But the latest data tells a different story. In January, the brand’s monthly sales plunged 27 percent from the previous month to a mere 13,800 units.</p><p>Over the past three years, GAC Honda’s 4S dealerships have been rolling out a number of sales promotions. At one point, the actual transaction price of the Accord was more than CNY50,000 (USD7,300) below the official guidance price.</p><p>From the market perspective, there remains intense competition among vehicles priced between CNY100,000 to CNY150,000, which is the mainstream segment of the car market. The automotive consumption index came in at just 31.1 last month, a historic low, according to data from the China Automobile Dealers Association.</p><p>To stimulate demand, more than 10 carmakers, including Tesla, Nio, XPeng and Li Auto, have recently launched seven-year ultra-low-interest financing deals.</p><p>Prices for conventional fuel vehicles continued to edge up in January, while prices for new energy vehicles showed a “declining quantity, rising price” trend, said Cui Dongshu, secretary-general of the China Passenger Car Association.</p><p>Editor: Kim Taylor</p></div>",
            "link": "https://www.yicaiglobal.com/news/gac-honda-slashes-price-of-limited-number-of-accord-ephevs-by-usd14618",
            "pub_date": "2026-02-27 15:46:44",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China’s Strict New Auto Rules Favor Existing Carmakers, VW Executive Says",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2025/12/105745836279493.jpg\" id=\"news-body\"><p>(Yicai) Dec. 9 -- This year’s wave of stricter regulations and higher safety and technical standards in China’s auto sector are a boon for established carmakers that consistently adhere to higher standards, according to the chief executive of Volkswagen Group's Chinese passenger vehicle business.</p><p>The policies introduced this year raise the competitive threshold for all market participants and may accelerate the concentration of brands that can meet stringent requirements without sacrificing innovation and user experience, Robert Cisek said in a recent interview with Yicai.</p><p>To regulate the fast-growing electric vehicle industry, the Ministry of Industry and Information Technology brought out new regulations this year covering areas such as battery safety, advanced driver assistance systems, and car door handles. The Ministry of Public Security also released draft auto safety standards last month, which among other things propose that passenger cars should not be able to accelerate from 0 to 100 kilometers per hour in under 5 seconds.</p><p>These rules not only steer innovation in the right direction, but also deliver much-needed protection for consumers in a rapidly changing market, Cisek pointed out. For example, the proposal  to limit acceleration reflects concern about unnecessary performance competition, a stance that aligns well with Volkswagen’s long-standing emphasis on driving safety, he said.</p><p>In response to fierce competition in China’s auto market, Volkswagen is speeding up its strategic transformation. Part of that involves partnering with domestic EV startup Xpeng Motors to jointly develop the China Electrical Architecture, a platform for the electronic and electrical systems in its Chinese cars.</p><p>From next year Volkswagen's three joint ventures in the country will share electrification development platforms, including the CEA. At the same time, Volkswagen Group China Technology based in Hefei, Anhui province will serve as the research and development center responsible for coordinating these efforts, Cisek noted.</p><p>This will help avoid redundant investment while allowing the JVs to tailor products for their specific target users, thereby maximizing synergy, he explained. The JVs are FAW Volkswagen with FAW Group, SAIC Volkswagen with SAIC Motor, and Volkswagen Anhui with JAC Motors.</p><p>Editors: Dou Shicong, Futura Costaglione</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinas-tighter-auto-industry-regulations-benefit-established-carmakers-volkswagen-exec-says",
            "pub_date": "2026-02-27 15:41:05",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Porsche's China Sales Drop for Fourth Straight Year in 2025",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/01/109358565100229.jpg\" id=\"news-body\"><p>(Yicai) Jan. 19 -- Sales of German luxury carmaker Porsche in China have declined for four consecutive years, with last year's figure down 60 percent from a peak in 2021.</p><p>Porsche's China sales plunged 26 percent to around 42,000 units in 2025 from the previous year, according to data the Stuttgart-based carmaker released on Jan. 16. In addition, global sales fell 10 percent to about 279,000 units, the biggest drop since 2009.</p><p>Previously, Porsche China Chief Executive Pan Liqi confirmed the company's plans to reduce the number of authorized sales outlets in the country from 150 in 2024 to 120 by the end of last year and to about 80 by the end of this year.</p><p>Porsche failed to reach the delivery level of 2024 after years of record growth, which was in line with its internal expectations, mainly because supply shortage for the 718 model and the Macan fuel version, Matthias Becker, member of the executive board for sales and marketing, said on Jan. 16. Its strategy of prioritizing per-vehicle profit over simply pursuing sales also had a certain impact, he added.</p><p>With the rapid development of Chinese new energy vehicles, the structure of the local auto market has changed, with some high-end domestic cars diverting the traditional luxury market. In addition, luxury brands have been slow in their electric transition.</p><p>Porsche was the first ultra-luxury brand to launch a battery electric vehicle, releasing the electric version of the Taycan in 2019. However, it did not develop any exclusive models for the Chinese market.</p><p>Last September, Porsche announced it would slow down its electrification process, postponing the launch of some BEV models while planning to roll out more fuel cars and plug-in hybrid EVs.</p><p>Porsche sells the Taycan and the Macan BEVs in China, but their performance has not met expectations. It plans to bring the electric editions of the Cayenne and 718 to the Chinese market this year.</p><p>Porsche China will gradually cease operations of about 200 self-built premium charging stations across the country from March 1, terminating related services and removing them from the charging map in the Porsche App and WeChat mini-program, it said at the end of last year. The move is likely due to the shift in the company's electrification strategy.</p><p>Editor: Martin Kadiev</p></div>",
            "link": "https://www.yicaiglobal.com/news/porsches-china-sales-drop-for-fourth-straight-year-in-2025",
            "pub_date": "2026-02-27 15:41:05",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Technology for Change Asia 2026 to Decode Innovation for Business Growth",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112568497999557.jpg\" id=\"news-body\"><p>(Yicai) Feb. 24 -- Economist Impact will host Technology for Change Asia 2026 from March 11 to 12 in Hong Kong. This premier event convenes over 700 industry and government leaders to pinpoint solutions that will help businesses prosper in an era of rapid technological shift.</p><p>The 2026 program moves beyond hype to address the practical realities of the AI age. Attendees will engage with senior leaders to discuss regulatory divergence across Asia, the scaling of autonomous agents, the Greater Bay Area innovation ecosystem, and the impact of smart mobility on global supply chains.</p><p>\"By convening Technology for Change Asia 2026, and hearing from organizations that are leading the way in technology adoption, we aim to highlight how technology can provide a positive and prosperous way forward,\" Tom Standage, deputy editor of The Economist, said ahead of the event. </p><p>Speakers include Siri's Co-founder Tom Gruber, HSBC Asia's CIO James Elwes, Shangri-La Group's CTO Spencer Lam, Unilever's digital CEO Aseem Puri, and FedEx North-Pacific's Vice-president Jeremy Goldstrich.</p><p>The event is sponsored by Tata Communications, GCash, Ant International and FWD, and supported by The Hong Kong Tourism Board and Invest Hong Kong.</p></div>",
            "link": "https://www.yicaiglobal.com/news/technology-for-change-asia-2026-to-decode-innovation-for-business-growth",
            "pub_date": "2026-02-27 15:41:04",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese Scientists Develop Electrolyte Enabling Lithium Batteries to Operate at Minus 50°C",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112741154478789.jpg\" id=\"news-body\"><p>(Yicai) Feb. 26 -- A Chinese research team has developed a new electrolyte that significantly improves lithium battery performance in ultra-low temperatures, with potential applications in electric vehicles, aerospace, and robotics, according to a study published in Nature.</p><p>The breakthrough addresses a longstanding limitation of lithium batteries, which struggle to maintain performance below minus 50 degrees centigrade. The newly designed electrolyte allows batteries to retain nearly 400 watt-hours per kilogram even at minus 50 degrees centigrade, compared with the 100 to 300 watt-hours per kilogram typical of commercial batteries today.</p><p>The research, published in Nature yesterday, was conducted by scientists from the College of Chemistry at Nankai University and the Shanghai Institute of Space Power-Sources. The team designed a new fluorinated hydrocarbon solvent molecule and built an electrolyte system that replaces the conventional lithium-oxygen coordination mode found in mainstream electrolytes.</p><p>Electrolytes serve as the key medium for conducting charged ions between the positive and negative electrodes of lithium batteries. Current mainstream electrolytes consist of lithium salts and carbonate solvents and rely on interactions between lithium and oxygen atoms in the solvent to facilitate dissolution. However, poor wettability limits battery energy density, while restricted charge transfer capacity at low temperatures prevents operation below minus 50 degrees centigrade.</p><p>To overcome these constraints, the Nankai University team proposed replacing oxygen atoms with fluorine atoms to enhance the effective dissolution of lithium salts in the electrolyte. The resulting lithium battery achieved an ultra-high energy density of 700 watt-hours per kilogram at room temperature and maintained nearly 400 watt-hours per kilogram at minus 50 degrees centigrade, the research showed.</p><p>For comparison, commercial lithium batteries generally offer energy densities between 100 watt-hours per kilogram and 300 watt-hours per kilogram. The 4680 battery developed by electric vehicle maker Tesla, for instance, has an energy density close to 300 watt-hours per kilogram.</p><p>High-energy-density batteries based on the new electrolyte have broad application potential in new energy vehicles, embodied intelligent robots, the low-altitude economy, and aerospace, said Chen Jun, associate president of Nankai University, and one of the corresponding authors of the study.</p><p>Editor: Emmi Laine</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinese-scientists-develop-electrolyte-enabling-lithium-batteries-to-operate-at-minus-50c",
            "pub_date": "2026-02-27 15:41:04",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese Carmakers Bet on Global Push, AI to Stay Competitive",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112757821749957.jpg\" id=\"news-body\"><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">(Yicai) Feb. 26 -- Overseas expansion and artificial intelligence are emerging as two critical levers for Chinese automakers looking to remain ahead of the pack this year, according to open letters issued by eight Chinese carmakers, including Nio, Xpeng and Geely Holding Group, since the end of last year to all staff members.</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">Leading automakers are targeting at least 12 percent growth this year, according to Yicai research. Leapmotor Technology has set an ambitious goal of hitting one million vehicles in 2026, equivalent to a 67.5 percent year-on-year increase. Xpeng is aiming for annual sales of 550,000 to 600,000 units, which translates to a growth rate of over 28 percent while Xiaomi Auto is targeting 550,000 vehicles, a jump of 34 percent. Nio has also said it plans to maintain stable annual growth of between 40 percent and 50 percent.</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">The China Association of Automobile Manufacturers, though, has given a far more conservative forecast, projecting that vehicle sales this year will edge up 1 percent from the year before to 34.7 million units.</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">On one side, automakers have ambitious growth targets, while on the other side, institutions are providing more cautious projections. This wide gap has set the tone for China’s auto market at the start of the year.</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">In its 10th anniversary letter to employees, Leapmotor stated that this year the Hangzhou-based company aims to shift from simply \"exporting cars\" to \"manufacturing cars overseas,\" and will integrate more deeply with local industries.</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">\"The industry’s elimination round is getting more brutal and competition will only become more fierce,\" said Zhao Fei, president of Changan Auto. “The window of opportunity in overseas markets is only one to two years. We must ramp up resource investment, push forward with all our efforts, and firmly promote our overseas doubling strategy.”</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">Xpeng plans to double overseas sales this year and sell one million units abroad by 2030, with overseas markets contributing more than 70 percent of the company's profits, Chairman He Xiaopeng said. The Guangzhou-based firm will focus on five key markets, namely Israel, Germany, Norway, Thailand and France.</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">Geely will fully promote product adaptability and localized development, said Chief Executive Officer Gan Jiayue. The Hangzhou-based firm aims to build strong local competitiveness in key markets through product exports, brand expansion, resource integration, and technological empowerment.</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">AI has become a core performance indicator for many auto manufacturers this year. For example, He said that this year Xpeng aims to be the world's first technology company to mass produce three cutting-edge AI businesses, namely robots, flying cars and Robotaxis, in the same year.</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">Li Xiang, CEO of Li Auto, predicted in a company-wide meeting that Level 4 autonomous driving will be commercially deployed by 2028 at the latest. He also said that globally, there will be no more than three companies that effectively integrate foundational models, chips, embodied intelligence and operating systems. He made it clear that Beijing-based Li Auto will build humanoid robots and aims to unveil them as soon as possible.</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">In January, Chery also rolled out its AI strategy, showcasing core AI achievements including its super AI assistant “Xiaoqi,\" the Falcon smart driving system, the Lingxi smart cockpit and the AiMOGA robot.</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">German consulting firm Roland Berger predicts that top-tier industry concentration in the Chinese market will become even more pronounced this year. The market landscape is likely to consist of a handful of leading automakers, several mid-tier players and a large number of struggling smaller firms. In essence, the open letters from leading carmakers all send the same message that they are going all out to make sure they remain at the head of the pack.</span></p><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">Editor: Kim Taylor</span></p></div>",
            "link": "https://www.yicaiglobal.com/news/chinese-carmakers-bet-on-global-push-ai-to-stay-competitive",
            "pub_date": "2026-02-27 15:41:04",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese Chemicals Firm Limin Soars by Limit on USD230 Million Order From Bayer Crop Science",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112823311731397.jpg\" id=\"news-body\"><p>(Yicai) Feb. 27 -- Shares of Limin Group surged by the exchange-imposed daily trading limit after the Chinese agricultural fungicide supplier received a CNY1.6 billion (USD230 million) order from Bayer Crop Science, the agricultural solutions unit of German multinational corporation Bayer.</p><p>Limin [SHE: 002734] closed 10 percent up at CNY22.48 (USD3.27) today. The Shenzhen Component Index fell 0.1 percent.</p><p>Limin will supply agricultural chemical products worth no less than CNY800 million (USD116 million) to Bayer SA, the operator of Bayer Crop Science's Latin American business, headquartered in São Paulo, Brazil, over the next three years, the Xinyi-based firm announced today, citing a cooperation agreement signed yesterday.</p><p>Once the order is fulfilled, the contract will automatically extend for three more years, with the same product value, if the parties have no objections, Limin noted.</p><p>The deal is expected to have a positive impact on Limin's financial and operating results for this year and in the future, as the procurement amount for the first three years is nearly 19 percent of the audited revenue from its main business operations in 2024, the company said.</p><p>The announcement did not mention the types and quantities of the agricultural chemicals Limin will supply to Bayer SA. But the company's main products include fungicides, insecticides, herbicides, and veterinary drugs, with fungicides accounting for half of its revenue in 2024. About 34 percent of Limin's revenue in 2024 came from overseas markets.</p><p>Limin and Bayer Crop Science have a long-standing supply partnership. According to the Chinese company's website, it received a medal of gratitude from Bayer for ensuring supply under extremely tight market conditions in 2018.</p><p>Editor: Futura Costaglione</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinese-chemicals-firm-limin-soars-by-limit-on-usd230-million-order-from-bayer-crop-science",
            "pub_date": "2026-02-27 15:41:04",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Leapmotor, Xpeng, and Xiaomi Are Only Chinese EV Startups to Meet 2025 Delivery Target",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/01/108118358895301.jpg\" id=\"news-body\"><p>(Yicai) Jan. 5 -- Leapmotor Technology, Xpeng Motors, and Xiaomi Auto were the only ones among China’s new energy vehicle startups and legacy automakers’ EV brands to achieve or exceed their annual delivery targets last year.</p><p>Leapmotor's deliveries jumped 103 percent to 596,555 cars in 2025 from the year before, exceeding its 500,000 goal, the Hangzhou-based firm announced on Jan. 1. That put Leapmotor first among China’s EV startups. Xpeng was second with 429,445, a 126 percent surge, versus a targeted 380,000.</p><p>Meanwhile, Xiaomi Auto delivered 410,000, beating its 350,000 goal, according to Chairman and Chief Executive Lei Jun. The car production arm of consumer electronics giant Xiaomi targets 550,000 for this year.</p><p>Li Auto's deliveries fell 19 percent to 406,343 last year, falling short of its 700,000 aim. Those of Nio rose 47 percent to 326,028, though the carmaker achieved only 74 percent of its objective.</p><p>Zeekr Intelligent Technology, the premium electric vehicle unit of Geely Automobile Holdings that manages the Zeekr and Lynk &amp; Co brands, saw sales rise 13 percent to 574,628, fulfilling just 81 percent of its target. Of them, 224,133 were Zeekr and 350,495 were Lynk &amp; Co cars.</p><p>The two EV brands of state-owned Changan Automobile, Deepal and Avatr, sold 333,117 and 128,772 last year, up 37 percent and 75 percent, respectively. Deepal achieved 93 percent of its annual target, and Avatr 59 percent.</p><p>Voyah, the premium EV brand of state-owned Dongfeng Motor Group, logged sales of 150,169, up 75 percent, fulfilling only 75 percent of its target.</p><p>Huawei Technologies' Harmony Intelligent Mobility Alliance, which includes the Aito brand with Seres Group, Luxeed with Chery Automobile, Maextro with JAC Motors, Stelato with BAIC Group, and Shangjie with SAIC Motor, delivered 589,107 EVs, up 32 percent. Huawei did not disclose HIMA’s annual delivery target.</p><p>Editors: Dou Shicong, Futura Costaglione</p></div>",
            "link": "https://www.yicaiglobal.com/news/leapmotor-xpeng-xiaomi-are-only-chinese-ev-startups-to-achieve-2025-delivery-target",
            "pub_date": "2026-02-27 15:36:01",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Used Car Transactions Top 20 Million Units for First Time in 2025",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/01/108936942750405.jpg\" id=\"news-body\"><p>(Yicai) Jan. 14 -- China’s second-hand vehicle transaction volume rose nearly 3 percent last year from the year before, surpassing 20 million units for the first time as rapid growth in the new energy vehicle market and streamlined cross-regional trading boosted activity.</p><p>The total number of used vehicles traded reached 20.1 million units, with transaction value amounting to CNY1.3 trillion (USD186.4 billion), according to data released yesterday by the China Automobile Dealers Association. Second-hand passenger vehicle transactions edged up 0.4 percent to 15.7 million units, while used commercial vehicle trades climbed almost 8 percent to 2.9 million units.</p><p>Amid the fast expansion of NEV consumption in China, the share of second-hand NEV transactions continued to rise. Used NEV trading volume hit 1.6 million units last year, accounting for almost 8 percent of the total, up from nearly 6 percent in the previous year, CADA said.</p><p>China has also been simplifying procedures for cross-regional used vehicle transactions in recent years, further lifting market activity. The proportion of cross-regional second-hand vehicle trades reached almost 35 percent in December, up from a bit more than 30 percent a year earlier.</p><p>As the industry matures, used vehicle prices have shown greater stability. The average transaction price stood at CNY64,500 (USD9,250) in December, up CNY400 (USD57) from November and CNY1,400 (USD201) from a year ago.</p><p>Second-hand vehicles are increasingly becoming the first choice for young first-time car buyers in China due to their cost-effectiveness, according to a report jointly released in December by ByteDance-backed automotive content platform Dongchedi, also known as Dcar, and the China Automotive Technology and Research Center.</p><p>The report noted that young buyers typically purchase used vehicles priced between CNY50,000 and CNY100,000 (up to USD14,331), place the greatest emphasis on vehicle condition and price, and prefer to complete transactions through online platforms.</p><p>Editors: Dou Shicong; Emmi Laine</p></div>",
            "link": "https://www.yicaiglobal.com/news/china-used-car-transactions-top-20-million-units-for-first-time-in-2025",
            "pub_date": "2026-02-27 15:36:01",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        }
    ]
}