{
    "data": [
        {
            "title": "Aito Dethrones Leapmotor as China's Best-Selling NEV Startup in January",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/110611641556677.jpg\" id=\"news-body\"><p>(Yicai) Feb. 2 -- Aito, the electric vehicle brand co-developed by Chinese carmaker Seres Group and tech giant Huawei Technologies, has surpassed Leapmotor Technology to become the best-selling new energy vehicle startup in China last month.</p><p>Aito's deliveries surged 83 percent to 40,016 units in January from a year earlier, Seres announced yesterday. Leapmotor, which sold the most EVs among NEV startups in China last year, slipped to third position, with deliveries up 27 percent to 32,059 units in the period.</p><p>In fact, Xiaomi Auto also overtook Leapmotor last month, having delivered over 39,000 electric vehicles.</p><p>Shanghai-based Nio saw its deliveries nearly double to 27,182 units in January from a year earlier, driven by strong sales of its new ES8, which was released in the second half of last year.</p><p>Meanwhile, both Li Auto and Xpeng Motors experienced declines in deliveries in the period, with the former down 8 percent to 27,668 units, and the latter down 34 percent to 20,011 units.</p><p>On a monthly basis, sales of NEV startups generally declined in January. Leapmotor and Xpeng reported drops of 47 percent, and Nio experienced a 44 percent fall. Sales of Li Auto plunged 37 percent, and those of Aito and Xiaomi Auto shrank 31 percent and 22 percent, respectively.</p><p>Due to the tendency of Chinese carmakers to engage in aggressive promotional activities at the end of the year to boost sales and achieve their annual delivery targets, the market typically experiences a cooling adjustment in January.</p><p>Moreover, China has abolished the 12-year policy of exempting NEVs from purchase taxes from Jan. 1, replacing it with a 5 percent tax based on the vehicle's selling price, which has led to an increase in consumers' purchasing costs this month.</p><p>China's retail sales of passenger cars totaled 679,000 units between Jan. 1 and 18, down 28 percent from a year earlier and 37 percent from a month earlier, according to data from the China Passenger Car Association. Among them, NEV sales reached 312,000 units, down 16 percent and 52 percent, respectively, in the period.</p><p>Editors: Dou Shicong, Futura Costaglione</p></div>",
            "link": "https://www.yicaiglobal.com/news/aito-dethrones-leapmotor-as-chinas-best-selling-nev-startup-in-january",
            "pub_date": "2026-02-28 19:16:51",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nio Forecasts First-Ever Operating Profit, Boosting US and Hong Kong Shares",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/110972439967429.jpg\" id=\"news-body\"><p>(Yicai) Feb. 6 -- Chinese electric vehicle startup Nio said it expects to achieve its first-ever operating profit in the fourth quarter of last year, lifting its share prices in both the US and Hong Kong markets.</p><p>Nio [HKG: 9866] closed 7 percent elevated at HKD39.10 (USD5) in Hong Kong today, while its US-listed shares [NASDAQ: NIO] ended the day 5.9 percent higher at USD4.70 yesterday.</p><p>According to a preliminary assessment, Nio expects to record an adjusted operating profit of USD100 million to USD172 million in the fourth quarter, excluding stock-based compensation expenses, the Shanghai-based EV maker announced yesterday. This compares with an adjusted operating loss of CNY5.5 billion (USD792.5 million) in the same period a year earlier.</p><p>Under generally accepted accounting principles, the company is expected to have recorded an operating profit of about USD29 million to USD100 million for the quarter, it added.</p><p>Founded in 2014, Nio has long been criticized for persistent losses. The company’s net loss widened 8 percent year on year to CNY22.4 billion (USD3.2 billion) in 2024. In the first three quarters of last year, net losses reached CNY15.7 billion, up 1 percent from a year earlier.</p><p>Against this backdrop, founder and Chief Executive Officer Li Bin said at an internal meeting in October last year that Nio must achieve profitability by the fourth quarter of 2025, warning that failure to do so would pose serious challenges to the company’s long-term development.</p><p>The expected profit in the quarter ended in December 2025 was mainly driven by sustained growth in fourth-quarter sales volume, improved vehicle margins from a favorable product mix, and the company’s ongoing cost-cutting measures and efficiency improvements, according to the announcement.</p><p>Nio launched the third-generation ES8, a large all-electric sport utility vehicle, in September last year and delivered 40,000 units within 100 days. Supported by the strong performance of this model, fourth-quarter deliveries jumped 72 percent year on year to almost 124,810 vehicles, setting a new quarterly record.</p><p>In January this year, Nio delivered more than 27,180 vehicles, up 96 percent from a year earlier but down 44 percent from December, according to the latest data.</p><p>Editors: Dou Shicong, Emmi Laine</p></div>",
            "link": "https://www.yicaiglobal.com/news/nio-forecasts-first-ever-operating-profit-boosting-us-and-hong-kong-shares",
            "pub_date": "2026-02-28 19:16:51",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zhipu’s Stock Pops After Chinese AI Startup Upgrades Flagship Model",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/111496312146629.jpg\" id=\"news-body\"><p>(Yicai) Feb. 12 -- Shares of Knowledge Atlas Technology Joint Stock, better known as Zhipu AI, surged after the Chinese artificial intelligence developer released the latest version of its flagship GLM-5 large language model.</p><p>The shares [HKG: 2513] closed 29 percent higher at HKD402 (USD51.43) each in Hong Kong today, after earlier surging by as much as 42 percent. The stock has more than tripled in value since its first day of trading on Jan. 8.</p><p>GLM-5, which is open-source, prioritizes enhancing programming and agent capabilities, supports larger model scales and more complex reinforcement learning tasks, Beijing-based Zhipu noted. It has an asynchronous agent reinforcement learning algorithm, enabling the model to continuously learn from long-range interactions. </p><p>The mysterious Pony Alpha model, which topped OpenRouter's model popularity rankings earlier this week, was in fact the latest iteration of GLM-5, Zhipu told Yicai.</p><p>For the first time, GLM-5 integrates DeepSeek Sparse Attention, a sparse attention mechanism, which maintains the quality of long text processing without loss while substantially lowering the model’s deployment cost, the company said.</p><p>AI model updates this year show them progressing from writing code and front-end tasks to handling engineering work and completing large projects. GLM-5's performance in practical programming tests is approaching that of Anthropic's Claude Opus 4.5, while it also excels in complex systems engineering and long-horizon agent tasks.</p><p>Furthermore, GLM-5 can be integrated into the viral open-source AI agent framework OpenClaw, providing users with an intelligent “intern” for various tasks, including website searches, organizing information, tweeting posts, and performs programming tasks.</p><p>Editor: Martin Kadiev</p></div>",
            "link": "https://www.yicaiglobal.com/news/zhipu-ai-pops-after-chinese-startup-launches-new-foundation-model",
            "pub_date": "2026-02-28 19:16:51",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese Researchers Create Advanced Transistor With Ultralow Power Consumption",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/111940026163909.jpg\" id=\"news-body\"><p>(Yicai) Feb. 17 -- A team of Chinese researchers has developed the world's smallest ferroelectric transistor with ultralow power consumption, offering new insights into progress in the semiconductor industry, according to a study published recently in the journal Science Advances.</p><p>In advanced semiconductor manufacturing processes, the operating voltage of logic chips has been reduced to 0.7 volts to achieve high energy efficiency. However, mainstream non-volatile memory, such as NAND flash, previously required 5 volts or higher to complete write operations.</p><p>This mismatch lead to the integration of complex circuits for voltage step-up or step-down to enable collaboration between logic and memory units. Such integration resulted in additional power consumption, wasted space, and data transfer bottlenecks between logic and memory.</p><p>In typical AI chips, 60 to 90 percent of total power consumption is used for data transfer rather than computation. This has become one of the core constraints limiting improvements in AI computing power and energy efficiency.</p><p>The team from Peking University led by Qiu Chenguang, a senior researcher, and Peng Lianmao, an academician of the Chinese Academy of Sciences, has developed nano-gate ferroelectric transistors with an ultralow operation voltage of 0.6 volts, successfully shrinking the physical size of the gate to 1 nanometer.</p><p>Reviewers of Science Advances note that these nano-gate ferroelectric transistor devices exhibit excellent memory performance, for the first time achieving voltage compatibility between ferroelectric memory devices and logic transistors. The physical mechanism behind this technology holds significant implications for the development of the memory sector.</p><p>Qiu said their findings resolve the challenge of voltage incompatibility between memory and logic. Data can now be transferred between memory and computing units at the same low voltage with zero barriers and ultra-low power consumption for high-speed interaction.</p><p>He added that the principle underlying this technology is universal and can be applied to mainstream ferroelectric materials. It can also be mass-produced using standard industrial processes, demonstrating strong industrial compatibility.</p><p>Notably, this technology is expected to be used in large model inference, edge intelligence, wearable devices, and Internet of Things terminals in the future.</p><p>Editor: Dou Shicong</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinese-researchers-create-advanced-transistor-with-ultralow-power-consumption",
            "pub_date": "2026-02-28 19:16:50",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IQiyi’s Annual Loss Weighs on Chinese Video Site’s Stock Even as Fourth-Quarter Sales Edge Up",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112830117284549.jpg\" id=\"news-body\"><p><span style=\"color:black;\">(Yicai) Feb. 27 -- IQiyi's shares fell after the Chinese video platform said its revenue rose 3 percent last quarter from a year earlier, driven by a surge in content distribution and record overseas subscribers, but swung into the red last year due to a drop in memberships and advertising income.</span></p><p><span style=\"color:black;\">IQiyi [Nasdaq: IQ] closed 3.4 percent at USD1.71 in New York yesterday. The stock has dropped 11 percent since the end of last year.</span></p><p><span style=\"color:black;\">Revenue was CNY6.8 billion (USD971.6 million) in the three months ended Dec. 31, while net loss shrank 97 percent to CNY5.8 million (USD847,790), the Beijing-based company said in a financial report released yesterday. Based on non-generally accepted accounting principles, the net profit stood at CNY109.7 million (USD16 million), compared with a loss of CNY58.8 million (USD8.6 million) a year ago.</span></p><p><span style=\"color:black;\">For the full 2025, iQiyi reported a net loss of CNY206.3 million, versus a net profit of CNY764.1 million the previous year, the company said. Its revenue dropped 7 percent to CNY27.3 billion due to its lighter content slate weighing on membership services income, while \"some advertisers adjusted their advertising and promotion strategies in response to macro pressures,\" it added.</span></p><p><span style=\"color:black;\">\"Our overseas business has evolved into a sustainable and scalable second growth engine,\" Gong Yu, founder and chief executive of iQiyi, said at an earnings conference call. Membership revenue outside the Chinese mainland surged 40 percent in the fourth quarter, with that from Brazil, Mexico, and Indonesia each soaring over 80 percent, while global subscriber numbers reached an all-time high, he added.</span></p><p><span style=\"color:black;\">In addition, iQiyi posted a non-GAAP operating income for the fourth consecutive year, with the figure reaching CNY638.9 million last year.</span></p><p><span style=\"color:black;\">Revenue from content distribution soared 94 percent to CNY787.7 million last quarter from a year earlier. That from brand advertising grew year on year and quarter on quarter, with income from variety shows and dramas each seeing double-digit jumps. </span></p><p><span style=\"color:black;\">IQiyi's long-form dramas topped China's viewership rankings last year, boosted by the Strange Tales of Tang Dynasty franchise, according to data from Enlighten. Its micro drama portfolio boasted over 150 originals, fueling record revenue from memberships and distribution.</span></p><p><span style=\"color:black;\"><strong>AI Plans</strong></span></p><p><span style=\"color:black;\">IQiyi has also begun beta testing Nadou Pro, a proprietary AI agent platform for professional content production, with Gong telling analysts that \"the AI-led commercial film probably will emerge within the next two to three years,\" a shift the company believes will benefit established platforms like iQiyi. </span></p><p><span style=\"color:black;\">\"Heading into 2026, we will fortify our domestic core by advancing content excellence and strengthening our membership and advertising businesses, accelerate breakthroughs across our overseas and experience businesses, and harness AI to cultivate a thriving content ecosystem enriched by AIGC,\" Gong noted.</span></p><p><span style=\"color:black;\">IQiyi is expected to release detailed AI-generated content plans at its World Conference in April.</span></p><p><span style=\"color:black;\"><strong>Immersive Theme Parks</strong></span></p><p><span style=\"color:black;\">Earlier this month, iQiyi opened its first iQiyi Land immersive indoor theme park in Yangzhou, a Chinese city in eastern Jiangsu province neighboring Nanjing, which has received high ratings on Chinese travel platforms. A second park is under construction in Kaifeng, with a third in Beijing also expected to open later this year.</span></p><p><span style=\"color:black;\">\"As demand for offline entertainment surges, we see iQiyi Land as a new driver for our long-term growth,\" Gong said previously.</span></p><p><span style=\"color:black;\">Editor: Martin Kadiev</span></p></div>",
            "link": "https://www.yicaiglobal.com/news/chinas-iqiyi-drops-after-fourth-quarter-revenue-climbs-3-but-swings-to-annual-loss",
            "pub_date": "2026-02-28 19:16:50",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese Chemicals Firm Limin Soars by Limit on USD230 Million Order From Bayer Crop Science",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112823311731397.jpg\" id=\"news-body\"><p>(Yicai) Feb. 27 -- Shares of Limin Group surged by the exchange-imposed daily trading limit after the Chinese agricultural fungicide supplier received a CNY1.6 billion (USD230 million) order from Bayer Crop Science, the agricultural solutions unit of German multinational corporation Bayer.</p><p>Limin [SHE: 002734] closed 10 percent up at CNY22.48 (USD3.27) today. The Shenzhen Component Index fell 0.1 percent.</p><p>Limin will supply agricultural chemical products worth no less than CNY800 million (USD116 million) to Bayer SA, the operator of Bayer Crop Science's Latin American business, headquartered in São Paulo, Brazil, over the next three years, the Xinyi-based firm announced today, citing a cooperation agreement signed yesterday.</p><p>Once the order is fulfilled, the contract will automatically extend for three more years, with the same product value, if the parties have no objections, Limin noted.</p><p>The deal is expected to have a positive impact on Limin's financial and operating results for this year and in the future, as the procurement amount for the first three years is nearly 19 percent of the audited revenue from its main business operations in 2024, the company said.</p><p>The announcement did not mention the types and quantities of the agricultural chemicals Limin will supply to Bayer SA. But the company's main products include fungicides, insecticides, herbicides, and veterinary drugs, with fungicides accounting for half of its revenue in 2024. About 34 percent of Limin's revenue in 2024 came from overseas markets.</p><p>Limin and Bayer Crop Science have a long-standing supply partnership. According to the Chinese company's website, it received a medal of gratitude from Bayer for ensuring supply under extremely tight market conditions in 2018.</p><p>Editor: Futura Costaglione</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinese-chemicals-firm-limin-soars-by-limit-on-usd230-million-order-from-bayer-crop-science",
            "pub_date": "2026-02-28 19:16:50",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China’s Strict New Auto Rules Favor Existing Carmakers, VW Executive Says",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2025/12/105745836279493.jpg\" id=\"news-body\"><p>(Yicai) Dec. 9 -- This year’s wave of stricter regulations and higher safety and technical standards in China’s auto sector are a boon for established carmakers that consistently adhere to higher standards, according to the chief executive of Volkswagen Group's Chinese passenger vehicle business.</p><p>The policies introduced this year raise the competitive threshold for all market participants and may accelerate the concentration of brands that can meet stringent requirements without sacrificing innovation and user experience, Robert Cisek said in a recent interview with Yicai.</p><p>To regulate the fast-growing electric vehicle industry, the Ministry of Industry and Information Technology brought out new regulations this year covering areas such as battery safety, advanced driver assistance systems, and car door handles. The Ministry of Public Security also released draft auto safety standards last month, which among other things propose that passenger cars should not be able to accelerate from 0 to 100 kilometers per hour in under 5 seconds.</p><p>These rules not only steer innovation in the right direction, but also deliver much-needed protection for consumers in a rapidly changing market, Cisek pointed out. For example, the proposal  to limit acceleration reflects concern about unnecessary performance competition, a stance that aligns well with Volkswagen’s long-standing emphasis on driving safety, he said.</p><p>In response to fierce competition in China’s auto market, Volkswagen is speeding up its strategic transformation. Part of that involves partnering with domestic EV startup Xpeng Motors to jointly develop the China Electrical Architecture, a platform for the electronic and electrical systems in its Chinese cars.</p><p>From next year Volkswagen's three joint ventures in the country will share electrification development platforms, including the CEA. At the same time, Volkswagen Group China Technology based in Hefei, Anhui province will serve as the research and development center responsible for coordinating these efforts, Cisek noted.</p><p>This will help avoid redundant investment while allowing the JVs to tailor products for their specific target users, thereby maximizing synergy, he explained. The JVs are FAW Volkswagen with FAW Group, SAIC Volkswagen with SAIC Motor, and Volkswagen Anhui with JAC Motors.</p><p>Editors: Dou Shicong, Futura Costaglione</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinas-tighter-auto-industry-regulations-benefit-established-carmakers-volkswagen-exec-says",
            "pub_date": "2026-02-28 19:11:43",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Porsche's China Sales Drop for Fourth Straight Year in 2025",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/01/109358565100229.jpg\" id=\"news-body\"><p>(Yicai) Jan. 19 -- Sales of German luxury carmaker Porsche in China have declined for four consecutive years, with last year's figure down 60 percent from a peak in 2021.</p><p>Porsche's China sales plunged 26 percent to around 42,000 units in 2025 from the previous year, according to data the Stuttgart-based carmaker released on Jan. 16. In addition, global sales fell 10 percent to about 279,000 units, the biggest drop since 2009.</p><p>Previously, Porsche China Chief Executive Pan Liqi confirmed the company's plans to reduce the number of authorized sales outlets in the country from 150 in 2024 to 120 by the end of last year and to about 80 by the end of this year.</p><p>Porsche failed to reach the delivery level of 2024 after years of record growth, which was in line with its internal expectations, mainly because supply shortage for the 718 model and the Macan fuel version, Matthias Becker, member of the executive board for sales and marketing, said on Jan. 16. Its strategy of prioritizing per-vehicle profit over simply pursuing sales also had a certain impact, he added.</p><p>With the rapid development of Chinese new energy vehicles, the structure of the local auto market has changed, with some high-end domestic cars diverting the traditional luxury market. In addition, luxury brands have been slow in their electric transition.</p><p>Porsche was the first ultra-luxury brand to launch a battery electric vehicle, releasing the electric version of the Taycan in 2019. However, it did not develop any exclusive models for the Chinese market.</p><p>Last September, Porsche announced it would slow down its electrification process, postponing the launch of some BEV models while planning to roll out more fuel cars and plug-in hybrid EVs.</p><p>Porsche sells the Taycan and the Macan BEVs in China, but their performance has not met expectations. It plans to bring the electric editions of the Cayenne and 718 to the Chinese market this year.</p><p>Porsche China will gradually cease operations of about 200 self-built premium charging stations across the country from March 1, terminating related services and removing them from the charging map in the Porsche App and WeChat mini-program, it said at the end of last year. The move is likely due to the shift in the company's electrification strategy.</p><p>Editor: Martin Kadiev</p></div>",
            "link": "https://www.yicaiglobal.com/news/porsches-china-sales-drop-for-fourth-straight-year-in-2025",
            "pub_date": "2026-02-28 19:11:43",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Technology for Change Asia 2026 to Decode Innovation for Business Growth",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112568497999557.jpg\" id=\"news-body\"><p>(Yicai) Feb. 24 -- Economist Impact will host Technology for Change Asia 2026 from March 11 to 12 in Hong Kong. This premier event convenes over 700 industry and government leaders to pinpoint solutions that will help businesses prosper in an era of rapid technological shift.</p><p>The 2026 program moves beyond hype to address the practical realities of the AI age. Attendees will engage with senior leaders to discuss regulatory divergence across Asia, the scaling of autonomous agents, the Greater Bay Area innovation ecosystem, and the impact of smart mobility on global supply chains.</p><p>\"By convening Technology for Change Asia 2026, and hearing from organizations that are leading the way in technology adoption, we aim to highlight how technology can provide a positive and prosperous way forward,\" Tom Standage, deputy editor of The Economist, said ahead of the event. </p><p>Speakers include Siri's Co-founder Tom Gruber, HSBC Asia's CIO James Elwes, Shangri-La Group's CTO Spencer Lam, Unilever's digital CEO Aseem Puri, and FedEx North-Pacific's Vice-president Jeremy Goldstrich.</p><p>The event is sponsored by Tata Communications, GCash, Ant International and FWD, and supported by The Hong Kong Tourism Board and Invest Hong Kong.</p></div>",
            "link": "https://www.yicaiglobal.com/news/technology-for-change-asia-2026-to-decode-innovation-for-business-growth",
            "pub_date": "2026-02-28 19:11:42",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese Scientists Develop Electrolyte Enabling Lithium Batteries to Operate at Minus 50°C",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112741154478789.jpg\" id=\"news-body\"><p>(Yicai) Feb. 26 -- A Chinese research team has developed a new electrolyte that significantly improves lithium battery performance in ultra-low temperatures, with potential applications in electric vehicles, aerospace, and robotics, according to a study published in Nature.</p><p>The breakthrough addresses a longstanding limitation of lithium batteries, which struggle to maintain performance below minus 50 degrees centigrade. The newly designed electrolyte allows batteries to retain nearly 400 watt-hours per kilogram even at minus 50 degrees centigrade, compared with the 100 to 300 watt-hours per kilogram typical of commercial batteries today.</p><p>The research, published in Nature yesterday, was conducted by scientists from the College of Chemistry at Nankai University and the Shanghai Institute of Space Power-Sources. The team designed a new fluorinated hydrocarbon solvent molecule and built an electrolyte system that replaces the conventional lithium-oxygen coordination mode found in mainstream electrolytes.</p><p>Electrolytes serve as the key medium for conducting charged ions between the positive and negative electrodes of lithium batteries. Current mainstream electrolytes consist of lithium salts and carbonate solvents and rely on interactions between lithium and oxygen atoms in the solvent to facilitate dissolution. However, poor wettability limits battery energy density, while restricted charge transfer capacity at low temperatures prevents operation below minus 50 degrees centigrade.</p><p>To overcome these constraints, the Nankai University team proposed replacing oxygen atoms with fluorine atoms to enhance the effective dissolution of lithium salts in the electrolyte. The resulting lithium battery achieved an ultra-high energy density of 700 watt-hours per kilogram at room temperature and maintained nearly 400 watt-hours per kilogram at minus 50 degrees centigrade, the research showed.</p><p>For comparison, commercial lithium batteries generally offer energy densities between 100 watt-hours per kilogram and 300 watt-hours per kilogram. The 4680 battery developed by electric vehicle maker Tesla, for instance, has an energy density close to 300 watt-hours per kilogram.</p><p>High-energy-density batteries based on the new electrolyte have broad application potential in new energy vehicles, embodied intelligent robots, the low-altitude economy, and aerospace, said Chen Jun, associate president of Nankai University, and one of the corresponding authors of the study.</p><p>Editor: Emmi Laine</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinese-scientists-develop-electrolyte-enabling-lithium-batteries-to-operate-at-minus-50c",
            "pub_date": "2026-02-28 19:11:42",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EU Ends Tax Break for Parcels Below EUR150, Raising Chinese E-Commerce Costs",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112836013182661.jpg\" id=\"news-body\"><p>(Yicai) Feb. 27 -- The Council of the European Union has approved new import duty rules abolishing the long-standing tax exemption for parcels valued below EUR150 (USD177), a move that experts say will fundamentally reshape the cost structure of Chinese cross-border e-commerce exporters.</p><p>The new rules, approved on Feb. 11, will impose an interim flat-rate duty of EUR3 (USD3.50) on each category of goods, identified by tariff sub-headings, contained in parcels valued under EUR150 and sent directly to buyers.</p><p>The measure will take effect on July 1 and remain in force until July 1, 2028, and may be extended if needed. Once the EU’s new customs data hub becomes operational, the interim levy will be replaced by standard customs tariffs.</p><p>The change signals the end of the “volume-driven era” for low-margin e-commerce exports, Zhu Qiuyuan, a law professor at Shanghai Customs College, told Yicai. The cost structure of Chinese cross-border e-commerce will face a complete reset, said Zhu, who is also vice president of the Customs Law Research Association of the Shanghai Law Society.</p><p>The EU imported 4.6 billion e-commerce parcels valued below EUR150 in 2024, with 91 percent originating from China, according to data from the European Parliament. Average daily volume reached 12 million parcels, nearly tripling from 2023 and more than tripling from 2022.</p><p>Under the EU’s plan, it will end the EUR150 customs duty exemption threshold from July 1, 2028, imposing unified tariffs and value-added taxes on all imported goods. It will also introduce a simplified “Duty Buckets” classification system, dividing products into five tax tiers of 0 percent, 5 percent, 8 percent, 12 percent, and 17 percent to further standardize customs administration for cross-border e-commerce.</p><p>Zhu added that a customs handling fee for e-commerce parcels will take effect this November. The fee will be independent of the EUR3 levy, with specific standards and the final implementation date yet to be confirmed.</p><p>Beyond the EU, the United Kingdom announced in its autumn budget last year that it will end the GBP135 (USD182) customs duty relief, with the current exemption set to be withdrawn by March 2029 at the latest.</p><p>The moves by the EU and UK underscore a clear global trend toward reducing or scrapping low-value import tax exemptions, Zhu said, urging cross-border e-commerce firms and their logistics partners to closely monitor policy developments.</p><p>Zhu also suggested that small and mid-sized sellers use professional third-party service providers or jointly hire customs consultants in Europe to share costs and achieve compliance. At the same time, sellers should gradually strengthen their own compliance awareness and capabilities, he added. </p><p>As tax breaks for small parcels get phased out, timely adjustments to pricing, logistics, and product selection strategies, as well as a shift toward higher value-added and compliant operations, will be critical to maintaining a foothold in the European market, Zhu said.</p><p>Editor: Emmi Laine</p></div>",
            "link": "https://www.yicaiglobal.com/news/eu-ends-usd177-small-parcel-tax-break-raising-costs-for-chinese-e-commerce-sellers",
            "pub_date": "2026-02-28 19:11:41",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China’s Luckin Coffee Sees Annual Profit Climb 22% on Store Expansion, Sales Growth",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112828668637893.jpg\" id=\"news-body\"><p>(Yicai) Feb. 27 -- China’s Luckin Coffee posted a 23 percent jump in profit for last year, fueled by rapid store expansion, a higher monthly active customer count, and a rebound in same-store sales.</p><p>Net profit was CNY3.6 billion (USD525 million) in the 12 months ended Dec. 31, the Xiamen-based coffee chain announced yesterday. Revenue soared 43 percent to CNY49.2 billion (USD7.1 billion).</p><p>The earnings were also driven by the price war among China’s delivery platforms. Starting from the second quarter, major platforms began offering big subsidies on freshly made beverages, igniting a fresh growth spurt in the country’s coffee and milk tea markets. Luckin sold 4.1 billion freshly made drinks, which is roughly equivalent to three cups per person in the country.</p><p>The coffee giant opened 8,708 new outlets last year, a 39 percent annual increase, bringing the total number to 31,048. Average monthly active customers surged 31 percent, and the company had more than 100 million for five consecutive months from June. Same-store sales growth at self-operated outlets recovered to 7.5 percent from minus 17 percent the year before.</p><p>Given the high comparative base resulting from generous subsidies from platforms last year, this year’s same-store sales and profit may face some near-term challenges and swings, Chairman and Chief Executive Guo Jinyi said.</p><p>“China's coffee industry is still in its early stages, with significant growth potential,” he said, adding that short-term bumps in the road will not alter the long-term growth trajectory.</p><p>The competitive landscape is changing, though, Guo said. Brands can no longer rely solely on price, a single hit product, or specific marketing campaigns. This year, Luckin plans to continue opening new stores at a \"competitive\" pace, and will shift its pricing approach to “maintaining competitive pricing while expanding the product price range.”</p><p>In the last quarter of 2025, as the fresh drinks market entered its low season and subsidies started to ease, Luckin’s net profit plunged 39 percent from a year earlier to CNY520 million (USD75.8 million). Revenue climbed 33 percent to CNY12.7 billion (USD1.8 billion).</p><p>Quarterly same-store sales and profit were affected by a combination of seasonal factors, changes in the subsidy strategies of delivery platforms, and adjustments in the product mix, all of which were expected, Guo pointed out.</p><p>Editor: Kim Taylor</p></div>",
            "link": "https://www.yicaiglobal.com/news/luckin-coffees-profit-soars-218-last-year-on-store-expansion-stronger-sales",
            "pub_date": "2026-02-28 19:11:41",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Leapmotor, Xpeng, and Xiaomi Are Only Chinese EV Startups to Meet 2025 Delivery Target",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/01/108118358895301.jpg\" id=\"news-body\"><p>(Yicai) Jan. 5 -- Leapmotor Technology, Xpeng Motors, and Xiaomi Auto were the only ones among China’s new energy vehicle startups and legacy automakers’ EV brands to achieve or exceed their annual delivery targets last year.</p><p>Leapmotor's deliveries jumped 103 percent to 596,555 cars in 2025 from the year before, exceeding its 500,000 goal, the Hangzhou-based firm announced on Jan. 1. That put Leapmotor first among China’s EV startups. Xpeng was second with 429,445, a 126 percent surge, versus a targeted 380,000.</p><p>Meanwhile, Xiaomi Auto delivered 410,000, beating its 350,000 goal, according to Chairman and Chief Executive Lei Jun. The car production arm of consumer electronics giant Xiaomi targets 550,000 for this year.</p><p>Li Auto's deliveries fell 19 percent to 406,343 last year, falling short of its 700,000 aim. Those of Nio rose 47 percent to 326,028, though the carmaker achieved only 74 percent of its objective.</p><p>Zeekr Intelligent Technology, the premium electric vehicle unit of Geely Automobile Holdings that manages the Zeekr and Lynk &amp; Co brands, saw sales rise 13 percent to 574,628, fulfilling just 81 percent of its target. Of them, 224,133 were Zeekr and 350,495 were Lynk &amp; Co cars.</p><p>The two EV brands of state-owned Changan Automobile, Deepal and Avatr, sold 333,117 and 128,772 last year, up 37 percent and 75 percent, respectively. Deepal achieved 93 percent of its annual target, and Avatr 59 percent.</p><p>Voyah, the premium EV brand of state-owned Dongfeng Motor Group, logged sales of 150,169, up 75 percent, fulfilling only 75 percent of its target.</p><p>Huawei Technologies' Harmony Intelligent Mobility Alliance, which includes the Aito brand with Seres Group, Luxeed with Chery Automobile, Maextro with JAC Motors, Stelato with BAIC Group, and Shangjie with SAIC Motor, delivered 589,107 EVs, up 32 percent. Huawei did not disclose HIMA’s annual delivery target.</p><p>Editors: Dou Shicong, Futura Costaglione</p></div>",
            "link": "https://www.yicaiglobal.com/news/leapmotor-xpeng-xiaomi-are-only-chinese-ev-startups-to-achieve-2025-delivery-target",
            "pub_date": "2026-02-28 19:06:03",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Used Car Transactions Top 20 Million Units for First Time in 2025",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/01/108936942750405.jpg\" id=\"news-body\"><p>(Yicai) Jan. 14 -- China’s second-hand vehicle transaction volume rose nearly 3 percent last year from the year before, surpassing 20 million units for the first time as rapid growth in the new energy vehicle market and streamlined cross-regional trading boosted activity.</p><p>The total number of used vehicles traded reached 20.1 million units, with transaction value amounting to CNY1.3 trillion (USD186.4 billion), according to data released yesterday by the China Automobile Dealers Association. Second-hand passenger vehicle transactions edged up 0.4 percent to 15.7 million units, while used commercial vehicle trades climbed almost 8 percent to 2.9 million units.</p><p>Amid the fast expansion of NEV consumption in China, the share of second-hand NEV transactions continued to rise. Used NEV trading volume hit 1.6 million units last year, accounting for almost 8 percent of the total, up from nearly 6 percent in the previous year, CADA said.</p><p>China has also been simplifying procedures for cross-regional used vehicle transactions in recent years, further lifting market activity. The proportion of cross-regional second-hand vehicle trades reached almost 35 percent in December, up from a bit more than 30 percent a year earlier.</p><p>As the industry matures, used vehicle prices have shown greater stability. The average transaction price stood at CNY64,500 (USD9,250) in December, up CNY400 (USD57) from November and CNY1,400 (USD201) from a year ago.</p><p>Second-hand vehicles are increasingly becoming the first choice for young first-time car buyers in China due to their cost-effectiveness, according to a report jointly released in December by ByteDance-backed automotive content platform Dongchedi, also known as Dcar, and the China Automotive Technology and Research Center.</p><p>The report noted that young buyers typically purchase used vehicles priced between CNY50,000 and CNY100,000 (up to USD14,331), place the greatest emphasis on vehicle condition and price, and prefer to complete transactions through online platforms.</p><p>Editors: Dou Shicong; Emmi Laine</p></div>",
            "link": "https://www.yicaiglobal.com/news/china-used-car-transactions-top-20-million-units-for-first-time-in-2025",
            "pub_date": "2026-02-28 19:06:02",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Spring Festival Gala Highlights China's Tech Ambitions via Robotics Showcase",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112019028348613.jpg\" id=\"news-body\"><p>(Yicai) Feb.18 -- The Year of the Horse's Spring Festival Gala, the world's most-watched television event, has delivered a powerful statement: China's technological spotlight has decisively shifted to robotics.</p><p>The 2026 gala's Feb.16 night live broadcast augmented its traditional repertoire of song, dance and comedy skits with a high-stakes national showcase for cutting-edge humanoid robots, a vivid symbol of the country's rapid momentum toward a tech-driven future.</p><p>Leading the charge was Unitree Robotics, located in Hangzhou in east China, a returning performer that commanded attention last night. Moving beyond the somewhat stiff dance routines of 2025, its new robots took center stage in a martial arts spectacle, wielding swords and nunchucks alongside human masters from a renowned kung-fu school.</p><p>These robots executed complex maneuvers like drunken boxing, backward obstacle avoidance and backflips, underscoring a leap from demonstrating basic mobility to mastering intricate, culturally rich physical artistry.</p><p>The 2026 gala stunts, supported by AI algorithms and 3D LiDAR, included multiple world firsts: a continuous parkour-style table vaulting sequence, catapulted aerial flips reaching a maximum height exceeding 3 meters, single-leg consecutive aerial flips followed by a two-step wall-run into a backflip, airflare rotation at 7.5 revolutions, and clustered rapid repositioning achieving arbitrary movement speeds of up to 4 meters per second, according to Unitree Robotics.</p><p>\"Unitree should get a robot Olympics going. It would be entertaining, and draw a lot of good attention to how capable humanoid robots are getting,\" Owen Lewis, a science enthusiast, commented on social media platform X in response to the show.</p><p>Another Chinese robotics startup MagicLab, seizing the coveted opening act, set the tone with its human-like machines performing a groundbreaking \"Thomas 360 degree.\" Later, six units synchronized seamlessly with pop stars for a musical number.</p><p>While others showcased physical prowess, Beijing-based Galbot demonstrated its aptitude for performing everyday tasks, from delicately cracking walnuts, picking up glass shards and retrieving items from shelves to folding clothes and skewering sausages for grilling.</p><p>The Galbot robot handled each task with dexterous, natural human-like movements. This capacity for autonomous decision-making and hand-eye coordination signaled that Chinese-designed robotics is moving beyond mere showmanship, instead pointing and shifting toward vast practical applications.</p><p>The most poignant moment of the gala was delivered by Noetix Robotics. Its robots starred in a comedy skit, a throwback to one 30 years ago, when an actress played a whimsical, clumsy robot. This time, she performed alongside authentic humanoids, including a stunningly accurate bionic replica of herself, created in just 30 days.</p><p>The show's classic comedy-of-errors narrative probed a deeper question amid the AI technology wave: human-robot relations. It ultimately affirmed the irreplaceable value of human warmth and connection, suggesting that advanced robotics, rather than replacing humanity, should enhance and reflect our own qualities.</p><p>Noetix's robot, notably, finished second in last year's robot half-marathon in China's capital, following Tien Kung from Beijing.</p><p>This robotics invasion of the gala marks a pivotal cultural and commercial moment. For decades, the event's advertising chronicled China's economic shifts, from bicycles and liquor to home appliances and internet services.</p><p>Now, robots and AI have made inroads into this prime symbolic space, representing the new engine of \"new quality productive forces.\" The performances translated technical jargon like \"embodied AI\" into a visceral, national experience.</p><p>More Chinese robotics firms also took to regional gala stages this year, including the likes of AgiBot, UniX AI and EngineAI, making technology an inescapable part of Chinese New Year celebrations nationwide.</p><p>Last week, AgiBot also staged a global live gala, showcasing a diverse lineup ranging from synchronized dances and comedic skits to magic acts and traditional martial arts.</p><p>A recent industry report revealed that Chinese robotics firms had emerged as the largest producers of humanoid robots worldwide in 2025. AgiBot achieved an annual shipment volume of over 5,100 units, securing a 39-percent share of the global humanoid robot market, followed by two more Chinese tech firms, namely Unitree and UBTECH.</p><p>The year 2026 marks a critical turning point for the robotics industry, with it moving from simply \"handling many tasks with limited proficiency\" to truly \"accomplishing tasks with high performance and achieving practical application,\" said Luo Jianlan, chief scientist at AgiBot.</p><p>China has a clear national strategy in its quest to become a global robotics powerhouse, and the country has drawn attention and admiration from abroad thanks to its robust industrial ecosystems, fast iteration cycles and large-scale deployment capacity, said Dominic Gorecky, co-founder and director of Swiss Smart Factory.</p></div>",
            "link": "https://www.yicaiglobal.com/news/spring-festival-gala-highlights-chinas-tech-ambitions-via-robotics-showcase",
            "pub_date": "2026-02-28 19:06:02",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese Scientists Develop AI Model to Push Deep-Space Exploration",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112487331354309.jpg\" id=\"news-body\"><p><span style=\"background-color:rgb(255,255,255);color:rgb(71,64,79);\">(Yicai) Feb. 23 -- </span>Chinese researchers have developed an artificial intelligence model for astronomical imaging that significantly enhances scientists' ability to peer into the deepest reaches of the cosmos.<br/><br/>A cross-disciplinary research team from Tsinghua University developed the model, named ASTERIS (Astronomical Spatiotemporal Enhancement and Reconstruction for Image Synthesis), using computational optics and AI algorithms.<br/><br/>According to the findings published on Feb. 20 in the journal Science, the model can help extract extremely faint astronomical signals, identify galaxies more than 13 billion light years away and generate the deepest deep-space images ever produced.<br/><br/>Exploring distant, faint celestial objects is crucial to understanding the origin and evolution of the universe. Yet astronomers face a major challenge. Weak signals from remote celestial objects are often obscured by background sky noise and thermal radiation from telescopes.<br/><br/>The study shows that applying the model's \"self-supervised spatiotemporal denoising\" technique to data from the James Webb Space Telescope (JWST) extends observational coverage from visible light at around 500 nanometers to the mid-infrared at 5 micrometers. It also increases the detection depth by 1.0 magnitude, effectively enabling the telescope to detect objects 2.5 times fainter than previously possible.<br/><br/>Using the model, the team identified more than 160 candidate high-redshift galaxies from the \"Cosmic Dawn\" period, roughly 200 million to 500 million years after the Big Bang, tripling the number of discoveries using previous methods, according to Cai Zheng, associate professor at Tsinghua's Department of Astronomy and a member of the research team.<br/><br/>Researchers said the AI model can decode massive volumes of space telescope data and is compatible with multiple observational platforms, giving it the potential to become a universal deep-space data enhancement platform.<br/><br/>Traditional noise-reduction techniques rely on stacking multiple exposures and assume noise is uniform or correlated. In reality, deep-space noise varies across both time and space. ASTERIS addresses this by reconstructing deep-space images as a 3D spatiotemporal volume.<br/><br/>Through \"photometric adaptive screening mechanism,\" the model identifies subtle noise fluctuations and distinguishes them from the ultra-faint signals of distant stars and galaxies.<br/><br/>\"Overall, I think this is a very relevant piece of work that can have an important impact across astronomy,\" one reviewer of the research said.<br/><br/>Faint celestial objects obscured by light noise in astronomical observations can be reconstructed with high fidelity, said Dai Qionghai, professor at Tsinghua's Department of Automation.<br/><br/>Looking ahead, researchers expect the technology to be deployed on next-generation telescopes to help address major scientific questions concerning decoding dark energy, dark matter, cosmic origins and exoplanets.</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinese-scientists-develop-ai-model-to-push-deep-space-exploration",
            "pub_date": "2026-02-28 19:06:02",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nio’s Smart-Driving Chip Unit Nears USD1.5 Billion Valuation in First Fundraiser",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112809460117189.jpg\" id=\"news-body\"><p>(Yicai) Feb. 27 -- Chinese carmaker Nio and its intelligent-driving chip subsidiary GeniTech have reached an agreement with investors in the unit’s first funding round that will value it at nearly CNY10 billion (USD1.5 billion).</p><p>The backers, which include Hefei State-Owned Capital Enterprise Investment, Hefei Haiheng, IDG Capital, China Fortune-Tech Capital, and Yuanhe Puhua, will pay CNY2.3 billion (USD329.2 million) in cash for newly issued shares of GeniTech, better known as Shenji, Nio said yesterday. </p><p>That will give them a collective 27.3 percent stake. Shanghai-based Nio will retain a controlling interest of 62.7 percent, while the remaining 10 percent will stay with the unit’s employee stock incentive program.</p><p>The new funding will help Shenji go on developing and promoting high-end and highly competitive chips, thereby supporting Nio's long-term strategy in the autonomous driving and embodied intelligence sectors, its parent firm noted.</p><p>Last June, Nio spun off its chip business to establish Shenji. In November, the unit teamed up with Axera Semiconductor and OmniVision Integrated Circuits Group to form a joint venture with a registered capital of CNY100 million (USD14.6 million).</p><p>Shenji is the first company in China to have developed five-nanometer automotive-grade chips and achieved large-scale commercialization. In 2024, it launched the Shenji NX9031 chip, which has actual computing power about four times that of Nvidia's Orin-X, with a memory bandwidth of 546 gigabytes per second, which is about twice that of Nvidia's Thor-U, according to Nio’s data.</p><p>More than 150,000 NX9031 chips have been used in Nio-branded cars, including the ET9, ES6, ES8, and EC6, since their release.</p><p>Research and development of the NX9031 cost CNY2.3 billion to CNY3 billion, the same as building about 1,500 battery swap stations, according to Nio Chief Executive William Li. NX9031 chips offer a cost advantage of about CNY10,000 (USD1,450) per vehicle, which is almost five times that of Nvidia's Orin-X, Li said, adding that the cost advantage over domestic rivals may not be as big.</p><p>Li has mentioned several times that Shenji plans to sell and license the NX9031 to other companies. At the start of the year, he also said in a letter to staff that he was proud that Nio had the best chips.</p><p>Nio aims to achieve full-year profitability on the basis of non-generally accepted accounting principles in 2026, Li said at an all-hands meeting held before the Chinese New Year holiday. Analysts believe that using Shenji to attract outside funding and share R&amp;D costs may be a key part of Nio's strategy in reaching that goal.</p><p>Nio’s shares [HKG: 9866] closed 2.5 percent lower at HKG39.60 (USD5.06) each in Hong Kong today. Its New York-listed stock [NYSE: NIO] fell 1.9 percent to USD5.09 yesterday.</p><p>Editor: Futura Costaglione</p></div>",
            "link": "https://www.yicaiglobal.com/news/nios-smart-driving-chip-unit-shenji-nears-usd15-billion-valuation-after-first-financing-round",
            "pub_date": "2026-02-28 19:06:01",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pinglu Canal Set for Early Launch, Slashing Southwest China Shipping Distance",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/02/112827344031429.jpg\" id=\"news-body\"><p>(Yicai) Feb. 27 -- The Pinglu Canal in China’s Guangxi Zhuang Autonomous Region is expected to open to navigation in September, three months earlier than originally scheduled this year, significantly shortening the waterway for cargo from southwest China to reach the sea.</p><p>The canal, navigable for 5,000-tonne vessels, is invested in and constructed by a state-owned developer under Guangxi’s government. It is designed to connect Guangxi’s largest river, the Xijiang River, with the Qinjiang River, which flows into the Beibu Gulf. The project, with a total estimated investment of CNY72.7 billion (USD10.6 billion), will cut inland voyage distances by more than 560 kilometers and reduce logistics costs for companies by enabling cargo to bypass ports in Guangdong’s Pearl River Delta.</p><p>Wei Tao, chairman of the autonomous region known for its rivers and karst formations, announced the earlier opening on Feb. 25 at an on-site meeting for the project. He said the regional government will make every effort to ensure the canal officially opens, and related ceremonies are held during the China-ASEAN Expo in September. Construction of the 134-kilometer canal began in 2022.</p><p>Wu Jian, director of the Regional Development Institute at Guangxi Academy of Social Sciences, told Yicai that machinery products manufactured in the city of Liuzhou previously had to be transported by rail or road to Guangzhou Port for export, resulting in long transportation cycles and high costs. After the canal opens, these goods can be shipped directly by water to Qinzhou Port in the Beibu Gulf, significantly shortening delivery times and lowering logistics expenses.</p><p>Beyond creating a new logistics corridor, Wu said the canal’s completion and operation will reshape the distribution of local industrial belts, attract related industries to cluster along the route, and enhance companies’ product added value and market competitiveness.</p><p>Hao Panfeng, secretary-general of the China Container Industry Association, told Yicai that the Pinglu Canal is effectively a “waterborne expressway,” and its opening will drive the development of logistics, shipping, and industrial systems along the route.</p><p>Wei also stressed that the development of the canal economic belt must have clear positioning and promote coordinated growth of transport corridors, logistics, trade, and industries, leveraging the canal’s advantages in large-scale inbound and outbound flows by developing modern pillar industries along the route.</p><p>Editors: Tang Shihua, Emmi Laine</p></div>",
            "link": "https://www.yicaiglobal.com/news/pinglu-canal-set-for-early-launch-slashing-southwest-china-shipping-distance",
            "pub_date": "2026-02-28 19:06:01",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China’s Auto Sales to Grow by Least in Six Years in 2026, CAAM Says",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/01/109007186967237.jpg\" id=\"news-body\"><p>(Yicai) Jan. 15 -- China’s vehicle sales will likely increase for the sixth straight year this year, supported by the country’s consumption promotion policies, but the growth rate is expected to be the lowest in the period, according to the China Association of Automobile Manufacturers.</p><p>Auto sales in China are expected to grow 1 percent to 34.8 million units this year from the previous year, the CAAM said yesterday. That compared with a 4 percent jump in 2021, 2 percent in 2022, 12 percent in 2023, 5 percent in 2024, and 9 percent last year.</p><p>Sales of passenger cars will likely climb 0.5 percent to 30.3 million units and of commercial autos 5 percent to 4.5 million units in 2026, the CAAM noted. New energy vehicle sales are expected to surge 15 percent to 19 million units, while auto exports may jump 4 percent to 7.4 million units.</p><p>China carried on with national subsidies for trading in consumer goods and renewing equipment for the third straight year in 2026, while the Ministry of Commerce and eight other government agencies recently jointly issued an action plan to promote green consumption, said Chen Shihua, deputy secretary-general of the CAAM, noting that these measures will stabilize market expectations and boost auto consumption.</p><p>Car sales in China declined from 2018 to 2020, impacted by the industry cycle, but have since continuously grown thanks to the rise of domestic NEV makers.</p><p>China’s vehicle production and sales rose to new record highs last year, topping 34.5 million units and 34.4 million units, respectively, while also leading the world for the 17th consecutive year, the CAAM announced. NEV sales soared 28 percent to 16.5 million units, while auto exports jumped 21 percent to 7.1 million units.</p><p>The Chinese auto industry withstood the external pressure from trade protectionism and the restructuring of the global supply chain last year, showing strong resilience and vitality, Chen noted. In particular, NEV sales continued to grow under the combined effect of favorable policies, abundant supply, and improved infrastructure, becoming the dominant force in the domestic car market, Chen pointed out.</p><p>On Jan. 1, China adjusted its 12-year NEV tax exemption policy, halving the purchase tax break to 5 percent from 10 percent, with the maximum exemption per vehicle set at CNY15,000 (USD2,150).</p><p>Retail sales of passenger vehicles in China plunged 32 percent to 328,000 units in the Jan. 1 to 11 period from a year earlier due to the policy change, with NEV sales dropping 38 percent to 117,000 units, according to data from the China Passenger Car Association.</p><p>Editors: Dou Shicong, Martin Kadiev</p></div>",
            "link": "https://www.yicaiglobal.com/news/chinas-auto-sales-to-grow-by-least-in-six-years-in-2026-caam-says",
            "pub_date": "2026-02-28 18:56:50",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shanghai Unveils New Action Plan to Boost Mass Production, Use of Self-Driving Cars",
            "description": "<div data-cover=\"https://img.yicaiglobal.com/src/image/2026/01/109093813527237.jpg\" id=\"news-body\"><p>(Yicai) Jan. 16 -- Shanghai has released a new action plan aiming to build the eastern metropolis into a leading area for high-level self-driving technology by promoting the mass production and large-scale application of fully autonomous vehicles.</p><p>Shanghai strives to start mass producing autos with Level-4 autonomous driving capabilities next year, while vehicles with L2 driver assistance and L3 conditional self-driving functions will account for more than 90 percent of new car production, according to the plan jointly released by the Municipal Economic and Information Commission, the Transportation Commission, and the Public Security Bureau on Jan. 14.</p><p>Shanghai will apply L4 self-driving tech on a large scale in public transportation and freight logistics, with robobuses and robotaxis to serve more than six million passengers and unmanned heavy trucks to move more than 800,000 twenty-foot equivalent units.</p><p>In addition, Shanghai will expand the open area of autonomous driving in an orderly manner to 2,000 square kilometers, exceeding 5,000 kilometers in total length and connecting Hongqiao Transportation Hub, Pudong International Airport, Disney Resort, and other key locations.</p><p>Shanghai became the first city in China to launch closed testing for autonomous driving vehicles in 2016. As of the end of last year, it has opened 3,173 roads with a total length of over 5,200 km for self-driving testing, covering about a third of the city, according to official data.</p><p>China is also actively promoting the mass production and application of high-level autonomous driving tech at the central government level.</p><p>The Ministry of Industry and Information Technology issued the first open road permits to self-driving vehicles last month, allowing Changan Automobile's Deepal SL03 and BAIC BluePark New Energy Technology's Arcfox Alpha S to use their L3 self-driving functions in congested traffic conditions without changing lanes on highways and urban expressways in Beijing and Chongqing.</p><p>Editors: Dou Shicong, Martin Kadiev</p></div>",
            "link": "https://www.yicaiglobal.com/news/shanghai-unveils-new-action-plan-to-boost-mass-production-use-of-self-driving-cars",
            "pub_date": "2026-02-28 18:56:50",
            "source": "yicaiglobal",
            "kind": 1,
            "language": "en"
        }
    ]
}