{
    "data": [
        {
            "title": "BYD Launches ATTO 2 DM-i in Argentina",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>This week, BYD continued its push into South America, where it is the clear EV leader, with a model introduction in <a href=\"https://cleantechnica.com/2026/02/04/latin-america-ev-sales-report-over-100000-units-sold-in-q4/\">one of the most laggard countries</a>, Argentina. The company launched the BYD Atto 2 DM-i there.</p>\n<p>Yes, it is a plugin hybrid, but it does have about 110 km (70 miles) of electric range on a full charge (WLTP). In a country that has barely adopted any BEVs so far, it is clear BYD thinks it best at the moment to offer the mixed powertrain.</p>\n<p>“By seamlessly combining electric performance with high-efficiency hybrid power, BYD ATTO 2 DM-i sets a new benchmark for efficiency, versatility, and sustainable mobility in Argentina,” BYD writes.</p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-3.jpeg\"><img alt=\"\" class=\"aligncenter size-full wp-image-368889\" decoding=\"async\" height=\"1024\" sizes=\"(max-width: 1280px) 100vw, 1280px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-3.jpeg\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-3.jpeg 1280w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-3-400x320.jpeg 400w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-3-800x640.jpeg 800w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-3-768x614.jpeg 768w\" width=\"1280\"/></a></p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-4.jpeg\"><img alt=\"\" class=\"aligncenter size-full wp-image-368890\" decoding=\"async\" height=\"1024\" sizes=\"(max-width: 1280px) 100vw, 1280px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-4.jpeg\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-4.jpeg 1280w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-4-400x320.jpeg 400w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-4-800x640.jpeg 800w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-4-768x614.jpeg 768w\" width=\"1280\"/></a></p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-1.jpeg\"><img alt=\"\" class=\"aligncenter size-full wp-image-368887\" decoding=\"async\" height=\"1024\" loading=\"lazy\" sizes=\"auto, (max-width: 1280px) 100vw, 1280px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-1.jpeg\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-1.jpeg 1280w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-1-400x320.jpeg 400w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-1-800x640.jpeg 800w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-1-768x614.jpeg 768w\" width=\"1280\"/></a></p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-2.jpeg\"><img alt=\"\" class=\"aligncenter size-full wp-image-368888\" decoding=\"async\" height=\"1024\" loading=\"lazy\" sizes=\"auto, (max-width: 1280px) 100vw, 1280px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-2.jpeg\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-2.jpeg 1280w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-2-400x320.jpeg 400w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-2-800x640.jpeg 800w, https://cleantechnica.com/wp-content/uploads/2026/02/BYD-Atto-2-DM-i-Argentina-2-768x614.jpeg 768w\" width=\"1280\"/></a></p>\n<p>BYD hosted 130+ special guests for the launch event in Buenos Aires, “including close to 100 journalists and influencers.” The company noted on social media (the only place it announced this in English) that “BYD Argentina marked a new chapter in the country’s transition to electrified mobility. Following its recognition as the top-selling brand in pure electric and plug-in hybrid vehicles in Argentina in 2025, BYD strengthens its presence with a plug-in hybrid SUV powered by advanced DM-i Super Hybrid technology, created to expand access to new energy vehicles.”</p>\n<p>Will this help Argentina to shoot up the <a href=\"https://cleantechnica.com/tag/latin-america-ev-sales/\">Latin American EV sales charts</a>? Hopefully! Considering the country’s starting point, one would think it has to provide a significant boost.</p>\n\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/byd-launches-atto-2-dm-i-in-argentina/",
            "pub_date": "2026-02-27 16:35:34",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Hyundai Motor Group to Establish Innovation Hub to Lead Robotics, AI, & Hydrogen Energy in…",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<ul class=\"editor-ul\">\n<li>Group signs MoU with Korean government and Jeonbuk State to invest nearly KRW 9 trillion in Saemangeum area of Gunsan City, starting 2026</li>\n<li>Advancing Korea’s transition to robotics, AI-driven and energy-centric future through transformative projects:\n<ul class=\"editor-ul-depth2\">\n<li>AI Data Center: Processing and storing critical data for physical AI implementation in autonomous driving and robotics</li>\n<li>Robotics Manufacturing Cluster: Building in-house production and foundry capabilities while supporting automotive suppliers’ entry into robotics components sector</li>\n<li>PEM Electrolyzer Plant: Producing clean hydrogen as a cornerstone of Korea’s hydrogen economy transition</li>\n<li>Solar Power Infrastructure: Leveraging abundant solar energy to ensure sustainable energy supply for the innovation hub</li>\n<li>AI Hydrogen Smart City: Integrating AI, hydrogen energy, and robotics technologies to create a next generation living ecosystem</li>\n</ul>\n</li>\n<li>Investment expected to generate KRW 16 trillion and create approx. 71,000 jobs in economic effect</li>\n</ul>\n<p><em>SEOUL</em> — Hyundai Motor Group (the Group) announced today it has signed a Memorandum of Understanding (MOU) with the South Korean government and Jeonbuk State to establish an <strong>innovation hub</strong> in the Saemangeum area of Gunsan city.</p>\n<p>This strategic move positions the Group as a <strong>leader in robotics</strong>, <strong>AI and energy solutions</strong>, with plans to invest approximately <strong>KRW 9 trillion</strong> beginning in 2026 to construct a cutting-edge industrial complex. Through this initiative, the Group aims to pioneer the seamless integration of advanced AI and hydrogen energy transformation to advance human progress.</p>\n<p style=\"padding-left: 40px;\"><em>“What we’re building in Saemangeum will reshape not just a region, but Korea’s industrial future. Hyundai Motor Group brings together the manufacturing excellence, AI capabilities, and hydrogen energy expertise needed to establish a truly advanced industrial ecosystem. This is how we translate our commitment to ‘Progress for Humanity’ into reality.”</em> —<strong>Jaehoon Chang, Vice Chair of Hyundai Motor Group</strong></p>\n<p><strong>What is Hyundai Motor Group Planning in Saemangeum?</strong></p>\n<p>The Group will establish a major innovation hub dedicated to advancing robotics, AI, hydrogen energy, solar power and AI-driven smart city solutions. A significant portion of the investment will focus on new businesses based on these technologies, contributing to the development of Korea’s future industrial competitiveness. Through expanded investment across various regions, the Group aims to stimulate local economic growth and lay the foundation for the sustainable growth of Korea and its mobility industry.</p>\n<p><strong>Why Was Saemangeum Chosen for This Investment?</strong></p>\n<p>Saemangeum<sup>1)</sup> is a strategic location for this transformative project due to its abundant renewable energy resources and comprehensive transportation infrastructure, including rail, port and airport connectivity.</p>\n<p>This investment is a core initiative within the <a href=\"https://www.hyundai.com/worldwide/en/newsroom/detail/0000001062\"><strong>Group’s broader plan to invest KRW 125.2 trillion in Korea</strong></a> from 2026 to the end of 2030, announced last year.</p>\n<p><strong>Who Attended the Signing Ceremony?</strong></p>\n<p>The signing ceremony was attended by key government officials and Hyundai Motor Group executives, including:</p>\n<ul class=\"editor-ul\">\n<li><strong>Government Officials: </strong>Jae Myung Lee, President of the Republic of Korea; Kyunghoon Bae, Deputy Prime Minister and Minister of Science and ICT; Yun-duk Kim, Minister of Land, Infrastructure and Transport; Jung-Kwan Kim, Minister of Trade, Industry and Resources; Sungwhan Kim, Minister of Climate, Energy and Environment; Eui-Keum Kim, Administrator of the Saemangeum Development Investment Agency; and Kwan Young Kim, Governor of Jeonbuk State.</li>\n<li><strong>Hyundai Motor Group Representatives:</strong> Euisun Chung, Executive Chair; Jaehoon Chang, Vice Chair; Gang Hyun Seo, President and Head of Corporate Planning Office; Sung Kim, President and Head of Strategy and Planning Division; Juncheul Jung, President and Head of Manufacturing Area; and Eunsook Jin, President and Head of ICT Management Division.</li>\n</ul>\n<p>The investment will be allocated across five key areas:</p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/Hyundai-AI-robotics-center.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368884\" decoding=\"async\" height=\"1202\" sizes=\"(max-width: 1912px) 100vw, 1912px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/Hyundai-AI-robotics-center.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/Hyundai-AI-robotics-center.png 1912w, https://cleantechnica.com/wp-content/uploads/2026/02/Hyundai-AI-robotics-center-400x251.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/Hyundai-AI-robotics-center-800x503.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/Hyundai-AI-robotics-center-768x483.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/Hyundai-AI-robotics-center-1536x966.png 1536w\" width=\"1912\"/></a></p>\n<p>The Group targets the AI data center and solar power infrastructure to break ground in 2027 and reach completion by 2029. The PEM electrolyzer plant is slated to break ground the same year, commence operations in 2029, and undergo phased capacity expansion thereafter. The robotics cluster is expected to begin construction in 2028 and be completed in 2029. The Group is in dialogue with the funding partners, including the Korea evelopment Bank, to structure financing for the project.</p>\n<p><strong>How Will the AI Data Center Advance Physical AI?</strong></p>\n<p>A high-capacity AI data center is central to the strategy, serving as the essential infrastructure for implementing physical AI across autonomous driving and robotics.</p>\n<p>Key features will include:</p>\n<ul class=\"editor-ul\">\n<li><strong>GPU Computing Power:</strong> Phased development scaled to 50,000 units.</li>\n<li><strong>Massive Storage: </strong>For vast amounts of data required for core information learning, Software-Defined Vehicle (SDV) development, and smart factory implementation.</li>\n<li><strong>Integrated Platform:</strong> Creating a virtuous cycle that enhances the speed and stability of research and product development by leveraging critical data across the entire value chain.</li>\n</ul>\n<p>By consolidating and processing large-scale learning requirements across these multiple technological domains, the facility will establish a foundation for accelerating physical AI innovation.</p>\n<p><strong>What Will the Robotics Manufacturing Cluster Entail?</strong></p>\n<p>To implement customer-tailored robotics, the Group will establish a comprehensive robotics manufacturing cluster designed to translate its manufacturing expertise and proven innovation capabilities into advanced production systems. The cluster will:</p>\n<ul class=\"editor-ul\">\n<li>Manufacture approximately <strong>30,000 units annually</strong>, featuring a foundry operation plant and a component supply zone.</li>\n<li>Leverage the Group’s <strong>manufacturing solutions and smart logistics</strong> powered by autonomous guided vehicles (AGVs) and autonomous mobile robots (AMRs).</li>\n<li>Verify and train robots at the <strong>Robot Application Center</strong> — to be established in Korea — using AI-based software validation before deployment, ensuring continuous improvement toward smarter, more reliable systems.</li>\n<li>Support automotive component suppliers’ transition into robotics components manufacturing, strengthening the global competitiveness of Korea’s domestic robotics industry.</li>\n</ul>\n<p><strong>How Will Hyundai Motor Group Catalyze Korea’s Hydrogen Economy?</strong></p>\n<p>Capitalizing on the region’s renewable energy resources, the Group will construct a 200 MW-class <strong>PEM electrolyzer plant</strong> to produce clean hydrogen at scale, establishing Korea’s energy self-sufficiency and accelerating the nation’s transition to a hydrogen economy.</p>\n<p>The facility will deliver:</p>\n<ul class=\"editor-ul\">\n<li><strong>Large-scale hydrogen production</strong> leveraging on-site renewable energy resources.</li>\n<li>Supporting <strong>hydrogen supply infrastructure</strong> including refueling stations and distribution networks.</li>\n<li>Direct supply capability to diverse <strong>future mobility solutions</strong> including trams, buses and demand-responsive transport (DRT) services.</li>\n<li>Foundation for establishing <strong>integrated hydrogen ecosystem</strong> across production, supply, storage and utilization.</li>\n</ul>\n<p>To accelerate Korea’s broader transition to a hydrogen economy, the Group plans to systematically expand electrolyzer capacity across regions, targeting 1 GW total capacity domestically. It has already commenced construction of its Ulsan Fuel Cell Plant for manufacturing PEM electrolyzers and hydrogen fuel cell components, with completion targeted for 2027.</p>\n<p>The Group’s proprietary PEM electrolyzer technology, developed through domestic R&amp;D efforts, has achieved <strong>over 90 percent localization</strong> — a significant milestone establishing Korea’s technological independence and export capabilities in green hydrogen production.</p>\n<p>Through these interconnected investments, the Group is building a comprehensive hydrogen ecosystem that positions Korea as a global leader in clean energy production and hydrogen-powered mobility.</p>\n<p><strong>How Will the Innovation Hub Be Powered Sustainably?</strong></p>\n<p>To power these transformative initiatives and ensure operational sustainability, the Group will develop <strong>a gigawatt-scale of solar power</strong> capacity by 2035.</p>\n<p>The solar portfolio strategy includes:</p>\n<ul class=\"editor-ul\">\n<li>Scaling up from the Group’s existing involvement in the 99 MW solar facility since 2021.</li>\n<li>Providing reliable, predictable baseload power for large-scale data and energy-intensive operations.</li>\n<li>Supporting the Group’s carbon neutrality and RE100 commitments.</li>\n</ul>\n<p><strong>How Will These Technologies Create a AI Hydrogen Smart City?</strong></p>\n<p>The AI Hydrogen Smart City will integrate the Group’s entire technological portfolio into a cohesive industrial ecosystem where AI, hydrogen and robotics converge.</p>\n<p>The city integrates six critical elements through the D.E.S.I.G.N. framework:</p>\n<ul class=\"editor-ul\">\n<li><strong>Demand:</strong> Creating new requirements for power, data, and robotic solutions</li>\n<li><strong>Experience:</strong> Drawing on the Group’s world-class manufacturing expertise</li>\n<li><strong>Supply Chain:</strong> Building integrated robotics and hydrogen energy ecosystems</li>\n<li><strong>Infrastructure:</strong> Leveraging Korea’s transportation, digital and logistics networks</li>\n<li><strong>Government:</strong> Aligning with national strategic priorities and policy initiatives</li>\n<li><strong>Network:</strong> Enabling public-private partnerships and global expansion</li>\n</ul>\n<p>The city will feature:</p>\n<ul class=\"editor-ul\">\n<li>A localized energy system powered by hydrogen produced on-site, leveraging hydrogen power generation technology to enable energy independence across the region</li>\n<li>Deployment of <strong>Physical AI</strong> to enable seamless integration of AI-powered systems across transportation, logistics, safety and daily urban living.</li>\n</ul>\n<p>The Group plans to expand its smart city solutions and urban AI applications globally based on the city-scale demonstration experience gained in Saemangeum.</p>\n<p><strong>What is the Expected Economic Impact of This Investment?</strong></p>\n<p>The Saemangeum investment is projected to generate substantial economic benefits and promote balanced regional development.</p>\n<p>The investment is expected to create:</p>\n<ul class=\"editor-ul\">\n<li><strong>KRW 16 trillion</strong> in total economic impact.</li>\n<li>Approximately <strong>71,000</strong> jobs across direct, indirect and induced employment in Korea.</li>\n</ul>\n<p>The concentration of cutting-edge facilities will position the region as a global innovation hub and generate medium and long-term competitive advantages for Korea’s industrial future.</p>\n<p><strong>What is the Group’s Broader Strategy for AI and Robotics?</strong></p>\n<p>At <strong><a href=\"https://www.hyundai.com/worldwide/en/newsroom/detail/0000001100\">CES 2026</a></strong>, the Group unveiled its <strong>AI Robotics Strategy</strong> to lead the emerging <strong>Physical AI</strong> industry. The Group is strengthening strategic collaborations with industry leaders including <strong>NVIDIA </strong>and <strong>Google DeepMind</strong>, combining world-class automotive manufacturing expertise with cutting-edge AI and hydrogen technologies to lead the transformation of how people work, travel and live in a sustainable future.</p>\n<p>Through this mid-to-long-term investment, the Group expects to advance related industries and contribute to strengthening Korea’s position as a global innovation hub.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/hyundai-motor-group-to-establish-innovation-hub-to-lead-robotics-ai-hydrogen-energy-in-korea/",
            "pub_date": "2026-02-27 16:26:26",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Why Is Hong Kong Ending EV Tax Breaks? Does It Make Sense?",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>Hong Kong has a sizable tax break available for electric vehicle purchases, comparable to what the US had before Donald Trump took office and Republicans took control of the US Congress on the low end. It is HK$58,500 (US$7,477), or a whopping HK$172,500 (US$22,047) if you trade in/scrap on old car.</p>\n<p>However, Hong Kong has decided to end this tax break, and March 31, 2026, is the last day you can qualify for it. But why? Is the Hong Kong government Trump-like, wanting to stop all kinds of cleantech progress?</p>\n<p>Nope. It’s just that the Hong Kong EV market is so advanced that this subsidy is no longer seen as needed. Hong Kong Financial Secretary Paul Chan Mo-po defended the change in policy by noting that 70% of new vehicle sales in Hong Kong are now EVs, and 16% of all registered vehicles there are. The market should take it from here — that’s the idea, anyway. Perhaps it helps that Chinese EVs have become so competitive in every way now.</p>\n<p>Though, there may be no vehicle sales in the second half of the year, as the craze to buy EVs now is apparently absurd. One car dealer told the <a href=\"https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3344754/hongkongers-rush-showrooms-ev-tax-breaks-end-quotas-sell-hk60000\"><em>South China Morning Post</em></a> that EV sales had skyrocketed 17 times over following the decision being made at a Legislative Council meeting. Long lines have formed at dealers, and another dealer told <em>SCMP</em> that a man who could not get in before midnight was crying thinking that he had missed his opportunity, only for the dealer to happily explain that he still had until March 31 to buy an in-stock vehicle. <em>Phew</em>.</p>\n<p>The government of Hong Long still intends to phase out fossil-fueled vehicles by 2035.</p>\n<p>The issue critics of the change have is that keeping the tax breaks in place could lead to a fossil fueled vehicle phaseout quicker, and I don’t see how that could be denied. Keep the tax subsidies and phase out fossil fueled vehicles faster. Why decide that 2035 is fine and to soften longstanding policies when you could just phase out polluting vehicles quicker? “One listener on the program, a taxi driver surnamed Lee, expressed strong dissatisfaction with the abrupt cancellation, stating that it greatly reduces the incentive for drivers like him to switch to electric vehicles,” <a href=\"https://www.thestandard.com.hk/hong-kong-news/article/325336/Policy-has-achieved-its-objectives-Paul-Chan-defends-ending-EV-tax-breaks\"><em>The Standard</em></a> reports. Indeed, I don’t get it. Given the urgency of the climate crisis, if you are leading on cleantech adoption, why not keep leading? Why slow down?</p>\n<p>Still, kudos to Hong Kong for being a clear leader in the sector. It doesn’t get much attention, since it’s a relatively small place and so far away from US and European markets. But a 70% EV adoption rate is right up there near the top of the list globally, only trailing Norway as far as I know. And Hong Kong actually has more residents than Norway! The population of Norway about 5.7 million, while the population of Hong Kong is about 7.4 million people.</p>\n<p>Anyway, will EV adoption slow down in Hong Kong? Or is the market so mature that this will hardly register as a blip? We will see.</p>\n<p><em>Image by <a href=\"https://pixabay.com/users/steven_yu-2625920/?utm_source=link-attribution&amp;utm_medium=referral&amp;utm_campaign=image&amp;utm_content=4370342\">Steven Yu</a> from <a href=\"https://pixabay.com//?utm_source=link-attribution&amp;utm_medium=referral&amp;utm_campaign=image&amp;utm_content=4370342\">Pixabay</a></em></p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/why-is-hong-kong-ending-ev-tax-breaks-does-it-make-sense/",
            "pub_date": "2026-02-27 13:20:33",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Geely & Xiaomi Shine In China — January EV Sales Report",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>After the usual December EV record sales peak in China, which coincided with an end-of-incentive sales rush (NEVs are no longer exempt from purchase tax this year), the year started with an expected sales slump, down by 20%, which sounds like a lot, but considering that the overall market was also down 14% YoY, to 1.5 million units, it doesn’t sound all that bad.</p>\n<p>BEVs were down by 17% YoY in January, to 348,000 units, while the PHEV drop was even harsher (-24%), at 248,000 units. Of these, 76,000 were EREVs, which is one of the few bright spots of January. The extended-range electric vehicle market was actually up 1% YoY, thanks to the popularity of this kind of powertrain in large SUVs, which was the category less affected by the end of incentives.</p>\n<p>This allowed plugin vehicle (PEV) share to start the year at a high 39% (23% BEV), more or less aligned with January ’25, which is good news considering the loss of incentives. Although this score is well below the final 2025 result of 54% PEV share (33% BEV), expect that mark to be achieved sometime in the summer, and the year to end around 60% share. A couple of months in the last quarter of the year should even end above 65% share.</p>\n<p><em>Imagine that — the largest automotive market in the world with a 66% plugin share. <a href=\"http://ev-sales.blogspot.com/2012/12/first-post.html\">These kinds of market shares would be considered a pipe dream when I started reporting EV sales back in 2012….</a></em></p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-ranking-January.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368872\" decoding=\"async\" height=\"1792\" sizes=\"(max-width: 2040px) 100vw, 2040px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-ranking-January.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-ranking-January.png 2040w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-ranking-January-400x351.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-ranking-January-800x703.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-ranking-January-768x675.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-ranking-January-1536x1349.png 1536w\" width=\"2040\"/></a></p>\n<p><strong>In the overall ranking</strong>, as expected, the beginning of the year has ICE models populating the top 10 — seven models in the top 10, in fact. This year, there is a sense that the market is shifting. For starters, we have a brand new model on top, with the Xiaomi YU7 sporty crossover winning the overall trophy for the first time ever. Behind it, there was a small revolution underway. The remaining podium positions went to two Geelys (Geelies?), with the Geely Boyue L ICE winning silver and the Geely Xingyuan hatchback winning bronze.</p>\n<p>Funny enough, the most represented brands in the top 10 were Geely and … Volkswagen(!), with the German make placing three ICE models, giving a certain <em>retro feel</em> to the overall top 10. The AITO M7 was the third plugin model, in 5th.</p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-A-Segment-Leaders-January.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368861\" decoding=\"async\" height=\"933\" sizes=\"(max-width: 2040px) 100vw, 2040px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-A-Segment-Leaders-January.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-A-Segment-Leaders-January.png 2040w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-A-Segment-Leaders-January-400x183.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-A-Segment-Leaders-January-800x366.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-A-Segment-Leaders-January-768x351.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-A-Segment-Leaders-January-1536x702.png 1536w\" width=\"2040\"/></a> <a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-B-Segment-Leaders-January.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368862\" decoding=\"async\" height=\"932\" loading=\"lazy\" sizes=\"auto, (max-width: 2040px) 100vw, 2040px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-B-Segment-Leaders-January.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-B-Segment-Leaders-January.png 2040w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-B-Segment-Leaders-January-400x183.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-B-Segment-Leaders-January-800x365.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-B-Segment-Leaders-January-768x351.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-B-Segment-Leaders-January-1536x702.png 1536w\" width=\"2040\"/></a> <a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-C-Segment-Leaders-January.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368863\" decoding=\"async\" height=\"932\" loading=\"lazy\" sizes=\"auto, (max-width: 2040px) 100vw, 2040px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-C-Segment-Leaders-January.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-C-Segment-Leaders-January.png 2040w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-C-Segment-Leaders-January-400x183.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-C-Segment-Leaders-January-800x365.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-C-Segment-Leaders-January-768x351.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-C-Segment-Leaders-January-1536x702.png 1536w\" width=\"2040\"/></a> <a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-D-Segment-Leaders-January.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368864\" decoding=\"async\" height=\"932\" loading=\"lazy\" sizes=\"auto, (max-width: 2040px) 100vw, 2040px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-D-Segment-Leaders-January.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-D-Segment-Leaders-January.png 2040w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-D-Segment-Leaders-January-400x183.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-D-Segment-Leaders-January-800x365.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-D-Segment-Leaders-January-768x351.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-D-Segment-Leaders-January-1536x702.png 1536w\" width=\"2040\"/></a> <a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-E-Segment-Leaders-January.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368865\" decoding=\"async\" height=\"932\" loading=\"lazy\" sizes=\"auto, (max-width: 2040px) 100vw, 2040px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-E-Segment-Leaders-January.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-E-Segment-Leaders-January.png 2040w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-E-Segment-Leaders-January-400x183.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-E-Segment-Leaders-January-800x365.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-E-Segment-Leaders-January-768x351.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-E-Segment-Leaders-January-1536x702.png 1536w\" width=\"2040\"/></a></p>\n<p>Looking at the best sellers in several size categories, all but the C (compact) and D (midsize) segments have plugins leading each category. In fact, in these two categories, all top three positions were filled by ICE models.</p>\n<p>The biggest surprises were the Geely victories in the C and D segments — from the ICE models Boyue L and Xingyue L, respectively.</p>\n<p>They have beaten the <em>missing in action</em> BYD competition and Tesla Model Y, which haven’t even joined the podium in those size categories! It was a great month for Geely, which placed five representatives on the category podiums, all while BYD had … zero. <em>Nada.</em></p>\n<p>This is a whole letter of intention from Geely. With Geely’s sprawling lineup, albeit still partly relying on ICE (internal combustion engines), the fact is that if BYD thought it had the Chinese market locked in for the next few years, it might have been wrong and Geely could be the one to spoil BYD’s plans…. Maybe already this year.</p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-20-YTD-Model-2026-scaled.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368868\" decoding=\"async\" height=\"2560\" loading=\"lazy\" sizes=\"auto, (max-width: 1766px) 100vw, 1766px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-20-YTD-Model-2026-scaled.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-20-YTD-Model-2026-scaled.png 1766w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-20-YTD-Model-2026-276x400.png 276w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-20-YTD-Model-2026-552x800.png 552w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-20-YTD-Model-2026-768x1113.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-20-YTD-Model-2026-1060x1536.png 1060w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-20-YTD-Model-2026-1413x2048.png 1413w\" width=\"1766\"/></a></p>\n<p>Focusing only on plugins, and illustrating the changing trends of the Chinese EV market, only the Geely Xingyuan has repeated its top 5 presence 12 months later. And all top 5 positions went to five different OEMs. Now that’s what I call (welcome) diversity!</p>\n<p>Here’s a closer look at January’s top 5 best selling models:</p>\n<p><strong>#1 — Xiaomi YU7</strong></p>\n<p>2025’s Car of the Year, Xiaomi’s YU7 continues to impress, registering a near-record <strong>37,869 deliveries</strong> in January and collecting its first monthly best seller award. The YU7 <a href=\"https://carnewschina.com/2025/07/03/beyond-the-numbers-lei-juns-qa-on-xiaomi-yu7/\">got hundreds of thousands of locked-in orders within hours</a>. So, a partial loss of incentives couldn’t slow things down for the sporty crossover, as Xiaomi still has a sizable waiting list for its new star player. The YU7 will surely be a model that will collect plenty of podium presences (and wins?) in the coming months.</p>\n<p><strong>#2 — Geely Geome Xingyuan</strong></p>\n<p><em>A BYD Dolphin for BYD Seagull money —</em> at least, that’s how Geely’s internal memo might have described the Geome Xingyuan when developing its latest hatchback. And with an interesting name, as Xingyuan translates as <em>“wishing upon a star,” </em>is Geely wishing on a star to take BYD’s leadership position? Well, that’s what the Xingyuan did in the B-class category. It obliterated BYD’s models as well as the rest of the competition, without any margin of doubt. What does this hatchback have that makes it so special? Besides all the support that comes from a leading OEM like Geely, it has a rounded, sensible design, somewhere between a Wuling Bingo and a Smart #3. Starting with an 80,000 CNY (+/-$11,000) price, the buyer gets a 30 kWh LFP battery from CATL, which is nothing to write home about until you realise that its price places it closer to the BYD Seagull (70,000 CNY for the 30 kWh version) than the BYD Dolphin (100,000 CNY). In January, the Geely model hit <strong>29,007 </strong>registrations.</p>\n<p><strong>#3 — AITO M7</strong></p>\n<p>The second generation AITO M7 is another example of the progress that Chinese EVs are making. After starting out its career in 2022, with an okay(ish) design and already respectable specs (EREV powertrain, 40 kWh battery), despite being based on an ICE platform, only three years later, in 2025, a brand new generation has launched — with a sleeker design, completely new platform, improved specs (53 kWh battery for the EREV version, 100 kWh for the new BEV version), all for around $35,000. Which is not a bad price for a full size, three row SUV….</p>\n<p><strong>#4 — NIO ES8 </strong></p>\n<p>Thanks to the new generation, the 3rd ever since it was launched in 2018, NIO’s big SUV scored <strong>17,645</strong> registrations in January, providing the startup company its first top 5 finish and much needed volume in its quest to reach profitability. Not exactly cheap — it starts at around $57,000 — the truth is that NIO has thrown everything it has into the new ES8. The company is looking to redefine luxury with its new, huge SUV, now at 5.3 meters. Will this level of sales be sustainable in the future? A year ago, I would say it was unlikely, but with big SUVs being the latest fashion trend in China, and BEVs outrunning PHEVs recently, it could be the case that the ES8 might be the right model at the right time.</p>\n<p><strong>#5 — Fang Cheng Bao Tai 7</strong></p>\n<p>BYD’s premium arm Fang Cheng Bao has a success on its hands. This big <del datetime=\"2026-01-16T16:32:38+00:00\">Land Rover</del> SUV, the Tai (Ti?) 7, scored <strong>17,116 registrations </strong>last month. This <em>Chinese Defender </em>has an EREV powertrain with either 27 or 36 kWh batteries, allowing around 100 km (60 miles) of range — which might not sound much compared to the 52 kWh battery of the Lynk &amp; Co 900, <em>another Land Rover-inspired EREV SUV</em>, 0r the 70 kWh of the Zeekr 9X, the <em>Rolls Royce–inspired</em> flagship EREV SUV from the Geely stable, but then again, the Tai 7 ($25,000) is almost half the price of the Lynk &amp; Co model and almost one third of the price of the Zeekr…. Thanks to a successful boxy design, competitive specs, and a nice interior, for its price range, this is one of those models that just begs to be sent overseas — going after not only the <em>posh SUVs</em> of premium brands, but also the gas guzzling <em>Land Cruisers </em>and <em>Patrols</em> of this world.</p>\n<p>Below the top five, the highlight is the new i6 from Li Auto, ending the month in 6th thanks to a record 29,368 sales. While it could be considered on paper a competitor to the previously mentioned FCB Tai 7, this is a more family-orientated crossover, focused on comfort, luxury, and technology instead of off-road abilities. It should be <em>top 5 material</em> for 2026.</p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/China-EV-Sales-January-2026-Table.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368873\" decoding=\"async\" height=\"1913\" loading=\"lazy\" sizes=\"auto, (max-width: 1389px) 100vw, 1389px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/China-EV-Sales-January-2026-Table.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/China-EV-Sales-January-2026-Table.png 1389w, https://cleantechnica.com/wp-content/uploads/2026/02/China-EV-Sales-January-2026-Table-290x400.png 290w, https://cleantechnica.com/wp-content/uploads/2026/02/China-EV-Sales-January-2026-Table-581x800.png 581w, https://cleantechnica.com/wp-content/uploads/2026/02/China-EV-Sales-January-2026-Table-768x1058.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/China-EV-Sales-January-2026-Table-1115x1536.png 1115w\" width=\"1389\"/></a></p>\n<p>Outside the top 5, we have a few surprises, starting with the Geely Galaxy Starship 7 showing up in 6th with a record 16,883 registrations. Expect the sleek midsize SUV to become the new star player for the brand, and it’s probably hoping to win a couple of top 5 presences soon with this one.</p>\n<p>Proving that full size models were the least affected by the incentive drop, this January we have eight representatives from this category in the top 20. Besides the aforementioned models, we should also highlight the #10 position of the AITO M8. So, the startup make placed two models on the table, all while Great Wall’s premium brand WEY placed its large MPV, the Gaoshan, at #15, and Geely Group placed two of its three behemoth SUVs in the top 20, with the <em>Rolls-Royce-like</em> Zeekr 9X ending the month at #17 while the more humble Geely Galaxy M9 was #18, with 6,592 registrations.</p>\n<p>Still in the Geely stable, Zeekr placed a second model on the table. The 7X midsize SUV showing up at #19, a deserved prize for a model with such a rounded package.</p>\n<p>Closing the table, we have an Aion model. The new i60 crossover gave much needed volume to a make that has seen better days. Will the i60 change Aion’s fortunes?</p>\n<p>Finally, outside the top 20, the highlights come from Wuling. The crossover version of the Wuling Bingo, the Bingo S, ended fewer than 300 units behind the #20 Aion i60, while another Wuling model is ramping up and looking to join the table soon. The Starlight 560 is true to Wuling’s ethos — <em>value for money</em> — as this is a 7-seat compact crossover being sold for $14,000 in its BEV version. It offers a choice of a 60 or 69 kWh LFP battery. Expect this model to be popular, not only in China, but also in a number of export markets.</p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-Brands-ranking-January.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368871\" decoding=\"async\" height=\"1792\" loading=\"lazy\" sizes=\"auto, (max-width: 2040px) 100vw, 2040px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-Brands-ranking-January.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-Brands-ranking-January.png 2040w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-Brands-ranking-January-400x351.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-Brands-ranking-January-800x703.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-Brands-ranking-January-768x675.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Overall-Brands-ranking-January-1536x1349.png 1536w\" width=\"2040\"/></a></p>\n<p>Looking at the overall manufacturer ranking, we have shock and awe — Geely (165,000 units) has beaten the competition and won the January trophy, while BYD (69,000) was only 4th!</p>\n<p>Still more surprising, #9 Nissan was up 14% YoY in a month when everyone else saw falling sales <em>(except … Toyota?!? which was up 4%)</em>. One wonders if this was just a blip, or if the Japanese make has again found a foothold in China.</p>\n<p>Outside this top 10, a few mentions are due for the startups, which continue to grow fast. #12 AITO was up 83% YoY, with 40,000 registrations, while #13 Xiaomi was up 70% YoY, with 30,000 registrations. The highlight, though, was NIO. Thanks to the new ES8, it saw its sales surge 162% YoY, allowing it to be #22 in January, even ahead of #26 Tesla (-45% YoY, with 18,500 registrations).</p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Brands-January.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368869\" decoding=\"async\" height=\"1634\" loading=\"lazy\" sizes=\"auto, (max-width: 2040px) 100vw, 2040px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Brands-January.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Brands-January.png 2040w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Brands-January-400x320.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Brands-January-800x641.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Brands-January-768x615.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-Brands-January-1536x1230.png 1536w\" width=\"2040\"/></a></p>\n<p><strong>In the EV manufacturer ranking</strong>, despite losing half of its share, BYD started the year like it ended the last one, leading the table, with 11.5% share.</p>\n<p>BUT … not only has it seen its market share split in half; it also saw Geely start the year with 10.4% share. So, the top two are separated by just about 1%!</p>\n<p>And, while it might still be too soon to say that Geely will surpass BYD, we could see a race for supremacy in China between these two.</p>\n<p>#3 AITO (6.7%) and #4 Xiaomi (6.5%) seemingly came out of nowhere into the top 5, while last year’s bronze medalist started this year two positions below, in 5th, with 5.4% share. True, it’s not the best start of the year for SAIC’s volume brand, but it could have been worse — after all, 2025’s 4th placed Tesla (slowly fading into irrelevance) and 5th placed Leapmotor are well below the top 5….</p>\n<p>Just outside the top 5, we have #6 Xpeng (4.6%), which is hoping to join the table soon.</p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-OEM-January.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368870\" decoding=\"async\" height=\"1634\" loading=\"lazy\" sizes=\"auto, (max-width: 2040px) 100vw, 2040px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-OEM-January.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-OEM-January.png 2040w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-OEM-January-400x320.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-OEM-January-800x641.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-OEM-January-768x615.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/2026-01-China-Top-OEM-January-1536x1230.png 1536w\" width=\"2040\"/></a></p>\n<p><strong>Looking at the OEM level</strong>, Geely is even closer to BYD, with only 0.3% separating the two OEMs. And with Geely firing on all cylinders, expect the <a href=\"https://en.wikipedia.org/wiki/Taizhou,_Zhejiang\">Taizhou</a>-based OEM to displace BYD sometime in the future….</p>\n<p>SAIC is 3rd, with 9.8% share, profiting from the good results of the MG 4 and Shangjie brand. Added to the volume of the Wuling brand, Shangjie allowed the Shanghai OEM to start the year in 3rd, one position above of what it had a year ago.</p>\n<p>Newcomers to the OEM top 5 are #4 Seres, owner of the AITO brand, and #5 Xiaomi, with 6.7% and 6.5% share, respectively.</p>\n<p>This is more proof that it’s not only foreign OEMs feeling the heat. Tier two Chinese legacy OEMs, like Chery and Changan, are also feeling the pinch in their home market and need good export markets more than ever in order to balance out softening demand at home.</p>\n<p>So, BYD and Geely fighting for #1 and startups eating legacy OEMs’ lunch seem to be two top items on the menu for 2026. Please bring on the popcorn, because this year should be fun to watch!…</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/geely-xiaomi-shine-in-china-january-ev-sales-report-2/",
            "pub_date": "2026-02-27 11:05:43",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "From Mine to Recovery: The Case for Nickel Recycling in Europe",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p style=\"text-align: center;\"><strong>A new study examines the carbon footprint benefits of recycling the critical metal in Europe.</strong></p>\n<p dir=\"ltr\">Scaling battery recycling in Europe will be key to securing a resilient and clean supply of raw materials needed for clean tech in Europe. With significant volumes of scrap and waste batteries becoming available in the coming years, ensuring we have effective capacity in Europe to recover the much needed materials, including nickel, will be vital. How we recycle batteries will be important, ensuring we drive effective, low-carbon processes.</p>\n<p dir=\"ltr\">What is the environmental footprint of recycling nickel compared to mining and processing, and how can we scale recycling technologies in Europe? T&amp;E addresses these questions in this briefing, building on <a href=\"https://www.transportenvironment.org/articles/from-waste-to-value-the-potential-for-battery-recycling-in-europe\">research</a> which showed the potential for battery recycling in Europe.</p>\n<p dir=\"ltr\">Overall, the analysis finds that recovering nickel from batteries generally has a lower carbon footprint than mining and refining nickel. For a typical VW ID4 (77 kWh) with an NMC battery, using European recycled nickel can achieve savings of 1200kg CO<sub>2</sub>e compared to most common primary nickel.</p>\n<p dir=\"ltr\"><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/Europe-hydrometallurgical-recycling.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368859\" decoding=\"async\" height=\"1184\" sizes=\"(max-width: 1590px) 100vw, 1590px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/Europe-hydrometallurgical-recycling.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/Europe-hydrometallurgical-recycling.png 1590w, https://cleantechnica.com/wp-content/uploads/2026/02/Europe-hydrometallurgical-recycling-400x298.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/Europe-hydrometallurgical-recycling-800x596.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/Europe-hydrometallurgical-recycling-768x572.png 768w, https://cleantechnica.com/wp-content/uploads/2026/02/Europe-hydrometallurgical-recycling-1536x1144.png 1536w\" width=\"1590\"/></a></p>\n<p dir=\"ltr\">Nevertheless, the recycling route, and other factors such as plant location, can have a huge impact on the overall carbon emissions of the final nickel sulfate produced:</p>\n<ul class=\"theme-white flex flex-col gap-10 p-8 bg-theme-background-alt md:p-12\">\n<li class=\"flex items-center gap-8 md:items-start\">Hydrometallurgical routes in Europe can reduce the carbon intensity of nickel sulfate by 70% when compared to the dominant primary production routes.</li>\n<li class=\"flex items-center gap-8 md:items-start\">Emissions stemming from electricity constitute around 15-20% of emissions for hydrometallurgy routes.Therefore, the location of the battery recycler employing this technology can also result in significant reductions in total emissions.</li>\n<li class=\"flex items-center gap-8 md:items-start\">Compared to China, hydrometallurgical recycling in Europe is estimated to be 21% lower in emissions.</li>\n</ul>\n<p dir=\"ltr\">Thanks to Europe’s comparatively cleaner grid, Europe can lead the way in low carbon hydrometallurgical recycling. Given the potential in Europe, and the expected feedstock of waste batteries containing nickel to become available, now is the time to ensure Europe has the needed recycling capacity. Nevertheless, the existing recycling capacity across Europe is 10 times below where it needs to be in 2030, with almost half of Europe’s battery recycling plans at risk.</p>\n<p dir=\"ltr\">In order to scale effective and low-emission recycling in Europe, and develop a truly European Single Recycling market, T&amp;E recommends:</p>\n<ul class=\"theme-white flex flex-col gap-10 p-8 bg-theme-background-alt md:p-12\">\n<li class=\"flex items-center gap-8 md:items-start\"><strong>Mainstream and prioritise circularity across policy areas and funding streams:</strong> Recycling should be considered as any other clean tech.</li>\n<li class=\"flex items-center gap-8 md:items-start\"><strong>Ban or significantly limit waste material shipment outside the EU:</strong> to ensure sufficient feedstock for EU recyclers, including nickel, the CEA must prevent material leakage from end-of-life batteries, black mass and related waste products.</li>\n<li class=\"flex items-center gap-8 md:items-start\"><strong>Simplify intra-EU waste shipment rules</strong> to cut costs and administrative burden by further simplifying the Waste Shipment Regulation.</li>\n<li class=\"flex items-center gap-8 md:items-start\"><strong>Implement circularity targets in the EU Batteries Regulation</strong> and ensure they benefit EU recyclers, with an amendment to introduce a local preference.</li>\n</ul>\n<p><em>To find out more, <a href=\"https://www.transportenvironment.org/uploads/files/2026_02_TE_report_nickel_recycling.pdf\">download the study</a>.</em></p>\n<p><em>Article from <a href=\"https://www.transportenvironment.org/articles/from-mine-to-recovery-the-case-for-nickel-recycling-in-europe\">T&amp;E</a>.</em></p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/from-mine-to-recovery-the-case-for-nickel-recycling-in-europe/",
            "pub_date": "2026-02-27 10:30:36",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "EV Sales In Europe Grow As New Car Market Shrinks",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>New car registrations in Europe dropped by nearly 4 percent in January, 2026, as compared to the same month last year. 799,625 new cars were registered across the EU, down from nearly 832,000 in January 2025. That’s the bad news. The good news is that sales of battery electric cars accounted for 19.3 percent of new car sales in Europe last month — up from 14.9 percent in January of 2025.</p>\n<p>José Pontes will be diving much more deeply into the numbers in coming days in our one-of-a-kind European EV sales deep dives. For now, though, we have some of the top-line numbers from the European Automobile Manufacturers Association (ACEA) to play with.</p>\n<p>According to <a href=\"https://www.acea.auto/files/Press_release_car_registrations_January_2026.pdf\">ACEA</a>, “hybrid electric car registrations captured 38.6 percent of the market, making them the preferred choice for consumers in the EU. Meanwhile, the combined market share of petrol and diesel cars fell to 30.1 percent, down from 39.5 percent in January, 2025.”</p>\n<h3 style=\"text-align: center;\">What Is An HEV?</h3>\n<p>“Hybrid electric cars” needs some clarification, as the category includes a number of powertrain choices — some true heroes of the EV revolution and some mere poseurs that pretend to be “green” but are not.</p>\n<p>ACEA includes varying degrees of electrification in its “hybrid electric vehicles” classification — full hybrids, mild hybrids, 48 volt hybrids, and even vehicles using a small electric motor for start/stop assistance or turbocharging (and nothing more). For must of us in the EV space, we scoff at such vehicles, even if they are a little bit cleaner than non-hybrids.</p>\n<p>The ACEA report shows that sales of new fully gasoline-powered cars dropped by 28.2 percent, with the decline affecting all major markets. France saw the steepest drop, with registrations falling by 48.9 percent, followed by Germany — down 29.9 percent, Italy — down 25.5 percent, and Spain — down 22.5 percent. The market share for gasoline-powered cars fell to 22 percent from 29.5 percent in the same month last year. The diesel car market continued its downward trend, with registrations declining by 22.3 percent and reaching a market share of just 8.1 percent.</p>\n<h3 style=\"text-align: center;\">European BEV Sales</h3>\n<p>Sales of battery electric cars by country are all over the place. In Europe’s four largest new car markets, which are responsible for 60 percent of all new car sales, France saw an increase in battery electric sales of 52.1 percent, while sales in Germany were up 23.8 percent. In Belgium, however, BEV sales were down 11.5 percent and, the Netherlands saw a decline of 35.4 percent.</p>\n<p>Germany remains Europe’s largest market with 42,692 electric car sales, ahead of France with 30,307 BEV sales and the UK at 29,654 BEV sales. Denmark recorded a notable increase of 52.7 percent, with a total of 10,618 electric cars sold in January. The Netherlands, with 7,165 BEV sales, was down from 11,089 the previous year and now lags behind Italy, which recorded BEV sales growth of 40.7 percent with 9,423 cars sold, and even Ireland, where 7,305 new BEVs represented a 48.4 increase over a year ago.</p>\n<p>The highest growth was recorded in Poland, with a 216.1% increase. Although, it should be noted that the numbers in that country are small — 1,121 last January and 3,544 this year. Croatia also saw substantial growth, with registrations doubling from 69 to 138 electric cars. Lithuania experienced growth of 65.2 percent — from 161 to 266 BEV sales. In Finland, BEV sales rose from 1,641 to 2,505 — a 52.7 percent increase.</p>\n<h3 style=\"text-align: center;\">Tesla Sales Decline</h3>\n<p><img alt=\"\" class=\"aligncenter size-full wp-image-338158\" decoding=\"async\" height=\"667\" sizes=\"(max-width: 1200px) 100vw, 1200px\" src=\"https://cleantechnica.com/wp-content/uploads/2024/08/2022.04-Tesla-Model-Y-Barcelona-spain-eu-europe-urban-CleanTechnica-logo-watermark.jpg\" srcset=\"https://cleantechnica.com/wp-content/uploads/2024/08/2022.04-Tesla-Model-Y-Barcelona-spain-eu-europe-urban-CleanTechnica-logo-watermark.jpg 1200w, https://cleantechnica.com/wp-content/uploads/2024/08/2022.04-Tesla-Model-Y-Barcelona-spain-eu-europe-urban-CleanTechnica-logo-watermark-400x222.jpg 400w, https://cleantechnica.com/wp-content/uploads/2024/08/2022.04-Tesla-Model-Y-Barcelona-spain-eu-europe-urban-CleanTechnica-logo-watermark-800x445.jpg 800w, https://cleantechnica.com/wp-content/uploads/2024/08/2022.04-Tesla-Model-Y-Barcelona-spain-eu-europe-urban-CleanTechnica-logo-watermark-768x427.jpg 768w\" width=\"1200\"/></p>\n<p>In its statistics for manufacturers, ACEA does not differentiate by powertrain type. Tesla stands alone as the only manufacturer offering only battery electric cars for sale in Europe. According to ACEA, Tesla registered 7,187 new cars in the EU in January 2026 — 1.6% fewer than the previous January in which Tesla sold 7,305 cars. As a result, <a href=\"https://cleantechnica.com/2026/02/17/teslas-change-in-market-share-in-13-european-countries/\">Tesla’s market share</a> in the overall new car market in Europe in January was just 0.9 percent.</p>\n<p>Rico Luman, senior economist for transport and logistics at Dutch bank ING, told <em>CNBC</em> by email that January’s performance marks another “very weak” start of the new year for the company. “Tesla’s image has deteriorated in Europe last year and people have much more choice now with the range of new affordable EVs — from BYD, MG, and ZEEKR — entering the market, while Tesla lacks new models,” he added.</p>\n<p>Tesla’s focus on autonomous driving, rather than introducing new vehicles and expanding its range of mass models, is likely a factor too, Luman said. “Another thing in Europe is that large numbers of first generations of Tesla’s are remarketed at the moment (after being leased for 4-6 years), this has driven second hand prices down,” Luman said, adding that there’s an abundance of competitively priced Tesla’s available on the used market.</p>\n<p>Tesla has faced challenges in Europe, including robust competition from Chinese car brands. It’s also struggled to shake off reputational damage from Musk’s rhetoric and close relationship with the Trump administration. Protests erupted at Tesla dealerships across Europe last year at the height of Musk’s involvement with the hateful policies foisted off on and from America by the administration.</p>\n<h3 style=\"text-align: center;\">BYD Shines</h3>\n<p>BYD continued its <a href=\"https://cleantechnica.com/2025/12/24/byd-rises-in-europe-as-tesla-falls-more-than-tripling-sales/\">rapid growth in Europe</a> at the start of 2026. According to the latest ACEA data, new car registrations for the company rose to 18,242 in January — a 165 percent increase from a year ago. BYD has more than doubled its market share in Europe, hitting 1.9 percent last month, which was up substantially from 0.7 percent in January of last year.</p>\n<p>Michael Field, chief equity strategist at Morningstar, told <em>CNBC</em> one of the main problems for companies such as Tesla is that Chinese automakers like BYD have an insurmountable cost advantage. “The big question now is ‘will this trend continue?’ The answer, unfortunately for European automakers and Tesla, is yes,” Field told <em>CNBC</em> by email.</p>\n<p>“Even looking 5 years out, we don’t believe the cost advantage will be completely breached because of China’s structurally lower labor costs,” he continued. “There is some good news, however, that European automakers and Tesla are learning. The cost gap in terms of battery and auto production is slowly closing, and these firms are introducing more models at lower price points, which should help reduce the hemorrhage in market share.”</p>\n<p>Zachary today has written about <a href=\"https://cleantechnica.com/2026/02/26/tesla-situation-in-china-doesnt-look-rosy/\">Tesla sales in China</a>, where the news is also not good.</p>\n<h3 style=\"text-align: center;\">Hurray For Cars With Plugs!</h3>\n<p>There is a lot of slippage in statistics, of course. Government policies can swing wildly from year to year, leaving manufacturers scrambling to catch up. Non-economic forces — such as the well deserved opprobrium for Elon Musk, who has shown his true colors as a white supremacist and advocate for authoritarian governments — can also have a powerful affect on sales.</p>\n<p>The takeaway from these numbers for January may well be less about how many cars with plugs were sold and more about how sales of conventional cars with gasoline and diesel engines are steadily declining. Nothing makes us happier at <em>CleanTechnica</em> than news of a reduction in demand for fossil fuels.</p>\n<p>If Elon chooses not to press his first mover advantage, that’s on him. But the rest of the world seems slowly but surely to be making the transition to driving on electrons instead of molecules, and that is the best news of all.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/ev-sales-in-europe-grow-as-new-car-market-shrinks/",
            "pub_date": "2026-02-27 01:50:27",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Energy Dispensed On Rubicon’s Charging Network In South Africa Up 142% In 2025 To 625MWh",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p><span style=\"font-weight: 400;\">Charging infrastructure has been growing nicely in South Africa. According to Rubicon’s annual report for 2025, by mid-2025, there were over 500 public stations operational in South Africa from all the various charge point operators. This growth helped maintain a favorable EV-to-charger ratio of 1:7, better than the global 1:10 benchmark. The report adds that this growth has primarily been driven by private initiatives. Some examples are Zero Carbon Charge launching off-grid solar-powered stations, including in rural areas like Wolmaransstad, while BYD announced plans for 200-300 megawatt-level chargers by end-2026, with initial rollouts in 2025. Eskom piloted 10 stations at five sites and procured 20 EVs for its fleet, aiming for full electrification by 2040.</span></p>\n<p><span style=\"font-weight: 400;\"><a href=\"https://www.rubicon.tech/\">Rubicon</a> is one of the major players in South Africa’s electric mobility ecosystem</span><span style=\"font-weight: 400;\">. Rubicon’s network is currently composed of 103 public charging stations, and 20 charging stations at the various OEM partner dealerships. Rubicon now has a total installed capacity of 6,648kW (public ones making up 5,632kW, and chargers at car dealerships making up 1,016kW). Rubicon says another 77 (11 DC + 66 AC) stations are to be added by the end of FY2027. Rubicon says its charging network handled 21,606 transactions in 2025, up 159% from 8,338 in 2024. This corresponded to 625MWh of energy dispensed in 2025, up from 258MWh in 2024. This 625MWh of energy dispensed in 2025 is equivalent to 3,125,000km (or 78 times around the globe) of electric travel.</span></p>\n<p><span style=\"font-weight: 400;\">Rubicon adds that some of the highlights of the year included:</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Launch of credit card payments and installed first 30 terminals</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Launch of Fleet Charge Cards and on-boarded first fleet customers</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Appointed as Geely charge partner</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Appointed as Jameel Motors (Changan/Deepal) charge partner(cards &amp; chargers)</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Appointed as Stellantis charge partner(cards &amp; chargers)</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Appointed as Jaguar/Land Rover charge partner</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Preferred charge partner to DongFeng(E Auto Motors)</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Selected as preferred charging provider for Hyprop Properties</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Enabled electric travel in and through the Eastern Cape with AIDC project</span></li>\n</ul>\n<p><span style=\"font-weight: 400;\">Some interesting insights on customer charging behavior are as follows:</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Customers spent a total of 1,054,986 minutes or 17,583 hours charging on Rubicon’s network.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Most charging takes place at DC chargers –19,961 DC sessions vs 1,785 AC sessions.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">DC charging at malls is the leading preference for EV drivers, followed by DC charging at fuel stations and then DC charging at dealerships.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The most popular times of the day to charge are between 10h00 –13h00 (I found this to be an interesting time to be a favorite of many to charge).</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Average charge duration was 70.74 minutes.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The average energy dispensed per charge session was 21.58kWh.</span></li>\n</ul>\n<p><span style=\"font-weight: 400;\">You can tell that range anxiety is still an issue that is on many people’s minds in South Africa from last year’s vehicle sales performance. Plug-in hybrids are the hottest thing in South Africa right now in terms of sales growth. Sales of plug-in hybrids (PHEVs) were up 280% in 2025 compared with sales figures from 2024. In total, 738 PHEVs were sold in 2024 and 2,808 PHEVs were sold in 2025 in the passenger vehicle segment in South Africa. The overall new vehicle sales market was up 16%, as 596,818 units were sold in South Africa in 2025. That means PHEVs had a market share of just 0.47%. </span></p>\n<p><span style=\"font-weight: 400;\">Over the past couple of years, plugless traditional hybrid electric vehicles (HEVs) had been more popular on the South African market, with very little action on the PHEV side of things, but a shift seems to be starting now, with HEV sales down 6% in 2025. 13,552 HEVs were sold in South Africa in 2024, compared with 12,751 HEVs sold in 2025. BEVs, on the other hand, did not have a great year in South Africa. Only 1,018 passenger battery-electric vehicles were sold in South Africa last year, down 17% from 1,231 in </span><a href=\"http://2024.so\"><span style=\"font-weight: 400;\">2024.</span></a><span style=\"font-weight: 400;\"> So it seems more people are going for the “safer option” with the insurance of an ICE engine as backup for driving range, hence PHEV sales are growing faster than BEV sales.</span></p>\n<p><span style=\"font-weight: 400;\">The good news is more plug-in vehicle options are now available in South Africa. 2025 saw the rise of Chinese OEMs, enhancing affordability to a certain extent. Some of the models included models from BYD like the Dolphin Surf (under R400,000), Shark PHEV and Sealion 5, 6, &amp; 7, while Chery introduced the Tiggo7 &amp; 9 PHEV, Omoda C7 and C9SHS PHEV and Jaecoo S7SHS. Stellantis introduced the LeapmotorC10 SUV, the Alfa Romeo Junior, and Jameel Motors introduced the Changan Hunter REEV and Deepal SO7. Geely, BYD’s largest rival, also launched in South Africa in 2025 with the E5 BEV and E5 EM-i (PHEV), while DongFeng entered the market with the Box and 007. The Volvo (XC90) and the BMWiX1 and iX3 also entered the market in 2025. Over 12 sub-R1 million EVs were available by year-end, and six new in 2025, which gives consumers more options in this price range. </span></p>\n<p><span style=\"font-weight: 400;\">2026 promises more models as Toyota confirmed three BEVs for early 2026, while Jetour, Geely, BMW, and Volvo have all confirmed several expansions to their current lineup. New brands such as Denza, iCaur, Lepas Zeekr, Riddara, and Farizon have also been confirmed for launch in 2026 by the mother companies (BYD, Geely, &amp; Chery).  I hope with this news of growing charging infrastructure from the likes of Rubicon and its  peers, more South Africans will make the switch to electric. Ryan Jarret takes BEVs on <a href=\"https://www.youtube.com/watch?v=jBBOcnlZpQg\">exciting road trips across South Africa</a> and showcases that it is now quite easy to go on all the popular cross country routes in electric vehicles</span><span style=\"font-weight: 400;\">. More awareness programs are needed to educate consumers and build confidence in the market to help accelerate the adoption of electric vehicles in South Africa.</span></p>\n<p> </p>\n<p><em>Image courtesy of Rubicon</em></p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/energy-dispensed-on-rubicons-charging-network-in-south-africa-up-142-in-2025-to-625mwh/",
            "pub_date": "2026-02-27 00:56:14",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Biden’s Green New Deal Jacked Up Manufacturing Construction in USA, Trump Killing It",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>There was no doubt about it — the Green New Deal, aka Inflation Reduction Act of 2022, was the biggest reshoring legislation in the history of the United States, and the biggest boost to blue collar manufacturing jobs the United States had seen in many decade. I remember EV battery factories and solar factories being announced immediately, as well as more EV production lines, battery mineral mining and refining projects, and a variety of other cleantech projects.</p>\n<p>Indeed, in the following years, US manufacturing construction rose enormously, approximately tripling from 2021 to 2024. This is not an abstract “well, it could be this or it could be that” matter. The Green New Deal, which actually also included the Bipartisan Infrastructure Law (which was really not that bipartisan in Congress, even if its elements were among the normal public), was very focused on stimulating a much bigger manufacturing economy for the core energy and tech industries of the 21st century. And these industries responded.</p>\n<p>But who expected that if Biden or another Democrat didn’t remain in office, the next administration would try to tear everything down? Clearly, no one would step in and make such dramatic anti-business moves as killing big cleantech projects, raiding battery factories and throwing the workers there in immigration prisons (even if “just” temporarily), and trying to claw back federal funding that was already approved. No politician would be so blatantly anti-business, taking a sledgehammer to the trust and consistency that any good economy is based on. Ah, well, who thought Donald Trump could be elected president again?</p>\n<p>The result is that we’re already seeing manufacturing construction spending drop. The big manufacturing construction boom is over, and it’s time for a Republican-led decline again. (Perhaps it’s not coincidental that the Republican Party’s color is red….)</p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-Steve-Rattner.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368837\" decoding=\"async\" height=\"1257\" sizes=\"(max-width: 1173px) 100vw, 1173px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-Steve-Rattner.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-Steve-Rattner.png 1173w, https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-Steve-Rattner-373x400.png 373w, https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-Steve-Rattner-747x800.png 747w, https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-Steve-Rattner-768x823.png 768w\" width=\"1173\"/></a></p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-FRED.png\"><img alt=\"\" class=\"aligncenter size-full wp-image-368838\" decoding=\"async\" height=\"657\" sizes=\"(max-width: 1173px) 100vw, 1173px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-FRED.png\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-FRED.png 1173w, https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-FRED-400x224.png 400w, https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-FRED-800x448.png 800w, https://cleantechnica.com/wp-content/uploads/2026/02/US-manufacturing-construction-spending-FRED-768x430.png 768w\" width=\"1173\"/></a></p>\n<p>There is really nothing surprising about this. The only surprising thing is that, for my entire life (40+ years), Republican presidents have hurt the US economy, done damage to the US middle class and working class, completely defrauded voters with false claims of being better for the economy, and yet they continue to get people voting for them and thinking the real economy will boom under them.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/bidens-green-new-deal-jacked-up-manufacturing-construction-in-usa-trump-killing-it/",
            "pub_date": "2026-02-27 00:25:37",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Tesla Situation in China Doesn’t Look Rosy",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>Two weeks ago, I wrote about a shocking January for Tesla in China. <a href=\"https://cleantechnica.com/2026/02/12/teslas-sales-in-china-drop-45-year-over-year/\">The company’s sales were down 45% year over year</a>. 45%! There’s no excuse that it was January and January is a slow month — we’re comparing to January 2025! And even January 2025 wasn’t great. Tesla delivered 18,485 vehicles in January 2026, dropping from 33,703 in January 2025, in the world’s biggest EV market.</p>\n<p>There was still the question of whether, for some reason, Tesla had shifted its delivery patterns and would end the quarter strong in China. Well … that’s not looking likely.</p>\n<p>Reporting out of China indicates that customer delivery wait times are historically low. If you order a Tesla today in China, you can receive your vehicle within one to three weeks. Tesla is not sold out for the quarter, not even close. In fact, now buyers are waiting for some super-competitive discounts or bonus offers in order to stimulate sales, since they know Tesla has plenty of capacity and needs to move a lot more units before the end of the quarter.</p>\n<p>Tesla has just extended some incentives to March 31 — ultra-low interest rates for 7-year financing packages and interest-free financing for 5-year financing packages. Yeah, if those make your eyes pop out a bit and trigger thoughts of financial bubbles caused by overextended, overly aggressive financing strategies, you’re in the same boat as me.</p>\n<p>Remember that the Chinese government stepped in and required that no one sell new vehicles below the cost of producing them in order to try to get the EV price war in the country under control. Tesla can’t cut costs much to jack up sales, but I guess it can still offer wild financing packages to try to get reticent, more price-sensitive buyers over the line.</p>\n<p>We’ll see what happens in a little over a month, but you have to really be stubborn to not see bright yellow warning flags for Tesla in China right now. In a market that is ultra-competitive and constantly getting excited about the latest tech and constantly evolving EV offerings, Tesla hasn’t brought anything really new to the market in a long time.</p>\n<p>Maybe Chinese consumers come through with a swarm of last-minute purchases. We’ll see. I think what Tesla bulls are banking on now is simply “Full Self Driving” getting better and getting rolled out in China. This is what all the hope centers around in order to revive sales. But how many are starting to seriously worry about Tesla vehicle demand in the here and now?</p>\n<p>The thing that doesn’t make sense to me is that Tesla could have been working on new models and significant updates at the same time that it’s been working on improving FSD, but Elon Musk decided that just wasn’t worth doing. It’s all about autonomous driving, only about autonomous driving, and that’s the end of the debate. For anyone wanting something else, “<em>No soup for you!</em>” (A <em>Seinfeld</em> reference for those who were lucky enough to enjoy the ’90s.) I also think that Musk and team just decided the Model Y and Model 3 were so popular that they could just rest on their laurels. It seems like Musk thought demand for these models could only go up, and greater model diversity wasn’t needed. Tesla didn’t need to play by normal auto industry rules. Yes, that was true a decade ago, but it’s clearly not true at the moment. But, again, we come back to the main point — it’s all about autonomy. Once the self-driving nut is cracked, nothing else matters. Demand will be infinite. And that should happen in about two weeks.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/tesla-situation-in-china-doesnt-look-rosy/",
            "pub_date": "2026-02-26 23:40:43",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "NIO Inc.’s Subsidiary Enters into Definitive Agreements for RMB2.257 Billion Investment",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p align=\"justify\"><em>SHANGHAI, China</em> — NIO Inc. (NYSE: NIO; HKEX: 9866; SGX: NIO) (“NIO” or the “Company”), a pioneer and a leading company in the global smart electric vehicle market, today announced that the Company and GeniTech Co., Ltd. (“Shenji”), a subsidiary of the Company, entered into definitive agreements with certain investors in China (the “Shenji Investors”), pursuant to which the Shenji Investors will invest an aggregate of RMB2.257 billion in cash to subscribe for Shenji’s newly issued shares (the “Investment Transaction”). Shenji is primarily responsible for NIO’s intelligent-driving chip related business. The Investment Transaction is subject to customary closing conditions. Upon completion of the Investment Transaction, a subsidiary of NIO will continue to hold a controlling equity interest of 62.7% in Shenji and NIO will continue to consolidate its financial results. The Shenji investors will collectively hold 27.3% of Shenji’s equity interest. Certain entities holding shares to administer Shenji’s share incentive plan will collectively hold the remaining 10.0% of Shenji’s equity interest.</p>\n<p align=\"justify\"><strong>About NIO Inc.</strong></p>\n<p align=\"justify\">NIO Inc. is a pioneer and a leading company in the global smart electric vehicle market. Founded in November 2014, NIO aspires to shape a sustainable and brighter future with the mission of “Blue Sky Coming”. NIO envisions itself as a user enterprise where innovative technology meets experience excellence. NIO designs, develops, manufactures and sells smart electric vehicles, driving innovations in next-generation core technologies. NIO distinguishes itself through continuous technological breakthroughs and innovations, exceptional products and services, and a community for shared growth. NIO provides premium smart electric vehicles under the NIO brand, family-oriented smart electric vehicles through the ONVO brand, and small smart high-end electric cars with the FIREFLY brand.</p>\n<p align=\"justify\"><strong>Safe Harbor Statement</strong></p>\n<p align=\"justify\">This press release contains statements that may constitute “forward-looking” statements pursuant to the “safe harbor” provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as “will,” “expects,” “anticipates,” “aims,” “future,” “intends,” “plans,” “believes,” “estimates,” “likely to” and similar statements. NIO may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission (the “SEC”), in its annual report to shareholders, in announcements, circulars or other publications made on the websites of each of The Stock Exchange of Hong Kong Limited (the “SEHK”) and the Singapore Exchange Securities Trading Limited (the “SGX-ST”), in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including statements about NIO’s beliefs, plans and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: NIO’s strategies; NIO’s future business development, financial condition and results of operations; NIO’s ability to develop and manufacture vehicles of sufficient quality and appeal to customers on schedule and on a large scale; its ability to ensure and expand manufacturing capacities including establishing and maintaining partnerships with third parties; its ability to provide convenient and comprehensive power solutions to its customers; the viability, growth potential and prospects of the battery swapping, BaaS, and NIO Assisted and Intelligent Driving and its subscription services; its ability to improve the technologies or develop alternative technologies in meeting evolving market demand and industry development; NIO’s ability to satisfy the mandated safety standards relating to motor vehicles; its ability to secure supply of raw materials or other components used in its vehicles; its ability to secure sufficient reservations and sales of its vehicles; its ability to control costs associated with its operations; its ability to build its current and future brands; general economic and business conditions globally and in China and assumptions underlying or related to any of the foregoing. Further information regarding these and other risks is included in NIO’s filings with the SEC and the announcements and filings on the websites of each of the SEHK and SGX-ST. All information provided in this press release is as of the date of this press release, and NIO does not undertake any obligation to update any forward-looking statement, except as required under applicable law.</p>\n<p align=\"justify\">For more information, please visit: http://ir.nio.com</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/nio-inc-s-subsidiary-enters-into-definitive-agreements-for-rmb2-257-billion-investment/",
            "pub_date": "2026-02-26 22:05:22",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        }
    ]
}