{
    "data": [
        {
            "title": "Tesla Situation in China Doesn’t Look Rosy",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>Two weeks ago, I wrote about a shocking January for Tesla in China. <a href=\"https://cleantechnica.com/2026/02/12/teslas-sales-in-china-drop-45-year-over-year/\">The company’s sales were down 45% year over year</a>. 45%! There’s no excuse that it was January and January is a slow month — we’re comparing to January 2025! And even January 2025 wasn’t great. Tesla delivered 18,485 vehicles in January 2026, dropping from 33,703 in January 2025, in the world’s biggest EV market.</p>\n<p>There was still the question of whether, for some reason, Tesla had shifted its delivery patterns and would end the quarter strong in China. Well … that’s not looking likely.</p>\n<p>Reporting out of China indicates that customer delivery wait times are historically low. If you order a Tesla today in China, you can receive your vehicle within one to three weeks. Tesla is not sold out for the quarter, not even close. In fact, now buyers are waiting for some super-competitive discounts or bonus offers in order to stimulate sales, since they know Tesla has plenty of capacity and needs to move a lot more units before the end of the quarter.</p>\n<p>Tesla has just extended some incentives to March 31 — ultra-low interest rates for 7-year financing packages and interest-free financing for 5-year financing packages. Yeah, if those make your eyes pop out a bit and trigger thoughts of financial bubbles caused by overextended, overly aggressive financing strategies, you’re in the same boat as me.</p>\n<p>Remember that the Chinese government stepped in and required that no one sell new vehicles below the cost of producing them in order to try to get the EV price war in the country under control. Tesla can’t cut costs much to jack up sales, but I guess it can still offer wild financing packages to try to get reticent, more price-sensitive buyers over the line.</p>\n<p>We’ll see what happens in a little over a month, but you have to really be stubborn to not see bright yellow warning flags for Tesla in China right now. In a market that is ultra-competitive and constantly getting excited about the latest tech and constantly evolving EV offerings, Tesla hasn’t brought anything really new to the market in a long time.</p>\n<p>Maybe Chinese consumers come through with a swarm of last-minute purchases. We’ll see. I think what Tesla bulls are banking on now is simply “Full Self Driving” getting better and getting rolled out in China. This is what all the hope centers around in order to revive sales. But how many are starting to seriously worry about Tesla vehicle demand in the here and now?</p>\n<p>The thing that doesn’t make sense to me is that Tesla could have been working on new models and significant updates at the same time that it’s been working on improving FSD, but Elon Musk decided that just wasn’t worth doing. It’s all about autonomous driving, only about autonomous driving, and that’s the end of the debate. For anyone wanting something else, “<em>No soup for you!</em>” (A <em>Seinfeld</em> reference for those who were lucky enough to enjoy the ’90s.) I also think that Musk and team just decided the Model Y and Model 3 were so popular that they could just rest on their laurels. It seems like Musk thought demand for these models could only go up, and greater model diversity wasn’t needed. Tesla didn’t need to play by normal auto industry rules. Yes, that was true a decade ago, but it’s clearly not true at the moment. But, again, we come back to the main point — it’s all about autonomy. Once the self-driving nut is cracked, nothing else matters. Demand will be infinite. And that should happen in about two weeks.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/tesla-situation-in-china-doesnt-look-rosy/",
            "pub_date": "2026-02-26 23:40:43",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "NIO Inc.’s Subsidiary Enters into Definitive Agreements for RMB2.257 Billion Investment",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p align=\"justify\"><em>SHANGHAI, China</em> — NIO Inc. (NYSE: NIO; HKEX: 9866; SGX: NIO) (“NIO” or the “Company”), a pioneer and a leading company in the global smart electric vehicle market, today announced that the Company and GeniTech Co., Ltd. (“Shenji”), a subsidiary of the Company, entered into definitive agreements with certain investors in China (the “Shenji Investors”), pursuant to which the Shenji Investors will invest an aggregate of RMB2.257 billion in cash to subscribe for Shenji’s newly issued shares (the “Investment Transaction”). Shenji is primarily responsible for NIO’s intelligent-driving chip related business. The Investment Transaction is subject to customary closing conditions. Upon completion of the Investment Transaction, a subsidiary of NIO will continue to hold a controlling equity interest of 62.7% in Shenji and NIO will continue to consolidate its financial results. The Shenji investors will collectively hold 27.3% of Shenji’s equity interest. Certain entities holding shares to administer Shenji’s share incentive plan will collectively hold the remaining 10.0% of Shenji’s equity interest.</p>\n<p align=\"justify\"><strong>About NIO Inc.</strong></p>\n<p align=\"justify\">NIO Inc. is a pioneer and a leading company in the global smart electric vehicle market. Founded in November 2014, NIO aspires to shape a sustainable and brighter future with the mission of “Blue Sky Coming”. NIO envisions itself as a user enterprise where innovative technology meets experience excellence. NIO designs, develops, manufactures and sells smart electric vehicles, driving innovations in next-generation core technologies. NIO distinguishes itself through continuous technological breakthroughs and innovations, exceptional products and services, and a community for shared growth. NIO provides premium smart electric vehicles under the NIO brand, family-oriented smart electric vehicles through the ONVO brand, and small smart high-end electric cars with the FIREFLY brand.</p>\n<p align=\"justify\"><strong>Safe Harbor Statement</strong></p>\n<p align=\"justify\">This press release contains statements that may constitute “forward-looking” statements pursuant to the “safe harbor” provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as “will,” “expects,” “anticipates,” “aims,” “future,” “intends,” “plans,” “believes,” “estimates,” “likely to” and similar statements. NIO may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission (the “SEC”), in its annual report to shareholders, in announcements, circulars or other publications made on the websites of each of The Stock Exchange of Hong Kong Limited (the “SEHK”) and the Singapore Exchange Securities Trading Limited (the “SGX-ST”), in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including statements about NIO’s beliefs, plans and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: NIO’s strategies; NIO’s future business development, financial condition and results of operations; NIO’s ability to develop and manufacture vehicles of sufficient quality and appeal to customers on schedule and on a large scale; its ability to ensure and expand manufacturing capacities including establishing and maintaining partnerships with third parties; its ability to provide convenient and comprehensive power solutions to its customers; the viability, growth potential and prospects of the battery swapping, BaaS, and NIO Assisted and Intelligent Driving and its subscription services; its ability to improve the technologies or develop alternative technologies in meeting evolving market demand and industry development; NIO’s ability to satisfy the mandated safety standards relating to motor vehicles; its ability to secure supply of raw materials or other components used in its vehicles; its ability to secure sufficient reservations and sales of its vehicles; its ability to control costs associated with its operations; its ability to build its current and future brands; general economic and business conditions globally and in China and assumptions underlying or related to any of the foregoing. Further information regarding these and other risks is included in NIO’s filings with the SEC and the announcements and filings on the websites of each of the SEHK and SGX-ST. All information provided in this press release is as of the date of this press release, and NIO does not undertake any obligation to update any forward-looking statement, except as required under applicable law.</p>\n<p align=\"justify\">For more information, please visit: http://ir.nio.com</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/26/nio-inc-s-subsidiary-enters-into-definitive-agreements-for-rmb2-257-billion-investment/",
            "pub_date": "2026-02-26 22:05:22",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Waymo: New City Alerts in Chicago & Charlotte",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>It’s almost like you can’t go a day without another Waymo announcement, or two. Just a day after <a href=\"https://cleantechnica.com/2026/02/24/waymo-opens-up-service-in-orlando-dallas-houston-san-antonio/\">Waymo started commercial robotaxi service in Orlando, San Antonio, Houston, and Dallas</a>, the company has shared that it is now readying a launch in Chicago and in Charlotte.</p>\n<h3 style=\"text-align: center;\">Waymo to Chicago</h3>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Chicago.jpeg\"><img alt=\"\" class=\"aligncenter size-full wp-image-368822\" decoding=\"async\" height=\"1782\" sizes=\"(max-width: 1600px) 100vw, 1600px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Chicago.jpeg\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Chicago.jpeg 1600w, https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Chicago-359x400.jpeg 359w, https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Chicago-718x800.jpeg 718w, https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Chicago-768x855.jpeg 768w, https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Chicago-1379x1536.jpeg 1379w\" width=\"1600\"/></a></p>\n<p>“It’s time for Waymo in the Windy City! Chicago is a city of culture, ambition, and an unyielding spirit of innovation, making it the perfect next stop for the World’s Most Experienced Driver™. We are excited to begin laying the early groundwork for our ride-hailing operations in Chicago, and look forward to serving the city in the future,” Waymo writes.</p>\n<p>As the 3rd most populous city in the United States, Waymo’s entry there will be a huge deal, especially since it can also be a very snowy city. Proving itself in Chicago could be a big marker for the robotaxi company. The service will surely launch in a rather narrow area of Chicago, but hopefully it will expand rapidly and cover most of the metro area before too long.</p>\n<p>As one of the largest cities in the country, Chicago also has its fair share of nightlife, and that, unfortunately, means drunk driving and resulting accidents, injuries, and even deaths. If Waymo can help prevent such things, that would go a long way in helping the people of Chicago — even if Donald Trump and his administration <a href=\"https://cleantechnica.com/2026/02/25/trump-epa-value-of-human-life-is-0/\">value a human life at $0.00</a>. “Roadway safety across all of Illinois is quite simply one of the most important issues today,” said Erin Doherty, Regional Executive Director, Mothers Against Drunk Driving Illinois. “Autonomous vehicles hold the exciting promise of preventing deaths and injuries caused by behavioral factors, including impaired driving, if deployed responsibly and safely and in collaboration with the right community and city stakeholders. We welcome Waymo into these new communities as another tool in the toolbox to end impaired driving.”</p>\n<h3 style=\"text-align: center;\">Waymo to Charlotte</h3>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Charlotte.jpeg\"><img alt=\"\" class=\"aligncenter size-full wp-image-368823\" decoding=\"async\" height=\"1804\" sizes=\"(max-width: 1600px) 100vw, 1600px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Charlotte.jpeg\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Charlotte.jpeg 1600w, https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Charlotte-355x400.jpeg 355w, https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Charlotte-710x800.jpeg 710w, https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Charlotte-768x866.jpeg 768w, https://cleantechnica.com/wp-content/uploads/2026/02/Waymo-Charlotte-1362x1536.jpeg 1362w\" width=\"1600\"/></a></p>\n<p>“Charlotte blends its historic charm with North Carolina’s economic dynamism. Uptown – the city’s sports hub – is surrounded by vibrant neighborhoods, from South End with its breweries and restaurants to the arts of NoDa. The Queen City is constantly redefining itself, and it’s this same forward-looking culture that makes us thrilled to announce Waymo’s intention to bring our safe, magic, fully autonomous ride-hailing to Charlotte, North Carolina,” <a href=\"https://waymo.com/blog/?modal=short-waymo-in-charlotte\">the company adds</a>.</p>\n<p>A couple of the most notable people in North Carolina and Charlotte chimed in with their enthusiasm for the news as well.</p>\n<p>“Wherever North Carolinians are traveling, safe and reliable transportation is essential,” stated North Carolina Governor Josh Stein. “We are eager to see how Waymo’s expansion into Charlotte can increase accessibility, modernize transportation, and create safer roads.”</p>\n<p>“Charlotte is a world-class city that embraces innovation and the opportunity to move forward,” added Charlotte Mayor Vi Lyles. “This announcement reflects our tireless dedication for expanded mobility, and we believe Charlotte is an excellent choice for Waymo’s next destination.”</p>\n<p>Where to next, Waymo?</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/25/waymo-new-city-alerts-in-chicago-charlotte/",
            "pub_date": "2026-02-26 14:25:35",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "AI Search is Rewriting the Cleantech Buyer’s Journey — and Many Brands Aren’t Ready",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p><em><span style=\"font-weight: 400;\">By Melissa Baldwin</span></em></p>\n<p><span style=\"font-weight: 400;\">For more than a decade, cleantech marketing has revolved around a steady playbook: rank on Google, drive website traffic, show up at events, and convert clicks to leads.</span></p>\n<p><span style=\"font-weight: 400;\">Today, that playbook must evolve to square with the rapid adoption of AI search. B2B customers are starting their buyer’s journey with AI-powered tools like ChatGPT, Gemini, and Claude. They’re asking detailed, conversational questions, comparing vendors, and forming opinions long before they ever click through to a website.</span></p>\n<p><span style=\"font-weight: 400;\">Data from HubSpot suggests that as much as 95% of the B2B buyer’s journey now happens inside AI tools. And that shift has profound implications for how cleantech companies are discovered.</span></p>\n<p><span style=\"font-weight: 400;\">To understand how prepared our sector is for this change, my firm partnered with SEO agency Rampiq to study AI visibility across 100 leading cleantech companies. What we found revealed both serious gaps and a major opportunity.</span></p>\n<h3 style=\"text-align: center;\"><b>AI Has Two Brains, and One of Them Doesn’t Remember Your Brand </b></h3>\n<p><span style=\"font-weight: 400;\">Large language models (LLMs) operate with two modes:</span></p>\n<ol>\n<li aria-level=\"1\" style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Memory, based on pre-trained data (the models are trained when a new version comes out, like 3.0 or 4.0)</span></li>\n<li aria-level=\"1\" style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Live search, where they actively scan the web for current information</span></li>\n</ol>\n<p><span style=\"font-weight: 400;\">Because live search is costlier to run, models prefer the energy and compute-saving memory responses whenever possible. That means if your company isn’t well represented in pre-trained knowledge, AI will guess, and potentially misrepresent you entirely.</span></p>\n<p><span style=\"font-weight: 400;\">This is especially risky for startup cleantech companies that lack a long internet history. When an AI doesn’t get a clear understanding of your brand during training, it may misclassify your business, confuse you with competitors, or fail to mention you at all.</span></p>\n<p><span style=\"font-weight: 400;\">If you don’t give clear direction to AI through technical direction on the backend of your site (schema, etc.), it may </span><i><span style=\"font-weight: 400;\">c</span></i><span style=\"font-weight: 400;\">ategorize your company in the wrong bucket. That could mean it’s steering the wrong stakeholders to you, judging you by the wrong criteria, or recommending you for the wrong use cases.</span></p>\n<p><span style=\"font-weight: 400;\">You can’t change what’s already in the current version of an AI model’s memory (e.g., ChatGPT 5.2). But you can influence what it learns the next time it trains the model and how accurately it represents you today when it searches the web.</span></p>\n<h3 style=\"text-align: center;\"><b>What 200 AI Audits Revealed About Cleantech Visibility</b></h3>\n<p><span style=\"font-weight: 400;\">Using a proprietary tool, we ran 200 AI visibility reports (memory and live) across 100 well-known cleantech brands.</span></p>\n<p><span style=\"font-weight: 400;\">Here are five key takeaways:</span></p>\n<p><b>First, memory is vague and differentiation appears mostly in live search.</b></p>\n<p><span style=\"font-weight: 400;\">When AI relied on memory, company descriptions were often shallow or inaccurate. When live search was utilized, recent media coverage, accurate competitor lists, and specific claims finally surfaced. The takeaway: You need to be super clear on your website about what you do, who you help, and how you help them.</span></p>\n<p><b>Second, there is a major citation gap.</b></p>\n<p><span style=\"font-weight: 400;\">Across more than 1,000 citations, we found most mentions came from company-owned channels such as websites or blogs. Far fewer came from earned media or high-authority third-party sites. But this is a missed opportunity, because a  Muck Rack analysis of 1M+ citations across ChatGPT, Claude, and Gemini found AI overwhelmingly cites non-paid content (94% of links), especially legacy and trade media outlets — suggesting that many cleantech brands are underrepresented where it matters most.</span></p>\n<p><b>Third, avoid the sea of sameness — find ways to stand out.</b></p>\n<p><span style=\"font-weight: 400;\">Sixty percent of the companies we analyzed shared overlapping taglines with at least one peer. Phrases like “powering a brighter future” could apply to almost everyone in our space. Use unique language to differentiate what you do; numeric proof points are a great way to do this.</span></p>\n<p><b>Finally, AI values mentions more than backlinks.</b></p>\n<p><span style=\"font-weight: 400;\">Traditional SEO rewards backlinks. AI rewards mentions where your company is being talked about by others. A well placed trade article can influence AI answers more than a perfectly optimized landing page. AI cares less about who links to your site and more about who talks about you, where, and what they say.</span></p>\n<h3 style=\"text-align: center;\"><b>SEO Isn’t Dead, But Visibility Has Changed</b></h3>\n<p><span style=\"font-weight: 400;\">AI search doesn’t eliminate SEO, it reshapes it.</span></p>\n<p><span style=\"font-weight: 400;\">Companies are seeing fewer website clicks because the answer is available on top of search results. But, when someone does click through to your website, those clicks are more valuable because that person is further along in their buyer’s journey when they arrive.</span></p>\n<p><span style=\"font-weight: 400;\">AI also levels the playing field. Smaller, focused companies can surface as “best answers” in AI tools even if they don’t dominate Google rankings as long as their story is well documented by trusted third parties.</span></p>\n<h3 style=\"text-align: center;\"><b>A Practical Framework to Increase AI Visibility: PACT</b></h3>\n<p><span style=\"font-weight: 400;\">To make AI visibility actionable, I’ve created a simple framework: </span><b>PACT</b></p>\n<p><b>P – Proof</b></p>\n<p><span style=\"font-weight: 400;\">Earn credibility through PR to generate media coverage, guest articles, and third-party mentions. AI trusts what others say about you more than what you say about yourself.</span></p>\n<p><b>A – Audit</b></p>\n<p><span style=\"font-weight: 400;\">Quarterly, ask multiple AI tools to describe your company, products, and competitors. Look for inaccuracies, gaps, or confusion and fix them through content and PR.</span></p>\n<p><b>C – Clarify</b></p>\n<p><span style=\"font-weight: 400;\">Escape the sea of sameness. Use specific, measurable proof points in your tagline and “About” copy. Quantifiable outcomes help both buyers and bots understand why you’re different. Be very clear about who you help and how you help them.</span></p>\n<p><b>T – Tune</b></p>\n<p><span style=\"font-weight: 400;\">Optimize the technical backend of your website for AI readability with clear structure, schema markup, and FAQs. You can build your site in a way that makes it easier for chatbots to read, discover, and understand your content.</span></p>\n<h3 style=\"text-align: center;\"><b>The Bottom Line</b></h3>\n<p><span style=\"font-weight: 400;\">AI is a game-changer. Data centers are fueling demand for electricity, creating new market opportunities for companies that produce power. And, AI tools are changing the rules of the game when it comes to business visibility and marketplace dynamics.  </span></p>\n<p><span style=\"font-weight: 400;\">The brands that win in this next phase won’t abandon SEO, they’ll expand beyond it, aligning PR, content, and technical strategy around how AI actually works. </span></p>\n\n<p><em><b>Melissa Baldwin</b><span style=\"font-weight: 400;\"> is the senior vice president of Tigercomm, a PR and marketing communications agency focused exclusively on the energy and cleantech sector. </span></em></p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/25/ai-search-is-rewriting-the-cleantech-buyers-journey-and-many-brands-arent-ready/",
            "pub_date": "2026-02-26 13:00:37",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Brazil EV Sales Report: As Local Production Ramps Up, The Latin American Giant Has Started…",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>It’s been a while since we did an article on Brazil. <a href=\"https://cleantechnica.com/2025/06/11/brazil-ev-sales-report-local-ev-production-imminent-as-sales-reach-a-new-record-in-may/\">Last time we checked in was in May 2025</a>, when total EV sales soared to 14,600 units and market share rose to 6.5%. In the next few months, sales grew slightly and market share mostly stayed between 6% and 7%, meaning there wasn’t much to really report on.</p>\n<p>This has been a long-term trend with Brazil. Sales ramped up rapidly in 2023, then stood mostly stagnant (with a slight decline) through 2024. They ramped up again in early 2025, surpassing 5% market share, only to plateau once again in the second half of the year.</p>\n<p>But the tides are changing. The forces of electrification are taking a hold onto Latin America’s largest market, and I expect this market to look different, bolder, and more promising from now on. Let’s look at Brazil’s EV market and find out what’s going on, and what are these driving forces I have such high hopes on.</p>\n<h2 style=\"text-align: center;\"><strong>Market Overview </strong></h2>\n<p>Brazil’s EV sales grew slowly but steadily through the first 11 months of 2025, with a peak in October with over 17,500 units. Then in December all hell broke loose as EVs surpassed 26,000 sales, 77% over December 2024 (which had been a record in itself). January 2026 saw a decline from December, reaching 16,671 EV sales, but January is always a slow month in Brazil’s vehicle market, and this represented a pretty solid 48% increase year on year (YoY).</p>\n\n<p>Brazil’s EV market remains dominated by PHEVs, but BEVs have also grown steadily, representing almost exactly 50% of sales last month. Through 2025, BEVs represented 44% of EV sales, and PHEVs accounted for the other 56%.</p>\n\n<p>Both December and January represented significant YoY increases in EV sales, and both also brought new records to overall EV market share, which now sits just shy of 10%. It’s interesting to note in this graph what I mentioned previously, which is Brazil’s tendency to present a sudden burst of growth (early 2024, early 2025) only to plateau for several months before another sudden burst of growth.</p>\n\n<p>Something quite notable in Brazil is that since the overall market did not grow significantly both in 2025 and in January 2026, we are actually seeing combustion-vehicle sales (ICEV+HEV+MHEV) in <em>decline.</em> Overall vehicle sales in 2025 were merely 55,000 more than in 2024. Meanwhile, EV sales grew by 58,000, pointing to a very slight decline for combustion-based vehicles. 2026 seems to be starting in a similar tone: overall sales fell by around 600 units as EV sales grew by around 5,400, meaning combustion-only cars fell by around 6,000 units. Brazil’s peak-combustion came in the early 2010’s, so we’re way past that by now, and it’s positive to see combustion-only powertrains losing ~4% net sales at the start of this year, pointing to the fact that combustion vehicles will never reach the levels they once did.</p>\n<p>Brand-wise, the market is dominated by BYD, with an impressive 59% market share. Such a primacy is common both in smaller countries and in markets just starting the path to electrification, but Brazil is huge and arguably pretty advanced, making BYD’s sustained lead all the more impressive. Following comes GWM thanks to the success of the Haval H6, and in third place we find the upcoming giant, the company trying to beat BYD at its own game all over the world: Geely. A notable mention goes to General Motors, whose strategy of re-branding Chinese EVs as Chevrolets (specifically the Chevrolet Spark EUV and the Chevrolet Captiva EV) has been reasonably successful in several markets, including this one.</p>\n\n<p>Model-wise, we see once again the absolute domination of BYD, winning gold (BYD Song), silver (BYD Dolphin Mini), and bronze (BYD Dolphin). Below follows the aforementioned Haval H6 PHEV, and in fifth place the Geely <span style=\"text-decoration: line-through;\">Geome</span> EX2, making quite the appearance in its first month on the market! A notable mention for the also recently arrived Leapmotor C10, available both in BEV and PHEV versions.</p>\n\n<h2 style=\"text-align: center;\"><strong>A Change in Tide: Local Manufacturing Explodes</strong></h2>\n<p>There’s a trend that the best informed of our readers may already be seeing here. A lot of the most sold EVs in Brazil have something in common: they’re being locally produced (or, at least, locally assembled).</p>\n<p>EV manufacturing in Brazil has ramped up at a, frankly, astonishing speed. A year ago, we were waiting for BYD to start production; today, at least three models are being locally built with ever-increasing national sourcing (Song Pro, Dolphin Mini, King) and three more are either starting local production or will do so in the coming months (Dolphin, King, Yuan Plus), as well as several Denza models later in the year. Aside from BYD, GWM is already producing the Haval H6 in its factory in Iracemápolis in both HEV and PHEV versions, and General Motors is already assembling the Spark EUV from SKD kits and will start to do the same soon with the Captiva EV (with more localized sourcing planned as sales increase). Stellantis is also starting local assembly of the Leapmotor C10 in its Ceará plant from CKD kits, and there are also rumors the Fiat Grande Panda BEV will be locally produced. Geely is poised to start local production of its best-selling <span style=\"text-decoration: line-through;\">Geome</span> EX2 and also the SUV EX5 in Renault’s plant in São José dos Pinhais. At last, GAC is planning significant investments in Brazil, which it considers the “Gate to South America.” The brand will start construction on its new plant in late 2026. Though, before that, it may start assembling CKD kits in the HPE plant in Catalao, currently building for Mitsubishi and Suzuki but operating far below capacity.</p>\n<p>There are important names missing here. Both Chery and VW have significant local presence in Brazil, yet neither of them is planning an incursion into the plug-in segment in 2026. Though, both are expanding in the non-plug-in hybrid market. The Japanese, unsurprisingly, are also missing in action despite significant local presence in Brazil, and neither Toyota nor Mitsubishi, Suzuki, or Nissan seem to be in any rush to compete in this growing market.</p>\n<p>Local production is a key component for EV adoption in protected markets, and since Brazil is steadily ramping up tariffs on EVs and even SKD and CKD kits (to eventually reach parity with those of ICEVs), there would be little hope for electric cars in this market without it. But as EV production ramps up, national leadership gains all the more incentive to support the new technologies, and the risk of adverse legislation greatly shrinks.</p>\n<h2 style=\"text-align: center;\"><strong>Final Thoughts</strong></h2>\n<p>When I decided to make this report, I was not aware of the speed at which EV production is ramping up in Brazil. I thought this country would take a while to pivot to electrification (because big ships take longer to turn and all that), but now I’m not so sure, and even if predictions are hard for such large markets, I’m hopeful we could see 50% EV share by 2030.</p>\n<p>If anything, I’m extremely surprised that Stellantis is ramping up electrification ahead of Volkswagen Group, something antipodal to their current situation in Europe. My bet would be that VW is waiting for its new platforms to come out of China, and for 2026 will focus on HEV and MHEV powertrains, which are also growing at significant rates. I can’t understand otherwise how a brand that leads electrification in Europe has chosen to stay behind in Brazil. If true (and this is a big if), this could mean VW does not trust its European-made EVs are good enough to fight the Chinese in Brazil despite a level playground there.</p>\n<p>GAC’s comments on Brazil being “the Gate to South America” serve to illustrate how Brazil could underpin the EV transition on the entire continent. All Mercosur markets plus several others are closely linked with this country, and as waivers on EV tariffs inevitably start to be phased out, the Luso-American Giant is likely to become the EV hub for South America.</p>\n<p>I mention this in every Brazil article, but I believe PHEVs will have an outsized role in this country, perhaps more than any other in the world, due to its commitment to biofuel development. I consider ethanol-based PHEVs or EREVs with 150–200 km range a completely viable niche, and just as Brazil has the largest ethanol motorcycle fleet in the world, it could become home to the largest ethanol-hybrid fleet. With longer range PHEVs and EREVs potentially reducing fuel consumption by 80% or 90%, such a scenario does not seem far-fetched at all. This, of course, would be highly dependent on how easy it becomes to install fast-charging stations, and if they rapidly become as widespread as gasoline stations are today — then BEVs may yet prevail… which would be good news, as all that ethanol is probably better invested in making jet fuel.</p>\n<p>At last, I think a very interesting thing to follow here will be the competition between traditional brands and the new Chinese competition. For now, the Chinese are obliterating, but I would expect the likes of VW, Stellantis, and perhaps even Renault to start fighting back in the near future, lest they lose their foothold on the continent. Since Brazil’s market is highly protected and the Chinese will not be able to simply import batteries and components, there’s a level playing field here that can be exploited by traditional brands, so long as they have the means to offer competitive vehicles to Brazilian and South American costumers. Despite not having a presence yet, I have higher hopes for VW than GM, as the latter relies on disconnected Chinese offers (the Spark EUV and the Captiva EV are not even from the same brand), whereas VW is building a comprehensive proprietary platform. Stellantis is betting the house on Leapmotor, but that could prove successful. And the Japanese, unsurprisingly, are missing in action.</p>\n<p>What do our readers think? Is there hope for the likes of GM, VW, or Stellantis in Brazil? What about Toyota or Nissan? And when do you think we will be reporting 50% EV sales in Brazil?</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/25/brazil-ev-sales-report-as-local-production-ramps-up-the-latin-american-giant-has-started-2026-at-9-8-ev-market-share/",
            "pub_date": "2026-02-26 11:41:09",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Wayve Attracts Fresh Investments From NVIDIA, Microsoft, Uber, & Mercedes",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>Wayve, a <a href=\"https://cleantechnica.com/2025/11/18/1st-robotaxis-on-streets-of-uk-can-you-name-the-company/\">UK based autonomous driving company</a>, announced on February 25, 2026, that it has raised $1.2 billion in a Series D investment round, bringing its post-money valuation to $8.6 billion. The funding accelerates the company’s shift from AI research leadership to scaled commercial deployment of its end-to-end AI platform, the announcement said.</p>\n<p>“Microsoft, NVIDIA and Uber participated in the round, reflecting support for Wayve’s embodied AI as a foundational software layer for deploying autonomy at a global scale. Leading global automotive manufacturers Mercedes-Benz, Nissan, and Stellantis also invested, in support of advancing Wayve’s unified AI platform spanning L2+ ‘hands off’ through L3/L4 ‘eyes off’ driving across vehicles, brands and markets.”</p>\n<h3 style=\"text-align: center;\">BMW &amp; Mercedes News</h3>\n<p>The last bit is interesting. As <a href=\"https://cleantechnica.com/2026/02/25/autonomous-driving-news-tesla-sues-bmw-bails/\">we reported earlier today</a>, Mercedes will no longer offer Level 3 autonomous driving technology on its range-topping S-Class cars. Similarly, BMW announced it also is planning to move forward with the less sophisticated driver assistance package available now on the iX3 for its top-of-the-line 7 Series cars instead of its own Level 3 technology.</p>\n<p>BMW intimated that cost was a major issue in its decision, but over green vegetable curry in the <em>CleanTechnica</em> employees lounge this afternoon, executive editor and exalted grand poohbah Zachary Shahan suggested Mercedes may have simply decided to focus on getting help from NVIDIA to develop a true fully self-driving system to compete with Tesla as quickly as possible and just stick with enhanced Level 2 until that is accomplished.</p>\n<p>“Tesla FSD can go door to door now. These other automakers surely need to find a pathway to doing the same. In-house isn’t getting it done, but pooling resources and aligning with the right companies can make it happen,” he said.</p>\n<h3 style=\"text-align: center;\">Stay In Your Lane!</h3>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2025/12/Nissan-Wayve.jpeg\"><img alt=\"\" class=\"aligncenter wp-image-365268 size-full\" decoding=\"async\" height=\"445\" sizes=\"(max-width: 800px) 100vw, 800px\" src=\"https://cleantechnica.com/wp-content/uploads/2025/12/Nissan-Wayve.jpeg\" srcset=\"https://cleantechnica.com/wp-content/uploads/2025/12/Nissan-Wayve.jpeg 800w, https://cleantechnica.com/wp-content/uploads/2025/12/Nissan-Wayve-400x223.jpeg 400w, https://cleantechnica.com/wp-content/uploads/2025/12/Nissan-Wayve-768x427.jpeg 768w\" width=\"800\"/></a></p>\n<p>Zachary has a point. Car companies are good at building cars. They are not necessarily good at designing computer systems. At the beginning of the EV revolution, the companies assumed they would manufacture their own batteries the way they produced engine blocks, camshafts, and transmissions. Ten years later, most of them are leaving battery manufacturing to the experts rather than trying to reinvent the wheel.</p>\n<p>In a press release, Wayve said it “pioneered the application of end-to-end AI to autonomous driving in 2017 and has since industrialized its safety-by-design architecture into a production-ready autonomy platform.</p>\n<p style=\"padding-left: 40px;\">“From 2026, consumers will experience Wayve-powered robotaxis through commercial trials with Uber. From 2027, they will be able to buy passenger vehicles equipped with Wayve’s AI Driver, starting with L2+ “hands-off” capability that allows the vehicle to steer, navigate and respond to traffic under driver supervision.</p>\n<p style=\"padding-left: 40px;\">“Wayve licenses its <a href=\"https://cleantechnica.com/2025/12/10/nissan-wayve-sign-definitive-agreements-to-deliver-next-generation-driver-assistance-technology/\">AI Driver directly to automakers</a>, providing tools to customize driving models for specific vehicles and brands. The system runs entirely on onboard vehicle computers and embedded sensors, and doesn’t rely on high definition maps or location-specific engineering. By partnering with automakers and mobility platforms rather than vertically integrating, Wayve enables autonomy to scale globally with lower capital intensity.</p>\n<p style=\"padding-left: 40px;\">“In the past year, Wayve became the first and only AV developer to drive zero-shot in more than 500 cities across Europe, North America and Japan, meaning without city specific fine tuning before deployment. That performance is enabled by Wayve’s foundation model trained on globally diverse data spanning over 70 countries and a wide range of vehicle platforms, creating unmatched data diversity that allows autonomy to generalize to new markets.”</p>\n<h3 style=\"text-align: center;\">Zero-Shot</h3>\n<p>“Zero-shot” raised a few eyebrows among the cognoscenti here at <em>CleanTechnica</em>. Most of us didn’t know what the term meant, so we did what our grandmothers always told us to do — we looked it up. The folks at IBM were happy to help us out with this definition: “Zero-shot learning (ZSL) is a machine learning scenario in which an AI model is trained to recognize and categorize objects or concepts without having seen any examples of those categories or concepts beforehand.” We learn something new every day!</p>\n<p>Uber has committed an additional $300,000,000 to support multi-year deployments of Wayve-powered robotaxis on the Uber network, with plans to scale to more than 10 markets globally. The companies plan to launch their first service in London in 2026, with broader international rollout to follow. Under the partnership, Wayve will deploy its AI Driver in L4-capable vehicles from participating automakers, while Uber will own and operate the fleet, creating a scalable model for autonomous ride-hailing using mass-produced vehicles.</p>\n<p>Uber CEO Dara Khosrowshahi said, “We are very proud to continue to deepen our partnership with Wayve, with plans to deploy together in more than 10 markets around the world. Wayve’s powerful end-to-end approach is purpose-built for scale, safety, and effectiveness, and we’re excited to work with them across multiple OEMs and geographies, which we’ll share more about soon.”</p>\n<p>“End-to-end AI has shifted from a research bet to the industry’s chosen path for scalable autonomy,” Wayve said in a statement. It claims to have spent almost a decade pioneering the technology into a production grade platform that can power any vehicle, anywhere. “As the industry converges on end-to-end AI, Wayve is positioned to lead its global deployment,” it says.</p>\n<h3 style=\"text-align: center;\">A Total Addressable Market Approach</h3>\n<p><em><a href=\"https://www.cnbc.com/2026/02/24/wayve-fundraise-nvidia-microsoft.html\">CNBC</a></em> reports that Wayve CEO Alex Kendall said in a statement, “We are building for a total addressable market that spans every vehicle that moves. This investment accelerates our path to widespread commercial deployment and positions us to build the autonomy layer that will power any vehicle everywhere.”</p>\n<p>The obvious question is, how will this announcement impact Tesla and its pledge to bring Level 3 or higher vehicles to market as soon as humanly possible? Zachary is of the opinion that if this succeeds and Tesla is unable to be the global leader in autonomous driving, that could have a significant negative impact on Tesla’s market valuation.</p>\n<p>There seems to be little doubt that somebody is going to crack the code for making truly autonomous vehicles — soon. It is probably no coincidence that Toronto’s Lloyd Alter today wrote on his <a href=\"https://lloydalter.substack.com/p/we-may-soon-have-70-million-boomers\">Carbon Upfront blog on Substack</a> about a question raised recently by Addison Del Mastro, who asked, “what exactly are people in a largely car-dependent country supposed to do with themselves as they age out of driving responsibly?”</p>\n<p>According to Alter, there are now 70 million Boomers whose eyesight is failing, whose reflexes are slowing, and who perhaps should no longer be in charge of driving a 2-ton projectile to the Piggly Wiggly for a quart of milk. “It is inevitable,” he says. “Take 70 million aging baby boomers and put them in big SUVs and pickup trucks on North American roads, and you have a whole lot of accidents waiting to happen.”</p>\n<p>Can Wayve address that issue effectively? We are about to find out.</p>\n\n</div>",
            "link": "https://cleantechnica.com/2026/02/25/wayve-attracts-fresh-investments-from-nvidia-microsoft-uber-mercedes/",
            "pub_date": "2026-02-26 10:10:18",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Autonomous Driving News: Tesla Sues, BMW Bails",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>Sometimes, two news stories appear on the same day that are related but are so diametrically opposed to each other that it is hard to believe they describe events in the same world. First up, Tesla has sued the state of California. Why? Because the California Office of Administrative Hearings had the audacity to suggest last year the company’s use of terms like “Autopilot” and “Full Self Driving” in its marketing constituted false advertising.</p>\n<p>Second, BMW announced it is suspending efforts to develop Level 3 autonomous driving capability. Why are the two stories related? Because Tesla lit the fuse on the autonomous driving rocket over a decade ago when it first introduced Autopilot.</p>\n<h3 style=\"text-align: center;\">Tesla &amp; California</h3>\n<p>The legal contest in California comes two months after the state’s Office of Administrative Hearings determined the DMV could temporarily suspend the company’s licenses to manufacture or sell cars in the state for 30 days. On that matter, the DMV gave Tesla wide latitude to bring itself into compliance and did not immediately suspend Tesla’s ability to produce or sell cars. Then, on February 17, 2026, the DMV decided Tesla had taken appropriate steps to bring itself into compliance and determined that no license suspension was required.</p>\n<p>But Tesla being Tesla was embarrassed, aggrieved, humiliated, and incensed by the actions of the state of California, and so it has elected to sue the state, alleging it “wrongfully and baselessly” labeled Tesla a “false advertiser” for its prior use of the terms Autopilot and Full Self Driving.</p>\n<p><em><a href=\"https://www.cnbc.com/2026/02/23/tesla-sues-california-dmv-to-reverse-false-advertising-ruling-on-fsd.html\">CNBC</a></em> reports that Tesla now uses the brand name “Full Self-Driving (Supervised)” to describe its partially automated driver assistance system, and it sells it only on a subscription basis. In the past, Tesla packaged partially automated driving features in tiers labeled Autopilot, Enhanced Autopilot, and Full Self Driving and sold the systems for an additional fee in addition to the sale price of its cars. Over the years, some features, like Autopilot, were included for free while more advanced features could be obtained at additional cost.</p>\n<p>Tesla’s owner manuals specify that drivers should not use FSD (Supervised) features without paying attention to the road. In filings with California Office of Administrative Hearings, lawyers for the state wrote that Tesla’s marketing for Autopilot and Full Self Driving falsely suggested the cars were capable of operating autonomously.</p>\n<p>Tesla’s attorneys claim the DMV never proved consumers in California were confused about whether its cars were safe to drive without a human at the wheel. They argued that when Tesla employed those brand names, “It was impossible to buy a Tesla equipped with either Autopilot or Full Self Driving Capability, or to use any of their associated features, without seeing clear and repeated statements that they do not make the vehicle autonomous.”</p>\n<p>That’s the claim. But in a trial in Florida last year, a jury awarded $243 million in actual and punitive damages in a suit involving a Tesla that blasted through a stop sign at a T intersection before striking a parked car on the other side of the road. The collision killed one person and left another with serious permanent injuries.</p>\n<p>The driver said he believed the car would stop for any obviously dangerous conditions while he searched for his missing phone. The jury clearly rejected similar arguments by Tesla’s attorneys in that case.</p>\n<p>In a separate class action lawsuit winding its way through California courts, customers who purchased FSD expecting their cars to be upgraded into robotaxi-ready vehicles over time are asking for their money back. Elon Musk is quick to accuse others of what he calls “lawfare,” but there is perhaps no one on earth more prone to using the courts to gain an advantage than he is.</p>\n<h3 style=\"text-align: center;\">BMW &amp; Mercedes End Level 3 Programs</h3>\n<p>In related news, BMW announced this week it has stopped its efforts to develop Level 3 autonomous driving technology for its 7 Series vehicles. According to Germany’s <em><a href=\"https://www.automobilwoche.de/autohersteller/bmw/amw-bmw-technologie-automatisiertes-fahren-bmw-7er/\">Automobilwoche</a></em>, the BMW 7 Series and Mercedes S-Class “were pioneers in highly automated driving at Level 3 on the international stage. That’s now history, at least for the time being. At the presentation of the new S-Class a few days ago, [Mercedes] announced that it would be removing Level 3 from its product range. Now BMW is taking a similar approach.”</p>\n<p>Cost is a significant factor. Both systems relied on expensive Lidar sensors, and even then the systems were only able to be used on motorways at relatively low speeds but not at normal cruising speeds.</p>\n<p>Going forward, BMW said it will focus on Level 2 systems that are significantly cheaper. The current Level 3 technology added €6,000 to the price of the cars. In the future, the company will offer drivers the much simpler Level 2 system used in the <a href=\"https://cleantechnica.com/2025/09/09/2026-bmw-ix3-gets-a-great-review/\">latest iX3</a>, which is available for a much more affordable €1,450.</p>\n<p>The system available in the iX3 is known as Motorway Assistant and allows drivers to take their hands off the steering wheel at speeds of up to 130 km/h, though they must remain attentive and ready to intervene — hands-off but eyes-on, in other words. It incorporates lane centering and automatic lane changing with a confirmatory glance from the driver.</p>\n<p>The package also includes City Assistant, which enables stopping at red lights and automatic acceleration when the light turns green. Further driver assistance functions for complex urban driving situations are set to be introduced via over-the-air software updates at a later date. BMW has received DCAS certification for the system, which allows it to be deployed in 60 countries.</p>\n<p>When the new S-Class is introduced later this year, it will offer MB.Drive Assist Pro, a Level 2++ driver assistance and navigation system designed to enable partially automated door-to-door driving, similar to Tesla’s FSD (Supervised).</p>\n<h3 style=\"text-align: center;\">Who Wins, Who Loses?</h3>\n<p>So, here we have two giants of the auto industry effectively saying Level 3 is a bridge too far for them, largely because the costs outweighs the benefits. Meanwhile, Tesla is continuing its single minded pursuit of autonomous driving and aggressively challenging anyone who dares oppose it. The contrast could not be more stark.</p>\n<p>Another equally stark contrast is between Tesla — which insists it can make robotaxis perform without Lidar — and Waymo — which makes multiple Lidar sensors an integral part of its self-driving systems. As of yesterday, <a href=\"https://cleantechnica.com/2026/02/24/waymo-opens-up-service-in-orlando-dallas-houston-san-antonio/\">Waymo is now operating commercially in 10 cities</a>. The takeaway seems to be that, once Musk has made up his mind to do something, there is no power on the face of the Earth that can get him to change his mind.</p>\n<p>Thomas Edison was known for being rather single minded, but when people questioned his ideas, he didn’t sue them, he just calmly carried on with whatever his current quest happened to be. Musk is more like Howard Hughes, a well respected pioneer who slowly slipped into irrelevance. We will soon know more about how the newly added <a href=\"https://cleantechnica.com/2026/02/21/the-tesla-cybercab-is-here-now-what/\">Cybercab</a> performs in the real world without human minders. Musk is promising miracles. “We’ll see,” said the Zen master.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/25/autonomous-driving-news-tesla-sues-bmw-bails/",
            "pub_date": "2026-02-26 02:55:36",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Tesla Planning 64 New Megacharging Sites Across 15 States?",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p><span style=\"font-weight: 400;\">Tesla employee Jason Gies shared this on </span><a href=\"https://www.linkedin.com/posts/jasongies_a-few-weeks-ago-i-shared-news-about-tesla-share-7432075043599314944-32lJ/\"><span style=\"font-weight: 400;\">LinkedIn recently</span></a>:</p>\n<p style=\"padding-left: 40px;\"><span style=\"font-weight: 400;\">“The full Tesla Find Us map is now live.</span></p>\n<p style=\"padding-left: 40px;\"><span style=\"font-weight: 400;\">Go look at it. This is no longer a press release. It’s geography.</span></p>\n<p style=\"padding-left: 40px;\"><span style=\"font-weight: 400;\">You can see Megachargers and coming soon sites forming a backbone across the country. Chicago is becoming a real anchor. The Southeast is filling in. Corridors are starting to connect, not just scatter pins.</span></p>\n<p style=\"padding-left: 40px;\"><span style=\"font-weight: 400;\">If you run regional or long-haul freight, this matters. Public charging gives you route flexibility. Behind-the-fence charging keeps daily operations tight. MCS alignment signals where high-power charging for Class 8 is headed.</span></p>\n<p style=\"padding-left: 40px;\"><span style=\"font-weight: 400;\">Infrastructure is starting to follow freight patterns.”</span></p>\n<p><span style=\"font-weight: 400;\">In looking at the </span><a href=\"https://www.tesla.com/findus?bounds=41.13152844710668%2C-97.78696628320314%2C31.543926624371966%2C-127.80161472070314&amp;filters=tesla_exclusive_megachargers%2Ccoming_soon_megachargers%2Ctesla_exclusive_megachargers%2Ccoming_soon_megachargers%2Call_megachargers&amp;search=megachargers\"><span style=\"font-weight: 400;\">Find Us map</span></a><span style=\"font-weight: 400;\">, there are pins with “Megacharger coming soon” labels.</span></p>\n<p><span style=\"font-weight: 400;\">Several news sites have interpreted this information to mean Tesla is planning many more Megacharger sites in various states. The website <em>Clean Trucking </em></span><a href=\"https://www.cleantrucking.com/infrastructure/charging-infastructure/article/15818033/tesla-megacharger-map-updated-64-more-semi-charging-sites\"><span style=\"font-weight: 400;\">put it this way</span></a><span style=\"font-weight: 400;\">, saying “the EV manufacturer has now updated its “Find Us” map to include 64 additional charging sites across 15 states.”</span></p>\n<p><span style=\"font-weight: 400;\">It was just three weeks ago that Pilot announced more Tesla Megachargers will be installed at its </span><span style=\"font-weight: 400;\">retail sites</span><span style=\"font-weight: 400;\">, as <a href=\"https://cleantechnica.com/2026/02/01/tesla-semi-chargers-planned-for-pilot-travel-centers/\">reported here on <em>CleanTechnica</em></a>. “The Pilot Travel Centers receiving the new Tesla semi chargers will have 4 to 8 charging stalls per center. Each charger will be able to deliver 1.2 MW of power. The new chargers are intended for Tesla Semis, but in the future they may be augmented for compatibility with other electric “big rig” trucks.”</span></p>\n<p><span style=\"font-weight: 400;\">For those of us interested in sustainability, we know electrification of overland shipping plays a significant role in reducing harmful air pollution and it can cost less than continuing to use fossil fuels, because electricity can cost less and electric motors are more efficient. </span><span style=\"font-weight: 400;\"><br/>\n</span><span style=\"font-weight: 400;\"><br/>\n</span><span style=\"font-weight: 400;\">Electric vehicles also have benefits such as providing backup electricity to grids when they are used in virtual power plants. Drivers of ‘big rigs’ that are only electric also do not have to expose themselves to diesel fumes when refueling and are not exposed to diesel fumes and exhaust when driving. There is another benefit: diesel trucks sometimes spend a great deal of time idling, and while they are idling they generate toxic air pollution even though they are not going anywhere. Electric trucks can simply be turned off when not in use so they don’t consume any electricity.</span></p>\n<p><span style=\"font-weight: 400;\">I hope the Tesla Semi does enter high-volume production this year and it proves to be a winner of a semi-truck with adequate range and energy efficiency. At same time, having ‘coming soon’ labels on an online map does not have to mean all those proposed charging sites will have real chargers installed and operating soon. I hope they are installed, but at this time I am a bit skeptical.</span></p>\n<p><span style=\"font-weight: 400;\">I am not saying Tesla is doing this, however, I have seen some companies make public announcements which overpromise and then they don’t follow through fully.</span></p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/25/tesla-planning-64-new-megacharging-sites-across-15-states/",
            "pub_date": "2026-02-26 00:41:37",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Used EV Sales Show Us That EVs Aren’t Stalling Out",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>If you have opened a newspaper or scrolled through your news feed lately, you have likely seen the headlines. “EV Sales Stalling.” “Inventory Piling Up.” “Americans Reject Electric Cars.”</p>\n<p>It seems like a compelling narrative, largely because you see it EVERYWHERE. Media outlets that are openly in the bag for fascism and big oil are beating that drum almost every day. More subtle are the little jabs from local news outlets that maintain the appearance of political neutrality, but have been bought up by billionaires and conservative investors looking to suck up to the boss. There are also hordes of AI-powered fake social media accounts trying to convince us all that the hatred for EVs is a grassroots phenomenon.</p>\n<p>But if you dig into the actual sales data from January 2026, you realize that this story isn’t just misleading, it’s flat-out wrong. Demand for electric vehicles hasn’t stalled (even if the rate of growth in sales has slowed). It has just moved to a place where corporate media rarely looks: the used car lot.</p>\n<h3 style=\"text-align: center;\">The Invisible Boom</h3>\n<p>While automakers wring their hands over slowing growth rates for $50,000+ new trucks and SUVs, the secondary market is exploding. According to the <a href=\"https://www.coxautoinc.com/insights-hub/ev-market-monitor-january-2026/\">latest market data from Cox Automotive</a>, used EV sales jumped 21.2% in January 2026 compared to last year.</p>\n<p>That isn’t a “stall.” That is most definitely a boom. And it is happening for one simple, undeniable reason: The price is finally right.</p>\n<h3 style=\"text-align: center;\">The “Price Flip” Has Arrived, But With Zero Fanfare</h3>\n<p>For years, we have been waiting for the moment when an EV would cost the same as a gas car, and not just in terms of TCO (total cost of ownership), which most buyers don’t pay attention to. I’m talking about the actual out-the-door price going below what you’d pay for a comparable ICE vehicle from a dealer.</p>\n<p>Here’s the thing: we blew past that milestone in late 2025 without anyone noticing. Data shows the price gap between used EVs and gas cars has narrowed to a historic low. For many buyers, the “more expensive” used EV is now the cheaper option, sometimes by thousands of dollars. On average, EVs are now beating their used fossil fuel counterparts by over $3,000 BEFORE considering the lower cost of operation.</p>\n<p>This flips the entire “EVs are too expensive” script on its head. When a family can save thousands up front and cut their fuel bill in half or better by choosing electric, the “ideological” resistance to EVs tends to evaporate pretty quickly. The data proves that buyers aren’t rejecting the technology when it’s within reach.</p>\n<h3 style=\"text-align: center;\">These Aren’t Degraded Clunkers</h3>\n<p>The most common counter-argument I hear is, “Sure, they’re cheap, but who wants a 10-year-old EV with a degraded battery?”</p>\n<p>That might have been true five years ago, but the market has changed. The inventory flooding dealer lots right now isn’t made up of tired first-gen LEAFs with 30 miles of EV range on the guess-o-meter and maybe 15–20 on the road. We’re talking about next to new vehicles with useful range and charging speeds.</p>\n<p>Data from <a href=\"https://www.recurrentauto.com/research/used-electric-vehicle-buying-report\">Recurrent Auto</a> shows that 55% of used EV inventory is from the 2023 model year or newer.</p>\n<p>We are talking about cars that are barely two years old. These are lease returns from the peak “loophole” era of 2023–2024. They have modern thermal management, 250+ miles of range, and battery warranties that are still valid for another 6–8 years.</p>\n<p>In other words, buyers aren’t picking through scraps. They are picking up nearly-new technology for 40–50% off MSRP after someone else took the depreciation hit.</p>\n<h3 style=\"text-align: center;\">The “LEAF Killers” Are Real</h3>\n<p>This context is exactly why Nissan had to cancel that $27,000 “Cheap LEAF” we talked about yesterday. Against this used market, a stripped-down new car never stood a chance.</p>\n<p>Just look at what that same $20,000–$25,000 budget gets you in the real world right now:</p>\n<ul>\n<li><a href=\"https://www.edmunds.com/tesla-model-3-under-25000/\">Used Tesla Model 3 (2021–2023)</a>: You can now easily find these for $22,000–$25,000. That gets you access to the Supercharger network, 270+ miles of range, and 250 kW charging speeds.</li>\n<li><a href=\"https://www.edmunds.com/chevrolet-bolt-euv-under-20000/\">Used Chevy Bolt EUV (2022–2023)</a>: If you just need a reliable commuter, these are trading hands for $16,000–$19,000. That is an insanely good value for a car with 247 miles of range and liquid cooling that can handle Phoenix temperatures.</li>\n<li><a href=\"https://www.cars.com/shopping/hyundai-ioniq_5/price-under-30000/\">Used Hyundai Ioniq 5 (2022)</a>: We are finally seeing early examples dip into the $25,000 range. That is an 800-volt charging architecture—capable of 10-80% charges in 18 minutes—for the price of a base Honda Civic.</li>\n</ul>\n<h3 style=\"text-align: center;\">Final Thoughts</h3>\n<p>The explosion of the used market proves that the “demand problem” is a myth. Americans are buying EVs in record numbers. They are just refusing to pay the “Early Adopter Tax” anymore.</p>\n<p>This sends a clear signal to manufacturers. The days of de-contenting cars to hit a price point are over. You can’t sell a compromised “budget” EV when the used market is offering uncompromised flagships for the same price.</p>\n<p>The challenge for the next generation of EVs isn’t to convince people to buy them. The challenge is to build a new EV that offers better value than a comparable ICE vehicle. With battery prices continuing to fall, this is a goal that’s within reach.</p>\n<p><em>Featured Image: A Bolt EUV I used to own driving in the mountains of southern New Mexico. You can get these CHEAP now!</em></p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/25/used-ev-sales-show-us-that-evs-arent-stalling-out/",
            "pub_date": "2026-02-25 23:25:12",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Electric Vehicle Adoption Is On The Rise — Even If Tesla Sales Are Uneven",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>Tesla was once the best electric vehicle available for purchase. That’s <a href=\"https://cleantechnica.com/2026/02/21/tesla-sales-declined-11-4-in-california-in-2025/\">changed</a> as more manufacturers have entered the marketplace. Still, a tension seems to exist in which some automakers are scaling up both luxury and mass market brand EVs, while others are limiting or cancelling production plans altogether. You’d think that such uncertainty would be pessimistic for electric vehicle adoption.</p>\n<p>Not so fast.</p>\n<p style=\"text-align: left;\">The sum total direction of the EV market does depend on the evolving status of EV charging infrastructure and the fluidity of US federal policies. However, numbers are emerging here at the end of Q1 2026 that paint a much rosier picture of EV sales and satisfaction than pundits had predicted.</p>\n<p><span id=\"more-363899\"></span></p>\n<h3 style=\"text-align: center;\">Stronger-than-Anticipated EV Sales Trends</h3>\n<p style=\"text-align: left;\">Electric vehicles offer a sustainable transport future due to their zero carbon releases, low sound, high efficiency, and flexibility in grid integration. For consumers who are concerned about climate change, EVs have a real allure. In fact, a first quarter 2026 report from <em>Recurrent</em> reveals that used EV sales have risen sharply. That comes as a bit of a surprise to some who interpreted the termination of US federal tax credits as a death knell to electric vehicle adoption.</p>\n<p style=\"text-align: left;\">While many forecasts correctly projected a loss of momentum in new EV sales in Q4 2025 — after all, it was a period of six years of steady growth — recent used EV sector numbers have been quite positive.</p>\n<ul>\n<li>December sales were up 10.2% year over year.</li>\n<li>December sales rose 9.7% from November.</li>\n<li>Total 2025 used EV sales increased 35% from 2024.</li>\n</ul>\n<p>The report goes so far as to recommend to dealerships that they capitalize on used EVs. By January, 56% of inventory was under $30,000, and 30% of these lower entry point vehicles were from 2023 or newer. Of EVs from all price segments, 55% of vehicles were 2023 or newer model years.</p>\n<p>Tesla’s long market lead is reflected in overall pre-owned market share: 30% inventory are from the <a href=\"https://cleantechnica.com/2026/02/13/is-tesla-really-in-trouble-this-time/\">Tesla brand</a>, which demonstrates price stability both before and after the tax credits ended. (A side note suggested that the announcement about Model X and Model S discontinuation may affect their residuals).</p>\n<ul>\n<li>13.74% — Model 3 — $26,755.90</li>\n<li>9.33% — Model Y — $32,712.00</li>\n<li>3.92% — Model S — $39,872.93</li>\n<li>2.38% — Model X — $48,384.82</li>\n</ul>\n<p>Used EV inventory offerings remain well poised to compete with internal combustion engine (ICE) vehicles, offering newer models and low mileage on lease returns. There aren’t a whole lot of $20,000 and below ICE vehicles for purchase, so used EVs seem more and more appealing to an entry-level auto consumer.</p>\n<ul>\n<li>55% are 2023 or newer;</li>\n<li>68% are 2022 or newer;</li>\n<li>82% are 2020 or newer; and,</li>\n<li>39% of models sell for under $25,000.</li>\n</ul>\n<h3 style=\"text-align: center;\">Baby, You Can Drive My Car</h3>\n<p>Moreover, <a href=\"https://cleantechnica.com/2026/02/20/jd-power-ev-owners-are-ridiculously-satisfied-with-their-cars/\">current EV owners are more satisfied with their vehicles than ever before</a>, according to JD Power’s 2026 US Electric Vehicle Experience (EVX) Ownership Study. The <a href=\"https://cleantechnica.com/2026/02/22/tesla-still-dominates-california-ev-sales-and-tesla-still-massively-supported-by-california/\">Tesla Model 3 and the Tesla Model Y</a> receive first and second place satisfaction slots, while the BMW i4 ranks third. Key findings of the study include:</p>\n<ul>\n<li>Public charging satisfaction climbs to new highs.</li>\n<li>Premium battery electric vehicles (BEVs) see more pronounced quality improvements.</li>\n<li>BEVs continue to have higher satisfaction than plug-in hybrid electric vehicles (PHEVs).</li>\n<li>EVs significantly outperform plug-in hybrids in both premium and mass-market categories. This last bit of data illuminates a critical shift: consumers are increasingly bypassing transitional hybrid technologies and moving directly to full electric vehicles.</li>\n</ul>\n<p>Brent Gruber, executive director of EV practice at JD Power, says that, while EV market share has seen some declines after the demise of federal tax credits, that dip doesn’t tell the whole story. In fact, customer satisfaction among owners of new EVs continues to grow.</p>\n<p style=\"padding-left: 40px;\">“Improvements in battery technology, charging infrastructure, and overall vehicle performance have driven customer satisfaction to its highest level ever. What’s more, the vast majority of current EV owners say they will consider purchasing another EV for their next vehicle, regardless of whether they benefited from the now-expired federal tax credit.”</p>\n<p>A December 2025 <em>Consumer Reports</em> release supports such data analysis. <em>CR</em> says that EV automakers Rivian and BMW sit at the top of the brand satisfaction list. Some others who follow closely behind continue from last year’s top 10 list: Tesla, Ford, Genesis, and Lexus.</p>\n<p>This is high praise for consumers who were asked one specific question: “Based on price, performance, reliability, comfort, enjoyment, etc., if given the chance to do it again, would you buy the same vehicle?”</p>\n<h3 style=\"text-align: center;\">Was NEVI, Actually, a Success?</h3>\n<p>ICE cars and trucks are major sources of carbon emissions. Part of the equation for successful electric vehicle adoption rests with available and reliable <a href=\"https://cleantechnica.com/2026/02/20/100-million-in-funding-announced-for-new-public-ev-chargers-in-pennsylvania/\">charging infrastructure</a>. Sure, former President Joe Biden’s $5 billion plan to build EV charging stations took longer than expected. The National Electric Vehicle Infrastructure (NEVI) program had many stop-gap measures in place before actual charging would begin, such as built-in requirements to boost union labor standards and to compete with China.</p>\n<p>Federal and state bureaucracy slowed construction.</p>\n<p>“They spent $9 billion on eight chargers,” once-and-future King Donald J. Trump said during his 2024 reelection bid, “three of which didn’t work.” As usual, Trump’s <a href=\"https://cleantechnica.com/2025/06/27/a-primer-on-nevi-funds-and-why-you-should-care-about-them/\">NEVI numbers</a> were way off on all counts.</p>\n<p>Early on, the <a href=\"https://cleantechnica.com/2026/01/29/18000-new-fast-ev-chargers-were-installed-in-the-us-in-2025/\">lack of public charging stations</a> made some potential EV buyers wary. But <a href=\"https://cleantechnica.com/2025/08/17/gas-station-owners-are-smiling-at-the-return-of-nevi-and-so-are-ev-advocates/\">NEVI has been resilient</a>, even with Trump’s threats to freeze the program. Its original specific detail, immersion into planned spending, and Congressional approval survived a court challenge and held on. The International Brotherhood of Electrical Workers union endorsed NEVI, too, due to the requirement that electrical workers building stations would have to receive apprenticeship training. Training takes time but also ensures qualified installers.</p>\n<p>Biden had called for 500,000 US charging stations by 2030. NEVI “forced the entire industry to raise its game around reliability, redundancy and performance that will be remembered as an important legacy,” says Nick Nigro, the founder of Atlas Public Policy, which studies the EV charging network<em>. </em></p>\n<h3 style=\"text-align: center;\">Final Thoughts about Electric Vehicle Adoption</h3>\n<p>This week Uber said that it would offer incentives to other companies to install electric vehicle chargers in the US and Europe. This has real potential to increase EV appeal to new audiences as the EV market tries to restabilize after Trump administration <a href=\"https://cleantechnica.com/2025/10/06/the-economics-of-renewables-the-bottom-line-is-often-hidden-by-hyperbole/\">clean energy policy changes</a>.</p>\n<p>Uber has guaranteed minimum charging times to companies if these chargers are installed in neighborhoods where its drivers live, or if the location is a frequent pickup/dropoff site for passengers. With this caveat, charging companies should be able to recover upfront investment costs more quickly than the NEVI program.</p>\n<p>NEVI’s goal “of spurring a well-functioning charging system with common standards,” says David Ferris, writing for <em>Politico</em>, “is becoming a commercial reality.”</p>\n<p><strong>Resources</strong></p>\n<ul>\n<li>“EV owner satisfaction climbs to new high amid sales slump, JD Power finds.” February 16, 2026. <a href=\"https://www.jdpower.com/business/press-releases/2026-us-electric-vehicle-experience-evx-ownership-study\">JD Power.</a></li>\n<li>“Livestream: The hype, reality, and future of EVs.” Aarian Marshall and Jeremy White. <em>Wired</em>. February 13, 2026.</li>\n<li>“Owner satisfaction ratings: Best and worst car brands revealed.” Jon Linkov. <em>Consumer Reports</em>. December 4, 2025.</li>\n<li>“Used electric car prices &amp; market report — Q1 2026.” Liz Najman. <em>Recurrent</em>. February 11, 2026.</li>\n<li>“Used EV sales are red hot despite end of federal tax credits.” Julie Walker. <em>Daily News</em>. February 17, 2026.</li>\n<li>“Uber will offer incentives for EV charger construction.” Jack Ewing. <em>New York Times</em>. February 18, 2026.</li>\n<li>“Why Trump couldn’t stop the electric vehicle dream.” David Ferris. <em>Politico</em>. November 14, 2025.</li>\n</ul>\n</div>",
            "link": "https://cleantechnica.com/2026/02/25/electric-vehicle-adoption-is-on-the-rise-even-if-tesla-sales-are-uneven/",
            "pub_date": "2026-02-25 22:19:59",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        }
    ]
}